{"id": 361, "title": "The Hobbit: An Unexpected Journey", "starring": ["Ian McKellen", "Martin Freeman"], "runtime": 169, "genre": ["Adventure", "Fantasy", "Action"], "description": "Bilbo Baggins, a hobbit enjoying his quiet life, is swept into an epic quest by Gandalf the Grey and thirteen dwarves who seek to reclaim their mountain home from Smaug, the dragon.", "releaseYear": "2012", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/yHA9Fc37VmpUA5UncTxxo3rTGVA.jpg", "categories": {"plot": 7.395833333333333, "acting": 7.888888888888889, "ending": 7.166666666666667, "soundtrack": 9.75, "cinematography": 7.666666666666667, "familyFriendly": 6.0, "funny": 6.9, "action": 7.833333333333333}, "reviews": [{"rating": "7", "text": "I quite liked this movie, but it could have been better. The original Lord of the Rings movies did not use CGI unless it was necessary. The orcs were men in costume and makeup, which made Jackson's depiction of middle earth seem more real somehow. In this new film, Jackson uses CGI as a crutch (nearly every creature is computer generated), and it hurts the continuity and flow of the story. This movie is pretty sweet in its own way, but if the creators had stuck with their original pattern (more make up and costumes, and less CGI) I would have thought it flawless. It's certainly enjoyable, and I'm looking forward to the next two installments, but I don't feel like this can be categorized as a classic."}, {"rating": "9", "text": "Going into the theater for the midnight showing I was eager to see the film but afraid. I had been burned by Star Wars Episode 1 some 13 years ago and was worried I would once again feel the harsh sting of disappointment by high expectations. I was pleasantly surprised.\r First off, I must say that it's a miracle that this film was even made, never mind by Peter Jackson and the crew responsible for the Lord of the Rings Trilogy. After being in \"Production Hell\" for what felt like years, word got out it was finally being made. I was excited but weary of the director who I have had the misfortune of not seeing any of his films which I hear are great. Then said director bailed on the project completely. All hope seemed lost, but like the great wizard Gandalf, Peter Jackson himself stepped in to save the day and my expectations went through the roof.\r So what happened between that, the trailers, and opening night that got me so worried? Reviews. What did I read? \"The CGI makes all the creatures look fake, the cameos are pointless, the movie is too long, too childish etc. So the point being is that this movie is Episode 1 all over again, Peter Jackson has lost his edge and Middle-Earth as we know it has be scared beyond recognition. After seeing the film I can tell you that while I can see the critics points ultimately they are nitpicking an otherwise great film. Never mind unfairly comparing this lone film to an entire trilogy.\r So lets get down to the meat of this review. The Hobbit: An Unexpected Journey is a great film. It's fun, exciting, emotional, and all the things I expected from the first installment of a new trilogy set in the LOTR universe. Gandalf the Grey is the old wizard you remember from the Fellowship of the Ring and I found him to be as likable as ever, the same goes for other returning characters such as Old Bilbo, Frodo, Elrond, and even Saruman. Somehow age has not slowed these actors down a bit and aside from a few easily overlooked extra wrinkles these are the exact same characters we met in the original LOTR trilogy.\r As for the new characters, the 13 dwarfs are surprisingly fun to watch. I was so afraid we would have 13 Gimlis on screen at all times and the movie would be crippled by this but instead we get a band of likable characters reminiscent of the fellowship from the first LOTR film. A few dwarves stand out while the rest feel second-tier but that's to be expected with such a large cast and doesn't detract from the film as a whole.\r It wouldn't be Middle-Earth without a few notable bad guys to talk about and this movie has a few. From the dragon Smaug who we only get a glimpse of in the film to the lead dwarf Thorins arch nemesis Azog. This character looks the most artificial of all the CGI creatures in the movie but when I think about it I'm not sure they could convey such emotion (raw hatred) in the wretch any other way. Either way he is the main villain for the first part of this story and is as menacing as any enemy the fellowship came face to face with in LOTR. Speaking of menacing CGI villains I have to talk about Gollum. He is the same creature we all know from The Two Towers and Return of the King but this time he is better portrayed as an evil monster that we should fear rather than the menacing, sometimes comical, creature he was in LOTR. I'm trying to keep this review spoiler free so all Ill say is the movie wastes no time in reminding you that Gollum is not there for a comic relief cameo. He was part of The Hobbit to begin with and is treated as such.\r The movie is around 3 hours long and while any unengaged viewer might find that too long to sit still, any fan will tell you that the film isn't long enough. It's pacing is extremely similar to the extended version of The Fellowship of the Ring. Again, not spoiling things, but if you can sit though and enjoy that film you will have no problem with An Unexpected Journey. The adventure proper doesn't start until nearly 45 minutes into the film, leaving plenty of time to introduce you to the characters and the nature of the the main character Bilbo Baggins. Speaking a which...\r Martin Freeman plays him perfectly and not once to you feel like he is either playing a young Ian Holm, playing Bilbo or trying to make the character his own unique entity. Ultimately Freeman's Bilbo is the character we saw in LOTR, read about in the books, and is the ideal image of Bilbo Baggins. If you didn't care for him in LOTR you will develop a new appreciation for him through this new trilogy.\r The Hobbit finally has a proper representation on film and fits almost seamlessly with the LOTR Trilogy. I can easily recommend this film to any fan of the books, movies, or anyone looking for a great action adventure film. I can't wait to see the next two films and plan on seeing The Hobbit: An Unexpected Journey again."}, {"rating": "10", "text": "Can't believe the critic score, what the hell is this 58? It is an excellent and brilliant movie, technically and brilliantly directed. The first thing that we need to do is to see this movie without the idea that we are seeing Lord of the Rings because it is based in a novel that was made for child. Evidently it is not a movie for child but it has points of humor and a different essence from the las triology. Personally, I found this film one of the best of the year and I don't understand how films that are completely bullshi* has good punctuations and this one no."}, {"rating": "10", "text": "People will always be buthurt about things, that is beyond doubt. Sometimes the buthurt has a good reason to be there like the prequels to starwars or all of mass effect 3 but in the case of the Hobbit the buthurt has credible stance to take in the bashing of this glorious film.  The Hobbit is made from an earlier book of Tolkien's, a lighthearted approach to Lotr, it is not a carbon copy of the original trilogy nor is it a movie made for children. The film has more concentration over visuals then the previous films yet it does not sacrifice the plot in any way, the actors blend in with the CGI very organically. The film may drag on for a bit but so did the fellowship, two towers and return of the king. The 40 fps looks good and the criticism for it seems a bit unfounded.\r I don't want to sound like I am praising this film too much because it had some minor issues of pacing at the start and the ending made me wish that I would not have to wait a year to get to part 2 of the trilogy.\r Over all its a great film, I think peter Jackson just forgot to bribe the reviewers, To put it into some context the \"critic\" score for this film is only 2 points higher then that of the first twilight which is very very strange to me."}, {"rating": "9", "text": "Honestly I had doubts about this movie, I thought Peter Jackson could lose the \"touch\" after all this years, but The Hobbit: An unexpected journey\" it's an amazing movie! It brings that nostalgic feeling watching the same actors from ten years ago, the 48fps seems quite nice and easy to adapt to it, good soundtracks from Howard Shore, good acting & setting, they included parts (and will keep including parts) from other Tolkien stories for example The White Council, the investigation of Dol Guldur, etc etc..I LOVED this movie.\r But yes, its not perfect, it have flaws...very slow paced movie (at the first half of the movie) some details were irrelevant and could have been omitted until the Extended Edition release, Radagast felt weak portrayed, there were more-than-necessary cheesy quotes that I hope they avoid in the next films..\rI understand if people didnt like this movie but after reading some reviews most of them have biased \"facts\" and a 0 score, really? Anyways...it is a great movie, I expected less but it surpassed my expectations, I recommend it."}, {"rating": "10", "text": "First of all, the professional critics who gave this movie below a 65, you are shortsighted whining idiots. I've seen The Hobbit in IMAX 3D HFR and it was awesome. Okay the HFR is something to get used to, especially when the camera is moving it looks like it is played in fast forward. But the images itself look beautiful sharp. The CG looked pitch perfect, so i don't know if i wanna see every movie in HFR but i can see a bright future for all high end CG movies like Avatar in 48fps. A lot of critics are complaining about the slow pace in the beginning, but that is exaggerated, it is entertaining from start to finish. After 25 minutes you are thrown in the adventure and it doesn't let go of you, foregoing from the funny scene's with the drarves in the beginning.The story is great and characters are all very good and very likeable. Martin Freeman as Jong Bilbo is the more then perfect person for the role. The cinematography is top notch, Andrew Lesnie you are legend. The scène riddles in the dark was awesome and Gollum OMG does CG ever gonna get better. Everyone go see this film and Peter Jackson and crew thank you for letting us visit beautiful Middle Earth again."}, {"rating": "10", "text": "The long beginning the critics oucked on is obviously there to introduce us to the family of dwarves, something peter jackson couldnt do once the action kicks in and without it we wouldn't care for the characters. After repeated viewings nearly all the dwarves get their moment except one or two, plus the beginning isn't as long as lord if the rings which was universally praised for doing the same thing and introducing us to the hobbits.\r Anyway this is a great thrill ride, the added bits add greatly to the story, I loved the rivendell scenes, which tied in lovely with the LOTR and azog was a good character.\r There's a couple of instances that stumble, the last bit of dialogue from the goblin king was a touch too much and radaghast whilst you warm to him on repeated viewings was a bit silly when he first meets up with the gang.\r Anyway these minor quibbles don't stop this being a full marks movie and I can't wait for the second one."}, {"rating": "7", "text": "I'm certainly not going to tell you to not see this movie. Peter Jackson proves that he's at a higher caliber of production than most filmmakers these days. However, compared to his previous works, especially The Lord of the Rings trilogy, The Hobbit is lacking. The pacing is jagged, and flip-flops between fast jumping thst rips you out of the plot and drags in many combat scenes. Beyond that, the writers have taken plenty of liberties with the plot that only weigh it down; keeping track of all the extra info can be frustrating. However, the acting is superb, and it's hard not to invest yourself in the characters as they trek through Middle Earth. It's definitely worth seeing, but don't expect to be blown away like the first three."}, {"rating": "10", "text": "I've read the books, both The Hobbit and The Lord of the Ring long years before they started to make movies about them, and I just got at the cinema what i was waiting for. The two books were completely different, so not a great suprise that the films have a different feeling as well.  It's not a LOTR 2. The Hobbit is basicly a fairy tale, which was originally written as a fairy tale, for the kids of Tolkien. The movie is following this history, and does it well, in my oppinion. It is entertaining, and a much more lighter aproach on Middle Earth, in a time when peace and prosperity are common things, even if evil is not so far away either. It's a simple, linear story, lovable and rich of fantasy - in a fairy tail way."}, {"rating": "9", "text": "\"The Hobbit\" was a children's book that has served as a key cornerstone in the fantasy genre and a story held close to many reader's hearts. I felt that Peter Jackson's interpretation of the book has been an extraordinary cinematic experience that reminds me of the magic found in those books of old. The tone of the original novel was translated brilliantly onto the big screen, while some may find this 'journey' to be slightly trivial or child-like to the grand battle scenes of LOTR, I enjoyed the translation regardless. Technically, I enjoyed the new technology a lot (having watched it in 48 frames and 3D) while it does require a slight getting used to, the 48 frames helped create a magnificent 3D viewing that would put other epic films to shame. Another thing that should be pointed out is that the relation to LOTR was immaculately added into the plot, there are plenty nostalgic moments that will fuel the delights of old fans but is computed on a level that will not likely to isolate new ones.  There are a couple stranger moments here and there, but overall I feel confident that such a magical story is in the the tender hands of such gifted film makers. I for one, is eagerly waiting for the next segment to Bilbo's tale. (I don't know if this consists of a 'spoiler')"}, {"rating": "10", "text": "The Hobbit is based around Bilbo Baggins in his prime, where he goes, well, on an unexpected journey. After watching the enitre LoTR series, i found myself to despise Bilbo for his distasteful obsession with the ring. But after watching The Hobbit, i no longer disliked him, but actually began to like him, even more so than Frodo. The whole 48FPS deal was in my opinion, completely brilliant, although not much technical work has to be put into it to bring up the frame rate, it made the movie look much more realistic, and at times I had trouble depicting whether something was CGI or real. The 48fps makes everything much smoother and makes the cgi have life-like movements. The story for The Hobbit was not as strong as the story in the LoTR series, but i felt that it came pretty close, the movie does not contain nearly as much dialogue as the LoTR series but it definitely fulfills why we all love these movies, the fantasy aspect. Overall, i'd have to say that i enjoyed this movie slightly more than the LoTR series, In most aspects. If you are a LoTR fan, GO SEE THIS MOVIE, if you have never seen any of the LoTR movies, GO WATCH THEM, and then GO SEE THIS MOVIE."}, {"rating": "10", "text": "Truly awesome, on par with fellowship! Brilliant acting from all cast members. Bilbo, Gollum, Gandalf and Thorin and absolutely perfect. The ending will have you leaning forward out of your screen as Tolkein's Novel and Jackson's new material come crashing together in an awesome finale!"}, {"rating": "10", "text": "Simply put, this was an amazing movie to look at.  Like anything else it had it's flaws, but the 48FPS is visually stunning.  Like Avatar and 3D, this movie sets a new standard for movie making."}, {"rating": "10", "text": "First and foremost, I did not, will not and don't suggest you see this film in 3D in any form. Watch it as it was intended. That being said, this was a HELL of a kickoff for the upcoming movies and was just downright great to watch. The beginning prologue with the Fellowship tie-in was a nice addition, and the acting at all levels was superb. I will admit, there were moments where I had to keep myself awake (I'm not a midnight person at all), but that's to be expected in a film that is the first of multiple. It's a pity the Metascore is so low, somewhat shocking; this was a great film and any LOTR fan will recognize every single location in this movie - Jackson did an incredible job recreating Gollum's Cave, Goblin Town, Dale, Hobbiton, Rivendell, etc., etc."}, {"rating": "10", "text": "Is it just my impression or have these critics been drinking a lot lately? Cmon, their low knowledge about the middle earth and Tolkien's works almost freightened everyone i know away from the movie. It's an amazing movie, with plausive adaptions from the book, and just as LOTR it looks like it will get even better on the next movie. Dont you waste your time reading 'noobs' reviews, just go watch the movie. Its worth the money. A lot."}, {"rating": "9", "text": "This is a beautiful film. The 3D is the best I have seen, the 48fps help this by reducing blur and making the whole thing appear much more crisp. The little references to the trilogy and the book itself (ie chapter names in the script) show that this was a labour of love and further proof of the respect Peter Jackson has for the source material. Although I would not say it surpasses the Lord of the Rings trilogy this was an incredible film with some truly inspired scene. Needless to say Riddles in the Dark is a joy to behold."}, {"rating": "10", "text": "Just Excellent! Pure Brilliance... Definitely movie of the year! The cast are just spot on [Gotta love Radagast the Brown] and music is as ethereal as ever; simply pure genius."}, {"rating": "10", "text": "I loved every minute of this movie. I wouldn't have changed a thing. I read the hobbit 20 years ago and I am very happy with the result of this movie."}, {"rating": "10", "text": "People need to stop thinking about The Lord of the Rings when they go to watch this film. The Hobbit wasn't even written the same way as LotR by Tolkien. It's not a dark, epic drama that portends the end of an age, ultimate evil, and the tragedy of life lost: not just in battle, but of those who's souls are never the same after the grand journey (Frodo).\r It's a fun adventure featuring the races and monsters that birthed contemporary fantasy. If you go in expecting that, you will be MORE than satisfied by this film. It gets better as it goes along. It was accurate to the book, and gave us just enough of a LotR tie-in without overshadowing the main quest of The Hobbit."}, {"rating": "9", "text": "Amazing film, what the critics say is sort of right: bloated story, slow beginning, cartoony, silly action and special effects, but it is minor and you will not notice it as the exciting story and beautiful world keeps coming. Some scenes such as the spectacular Riddles in the dark are straight out of the book, but Jackson has made a few changes and added new material which on a large is also great. perfect acting all round. Everything is pretty much amazing. Just don't listen to the critics and watch it!"}, {"rating": "10", "text": "WOW. This movie is amazing. I went into the movie theatre quite worried due to critic scores, but after seeing it myself, I really would like to know what film they watched, because it wasn't The Hobbit. I'm an avid fan of J.R.R Tolkien and have all his books, and thoroughly enjoyed Peter Jacksons LOTR Trilogy. The Hobbit is simply stunning, and will be joining my collection once it comes out on DVD.\r Now onto the movie. A lot of critics have given this low scores due to its higher framerate, or complaining about the slow start. Seriously, they have never been so wrong. Although I saw it in 3D 24fps (just to be safe) I cannot understand why people are rating the movie DOWN due to the 48fps framerate. Easy option - go see it in 24fps first. The movie is NOT slow. We spend 40 minutes or so in the shire (10 minutes of that we actually enjoy an epic prologue set in Erebor) which is no different to the first LOTR. It gives us a chance to develop some of the characters and understand their motivation. There's not one part of this film which I thought 'this is slow'. It is beautifully paced. The acting is superb, especially Martin Freeman as Bilbo. The first time you see him as Bilbo, you can understand why Peter Jackson chose him. There is so many events in this film that blew me away. The stone giants, the goblin tunnels, Rivendell, the scene with Gollum (which deserves an oscar), the Prologue in Erebor, the white council with gandalf, saruman, galadriel and elrond, dol goldur, and the EAGLES. The eagles look better than ever and really blew me away. This is a lighter and more humoured middle earth, but that's what Tolkien wrote. There is peace in middle earth, so of course the world is a happier place. Thankfully though, it's not as overdosed as I thought it would be. There are maybe 1 or 2 lines which made me cringe, but that is the only downfall to this movie. Everything else is perfect.\r All of the actors do a superb job as I said previously. Radagast the brown, a slightly deranged wizard, also worried me before seeing the film. He is brilliant. He helps move the story along and also sees something I did not expect... fans of LOTR will be happy once they understand who and what he saw. The action pieces and CGI are fantastic also. The ending couldn't have been any better, with a brilliant piece of character development between Thorin and Bilbo (both of which develop brilliantly throughout the entire film) coming to a final climax, and also... I wont spoil the last shot, just go see it yourself. I can not recommend this film enough. I am so happy to have visited middle earth again and couldn't be any happier with what I saw. Do yourself a favour, ignore the critics, and go and enjoy middle earth again, because The Hobbit is one hell of a ride."}, {"rating": "10", "text": "the hobbit is a great movie the story of the movie,the affects,and the 3d for me was good a great movie but i will say that movie was very long 3 hours.so i will give the hobbit an unexpected journey 9/10 and i will recommend to you to see the movie.and i forgot to remind golum(my precious). you know what i regret about the 3 hours i will give it 10/10"}, {"rating": "10", "text": "awsome a great prequel to lord of the ring.very funny,awsome fights,a good story,golum,and amazing 3d.so i think that a great prequel to lord of the rings and i will give it 10/10."}, {"rating": "10", "text": "So, I've just seen the Hobbit. And I can honestly say that I am blown away by how good it was. I can see why the long introduction would be a problem for some people, but if you are a fan, you will appreciate it very much. Its very descriptive and atmospheric. Once you are past the 40 minute introductory mark, the fun begins, and since then, its pretty much action packed. The humor is excellent, and the actors put an awesome performance. Not to mention how beautiful the landscapes and effects are. The music is another strong side of the movie, and does not fail to bring you closer to Middle Earth.\r My final verdict 10/10."}, {"rating": "10", "text": "I hate how the reviewers base their reviews on comparisons between The Lord of the Rings and The Hobbit.\r Next time you write a review, focus on the movie itself and not the elements outside of it."}, {"rating": "10", "text": "\"The Hobbit: An Unexpected Journey\" is a great movie. The modern 3D - technology let us enter the world of Tolkien in a new dimension. Peter Jackson made a movie, which shows once again that the small ones are able to be great heroes. The soundtrack fits perfectly to the movie. I recommend you to watch this masterpiece.\rI also will watch it at least once again.\r P.S.: Please excuse my bad english, i'm from Germany ;)"}, {"rating": "10", "text": "I sometimes wonder whether or not the critics watch the same movies we do.\r The Hobbit is the first in a 3 part story based on the novel of the same name.   For those who have read the story we know that The Hobbit is a movie of great grandeur and true to the story it retells.    The acting, the script, the visuals, the music... all create a whole that is greater than the sum of their parts, delivering to use a great beginning to an unfolding epic story.   Don't miss the movie, you'll ask yourself \"did I really just sit for nearly 3 hours?  It went by so quickly!\""}, {"rating": "10", "text": "The film is one of the best movie of the last 5 years. The 3D effect is the most wonderful 3d effect i've ever seen. The story is just perfect, it feels like reading the book. Bilbo is amazing, Thorin, Gandalf, Balin, Dwalin Bifur, Bofur, Bombur, Dori, Nori, Ori, Oin Gloin, Fili, KIli. ALL perfect.\rAlso Azog and the king of the goblins are just perfect. Andy Serkis (Gollum) did a marvellous work on gollum and the scene of riddles in the dark made me cry.\rGo watching for it, you'll never be sorry for that!"}, {"rating": "10", "text": "Best movie since Lord of the Rings: Return of the King! And thats for sure it is so brilliant! Peter Jackson is really the only man to do this! I really look forward to the next chapter!"}, {"rating": "10", "text": "Wow, i almost didn't go to watch this film, what with all the bad reviews!  I'm so glad, i did now! To be honest it was a fantastic film! Welcome back to middle earth, only a year to wait for part 2! :( :("}, {"rating": "10", "text": "It has angered me critics are disgusted at the films drawn out length in terms of being a part of the lord of the rings franchise. But at the end of the day the story telling ability in this film and the beauty you find in the scenes makes it a fantastic film which definitely deserves a 10. This is a film review not a business case review!"}, {"rating": "10", "text": "Movies are done for FANS not for critics journalists! This is a amzing movie, if you are a Lord Of Rings fan you will fall in love with this one. Peter Jackson is a great director."}, {"rating": "6", "text": "The Hobbit: A Relatively Expected Journey\r Peter Jackson has submitted his first installment to the highly anticipated Hobbit Trilogy. Though i was not a huge fan of his previous work LOTR included, i was particularly interested in The Hobbit due to its resonance with me as a child. The book is sublime but the film lacked a certain depth that we have seen Jackson produce before. The acting is fantastic with Martin Freeman's performance being fulfilling and most certainly understated yet the other characters were simply unable to recreate the same level of interest and intrigue as those in the book. One can only hope that these characters are explored further in the sequels. As for the 48 FPS it was beautiful with scenery exploding vividly onto the screen and yet i cannot help but think it was just too much as if looking into an oil painting, thus some of the dialogue and action was lost amongst the various stunning backdrops. Finally and most annoyingly i must mention the length. For what is only a relatively short children's book, i cannot see how 3 films of such considerable length will be able to keep the focus of the audience whilst remaining true to the book throughout. So far so good but i expect more can come from this series and i hope that The Hobbit: The Desolation of Smaug will not be the unwanted middle child of the trilogy and emulate The Two Towers."}, {"rating": "5", "text": "Hey guys how can we make as much money as possible?, well we could release three films from the Hobbit. But there's not enough in the book to fill three films, .....don't worry we'll just buff it out with lord of the rings style content. No one will complain, as its Peter Jackson and Lord of the rings.\r And judging by the 9 and 10's I guess its worked.\r The film isn't terrible, its just not great either. Whats completely frustrating about it, is that the parts that follow the book are very good, its just all the filler stuff that ruins it. Seemingly filled with cliche comedy moments and bits that just didn't seem middle earth at all, its kind of insulting to the source material.\r If at some point they heavily edit the movie and leave just the relevant book content in, i think you would have a very good movie, but as it stands at the moment, the hobbit is an overly bloated average film that had potential to be much better ( and less drawn out and boring)."}, {"rating": "6", "text": "The Hobbit is extremely disappointing coming from a director who has accomplished so much, and knows the material so well. It is still has great moments, and for the most part is easy going adventure to watch, but come on."}, {"rating": "2", "text": "For those who have seen the film...Why it reeked. I was hugely disappointed in \"The Hobbit: An Unexpected Journey\". Instead of sticking to the children's story, which is very short compared to LOTR, Peter Jackson has added a ton of unnecessary bloat. Many of the scenes were just added to connect it with LOTR, which was not needed, such as all the scenes with Frodo. The movie starts with a huge back story, which would have been better told as the movie progressed. Thorin has a new adversary (he was mentioned in the book, but the party had no interaction with him) ...the strange white orc that slew his father. One of the changes that bothered me the most was that Bilbo is looked down upon throughout the movie, and he has to be a savior in almost every instance to prove he is worthy of the party. In the book the animosity is not nearly as bad. Bilbo does enough in the book without having to, for instance, save Thorin from the white orc. If I remember right the first thing that Bilbo kills with his new short sword in the book is a spider, and Bilbo names the sword Sting. Shouldn't Bilbo have named the sword Fang or Claw in the movie? One of the scenes that doesn't work is when Bilbo escapes from Golum, and Golum just screams instead of running after Bilbo. Why didn't Golum go after Biblo you ask? Well, in the book the goblins are guarding the way out of the mountain, and Golum didn't want to get caught. I was looking forward to see the whole party stuck up in the trees, and the goblins making fun of them with song, but this was not included. Instead of the party being almost burnt up in the trees, the problem is the trees are collapsing. After the long intro, the movie turns into a roller coaster ride. A lot of people compare it to Pirates of the Caribbean, and they are right on. This movie is more Pirate of the Caribbean, than Pirate of the Caribbean could ever be. THREE different instances of having to jump from one place to another to stay alive...The stone giants, the collapsing walkways in the mountain, and the collapsing trees! Speaking of the stone giants, hasn't Peter Jackson learned that some things are better off left for the imagination? In the book the stone giants are mentioned, almost in passing, while in the movie they ride them! It would have been great, if during the storm rocks were falling, you could hear the noise of huge rocks getting smashed...and then through the storm a slight glimpse of something made of rock moves.... Thorin, Thorin, Thorin. He does not hate the elves, he was thankful for their hospitality, and the thing he loves most is gold. In the movie they try to make him a bleeding heart for his homeland, when all he wants is the gold! He IS a dwarf for goodness sake! A new (uneeded) comedy relief was added...Radagast the wizard. Poop. Another new twist is Gandalf hearing about the necromancer. I was almost intrested in this, I think it comes straight from Tokien's notes. However, it does make the movie longer, and is the main reason we have to deal with Radagast the Gastly. The troll incident is changed, for the worst.  In the book Biblo is trying to steal something from the trolls, instead of saving the horses.  Everyone in the party gets captured except Thorin, who puts up a fight.  In the movie, everyone gives up their weapons to save Biblo from getting ripped apart...one person ripped apart, or everyone gets eaten hmmm....This is another time where Biblo basically saves the day, instead of Gandalf.  Bilbo keeps the Trolls arguing in the movie, but in the book Gandalf throws his voice, making the Trolls think that they are disagreeing on how to cook the party.  The visuals of the movie are descent. More CGI was used, and less animatronics than in LOTR and it shows. I could continue to nitpick very easily, but I think I will leave it there. To sum it up, this is not a movie about a Hobbit, as the book was. It is a movie about the whole of the goings on in middle earth during the story of the Hobbit, and it doesn't work. It tries to be too much like LOTR, instead of the childrens book it was intended to be."}, {"rating": "2", "text": "If what you crave is a Lord of the Rings sequel featuring a sight gag wizard with bird poop in his hair who rides a rabbit sleigh, orcs (or like creatures) who deliver one-liners after being disemboweled, humorous beheading sequences played for cheap laughs, extended dish-cleaning footage, and lots of fight-scene ideas lifted straight out of Pirates of the Caribbean...this is your movie."}, {"rating": "1", "text": "Dreadful film.  I saw the HFR presentation and I could not believe how terrible the live action elements looked.  The look of the characters were like a bad BBC Shakespeare television program.   The film, dragged on and on, while the CG was done very well (Weta is great) Golum was terrific, the rest of the picture as a whole was awful.  Think Phantom Menace.  Peter Jackson has lost it.  Sorry, it is sad but true,  Dreadful, waste of 3 hours."}, {"rating": "0", "text": "I wanted something closer to Pan's Labyrinth and instead got another Jackson turd. If only del Toro had stayed on to do this properly. The more time that passes since the LOTR the more I grow to dislike them. Randall Graves had it right in Clerks II.  http://www.youtube.com/watch?gl=CA&v=aSB03lr69iU"}, {"rating": "7", "text": "I went to see the movie with my 8 year old son and he seemed to adore all the action. If you're looking for something like LotR then you'll be in for quite the disappointment. Still, if you forget about the book, then the movie is enjoyable in a way, but seeing that this one book is going to be stretched out over 3 movies, you don't need to leave much to the imagination as to why.\rThe kid loved it, and it wasn't too bad, but don't expect too much. Not much LotR like epic moments, but action and slapstick like silliness, except for the encounter with Gollum, which is the only part really worth watching."}, {"rating": "10", "text": "Great movie all around! I have no  idea why the critic score is so low but this movie is fantastic! This is just as good to me as tlotr. I cant wait to see the other two that Jackson puts out. If you can watch the movie in 3d its some of the best 3d that you will see in movies!"}, {"rating": "10", "text": "Great movie, great acting and great directing the hobbit once again shows why Peter Jackson is one of the best directors around. I have to admit that I was a little sceptical about splitting the hobbit into three movies, but all I can say that if the next two follow in the footsteps of the first it will be well worth the long three year wait."}, {"rating": "2", "text": "Monotonous, dry, bland, unimaginative story telling, as much fun as a trip to the dentist, please deliver us from Peter Jackson.  The visuals have been overplayed in the Lord of the Rings and the screen play lands flat and robotic.  None of the characters resonate and Richard Armitage looks and acts more like a poor copy of Viggo Mortensen's Aragon than a dwarf royal or not.  Huge waste of time and money, this telling lends nothing to Tolkien and appears lifeless even next to the cheesy 1977 animated Hobbit.  Jackson only has 2 tools in his tool box, endless sweeps across the landscape of New Zealand and excessive CGI.  Both are used to great effect to kill pacing, distract from the story and swallow the characters, not that another whiny hobbit or a band of forgettable dwarves that cannot sing would be missed.  The ending is also disappointing, not that I expected any kind of resolution in a film from Jackson, but I really wanted to see Smaug kill off the cast, turn on Jackson and leave us to all live happily ever after in a world free of crappy directors and pretentious film making."}, {"rating": "3", "text": "I love LOTR and the movies, and I understand that different mediums cannot translate to one another perfectly, but many of my issues arise from the technical and storytelling elements. The CG in the film ranges from beautiful to just silly, every single ork and goblin are CG, while most of the time this is not too big of a deal, in combat it is clear that the actors are not swinging at or connecting with a real being. The entire portion with the trolls is difficult to watch, with odd CG, poor \"combat\", the dialogue can be forgiven (i.e. gross jokes), and a set that clearly looks like a set. Peter Jackson added portions of other Tolkien books and expanded certain sections not covered in The Hobbit, but almost all of them are in odd places, and do not really fit with the story (this could just be bad editing), this is especially so concerning everything revolving around Radagast the Brown. Pacing is very slow, which does not  always equal bad, but it takes roughly 45mins for anything to happen in the film. Shooting in 3D was a big mistake, mostly because the lighting has to be so bright that many of the scenes looked odd, especially in Golem's cave, many scenes that should have been dark were oddly bright. I saw both the regular and 3D,48 fps. I did not enjoy the 3D, 48fps version of the film, it made the movie look like one of those 3D films at a theme park, i.e. somewhat cheesy. While there are many continuity issues many viewers will only catch a few. It seems that many of the qualities that Peter Jackson brought to LOTR (which made them great) disappeared in the hobbit. Many other issues include the pointless cameos from old Bilbo and Frodo (who has a 5 o'clock shadow), the long beginning narrative, cliched lines/characters, and odd makeup and props. I hope the next two films are better, but The Hobbit could have been better if Peter Jackson had gone simpler, in the scope and special effects of the movie."}, {"rating": "4", "text": "Even the extended version leaves me wanting more. This movie could have been so much better. It relied far too heavy on CGI and special effects and not enough on establishing the story and the characters."}, {"rating": "3", "text": "This film is a grotesque frankenstien monster of an adaptation. The sections of this movie which follow the book are entertaining and (barely) decently done, however the remaining half is a butchered and chunky concoction, incorporating elements of Tolkien's other works, 'Adam Sandler' style slapstick stupidity (such as a dismembered Goblin-King fat enough to appear on 'The Biggest Loser' falling on top of our gang of dwarfs, much to the delight of my 7yr old brother I should add) and an extra large portion of Peter Jackson's inflated ego. The resulting plot is a grotesque and thinly veiled carbon copy of Jackson's excellent 'The Fellowship of the Ring' to which The Hobbit's plot has been brutally affixed, even going so far as to tediously extrapolate a non-existent prologue to mimic the fellowship's opening scene. The worst part is that there are still two more films to come, and I wouldn't be surprised, given the quality of this one, if the last part were to rival the last film in the Twilight series for its extreme tediousness and fetal-position mind-numbingness."}, {"rating": "5", "text": "Fails to capture the epicness of the Trilogy. Also, way too much CGI. What happened? Why is everything CGI in this movie? Im not too excited about the other two now. I just love the Trilogy so much."}, {"rating": "4", "text": "Let me begin by saying that I had high hopes for this film.\r With that out of the way, let's get to the meat of the thing:\r \"The Hobbit: An Unexpected Journey\" certainly starts off on the right track; a hobbit, knowing nothing of the world at large, is chosen by a wandering wizard as the prime candidate for a great adventure.\r While this beginning is quite faithful to the book, that is where the similarities end.\r I can truthfully say that just moments after the introduction, my facial expression changed from one of joy to one of disappointment and scorn.\r While it is true that Bilbo Baggins was a somewhat 'reluctant' burglar, the dwarves and wizard did not simply cast him off as if he were not needed. They knew the importance of having a burglar to steal inside the Lonely Mountain, and Gandalf had very high hopes for Bilbo. In the Jackson adaption, we are shown that, while the company would prefer to have Bilbo be a part of their quest, they could do fine without him.\r After Bilbo chases the dwarves down and convinces them that he wants to accompany them, Jackson strays further off the beaten path; he actually ruins two chapters at once.\r Instead of sending Bilbo to scout the troll camp and possibly hone his burgling skills, he is sent to retrieve the company's ponies, which the trolls have captured. Now, this is a very important deviation from the book, as it changes the motivation of the goblins' capture of the dwarves and hobbit.\r After the episode with the trolls and a quick stay at Rivendell, the dwarves begin their way through the Misty Mountains. After nearly being killed in a fight between Stone Giants, they make camp in a small cave. Instead of attempting to steal the dwarves' ponies, the goblins steal the dwarves.\r This is where the worst deviation from the book occurs; instead of capturing the dwarves as they struggled to free their ponies, the goblins capture the dwarves because an ancient Orc named Azog has put out a bounty on them.\r Now, according to both \"The Hobbit\" and the appendices of the \"Lord of the Rings\", Azog was killed by Dain Ironfoot years before the events of \"The Hobbit\" took place. Now, this may not seem like a serious problem, as Azog was a minor character, but in bringing him back as the main antagonist Jackson has derailed the entire film series. Instead of the quest being \"reclaim the treasure of Lonely Mountain\", the quest is now \"defeat an ancient Orc and reclaim the Lonely Mountain itself\". Jackson, in an attempt to stretch the story, has destroyed the original premise of the dwarves' journey. In making Azog a main antagonist, he takes the focus away from Smaug the Great, a much more deadly adversary, and changes the dwarves from artisans to warriors.\r The feel of the book is gone. Instead of crafting sequences around the events of the book, Jackson creates a jigsaw puzzle, half book/half script.\r While many may argue that this is a plot device to build Bilbo's character, that can be disputed.\r In the original book, Bilbo Baggins gradually changed into a stronger person. In the films, he is portrayed as always being of a strong will, and just never having the chance to show it. By going this route, much of Bilbo's ongoing growth is lost, and his character suffers for it.\r Jackson obviously did not trust this film to register with audiences familiar with the source material, and, with that in mind, changed the story to suit those only familiar with his previous films. By inserting Galadriel, Frodo, Radagast, and the 'cute' Sméagol, he gains the support of Trilogy fans, but at what cost?\r Answer: Faithfulness to the original book.\r While the scene with Galadriel could be seen as an adaptation of events from the LOTR appendices, the 'cute' Sméagol cannot. Gollum/Sméagol is meant to be seen as a frightening, wretched creature; the book again and again explains that Bilbo feared for his life during the riddle competition. Why then did Jackson include the 'tame' Sméagol from the LOTR Trilogy? Because he knew it would register with fans of those films.\r In conclusion, I see this adaptation of \"The Hobbit\" as a way for Peter Jackson and New Line to profit from the LOTR Trilogy all over again. By grafting certain parts of the Trilogy onto \"The Hobbit\", New Line and Jackson are ensured that at least some of those fans will fork out money to watch three more films. I see this film not as an artistic exercise but as a cash cow. That is all."}, {"rating": "0", "text": "The Hobbit :An unexpected journey is a made for children. It has no plot, the actors are not good and the added comedy makes what might have been a okay movie even worse. I sat through the DVD hoping I would end up liking it. But was disappointed . I hated it."}, {"rating": "9", "text": "The first Hobbit movie in the franchise is not only exciting, it takes you on a thrill ride with not only some new creatures, but some old memorable character such as Gollum. At times, the story is distracted some cheesy humor, mostly caused by the dwarfs. But other than that it's a great start to the Hobbit trilogy."}], "recommendations": ["the_hobbit_the_desolation_of_smaug", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "the_golden_compass", "the_chronicles_of_narnia_prince_caspian", "percy_jackson_sea_of_monsters", "the_hunger_games_catching_fire", "ready_player_one", "the_legend_of_tarzan", "vanilla_sky", "doctor_sleep", "maze_runner_the_scorch_trials", "king_arthur_legend_of_the_sword", "inferno", "harry_potter_and_the_goblet_of_fire", "the_hobbit_the_battle_of_the_five_armies", "alita_battle_angel", "john_carter", "fantastic_beasts_the_crimes_of_grindelwald", "the_bfg", "the_13th_warrior", "the_hunger_games", "avengers_age_of_ultron", "city_of_ember", "it_chapter_two", "maze_runner_the_death_cure"]}