{
  "id": 828,
  "title": "The Passion of the Christ",
  "starring": [
    "Jim Caviezel",
    "Maia Morgenstern"
  ],
  "runtime": 127,
  "genre": [
    "Drama"
  ],
  "description": "A graphic portrayal of the last twelve hours of Jesus of Nazareth's life.",
  "releaseYear": "2004",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2C9vyK6leWDb2ds65R7uIwSmh8V.jpg",
  "categories": {
    "plot": 5.181818181818182,
    "acting": 5.75,
    "ending": 4.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 1.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The Passion of the Christ shows in an incredible realistic way the last hours of Jesus Christ, whitout a doubt one of the most important event in the history of mankind. Though there are a lot of movies about this event and about the life of Christ this is by far the most authentic, powerful and honest one. This movie has something that the others are missing. It was made with the intent to show what the Crucifixion really was, without omit anythig. Mel Gibson's work with this movie was incredible. You can see it by reading the interviews with cast and troupe members. The atmosphere in which they worked was incredible. All the resource use by Gibson to give a proper rapresentation of the events was admirable. And without a doubt Jim Caviezel give us the best interpretation of Jesus ever. How he prepared himself for this part is something else compared to a normal actor work. Because for him, for the director and for the majority of the workers on this set it was not a \"normal\" job. It was something more profound and strong. This is what you see in the movie (especially if you read the stories behind the making of it). There are so many powerful scenes: the look in Barabba's eyes when he sees Jesus, Mary that runs towards his Son when He fell with the Cross, Pilate that wash his hands, the death of Judas... It's all so rich of details and precision. The location, the costumes, the screenplay, the cinematography are all really impressive. And the use of the real historical lenguages makes the movie even more perfect. I suppose that the approach to this film by an atheist or a non-Christian it's very different compared to the one of a Catholic but I think that everybody can appreciate a work made with so much dedication and cleverness. The negative reviews, especially the ones from film critics really make me believe that they don't really see the movie or they have been affected by prejudices against Mel Gibson of course and indeed by their opinions about Chrisianity and Catholicism. The ones who accuse this movie of beeing too violent or too graphic have to undestand that this is what happened, simply as that. We see the beginnig of Saving Private Ryan: it shows extreme violence of course but it a true rapresentation of what D-Day was and so we consider it a masterpiece. Why don't use the same treatment with this movie? Why show an historic event (and really, if anybody has a doubt about the historical accuracy of the life of Jesus, please literate yourself with some Roman historians like Tacitus or Pliny the Younger) for what it was it's controvesial? The tortures, the Via Crucis, the Crucifixion was brutal, violent, difficoult to watch but this is what it's supposed to be. If they feel unconfortable to watch maybe it's because they can't or don't want to stare the truth. I honestly can't give this movie anything other than 10/10. One of the greatest movie ever made, and without a doubt the one with the most profound meaning for those who see it and for those who have done it."
    },
    {
      "rating": "10",
      "text": "Brilliant! I have watched this film several times. It's a work of art. If you pay close attention, from the very beginning it's going to teach you a lot of good things. It will show you the profound and endless love that Jesus has for you. :)"
    },
    {
      "rating": "10",
      "text": "My respect for Prophet Jesus (May God's peace and blessings be upon him) increased multi-fold after I watched the movie."
    },
    {
      "rating": "10",
      "text": "This movie depicts some of the events that happened to Jesus Christ. It is in no way anti-semitic, Jesus came to die,so regardless of who killed him i.e Jew or otherwise. This film was beautifully made and it touches the soul,so for all those people who are saying it doesn't touch the soul, it is because you do not understand. This film is not about the violence, but about redemption and grace through the suffering of Christ. Jesus said father forgive them for they know not what they do, with this he meant the Romans, Jews and every other persons today. So believe and be saved!"
    },
    {
      "rating": "10",
      "text": "This film enables one to comprehend graphically the torture and agony that Jesus endured for ALL mankind."
    },
    {
      "rating": "6",
      "text": "Too violent and bloody, but overall a good movie about the last 12 hours of Jesus and almost no scenes with the resurrection! I liked the few scenes with his students and Saint Mary more, and i think we needed more of that! Overall i give my respect for mr. Gibson, but it was unnecessary brutal."
    },
    {
      "rating": "6",
      "text": "Perhaps, it is not to discredit Christ, but the good thing about the movie is the time of the crucifixion , really, even in the beginning to the same scene, bored a little, but this movie is world renowned in the world, and he explains that Christ died for us sinners , keep it in mind !."
    },
    {
      "rating": "6",
      "text": "It's stories like these that normally keep me entertaining and make me love it, but just fails to do so at around the ending. This is possibly the best Christian movie you can possibly see despite the R rating."
    },
    {
      "rating": "9",
      "text": "Very powerful, but super violent. They definitely did not sugarcoat the crucifixion at all. The Passion of the Christ is absolutely a must-see off everyone, but that doesn’t mean it’s an “easy-see”."
    },
    {
      "rating": "8",
      "text": "Mel Gibson's \"The Passion of the Christ\" depicts the last 12 hours of Jesus Christ's life before his crucifixion. As a christian myself I really couldn't find much of his teachings and theories of love and forgiveness because movie's pretty much torture porn in a nutshell. However leaving the fact that whenether you're a christian or not, the movie's realistically portrayed as the bible describes it, where he was beaten up by the Romans and was crucified for us. As Roger Ebert says, take it or leave it."
    },
    {
      "rating": "5",
      "text": "I have read quite a few of the comments. It's very much the case of you liked it or you didn't. I am a Christian but I found it left me slightly emotionless. But the boy tried his best. What I do find offensive is the crowd who didn't enjoy it are very free with their opinions. They feel they need to denigrate anybody who did enjoy it as a moron and that they are uneducated, numbskulls etc etc. Personnally I don't give a dam what you think of Christians or any other religion for that matter, but don't try and make out we are stupid and you are they great informed of this world. Your are not. Every time you open your mouth you exhibit to the whole world what a pathetic numbskull you are. Keep the gob shut and maybe someone might think you have a brain."
    },
    {
      "rating": "9",
      "text": "Part of what works with the movie is that it's not a sermon. It's just a graphic depiction of (arguably) the most important moment in Christian faith. Yes, there is a message going on, but it's more of a \"this is what happened\" sort of thing as opposed to \"Jesus suffered through this so you need to get saved!\"\r It's a very graphic and violent movie. Realism is the theme so no punch is really pulled. At times it even reaches \"Saw\" levels of torture porn. There's no mutilation, but we see a great deal of pain being inflicted on Jesus. Realistic wounds appear as a result and every ounce of agony is excellently captured by Jim Caviezel.\r For Christians this is going to be a tough, but powerful reminder of what Jesus went through for our salvation. It will speak to our faith and makes us feel. For non-believers it's evident that Mel Gibson is trying to reach you by hoping that the gut punch of the films brutal nature hits you hard enough to touch your heart. The results may vary.\r Outside of some embellishments and acts of what I guess you could call \"artistic flair\" this is an almost completely accurate depiction of the death of Jesus as the Bible tells it. The thing that sets it apart from other tellings of the same story is that this one does not shy away from any depiction of the violence that went on. It's brutal, violent, and bloody. Thankfully it also manages to be powerful. Not just for the Christian audience either. Those who don't believe, yet have an open mind can find this movie to be a respectable telling of the of the death of Christ almost exactly as the Bible says it happened.\r The at times downright savage nature of it could be a turn off or even downright offensive to some. Mel Gibson has embarrassed Christianity a lot over the years. However this he got right."
    },
    {
      "rating": "10",
      "text": "It's a must see movie. The movie show us Jesus suffering for all of our sins, to save our lives and give us the Salvation. There are some shocking scenes, but many things that Christ suffered don't be on the movie. But in the end, we all know that Jesus Christ lives and has saved us unto the eternity."
    },
    {
      "rating": "10",
      "text": "This film depicts what Jesus went through to be the final sacrifice for mankind.  Jesus was tortured and crucified so man could be forgiven of sin.  Jesus died so man could once again have a personal relationship with God.  John 3:16 says it all:\r For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life."
    },
    {
      "rating": "10",
      "text": "Im sorry but 47/100 on Critic Reviews? C'mon people! This was, and still remains, as a classic film about the true nature of the crucifixion of Jesus Christ.  This film will not only bring you to tears, but put a smile on your face once you realize that one man put his own life on the line for us.  Christian or non-Christian, you need to see this film. Now."
    },
    {
      "rating": "10",
      "text": "47% really??? I guess if its not about 2 men kissing on a mountain, it's not worth watching.  Bottom line is, this is a very good movie. Yes I liked the message too, but if you just look at it for the quality of the picture you still come away with a 10."
    },
    {
      "rating": "9",
      "text": "As a power considerably higher than the rest of us is said to have commented: \"It is as it was.\" What it was I cannot say, but what it is is a magnificent achievement.\""
    },
    {
      "rating": "9",
      "text": "As some of the critics argue, this is not a movie that is meant to be a sermon, or to teach you something. It is not focused in Jesus's life, and I don't believe it attempts to be a religious film. It focuses in the last 12 hours of Jesus life as they could have been. Of course by those times many other people were brutally tortured and killed on this way but there is no much mentioned about them because they were just common people. Jesus was different, and either if you believe in what he praised or not , he was a historical figure that changed the life of many, and the spiritual face of the Western World.  Back to the film, the acting was certainly good! The Art direction of this movie was amazing, yet the images were extremely violent, and I had difficulty watching them, but in spite of it, I did. An observation: a few comments below, the user called ANDY mentioned that Anthropologists believe that Jesus looked different and blah, blah. Well, ANDY, curiously, I happen to have a PhD in Anthropology and Sociology, and I also have some education in history and in my 20's I used to be a theatre performer,(now I am just my 30's, and not, I am not at all a nerd or a nerd looking, quite the opposite) so my answer to you Andy is: Don't talk what you don't really know! You are just repeating what the mass-media say! Research in journals and serious academic publications if you really aim to increase your knowledge on the matter. There are many different approaches about Jesus's life. It is also  impossible to know how Jesus looked or not or how did he lead his private life! Therefore,  we should stop referring to petty stuff as arguments against this film, for that is senseless criticism. If Jesus had long hair or not, if he was really the Son of God,  or not,  who cares...! This film is not a  proselyist one!  Finally, let's be fair, just because people do not like religion-and most of people here probably not- it doesn't mean the movie is bad or old fashion! I am not religious myself, but I can still see and appreciate this film for what it is. Guys, this may not be your cup of tea, but objetively, it is a magnificent work!"
    },
    {
      "rating": "10",
      "text": "the reason I gave it a 10 is not because it is perfect, but I don't have any authority to give poor score on it"
    },
    {
      "rating": "10",
      "text": "The Passion of the Christ is an incredibly deep and meticulous interpretation of the last days of Jesus. The very accuracy and detail of this undeniable work of art justifies its R-rating. Unfortunately, The Passion of the Christ has been sinfully judged by the prejudiced critics who have insulted this emotionally and thematically rich masterpiece for its violence. The world is filled with selfishness and pride and hates God because God is ethically right in every way shown through his holy word known as the Bible, but mankind loves what is evil more than what is ethically good and so mankind will do all it takes to manipulate what is good and make it sound evil while making what is evil sound good in order to gain more power for themselves or to let them follow their sin that they so desperately love and not give it up for the one who died on the cross for them. When it comes to the self-centered and arrogant critics who despised The Passion of the Christ. The brutal, torturous, and horrifying suffering of Jesus makes them feel like they are being guilt tripped because it doesn’t matter whether you were there at his crucifixion or not. You would have done the same thing. The condescending critics want to feel good about themselves and not stare at the truth. They will think of anything to criticize this outstanding artwork upon cinema. The amazing cinematography, soundtrack, makeup, accuracy, and depth won’t stop their criticism of violence, even though all the other R-rated films out there that are more violent and inappropriate without even having a reason that is as good are critically acclaimed. I am honestly shocked that The Passion of the Christ was not even nominated for best picture, but I really should not be surprised. The oscars are possibly just like the critics when it comes to this film. I admit that I hate watching R-rated films. This is not a film I would watch again and again. Even so, I can never deny The Passion of the Christ as one of the greatest films of all time."
    },
    {
      "rating": "3",
      "text": "Don't most anthropologists and historians believe that Jesus was in fact not this long-haired, white guy and more of a man that looks like...what people from the Middle East actually look like? Also; exploitative, boring, sensationalist, and unimportant. We allow our kids to see a movie of a man being tortured and beaten for two hours but we won't let them see a hint of nudity when it comes up in film ratings."
    },
    {
      "rating": "4",
      "text": "Yo...my man got his ass whooped! For hours! Non-stop! But seriously this is a big steaming pile of unrealized potential."
    },
    {
      "rating": "10",
      "text": "I believe the movie showed just how much God loves us. Why is so hard for some too believe? We all know about hatred, but when it comes to love we try to explain it away. God loves us and sent his son to die for us. This movie captures the last hours of our Lord Jesus life and why we should worship him."
    },
    {
      "rating": "1",
      "text": "The film is so focused on Christ's death and how violent and terrible it was, that the film loses any kind of heart and simply becomes about guilt. Essentially, The Passion is the biggest guilt trip in history. The film offers no insight as to what Christ's death taught any of his followers, and simply tells it's viewer that Christ died for them, and now they have to earn it like in Saving Private Ryan. Nothing is learned, and only guilt is felt."
    },
    {
      "rating": "2",
      "text": "What I learned from this movie: Jews are bad, feel bad for Jesus and Jesus is awesome. Mel Gibson.... go **** yourself. Just a glorified snuff film. Go watch Saw instead."
    },
    {
      "rating": "0",
      "text": "Hey Get Real, maybe YOU SHOULD. Saving Private Ryan was different: The violence in THAT film had a point. The violence in THIS film serves NO PURPOSE. This is an absolute bloodfest with no artistic value to speak of. Oh but It's about the lord so I should give it a 10. But I won't."
    },
    {
      "rating": "0",
      "text": "For once, the average score based on critic reviews have it right. This movie is sensationalist garbage made by Mel Gibson to appease and ingratiate himself with his fundamentalist holocaust denier father."
    },
    {
      "rating": "10",
      "text": "Gibson stepped out on a limb to portray the story of Christ outside the civilized norm of consumer religion. For those that prefer a cross-less Christ, this is not the movie to watch. The event is historically documented by secular and religious sources and yet is scandalized as gratutious and sadistic. To accept the event, as Gibson portrays it, is an indictment of the human condition; one that most defiintely needs rescuing. Gibson leaves the viewer with a perplexing question: what to do with a Christ that claimed to suffer on the behalf of humanity?"
    },
    {
      "rating": "10",
      "text": "Powerful"
    },
    {
      "rating": "0",
      "text": "\"A depiction of the last 12 hours in the life of Jesus Christ as he is crucified in Jerusalem.\" This monotonous movie relied on people finding this 12 hour period interesting; in reality who really cares? If the Bible or the story of Jesus was slightly believable I would of enjoyed this. However, as it is an insult to anyone remotely educated, I'd rather label this movie \"The last 120 minutes of Mel Gibson's directing career.\""
    },
    {
      "rating": "0",
      "text": "Mel Gibson continues his fascination with extreme violence. In essence this is pornography for christians."
    },
    {
      "rating": "1",
      "text": "Those in extreme fringe Christian sects, living in isolated compounds, arming themselves with military weaponry in preparation for the Rapture, will love this movie. Just in case you were considering doing it, showing this film to your kids is child abuse. In fact, to do so would not be much different from beating your child's brand new puppy to death on Christmas morning screaming \"This is what Jesus did for YOU! This is how Jesus died for YOU!\""
    },
    {
      "rating": "0",
      "text": "An exploitive, piece-of-shit of a snuff film. It has no religious or emotional value at all and yes, it is blatantly anti-semetic. Mel Gibson has no talent as a director, he just has a laughable amount of money and a wacked out outlook on religion and culture. You should be ashamed of yourself if you claim this movie reaffirmed your relgious values. Go read a fucking Bible to learn about what Jesus taught, not how he brutally died. If Mel Gibson had done so, we may not of had this hateful lowest-common-denominator crap. An artless and soulless low point in American cinema and pop culture."
    },
    {
      "rating": "2",
      "text": "This was solely a string of slowmo scenes tied together with some cheap brutality. Overall the movie should have lasted about 15 minutes but is drawn out over 2 hours because of the frequent flashbacks and slow motion. Near the end you are pleading for Jesus not to fall anymore. Also it is clear that the film used cheap brutality in order to have some effect on the audience. A pig being tortured like that would have had the same gut-wrenching effect. Overall the film didn't have much content and Gibson tries to manipulate the Bible and the audience to make it somewhat interesting, but he fails."
    },
    {
      "rating": "1",
      "text": "A. What does it mean that Jesus \"invented the tables and chairs we use today.\" Did I miss that in my readings of the gospels? B. When I saw the Passion, a preview for The Day After Tomorrow was screened. The large family behind me from rural Maine responded, when asked \"where will you be the day after tomorrow\" by exclaiming \"I'll be in the rapture!\" They loved the Passion. C. In contemplating the bizzare claims to authenticity this film makes, it might be a good idea to watch Passolini's The Gospel According to St. Matthew (which received official papal blessings pre-Vatican II, so it should be kosher for Gibsonians). Strange how estranged different claims to authenticity can be."
    },
    {
      "rating": "0",
      "text": "I have said for years that Mel Gibson is a self-absorbed Alpha-male wannabe. Follow this pied piper to church and flagellate yourselves if you want. This film is worthless."
    },
    {
      "rating": "3",
      "text": "Let me explain several misconceptions of the Christian faith. First of all, if you believe in this stuff than you would know that nobody is responsible for Jesus's death other than GOD. Jesus was SENT to die bottom line. Secondly, as far a historical accuracy, the bible was edited by the Catholic Church far before any of us read it so, unless someone who was actually alive 2000 years ago is still alive please explain how anyone can KNOW this is actually how it happened. Now that I have gotten that out of the way I can actually review the movie. And I know someone will be upset at me for saying this but as far as the plot goes, there isn't really one. And that is why the critics panned this movie for its violence. It doesn't serve to move the plot. It's just there. The cinematography is execellent as well as the use of subtitles instead of having them speak a language foreign to them. The problem is that people aren't reviewing this as a movie they are reviewing it as a religous experiment. When I go to see a show I want to be entertained I don't want to see someone get the crap beat out of them for two hours. Say what you want about Pulp Fiction but the violence in that movie moved the plot and it was more than just blood and gore. If it isn't Jesus than nobody would give a damn about this movie."
    },
    {
      "rating": "0",
      "text": "For those of you prasing this movie as a breakthrough, I hate to say this, but you have only been manipulated. Gibson did not make this movie to state a point or get a message across, he simply took a controversial subject matter and made a very controversial movie out of it to get your money. For those of you who say this movie is true, it is not. You weren't there, Gibson wasn't there, nobody involved in any way with the creation of this movie was there. For those of you who say us athiests dont understand this movie due to lack of faith, you need to learn that christianity is not the only religion, and that you have to have respect for all beliefs. I dont care that Jesus died, Im sure he didn't care about me, and Im sure he didn't care about you. He probably only did it for the attention."
    },
    {
      "rating": "0",
      "text": "Manipulative, over-the-top, sensationalist, ugly, pretentious GARBAGE!!"
    },
    {
      "rating": "1",
      "text": "Why?!?!?!?!?! This movie was just bad. Good ole Mel Gibson, spots off a good old fashioned hunk of garbage. I had to go see this \"delightful\" movie in theaters. It sickened me to no end. I didn't enjoy it in the slightest. I know it's not really meant to be enjoyed, but it's a movie for Christ sakes...haha, see what I did there? Anywho, I simply couldn't stand the movie. I think I may have vomited a bit."
    },
    {
      "rating": "0",
      "text": "Believer or non-believer, it doesn't take much to understand that the only reason for this film's existence was purely commercial. Cinematography was good, everything else was Gibson capitalizing on people's beliefs. Faith has nothing to do with this movie, any religious person who considers this a good movie is a true hypocrite."
    },
    {
      "rating": "6",
      "text": "this movie tells the life of Jesus Christ in the most gory way, but this isn't a bad movie. the score was good and the acting was decent."
    },
    {
      "rating": "6",
      "text": "Its Jesus getting tortured for 2 hours, but its a very intense movies. I loved the stares between people, acting is generally amazing, Which is really what carried this movie."
    },
    {
      "rating": "1",
      "text": "An empty husk of a film who's only goal is to depict an extended act of torture and execution.  Unbelievably, families who would run screaming from films like Texas Chainsaw Massacre brought their children to watch a man have his flesh ripped from his body and nails hammered through his hands.  This disgusting piece of exploitative torture-porn was screened in churches, schools and just about anywhere for reasons I cannot fathom.  None of the teachings attributed to the Christ character exist here, none of the good things he supposedly did... just his gruesome, bloody demise.  Halfway through this highly exaggerated beat down on film, I became convinced that Mel Gibson actually relished in depicting his savior being brutalized. The Passion of the Christ does nothing more than reveal Christian hypocrisy and expose children to some of the most hideous torture imagery ever conceived with no redeeming value whatsoever.  Way to go, Mel!  Way to go, parents!"
    },
    {
      "rating": "7",
      "text": "Religion aside, what Mel Gibson was able to create with The Passion is extraordinary. One of the most violent, honest and brutal tellings of the crucifixion. Jim Caviezel's performance is beyond passionate."
    },
    {
      "rating": "3",
      "text": "No big deal, what turns out to be a great appeal to the drama about the boring story of Jesus    ."
    },
    {
      "rating": "0",
      "text": "to quote south park \"if you wanna be Christian, that's cool but you should focus on what jesus taught instead of how he got killed. focusing on how he got killed is what people did in the dark ages, and it ends up with really bad results.\" so I don't recommend this movie- actually no its not a movie. its torture porn."
    },
    {
      "rating": "2",
      "text": "I'm sorry... I just can't give this movie a good review. While the cinematography and acting may be good, the way gibson treats the subject matter in such a graphic, disturbing, and horrific light is just unbearable. This is definitely a movie for the devout believers. All those who do not belong to that category need not expose themselves to this disgusting carnival of blood and violence."
    },
    {
      "rating": "5",
      "text": "The Passion of Christ is a Christian movie directed by Mel Gibson. The film depicts the last 12 hours of Jesus's life. Basically him carrying the cross. While the movie seemed to be focused too much on the blood and gore it was a good film none the less. The emotion and faith of the movie seemed to be drowned out by all of the blood and pain. One of the only clear moments of the movie was when Jesus (Jim Caviezel) had lost faith in his father. But he quickly regained his faith and was on his jolly way to continue being crucified. While I do believe that the actual crucifixion of Jesus must have been very gore filled, it had much more symbolism than what the film has portrayed. Perhaps Gibson used the blood and pain to keep the audience interested. Need less to say, I would have much more enjoyed a version of the movie that focused on Jesus's or his disciple's thoughts. At the end The Passion of Christ is an accurate representation of the last twelve hours of Jesus's life. But many important ideas and concepts have been silenced by all of the gore. I give this movie a 2.8/5. While it was interesting to watch, it was interesting to watch for the wrong reason. I came looking for a movie that would give me a better understanding of what the people who were at the crucifixion might have though, but instead I was greeted with gallons of blood."
    },
    {
      "rating": "1",
      "text": "this is one of the most boring movie ever. it's 2 hour movie and it's only watching torture. i like more godfather 3. this is horrible don't watch this movie. and now spoilers this is 2 hour movie where Jesus dies."
    }
  ]
}