{
  "id": 3338,
  "title": "The War with Grandpa",
  "starring": [
    "Robert De Niro",
    "Uma Thurman"
  ],
  "runtime": 98,
  "genre": [
    "Comedy",
    "Family"
  ],
  "description": "Peter is thrilled that his Grandpa is coming to live with his family. That is, until Grandpa moves into Peter's room, forcing him upstairs into the creepy attic. And though he loves his Grandpa, he wants his room back - so he has no choice but to declare war.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ltyARDw2EFXZ2H2ERnlEctXPioP.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 3.1,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.25,
    "funny": 4.8,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Like, it’s fine. Safe and whatever. Actually has a few decent laughs. Just no real momentum or purpose."
    },
    {
      "rating": "6",
      "text": "A fun film that cannot compete with the real comic films of today. It was an average film that you certainly do not have to see in the cinema."
    },
    {
      "rating": "6",
      "text": "Dirty Grandpa, but cute. For the most part this family-friendly slapstick comedy meanders around without much of a real plot as grandfather and son go back and forth in a \"war\" of over-the-top pranks while swapping some touching moments with the rest of the house along the way. Outside of a rather tasteless gag at a funeral that involves the body of the deceased getting manhandled, it's about as inoffensive as you can get. Naturally, the older you are the less amusing all of this will be, but it's still worth putting on for the kids. Not only will it likely keep them in a near-constant fit of laughter, but also comes with a nice anti-war message on top of preaching the values of getting along with your elders. Yes, it's about as deep and original as an inflatable children's pool. That doesn't really matter too much though when all it's trying to be is a bit of harmless entertainment for the youngsters, which is something I can always get behind."
    },
    {
      "rating": "0",
      "text": "Basic **** for the kids this needs to be deleted (&(&;&;@:@@:&;&;&(&?;’eme&((&;&:&@;;@"
    },
    {
      "rating": "6",
      "text": "This might have bad acting and jokes. But its not trying to be the new Parasite. Its just a silly kids movie."
    },
    {
      "rating": "0",
      "text": "War With Grandpa isn't anything to rave about at all, as the acting is cringe worthy and the entire premise is stupid. This really is just a bad film."
    },
    {
      "rating": "5",
      "text": "Watchable yet never fully committed to either it's dramatic or comedic tones, TWWG failed to muster more than a chuckle or any emotional responses from me throughout my viewing. The great cast felt wasted and the set pieces only proved to distract from any dramatic potential of what could've been a fascinating family dynamic."
    },
    {
      "rating": "6",
      "text": "I liked it, but it is of course more for kids. So I assume it might be more funny for kids who watching and for grownups some jokes maybe not as funny anymore."
    },
    {
      "rating": "0",
      "text": "I feel bad for every single one of the stellar cast involved in this absolute travesty.I know I'm not the target audience here, but honestly, this may be the worst movie I've ever seen.It's not funny. Not in any way. The jokes are completely flat, the farce is just awful, like a low-rent Home Alone, without any of that movie's conviction.The script is beyond being phoned-in. The writing is awful, the direction is hopeless. Everybody's character is tissue-paper thin. I can't imagine how many crayons the writers must have gone through when drawing up the plot, and are we really supposed to believe obviously 25 year old Laura Marano as a moody teen? Come on.Beyond awful. I hope they paid all the actors a BIG sack of cash for this career-ending mess."
    },
    {
      "rating": "3",
      "text": "What happened with the idea that family movies are about normal people dealing with extraordinary things (as comedy or adventure)... this movie now paints human values as so bad, the best they can hope for is 'normal'. Even our kids thought this movie was sick. Its not how it ends, it's how it normalises a lack of humanity. Who is this movie made for? If this is a reflection on society, I want to clock out now"
    },
    {
      "rating": "4",
      "text": "Rubbish.Everything about 'The War with Grandpa' just feels off, nothing feels right to me. What doesn't help is that the first 25-30 minutes are extremely dull, like utterly and truly boring. Once the premise gets underway it slightly improves, yet still produces nothing to remember. Even the 'war moves' that feature fairly cool scenarios just come across as very underwhelming.The acting across the board is subpar, at best. That's a major disappointment, given Robert De Niro (Ed), Uma Thurman (Sally) and Christopher Walken (Jerry) are involved. I don't necessarily feel like they weren't trying or anything, but I just didn't sense any spark from them. The kid actors, meanwhile, are average.Despite a relatively short run time of 94 minutes, I was gagging for the end credits for a rather long while. With that said, knowing me I'll still probably check out the apparently upcoming 'The World War with Grandpa' sequel in a few years..."
    },
    {
      "rating": "5",
      "text": "A fun film that cannot compete with the real comic films of today. It was an average film that you certainly do not have to see in the cinema."
    },
    {
      "rating": "0",
      "text": "10/10 Movie You Should Stop What You're Doing Right Now And Watch This Masterpiece"
    },
    {
      "rating": "8",
      "text": "The story is a little rough (like it's a first script for the writers) but the acting is top-notch. There are a lot of holes in the plot and simply obvious plot points, but the actors do a great job and save the movie from itself. Probably won't ever be anyone's favorite movie, but it's a refreshingly funny way to kill a couple of hours. The movie is as funny as the trailer so it's worth the price of a ticket, maybe just not purchasing a copy."
    },
    {
      "rating": "0",
      "text": "Its boring with really bad jokes with not interestant characters and bad acting performances."
    }
  ]
}