{
  "id": 76,
  "title": "The Last: Naruto the Movie",
  "starring": [
    "Junko Takeuchi",
    "Nana Mizuki"
  ],
  "runtime": 114,
  "genre": [
    "Action",
    "Romance",
    "Animation"
  ],
  "description": "Two years after the events of the Fourth Great Ninja War, the moon that Hagoromo Otsutsuki created long ago to seal away the Gedo Statue begins to descend towards the world, threatening to become a meteor that would destroy everything on impact. Amidst this crisis, a direct descendant of Kaguya Otsutsuki named Toneri Otsutsuki attempts to kidnap Hinata Hyuga but ends up abducting her younger sister Hanabi. Naruto and his allies now mount a rescue mission before finding themselves embroiled in a final battle to decide the fate of everything.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bAQ8O5Uw6FedtlCbJTutenzPVKd.jpg",
  "categories": {
    "plot": 8.4,
    "acting": 8.307692307692308,
    "ending": 7.857142857142857,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 8.8
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Ok, this movie doesn't deserve a 10, but obviously shouldn't have a red or yellow score. This movie is made for the people who follow the series, it was advertised like that, unlike movies \"meant to be for fans\" like BvS or Warcraft.\rThe romance between Naruto and Hinata works 95% in the movie, we have a little of the silly Naruto as we know and a Naruto finally in love, creating a good character development.\rI could say lots of great things about this movie, but I don't want to make it long. The only problems I saw is that few things happen out of nowhere and the screenplay takes lazy decisions, but it's rare. Still a good movie, the episode 699,5 that they promissed. My score is 7,5."
    },
    {
      "rating": "8",
      "text": "Its a great anime movie. Packed of action, but also having attention in the romance. The characters are good, the story is fantastic and the hand drawing animation is excellent. Its no Studio Ghibli, but its passable. A good film for the lovers of Naruto or the anime itself."
    },
    {
      "rating": "8",
      "text": "Don't see why so many people are harsh on the relationship between Hinata and Naruto. Now if you're a fan of action-Naruto, I can understand people being a little disappointed the films was plot heavy, but it was still a good story and film.I liked that they expanded on a plot point they didn't have enough time to cover in the end of the anime/manga. The relationship between the two characters is sweetly told here.Now, there relationship is at expense of the rest of the plot. We don't have as much time for the myriad side characters and the villain and his plan. (Though, I do like how they fit him into the existing Naruto mythology.) The ending fight is quite exciting by the way for those who are only interested in the action.Of the Naruto films I've seen, this is my favorite because instead of another cookie-cutter side story where they help protect a troubled guest character (usually female), this is  a strong film that directly addresses and affects the main characters."
    },
    {
      "rating": "9",
      "text": "Storia interessante, combattimenti belli, fanno finalmente vedere qualcosa in piu' riguardo il periodo in cui Naruto e' adulto. Li facessero tutti cosi' gli episodi delle serie!"
    },
    {
      "rating": "10",
      "text": "Hone of the best animation movies excellent development and character and its animation a beauty i think this the best Naruto movie, awesome"
    },
    {
      "rating": "10",
      "text": "Una película que refleja los sentimientos, la gran animación y un epico final"
    },
    {
      "rating": "10",
      "text": "Loved the film it had a bit of action and a bit of romance, it starts off a bit slow, but for anyone who has followed the series for years they will still find the start really interesting. It really brought a lot of development to the character especially really showed how much Naruto has changed over the years. The animation was also amazing that really highlighted the action scenes."
    },
    {
      "rating": "10",
      "text": "Jone of the best animation movies excellent development and character and its animation a beauty, para que entiendan mejor es la mejor película de naruto"
    },
    {
      "rating": "7",
      "text": "A good finale to Naruto loved how after 15 years Hinata finally got Naruto's attention."
    },
    {
      "rating": "10",
      "text": "The Last: Naruto the Movie is a fantastic mix of a compelling story and basic fan service. It spoke to me not only on a fan base level, but also an emotional one. They say that with music, \"you either feel something when you listen to it, or you don't\", that is just how it was for me with this movie. Not only did the animation, color schemes, and character designs bring out this movies greatness, but the story as well. I know the movie is mainly based on the blossoming love between Naruto and Hinata, but I don't believe that is what the movie is truly trying to express. Now, while I was ecstatic to finally see the two wed, I mostly in tears over how far Naruto had come over the years. It was like watching my son grow into a man. After many years of unintentional neglect Hinata finally receives Naruto's love. \"With age comes maturity\", they always say.\rThis movie also spoke to me personally. Throughout my 17 years on Earth, I always struggled with what it was I truly wanted. I knew I wanted to become an animator, but what I wanted to do with that was unclear. I never had any real friends because I was always stuck on this. Nobody ever tried to get to know me, and I treated them the same. I thought that this would be my life forever. That is until I reached my freshman year of high school. I met a girl who, after one conversation, allowed me the opportunity to sit with her friends. I was in live with her, but I was fine with the friendship we shared so I never said anything. That was the start of everything. And now, I finally had a place to call my own, though there was always doubt that it was just pity. But, after openly sharing with them my doubt, they told me something, \"There is nothing you can say that will drive us away\". I was truly happy. Many days I have spent with them and after watching this movie, I realized something. There was someone who always accepted me head on without any prejudice. My friend. I loved her.\rNot only did the movie help me truly realize my love, but it helped me find the purpose behind my animation. GIVING. I was never one to truly get excited over receiving something, but when I give to my friends, it is like being on cloud nine when those smiles appear on their faces. I want to give what Naruto gave me, \"hope, and purpose\"."
    },
    {
      "rating": "3",
      "text": "Sinceramente fui pra ver Kakashi e sasuke , e vi um romancinho , vou da um nota 3 pois os efeitos foram até que bem trabalhado .-. , mais tambem finalmente acho que agora desenrolou naruto e hinata logo ."
    },
    {
      "rating": "4",
      "text": "Not the worst thing I have ever seen but far from good, the romance of this movie is pathetic and rushed, going between Naruto having little to no emotional attachment to Hinata to him being unable to even perform basic duties to save the planet over heart break of someone he had no feelings for prior to the 2 hours beforehand.\r The movie basically seems to be a desperate attempt to shove some information down our throats and satisfy people on exactly 'why' Naruto and Hinata get together. As per usual the power levels in the movie make almost no sense constantly fluctuating from what seems to be average Shinobi to gods in a heartbeat nothing new to anyone who have seen Shippuden movies before or even any of the Naruto movies to be honest.\r Worth the watch if you are a fan of the series only, it gives information and introduces important concepts to keep up with the Naruverse since it is the only 'cannon' Naruto movie, do not watch this movie if you are not intimately familiar with the series already as it has extreme amounts of spoilers and is not a good basis for the Naruto series in general."
    },
    {
      "rating": "8",
      "text": "The Last Naruto Movie is a solid anime movie that uses the subject matter given to it by the series and combines it with excellent visuals and a hard hitting story that keeps viewers entertained and crying at the same time when witnessing the end of their beloved Uzumaki. But it lingers on the mediocre line a bit, when it seemingly drags the ending, and in a more Naruto fashion, stretches the story, more than it has to. The little teeter totters that hold the movie back can be avoided, but they are there. The voice acting is something I cannot comment on, because it's in a different language, but let me tell you. It's loud and clear but still provoking mediocrity. If those things don't matter to you, you will have the experience of a lifetime watching the energetic Naruto blaze in the sky and waving goodbye. It delivers 100% the best fan service any anime movie can give to you. Believe me, the animation and the fight scenes are GORGEOUS. This is a worthy ending to a worthy anime. R.I.P Naruto."
    },
    {
      "rating": "6",
      "text": "Really? This is how Naruto and Hinata end up together? This forced mess of a movie? This should explain how they fell in love? This movie was... not good. When it comes to Naruto, i am very forgiving and lenient. It has been a part of my life for around 16 years, so yes. I can accept a lot of crap from this series. But i cannot forgive this lame, uninspiring excuse for romance. It should have been better... It should have been more epic... They deserved a better love story"
    },
    {
      "rating": "9",
      "text": "The power of the Moon, not with Deep Purple, but with Naruto Uzumaki. What is most appreciated is that it is not necessary to immerse yourself in chapters of the series to understand this film, which unfolds with fluidity and emotions, leaving no loose ends. And the best comes at the end, with an epilogue after the credits."
    },
    {
      "rating": "6",
      "text": "Kobayashi has managed to turn a romance wanted by fan-boys, into a true believable story with a storyline that holds up. Despite a lot of unnecessary scenes to lengthen the life of the film, the latter rather puts the love between naruto and hinata, but it seems that they are relying a little too much on this fact."
    },
    {
      "rating": "6",
      "text": "The reason im giving this movie a six is because NARUTO NEVER USES KURAMA. HE COULD HAVE SAVED HINATA AT THE 50 MINUTE MARK BUT NO HE DIDNT. 90% OF THE MOVIE IS HIM NOT USING KURAMA."
    }
  ],
  "recommendations": [
    "my_little_pony_the_movie",
    "how_to_train_your_dragon_2",
    "onward",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "brave",
    "frozen_ii",
    "raya_and_the_last_dragon",
    "incredibles_2",
    "how_to_train_your_dragon_the_hidden_world",
    "the_13th_warrior",
    "the_incredibles",
    "up",
    "bumblebee",
    "9",
    "the_good_dinosaur",
    "super_8",
    "tomorrowland",
    "next_gen",
    "finding_dory",
    "soul",
    "avengers_endgame",
    "road_to_ninja_naruto_the_movie",
    "your_name",
    "my_little_pony_a_new_generation"
  ]
}