{
  "id": 2851,
  "title": "The Water Horse",
  "starring": [
    "Alexander Nathan Etel",
    "Emily Watson"
  ],
  "runtime": 112,
  "genre": [
    "Family",
    "Adventure",
    "Fantasy"
  ],
  "description": "A lonely boy discovers a mysterious egg that hatches a sea creature of Scottish legend.",
  "releaseYear": "2007",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/h9DV6KItNutJmrPzT1xrAO6fIzy.jpg",
  "categories": {
    "plot": 7.285714285714286,
    "acting": 8.2,
    "ending": 5.0,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 7.4,
    "funny": 9.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "An excellent children's film done with taste and quality as only the British can do. There's no bathroom jokes, no crude sexual references or senseless slapstick. Instead, we get a wonderful story about loss and friendship overlayed with fantasy and whimsy. This film is definitely four stars in my book"
    },
    {
      "rating": "7",
      "text": "The Water Horse is an excellent, very well made children's film with some fine performances, a lovely script about loss and friendship, and some really good special effects to boot. While not perfect, especially in terms of bloating of the run time, this is a really enjoyable, pleasant surprise of a movie. It's very tasteful and mature at times. Definitely check this one out if you like family films."
    },
    {
      "rating": "2",
      "text": "This movie scared my 5 year old and I hated everything about it. The plot was predictable and hokey. There were completely inappropriate and incongruous story lines about adult relationships. The expected bonding and mutually nurturing relationship between child and beast is completely undermined when beasty tries to EAT the little boy! The beast changes its mind for unclear reasons, so instead of teaching that relationships are beautiful and worht trusting, the lesson is something akin to \"stuff happens\". I understand the need to suspend belief with this type of movie, but the ending action sequence was just plain stupid. They then left it wide open for a sequel in the most blatant way possible, one that I will certainly miss. My nine year old thought it was fair, so I'll give it a generous 2."
    },
    {
      "rating": "4",
      "text": "Predictable. This movie uses the same, boy without a father finds a friend and a father and a lover for his mom, but without being all that interesting. It may seem a little trite to call a children's movie predictable, but at least Ratatouille and Stardust kept me entertained. This movie just drags on and I saw it the first time when it was Free Willy."
    },
    {
      "rating": "2",
      "text": "A big flop of a kid's movie."
    },
    {
      "rating": "7",
      "text": "Well, despite what some critics are saying, this is Not E.T., but it is an excellent family film about a little boys telling the tale of the Loch Ness monster and how he came to nuture and protect it the same way Elliott bonded with E.T. The story is practically the same screenplay replacing E.T. with little \"Crusoe\" and Henry Thomas with Alex Etel, who may be a couple of years older, but is still the perfect choice to play Angus as he was to play Damian in Millions. The kid is just wonderful. The scenes with Angus swimming with the grown creature are amazing and all the f/x are top-notch. The Water Horse stands alone as a great family film without comparisons to that other childrens buddy movie, but you don't need kids as an excuse to go see it"
    },
    {
      "rating": "8",
      "text": "This is the type of story that, in the pre-CGI days, would have made a classic animated film. The naturalistic acting and seamless effects leave, perhaps, too little to the imagination. The story is a bit thin and the action sequences a bit too padded, but what's here is excellently done, Fans of this should absolutely seek out Brad Bird's The Iron Giant, a very similar story and a superior film."
    },
    {
      "rating": "8",
      "text": "I saw The Last Mimzy and The Water Horse on two consecutive nights, and now I have forgotten many elements of the former simply through watching the latter. The Water Horse has a few inconsistencies, but overall is the better of the two films. It is not as aimless, nor does it have the presumptive air of the former, either. The CGI is practically flawless. It works, however, in making Crusoe the Water Horse as real as possible: as we watch, we see Crusoe growing from the size of a box turtle (which it resembles early in its development) to that of a true king of the deep, the Loch Ness \"monster.\" Having been fortunate enough to have traveled to Inverness, Scotland and visiting the Loch itself, I was delighted to see some of the places nearby, including Uruquhart Castle (the ruins on the south side of the Loch). Seeing the Loch itself gives one pause to wonder if a creature could exist, and in one of my own personal slides I have a shot with a black rock on it that I always tell people is one of the humps on the real monster. Regardless if one believes the \"monster\" is real or not, there is something in the air which makes one feel as though there are infinite possibilities no matter how much we think otherwise."
    },
    {
      "rating": "10",
      "text": "It is truly the best film of its kind since E.T."
    },
    {
      "rating": "10",
      "text": "a wonderfully entertaining movie about a creature most of us have heared of at 1 time or another"
    },
    {
      "rating": "8",
      "text": "Rather than truncate calendar time to allow Crusoe to reach adult-size more organically, the \"water horse\" achieves prolific weight gains as a result of his food intake. Since the monster is terrestrial-based, its wondorous metabolism and body expansion plays like a contrivance to keep \"The Water Horse: Legends of the Deep\" under two hours. Nevertheless, this handsomely mounted rite-of-passage story, which grounds its fantastical elements within a realistic setting(like Gullimero Del Toro's \"The Devil's Backbone\" and \"Pan's Labyrinth\"), smartly takes the time to not only consider the boy's grief(over losing a father), but also his mother's. Anne(Emily Watson) is given a reason to be pretty again. She has a choice of suitors. \"The Water Horse: Legend of the Deep\" is wiser than most children's films, because it knows that a mother's rehabilitated heart will help her son(Alex Etel) in the long run more than a purring water horse. Crusoe, by the way, is a triumph of CGI. The water horse is cute as a button in the early scenes, and likewise, menacing and genuinely dangerous when the \"monster\" feels threatened. In other words, the creature is absolutely convincing as a living entity. Like E.T.(and Godzilla), Crusoe has no visible male genitalia, and the screenwriter acknowledges this when Angus wonders aloud, \"If you are a boy?\" If his sister found the water horse, she'd assume it's a girl. The Scottish landscape is properly Scottish; wild and green. \"The Water Horse: Legend of the Deep\" is an uncommonly rich children's movie, almost on par with John Sayles' \"The Secret of Roan Inish\"."
    },
    {
      "rating": "7",
      "text": "What a sweet and special movie. Finely acted, very professionally done. An exceptional family film, all ages will enjoy it. Good special effects."
    },
    {
      "rating": "10",
      "text": "A family film that is destined to become a classic!"
    },
    {
      "rating": "10",
      "text": "An extremely wonderful family film. Wonderfully touching story about a heart sick boy who is learning to go on without his father with the help of an unusual friend."
    },
    {
      "rating": "10",
      "text": "Truly a family film that all will enjoy. While most films directed toward a younger audience often lead an accompanying parent to catnap, this film was a delight to watch with my sons."
    },
    {
      "rating": "6",
      "text": "not my favorite, but it has the source material and the actors were supportive."
    },
    {
      "rating": "6",
      "text": "The plot has numerous holes but the film is still a cut above most like it with its heart and good acting."
    },
    {
      "rating": "7",
      "text": "The film is adventurous, funny, charming, thrilling and visually stunning. And it adds with a few impressive performances. It is definitely one of our times most innocent tales. I give this movie 75%."
    },
    {
      "rating": "9",
      "text": "Directed by Jay Russel (My Dog Skip) and based on a novel Dick King-Smith (Babe: The Gallant Pig) The Water Horse takes place in Scotland during WWII and follows young Angus MacMorrow (Alex Etel, ‘Millions’) who discovers a mysterious egg on the shore of the Loch. Soon the edge hatches a aquatic reptile which Angus names Crusoe. Along with his sister and hired handyman Mowbray (Ben Chaplin) Angus must hide Crusoe from his mother (Emily Watson) and the Royal Artilery regiment that has taken residence around his home (watching the Loch in case German submarines attempt to penetrate).\r Now, if you were like me seeing the trailers for The Water Horse in 2007 you thought: \"Another E.T. knock-off? Pass.\" And yes, Water Horse certainly is in the same vein as E.T., but that doesn't make it any less of a film. While some antics with Crusoe borrow from the E.T. handbook this is a film filled with heart, characters you can relate to, and some top-notch acting that at times makes you feel as if you're watching a full fledged World War II drama.\r Unlike most films which fall under the E.T. umbrella Water Horse isn’t purely about cute children and creature antics. This film has some real dramatic heft to it at parts and the acting is all around outstanding. In particular the interactions between Angus and Mulbury, and/or his mother are outstanding. Young Alex Etel really does turn in a remarkable performance being able to perfectly share the screen with Chaplin and Watson. I especially love the interactions with the Mulbury character. Mulbury becomes aware of Crusoe early on so that it isn’t just children hiding the creature from adults for 110 minutes. Having an adult character’s perspective I feel really helps draw older viewers into the magic of the story. By helping the children hide Crusoe he shows a level of respect adults in this kind of film seldom do (usually adults only exist to scream and endanger the creature).\r Of course this Water Horse wouldn’t be so legendary if it didn’t have the special effects necessary to bring Crusoe to life. The technical wizards at Weta (The Lord of the Rings, King Kong) make the most of the film’s $40 million budget and, quite frankly, turn in better effects than many films I’ve seen with three times the resources. While the computer generated Crusoe can appear dated in some respects –either do to budget constraints or technological advances since the film’s release—the character is incredibly expressive and radiates warmth and –when the film calls for it— menace. This is a great computer generated character from the best in the business and because of it the film will age better than most other contemporary family pictures released during the 2000s. Scenes of Crusoe carrying Angus above and below the surface of the Loch are simply breathtaking and are sure to fill you with a childish sense of wonder.\r If you have children or simply want a well-acted fantasy film I can’t recommend this film enough. It isn’t without its flaws, but it more than makes up for them with its radiant heart and top-notch acting performances. In a sea of mindless children’s films which profit on crude humor and slapstick Water Horse is a genuinely heartfelt motion picture which I wish we’d see more of. Many people –myself included- missed out on this film at the cinema in 2007 but I promise you this is a film worth sharing.\r There is a kind of magic in the cinema, especially when seen through the eyes of children. The Water Horse has that magic, and I know beyond reason of doubt that when I have children and they’re old enough to watch their first movie films like The Water Horse are going to be at the top of my list. For that reason I am giving this film my highest recommendation."
    },
    {
      "rating": "8",
      "text": "The water horse is a very interesting movie, because of the design of the titular creature, the ending is great and the creature just looks awesome, This is definitely is for any action animal movie fan and any other related sub genre's."
    },
    {
      "rating": "9",
      "text": "Water horse is an original film that shares what is the human relation with the nature, however it could be (simple, or incredible, not caring about what other people would think), and also about how wrong is humanity with its intentions with the earth and its beasts."
    },
    {
      "rating": "5",
      "text": "it never can foliate into a storyline..The Water HorseRussell's petty attempt to make you care for an innocent creature grows on you, if you reach out for the material that it never can foliate into a storyline. The metaphor that it circles upto at the end of the line is undeniably fascinating but that is all King-Smith whose novel, The Water Horse from which it is adapted. As far as the execution is concerned, Russell fumbles a lot and isn't convincing enough to make us fall into this magical tale. His tactics that he uses to depict the relationship of the creature with each character is never the issue, it's those pawns on the plot that dresses up as a soldier and doesn't act like one, they are the real threat.They are unfortunately not taken seriously. And as far as the gags that builds up the bond between the creature and the protagonist too, at times is taken afar, especially all the scenes with the dog. The characters aren't expressive either, their tone is unstable and dull, either their maturity and subtlety surprises you or the loudness, there is no balance. It has few good husky bits that keeps you hooked, like the Morrissey's evolved character, Chaplin's uncertain past and Water Horse's mythological tale. Watson is the only stunning performer in this cast.Her stereotypical overprotective nature welcomes you into this house with ease. Chaplin and Morrissey fails to deliver like required and the young cast holds on to their part decently if not anything extraordinary. The visual effects could have been a lot better along with the editing and logistics that raises the question against the story and not with. The Water Horse is an essential movie that is apt for the political situation that represents society but frankly this material is piled upon the hoax of commercialism."
    },
    {
      "rating": "9",
      "text": "The story of this film is clearly inspired by the legends surrounding the \"Loch Ness Monster\", a creature that supposedly inhabits Scotland's deepest and most famous lake. The script is based on the deep relationship between the creature, a \"water horse\", and a young boy who had few friends, fear of water and an unresolved mourning after his father died in a shipwreck, probably provoked by a German submarine (everything happens during World War II). It does not matter if you believe in the existence of this creature or not, the fact is that the film works well as a family movie, creating a moving story and managing to form a strong bond of empathy between the audience and the characters, especially the boy, his mother and the little monster, who is a perfectly lovely creature. Everything was thought to create empathy with the audience, to involve our emotional side, and this works wonderfully well. A curious point is that the great villains are the British soldiers, with a deeply harsh and somewhat imperialistic pose, which may possibly be a subliminal criticism of the relationship between the English and the Scots.Alex Etel did a good performance in the role of little Angus and Brian Cox also performed very well with the task of playing the character these days. Ben Chaplin made a very good character who made an excellent counterpoint to the villain, the British official played by David Morrissey. Emily Watson also pleased me, playing a careful, stiff but loving mother who has recently widowed and still misses her husband. However, it's the monster that enchants and deserves greatest attention. Of course, it's great quality CGI. The cinematography is excellent and the Scottish landscapes enchanted me, with large green hills and picturesque villages. The soundtrack is very good and plays its part wonderfully, but is quickly forgotten after the movie ends.Overall this is a great movie for an afternoon with the whole family and it has everything for everyone, but it will be especially appealing to the younger ones of course. I recommend!"
    }
  ],
  "recommendations": [
    "bambi",
    "the_iron_giant",
    "brave",
    "alpha",
    "a_monster_calls",
    "finding_nemo",
    "the_good_dinosaur",
    "luca",
    "the_boxtrolls",
    "kubo_and_the_two_strings",
    "smallfoot",
    "brother_bear",
    "okja",
    "stand_by_me_doraemon_2",
    "eight_below",
    "the_polar_express",
    "the_incredibles",
    "the_road_to_el_dorado",
    "raya_and_the_last_dragon",
    "song_of_the_sea",
    "christopher_robin",
    "the_kid_who_would_be_king",
    "onward",
    "how_to_train_your_dragon_the_hidden_world",
    "isle_of_dogs"
  ]
}