{
  "id": 62,
  "title": "The Marksman",
  "starring": [
    "Jacob Perez",
    "Harry Maldonado"
  ],
  "runtime": 108,
  "genre": [
    "Action",
    "Drama"
  ],
  "description": "Jim Hanson’s quiet life is suddenly disturbed by two people crossing the US/Mexico border – a woman and her young son – desperate to flee a Mexican cartel. After a shootout leaves the mother dead, Jim becomes the boy’s reluctant defender. He embraces his role as Miguel’s protector and will stop at nothing to get him to safety, as they go on the run from the relentless assassins.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6vcDalR50RWa309vBH1NLmG2rjQ.jpg",
  "categories": {
    "plot": 6.875,
    "acting": 7.125,
    "ending": 5.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 8.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "A hit or miss thriller, that was enjoyable. Not for some people, and is quite sad at times. But Liam Neeson was great and I enjoyed most of this movie."
    },
    {
      "rating": "5",
      "text": "After Honest Thief, Liam Neeson continues sliding from his now-traditional action hero to a kinder, gentler adventure. He plays an Arizona rancher and former Marine sharpshooter who ends up protecting an immigrant boy from the vicious Mexican cartel that chased him to the US for revenge on his family. The duo ends up on a road trip pursued by the bad guys, while forging the inevitable bond. If this sounds predictable, you have no idea. Nothing about the writing or plot is original and the action holds no thrills. Not sure when will Neeson tire of these formula films, but we already are."
    },
    {
      "rating": "8",
      "text": "I actually really enjoyed this movie. This is a perfect example of how inaccurate the critics are, this movie was great. Liam Neeson's character was very likable. Not a shoot 'em up without thinking or story. it actually had character and plot. It wasn't a cheerful movie, but the happy moments in the film really shine. I strongly urge you to see this movie."
    },
    {
      "rating": "8",
      "text": "Liam Neeson's character was very believable and likable, you care for him. The movie was good for most of its runtime. Not the most unique story, but it was handled well."
    },
    {
      "rating": "9",
      "text": "This movie is a great reflection for the time we live in, and it does not get overtly political, the action scenes are realistic, and the characters have human abilities and emotions. Without spoiling the movie, a lot more happens than what you see in the trailers and was exciting and emotional. Liam Neeson and Jacob Perez have great chemistry, and I loved the ending because the choices they make are so much more realistic than a classic \"shoot 'em up\" action movie. Highly recommend!"
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "7",
      "text": "Liam Neeson is back in “The Marksman” and despite some flaws; the film provides what his fans want and is an engaging and topical film.Neeson plays Jim; a widower who spends his time on a tiny and struggling ranch in Arizona near the border. Jim is facing foreclosure from the bank after dealing with devastating medical bills for his late wife and feels that as a former Marine he has been given a bad deal by the system.Jim often drives along the border fence and radios in suspected crossings but is willing to provide aid to those who finds in distress.When Jim encounters a young woman and her son Miguel (Jacob Perez); he is drawn into conflict when they are pursued by some dangerous people which forces Jim to shoot when weapons are drawn killing one of the group in the process as well as the boy’s mother.Jim turns the boy over to the Border Patrol where his daughter Sarah (Katheryn Winnick), is in charge of the local office and is concerned when he learns the boy is to be sent back to family. Seeing the individuals he had previously had a gunfight with waiting for Miguel to cross; Jim decides to honor the dying wish of Miguel’s mother to take him to family in Chicago; even when that means abducting Miguel from custody.The trip not only puts Jim at odds with his daughter but as well as Miguel who wants to return home and causes the dangerous individuals to cross into the U.S. to ruthlessly track Jim and Miguel to exact their revenge.The film moves at a steady and deliberate pace until the finale gives fans a taste of the action that they would come to expect. It does take some patience as I saw numerous opportunities for a person of Jim’s skill to attempt to set an ambush, trap, or counter the dangers facing them but the final resolutions are enjoyable and satisfying.While the film does not have the action and intensity of some of Neeson’s recent works; it does provide enough entertainment to make it worth a watch and does contain content based on some very volatile and controversial topics which would spur intense debate.3 stars out of 5"
    },
    {
      "rating": "5",
      "text": "It's pretty much the same thing as every other recent Neeson movie, in that when he is firing a gun there is fun to be had, but the rest of the film is blah."
    },
    {
      "rating": "7",
      "text": "The Marksman isn’t going to please fans that want wall-to-wall action. This is a slightly different Liam Neeson movie - one with a bit more heart. In some ways it reminds me of Clint Eastwood’s The Mule. It comes as no surprise that the director has often worked with Eastwood because you can imagine him in this role. That said, Neeson is great. Critics sometimes say he’s phoning it in with this post-Taken phase of his career but I don’t agree. All of the films have been interesting in their own way. Here Neeson gets to display more heart and empathy than usual - which is why I’m sure he signed on. The first-time actor who plays the young boy Neeson’s character helps is also great. They share a very good on-screen rapport. Like The Mule this is ultimately a road movie and I thought it was a very enjoyable one. Highly recommended."
    },
    {
      "rating": "6",
      "text": "Not one of Liam Neeson's better films. His acting was fine but the story was somewhat of a yawner. Most scenes were predictable so it diminished the suspense."
    },
    {
      "rating": "5",
      "text": "I don't know, to me it felt pretty average. I mean yes it was ok, but there was not really much to it and especially that I have seen many Neeson action movies in a row lately, this did not feel like nothing new really. Maybe if Liam wouldnt have made so many action type movies which have similarities to this, would be better, but yeah. It was not bad, but nothing that interesting to it."
    },
    {
      "rating": "4",
      "text": "The Marksman is just another movie that draws on the same tedious and monotonous formula that Liam Neeson has already exploited too many times before, and his works have long shown a blatant recycling of both narrative and acting patterns."
    },
    {
      "rating": "4",
      "text": "(Mauro Lanari)At the same time the formulaic version of \"News of the World\" (Greengrass 2000) and an Eastwood film shot from the hospice (Robert Lorenz is best known for his collaborations with Clint as assistant director and producer). Who knows if anyone remembers that until a dozen years ago Neeson was not yet engulfed in action roles, but showed that he could also play in committed parts and works."
    },
    {
      "rating": "7",
      "text": "No es la mejor película de la historia, pero te entretiene mucho y la actuación de Liam Neeson es muy buena; es recomendable."
    },
    {
      "rating": "6",
      "text": "During Covid, I call this comfort food.  Put your brain in neutral, and try not to think too hard about this one."
    },
    {
      "rating": "0",
      "text": "Poor writing with no proper cause and effect, dog dying for absolutely NO reason and it doesnt even make sense because the dog had been so smart the whole movie. The writers just decide randomly to make the dog approach the cartel men alone. Either way a stupid death, the dog did not deserve that and it wasnt a meaningful death either. The action scenes were a disappointment, except for only one scene where neeson makes a car flip over. The movie is slow and boring and the ending is the cherry on top, with liam neeson basically dying (tho wikipedia says \"unconscious\" but stupid nonetheless how he didnt even call 911 right away and go to the hospital. Its unrealistic that the mexican cartel would have its hands on every police/hospital in the U. S. and he couldhv easily gotten help right after the \"big fight\" at the end.) besides, if the cartel is so powerful with its hands stretched out so wide then how does he know its safe for miguel once he is with his aunt in chicago?? Cant the cartel easily find him there if they are that determined to find miguel? I guess since the boss guy died theres less danger of that, but this movie had poor writing nonetheless. Neeson and miguel also burn all the money that miguel's mother saved for her son as she died. My family and i all laughed at that part because of how ridiculous it was. also, this movie seems HEAVILY pro-gun. which is fine, but its done so blatantly that it takes away from the immersive-ness of the film."
    }
  ]
}