{"id": 265, "title": "The Nightmare Before Christmas", "starring": ["Chris Sarandon", "Danny Elfman"], "runtime": 76, "genre": ["Fantasy", "Animation", "Family"], "description": "Tired of scaring humans every October 31 with the same old bag of tricks, Jack Skellington, the spindly king of Halloween Town, kidnaps Santa Claus and plans to deliver shrunken heads and other ghoulish gifts to children on Christmas morning. But as Christmas approaches, Jack's rag-doll girlfriend, Sally, tries to foil his misguided plans.", "releaseYear": "1993", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/oQffRNjK8e19rF7xVYEN8ew0j7b.jpg", "categories": {"plot": 8.363636363636363, "acting": 8.625, "ending": 7.5, "soundtrack": 9.833333333333334, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 6.75, "action": 5.0}, "reviews": [{"rating": "10", "text": "A stunningly imaginative stop-motion classic from Henry Selick and Tim Burton that's packed with unforgettable characters, catchy music, and holiday spirit."}, {"rating": "10", "text": "I admit it, I really like Tim Burton. I know his films are very oddball, but he has a wide imagination and his films are visually amazing. And I like a vast majority of his films, Edward Scissorhands being my personal favourite, and I love Batman and Batman Returns too. Henry Sellick is also promising, from the likes of James and the Giant Peach and Coraline. The Nightmare Before Christmas is a brilliant film. Is it an animated classic. Yes I think it is! It is wonderfully weird yet lots of fun as well. Visually and technically, the film looks absolutely amazing, with wonderful Gothic backgrounds and detailed colouring. Skellington silhouetted against the moonlight is quite possibly the film's most haunting image. The story is great, about Jack Skellington discovering ChristmasTown but doesn't understand the concept so he kidnaps Santa Claus. And the characters are endearing and weird, ranging from jazz playing zombies, Four-tenor like vampires to a wolf man. Then we have the title characters, Jack Skellington is a wonderful protagonist, really interesting to say the least. And Sally for an inventor's creation is very beautiful. The songs from Danny Elfman(the fact that he didn't get an award for his score for Edward Scissorhands is the biggest music snubs ever) are great fun, haunting, funny, clever and intelligent. The voice acting is top notch, Chris Sarandon does a great job as the speaking voice of Skellington, and Danny Elfman himself provides the singing voice superbly. Catherine O'Hara is sweet and innocent, and Ken Page(the voice of King Gator in All Dogs Go To Heaven) is a hoot as Oogie Boogie. All in all, weird, but visually stunning, funny and intelligent animated movie. A definite classic! 10/10 Bethany Cox"}, {"rating": "10", "text": "Overall FantasticNightmare Before Christmas is a perfect mix of Halloween and Christmas with terrific stop motion animation."}, {"rating": "10", "text": "Have always loved this movie! One of my favorite! Tim Burton gives us a dark, but charming twist on a children's film that makes it so appealing to our eyes, we want to watch time and time again. I have never seen a bad movie from this guy and he keeps on surprising us with other movies like Beetlejuice, Corpse Bride, Edward Scissorhands, etc. A must see!"}, {"rating": "8", "text": "\"The Nightmare Before Christmas\" is a Christmas movie that has stunning creativity with catchy tunes. Easily one of the greatest Christmas movies ever."}, {"rating": "10", "text": "Visually beautiful, stunningly original, with some great music and some dark humor. Nightmare Before Christmas teaches kids great messages and brings some entertainment to adults also. I give this film 99%."}, {"rating": "9", "text": "Nothing short of fantastic, made in 1993 the use of stop-motion technology is fantastic and the characters could only come from Tim Burton's mind and the environment surrounding the story is so simple that it deserves the universal acclaim it gets"}, {"rating": "10", "text": "The Nightmare Before Christmas is my favorite movie to watch during both Halloween and Christmas time ever year. It has spectacular visual effects. The story and screenplay are remarkable. The soundtrack phenomenal and I especially love the songs This Is Halloween, Sally's Song, and What's This. The soundtrack is my favorite animated movie soundtrack, my 3rd favorite movie soundtrack of all time and one of my favorite albums of all time. The voice over performances were stupendous and very well done especially from Chris Sarandon/Danny Elfman, Catherine O'Hara, Ken Page, and William Hickey. The Nightmare Before Christmas is my favorite Halloween movie of all time, my favorite Christmas movie of all time, my favorite stop-motion movie, one of my top 5 favorite musicals, one of my top 5 favorite animated movies, and one of my favorite movies of all time. This is an A+ movie."}, {"rating": "8", "text": "Pretty good movie. I can see why Jack Skellington has so many many fangirls. Although, I felt there were kinda too many songs, and I usually don't have a problem with musicals."}, {"rating": "5", "text": "The Nightmare Before Christmas is undeniably one of the most unique Christmas movies of all time and also put a completely new complexion on Disney movies. The beautifully conducted stop motion technique, the catchy musical numbers that may not be counted as Danny Elfman’s compositional masterpieces, but still make the movie a lot more entertaining than it would have been without them, and the weird sort of humour that isn’t to make you laugh out loud, but have you chuckling almost perpetually. Nevertheless, it’s still a bit disappointing that a movie this sort can still be boring here and there and the screenplay also isn’t always successful in maintaining an acceptable balance between child-oriented silliness and adult-suitability (though I adore the Hamlet reference). Through that, difficulties arise as the movie ends up being too ridiculous for most adults and too scary for most kids in the target audience. But still I’d say that sparing one hour and fifteen minutes to see this truly one-of-a-kind movie can’t hurt."}, {"rating": "8", "text": "The Nightmare Before Christmas is an animation as scary as cute and its story is quite funny."}, {"rating": "6", "text": "THE NIGHTMARE BEFORE CHRISTMAS was an interesting idea for a family/horror/musical blend, but especially for a Tim Burton film, it wasn't really achieved all that well. Sure, this was a cute one, and it was definitely enjoyable; it just, looking at it from a critical perspective, was not the best movie."}, {"rating": "5", "text": "There's no denying it's a unique looking movie and I could totally see why it has become the cult classic that it is. I just had a bit of a hard time getting into it. Jack falling in love with Sally when he spends the vast majority of the movie ignoring her existence, The entire third act was just a drag for me and the attempts to cram certain characters into the villains' role simply didn't work for me. TBH, It is overrated to me but as I said before, I could totally see why someone would love it."}, {"rating": "10", "text": "This is a unique and unprecedented film. It will never be matched as far as artistic style and execution are concerned. It is a holiday classic that can be viewed both at Halloween and Christmas! So great. Seriously something else. The animation is simultaneously creepy and endearing. I don't exactly understand how something with this flavor can be produced. I don't need to know. It's great. It's not my favorite movie ever or anything, but it deserves universal acclaim."}, {"rating": "10", "text": "A very original, creative and visually enjoyable movie. This is one of Tim Burton's best movies and a wonderfully original spin on the traditional Christmas movie."}, {"rating": "10", "text": "The Nightmare Before Christmas made in 1993 is a Halloween themed cartoon movie about a place called Halloween town. Halloween town is a special place where anything Halloween themed and Halloween related live, scary and strange things like monsters, werewolves, vampires, skeletons, zombies and many others things. The most popular Halloween creature of them all is a tall slender skeleton in a suit, his name is Jack Skellington. Jack Skellington voiced by Chris Sarandon and Danny Elfman (singing voice) is getting bored of doing the same thing every year for Halloween, so he stumbles across a door which leads to a Christmas themed world. Jack Skellington gets very interested and decides that he wants to celebrate Christmas instead of Halloween.\r Overall The Nightmare Before Christmas is very fun to watch with a family and children love it. This movie is perfect for children to watch at Halloween or even Christmas. I like The Nightmare Before Christmas because it has a very unique story. I would love to see a sequel, it"}, {"rating": "10", "text": "Unbelievably inspired, original and honestly a feast for the eyes. My only qualm is that the movie is a bit short and not very climactic, but when the universe beyond the screen is so full of beautiful imagery, emotional musical numbers, and tenderness, it's difficult not to get lost. When everything is so imaginative and alive, pulsating with wonder, it's hard to be anything but captivated. And when the scenery before you is so enchanting that you dream of reaching out a fingertip so as to touch another world, it's impossible not to fall in love."}, {"rating": "10", "text": "This is one of my favorite movies of all time. His spin off of holiday classics are great. I like his vision of the boogie man. Disney let him make this and that's a good thing. Just the genious of this counts. So you'd better pay attention now, because I'm giving this a ten out of ten!"}, {"rating": "9", "text": "Ladies and gentlemen, one of best proposals of stop-motion. The collide of two worlds through the daring experience of Jack and his colorful friends. The only thing you will regret is why something so good it's so short. One of ultimate movies of 90's."}, {"rating": "7", "text": "A really good children film And a good reason why we need more stop motion b"}, {"rating": "9", "text": "The Nightmare Before Christmas. It's Halloween! A wonderful fairy tale for the whole family. There are interesting characters, wonderful songs and a magical plot here. Everything you need to watch in the evening."}, {"rating": "8", "text": "I don't love musicals. Even so, it's an instant classic. Great songs, great animation, great everything."}, {"rating": "7", "text": "This animated film for adults and adolescents focuses on Jack Skellington, the most notable citizen of Halloween Town, and the unexpected trip he made to the Christmas City, where he discovers the Christmas spirit without, however, understanding it. Directed and written by Tim Burton, the film features the voices of Danny Elfman, Chris Sarandon, Catherine O'Hara, William Hickey and Glenn Shadix.This is one of the most famous animated films in stop motion and was even nominated for the Oscar for Best Visual Effects due to the quality of animation achieved. Tim Burton has talent, especially for films considered strange or out of standards. Horror or mystery themes are rather visited by the director in the form of animations (\"Corpse Bride\" is the most striking example). In this case, it addresses the celebration of Halloween, a popular holiday in the English-speaking countries, which has begun to be observed also in Latin Europe, timidly, for cultural import of the \"mass media\" (in these countries people celebrate the All Saints Day).The script is very good, funny and directly clashes the two holidays. The characters are imaginative and made with great care. The voices were quite well most of the time. Its noticed how Burton were engaged in the project. Very meticulous, he argued for the greatest perfection possible in the film. The sets and visual effects were at the highest level, playing with the most popular objects of Halloween and Christmas. Photography can displease because of low contrast, but I believe it was the best that could be achieved in 1993, and the film, if it were made today, with digital technologies in filming and editing, would have been a rather different picture. The soundtrack, in charge of Danny Elfman, is excellent. He also composed all the songs that are sung in the film. Some of them stays in the ear, others are quite moving, as the songs interpreted by the \"rag doll\" Sally.For all these reasons, this movie is a reference in contemporary animation, and is suitable, in particular, for lovers of the scariest day of the year."}, {"rating": "9", "text": "A pure classic. If the animation isn`t for you don`t force it. If you can dig the animation or just handle it then watch this. It is so beautiful. Some of the songs still give me chills to this day."}, {"rating": "9", "text": "Esta película simplemente es sobresaliente en cada uno de sus apartados, contando con una muy buena historia, personajes, una innovadora calidad gráfica, escenarios bellos, animaciones e incluso, lo que pocas películas hacen bien... que es... una buena banda sonora! El Extraño Mundo De Jack es una obra maestra."}, {"rating": "8", "text": "This is a fun, quirky stop motion animation film which I imagine many kids may find a little spooky but not scary like in a slasher film sort of a way - as is the appeal to it for parents, I imagine. It has the definite Tim Burton feel to it, being a mash up of (primarily) Halloween related figures/characters reacting to the sudden knowledge of the holiday of Christmas, which is, of course, the polar opposite holiday in terms of tone etc.I quite enjoyed both the characters and the musical numbers. I quite like that its relatively fast paced at times - its certainly a bit of fun and it looks pretty good in HD. I appreciate well done stop motion animation and this is certainly one of those. If you haven't seen it, I'd say its worth a watch. Its not particularly amazing or brilliantly memorable, I suppose but its certainly not bad, or frustratingly depressing for that matter, either."}, {"rating": "10", "text": "Buena trama, canciones memorables y animación impresionante, es de las mejores películas de los noventas.¡TOTALMENTE RECOMENDADA!"}, {"rating": "6", "text": "Ok movie kind of funny. I just thought it looked cool back then. Tim Burton made some really big hits back then."}, {"rating": "10", "text": "Possibly one of my favorite animated movies and halloween movies, self-explanatory if you've watched it."}, {"rating": "9", "text": "Classic movie to watch at both Halloween and Christmas I even sometimes watch it in summer and the soundtrack is on absolute fire."}, {"rating": "10", "text": "Crecí con esta película, por ende, es normal que la nostalgia cree en mi una variante que me haga ponerle un 10 sin pensarlo. Sin embargo, déjenme aclararme, Pesadilla antes de navidad (o también conocido el Extraño Mundo de Jack en Latinoamérica [Prefiero el nombre de Pesadilla antes de navidad, todo sea dicho]) es una obra Stop-Motion sobre las grandes celebraciones del año: Halloween, Navidad, San Valentín, etc. Las cuales se ven afectadas por el descubrimiento de los portales que las vinculan unas de otras. El carisma y canciones presentes en la obra son de excelencia, no tengo queja alguna, puedo decir de memoria todos los diálogos de la película, al igual que las canciones, con precisión y con el mismo tono de voz que dan en ellas. Para mi, es la mejor película que he visto nunca (siguiéndola Coraline y demás obras) con personajes que hasta a día de hoy con mis 18 años aun recuerdo con mucho cariño y nostalgia (como dije en el principio). ¿Qué es? ¿Qué es? La mejor película de Tim Burton's."}, {"rating": "10", "text": "The best animated movie and the best Halloween movie no contest needed. Highly recommend you to watch it."}, {"rating": "10", "text": "This film is a fantastic classic and is an essential to watch every Halloween and Christmas. It's clear from every scene and song that expert attention to detail and a great amount of passion went into this film. The songs are fantastic and catchy when they need to be, but quiet and subtle at other points when it was important. The film has a powerful message and should be given the full credit for what a lovely work it is."}, {"rating": "10", "text": "'The Nightmare Before Christmas' is an animated dark fantasy movie that was directed by Henry Selick. Later in 2009, \"Coraline\" (a fantasy movie based on the novel that was written by Neil Gaiman) was also directed by Henry Selick, where he worked as a producer too. A poem, on which 'The Nightmare Before Christmas' is based upon, was written by Tim Burton in 1982, but the production only started in 1991 with a budget of $18 million. The famous song for this movie, which is called \"This is Halloween\", was written by Danny Elfman in 1993.The main character, Jack, lives in a Halloween Town, where many other monsters also happen to live. Jack is interested in Christmas Town, which he finds unexpectedly, and learns all about Christmas, which he thinks is amazing. Eventually he wants to celebrate Christmas with just himself, the other monsters, but without Santa. It isn't long before Jack learns that even the best-laid plans can sometimes go awry.'The Nightmare Before Christmas' is a good movie to watch on Christmas day, but even better on Halloween or the days leading up to it.Written by Anastasiia Shystovska"}, {"rating": "9", "text": "Here is, one of the best creation from Tim Burton, magnificent movie, very good songs and visually so beautiful."}], "recommendations": ["a_christmas_carol", "tangled", "the_princess_and_the_frog", "winnie_the_pooh_blood_and_honey", "treasure_planet", "aladdin", "klaus", "the_lion_king", "arthur_christmas", "the_sword_in_the_stone", "frankenweenie", "rio", "anastasia", "charlie_and_the_chocolate_factory", "the_grinch", "trolls", "atlantis_the_lost_empire", "vivo", "toy_story", "the_polar_express", "over_the_moon", "who_framed_roger_rabbit", "the_muppets", "finding_nemo", "mary_poppins_returns"]}