{"id": 4835, "title": "The Banker", "starring": ["Anthony Mackie", "Samuel L. Jackson"], "runtime": 120, "genre": ["Drama"], "description": "In the 1960s, two entrepreneurs hatch an ingenious business plan to fight for housing integration—and equal access to the American Dream.", "releaseYear": "2020", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/biXzsw22U6vSd0XktmZwAOc4uik.jpg", "categories": {"plot": 8.2, "acting": 8.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "The Banker had a rough start. It suffered the infamous true story to movie syndrome, which is like the book to movie syndrome but ten times worse. You can’t tell a person’s entire life in a movie without either seeming disjointed or changing the source material massively. Too many events happen in a person’s life and not all of them are going to fit into one convenient narrative. The best thing to do when adapting a true story to the screen is to make it a TV show. TV shows do not need to have the same pacing as a film and can cover multiple arcs both on an episodic and serialised basis. And that’s what they should have done with the Banker. The film skips over a large and extremely significant part of the characters’ lives and sometimes has to sacrifice character building for cramming the sheer amount of events in the lives of these quite extraordinary people into one 2 hour movie. But that being said, once it gets going, the Banker is a really enjoyable film. The writing is good and the plot, while poorly paced, tells a very interesting story. And a story that is important and poignant in today’s social climate surrounding issues of racial tension. And the core of this movie is the brilliant performances by Anthony Mackie and the incredible Samuel L. Jackson."}, {"rating": "10", "text": "This movie is an incredibly powerful true story set during Civil Rights about two forgotten heroes that inspires people to pursue their version of the American Dream at all costs and not let obstacles get in the way such as race and discrimination."}, {"rating": "10", "text": "Great untold story of two ambitious entrepreneurs. A must watch for anyone whose a fan of new source material."}, {"rating": "9", "text": "This film is touching, sad, frustrating and uplifting in all the right places. The best film that Apple TV+ as to offer."}, {"rating": "9", "text": "good story and strong performence. and I love movie about justice. just watching"}, {"rating": "5", "text": "(Mauro Lanari)Ethnic equality of access to the American dream. But hadn't it turned out that it was a nightmare instead?"}, {"rating": "10", "text": "Every human needs to see this movie! Very inspiring, well done! Incredible true story!"}, {"rating": "5", "text": "Two fantastic, very watchable actors, but a story devoid of almost any and all intrigue or interest. Non-eventful, or at least the events depicted were not given enough gravity."}, {"rating": "8", "text": "This is an interesting story. It was frustrating to see the racist attitudes of locals in the area. I liked Nicholas Hoult in his role - he's a good choice to play the white man representing the bank. I can imagine how frustrating it must have been for the people unable to be taken seriously and given real opportunities due to their ethnicity. The plot is fairly intricate and the good cast helps it be quite a watchable and intriguing watch throughout. Samuel L Jackson and Nicholas Hoult give particularly good performances. I felt this was quite a well told story, quite an engrossing and sometimes relatively tense watch, even if it seems a bit dull and too finance heavy in terms of the basic storyline. I'm not great when it comes to following the intricacies of finance and banking but from a social commentary and legal point of view, this story did interest me and I thought it was reasonably well told. Yes, I'd recommend this film and suggest you stick with it if it seems a little dull after a while."}], "recommendations": ["risen", "the_33", "mark_felt_the_man_who_brought_down_the_white_house", "tolkien", "cloud_atlas", "radioactive", "the_good_shepherd", "searching", "snowden", "the_ballad_of_buster_scruggs", "stillwater", "the_book_thief", "the_last_duel", "child_44", "the_boy_who_harnessed_the_wind", "beirut", "the_hurricane", "the_giver", "unbroken", "the_white_tiger", "the_experiment", "argo", "spotlight", "hotel_rwanda", "bicentennial_man"]}