{"id": 3297, "title": "The Killing of a Sacred Deer", "starring": ["Colin Farrell", "Nicole Kidman"], "runtime": 121, "genre": ["Drama", "Thriller", "Mystery"], "description": "Dr. Steven Murphy is a renowned cardiovascular surgeon who presides over a spotless household with his wife and two children. Lurking at the margins of his idyllic suburban existence is Martin, a fatherless teen who insinuates himself into the doctor's life in gradually unsettling ways.", "releaseYear": "2017", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/e4DGlsc9g0h5AyoyvvAuIRnofN7.jpg", "categories": {"plot": 6.84, "acting": 6.7560975609756095, "ending": 7.714285714285714, "soundtrack": 6.714285714285714, "cinematography": 9.0, "familyFriendly": 3.0, "funny": 10.0, "action": 7.25}, "reviews": [{"rating": "0", "text": "Un titre pompeux et à rallonge pour un film long comme un jour sans pain et chiant comme un dimanche sous la pluie à Dunkerque dans la zone industrielle. Nul doute que ça peut éventuellement intéresser le public des étudiants bobos et des torche-culs du genre Télérama et Positif qui y verront un truc « trop profond » au-delà du delà et après mais en l’état pour un public très normal, ça n’inspire que des baillements à s’en décrocher la mâchoire.La réalisation a été réalisée entièrement sous Prozac à des doses à endormir un mammouth et les dialogues lénifiants dits par des comédiens à l’ouest (drogués, eux aussi, semble-t-il) laissent l’impression d’assister à un défilé de robots qui se comportent comme des automates du siècle dernier. Tout ce petit monde raconte n’importe quoi tandis qu’il ne se passe rien du tout là-dedans, on se demande si on a pas pris des somnifères, nous aussi !Voilà donc un film ou plutôt un pseudo-film qui se la joue et se la raconte mais passe son temps à péter plus haut que son cul : un film très doué pour brasser du vide et nous faire chier, c’en est carrément incroyable de nullité !"}, {"rating": "10", "text": "I remember Tarkovsky (Stalker from 1979 was his best) talking about how he admired Bergman (The Seventh Seal is my favorite of his) and wanted his work to channel the style of Bergman.  Yorgos Lanthimos apparently feels similarly about Stanley Kubrick, because this movie feels so much like a Kubrick film.  The camera following behind the actors, almost stalking them, feels like another character.  The music, ominous and sparse, also feels like a character.  The dialog is very staccato, no harmony in the monotone speaking cadence, really lends an air of characters that live subconsciously. I didn't care for the third act but the first 2 were flawless."}, {"rating": "10", "text": "Killing of a Sacred Deer is the best film I've seen all year, domestic or international.  And I watch any film nominated for an award pretty much.  The Oscar snub of Barry Keoghan (who also stars in Dunkirk, which got plenty of Oscar nods) in the best supporting role is ridiculous.  As it's one of the best supporting performances I have seen in years.  Yorgos Lanthimos ALWAYS delivers.  Some might not be able to take his vision, as it is bleak.  But as far as the art of filmmaking goes, he is the creme of the crop in innovation. 10 out of 10, EASY."}, {"rating": "8", "text": "In this original piece of cinema director gives us his view on a conflict introduced by greek tragedies thousands of years ago - a conflict between a man and his fate."}, {"rating": "10", "text": "I kinda of guess that mysterious boy had decided whom to sacrifice.The mother and daughter partly compromised, begged the strange boy for mercy but the little boy struggled till the end--even tried to shake off the sack on his head.Other alternative explanation is the father's sub-conscious. He had never showed much affection to his son and believed his boy was \"acting\" at first. In contrast,the mother cared about the poor boy and disliked the selfish daughter.It is also metaphoric that the father is a cardiologist(symbolize sense), and the mother is an ophthalmologist(symbolize look through the truth)."}, {"rating": "10", "text": "This was a real cinematic treat. In a time where Hollywood studios continue to churn out version after version of the same formulaic tripe, it's a relief to find a film so original in its conception. Everything from the cast to the cinematography was superb. There was something to admire in every aspect of its construction. Clearly, a project that was well thought out and devised with care. The story is certainly unusual and requires some focus and thought on the part of the audience.  Some of the scenes portray a distinct brutality, often painful to watch, but they combine to convey the story in a very compelling way. Disturbing yet fascinating, with wonderful performances from Farrell and Kidman. Barry Keoghan is outstanding as Martin, the psychopathic young man hell-bent on making his father's killer pay. Excellent work from director/writer Yorgos Lanthimos, his mind is a wonder."}, {"rating": "9", "text": "LIFF31 2017 #1\"A surgeon never kills a patient. An anaesthesiologist can kill a patient, but a surgeon never can\".\"The Killing of a Sacred Deer\" is a mixture of horror, comedy, thriller, and mystery all wrapped up in one bizarre, but brilliant crafted film. Even when you don't fully follow what going on, it at least keeps you interested and engaged. The audience reaction to this was the highlight. Everyone cringed at the brutal parts.Unpredictable is the best compliment I can say. I literally had no idea where it was going and kept surprising me with each scene. I'm kinda lost words with this one. This is me still progressing.The score was brilliant. Having this blast of a roar which shook up the room and was really eerie. The intensity continues to grow as the film moves on, but has it's fair of moments for dark humor. Even the camera work had a Stanley Kubrick vibe.This might be my favorite film from Yorgos Lanthimos."}, {"rating": "10", "text": "Favourite film of the year. It's best not to discuss the events of the movie, as going in fresh really added to the enjoyment. I will say that it's visceral, demented, unique, and surprisingly funny at many turns. It's not for everyone, and when I saw it at TIFF, there were plenty of walkouts. But if you are used to Yorgos Lanthimos' deadpan lunacy, then you should be at home with this one."}, {"rating": "5", "text": "The Killing of a Sacred Deer fills you with so much suspense and dread until you finally find your breaking point. The story, gore and a truly eerie performance by Barry Keoghan accompanied by hair-raising music will try its very best to push you to your limits. Going beyond extreme measures to unnerve you, and if nothing else it achieved that no problem. Directed by Yorgos Lanthimos, so if you haven't experienced anything by this director before it might be a good idea to prepare yourself by watching The Lobster. This is certainly a director you won't forget, his films are so unpredictable and deeply disturbing you either love him or hate him.At its heart The Killing of a Sacred Deer is a revenge story, so dark and cold everything I like in a film but I found myself very disappointed with it. The monotonous and robotic way all the actors are carrying themselves was the biggest distraction. I couldn't believe anything they were saying or doing as something that would actually happen. As the story reaches some of its pivotal moments none of the characters were responding in a way I believed so I found myself getting more and more annoyed with it. I didn't buy into it at all. Barry Keoghan is definitely the stand out performance, he has an amazing on screen presence. Chilling and will make your skin crawl. A modern day Greek tragedy is what everyone loves to call this but don't worry you'll pick up on that analogy soon enough as the movie takes any opportunity it can to remind you that yes this is a tragedy, this whole situation is so unbelievably tragic, how did we possibly get into this unbearable tragic situation. It gives a new meaning to the word disturbing so if that idea interests you then The really tragic Killing of a Sacred Deer is recommended."}, {"rating": "7", "text": "The film was awfully tense, absolutely terrifying. I'm not quite too sure how I really feel about it. Haven't actually seen the lobster yet, so I wasn't really quite sure what to expect when walking in. But I truly did enjoy this film and the experience that it brings. It's a **** horrible situation that the film displays in a haunting dream-like tense quality."}, {"rating": "8", "text": "This film is a hard nut to crack but the performances are all standout and you really get the chills thinking about it afterwards.  Not nearly as good last year's \"The Lobster\", Yorgos Lanthimos is still able to get a reaction that's different and daring. A-"}, {"rating": "7", "text": "I'm really torn on whether this movie is a 7 or an 8. Consistently intriguing and funny, it's also incredibly bizarre and disturbing. Unlike \"Lobster\", which gave you a clear idea of what it's about and then developed that idea in some interesting and surprising way, \"Sacred Deer\" takes a weird plot twist in the middle, leaving you confused in terms of what the hell was this movie actually about. After thinking about it for a longer time, I think it was pretty good, just a bit too bizarre."}, {"rating": "7", "text": "Wow! I don't know how I feel about this film.  It's going to have raging fans and raging haters.  I think nobody can tell you about this film, you really have to experience it for yourself.  I use the word 'experience' because it is exactly that.  The script is great, the dialogue is monotone, emotionless and ambivalent - by design of course. It's uncomfortable to watch but you will never come to grips with the film if you do not sit through it all the way to the end.  About half way it will grip you and won't be able to leave the screen.  Even if you hate it in the end, you'll be all the poorer for not seeing it."}, {"rating": "6", "text": "Colin Farrell plays a cardiovascular surgeon who takes a fatherless teenage boy under his wing (the appropriately creepy Barry Keoghan). Things get bizarre when the conflict between their relationship and his own family (including wife Nicole Kidman) goes in unfortunate and unexpected directions. The characters maintain the stilted stiffness and minimal emotions that director Giorgos Lanthimos adapted for his first equally unusual film (The Lobster). He also embraces an uncomfortable style, a deliberate pace and an eye for eccentric vantage points. There's an unnatural discomfort that pervades the film and it only accelerates as the unfortunate circumstances progress. The abrupt and intrusive music exacerbates the movie's determination to make the experience uncomfortable. Some watching this prolonged, painful, somewhat pretentious process will appreciate the appropriately weird approach."}, {"rating": "6", "text": "Quite a boring film. The plot is loosely based on greek tragedies but there's not much more than that in this film. Some very nice shots here and there, but that doesn't save this film. Is just a panino al pane, nothing more nothing less."}, {"rating": "2", "text": "In the Vulture review from Oct. 27th, the author references three different ancient Greek authors to explain the context of the story. If that doesn't scream convoluted, I don't know what does. The score was, however, incredible."}, {"rating": "9", "text": "Invigorating, humorous, terrifying, mystifying, heartbreaking, and will leave you shaken and disturbed. Well acted and superbly directed. A must watch movie..."}, {"rating": "3", "text": "What a pointless movie. The monotoned dialogue gets old very quickly. The plot is ultra-thin. What genre does this movie fit into other than crap?????"}, {"rating": "8", "text": "Following in the absurdist style and footsteps of last year's 'The Lobster', Colin Farrell and director Yorgos Lanthimos team up once again to bring a film that's not much more weird or different than 'The Lobster' was. However, with that being said, this one is certainly much, much darker and sinister. I certainly enjoyed the deadpan delivery and performances, as well as the haunting score that made both films strangely unique and intriguing to watch. However, this film lacked a bit in terms of imagination, as well as the stunner gut-punch of an ending that 'The Lobster' delivered that left a big impact on me, as I felt a bit disappointed and underwhelmed by not just the ending, but also the overall execution of some of the film, the final act in particular, which felt a bit rushed and uninspired to me. Overall, this was still a well-made absurdist film for the most part from Lanthimos, the director who knows how to do absurdism best, and Farrell, Nicole Kidman, and Barry Keoghan in the sinister role of Martin all turn in worthy performances."}, {"rating": "9", "text": "Yorgos Lanthimos is not a director who plays with detours, or that plays safe, his films are not typical or usual and I can say that only having seen three films of his filmography but it's always nice when a filmmaker dares to abandon more conventional branches and with The Killing of a Sacred Deer he reaffirms it.This is a cold movie and undoubtedly will not be liked by many, either by the plot, the rhythm or how inhuman his characters seems to be. There is not a trace of warmth in all the scenes or the characters but this is essential to endure the film and eventually understand the final part.The Killing of a Sacred Deer is not a film that I can talk to you about it, it's more a film that you must experience and enjoy and it's truly worth it."}, {"rating": "1", "text": "I can't decide what is worse in this movie: plot or dialogues. Full of sickness for those who are turn on \"deep-seated movies\" but it's nothing actually like that."}, {"rating": "9", "text": "I’ll admit right now that I hated The Lobster, and I may have even fallen asleep. So let’s say I was warned about what I was getting into here. So I read a lot of reviews and as with The Snowman where I did the same thing, I was rewarded by really enjoying this movie. My guess is that if you have never seen this director’s work and you go in cold, you may hate this movie. But if you know what you are getting into, pay attention, and have patience, you may find this is a very, very absorbing, enjoyable, and satisfying puzzle of a movie as I did."}, {"rating": "0", "text": "Horrible and slow movie. Trying to be artsy fartsy. one of those movies where you're interested in left to keep watching but still so not interested that you hate that you're watching. Don't watch"}, {"rating": "0", "text": "Just watched the movie tonight....basically the worst movie I have ever seen!!! Terrible story line. Cheap special effects. Cheap production value... Waste of my time!"}, {"rating": "1", "text": "When making a psychological thriller, the cardinal rule is not to make it boring, and, unfortunately, this snoozy, unintelligible offering falls into that trap within the first 10 minutes. A stilted script, wooden performances and undecipherable narrative drive this cinematic mess into the ground quickly. It's truly disappointing that the creator of \"The Lobster\" followed up that brilliant work with this self-indulgent garbage. It's one thing for a film to be off-beat and unconventional, but it's something else entirely to be so cryptic that it's impossible to figure out what's going on. Oh, and by the way, Colin Farrell and Nicole Kidman -- please start picking your scripts better!"}, {"rating": "10", "text": "Mindblowind and experimental, \"...Sacred Deer\" is a breathtaking experience"}, {"rating": "8", "text": "A freakishly creepy film explores the art of expressionless acting that somehow brings the horror genre to a different level. Audience experiences might be polarized because of its particularly grotesque overall tone."}, {"rating": "6", "text": "oh boy.how i loved The Lobster!how f*** disappointed am i?! The original style of director G.Lanthimos still exists in this one, thank God,the characters maintain the stilted stiffness and minimal emotions and all the weirdness and slow pace,slow talking.Weirdo.weirdo.loving it. the music was sharp,exceptional and actually the only thing that made this movie \"horror\".But the scenario?it was something like magic with this boy but at last there is neither a mindblowing explanation nor a breathtaking finale just as Lanthimos used to do it.It sure is raw.But hello, so predictable!!! The perfomances were great,Colin Farrell was marvelous and the direction was also  nice,not impressed by the photography."}, {"rating": "10", "text": "Es una de esas películas que si no prestas atención desde el principio simplemente no la podrás apreciar correctamente, hay ciertas cosas que no logré entender,  pero la atmósfera, la tensión e incertidumbre fueron bien logrados para mi."}, {"rating": "5", "text": "I'm not sure how I feel about this movie. I wouldn't like to say that it was the waste of time but at some point I think I could have used this time for better movie. The main problem of this movie is that nothing really left after I watched this. I didn't get to know characters very well so I couldn't connect with them."}, {"rating": "9", "text": "This stylized film gets at the foundation of our uncertainty when science or objectivity can't help us understand our world. It takes the idea of science and makes a joke out of it. These deeper themes, along with puzzling symbols (like the wrist-watch straps and french fries) and subtle acting makes this movie a must-see for the openminded theatergoer. SPOILER: The most interesting part of this film was Martin's threat that all 3 of Colin Farrell's family members would get sick and die. Nicole Kidman had no signs of illness. This movie keeps me guessing and trying to connect dots. I keep asking myself questions about it and that's why I find it so enjoyable."}, {"rating": "7", "text": "i'll bury you in the yard..The Killing Of A Sacred DeerYorgos aces in keeping the audience enrooting for the lead characters till the end and gives them enough homework to even work it out, but this time he seemed way too dark on its tone; exhilarating but dark."}, {"rating": "3", "text": "I can see why the majority of viewers of this film do not know how to rate this film.In my opinion,the director aspires to be Kubrick-esk but unfortunately is more akin to pretentiousness. Kubrick balances cinematic minimalism with engaging characters and above all visual genius.This film is simply hollow, empty, devoid of any realistic human reactions and the most unlikable characters imaginable.The stoic,robot-like behavior of every single character was probably intended to create a sense of being in a surrealistic space and time but ultimately doesn't pay off and winds up giving one the impression that the director discovered dads box of tools, not knowing how to use them, creates a six ton rocking chair made out of 2X4's. The most bizarre device that was used was to have one of the characters blurt out the whole plot early on in the film. I imagine that was to create a sense of fate and doom but left me thinking,\"well they obviously aren't going to follow that narrative because that would be basically like someone spoiling the plot details. (the people that we hate watching movies with)Unfortunately, that's exactly how it plays out, point to point. There was no deviation whatsoever. I'm not surprised that I read that this movie opened at a film festival because that creates a pretense that if you think the film to be incredibly stupid then, you are simply,\"not getting it\". As a result,those who are overly concerned about what others think, are cowed into pretending that you liked it so that you don't appear unsophisticated. What a perfect formula for the the times that we are in today. If a person parts from the current,\"group-think\" concerning the use of identity politics and virtue signalling then you are silenced and shamed. In two words... PRETENTIOUS DRIVEL."}, {"rating": "6", "text": "Stripped to the bone, the premise is simple and the movie plays out in linear fashion. It's body is entirely filled to the brim with dread. Without as many twists and shifts as The Lobster, Sacred Deer is essentially all you can eat horror - lightyears different from anything else but not enough risks beyond that."}, {"rating": "4", "text": "It's pretty dark and cold. The monotonous robotic acting and the eerie music is probably meant to come across as really artistic but to me it just made it all so soulless and unreal. I found myself getting less and less interested in the story and its characters and grew quite bored with this movie despite its unpredictabilty.I saw this after \"the favorite\" and it's a similarly disturbing movie which I didn't like either. I guess I know to steer well clear of Yorgos Lanthimos movies now."}, {"rating": "6", "text": "This was a decent, albeit strange movie. It’s kind of a thriller about a surgeon played by Colin Farrell who was negligent and caused the death of a man who was the father of a creepy kid. The surgeon feel remorse and tries to mentor this kid and make amends, but it turns out the kid has supernatural powers and curses his family so that his kids become paralyzed and can’t eat, bleed from the eyes and will eventually die along with his wife unless he chooses to kill one of them. Eventually he does in a procedure involving putting a sock hat over his face and bags over his family’s faces and he rotates himself with a rifle. The dialogue in the movie is purposefully wooden and devoid of emotion and the characters often say strange things that seem a little autistic. It’s kinda one of the eccentricities of this director. It’s a little distracting and unnecessary. I feel like the movie would have benefitted if the characters seemed more human."}, {"rating": "6", "text": "The movie isn't bad, it is made quite well. The storytelling and screenplay just didn't quite do much for me"}, {"rating": "2", "text": "Awful and painful to watch without leaving you with anything meaningful. I sincerely regret having watched this movie."}, {"rating": "10", "text": "Do you play God or Devil?  Beyond the story about lost, vengeance and repulsion that he sets up, what makes Lanthimos so unique and aggressive is his power to relate poetically atrocious fables, a type of narration that is far, far from the prototype used by cinema currently. He already did so with his previous film and now backs it up with \"The Killing of a Sacred Deer\", dangerous ideas and perspectives without anesthesia embellished with peculiar breakdowns on lies, justice, forgiveness and hard feelings; rubbing salt in the wound of many conservative moviegoers who describe this type of cinematographic approach as ostentatious, ambitious and shamefully voyeuristic. The story veers completely over a psychological, captivating and supernatural air and many movie lovers appreciate that, we really do. Suggesting subtly that everything shown on screen isn't explicitly all they want to say is a tool for  the audience, who must start, on its own, a quick but much deeper study of the connections between the pictures, questioning each line getting out of the mouth of any character, every decision, every distraction, a game in which the spectator must be more clever. Along with \"mother!\" by Darren Aronofsky, \"The Killing of a Sacred Deer\" has one of the craziest, most symbolic and visceral scripts, in the bad and good sense of all the words, of the last decade, guaranteed stupefaction. The screenplay, written by the director alongside his habitual co-writer Efthymis Filippou, is overwhelming; from the opening scene, there are signs warning of an abrasive, variegated in-crescendo trip that gradually, as if it was an uncontrollable beast, increases in strength and belligerence to devour what could have been a tasteless drama. This kind of thing makes more interesting the stories in which no one knows what the hell just happened, that fictional game in which the writers immerse us whether we like or not. Don't forget the superb, staggered build of tension and discomfort, because in fact, the story is not made up of efficient twists and clever moves placed in the right moments, but the story itself is a big, insane twist. Certain elements are required for something like this goes well, fortunately, they're used on this occasion: top-notch performances, an antiseptic cinematography, a lancinating soundtrack and an infinity of technical, artistic and narrative support that become this work, only for a few ones, in one of the best of the year.Here is one of the few films in which the majority, if not all, of the performances are magnificent and strangely credible.  Farrell does an outstanding job in this movie, his movie, we feel true anger, his bewilderment and dread are real through his steely gaze, and unlike many other similar-storyline characters, he's a defenseless father contemplating how his family crumbles, one by one, an eye for an eye, a tooth for a tooth. Of course, the next big revelation is one of the most terrifying and ominously disturbing antagonists of this year: Barry Keoghan. The 25-year-old actor has found a very complex character, full of nuances  represented by means of monologues that he verbalizes in a way as natural as disturbing, the coldness of his boiling hate is what turns his interpretation into a fabulous triumph, there are sincerity and depth in his words, is such the power of his dramatic range that with just a couple of lines and one \"loathsome\" plate of spaghetti petrifies an entire theater, a visceral performance. Thimios Bakatakis' barbaric visual section must live up to the brutality and strangeness of the enigmatic writing, frankly, it goes significantly beyond. The cinematographer spreads the messages out through a thin and aggressive line of symbolic pictures, from the most deeply dramatic to those blatantly violent; the camera slithers harshly along hospitals, onerous houses, coffee shops and disturbing basements, using long shots to feed the unstoppable tension through tilt and travelling moves that accompany the characters all the time, even making the viewer to hide behind a shield in every moment, it's restless and frightened of what may come as soon as a change of scene happens. Upsetting, exultantly cruel and incredibly hard to watch and forget, Yorgos Lanthimos's \"The Killing of a Sacred Deer\" is his film less chimeric in terms of visual setting, however, the stark and eccentric display of his ideas and the deep-rooted metaphorical meaning of them are pillars in this rabid tale of karma, morality, vengeance, and humility, smothering the spectator' tolerance limits, causing dissimilar results in each experience, in my case, a da*n obsession to know more about this unclassifiable Greek filmmaker. Quickly, the filmmaker shapes his filmography on metaphorical bases, with esoteric and complex ideas that define a caustically indelible work. No doubt, the second film, narrative and visually, more controversial, perverse and atrocious of 2017."}, {"rating": "9", "text": "Highly enjoyable film, but I had to subtract one grade because one of the characters in the movie keeps bringing up MP3 players. This movie was made in 2016, what are they talking about, what MP3 players? Do these devices still even exist? Who is using them? The characters in this movie, that’s who."}, {"rating": "8", "text": "Not exactly full of action but it doesn't need to be, really. I rather liked the unique camera work with the \"odd\" angles, long shots, wide shots, etc. Creepy, ominous sound effects were a nice touch to the robotic feel of the film. Brilliant acting, mainly by Collin Farrell also deserves a mention. I wouldn't say it kept me biting my nails, but it was eerie enough to keep me tuned in."}, {"rating": "7", "text": "Elég furcsa filmről van szó, érdekes párbeszédekkel. Azt hiszed, hogy az egész filmben nem történik semmi és unalmas az egész, de végül mégsem. Annyira kínos egy-egy jelenet, hogy már kíváncsi vagy a végére, hogy mit szeretnének kihozni az egészből."}, {"rating": "9", "text": "The Killing of a Sacred Deer is a weighty movie, in presentation and delivery. So much hangs on each decision that the world around the characters perpetually threatens to crash around them. The lofty weight that these hovering decisions bear is shown directly through the camera work. Each shot leaves vast amounts of the screen empty above the characters. The Killing of a Sacred Deer is technically sci-fi but is very bound within reality. The somatosensory ailments that the characters suffer from follow suit with existing conditions, only differing in their exaggeration. Colin Farrell (Steven Murphy) and Barry Keoghan (Martin) carry the film. The supporting cast of characters, especially Sunny Suljic, help create a fleshed-out experience, but Farrell and Keoghan are the film’s heavy hitters. The Killing of a Sacred Deer explores the morality of medical science and long-standing grudges. Throughout the film the characters are revealed to be less trustworthy than they let on, even spinning dangerous lies. This web of lies end up entangling Steven and Martin and the former is forced to confront his relation to the latter. Lanthimos proves with this film that he can explore concepts as they currently exist and as their likely future forms. The Killing of a Sacred Deer is an abysmal and solemn piece that leaves a burden weighing down even after its end."}, {"rating": "6", "text": "The movie isn't bad, I'd even say the idea is good, however it feels like there are missing elements of information to the plot. Also, I understand that it's for the style, but the robot-like emotionless acting made the film feel lifeless for me."}, {"rating": "3", "text": "Non-direction/acting - every line is delivered completely monotone and devoid of emotion, expression, or character. Each line is read without punctuation or cadence. The acting/characters may as well be performed by robots. Resultantly, the story is irrelevant to the viewer, as the events are not happening to humans in the real world. This is the type of film that insecure people convince themselves that they 'get' and appreciate to make themselves believe they're intellectuals or film connoisseurs.  Pretentious experimental style. 3/10."}, {"rating": "9", "text": "The Killing of a Sacred Deer is a damn mesmerizing crazy of a film. I've barley never seen an UFO of a film like this before. One-of-a-kind state-of-the-art accomplishments in both suspense and horror, with part drama and author's film, this is near to impossible to choose of which kind this movie is. I was basically in the edge of my seat from the very beginning until the last minute of it. Perfect direction, mind-blowing actors, cinematography is top notch and original score really scare the **** out of you. There's not a single minute where I wasn't saying wtf is happening literally. This is like if both David Cronenberg and Michael Haneke have directed a film but on LSD. Definitely not for the mainstream public, they are simply not able to watch this movie. This is really special and definitely smart as hell, so random moronic reviews is of course inevitable and came from peoples aren't able to judge or even watched it. There's of course haters since they are just too simple minded to understand what just happened regarding the usual movies they watch as 2 Fast to Furious as an example. Definitely not for everyone. But if you like crazy artistic horror cinema that's definitely well worth it. As for Dead Ringers or A Funny Game, I would never forget this masterpiece for sure."}, {"rating": "8", "text": "This is a creepy and sinister film, in terms of the looming type music played in the background and some of the slowly unravelling plot points but otherwise it may look like a mundane film, in fairly everyday settings. Of course this is a film by Yorgos Lanthimos and so the fact it has a menacing undertone, while being set in, initially, a seemingly normal setting didn't surprise me. There's also a strong sense of claustrophobia present, with a fish eye lens type of camera angle and other, shall I say quirky, camera angles used to give the viewer a sense of the impending implosion building up. Colin Farrell plays a very suspicious and somewhat angry sounding, yet quiet in tone, man, the doctor/surgeon, Steven. His irish accent is more apparent in this film than in others I remember seeing him in recently. Also present is Nicole Kidman, who plays the surgeons wife, Anna (Ann Murphy). Its certainly a film that keeps you guessing, which is no bad thing. I also noticed there were some scenes, in between scenes, such as ones showing a character driving elsewhere, in which all music and noise was apparently muted, which adds to the creepy undertone.Its definitely a sinister and haunting film that will leave you second guessing things. It features a scene of self harm, with blood depicted, which may be a trigger for some people, so I thought I ought to flag that. Hence its not a film that will suit or appeal to all but its quite good at what it does - providing an almost Hitchcockian slow tension. I would recommend it on that basis."}, {"rating": "8", "text": "A solid pychological thriller. Has all the necesscary creepy and tingly undertones AND overtones. A plot line unraveling /and/or revealing the mystery of the antagonists power is missing"}, {"rating": "3", "text": "Man, this movie was hard to finish, which sucks because it should have been so much better.  The dialog is so strange and unlike anyone ever talks in real life.   All the actors speak with this stilted, dronelike cadence, like there's no emotion coming through (although I'm certain they were directed).  Overall"}, {"rating": "8", "text": "Alcoholic surgeon kills patient when drunk so the son forces him to kill of a member of his own family to make up for it so he shoots his son whilst blindfolded."}], "recommendations": ["you_were_never_really_here", "the_machinist", "ex_machina", "us", "the_invisible_man", "a_history_of_violence", "the_rover", "the_good_shepherd", "titane", "annihilation", "sicario_day_of_the_soldado", "the_green_knight", "tenet", "no_country_for_old_men", "under_the_skin", "donnie_darko", "midnight_special", "interstellar", "color_out_of_space", "coherence", "thoroughbreds", "a_quiet_place", "the_fly", "enemy", "the_beguiled"]}