{
  "id": 891,
  "title": "The Watch",
  "starring": [
    "Ben Stiller",
    "Vince Vaughn"
  ],
  "runtime": 102,
  "genre": [
    "Comedy",
    "Action",
    "Science Fiction"
  ],
  "description": "Four everyday suburban guys come together as an excuse to escape their humdrum lives one night a week. But when they accidentally discover that their town has become overrun with aliens posing as ordinary suburbanites, they have no choice but to save their neighborhood - and the world - from total extermination.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gwfgYA9wGpV4QLB0LrcexwfwC19.jpg",
  "categories": {
    "plot": 3.619047619047619,
    "acting": 4.833333333333333,
    "ending": 6.75,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.6571428571428575,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I really enjoyed this movie, I laughed heaps, as did everyone else in the theater. I can understand why people would not like this film as Neighborhood watch fighting skin-stealing aliens is a pretty damn stupid movie concept. It depends on your expectations when you watch the film, I knew it had bad reviews, and that it was about a Neighborhood watch, but that was all I knew about the film so it really wasn't what I was expecting at all. Sometimes stupid movies are just really fun, it really depends on your mood when you watch it, and who you watch it with, which I find is the same with like 'Family Guy' among other things."
    },
    {
      "rating": "9",
      "text": "The watch turned out to be exactly what I expected and wanted it to be, and that is a rude, crude, and immature comedy with just enough vulgarity and absurdity to send it over the top. As with most comedies like this one I enjoyed laughing my ass off at it. The cast comes together perfectly and their chemistry helps the laughs feel so natural. In the end it's a top notch vulgar comedy that I just enjoyed watching, and if this is your kind of comedy you'll enjoy it as well."
    },
    {
      "rating": "5",
      "text": "Just an average film or even below average at certain points. I expected more because of Ben Stiller and Jonah Hill but this movie didn't do the magic for me. There are a couple of funny moments which really make you laugh but they're not enough for a film to be considered good especially when you are expecting much more because of the people attached to the movie. The plot had so much potential but the screenplay wasn't that powerful or inspiring."
    },
    {
      "rating": "6",
      "text": "The movie has a view good laughs, but has several points in which the jokes fall flat. When you see this movie you need to appreciate the film for the story more than just the comedy. If you focus to much on the lack of good lines you won't be able to enjoy the film. Even with what the film lacks, I would definitely suggest you see it. It has wonderful cast and entertaining plot, just remember not to take it too seriously."
    },
    {
      "rating": "10",
      "text": "I don't know why people dislike this movie because it was hilarious and full of action. In my opinion it was one of the best comedies of 2012. Sometimes it was a little over the top but still a masterpiece of comedy."
    },
    {
      "rating": "9",
      "text": "This was really, really funny!   Maybe you just have to have lived in suburbia and shopped at Costco to appreciate the humor!   Or maybe the reviewers who disliked this movie live in suburbia, shop at Costco, and are easily offended."
    },
    {
      "rating": "3",
      "text": "So much comedic talent wasted on such an unfunny boring alien invasion movie.  Besides a few chuckles here or there this film is just a waste of time."
    },
    {
      "rating": "10",
      "text": "I'm really scratching my head as to why this has such low reviews.  The jokes are hilarious, great dry humor, Vince Vaughn at his best and nothing stupid to underestimate the audience.  I also enjoyed the fact that the music is far and between in the movie allowing the characters and dialect to breathe from scene to scene.  I laughed the whole way through and would rank this up there with Wedding Crashers and Old School, see it sober or high, you'll laugh until the end."
    },
    {
      "rating": "4",
      "text": "The Watch is just so completely sub-par. Not a great comedy apart from a few chuckles. The only thing truly memorable about it is how an outlandish plot-twist becomes the most boring part of the movie. You will remember the plot-twist though. The rest of the movie isn't good."
    },
    {
      "rating": "3",
      "text": "The whole movie felt recycled and was unsure of what tone it wanted to take. I never once actually laughed, but instead forced a snicker and maybe once giggled. What makes it worse is the fact that Seth Rogen and Evan Goldsberg (Superbad and Pineapple Express) wrote it, and Stiller, Vaughn and Hill are Hollywood's top comedians. The film was just not funny at all and I'm a little worried that Hollywood has run out of original ideas."
    },
    {
      "rating": "8",
      "text": "\"The Watch\" definitely starts out a little slow, but picks up the comedic pace within about 10 minutes (thanks to Vince Vaughn). If you are the type of person that likes guys making awkward penis jokes and aliens getting shot to death in the crotch, then this is the film for you! It is definitely not for everyone, but it is definitely not half as bad as the critics are reporting. If you're a quasi-imature youngster age 14-25 (as I am) then you'll definitely have a good time.\r 8 stars out of 10!"
    },
    {
      "rating": "7",
      "text": "Overall A Good Movie"
    },
    {
      "rating": "0",
      "text": "Detestable, at best.  There is not one character in this movie that has any likability.  The dialogue is painfully unfunny, repetitive, and possesses the subtlety of a frying pan to the face.  I don't necessarily look for high-brow jokes, but there's a difference between making jokes the masses get, and desperate humor that almost begs the audience to like it, pretty please with sugar on top.  Desperation is not appealing in any sense, but especially not in the comedy department.  The plot is beyond ridiculous.  The script should have been burned, the ashes buried, and the earth salted at the burial site so nothing can grow there again.  Who greenlit this?  How can any actors do a serious read on this and not have a piece of their soul die?  There are no redeemable qualities to this movie whatsoever.  Your money would be better spent elsewhere."
    },
    {
      "rating": "7",
      "text": "'The Watch' has been poorly reviewed and everyone seems to be dissapointed with it, but I wasn't. I enjoyed it. 'The Watch' WAS actually funny, it made me laugh then the majority of modern comedies, which are usually poor. The cast is brilliant. 'The Watch' has four strong lead actors, Jonah Hill & Richard Ayoade being the strongest, Ben Stiller being the weakest and Vince Vaughn is better then usual. The narrative and premise is fun and the aliens actually look good (from a design perspective).\rOverall 'The Watch' is a fun, crude, rude comedy that's better than the majority, but overall to most people it's either a hit or a miss, I'd definately recommend it, at least give it a try."
    },
    {
      "rating": "2",
      "text": "Saw this movie almost 2 months ago and my opinion is still the same. It is the worst comedy I have seen all year. J Hill seems like he is phoning in his performance. Vaughn is doing his normal annoying shtick. Worst product placements in a movie ever. This should of never been released during the summer. It should of been straight to DVD."
    },
    {
      "rating": "8",
      "text": "Everything you have come to expect from Vaughn,Stiller, and Hill and surprisingly new comer (to US film) Ayoade is by far the most entertaining character."
    },
    {
      "rating": "10",
      "text": "If you didn't toke up before seeing The Watch, you are not qualified to review it. Believe me, if you are a member of this film's target audience (which DOES NOT include old, pretentious film critics) you will laugh your ass off, guaranteed. Smoke a j, grab a mountain dew, and enjoy Stiller, Vaughn, Hill, and co. doing what they do best."
    },
    {
      "rating": "6",
      "text": "The Watch... the new movie of Ben Stiller and Vince Vaughn, ok the movie have an interesting story, in that can appear some funny moments, but the problem is the next that the movie is really terrible, but the movie is really funny. The performances of Stiller and Hill are the most redeemable and the rest... I don't wanna talk about that. The movie is really good, have some cool and funny moments and it's all."
    },
    {
      "rating": "0",
      "text": "i was totally looking forward for this movie and walked out disappointed, i thought hey jonah hill and vince vaughn this should be funny and it wasn't, i didn't laugh not once, i probaly giggled once or twice but not actually laughed out loud, the movie is totally inappropriate too, i was expecting a few sex related things and that's it, not an entire movie with swearing or some sex related thing, the overall movie is terrible and i don't how these people liked it, im disappointed in hill and vaughn for staring in the these piece of crap"
    },
    {
      "rating": "10",
      "text": "I'm pretty surprised this movie got such negative reviews from the critics. I laughed virtually the whole movie and so did everyone else in the theater. I guess if you're expecting a dumb, funny, goofy buddy movie go see it, it's a good middle of the summer flick"
    },
    {
      "rating": "3",
      "text": "Cheap, superficial, and immature. Even though the movie tries to be packed with laughs, they're few and far between. The best part of this movie is Vince Vaughn."
    },
    {
      "rating": "10",
      "text": "This is the kick-ass-est movie of the year, guys. It had comedy, horror, action, and more comedy. The laughs were non-stop, about 5 a minute during the funny bits, in between the action and horror bits. This movie is truly guy-humor comedy gold, but as a girl I effing loved it so it has something for everyone as long as you're not easily offended. I dare you to not like it."
    },
    {
      "rating": "10",
      "text": "I laughed so hard... and everyone else in the theater did too.  I don't know what the critics are thinking but my suggestion is to ignore them and go watch this if you want a great laugh."
    },
    {
      "rating": "0",
      "text": "Honestly, I thought this movie was completely awful. The previews are quite misleading. The previews have you believe it's a slapstick funny flick about some average guys who discover some aliens. In reality, the movie is a medley of immature sex/penis jokes, overall crude and vulgar language every 30 seconds, a plot with a potential to be cute and funny but was instead butchered, and maybe 3 actually funny moments. the movie doesn't stick to the plot either, as it jumps around between the guys's personal problems, it was like two movies smacked together. Not to mention there is a disgusting orgy halfway through. No warning at all, just a ton of people having graphic sex, a lot of naked people (which personally, I do NOT like to see in movies, there are other places for that), and a shot of several sex toys. I have no idea how these other people are rating it so high, it was dreadful. And before you say I'm some old lady prude, I am a regular 20 year old girl, and as a member of a generation that usually likes these kind of things, I was truly repulsed. I would NOT see it again and heartily wish I had seen something else instead."
    },
    {
      "rating": "9",
      "text": "This is a movie starring Ben Stiller, Vince Vaughn and Jonah Hill.  There is a good amount of vulgar humor involved.  Based on these two statements, you should have a pretty good idea of whether or not you will enjoy this movie.  I found this movie to be very funny, definitely worth the ticket price.  Richard Ayoade (the fourth member of the watch) did a great job in my opinion.  He didn't steal the show, but I found a couple of his lines to be the highlights of the movie."
    },
    {
      "rating": "0",
      "text": "A comedy is supposed to make you laugh, right ? Well, I did not laugh once. Vince Vaughn's overpowering presence was a big part of why this movie was so awful. He does the same thing for 20 years now, and it gets ever more annoying.\rA complete and utter waste of time."
    },
    {
      "rating": "0",
      "text": "This movie is offensively unfunny. I want to sue someone for the 30 minutes I wasted on it. It's as though someone wrote a vague story line while out of their tree on alcohol or other stimulants, then these mega-egos got together and thought they could make it hilarious by ad-libbing the entire way through it. They couldn't. They are painfully, horribly unfunny. Maybe they will get a few **** out of a few undiscerning 14-year old boys.\r Atrocious."
    },
    {
      "rating": "5",
      "text": "This movie definitely had some hilarious moments but it turned into a really strange science fiction movie that just didn't seem entertaining. The funniest parts of the film were all in the previews and all of the weird crap just took over the actual movie."
    },
    {
      "rating": "6",
      "text": "The Watch is a ridiculous movie. The plot is so clichéd and many of the jokes are overly vulgar. But there is no denying that The Watch has a certain charm to it that for the most part keeps you engaged. This is largely due to its cast, which do their best with the script and provide some very good laughs. Had it been other comedic actors like Happy Madison actors this movie would have been downright awful. I would only recommend this to people who enjoy stupid vulgar comedies. Don't go in expecting some great movie. I didn't and had a few laughs that I felt was somewhat worth it."
    },
    {
      "rating": "6",
      "text": "A pretty decent comedy that does try to do something a little different. Some really great jokes, but unfortunately some rather poor writing for the parts in between jokes. I always find it funny how I can not find Ben Stiller funny in almost any movie he's in. He actually does better when he plays more serious roles. Jonah Hill tries far too hard, but I think that is also just to bad writing and character concept. Vince Vaughn just nails his role and creates a funny, but believable character. Billy Crudup is just all round funny. His jokes are great but also feel a little out of place in parts. Overall: Not  a brilliant comedy, but for the most part it was better than I expected it to be and and had some pretty well done special effects."
    },
    {
      "rating": "6",
      "text": "A fair film. It has some funny moments. The strength and absurdity of the characters creates some of the really funny bits early on, but as the plots develop some of this is lost into the usual feel good comedy plot - do weirdoes haves to show personal growth? Vince Vaughn is great as usual. The humour is a bit crude but if you don't overthink it, it is a fun way to spend an evening; and doesn't require so much attention that you can't cook dinner in between."
    },
    {
      "rating": "6",
      "text": "When a colleague is murdered local Cost-Co manager Evan sets up a neighborhood watch group to try to catch the killer, but things turn out to be a little more complicated then he first thought.\r One look at the cast list (which includes Ben Still, Jonah Hill and Vince Vaughn) will tell you exactly what type of movie this is and, while plenty of jokes fall flat meaning it's not up there with the best movies of its type, it's fairly funny throughout and fans of this kind of comedy will most likely enjoy it to some degree."
    },
    {
      "rating": "7",
      "text": "Listen, The Watch wasn't perfect by any means, but was it a funny? It certainly was and thats all that matters with a film like this. What do you expect with Ben Stiller, Vince Vaughn and Jonah Hill battling aliens? The Watch was funny, and awesome. Yes it got dull and boring and slightly annoying at some points but overall this was a funny movie, i was dying with laughter at some parts. I give this a 7/10"
    },
    {
      "rating": "8",
      "text": "How does a movie this funny tank so badly?  The comedies that do well these days aren't usually my style, and yet I ended up really enjoying this strange but hilarious film.  Stiller was, for once in a long while, actually kind of reserved in his role in this film.  The twist in this film was totally bizarre and since I hadn't seen any trailers for it, it caught me totally off guard.  I really do recommend this film."
    },
    {
      "rating": "8",
      "text": "All's forgiven if it's funny right? It might be a little hokey and unbelievable but the difference between this one and others that are complete garbage is that this movie is funny."
    },
    {
      "rating": "9",
      "text": "Brilliant. It may be \"immature\" but it's also a great film. I don't get the dislike for the film and whilst it isn't a laugh-a-minute, neither are other great action-comedies such as Big Trouble In Little China or Ghostbusters (although it does have more laughs and is more comedy orientated than both). There are also some genuinely clever laugh out loud moments too, and the film as a whole flows really well. Light-hearted, silly fun that - judging by the reviews - isn't for the more serious people out there, but IS for those who like a carefree, laddish laugh. Great stuff."
    },
    {
      "rating": "5",
      "text": "The Watch may have an inconsistent tone and some jokes may fall flat, but the film at least has interesting characters, with some nice dumb fun along the way."
    },
    {
      "rating": "1",
      "text": "Let's look at the concept behind this movie: Get 3 of the most 'popular' comedians out there and have them investigate weird and spooky going on in their neighborhood. Who you gonna call? If you said Ghostbuster, but with Aliens instead of ghosts, then you just got that one single film that The Watch tried so hard to emulate. What you get though is one the biggest flop of 2012, a film so bad that it deserves every score that the critics gave it. The casts, including Ben Stiller, Jonah Hill and Vince Vaughn tried so hard to make it funny, but they failed miserably. One of the worst film of the year"
    },
    {
      "rating": "8",
      "text": "Nie wiem dlaczego film zbiera aż takie złe recenzje. Rozumiem że nie jest to jakieś zaskakujące i pełne polotu kino, ale to dobrze zrobiona, luźna komedia w amerykańskim stylu, którą się po prostu przyjemnie ogląda. Jeżeli ktoś lubi takie poczucie humoru oczywiście. Nie można od tego filmu zbyt wiele wymagać, a wtedy ogląda sie go fajnie."
    },
    {
      "rating": "5",
      "text": "The movie was pretty average. Plot and comedy were meh with only occasional laughs at sex jokes. I just was expecting a little more based on the actors and previous high quality films they've all been in as well as guys like Seth Rogen being involved. You'd think combining all this talent in one movie would be golden but the script just didn't allow it. I suggest waiting for DVD but it can be theater worthy and not a bad way to spend an evening if you're otherwise free. Just don't go in expecting a comedy like Wedding Crashers, Old School, Meet the Parents, Superbad... yeah you get the point."
    },
    {
      "rating": "5",
      "text": "This is an  hour and a half Costco commercial with a not very good movie squeezed in.  There is obnoxious product placement... And then there is this movie, which, to paraphrase, is some next level ****  I felt I was being product raped.   It seems obvious to me  Stiller and Vaughn could not give a **** anymore and just filmed themselves and their friends riffing. Sometimes that can work.  Sometimes just the sheer chemistry of the cast can make a movie.  The Oceans Eleven movies are a good example of this.  Not this time. This feels like a blatant money grab and an excuse for Vaughn & Co. to hang out and make raunchy jokes.  Watch it as a rental or download because this is the very definition of a time waster."
    },
    {
      "rating": "6",
      "text": "This movie is ok to watch it with your friends once. Nice actors, especially Stiller and Vaughn. The plot is okay. But in total the film is average. I prefer Attack On The Block!"
    },
    {
      "rating": "9",
      "text": "Very funny film. In the theater I'm laughting a lot and too loudy :)\rAfter the filem, I came back at home and was surprised to see such low rating here.\rIt's one of the best comedies since last several years I've seen"
    },
    {
      "rating": "10",
      "text": "Excellent movie, even with some jokes does not make you laugh, the combination science fiction-comedy is perfect. If you want to have fun with your friends, watch this movie."
    },
    {
      "rating": "0",
      "text": "I would give this movie a -10 but couldn't.   Bad acting, stupid, vulgar, not funny,  waste of my time,  I could go on.   Ben Stiller continues to make F- movies and cashing in all the way to the bank!"
    },
    {
      "rating": "3",
      "text": "The plot flatlines- not at a point in the film, but through the entire film. For an R rated comedy with aliens, guns, and explosions, The Watch is extremely boring."
    },
    {
      "rating": "9",
      "text": "You know, at first I thought this movie felt like a dud, but I stuck it out and really enjoyed it.  Good work on the part of the actors for pulling this thing out of a nose-dive.  Everything came back around, even if sometimes predictably, and by the end of the movie I had a smile on my face."
    },
    {
      "rating": "0",
      "text": "Very Poor, looking at the cast I thought this movie would be brilliant. Very hard to find a laugh unless you look in your pocket and realise you spent money on this trash."
    },
    {
      "rating": "3",
      "text": "they say Ben Stiller movies some ON and some OFF, well this one is OFF, actually it's too OFF this time that it's barely unwatchable,\rnot totally unwatchable because there are FEW good scenes but the movie seems lazily produced, lazily written and lazily directed.\ri mean beyond the fact that the story is so dull and weird, the only way that you could know that this is a comedy movie is by reading the word \"comedy\" on the blue-ray box, THAT'S IT.\rthe characters is so lazily written that you  don't even know what the hell is Jonah Hill role, he just standing there doing absolutely nothing, and what's with the British guy, you can totally remove him and that would not effect the movie at all, but then they decided to spice it up and make him an alien REALLY?\rif this is where the comedy is going then we all completely doomed."
    },
    {
      "rating": "1",
      "text": "Do not be fooled by the impressive cast because this film is utterly atrocious. The story is weak to say the least whilst the characters are so unappealing that I can't even remember their names. The plot twist is not clever, nor is it even needed because like the whole production it is basically a disgraceful, appalling and ridiculous proposition. Avoid setting your eyes upon this monstrosity."
    }
  ],
  "recommendations": [
    "the_hangover",
    "30_minutes_or_less",
    "a_haunted_house",
    "miss_march",
    "hot_tub_time_machine",
    "this_is_the_end",
    "jackass_presents_bad_grandpa",
    "the_dictator",
    "grown_ups",
    "dumb_and_dumber_to",
    "rough_night",
    "couples_retreat",
    "anchorman_2_the_legend_continues",
    "dinner_for_schmucks",
    "identity_thief",
    "the_wrong_missy",
    "the_wedding_ringer",
    "movie_43",
    "scary_movie_2",
    "one_year_one_night",
    "ted_2",
    "hubie_halloween",
    "white_chicks",
    "zoolander_2",
    "what_happens_in_vegas"
  ]
}