{
  "id": 3752,
  "title": "The Return of the Texas Chainsaw Massacre",
  "starring": [
    "Renée Zellweger",
    "Matthew McConaughey"
  ],
  "runtime": 95,
  "genre": [
    "Horror",
    "Comedy"
  ],
  "description": "Everyone's favorite chainsaw-wielding psychopath, Leatherface, is back for more prom-night gore, and this time he's joined by his bloodthirsty family. Four stranded yet carefree teens are taken in by a backwoods family, clueless of their host family's grisly habits. The terrified youths, including sweet Jenny, try to escape from Leatherface and his crazed clan, including the bionic Vilmer.",
  "releaseYear": "1995",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/e1ikqofvLBddrZJ73IjmJWhUYus.jpg",
  "categories": {
    "plot": 2.0,
    "acting": 1.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 0.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "It's the kind of movie that nearly qualifies for a \"So bad, It's good\" kind of film. I think it's just freaking awful though. Worth watching to rip on it but totally irredeemable."
    },
    {
      "rating": "0",
      "text": "This movie is the most horrible movie in history. The acting sucks, the kills are horrible, and everyone was stupid."
    },
    {
      "rating": "2",
      "text": "Besides Jenny and Darla, the other characters are awful and/or underdeveloped.The kills are very boring, the Illuminati stuff is ridiculous, and the story is so similar to the original."
    },
    {
      "rating": "10",
      "text": "Aquí se que nadie estará de acuerdo conmigo, pero esta es mi película favorita de la saga, quizás porque fue la primera película de este tipo que vi en la TV en los lejanos años noventa y porque pese a que es una baratija impresionante y que se aleja por completo de la película original, se me hace inmensamente divertida y entretenida, incluso nostálgica al ver a una joven Renée Zellweger que ya derrochaba talento y belleza en su primera película."
    },
    {
      "rating": "1",
      "text": "Finally the worst one in the franchise, and not only in the franchise but Texas Chainsaw Massacre: The Next Generation just became my new pick for the worst movie i've ever seen, the movie is terribly written, terribly produced, horribly performed, and there is literally zero thing on this movie that i like, the look of Leatherface in this one is just the worst thing ever and his/her scream is even worst, all the actor and the actresses performance in this movie is one of, if not the worst performances i've ever seen, they're so annoying and they're stupid, Texas Chainsaw Massacre: The Next Generation is just so frustrating to watch and if it's not because of the franchise i already stop in the first 10 minutes of the film, it's a horrible horrible experience."
    },
    {
      "rating": "2",
      "text": "The setup may be different but the middle is so similar to the original its a little jarring. Getting the \"alright, alright, alright\" from McConaughey was a big eye roll moment. Final act was incomprehensible, the plane for example??? Also I don't think a single person actually got Chain Sawed."
    }
  ]
}