{"id": 2349, "title": "The Case for Christ", "starring": ["Mike Vogel", "Erika Christensen"], "runtime": 112, "genre": ["Drama"], "description": "Based on the true story of an award-winning investigative journalist -- and avowed atheist -- who applies his well-honed journalistic and legal skills to disprove the newfound Christian faith of his wife... with unexpected, life-altering results.", "releaseYear": "2017", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/hTKwkxMv5MCkN8vMXiEmMmAHafh.jpg", "categories": {"plot": 7.285714285714286, "acting": 10.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "This was a very compelling movie, and like most, it's much more so since it's based on a true story.  Great acting, and not cheesy like films focusing on Christianity often are.  Our family and the family we went with loved it!  OK for teens and pre-teens for sure, as you'd expect.Make sure you watch it, especially if you're unsure or skeptical about Jesus, because what if you're wrong about your disbelief, like Lee Strobel had been in this true story?"}, {"rating": "10", "text": "My friends and I loved this movie. Realizing that some won't be able to fully absorb this film. Great movie for a Christian date! There are some scenes that take a few liberties with accuracy but overall the message gets planted."}, {"rating": "10", "text": "This is better than War Room, this is such a strong film that someone ever made about an atheist who was trying find evidence of Christ until he realized at the end."}, {"rating": "8", "text": "Many movies with Christian themes are plagued with less-than-credible screenplays, marginal acting, poor production values, and a fatal overdose of sentimentality.  They entertain and preach to the converted, but they generally become targets of ridicule because they are just plain bad art.  \"The Case for Christ\" avoids the pitfalls that diminish the potential audiences for most Christian movies by having a screenplay--based on real-life events--which is well-acted and produced.  Christians and non-Christians can watch the film without cringing because it is terminally hokey.  Part of the story of Lee Strobel's two-year-long investigation of the veracity of the resurrection--the traveling from place to place interviewing scientists--was admittedly difficult to keep fast-paced and exciting; and dramatizing a person's conversion is fraught with challenges.  But \"The Case for Christ\" is an eminently watchable movie"}, {"rating": "10", "text": "The life of Christ is a paradox, an object of faith, existing only for faith. His name is proclaimed in all the world. It is sure enough that Christianity has changed the face of the world. On the assumption that Jesus was indeed man, and considering his story, one will conclude with an ascending and exceedingly and astonishingly conviction that he was the greatest man that ever lived. I have been an atheist for 6 years so I believe in Lee Strobel's struggle, his conversion obviously wasn't a thing that happened in one day to the other, but a continuous thing over the 3 years of research, that atheists won't understand watching this movie, this isn't meant for a person who is stubborn and not willing to listen, but to a person who's chasing their way to believe in a hope for humanity. I tell you this, we cannot love and care for strangers if we do not believe in God, and Jesus showed that even the most rejected person can be loved, can a human being love people the way he did? No, his nature is not human. Therefore if you don't believe in him you will never want to change, why would you want change when you can continue lying to people? Only those who are willing to change will give their hearts to Jesus, I now love people in a way that I never did before as an atheist. I think faith shouldn't be about proving that God exists, but rather to believe in a subjective truth about life, in this I agree with the philosopher Kierkegaard. Science is outside of the boundaries of this kind of truth, so science can never hurt anyone who truly has faith."}, {"rating": "10", "text": "A beautiful, cinematic film, and a great performance of Lee Strobel's story. It was visually appealing and well executed. I highly recommend watching it."}, {"rating": "0", "text": "Absolute garbage. It's christian propaganda to indoctrinate people, with terrible arguments and lots of falacies. Most of the movie I was cringing so hard, and shaking my head. If at least they would've tried to be subtle about it, but it's so obvious it's painful to watch. Stay away."}, {"rating": "10", "text": "It is a story of an individual who was living his life as an atheistand tried his best to prove that the resurrection of Jesus is a myth.But failed to do so due to overwhelming historical evidence and apraying wife.\"A new heart I will give you, and a new spirit I will put within you;and I will remove from your body the heart of stone and give you aheart of flesh.\" -Ezekiel 36:26 (NRSV)"}, {"rating": "8", "text": "Watch The Case for Christ Full Movies Online Free HD .Watch Here : http://4k.useehd.us/movie/424998/the-case-for-christ.html.Watch Here : https://ifsanmovies.cf/movie/424998/the-case-for-christ.html"}, {"rating": "9", "text": "This is a really good movie. It really has an appeal to most people regardless of where you find yourself spiritually. For atheists and agnostics, I'd encourage you to go if for no other reason to see why Christians believe what they do and why. My guess is most negative reviews for this movie will be from those with an axe to grind against faith and have not actually seen this movie."}, {"rating": "10", "text": "Movie was very moving. It is great information for the non-believer to study and verify the information themselves. Christ has a way of calling you. Maybe this is your call. It was great!!!!"}, {"rating": "3", "text": "A story of fiction that presents another story of fiction as true. There's some deep semiotics here if only somebody wasn't so serious about the plot. With congenitally poor reasoning, mission failure is a foregone conclusion, but it sort of succeeds as a work of art. Competent performances, tight editing, fine photography, and decent pacing serve as admirable crutches for an absurd story."}, {"rating": "9", "text": "I don't many people will like my review because it's anti-atheist, but here goes:The very few negative reviews are from atheists who can't accept the fact that atheism is a fairytale and a delusion and Christianity is the truth. This movie is fantastic! It beautifully tells the true story of how a typical arrogant, abusive atheist discovers that God is real, the Bible is true and evidence is on Christ's side, not atheism's side. Atheism is entirely based on feelings, not facts or evidence, and this movie beautifully demonstrates this fact. I recommend this movie to EVERYONE, including atheists. It'll probably offend them, but I don't care. All they ever do is bully and mock everyone who's too smart to believe in the children's fiction known as atheism, so they can stand to be criticized and offended for a change! It's always time to mock stupid ideas like atheism, and I will always mock atheism and never, ever stop. Sorry not sorry! And with all the awful atheist exploitation films and shows out there nowadays, a great anti-atheist movie like The Case for Christ is like a breath of fresh air!Go watch it!"}, {"rating": "10", "text": "A true love story brought to life in the most emotionally and thematically rich way. The Case for Christ reveals why Jesus is the one to devote your life to."}], "recommendations": ["the_shack", "son_of_god", "the_passion_of_the_christ", "war_room", "overcomer", "the_young_messiah", "the_last_temptation_of_christ", "i_still_believe", "machine_gun_preacher", "risen", "courageous", "heaven_is_for_real", "silence", "exodus_gods_and_kings", "the_tree_of_life", "united_93", "noah", "i_can_only_imagine", "unbroken_path_to_redemption", "facing_the_giants", "let_there_be_light", "crash", "the_hate_u_give", "the_show", "woodlawn"]}