{
  "id": 112,
  "title": "The Twilight Saga: Eclipse",
  "starring": [
    "Kristen Stewart",
    "Robert Pattinson"
  ],
  "runtime": 124,
  "genre": [
    "Adventure",
    "Fantasy",
    "Drama",
    "Romance"
  ],
  "description": "Bella once again finds herself surrounded by danger as Seattle is ravaged by a string of mysterious killings and a malicious vampire continues her quest for revenge. In the midst of it all, she is forced to choose between her love for Edward and her friendship with Jacob, knowing that her decision has the potential to ignite the ageless struggle between vampire and werewolf. With her graduation quickly approaching, Bella is confronted with the most important decision of her life.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3mFM80dPzSqoXXuC2UMvLIRWX32.jpg",
  "categories": {
    "plot": 3.36,
    "acting": 4.592592592592593,
    "ending": 1.75,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 3.6666666666666665,
    "action": 6.615384615384615
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Although Bella's still the ignorant **** and the triangular romance is baffling as the HP one, \"Eclipse\" is possibly the best Twilight movie so far. Using REAL action, an understandable story, and an slighter increase in character development the movie finally develops into something more of a mindless romance blockbuster, the appropriate title this **** up saga so craved for. Overall, with bitten lips, I'll recommend it."
    },
    {
      "rating": "0",
      "text": "This movie was the epitome of terribleness. I wanted to die as I was watching it. It has a bearable story line but theres no good moments or anything cool or enjoyable in this movie. Worse actors cannot be found and the director was likely off snorting cocaine when the movie was being filmed because it was obvious that he didn't even have a presence during filming. Just please stay away from this movie if you want to keep your eyes because mine have been burned off by the pure shit that this movie is."
    },
    {
      "rating": "4",
      "text": "It's teeny-bopper sheen, abs, and amateurish writing obscures what could have been a good movie. It's too bad the plot centers around a love triangle and romantic lines that would make George Lucas cringe."
    },
    {
      "rating": "0",
      "text": "A silly film based on silly books that are badly written and in correlation badly acted. For books that have so much confusion in what they want to be and what love is, it's no surprise that this movie is campy and silly."
    },
    {
      "rating": "0",
      "text": "The majority of teenage girls and I, do not see eye-to-eye on entertainment. They enjoy things like One Tree Hill, pop music, and whatever is on MTV while they're sitting in-front of the television. Things that promote superficiality, melodrama and self-absorption. Twilight is yet another of these things. It's badly written, terribly acted, superficial, and worst-of-all, boring as hell. I cannot say enough bad things about this, and the fact that this has become as popular a fad as it has, makes me want to die a slow agonizing death from cancer just to get my mind off of it. This isn't receiving a 0 because \"I'm a guy and guys just hate Twilight because girls enjoy it\". This is getting a 0 because it is truly earned, by a movie (and book) that have no thought put into beyond the characters appearances. There is nothing redeemable to list here."
    },
    {
      "rating": "0",
      "text": "I've just started to write a script which will make me millionaire. Here's the recipe; dig out a few Mills & Boon romantic trash novels (3 in all), re-write the romantic hero as a cutesy-wootsey werewolf, who upon the sight of a full moon enjoys to nothing more than to roll-over and have his belly tickled. Enter the romantic anti-hero who doesn't admire having his belly tickled so much, but rather prefers gnawing at a butcher's bone and terrifying stray kittens of an evening. Let one cute human, kitten-owning teen to be a the centre of a love triangle between said doe-eyed-beasties. Put together a cast of good-looking young people to populate the families, friends and townsfolk of this fictional village. Don't let any of the protagonists kiss until the very last 10 minutes of the final movie in order to maintain a high level of suspense among the female, pre-teen audience."
    },
    {
      "rating": "1",
      "text": "i have to admit i haven't read the books, and i watched the movies just to know what's everyone so crazy about. but this movie was super-boring. it wasn't as horrible as new moon, but the acting almost made me cry with frustration. i mean, they get paid soooo much money for this??? i just don't understand why the movies are such a big hit. it has nothing we haven't seen before!!! little advice, read anne rice, watch true blood, coz that's about real vampires. this is just a pile of crap. thank gods i'm not stupid enough to pay to see this garbage"
    },
    {
      "rating": "0",
      "text": "While the other two Twilight movies were bad, this one sets a new low by having the least interesting plot, meaning it was so bad, I would've given this movie a -5 if metacritic let us do it."
    },
    {
      "rating": "0",
      "text": "Okay, seriously? This is what some people consider to be a good film? This is what people were up at midnight to see? You gotta pray for humanity, even if you don't believe in God. Okay, opening rant aside, lets move onto the actual film review. This films plot is less stupid than New Moon. Here, it's basically Newborn Vampires VS The Cullens and Jacobs Pack. The problem with that is that the Newborns are hugely anticipated and so built up, but, the fight lasts barely a minute, and they don't even do damage against the good guys. Bella's a **** There she is stringing Jacob along, when we all know she'll choose Edward over him. Heck, they're discussing him turning her at the beginning of the film. Poor Jacob, his heart being played like some toy. The dialogue was crap. This is an actual piece of dialogue. Charlie Swan: What's going on? Jacob Black: [pause] I kissed Bella. [pause] Jacob Black: And she broke her hand. [pause] Jacob Black: Punching my face. [pause] Jacob Black: It was a complete misunderstanding. Whoever wrote dialogue like that probably wrote for Andromeda. The troubling thing is that in the theater I was in, people actually laughed at that dialogue. They'd probably have laughed if someone just got up their and jingled a bunch of keys. And we're supposed to believe that Bella and Edward are in love? They have as much chemistry as a rapist and his victim. And Edward still looks like a **** with his pale ass face, his disco ball impressions in the sunlight and hair being 95% gel I will add one positive thing: Bryce Dallas Howard and Ashley Greene are beautiful! Thats the only good thing I can say about this piece of crapola. To close this review, If you see a twilight fan who calls this the best film of the year, do the right thing. Slap them over the head, give them a copy of Nosferatu, Dracula, Near Dark or 30 days of night and hope they get immerssed into a REAL vampire movie"
    },
    {
      "rating": "2",
      "text": "More generic sparkly vampire nonsense that doesn't deserve your attention. Despite being a flavour of the month thing, where vampires are periodically \"cool\" again for a month or two, this movie caters for screaming fangirls and nothing else, please avoid if you are over the age of 13"
    },
    {
      "rating": "1",
      "text": "One of the most boring movies I've ever seen... one of the worst actresses I've ever seen seriously the girl really needs some acting classes. They sell the Lautner boy like a piece of meat is always half naked =___=. Pattinson acting is about 30/100. The \"great final fight\" is lame, MORE THAN LAME, for me this movie sucks.  The only point I'm giving is for the character of \"Alice\" wich I found interesting."
    },
    {
      "rating": "1",
      "text": "How many more Twilight films must they make before they finally realize that they are creating an abomination of a franchise? Although Eclipse is better than its two predecessors, which is hardly saying anything, it continues its dull and lifeless story with very poor acting, dull imagery and a totally boring characters. Three films, three flops. This is getting ridiculous."
    },
    {
      "rating": "3",
      "text": "Just because of a slight improvement, the \"Twilight\" series won't win over much more fans. Once again, we have a bland script and terrible    acting."
    },
    {
      "rating": "3",
      "text": "This new dose of vampire mush for puss:es is the worst load yet. It offers no payoff at the end, and not even any highlights throughout its duration. The plot literally flatlines after the first frame."
    },
    {
      "rating": "3",
      "text": "The plot in this movie went nowhere. It seemed to start and end in the same place with no movement or further character development from the previous movies. The acting was uninspiring, but on a positive note the backgrounds and filming locations were gorgeous."
    },
    {
      "rating": "2",
      "text": "The Twilight Saga previously consisted of 2 mediocre films.Well now it has a bad one too.My first concern with the movie is its budget.It seems that when the director was given the over 90 million budget his first tought was,ok we gotta have an epic action.Well at the cost of some good action scenes the plot goes nowhere and the characters,especially Edward are as dimensional as a piece of paper and as intersting as a rock.This Vampire romance almost hits bottom.Do yourself a favor and don't watch it."
    },
    {
      "rating": "5",
      "text": "I didn't like this movie,AT ALL!!! I don't why people think that this sparkling turd of the movie is so bad that I DON\"T KNOW,IT'S JUST ANOTHER STUPID TWILIGHT WITH SPARKLING OF DUMBNESS!!! I don't know why people and some stupid critics believe that this movie is really awesome,because it's not. It's like you're going to see a movie that you think this movie is going to be amazing,but I guess that this wants  to see it because the viewers and the moviegoers thinks that we are all IDIOTS for watching this this THIS Sparking Vampire! But this third one could be the least bad,it only works. Much like the two Twilight movies are bad as ever and I guess that they least embearble to the series. The scenes are too corny,the action is few of them and they actually rip-off the \"30 Days of Night\" because the director did this movie into fighting scene like that,wouldn't be explain about the fighting in the movie or in the book,those three annoying morons are still annoying and I can't stand listening with those bad vampire tones all the time,I mean please I wouldn't pay attention to Edward Cullen about his lovey dovey crap of all time,and the scenes are much standard that it's not quite interesting. So that's all I have to say and for the record I should think that this movie will be exactly a \"JUMPING INTO SHARK\"!!! Thank you,if you feel so hating that third movie into sparking crap,please avoided! If any tween girls feel drunk and crack the whole time spinning their head,feel enjoying this movie. This is the movie that the people will watch to whole time,and us PLEASE!!! (Note: I just wanted thank Owen Gilberman from Entertainment Weekly for liking this movie and I have no point that this movie could be more interesting and for idiot critic like that,I wouldn't been trusted anybody who likes this movie and for shaming liking all the time,that's too harsh to everybody else and make us bad reviewing lack of opinions that it's just not the same,screw you and Twilight,LEAVE ME ALONE!!!)"
    },
    {
      "rating": "3",
      "text": "This movie was bad. This was the first twilight movie I saw. A lot of wooden, sometimes hammy, acting, dumb love scenes, terrible script, average special effects, and a bad story with bad characters. I do not recommend that you see this movie."
    },
    {
      "rating": "1",
      "text": "After while It seems as if myers wrote these books only trying to strech the same plot out over four books, it gets old. It's not much if a mystery this francise is very predict able. Bella chooses vampire, vampire happy but werewolf sad what more do you need to know!"
    },
    {
      "rating": "0",
      "text": "The best eleven dollar nap I ever had."
    },
    {
      "rating": "2",
      "text": "The love story between Edward and Bella is so unbelievable and contrite. The plot seemed choppy and not a lot happened in the whole movie. The outlines of the plot itself - Werewolves and Vampires united/fighting could be great, but Underworld and Blade are only a bit better. This topic needs done by Sam Raimi or Peter Jackson."
    },
    {
      "rating": "1",
      "text": "What the he!! was this... some of the worst effects ever, completely unbelievable. The character development is obviously aimed at the 12 year old female audience. Don't waste your money, see twilight again."
    },
    {
      "rating": "10",
      "text": "A very good interpretation of the book. If you dont like the book dont go to see the movie. Simple as that. Why people have to make such a song and dance about it I dont know."
    },
    {
      "rating": "3",
      "text": "The last movie i say with acting this bad was New Moon lets face it these actors will never Evolve."
    },
    {
      "rating": "0",
      "text": "This isn't literature, it's toilet paper. This isn't a film it's the mental decay of a generation. Original ideas, intelligence and sincerity are officially extinct."
    },
    {
      "rating": "5",
      "text": "I like the story and the locations where the film was shot but I think that they could have chosen better actors as Bella and Edward. There is no chemistry between them (who are supposed to be a couple) and the acting is bland and fake. everything about Kristen Steward irritates me. she cant act and surely there are better female actors who could have played bella and made it convincing that she has this big thing for edward an all the drama that she goes through."
    },
    {
      "rating": "2",
      "text": "I saw it with my girlfriend and she's really into this stuff (vampires etc.). Maybe that's why I found this film a little bit frivolous. I don't mind if someone like it - it's his stuff. But please, I don't wanna hear about it all time. When will the new Twilight movie hit the cinemas? Really, I don't care"
    },
    {
      "rating": "9",
      "text": "The Twilight Saga Eclipse is the best movie of Twilight series there is action,there is suspense and some Horror scenes.people dont like this because this movie is from twilight saga series,but i think this is great!"
    },
    {
      "rating": "10",
      "text": "So much action!!!! I love action movies and if you have read my reviews on the other two Twilight movies you will see how I bring up how there is not enough action. This one did not have alot alot of action but it had alot of action compared to the other two films!  The script was not slow at all! It kept you in the movie...it kept you engaged!    The actors were fabulouse! Just awesome or great. They were so good I can not explain how good they were!  My favorite scene in the movie was the scene after the tent scene. The scene where Bella asks Jacob to kiss her!  Well I hope that you enjoyed reading this reveiw!"
    },
    {
      "rating": "10",
      "text": "Uff, finally, this third part of the twilight saga is better than the other two, the situation is incredible, and the fight with the neo vampires is sorpresive, an incredible film."
    },
    {
      "rating": "4",
      "text": "With still the incredibly weak performances, and still unintentionally funny moments( basically most of the film) make this the worst written yet, but boy is it entertaining. I give this film a  38% of a good movie."
    },
    {
      "rating": "10",
      "text": "I happen to like it. Isn't the point of watching most movies is to be in another place & to try experiencing something different? Alot of people don't have perfect lives, so to crash down on something that gives some hope is not very nice!!"
    },
    {
      "rating": "10",
      "text": "Loved it. Far better than its predecessors. Strong cast, decent plot, good pace, well-scripted, lashings of humour, action, and an actual storyline. Loved it."
    },
    {
      "rating": "10",
      "text": "Eclipse is the greatest movie in the world. When I saw it for the first time I really wanted to watch it again and again. I went to the theare the first day it was played. At the time my friends and I got out the cinema we went and book others tickets for us to watch it at the passing two days. I think the saga of twilight its really good and I wouldn't change anything of it."
    },
    {
      "rating": "0",
      "text": "Bring a vuvuzela to a screening of this movie."
    },
    {
      "rating": "0",
      "text": "Much hate for this trivial crap."
    },
    {
      "rating": "9",
      "text": "Great movie! Eclipse has all the intensity it promised. All of the actors/actresses are awesome and as always, I leave the theatre waiting for the rest of the story."
    },
    {
      "rating": "6",
      "text": "The third installment of the \"Twilight\" saga is another total eclipse of the genre, the horror genre, which is dominated by male narratives. \"Eclipse\" has a feminine one. At least the vampires and wolves and the Joan Jett impersonator don't sing like the \"monster\" in Andrew Lloyd Webber's \"Phantom of the Opera\". At least \"Twilight\" isn't a musical...yet. So there's no need to bang on this franchise for not being Katherine Bigelow's \"Near Dark\", or Josh Whedon's \"Buffy the Vampire Slayer\", until, that is, Bella and Edward perform a love duet sometime in the future on a Broadway stage. After all, boys aren't the only one who need mythical heroes. If \"Star Wars\" was intended for girls, Darth Vader would have used \"The Force\" on Princess Leia, in a heartbeat, to lure her away from Luke Skywalker. Love would become as important as conquering the galaxy to the foes, who are, of course, both related to the only readily available female for pro-creation as a preventive measure against the sort of scene in \"Eclipse\" where the interspecies lovers polarize the sexes in a violet field with their languorous talk about themselves. If Leia wasn't his spawn, Vader would have definitely tried to f*** the princess, but he's locked into a male narrative which removes that possibility by default. While there's action in \"Eclipse\", it never gets in the way of the love that exists among this latter-day \"Jules and Jim\", who both pine for Catherine(played by Jeanne Morreau in the 1962 Francois Truffaut classic). Edward and Jacob, who both pine for Bella, are in perfect position to bridge the desires of the moviegoing sexes when this precarious trio are caught in a snowstorm, where the vampire, because he's a raspberry popsicle, employs the wolfboy to warm up his shivery girlfriend. If Jacob and Bella went all the way, it would, for all intents and purposes, precipitate a battle to the death, which is what the material cries out for. But the \"Twilight\" series is \"Star Wars\" for girls, and there are preventive measure in place to appease the core audience. So they cuddle. Edward can handle abs."
    },
    {
      "rating": "7",
      "text": "Whereas the first two movies were very slow, this one tries to balance action and character development, and for the most part does it well. (I admit I've only read the first book and watched the first two movies on DVD). Fans seem split into Team Jacob and Team Edward camps, and each will have much to cheer for in this movie. I'd say give this movie a shot if interested."
    },
    {
      "rating": "9",
      "text": "this is so much better than the first two movies."
    },
    {
      "rating": "7",
      "text": "Brilliant opening scene that actually looks like a real vampire movie. This makes a nice change from the first two. But unfortunately our next scene is Edward, the 110 year/old Vampire asking Bella, a 17 yr/old girl to marry him. It's a tad creepy. Th forest chase was excellent, great effects and the very thing vampire fans love. The love triangle is a bit pitiful and 'same old'. Let's hope that's the last we see of it and Jacob moves on to a far more interesting girl. Overall this is better than it's two predecessors."
    },
    {
      "rating": "5",
      "text": "The Twilight series are just simply not worth ranting about over the net. Sure Taylor Lautner is attractive and sure there is chemistry between Stewart and Pattinson, but the franchise is crap and we all know it. Predictably when they made a successful novel, they will probably turn it into a movie, so there born the Twilight series. Written elegantly by Stephanie Meyers and ruined by Hollywood. Even though in this particular film I admired the CGI effects and the director, it still doesn't make up for the bumpy plot and high school acting. Especially Lautner, all he is good for is pleasing the audience (girls) with his abs and that is not acting (to say the least). Twilight Saga: Eclipse has its goods but there weren't enough to cover its faults."
    },
    {
      "rating": "10",
      "text": "I thought it was great. the actors really made me feel like they meant it, and it sorta makes your head feel abit tipsy when you try to get back to reality."
    },
    {
      "rating": "10",
      "text": "I thought this was very good. Interesting story, fine acting and cinematography. I think it was a vast improvement on the second movie in the series. I look forward to seeing the next part."
    },
    {
      "rating": "10",
      "text": "One of the best Twilight movies so far. You have  to go see it. Espesially if you are a werewolf fan and I am. I can not wait untill Breking Dawn comes out. Please please please do not judje the twilight saga movies by there actors and actresses or any of that. Give it a chance."
    },
    {
      "rating": "6",
      "text": "I appreciate all the works of the saga on screens so far, but, Twilight Saga should've been directed from earlier by the those 'cold hands' such as Peter Jackson, James Cameron or Spielberg,perhaps. I don't know if they've been read the books and get into them or not..but at least, we'all know how well-directed they are when combining the story(Lord of the Ring), the plot(Indiana Jones), the sci-fi(ET) or even the romance(Titanic and Avatar) into something not only worth-magic beyond the imaginations but they're all,yeah, worth seeing for the audiences (the fans and the outsiders), worth experiences for the casts, and off course definetely great-investments for all those in the principle managements."
    },
    {
      "rating": "8",
      "text": "The movie keeps true to the book which is difficult to do while having audiences engaged!!"
    },
    {
      "rating": "10",
      "text": "Loved it!!! I can't believe critics are giving bad reviews, the movie was very intense and the best one yet. Yes, it is not all graphic which is good since millions of 10 years and up want to see it, what is wrong with a clean adventure/love story that leaves something to the imagination."
    },
    {
      "rating": "3",
      "text": "The Twilight Saga - adds another snore to the list- not only is ECLIPSE bad its also awful - Visually the series is engaging but it lacks a coherent script and dialogue that would embarrass the Brady kids - Witless- Stale and self loathing."
    },
    {
      "rating": "6",
      "text": "honestly, i'm a massive fan. book fan before the movie, anticipated twilight the film as soon as the cast was announced. but eclipse is a thick book and it came out as only a two hour movie. this franchise has die hard fans that will go see it at midnight and it was only two hours. i think if they added an extra half an hour into it, they would of had some time for transition scenes. it flicked from one story to the other with no inbetween. it was hard to get into character development because it just chopped and changed. harry potter 2 and 4 did it and they definatly weren't the best ones and i think thats what made eclipse not quite hit home as it should. i still loved it and when you first see jacob in it and the attitude he gave off made me want to switch sides. i think actually the bigger the book the more they freak out about cutting it down. all i can say is thank god the next one is being split. david your direction was excellent though particularly in the fight scenes. perfect touch. and to all the actors awesome. but i also would of been happy if jane asked for bree's name like the book. because it would of been slight aknowledgment of the novella which i thought would of been cool. can't wait for the next one. thank you everyone who brought these to life. they're awesome."
    }
  ]
}