{"id": 1065, "title": "The French Dispatch", "starring": ["Bill Murray", "Benicio del Toro"], "runtime": 108, "genre": ["Comedy", "Drama", "Romance"], "description": "The staff of an American magazine based in France puts out its last issue, with stories featuring an artist sentenced to life imprisonment, student riots, and a kidnapping resolved by a chef.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/pMTMSKBEe5sMg1ZxWCy9YWLuyln.jpg", "categories": {"plot": 6.25, "acting": 5.411764705882353, "ending": 6.0, "soundtrack": 7.0, "cinematography": 6.333333333333333, "familyFriendly": 3.0, "funny": 8.125, "action": 7.5}, "reviews": [{"rating": "3", "text": "I think I'm about done with Wes Anderson and his dedication to style that reflects back on him with delight and satisfaction, but provides far less of either for the viewer. Enamored as he is with anthologizing The New Yorker from its Paris days, he has little to say beyond the fact that he is a great fan. And though that does count for something, it counts little in terms of engagement beyond a moment's delight with the passing scenic designs that slide and shift without cessation. Anderson has many admirers, to be sure, but I can't count myself as anything but one who gave it a number of opportunities to 'get it' and didn't."}, {"rating": "7", "text": "I think Wes Anderson films are all about style; I can hardly remember the story of some of them. I don't think he's a bad director; but, for me, the excess in detail is distracting. 'The French Dispatch' is your typical Wes Anderson movie, and I can't stop wondering if he'll keep on doing the same thing when he's 70. It's cool and all, but I wish he tried something else. Nevertheless, his new movie is fun, has good acting, and writes a love letter to journalism, a dying profession."}, {"rating": "7", "text": "Wes Anderson nunca fez filme para agradar multidões, não se enganem com \"The Grand Budapest Hotel\", por isso mais uma vez temos ele cheio de si, e para quem gosta.Não é a obra prima do diretor, mas continua ótimo assistir a maior quantidade de atores fantásticos por metro quadrado em um roteiro mirabolante.A primeira história é definitivamente a melhor, aliás."}, {"rating": "10", "text": "The film amazes with its picture, it's amazing. It can be compared to a picture that came to life as if in Harry Potter. The spirit and atmosphere of France are perfectly conveyed, and if we talk about music, it fits harmoniously into the overall picture. This movie is author's, not for everyone. Not very smart people won't understand."}, {"rating": "7", "text": "As per his typical form, director Wes Anderson has again delivered a stunningly impressive stylistic offering in every production design detail. And, to his credit, he even manages to serve up a film that is often charming, witty and funny, elements often absent from his pictures in light of his substance-over-style tendencies. But this is still another example of close but no cigar. In this homage to old school foreign correspondent print journalism/reportage, told in a series of vignettes, Anderson gets it right about 50% of the time, despite the movie's superb technical and artistic accomplishments and its fine performances by a glittering all-star cast whose members obviously had a great time making this picture. It's a shame, however, that the filmmaker, in his typical manner again here, never quite manages to pull it all together to create a finished product that fires on all cylinders. Diehard fans of the director will no doubt love this release, while the average cinephile will likely come away impressed by its celluloid eye candy and modestly amused for its eccentric, if not always spot-on storytelling. Maybe one day Anderson will live up to his potential, but, based on this outing, he still has yet to do that."}, {"rating": "9", "text": "An extremely funny, ironic and rather melancholic requiem for classic modernism and its belief in art, love, humanism and intellectual discoveries. The amount of detail is insane, each frame is crammed with ideas."}, {"rating": "4", "text": "Come for the Wes Anderson style! Sleep through the Wes Anderson plot. BOR-ING! Wes makes every film look good. The last few just haven’t been entertaining."}, {"rating": "8", "text": "Another great film from Wes Anderson. This film focuses on 3 separate stories and all of them are great in their own way but some are definitely better than others. I’ll rank them at the end. All of the performances are great with my particular favorites being from Benecio Del Toro and Jeffrey Wright. Every cast member is fantastic in their role although I wish we saw more of Owen Wilson and Bill Murray. As always, the production design, cinematography, and writing are top notch. Although I like the more streamlined writing of his other films, Anderson does a great job at juggling three different stories here. Some stories are more interesting than others though and that kind of diminishes some of the other ones. I also found this film to be really funny as well. There were a lot of moments were I found myself laughing especially in the first and third story. The third story even goes through an animated segment and while the animation looks rough, it’s intentional. It’s truly something to see on the big screen. My ranking for the stories goes:3. Revisions to a Manifesto2. The Concrete Masterpiece1. The Private Dining Room of the Police CommissionerDefinitely go see this when you can. It’s a great film."}, {"rating": "7", "text": "Undeniably excellent in technical terms (editing, production design...), this anthologically structured film narrates us 3 entertaining stories. And that's it's biggest flaw, that they're just entertaining.Although being genuinely fun, The French Dispatch lacks the heart and emotion that Grand Hotel Budapest did have.The whole cast is great, (Del Toro, Seydoux and Chalamet in the podium) but probably what I found the most enjoyable was Alexandre Desplat's score."}, {"rating": "9", "text": "Equal parts funny, crazy, ironic and melancholic, Wes Anderson's latest film is an experience you have to see to truly understand. There's nothing quite like it at the moment."}, {"rating": "8", "text": "An endlessly inventive film that may not make sense to strait-laced, conventional moviegoers. The film has its own logic and unique style, and the “stars” immerse themselves into the director’s quirky vision of reality with gusto. You have to “go with it” and accept Anderson’s unique world where things are not quite “right” but make perfect sense. I enjoy films like this (and the actors seem to also), and they can be great fun. It’s a terrific escape from logic and real life for an hour or so, especially in the days of Covid."}, {"rating": "7", "text": "Wes Anderson’s latest may be his most accomplished and precious yet. It brings stories alive from the titular fictional magazine, that’s based in Ennui, France, but published in the US. Each article has its own approach, but they’re all unmistakablely Anderson’s style: Visually precise and quietly eccentric with deadpan dialogue and subdued reactions. The cast is loaded with noted actors who are having fun playing their quirky side. This is like a lovingly-stocked curio cabinet: engaging to look at and fascinating to marvel about. Fans will likely be thrilled, but I appreciated the craft more than I enjoyed the stories."}, {"rating": "9", "text": "Touching and thought-provoking, especially the first and last stories. An excellent cast evokes nostalgia for a time and place I've never been. The middle article, underutilizing the talents of Frances McDormand and featuring that insufferable kid from Dune, was rather weak, but overall this is another artistic home run for Wes Anderson, with lots of laughs and his strong writing in full force. While it never reaches the heights of \"The Grand Budapest Hotel\", it's the best movie I've seen since \"Pig\" and a more than worthy entry into his catalog. It's also the first time I've actually felt his artistic flourishes get in the way of his storytelling, as the constant changes in format, color, and even aspect ratio can be jarring from time to time - a minor complaint that I'm sure will be remedied on repeat viewings. I only wish Anderson would make more films, as the wait between his films has become painful."}, {"rating": "10", "text": "What can I say? I'm a Wes Anderson fan and have been since I saw Rushmore. This is full-bore Wes Anderson. It's everything I love about his movies with everyone I love in it, and more! Add to it, I'm a fan of the New Yorker, and this is the best of the New Yorker and those who love it. It's a winner and I was not disappointed."}, {"rating": "0", "text": "One is the most boring, heartless and unfunny movies I’ve ever seen. Children level of dialogues and very oversaturated scenes with nothing to see. Visual gimmicks and nothing more."}, {"rating": "0", "text": "Brutally stagnant and soulless storytelling from someone so obsessed with maintaining a certain style that characters are not allowed to move lest they wrinkle their costumes. Fans are so enamored with character and scenario that they no longer care if the movie is populated by corpses."}, {"rating": "0", "text": "This is a stupid movie...  i killed it after ten minutes of fast forwarding to see if there was anything worth watching...  save your money...  i'm glad it only cost me $1..."}, {"rating": "7", "text": "Wes Andersons' attention to detail and whimsical, charming style make him one of the most unique filmmakers. He creates a colorful ensemble with a wild yet intricate imagination. However, like some of Anderson's previous works, 'The French Dispatch' is intricate to a fault. Unlike his previous outings, 'The French Dispatch' actually feels like two hours, twenty minutes longer than its runtime. There is so much witty dialogue that made me feel as though Anderson was deliberately trying to stretch time. While I appreciate his approach for standing out, I feel as though 'The Grand Budapest Hotel' had a far more grounded story that helped drive the plot rather than drag the moviegoers along. It's still a smart and well-acted film by an impressive ensemble, and I would recommend it to any film buff or Anderson fan. However, the stylistic structure and intricacy of 'The French Dispatch' actually overwhelms the plot and the audience."}, {"rating": "9", "text": "A childrens book movie made for adults.    Artful and self indulgent and does not apologize for it"}, {"rating": "10", "text": "As a Wes Anderson fan I got more than I expected with all the stunning style, waterfalls of irony, best cast modern Hollywood can offer and wonderful soundtrack. Will re-watch it on streaming, can't wait."}, {"rating": "5", "text": "Wes Anderson doing his best Wes Anderson impression. Messy structure, hollow characters and a lack of anything meaningful to say but hey, it looks gorgeous and has Bill Murray so it's sure to please the fanboys. If you're looking for engaging characters and in general more than pretty pictures and an ensemble cast, look elsewhere"}, {"rating": "9", "text": "From the poster, Wes Anderson's films present themselves as a big box of surprises; this, which is a love letter to journalism, corroborates it. Combining black and white and color photography, and with an epic narrative, supported by an irresistible cast, it is a film that no one should overlook."}, {"rating": "7", "text": "Probably Wes Anderson's most intricately constructed film, with layers and layers of themes and narrative. I couldn't possibly label them, because honestly, I'm a bit exhausted from it. Its an anthology film connected around the titular fictional magazine, and the three main stories have varied success. The first story is phenomenal, the second is a bit boring, and the third is obnoxious and wonderful. It's a fantastic work to examine, and I'm sure I will like it even more upon additional viewings."}, {"rating": "8", "text": "Es difícil de analizar, no es como las demás películas, es una consolidación del director, una película de Wes Anderson, muy de Wes Anderson.Tiene una narración diferente, dividida en sketches, si se puede llamar así, novedosa, que no cuenta nada y al mismo tiempo te lo cuenta todo.Artísticamente es una gozada, las interpretaciones también, cómo no, se acabará convirtiendo en un clasicazo, a pesar de no ser, probablemente, la mejor del director.· Cosas buenas: El nivel formal, todo está muy bien planteado, muy bien dirigido, muy bien artísticamente, todo muy bien. La consignación del estilo del director, es como una película dentro de una película. La historia del pintor, para mí, la mejor, el toque que tiene en un preciso momento de animación 2D, el reparto, y el formato mola un montón.· Cosas malas: A veces, el contenido flojea, la película está un poco emborrachada de ego, más que una carta al periodismo es una a sí mismo, y quizás, si no te gusta el cine de Anderson, te puede parecer algo pedante.· Conclusión: A mí me ha encantado, sobre todo la forma, como he dicho, es súper bonita de ver, está muy bien dirigida, y es una gozada, pero no puedes ir al cine esperando ver una película normal, tienes que ir con otro mood."}, {"rating": "6", "text": "Wes Anderson has a unique style and look to all of his films. I enjoy his movies for the most part.I was all in on his first two stories about the final issue of the French Dispatch magazine. Benecio Del Toro, Adrain Brody, and especially Tilda Swinton are great in the 2nd story about a tortured artist who's in jail for murder.  But the last 2 stories couldn't live up to the firsty 2---hence the mixed bag review from me."}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "5", "text": "Arthur Howitzer Jr., son of the founder and owner of the Liberty (Kansas) newspaper \"The Evening Sun\", convinced his father years earlier to finance a Sunday supplement and set up the editorial office in Ennui-sur-Blasé. Expatriate to France, \"Picnic\" becomes \"The French Dispatch\" and covers the news of the country 'with style'. Because around his desk, Horowitzer Jr. gathered the best journalists of his time. Archaeologists of the newspaper, 'chase' on the field the subject that has been assigned to him: a student protest that turns into idyll, the investigation of a commissioner on the trail of his son's kidnappers, a psychotic artist and convict in love with his guardian, the obituary of Arthur Howitzer Jr, who put down the pen. And the last issue will be an anthology of articles, the best, dedicated to him.Film as usual, touch of interesting shots, but with this film Wes Anderson begins to repeat itself a bit without offering any new and interesting ideas. A film that smacks of already seen and that adds nothing to the good filmography of the Texan director."}, {"rating": "6", "text": "Slightly disappointing. A typically solid performance by an ensemble cast and Wes Anderson’s trademark style kept my interest but it never quite reaches the sum of its parts. It does stand as a nice tribute to journalism and the power of storytelling, though I felt the stories presented could use something more."}, {"rating": "2", "text": "It's your typical Wes Anderson film with a great cast but it ultimately needs up feeling shallow and forgettable. There was no real message or meaning behind it. I'd certainly put this way down on the list of films he has created as it ended up being quite a disappointment to me."}, {"rating": "4", "text": "except for \"The Concrete Masterpiece\" it's at best irrelevant and unappealingly stuffy style that only works with the right story. which is simply not the case for the rest of this movie."}, {"rating": "5", "text": "All style, no substance. The movie stretches out its runtime to the extreme. The stories are charming, surreal anecdotes that would make for great short movies, but fail to create a thematically coherent narrative for a feature film. The French Dispatch is lovely to look at. Anderson's signature style is delivered flawlessly - it feels like the movie belongs in a modern theatre. The attention to colour is outstanding among modern filmmakers and the camera work is never just there - it's actively telling a story (if you remember the ratio change at the end of the painter story, you know exactly what I'm talking about). It's a real shame Anderson is a visual artist first, and a storyteller second. The French Dispatch provides no food for thought and leaves your head as soon as you exit the screening room."}, {"rating": "8", "text": "The latest outing from whimsical cult-favorite director Wes Anderson sees the chief of a popular journalist column known as The French Dispatch of the Liberty, Kansas Evening Sun passing away suddenly, prompting a look into their last issue that takes a look at some of their stories over the years, ranging from a death row inmate who falls in love with and frequently paints one of the guards while finding himself at odds with an eager art dealer, a young man and his relationship with a much older journalist while he's writing a manifesto in the midst of a school-wide revolution, and another journalist who finds himself in the midst of a kidnapping/hostage situation involving a young boy. Anybody who's familiar with Anderson's directorial style will surely know what they're getting into with this, as he seems to fully embrace his signature whimsy and charm more and more with each new release of his, and this film is certainly no exception to that. Zippy dialogue and zany and colorful set pieces are plentiful here, with just a twinge of absurdism mixed throughout to create just the right blend of humor and intrigue. The film also uniquely and cleverly makes use of several aesthetics without coming off as gimmicky, such as switching back and forth between black and white, playing around with aspect ratios, and even switching between live action and comic book-style animation on occasion. As for the cast, it's stacked with a-list talent as you can see on the poster, and it's impossible to single anybody out since everybody here is just so enjoyable and endearing to watch! Those who know Anderson best will recognize his usual players, such as Bill Murray, Adrien Brody, Owen Wilson, Tilda Swinton, Willem Dafoe, and Edward Norton just to name a few. We also get some great supporting turns from the likes of Francis McDormand, Benicio Del Toro, and Timothee Chalamet to name a few more. Story-wise, there's plenty of entertainment enjoy to be found in each of the segments throughout the film. Really my only note would be that it feels a little TOO Wes Anderson-y, so those who aren't a fan of his or his style likely won't be won over with this film, quite the opposite probably, cause he's definitely not for everybody. Overall though, well there's not much in the way of story or narrative here, the cast is a delight to watch, the stories are all unique and enjoyable in their own way, and Anderson is in full command of his trademark aesthetic and style here, for better or worse."}, {"rating": "8", "text": "Good !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "8", "text": "A great return to form in my opinion with Wes. With films like Darjeeling and Grand Budapest, it felt like Wes was more focused on aesthetic than compelling story and characters, and had just become a caricature. This film doesn't stray from the now neo-classic Wes look, but broken down into vignettes, it allows for multiple stories which is totally what saves this film. Before you get consumed by Wes-isms, the story changes, and each one has it's own flavor.  If Wes continues to make films look the way they do, I might advise that he keeps going with the vignette format, because it truly paid off in this, what I consider a very formidable and fun comeback film.  His best since The Life Aquatic if we're only doing live action. Best since Fantastic Mr. Fox if including animations. The cameos weren't rubbed in one's face too hard.  It all added up to quite the fun time without any of the contrived Wes-isms of the recent past.  Definitely don't skip it!"}, {"rating": "7", "text": "I liked the concept, the cinematography and the Wes Anderson style of the movie, but the actual story not as much as lets say Budapest Hotel. It still was nice and it had an interesting structure, presenting it like a retelling of magazine articles, but some of the stories, mainly the one about politics and protests, felt a bit too boring for me."}, {"rating": "6", "text": "The French Dispatch is Wes Anderson's most controversial film. This is the most difficult film from him in perception, here is the most stellar cast, several different stories and games with a chromokey. But in the first The French Dispatch is the director's most personal film and the most boring and passing film. In the second of several stories, holistic only about Benicio del Toro, in the third the film is dedicated to the real newspaper The New Yorker, if you have not read it - the film for you will be a passing one. The film clearly pays tribute to journalism. For the non-Western public, The French Dispatch will be a passing, he will bribe the cast, but disappoint the viewer by the result."}, {"rating": "7", "text": "I don't think this is the best WA movie, but it has it's own unique visuals and structure. The story is separate in trois morceaux and are very distinct. Which kinds of break le rythme, in a way. I like the visuals and even the dessins animées. Obviously they are there for budget reasons. C'est la vie. What I found hard to deal with, was the intellectual level of the dialogues. Ils sont droles but not very easy to digest because they are very fast. And that problem is even more pronounce in the french. Je parle francais, and I could only get partial understanding of the french sections. The music was only partiellement bonne. I must say I loved all the actors. I give it, je donne au film 72%. I think the manifesto section for me, didn't do much. Quand meme un film interressant de WA and very typical of his art style."}, {"rating": "7", "text": "Propaganda for The New Yorker, eh? Nah, I'm kidding. Wes Anderson is great, and still doing good work. Solid but niche: this one is for the writers & journalists!"}, {"rating": "6", "text": "Asking Wes Anderson to change his style at this point in his career is just ridiculous.It's not unjustifiable of course, but for a film director, more than anything an artist, you can innovate and evolve without changing your way.And even with the things I enjoyed about The French Dispatch, and it pains me to say so, Wes Anderson has fallen into notorious creative indulgence.Clearly his style is already something that he makes in an automated way, but that also means that he too has put aside any attempt to do something that could shake his formula.Anderson has never been a director who has put much emphasis on narrative, but at least his films were brimming with humor, grace and wit.The French Dispatch feels like a film to which he paid the utmost attention to all visual details, but it populated his world with insubstantial, bland, and inconsequential characters. Same goes for all the performances.At the end of any of his previous works, I always took a favorite character with me. On this one I just couldn't.The French Dispatch is a lot of style and hardly any substance.It's all Wes Anderson, but for the first time it feels like an Anderson lacking in creativeness and insight.He's like a magician who has exhausted his repertoire. The time has come to learn new tricks."}, {"rating": "7", "text": "With amazing camera work, great cast and interesting view to tell a story, this movie could be even greater if the length was reduced and better composed."}, {"rating": "5", "text": "Wes Anderson style is getting tired out. He has done a few movies now with his artistic stylistic style with voice-over storytelling. A style that he pretty much decided to use himself after he saw \"Le fabuleux destin d'Amélie Poulain\". But its getting stale and predictable by now and he should change direction and find new actors to work with."}, {"rating": "4", "text": "(Mauro Lanari)Anderson sets his 10th movie in \"Ennui-sur-Blasé\" (\"boredom for exhaustion\", \"on indifference\", \"on apathy\"), viewers are warned from the beginning. His maniacal \"stylosity\" reaches the edge of narrative asphyxia (after all, what else would the Cahiers' \"politique des auteurs\" be? The legacy of the \"Nouvelle Vague\" is this). Emulating Greenaway's \"superfluous storytelling\", his \"amazing inventions degrade into conventions\" (Anna Maria Pasetti), an elitist intellectualism (\"The New Yorker\") intent on the emotional sacrifice of havin' at heart the characters, the humans, anyone. Seasoned with a foolish humor, \"Ennui-sur-Blasé\" to the point of dying: it is from the death of the editor of the literary supplement that the feature film starts and it is from the drafting of his epitaph that it takes leave, the all-star cast parades, literally or not, like a funeral procession in front of the corpse of a journalism for journalism and a cinema for cinema, self-celebratory, self-commemorative, self-testamentary, self-ceremonially mournful. Special thanks to Baumbach, to the fellow citizen Linklater (Houston, Texas), to de Palma, Joel Coen, Spielberg."}, {"rating": "9", "text": "Impeccably well made, supremely enjoyable.This is only the second Wes Anderson film that I've seen (fwiw, first was 'Moonrise Kingdom' which I didn't like all that much hides) and now I can better understand the hype that man gets. 'The French Dispatch' is quality, plain and simple.The ensemble cast are a delight, with many a familiar face spread across each segment and each one of them bringing entertaining performances. Frances McDormand would be my standout performer, closely followed by Benicio del Toro. Though, to be honest, all them are terrific - from Owen Wilson to Adrien Brody to Léa Seydoux to Timothée Chalamet to Jeffrey Wright. Christoph Waltz, Willem Dafoe and Bill Murray star too. Unreal casting, that!Anthology flicks can be hit-and-miss for me personally, though to be fair my predominant previous exposure to them has been via those cheaply made Disney animated sequels from yesteryear so time will tell if that feeling holds. I'm pleased to say here, though, that I thoroughly enjoyed watching one develop. It helps that this release knits the segments together seamlessly, with stunning cinematography, editing et al. Loved the animated part, too."}, {"rating": "8", "text": "The French Dispatch isn't my favourite Wes Anderson film, but it's still a worthy addition to an impeccable filmography. His most impressionistic movie to date, the aesthetic is marvellous."}, {"rating": "5", "text": "I am certain this movie is a bunch of stitched together ideas from Wes Anderson's \"maybe\" pile that he couldn't pad out into full movie scripts. Unfortunately they are not interesting as short films either. The four stories (or maybe six, the stories have stories), are told almost entirely through narrations like a series of outlines. Most of the time the characters are unmoving while the narration drones on, every character talks exactly the same way in a fast-paced monotone. Any visually interesting pieces are ruined by most of the film being shot in black and white, turning it into grey sludge visually as well as audibly. The only thing that stands out are the normal cinematography tricks Anderson does in all his movies."}, {"rating": "9", "text": "An ode to long form magazine writing. And a brilliantly funny one at that.All the standard Wes Anderson traits are present, and are a joy, and when combined with the sharp, dry wit of the script delivered by it's stellar cast, we have one of 2021's best films."}, {"rating": "3", "text": "Pretentious and no aim / all over the place stories , from a director that showed real vision with Grand Budapest Hotel . Chaos can be a lot of fun and even more interesting than structure but needs a bit more than adoration of recent French  history"}, {"rating": "7", "text": "I really like Wes Anderson, Grand Budapest is one of my favourite films, and eagerly await every new release of his distinct works but this fell a bit flat for me. It felt largely mechanical and by the numbers even by his standards, I'll need to rewatch it a few times to be sure but I'd place it somewhere in the bottom two or three in his filmography. I went in as blind as possible so the structure of it essentially being a series of shorts surprised and in the end disappointed me because some portions greatly outshone the others with \"The Concrete Masterpiece\" being a personal standout."}, {"rating": "7", "text": "Funny, quirky and a little bit off kilter, The French Dispatch feels more like a display of Wes Anderson's abilities rather then one solid story. This however does not ruin the viewing experience and instead give the view many different opportunities to attach themselves to the broad cast of characters and wacky scenarios which they find themselves there in. This movie is definite watch if you already have an HBO Max subscription and a few hours to kills but otherwise you should just watch the grand Budapest Hotel."}, {"rating": "7", "text": "The French Dispatch might have the best production design that I've ever seen in a film. Absolutely astonishing and visually stunning. Wes Anderson filled this film with so much creativity and different filmmaking techniques (even animation!!) that makes it always entertaining and interesting to watch. Even so, I found it to be a classic case of \"style over substance\" as I never fully cared about any of the characters or stories being presented."}], "recommendations": ["the_grand_budapest_hotel", "the_sting", "the_great_gatsby", "victor_frankenstein", "nocturnal_animals", "kingdom_of_heaven", "motherless_brooklyn", "amores_perros", "close_encounters_of_the_third_kind", "loving_vincent", "dune", "annette", "the_last_of_the_mohicans", "the_ballad_of_buster_scruggs", "murder_on_the_orient_express", "the_assassination_of_jesse_james_by_the_coward_robert_ford", "chinatown", "gattaca", "youth", "reservoir_dogs", "in_fabric", "amadeus", "the_master", "catch_me_if_you_can", "the_social_network"]}