{
  "id": 4520,
  "title": "The Fountain",
  "starring": [
    "Hugh Jackman",
    "Rachel Weisz"
  ],
  "runtime": 96,
  "genre": [
    "Drama",
    "Adventure",
    "Science Fiction",
    "Romance"
  ],
  "description": "Spanning over one thousand years, and three parallel stories, The Fountain is a story of love, death, spirituality, and the fragility of our existence in this world.",
  "releaseYear": "2006",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tnmkVAYrHITpdKgmZ7CzVBEI4ho.jpg",
  "categories": {
    "plot": 9.5,
    "acting": 9.692307692307692,
    "ending": 9.714285714285714,
    "soundtrack": 9.2,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 10.0,
    "action": 9.666666666666666
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie was absolutely beautiful. I just loved it so much. There's something fantastic about it, but it seems everyone doesn't get it based on some reviews I've read. I found The Fountain to be intense, emotional, touching and extraordinary. Like nothing I've seen before."
    },
    {
      "rating": "10",
      "text": "It's a difficult movie at times, but with focus and understanding something beautiful emerges from the film."
    },
    {
      "rating": "10",
      "text": "If you like simple, plain stories that dont represent a chellenge for your mind then dont look at this movie."
    },
    {
      "rating": "10",
      "text": "This movie touched me. It may not have touched other's but just as any work of art - some may understand and some may not. It's really just a matter of personal preference and style. I can see why some of you folks think it was a bad movie in some ways. For me it was amazing. I will also say it bears being watched multiple times in order to fully grasp the imagery and plot to the best degree. I enjoy movies that you need to and want to watch more than once to understand. I gave it a 10 because it is my new favorite movie and will be for a while until something else comes along...and with so many of the movies in the past years being just the opposite (shallow, uninteresting and overdone) it may be some time."
    },
    {
      "rating": "10",
      "text": "I think the director was trying to send a heartfelt message about love and life, and that those touched by it would enjoy this film, and that's why I give it a 10, it's a matter of opinion, you don't have to be so uptight mr. \"Anonymous H\"."
    },
    {
      "rating": "9",
      "text": "A prime example of a movie that critics just don't get. It calls into question the intelligence of the people writing about it, particularly those who say Aranofsky's 'reach exceeds his grasp.' This is a complicated and assured film, one without easy answers. Everyone said these same types of criticisms about Kubrick films. The critical lambasting here just goes to show how little we expect from our films, how shocked we are when we're challenged by them, and how negatively we react when we can't understand them. Don't listen to the media static - see this movie."
    },
    {
      "rating": "9",
      "text": "How do you explain let alone film someone's conscious experience? This film was excellent in that it attempted to provide visuals for the metaphysical experiences attached to loving, dying, and the character's own internal struggle. He never time traveled, the \"time travel\" sequences were a type of literary or visual tool to show the viewer how the character understood his role toward his wife's condition. Excellent and at times overbearingly touching."
    },
    {
      "rating": "9",
      "text": "I'm truly amazed at how many reviewers COMPLETELY missed the boat on this one. Honest, heartfelt, mesmerizing, heartbreaking and WELL ahead of it's time, THE FOUNTAIN will undoubtedly be looked upon in twenty years time as one of the best films of the early 21st century. Man. Open your minds, people."
    },
    {
      "rating": "10",
      "text": "Darren Aronofsky film captures many facets of human emotion and coming to terms with death and all that may mean to us.all of this is not easy too think about let alone portray but just for sheer thought provoking beautyfull cinematography and music it wins hands down."
    },
    {
      "rating": "10",
      "text": "I loved to watch The Fountain. Finally someone expresing openly in a movie those allways Human-Spiritual issues that we are IN and we will, liking it or not. I enjoyed it cause also is reach in simbolism and it gives the unique interpretation for each detail. And as other comment i read here i think \"It takes a special kind of person to enjoy this very special movie\""
    },
    {
      "rating": "10",
      "text": "Terrific film! It's magical, hypnotic, breathtaking. I was left confused yet intrigued and wanting to find out more and search. It's hard for me to understand why so many critics are panning this movie. I mean, with movies like \"Spiderman 3\" scoring better on Metacritic than \"The Fountain\" I am left scratching my head. Do the critics hold Arnofsky to a different standard? My opinion is that with all of the trash that is heaped into theaters these days, we should appreciate when a movie like this comes along. Some may find it flawed, I don't doubt. But should we not give credit where it's due? Anyway, I thought it was a true work of art and will watch it repeatedly."
    },
    {
      "rating": "9",
      "text": "Sometimes I'm amazed by all the closed down minds on this planet. this film is a love song, a deep tone poem about mortality, heart, soul and science and their relationships to each other. perhaps that's too much for the average viewer to absorb, but this viewer could have watched another 2 or 3 more hours of this. I'll probably end up buying it and screening it over and over and then I'll wish I had given \"the fountain\" a ten. don't miss it."
    },
    {
      "rating": "10",
      "text": "One of the most powerful films I've ever seen. Please don't hate it if you do not understand it. Give it a chance. Try it again. Listen to Ellen Burstyn's speech in the scene in the snow; it as well as Jackman's obvious revelation toward the end of the film are the movie's seminal moments and nicely sum up its themes. This film isn't merely a love story, it's a story about death, love, peace, and facing mortality. It's about living well and dying with a measure of grace."
    },
    {
      "rating": "10",
      "text": "Great movie."
    },
    {
      "rating": "9",
      "text": "The Fountain is a 'love-it-or-hate-it' sort of film. It has only one undeniable quality: it's beautiful. Color and texture come together beautifully; the dark, rainy Mayan jungle, the snow-covered fields of modern America, and the Orion Nebula's golden nuclear rain are breathtaking to behold, especially in HD. Unfortunately the film tries to answer questions that some people go to church for, so those with strongly-held beliefs about the nature of life, death, and God might end the film feeling confused, threatened, even offended. Those of us who, like Aranofsky, are looking to reconcile the illusory conflicts between science and spirituality will likely find it an intensely rewarding experience."
    },
    {
      "rating": "9",
      "text": "Wow! Incredible film, really. The more I attempt to analyze it, the more I am reminded that this is a love fantasy. It is like a 10th century French poem depicting chivalry and mortality. Beautiful."
    },
    {
      "rating": "10",
      "text": "Deepest movie I've ever seen, very philosophical."
    },
    {
      "rating": "10",
      "text": "Death is the road to awe. Beautiful. An exceptional piece of emotive movie making. The visual effects take you to a different plane and it's breathtaking. Hugh Jackman outshines everyone in his role and truly reaches outt o his emotional and soft side. An amazing picture of love and the lasting hold it has on us."
    },
    {
      "rating": "10",
      "text": "I was lucky enough today to be able to catch The Fountain at the film festival downtown. To start off, I have always been a huge Aronofsky fan, I introduced my friends to Pi and Requiem, and they are two of my favourite movies. From The Fountain's inception in the early 2000's, I have followed all of its foibles and developmental issues. The script was originally approved with Pitt and Blanchett to star in the leading roles. Pitt left to film Troy and the project was thrown on the back burner. In 2004 the film re-emerged with a budget half of the original and was cast with Jackman and Weisz. As is expected when one follows things for such a long time, excitement builds and there is always the wish for what you are about to experience to be spectacular. This is one of those instances where one is awestruck and that excitement has not been crushed by the feeling of disappointment. Without a doubt, The Fountain by Darren Aronofsky is one of the best films I have seen this year, if not one of the best films of the decade. Future viewings and time will tell if the latter holds true. I'm not even sure where to begin, essentially the plot is set in three different time periods, with Jackman playing a conquistador, a modern scientist/doctor, and a intergalactic voyager all while trying to find a way for Weisz to live as she is terminally ill. The visuals in The Fountain are dazzling. The cinematography is some of the best I have ever seen in my life. The shots are all perfect and the lighting immaculate. Aronofsky seems to have gone with mostly centered shots, which may sound dull at first glance, however, they most definitely are not. It is not as gimmicky or manipulative as Requiem or even Pi were, but the visuals could take your breath away. They are that stunning. To make things even more impressive, they chose not to use CGI for much of the film and instead filmed chemical reactions and formations on petri dishes and were able to extrapolate that into fantastical imagery. As far as the acting goes, this is without a doubt the best work of Hugh Jackman and while Rachel Weisz is also very good, it is mainly Jackman that carries the movie as he is the lead role. I actually enjoyed the rest of the supporting cast even in their small roles. Specifically, Ellen Burstyn, Mark Margolis, and Cliff Curtis. The musical score is just another thing on its own. Clint Mansell, having collaborated in the past for both Pi and Requiem for a Dream creates a most ethereal musical score. The Kronos Quartet, who had the theme song for the movie Requiem for a Dream, entitled Lux Aeterna, and Scottish post rockers Mogwai fill out most of this blissful soundtrack. The music meshes wonderfully with the movie even though there are, three different periods so to speak. Furthermore, the explosions in music, re: Mogwai and the whole post-rock genre completely gels and interlaces with the revelations experienced and ideas expressed within the film. I won't reveal too much as to what unfolds in the movie, however, it is a beautiful story of love, and what one discovers about himself and the world in this quest of undying love. There are so many facets, so many nooks and cranies that this film dares to explore all at once in such majestic fashion it is truely unbelievable. It connects emotionally with the viewer, my heart started palpitating at various points and near the very end my eyes watered up for a good five minutes. Aronofsky explores my ideas and themes in this movie, though the main ones I think are acceptance and duality. The movie is incessantly deep and heavy and therefore requires repeated viewings for sure. Those of you who have seen Pi, this is in many ways a sister movie to that. Just as Pi attempts to understand natural surroundings and life through mathematics, The Fountain follows suit but on the path of spirituality and philosophy. In closing, I still require many hours to ponder the ideas in this movie, in fact I have been watching the trailer nonstop since I got home. Aronofsky possesses immense testicular fortitude to be able to make a film like this for wide release. He has my utmost respect for attempting such an ambitious film that has come across to me at least as highly successful."
    },
    {
      "rating": "10",
      "text": "Just perfect. But make no mistake, the film is just relentless. Relentlessy cheesy, deep, melodramatic, over-the-top, unflinching, unashamed. There were two specific moments in particular, where all the people sitting directly around me in the theatre started laughing. One of those moments, was the climax. Had there not been \"intellectuals\", artists, art-house filmgoers, mainstream filmgoers or immature emotionally undeveloped people in the audience, I would have enjoyed it even more without people around me laughing at the brilliance onscreen. That being said, it definitely felt like Aronofsky deliberately went out of the way to make a film that very specifically panders to not a single demographic or crowd. It completely depends on the person. But generally, I think most artists intellectuals and art-house cinemaphiles (and especially critics) will absolutely loathe this movie, because it is relentlessly emotional, and completely unashamed. But the themes and concepts, the imagery, it is so cyclical, and all fits perfectly together. I can easily wait 6 more years for Aronofsky's next film, because then I know it'll be at least half as good as this incredibly moving piece of work."
    },
    {
      "rating": "10",
      "text": "Incredible. Both Hugh Jackman and Darren Aronofsky deserve Oscars, to say the least."
    },
    {
      "rating": "10",
      "text": "This is one of the best films I've seen in a LONG time."
    },
    {
      "rating": "10",
      "text": "This film doesn't place the answers right in front of you, but it is a mystery easily solved by audience that cares about the characters. This isn't hard to do, as it has great acting, wonderful visuals, and excellent pacing."
    },
    {
      "rating": "7",
      "text": "You have to give this film high marks for aspiration, even if it fails to be truly engaging. At least Aronofsky isn't parlaying his success into making competent sequels of comic book movies, and is trying to move us forward. Beautiful, elemental, just maybe too many closeups of earnestness rather than people nakedly engaged in the struggle. Next time, Darren. I'll be there."
    },
    {
      "rating": "9",
      "text": "I thought that this movie speaks to Aronofsky's daring filming techniques. I think that he really sets the bar for other directors to live up to."
    },
    {
      "rating": "10",
      "text": "Alas, the majority of critics are too Hollywood oriented to know genius when it stares them in the face. Mindblowing and beautiful, this movie will make you think too."
    },
    {
      "rating": "8",
      "text": "This movie is gloriously pretentious and unapologetically incomprehensible, being mired in philosophy and religion. Most of the movie goers left scratching their head or laughing. For me though this movie was a lot more than that. It is flawed for sure. But the essence of the message is something that resounds deeply within me. Gorgeous art direction and underpinned by a sumptuos score by Clint Mansell, this film is a must for film fanatics. It feels much like the personal movies of the 60's. It explores themes of love, death and immortality whilst touching on old testament stories such as the Tree of Life from the garden of eden (the other tree was the tree of knowledge that Adam and Eve ate from). If The Fountain doesn't leave you chattering about the meaning of life you probably shouldn't have gone to see this movie in the first place. It is cerebral. It is challenging. But ultimately very rewarding. Did I mention it was beautiful to look at. Check out my full Aronofsky review over at tweenbetween.blogspot.com"
    },
    {
      "rating": "8",
      "text": "Criticism was also hard on Kubrick's \"2001\" in its day. I wonder whether there is some connection to this, another wildly philosphical piece of film art, and its criticism - similar to \"2001\"'s - and again, not supprisingly enough, by old farts."
    },
    {
      "rating": "10",
      "text": "It never ceases to amaze me how hypocritical movie going audiences can be. For years we hear people complaining about how movies are too formulaic, predictable and narrative like. But when a movie, that truly reaches beyond the conventions of the typical Hollywood blockbuster finally comes forward, it is shunned, as people flee back to their tried and true formulas and trilogies. This it seems is the story of the Fountain. The film is truly a work of art, combining some of the most beautiful cinematography and music yet seen in a movie theater with an idea that is so simple, so common place, but at the same time so utterly life changing. Like the theater of Brecht, the Fountain is not so much about the narrative, but how what we are seeing communicates to us. It is for this reason that i feel the movie has had such a bad showing. The ideas its presents are so raw, so completely human, that it is hard to see them presented to us in this fashion. The ideas, for for average movie going joe, are to big and at the same time, close to heart to contemplate in a movie theater. For this reason, the Fountain should ONLY be seen by those who are able to watch a film without everything being spelled out for them, and by those intelligent enough to analyse the films message and how it is conveyed. Is truly one of the most original, innovative and moving films for a long time. 10/10"
    },
    {
      "rating": "10",
      "text": "Every time I watch an Aranofsky movie, it is a life-changing experience. There's something about his style of writing and filming that is extremely memorable. Even with it's focus on death, I left this movie extremely uplifted. I can't get it's visuals out of my mind & can't wait to watch it again. Not many movies these days challenge thought and ideas. I can't believe the critics pounded this one. A memorable, beautiful movie, but I guess it's not for everyone."
    },
    {
      "rating": "8",
      "text": "Movies this deep don't deserve to be seen by people who don't wish to better understand it and what it stands for. This movie is really something to wrap your head around and it even leaves enough room for imagination left for the viewer. The visuals in the Fountain are an absolutely stunning work of art. Now I could easily call this movie pretentious yet at the same time without that pretense, there wouldn't be much to see here. My only complaints of the Fountain were the excessive amounts of scene changes which I felt were not properly executed, and the poor script that neither worked for the characters or for the audience. Those mistakes alone take this down a notch from being truly exceptional but a movie of this magnitude deserves to be seen provided you are willing to go into it with an open mind."
    },
    {
      "rating": "6",
      "text": "Director added too many things that takes you out of the main theme of the movie."
    },
    {
      "rating": "10",
      "text": "Awesome, what movie making should always be about. A breath of fresh air from the generalized Hollywood empty headed easy to follow simpleton movies. If you think Die Hard or Rambo are good films then don't bother with this. If you are a free thinker and crave artistic expression at its finest then this a film for you. I get the impression the bad reviews are from people who A: don't understand it or B: are not the type to think beyond the mundane."
    },
    {
      "rating": "6",
      "text": "I give it a 6 for making me feel like I had some barbiturates. The concept is amazing but unfortunately it was not captured in the film. It would have been a better film if they stuck and focused on one lifetime. I bet Hugh Jackman himself didn't know what his own film was about. It was crazy, a big mess and a definite waste of time. I could definitely live without watching this film in my lifetime."
    },
    {
      "rating": "10",
      "text": "This movie involves some of my most favorite themes and interests - the tree of life, the Mayans, scientists, new medicines discovered from plants in the rainforest, books, the acceptance of death, the fight against death, hope, peace, and space travel. One of the primary dynamics in the movie is the contrast between the man who is spending all his time and energy trying to find a way to keep the woman alive. One wonders if perhaps his time was better spent by spending time with her, listening to her, loving her, and just being with her in her final days. To me that is the crux of the movie, and I felt it deeply - her acceptance of death, and his fight against it (and essentially against her in a way). I have not stopped thinking about this movie since I watched it, and I absolutely love it. For me, and I understand for many others, it is the epitome of beauty and depth. And yes, in the end some things didn't add up, and the \"lotus position\" was hokey for sure - meditation does not involve any physical posture, it is an inner state of being (but how to show that visually? Then again, the first time I watched the movie, I thought the space bubble was in fact the man's inner state of being, portrayed visually, and was a not a \"real\" place but a representation of what was in his head...who knows...). But the heart was there and the intentions were good, even if the portrayal of the themes was not perfect - but who has done this and these themes before any better? I must say also though that my own life experiences and background and interests had a profound effect on the way I received this movie. So many of the visuals, the themes, and the ideas are so embedded in me that if the movie were based on some other visuals and themes, I might not have really liked it at all. (Botany, Medicine, Anthropology, Space Travel, Meditation, and the death of a Beloved)."
    },
    {
      "rating": "7",
      "text": "Darren Aronofsky, through his long and tedious struggle to bring his most cherished script to the screen, had accumulated some serious hype around what would eventually become 'The Fountain.' Just under seven years from its conception in the mind of the film"
    },
    {
      "rating": "7",
      "text": "I have got to say, that the music is the reason why I really like this movie. Yeah, the film itself is different and pretty (and I respect the director and writer of The Fountain, cause it's so easy to follow - a film like this can easily lose focus), but especially the music supports the scenes in a perfect way. Clint Mansell might be the one of the best filmsoundtrack-makers of the decade. But I'm not saying the movie would be bad without the great soundtrack, cause it's a really touching movie, which deserves better grade by critics."
    },
    {
      "rating": "10",
      "text": "It´s pure poetry and beauty. Probably you won´t understand ALL the movie, but you will feel it."
    },
    {
      "rating": "9",
      "text": "I look forward to one day seeing the complete, uncut film."
    },
    {
      "rating": "10",
      "text": "You have to be a very open minded person to truly enjoy this film. This movie truly demonstrates that you don't have to introduce a character to know who he is. I don't know how many movies I've seen that starts out like,\"hi, my name is...\" the plot is very simple to tell the truth, its about a man in a struggle to come to terms with death, not just his wife but himself as well. This movie is indeed very hard to put into words. I can understand that a person may not like this film, no movie is loved by everyone. But I don't think that gives them the right to make biased opinions to a very under appreciated work of art, that they don't even understand in the first place. They could have simply said in the review,\"I didn't understand the movie and cant make a comment.\""
    },
    {
      "rating": "9",
      "text": "A sensory masterpiece intertwined with deeply emotional storylines (esp. if u ever spent time with a loved one with cancer) with an overall sci-fi fantasy blanket. Wayyyyy too ambitious but if you're in the right mood - it will take you somewhere special."
    },
    {
      "rating": "10",
      "text": "The Fountain is a spiritual film that eschews most trappings of what people expect of a movie these days. If you're looking for easy-to-chew-n-digest fluff, you won't find it here. If you have an open mind, you should be prepared for a beautiful and moving work of art that features two actors at the top of their form. The central theme is transcendence, and although the film plays with three time periods, representing superstition, science, and spirituality as a symbol of mankind's progression (in a hopeful, Nitzschean sense), it is not bound to that kind of structure. Ultimately, it transcends space and time to remind us of why we are who we are: because of our undying souls. The symbolism may be Buddhist in nature, but the films' essence is as timeless and non-religious as one can hope for. To all you critics: I sympathize. You have a lot of work to do, and to encounter a film that leaves you scratching your heads must be frustrating as hell. But don't pan something just because you don't understand it."
    },
    {
      "rating": "10",
      "text": "You truly have to be open minded to comprehend this movie. I have watched this masterpiece about 4 to 5 times and every time I watched it I would discover new ideas, metaphors, symbolisms, realizing more and more clearly what message the director is trying to convey. This aspect alone points to the artistry of the movie. Music of Beethoven, Mozart, Bach, Chopin works precisely the same way. This masterpieces of music grow on us over the years and every time we comeback to them with new experiences we discover something new in them. Thats what makes piece of art work timeless. On the top of this Aranovsky is a visual artist his movie is a visual Odyssey that adds to the viewers imaginative delight and conveyance of the essence of the movie. One examples: the ring that gets lost, when his wife collapses and he walks in circle waiting, to the glass sphere he is traveling in, to the tattooed lines on his body that circle around like the trees rings, to finally the the being that enters the (cicrcle) the sphere of light to finish the journey. This are all symbolic representations of reincarnation and repetitive events of our lives that just manifest themselves in different transmutations. In addition this movie is a rare gem because of the topic the director chose. Most of movies now a day focus on violence and the dark side of the human nature and even the so called good characters have very little good in them. Here Aranovsky portrays many faucets of human nature but the strongest highlight is the human spirit the soul of the human being. Its about our highest possible expression, transcending our physical illusion that are so real to us and entering our final stage of enlightenment that sheds the mortal suffering because of the realization of the highest truth about our true nature. In my book Aranovsky is one of the best and most brilliant movie directors alive. I have seen all his movies and when I went to see the fountain it was because of his earlier movies that I saw. With every movie he created his artistic expression is truly transcending to new heights. Mr. Aranovsky please keep creating and delighting your audience. Cheers."
    },
    {
      "rating": "9",
      "text": "Completely polarizing - and I certainly know why. But, beautiful, intelligent and nothing but ambitious from start to finish. Remember folks, this is \"science fiction\"...it's not a documentary, it's \"science fiction\". Clint Mansell's soundtrack is one of the most amazing pieces of music ever composed."
    },
    {
      "rating": "10",
      "text": "Beautiful, so many things go through my mind when trying to understand it, that it teaches me along the way. I'd love to see more movies like this one, rather than the brainwashing bullshit we see everywhere else."
    },
    {
      "rating": "10",
      "text": "It isn't the destination, its the journey that is important. Similar to \"Being Human\" with Robin Williams; good way to broach difficult issues of life and death."
    },
    {
      "rating": "10",
      "text": "Hands down, the most astonishing science fiction film of the past decade. Awesome on every level, and a sleeper destined to become a future classic. In 20 years from now, it will appear in lists of the greatest science fiction films ever made, if not in lists of the greatest films. Just as Bladerunner and 2001: A Space Odyssey do these days, despite both being widely ridiculed when they were first released... Also features possibly the most beautiful soundtrack score ever, by Clint Mansell. Even those who didn't understand or like the film, pretty much acknowledge that the music is a rare masterpiece."
    },
    {
      "rating": "10",
      "text": "I know i felt differently than much of the audience but I was transfixed. The movie just washed emotion over me, and even though its narrative flaws and cheese factor were obvious... it still worked amazingly. A powerful experience I will not soon forget."
    },
    {
      "rating": "10",
      "text": "The BEST movie of 2006!!!"
    },
    {
      "rating": "10",
      "text": "This is a truly strange film. Love it or hate it, it WILL consume you. In my eyes, a true masterpiece."
    }
  ]
}