{
  "id": 4531,
  "title": "The Favourite",
  "starring": [
    "Olivia Colman",
    "Emma Stone"
  ],
  "runtime": 119,
  "genre": [
    "Drama",
    "Comedy",
    "Thriller"
  ],
  "description": "England, early 18th century. The close relationship between Queen Anne and Sarah Churchill is threatened by the arrival of Sarah's cousin, Abigail Hill, resulting in a bitter rivalry between the two cousins to be the Queen's favourite.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cwBq0onfmeilU5xgqNNjJAMPfpw.jpg",
  "categories": {
    "plot": 4.463414634146342,
    "acting": 4.651162790697675,
    "ending": 7.615384615384615,
    "soundtrack": 3.8181818181818183,
    "cinematography": 4.555555555555555,
    "familyFriendly": 3.0,
    "funny": 5.090909090909091,
    "action": 5.833333333333333
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Easily one of the best films of 2018. The three leads are incredibly good, with Rachel Weisz leading the way.  I've always loved Olivia Colman, and she's fantastic as the insecure, gluttonous Queen Anne. Emma Stone is really good, but the movie takes a bit of a turn (along with her performance) about 2/3 of the way through.  I have to mention the director and the DP - the film is shot absolutely beautifully, and the score is innovative / perfectly pitched. A word of caution: if you're easily offended, you might want to steer clear. It's not a movie of its time. But it is uproariously funny at times - great writing."
    },
    {
      "rating": "10",
      "text": "A true masterpiece just like Dogtooth and The Lobster. Yorgos Lanthimos is one of the best directors of this era."
    },
    {
      "rating": "5",
      "text": "While there are a lot of things to like about this movie (the performances, the costumes, the sets), the story line is not one of them. Neither is the background music which at times I found quite annoying. Altogether the film tries to be too clever by half and in the end falls flat on its face and just becomes tedious. I ended up wishing I had made a different choice for my film fare."
    },
    {
      "rating": "2",
      "text": "Some viewers will enjoy the dark comedy aspect of this movie. It didn't hit my funny bone, and if it doesn't hit yours, you will probably hate the experience. My one-word description of this movie is unpleasant. The characters are mean, the music is grating, the dialogue is crude, the sexual content is intentionally distasteful, and the story isn't interesting enough."
    },
    {
      "rating": "2",
      "text": "One of the worst movies I have ever seen. Little to do with actual history, really bad plot line, and some ridiculous and infantile scenes that taxed my patience less than 15 minutes into the film."
    },
    {
      "rating": "0",
      "text": "This is by far one of the worst movies I have ever seen!! I wanted to throw up during the lesbian scenes..it was the biggest waste of time and I will never get those 2 hours back!! How people gave it 7's and 8', 9's and 10's is BEYOND ME!"
    },
    {
      "rating": "2",
      "text": "Well, that was... irritating.  It’s well acted, interestingly shot, but ultimately failed to engage my interest in the characters or the plot.  I don’t think the film knows what it wants to be: it’s not that funny, it’s not about character development, and there’s no real story beyond a rivalry between the two main characters to become the favourite of the queen.  There’s very little evidence to support the story, so it doesn’t really qualify as historical fiction.The music soundtrack is ugly and distracting (is this a comment on the queen?  Who knows?  Who cares?)Ultimately I was relieved it was over.  Overrated, over complicated, But thankfully, over."
    },
    {
      "rating": "1",
      "text": "Oscar Bait. Nothing more. Interesting premise but never goes anywhere. Watched it twice in case I missed the point. I didn't miss the point."
    },
    {
      "rating": "1",
      "text": "If you like \"arty\" movies and want to believe the BS that goes on with the awards season - this is the movie for you. This was frustrating, irritating and tedious all rolled into one. Not a movie that you'll ever want to see again. It was, however, great for reminding us why the monarchy should be abolished. Avoid wasting two hour of your life."
    },
    {
      "rating": "1",
      "text": "In comparison to Helen Edmundsen's wonderful play Queen Anne upon which The Favourite is inspired, the screenplay is just cynical, self-indulgent, and really tiresome after a point. There's a place where cynicism becomes so black it is no longer enjoyable to watch.  If everyone is awful then who cares in the end.  Just turn it off and make it stop.  Good performances.  Beautiful sets and costumes.  A terrible and ultimately boring story."
    },
    {
      "rating": "0",
      "text": "This is most definitely one of the worst movies I have ever seen. This movie is a perfect display of toxic femininity, bad writing, and terrible story telling. This movie doesn't get anything right and makes absolutely no sense. The Favourite is an absolute embarrassment to modern cinematography. I also don't doubt for a second that most reviews on here are fake."
    },
    {
      "rating": "2",
      "text": "I am done with Mr. Yorgos Lanthimos and should've been done with him after The Lobster, and should've taken the hint about the artistic control over this MESS.  Like another user reviewer, I'm giving the film 1 point for its, yes, gorgeous cinematography, wide screen panorama, production/costumes---and 1 point only for the fine acting---but the film should get zero or negative points for never having a coherent theme, never making us care about any the despicable characters, being one of the worst LGBTQ films probably of all time including being a downer for that whole community, etc.  AND---when a film has a high proportion of neg reviews, plus those reviews like mine are not trite at all and are being thoughtfully written up, unlike \"trolls\" just slamming stuff---I have studied film in college---people had better take note of pro reviewers hyping an art film that doesn't deserve it and being bought off yet again!"
    },
    {
      "rating": "0",
      "text": "Film critics have made Yorgos Lanthimos out to be some sort of unique directorial talent and his \"works\" - \"The Lobster\",\"The Killing of a Sacred Deer\" and now \"The Favourite\"- have made him the darling of the festival crowd and the movie critics. One can but applaud him for being able to entice finance from the supposed \"hard-nosed\" money men of Tinseltown and make films that are only comprehensible to a very select few. How to approach his latest, \"The Favourite\"? Some compare it to Kubrick's \"Barry Lyndon\", when in reality there are more than a few nods to the outlandish Ken Russell. Is it a drama? Is it a comedy? Is it a comedy drama or a drama comedy? Who can tell? Hopefully the locations and the costume providers have got Yorgos on their Christmas card list. As for the actresses whose talents have been largely wasted,let's hope their careers can survive their participation here. There were moments when all three were on screen at the same time and the power struggles all three endured would have made a more memorable film. Unfortunately the music of the film's composer would then raise its ugly head or the \"fish -eye\" lens of the cameraman would interfere and kill any drama stone-dead.Hopefully \"word-of-mouth\" will kill this film off and at some point there will be a reality check amongst the critics who will finally realise that Yorgos has subjected them to an \"Emperor's New Clothes\" scenario yet again and they have been had not once, not twice but three times now."
    },
    {
      "rating": "0",
      "text": "This movie was about nothing. Absolutely ridiculous and terrible. Worst movie I've seen in a long time."
    },
    {
      "rating": "0",
      "text": "This was a horrid, depressing depiction of human depravity at it's worst.  Why would you spend money to see that?"
    },
    {
      "rating": "1",
      "text": "Im not sure if getting my wisdom tooth pulled or watching this movie was more painful. All five of us that saw this together found this movie to be a waste of precious time. Sorry but i just don't get all those rave reviews.  As an avid movie going i found that this directing fell flat along with script and character development. Painfully boring and uninteresting even with these three great actresses. Don't waste your time or money. BIG DISAPPOINTMENT."
    },
    {
      "rating": "3",
      "text": "The humor is lost on me.  The dark and nastiness stands out.  Acting good - costumes good - sets and locations good.  I'd still say miss this one!  Spend your movie dollars on something else."
    },
    {
      "rating": "2",
      "text": "In the past week or two \"The Favourite\" has been mentioned for many awards. It has been called 'wickedly entertaining', 'hilarious', 'black comedy at its best', 'delectable wit', 'a riff on \"All About Eve\" and a metacritic.com 91% rating of critics and a 8.5 out of 10 rating while the critic's rating on Rotten Tomatoes is 94% and 66% audience rating.Even though I had not liked director Yorgos Lanthimos's \"The Lobster\" between word of mouth regarding the performances of the 3 lead actresses and the talk of awards I was looking forward to 2 hours of fun, laughter and sarcastic wit. After an hour I was ready to walk out but I stayed and kept hoping something would happen for me to change my mind about this film.Neither a duck race, a naked, fat man being pelted with pomegranates by other men in long curly wigs or a wife thinking/planning a way of getting rid of a rival's power over the queen while she masturbates her husband changed my mind.Yes the acting by Olivia Colman, Emma Stone and Rachel Weisz is first rate, especially by Coleman, and the power struggles between Lady Sarah (Weisz) and her cousin Abigail (Stone) including seducing the Queen (Coleman), mentally and physically, plus playing the men, in many ways, is typical of the genre while the war games between the heads of State of the French and English is really ho-hum.\"The Favorurite\" took 2 hours of my life and didn't give me 1 laugh but it did give long, dark walks along castle hallways and backways with panoramic scenes of ballrooms, bedrooms and meeting rooms. It also gave me a very annoying soundtrack of what seemed, in 50% of the film, was a beat and what sounded like a bell.In no way can I recommend this film!"
    },
    {
      "rating": "6",
      "text": "This movie profits from great actors and great performances. However, at the ZFF this movie was initially portrayed as a dark comedy but it wasn't my cup of tea and neither did the story draw me in. I was left a bit unsatisfied to be honest."
    },
    {
      "rating": "3",
      "text": "I am definitely going to remember this director's name after seeing this movie and The Killing of a Sacred Deer. The best part of this movie was when it finally ended. The cinematography is dark and dreary like the movie. The characters are extremely well acted and very disturbing."
    },
    {
      "rating": "0",
      "text": "I cannot stress this enough. This is one of the worst movies I have seen in my entire life. I studied Film in college so I am no stranger to the weird or the avant garde. This however is just pure vapid horror. I am absolutely shocked this film has met with universal acclaim as its completely un-funny, meaningless and just can I say - gross? Its a shame as the lead actresses are all very talented but Yorgos Lanthimos' direction is pure pretension. Its a shame so many people have failed to see straight through it. Save yourself the cost of a cinema ticket and don't go see the truly awful movie."
    },
    {
      "rating": "2",
      "text": "Terrible movie-not a comedy or a tragedy; poor camera work; the 2 actresses were ok-good talent in terrible roles. Poor editing. Often very dull film."
    },
    {
      "rating": "1",
      "text": "The actresses are good and the spectacle is sometimes interesting to watch, but the storytelling is incoherent, the cinematography annoying, the attempts at humor jarring, a painful soundtrack, and the characters unsympathetic. Overall it's a period-costume dumpster fire. I see a lot of critics are loving it, which sometimes happens when confusing films are mistaken for \"deep\". This is a horrible film."
    },
    {
      "rating": "5",
      "text": "Great staging, really good performances, outstanding direction, demolishing music. Overall a beautiful production and yet incredibly hollow.The narrative is insipid and somewhat uninspired. The humor is weak. Something incredible coming from Lanthimos because even in the darkness of The Killing of a Sacred Deer you could notice all the nuances. Here it's not very functional and to some degree disappointing.It's a parody and a farce that fails at important moments and despite my high expectations and how much I expected this film and how much I expected to love it, the truth is that I ended up bitterly disenchanted, disappointed and dissatisfied."
    },
    {
      "rating": "5",
      "text": "Gorgeous photography, set design, and interesting sound can't lift this from the expected perils of a stuffy period piece.  Nor can raunchy content and contemporary dirty dialogue regardless of themes paralleling today's politics and feminist fads, no matter how good the acting."
    },
    {
      "rating": "3",
      "text": "\"The Favourite\" is a period piece that features beautiful sets and costumes and a soundtrack of primarily Baroque music.  Critics seem to bill it as a comedy; but, unless you consider ill health, psychological disturbances, treachery, and sexual perversion terribly amusing, you probably will fail to crack a smile during this entire sordid travesty of film making.  I certainly did not hear anyone in the theater laughing.  The audience consensus after the bizarre ending of the movie seemed to be \"What on earth was that?\""
    },
    {
      "rating": "5",
      "text": "Lost in a limbo somewhere between Masterpiece Theater and Monty Python, this artsy-fartsy cutesy-pootsy \"period drama\" is neither convincingly \"period\", nor very dramatic, nor does the occasional half-hearted comic scene redeem it.  A lot of work obviously went into this, and we have to respect the efforts of all involved but... it all turns out to be an odd and rather dreary affair that's more depressing than entertaining.While there are many lingering close-ups of Emma Stone to show that her agent has negotiated a generous portion of exclusive screen time for her, the cinematography in general is notably annoying and distracting.  In particular the \"fisheye\" wide angle shots with peripheral curving and distortion of the images, help to destroy any immersive experience here, and distance us from the story.  A story which is often a bit hard to follow, and hard to swallow.  That most of the cast don't make any attempt at English accents, and talk essentially L.A. street talk, additionally sabotages the historical ambience we expect.  Maybe this was supposed to be campy, like it was in \"Marie Antoinette\", but it doesn't come across that way here.Finally, the irritating score compounds the strange off-key quality of the film.  While some period music is used, it's performed and mixed in a way that sounds inauthentic.  Then we have long, long periods where the score is some kind of inexplicable, monotonous, modernistic knocking, tocking noise that again distracts us from the action at hand and reminds us that this is an artsy-fartsy director getting in his artsy farts instead of entertaining us.On the positive side, the bunnies are cute; ducks are always a plus in any film; and when the horsies prance along with their feathered crests on, that's pretty darn cool."
    },
    {
      "rating": "3",
      "text": "This movie was destroyed by an inappropriate score/sound design. The performances, script, costumes and art direction are all first rate. The cinematography was not a style that I appreciate, but it was competent. So was the editing. The sound mix was bad, in that the underscore was always hotter than the dialogue,and the choreography is so modern, it rips your attention right out of the period setting. But the worst offence is the underscore. It doesnt match the action and pacing at all. If they were shooting for weird and distracting, they succeeded admirably. If on the other hand they wanted all the separate parts to come together to support and add to the story then this movie is a miserable failure! In spite of that fact, some of its individual elements(acting, script, costumes) are Oscar worthy. All in all, a HUGE disappointment."
    },
    {
      "rating": "4",
      "text": "Sometimes you have to wonder what the critics are looking for in an Oscar-worthy movie, and how they manage to find it in a film like The Favourite. This what-if-Queen-Anne’s-court-was-lesbian premise is historically off the wall, given that two of the protagonists, Sarah Churchill (Rachel Weisz) and Queen Anne (Olivia Colman) were historically documented to be extremely devoted to their husbands. The historical basis for the lesbian theme apparently harks back to some vindictive rumors that were circulated during Queen Anne’s reign (1702–1707 as Queen of England, Scotland, and Ireland, and then until 1714 as Queen of Great Britain and Ireland) by malicious and jealous courtiers. At Versailles such a scenario might have been plausible, but the stodgy, uptight English court of the eighteenth century? The French Catholic aristocracy felt they needed a priest only twice in their lives—when they married and when they died—but the English took the Anglican Church and the wages of sin very seriously. Since Henry VIII, the ruling monarch has been the head of the Church of England, and this kind of liberated behavior would have been severely repressed during this era.So the film has to be accepted as a fantasy, and a wild, absurdist one at that. Billed as a comedy-drama, it’s not that humorous. I didn’t laugh once. The actors are consummate professionals, and the costumes and period sets are perfect; nevertheless, the film is wearisome. Dark hallways looming up at the camera and a preoccupation with a wide-angle lens distortion known as pincushioning (usually considered a photographic flaw but used in this film as a feature) are recurring stylistic devices. Colman’s acting in the role of Queen Anne is of the highest caliber, but she always has to act sick, moody, and on the verge of hysterics, so her character is also wearisome. Her Queen Anne seems to be quite stupid and unable to comprehend politics, economics, military strategy or anything that does not cater to her sexual needs and her personal vanity. Rachel Weisz and Emma Stone are rivals for the Queen’s affections, and their characters display the worst kind of female wiles and weaknesses, stopping just short of hair-pulling and scratching each other’s eyes out. Scenes are introduced with text graphics that are random quotations, sometimes skewing the letters with arbitrary spacing. The film is artistically conceited. In the end, it does not produce the desired effect, which presumably is to depict the absurdist and existentialist view that there is no intrinsic meaning in life. The musical score is as pretentious as the rest of it, vacillating between Baroque violins and a bizarre chiming sound that is supposed to set a mood but is instead unnerving and bewildering."
    },
    {
      "rating": "4",
      "text": "Great costumes and acting, but basically a fairly gross movie about social scheming if about anything at all, made only for the purpose of painting an unflattering picture of nobility with the excuse that it's obviously non-historical. I'd rather just not have seen this skillfully crafted travesty. A disturbing movie that I will make sure to never see again. I'm not seeing the sattire, just lots of poor taste. Even with all the \"cleverness\", it's not a bore-fest and that's something at least."
    },
    {
      "rating": "10",
      "text": "I was very much c*ntstruck by this movie. Even having watched it a second time last night I did not get the tragedian bitter end feeling that was invoked upon the first time watching. No, this time it was much more akin to satisfaction as this time I was very much more certain as to who was the decent being in this duo of favourites. Because that perhaps is the best part of this film, the constant confusion as to whom is the worse of the two? And who is the favourite not in the actuality of being the favourite but more in the deservedness of it."
    },
    {
      "rating": "3",
      "text": "One of the worst movies l have ever seen! What was the point of this film? Completely non-sense! And the ending was so wtf. I didn't understand what happened in the end. All three main characters were so freaking annoying.. the movie is not realistic at all... oh, and enough with the homosexual sex in movies, it's getting annoying."
    },
    {
      "rating": "7",
      "text": "The dark dramedy does a great job at revealing a relatively unknown time in British History. All three actresses do a great job in both making you relate to them and revile them. The script and direction are all decent. The costume design is one of the best parts of the film. However, the ending really gives this good film and adequate sendoff."
    },
    {
      "rating": "5",
      "text": "This film is the very definition of Oscar bait. Brilliant camera work, solid acting, and beautiful production design and costumes make this film a beauty to behold with no true soul. the constant battle that occurs within the story about what kind of movie and what kind of story it wants to tell makes the film seem very disjointed. Add to this the fact that you can pick out any scene that is essentially made for critics and Oscar voters and you got yourself an extremely overrated beautiful catastrophe. C-"
    },
    {
      "rating": "9",
      "text": "One of my favourite movies of last year. Brilliant acting performances of Olivia Colman, Rachel Weisz and Emma Stone who take early 18th century dialogue and absolutely kill it with their deliveries. I don't think I've ever seen a movie set in this time frame that hasn't felt as fresh as this one. I didn't agree with some soundtrack and camera lens choices, but some really added to the perspective and scale of the palace."
    },
    {
      "rating": "10",
      "text": "One of the best films of the year, The Favourite is well-written, perfectly acted, occasionally distracting (re: fish eye lens shots), and overall an original blend of period piece and psychodrama. And far better than The Lobster."
    },
    {
      "rating": "10",
      "text": "Although far more accessible than The Lobster and The Killing of the Sacred Deer, The Favorite is an equally wonderful film by Yorgos Lanthimos. The one thing the three films have in common is that Lanthimos again elicits wonderful performances from his actors, in this case his three leading ladies (and the rest of his cast also). My vote for the best of the leads is Rachel Weisz, but she also probably had the most difficult role. Olivia Colman was wonderful as the emotionally needy Queen Anne, as was Emma Stone, her rival to be the queen’s “favorite.” I happened to go to the film with an eighteenth-century British historian, and I was assured Lanthimos also got his history and 18th century culture right! This is definitely one of the best and most enjoyable films I have seen this year."
    },
    {
      "rating": "10",
      "text": "I thought that this was a wonderful, witty film. The film's accurate depiction of power-hungry people and their tactics was difficult to swallow despite the humor, but it ended up proving to be a wealth of information for me in regards to the nature human treachery. It was beautiful to see how the film's ending ensued--with Emma Stone's character stuck in the degrading task of rubbing the Queen's legs in knelt position--as it demonstrated to me the futility of pursuing power, and how power could entrance even powerful people into feeling perpetually worthless and weak (like a rabbit) in relation to others. Disregarding the subject of power, I also admired the film's ending for its inevitability and natural conclusion. The psychological punishment that resulted from an obsession of power was that one in turn would always feel powerless, no matter what transient, self-therapeutic means one could instantiate against this feeling, including cruelty towards others, self-indulgence, or the attainment of higher social status. Emma Stone did a wonderful job portraying this character, whose troubled background, although tragic and in part responsible for her feelings of worthlessness, was not the primary determinant of her corruption. This film showed that the personal choices of the protagonist, including treating love as a means to an end rather than an end in itself, changing her allegiance in the name of personal \"safety,\" and involving herself in the framing of both political propositions and people, ruined her grace and integrity. Overall, this film was insightful in many ways, and I'd love to see this being nominated for the awards it deserves."
    },
    {
      "rating": "10",
      "text": "“Favour is a breeze that shifts direction all the time.”Lathimos’ third English language film following The Lobster and The Killing of a Sacred Dear is an exploration of the absurdities of the rich, powerful and bored.Yet no matter how many clever indications one my make about the film’s title or the various tongue-in-cheek references that could be used to describe the film, or even Lathimos’ canon as a whole, it comes as a surprise to many that the director’s most tamed and least ghastly and disturbing film to date, is by far his most ravishing yet.While the specific genre of the film has yet to be determined, Lathimos’ The Favourite is a hodgepodge of cinematic tropes; part black comedy, part period piece, part love story, part cat-and-mouse thriller, part buddy comedy, part completely insane, the film deconstructs everything that you expect from all of these categories of film and throws them completely on their head with immense style, fashion and perfection. To say The Favourite will be like anything you’ve ever seen, is a direct and misleading understatement, much like the characters it presents.Written by Deborah Davis and Tony McNamara, The Favourite marks the first film Lathimos has not written a script he has directed since making his big splash at Cannes in 2009 with his highly unconventional and controversial film Dogtooth. Yet, as much as we appreciate the auteur’s uncanny ability of making people feel uncomfortable using the eeriness and awkwardness of other people by simply interacting with one another, this is one script that feels more Lathimos than any of the ones he has written in the past.While the film is made during a prominent and very loud #MeToo movement in Hollywood, The Favourite is set in 18th Century England, a land where Queens rule and Kings drool, especially when the Queen is Mrs. Morley Anne (Olivia Colman) ruler of Scotland, Ireland and England and currently waging war against France. While the Queen is surrounded by men, including her military commanders and parliamentary leaders, Queen Anne proves that at the end of the day, the women make the rules and own the house. Yet, as important and iconic Queen Anne is, it becomes clear quickly that Anne is no more of a mere mortal with a crown next to her life-long friend and council advisor, The Duchess of Marlborough, Sarah Churchill (Rachael Weisz). While Sarah is able to wholly intimidate, scoff and insult the Queen right to her face, it seem that Sarah is only looking out for one person and one person only, despite her illusions and deceit. Occasionally giving accord to Queen Anne or her husband for that matter, military commander of the Queen’s army, Lord Marlborough (Mark Gatniss), Sarah is one a one-way ticket to riches, power and most importantly her, affection.As Sarah seems to seemingly pave a path of success for years to come, things come to a steady halt with the arrival of her cousin, Abigail (Emma Stone). Although Abagail arrives in a heap of mud, discontent and stalked by tragedy, she quickly hardens up and wilts to the whim of her commanding cousin, only to quickly gain her affection and take her opportunity for the Queen’s admiration, following a natural herbal remedy for the Queen’s disgusting gout infested legs. Once Abigail becomes the Queen’s own personal leg-rubber, she begins plotting her dominance over the Queen and her affections, overshadowing her own cousin, proving that Sarah’s protegé as quickly become her biggest and most intimidating rival.Where Sarah adorns the Queen with her brazen honesty and harsh truths, including advising when the queen looks like a badger, Abigail’s approach to the affections of the Queen include lies, deceit and endless compliments, making the Queen feel unlike anything Sarah never has. Often times eroticizing the Queen and her mundane and bizarre daily routines with her bunnies and while eating, Abigail and Sarah begin to duel for Anne’s love, doing whatever it takes to be her favourite.As it turns out, each woman is capable of much unpleasantness, not only to one another, themselves but also to the poor saps surrounding them. Manipulating every man, woman and child around them for their own personal gains; both in search of security, status and nobility, Abigail and Sarah turn the conventions of a chessboard on its head, and make the queens, rooks, bishops and knights all of their pawns in their sick and twisted little kinky game of pleasure.Attacking one another like vipers and wolves, jealousy becomes the weapon of choice for both women, who’s use of men only intensifies their sadistic little game of mitral destruction and decay. Taking no prisoners, Abigail and Sarah create alliances, forms admirable teams with many of the men occupying the palace on a daily basis."
    },
    {
      "rating": "9",
      "text": "With Olivia Colman set to follow on from Claire Foy as Queen Elizabeth in the third season of The Crown, it seems a satisfying coincidence that Yorgos Lanthimos’ latest film The Favourite sees the actress take on the role of another monarch. The Crown may be the dictionary definition of period drama, but The Favourite is a very different affair, a tantalising twist on what often promises to be a dull sub-genre.Here, Colman stars as Anne, the last Stuart queen “stalked by tragedy”, ravaged by gout and depression, with her pet rabbits her only solace. She has passed on the keys of power to her closest confidant and secret lover, Lady Sarah Churchill (Rachel Weisz), but all is turned on its head with the arrival of Abigail Hill (Emma Stone) a once noblewoman whose family has fallen on hard times. As Abigail surprisingly gains the favour of the Queen, so begins a ruthless battle that plays out before our eyes in a particularly captivating power struggle between the three women.The Favourite is an enthralling film; Lady Sarah and Abigail turn loyalty into an increasingly vicious blood sport, making for a narrative littered with gratifying double-crossing, carnal intensity and stylish brutality, all accompanied by an almost illusionary sense of madness. It can only be defined as a tragicomedy, subtly hilarious yet hiding timely subtext that is delightfully ambiguous. The lines between love and deception are expertly blurred in a film that takes no prisoners in its uproarious execution. There is more deliberation in the overblown final act, however, that feels lengthy and distinctly less focused than the rest of the film.The movie finds its greatest strength in its stellar cast, led by Colman, Stone and Weisz. Colman is outstanding as Anne, hilariously petulant and childlike, reminiscent of Miranda Richardson’s Queenie in Blackadder. There’s a blunt imperiousness to Colman’s performance that carries the film through with black humour. Beyond this, however, the scenes of greatest emotional resonance are those that show the more tragic side of Anne, as a woman who has lost seventeen children (“Some were born in blood, some without breath and some were with me a very brief time”) and has never recovered from the trauma. Colman breezes through these harsher scenes that cut surprisingly deep and help to give the film a greater purpose.Rachel Weisz is the epitome of calculated steeliness as Lady Sarah and Emma Stone is pitch perfect in her first period role as the opportunistic and marvellously Machiavellian Abigail. Nicholas Hoult’s flamboyant Leader of the Opposition leads several foppish male roles, but these lie clearly in the peripheral; Yorgos Lanthimos makes apparent that the film’s sole focus is its women, all of whom are callous, yet vulnerable, but all quite brilliant in different ways.The Favourite is beautifully designed, lavish costumes by Sandy Powell and a regal set giving the film all the expected grandeur of a period drama. The film’s more salacious side, however, is shown in Robbie Ryan’s absurdist cinematography which, whilst occasionally pretentious, gives a haunting contemporary spin. I was less of a fan of the wide-angled bend shots, as well as the film’s soundtrack (from Handel to the itchy modernism of Anna Meredith), which felt invasive and ceaseless.Here, Yorgos Lanthimos has struck a fine chord. The Favourite is a wonderfully unusual and unsettling film that is at points gratuitous, but generally audacious and exciting. Spellbinding performances and an intriguing story make this not one to miss out on."
    },
    {
      "rating": "3",
      "text": "I give this a 3 in honor of the 3 lead actresses.  Otherwise, it deserves a 0.  This movie is highly overrated.  Implausible, not funny and not touching because the characters are unlikeable.  No one to root for.  Save your money. The ending sucked."
    },
    {
      "rating": "9",
      "text": "A wickedly dark, smug period piece comedy that's sure to leave viewers routinely agasp at its outrageous humor, which marvelously mixes understatement with in-your-face bawdiness. The trio of protagonists brilliantly portrayed by Olivia Colman, Emma Stone and Rachel Weisz never disappoint, with each at the top of their game. The film's smartly written script is crisp and snappy throughout, even if it takes liberties with history and occasionally falls back on director Yorgos Lanthimos's signature penchant for needless ambiguity. Not everyone will go for this one, but if you can imagine a mix of the catiest moments from \"Dynasty\" dressed up in 18th Century trappings, you've got an idea what \"The Favourite\" is all about."
    },
    {
      "rating": "9",
      "text": "No other period pieces come to mind when trying to find a comparison for 'The Favourite,' and even if there were, none would hold a candle to this 18th century tale of social scheming and palace politics.Director Yorgos Lanthimos previously caught the attention (and admiration) of art house audiences with 2015's 'The Lobster,' followed by last year's 'The Killing of a Sacred Deer.'  However this film is different, and it will justifiably earn Lanthimos a spot at the table reserved for Hollywood's elite directors.The cast is outright brilliant.  Olivia Colman, Rachel Weisz, Emma Stone, and Nicholas Hoult each deserve their own paragraph  of praise.  However, it is Colman who ultimately takes the cake for her performance (pun intended!).  She looks to be the early front-runner for the Academy Award for Best Actress--a statement that is further bolstered by the fact that she just won that award category at the BAFTAs.Expect her official nomination come January ... along with a slew of other nominations covering just about every Oscar category."
    },
    {
      "rating": "3",
      "text": "What the hell is all the fuss about?? A lot of money was wasted in making this film. Very nice costumes. Good performances (I think), but I really couldn't hear all the dialogue. With the bells, the music etc. constantly in the backround, very difficult fully understanding what was being said. The director seems to want to impress. All in all, an artsy fartsy film.  In any case, didn't think it was funny."
    },
    {
      "rating": "10",
      "text": "Everything gels. The score, the drama, the comedy, the absurdity. It all comes together like a recipe which turns out just right."
    },
    {
      "rating": "1",
      "text": "Typical critcally acclaimed dribble that Sundance film types and Hollywood suck ups adore that was completely unfunny, unwitty, unnecessary crass, gratuitous and misplaced sexual situations and 3 main characters it became difficult/impossible to care about.  In short, 2+ hours of torture. No one laughed. No one reacted.  I see a lot of movies - this was in my bottom 10, for what’s its worth.  Guys, if your girlfriend wants to go see it, please suggest something else to do. She’ll love you for it."
    },
    {
      "rating": "9",
      "text": "Provocative director Yorgos Lanthimos brings us what many are saying is his most mainstream work yet -- \"The Favourite.\" Make no mistake though, this movie is twisted, philosophically intriguing and, yes, provocative. This is a deep, dangerous study of the problems with power and the relationships that revolve around powerful figures. It's masterfully directed and acted, featuring a brilliant screenplay with carefully constructed characters and what's easily the best central conceit in any movie I've seen this year. It may not be for everyone, but it's certainly worth a watch."
    },
    {
      "rating": "8",
      "text": "“I like it when she puts her tongue inside me.” Yes, I crap you not: that’s a legitimate line heard in one of the Oscar frontrunners, one that I can even argue has a legitimate chance at winning the top prize of the night. It’s both your typical awards fare and everything against the Oscar tropes: it’s an early 18th century setting about a crabby old queen (okay, fine… she’s not that old, she’s like, 42) who suffers from gout, and features an actress in the lead who won a little golden naked man for playing a struggling actress. But you know what else this motion picture contains? A duck race, badger-style makeup, mud baths, fish-eye lenses, walls buried under tapestries, smoke rings, oranges thrown at a naked man in a pink wig, Emma Stone’s boobs, and lots of pet rabbits. Believe it or not, it’s bound to be The Favourite of the Academy.It’s miraculous to see how director Yorgos Lanthimos drags us down his rabbit hole to intoxicate us with his mad tea party where the hopping madness of the queen’s new servant (Stone) initiates an inconceivable battle of wits between herself and her cousin (Weisz). Every single frame looks like one of the numerous works of anti-art hung up in the queen’s castle, with doses of natural light used to illuminate the large interiors that tighten in on you through their arches. When there’s no sun available, candle lights are relied upon to darken the tone, making the women’s angst feel greater. Then when the perspective of the storytelling shifts into this new servant girl’s point of view, the proper look of the screen suddenly turns bulbous as if looking through the eyes of a guppy. You really do feel like you’ve gone mad in Lanthimos’ not-so-wonderous land of hearts.What’s so grand about these three women fighting for power is that it all takes place in a single location, the only real change being the leisure outdoor bird-shooting. The bounding to the castle that almost feels like a character itself is a creative choice not implemented enough with other period pieces that instead decide to let the lavish sets and costumes take the narrative wheel. While these are still the best sets and costumes 2018 has had to offer, they never become the focus for a second. It’s all just a matter of escalating the three-way tension.Speaking of three-ways, I should forewarn you that there is plenty of lesbianism that these women share with one another. That is, the two servants fight for the affections of the queen, a fight that even turns near-fatal at one circumstance or another. Although, it’s worth noting by fact checkers that it was never 100% confirmed that Queen Anne was ever a lesbian, and implementing it as a core part of this story probably was not fair to do, especially while leaving out her real-life husband from the story who died before the events told here. Yet for what this film strove to do, it gladly did not fall into the trap of turning the lovemaking full-on steamy, just enough of it is shown to give the idea without detracting from what each character feels.Now, how should you feel as you watch The Favourite? Most likely, you’ll be rolling on the floor in laughter. I certainly was, maybe not literally, but next to Paddington 2, no other movie of 2018 made me laugh harder than this one. The eruptive line deliveries that the three women explode out of their vocal cords got the audience of my screening roaring with laughter as much as any other family comedy; what got me laughing the hardest was a wondrously bizarre dance that looked much like two courting geese. Oh, and the duck race at the beginning: that “quacked” me up quite a bit!Such a flavor for humor displays the film’s ironic mindset of mocking the mad British monarchy, for even now, just like hundreds of years ago, women wanting to strangle one another for power always gets out of hand. That doesn’t at all mean this movie is anti-men, anti-women, or anything even remote to that. It instead testifies to all women with given authority over men how they must honor their authority while also honoring one another. It’s not a manner of which one with the most prominent “V” should be at the top of the pyramid, it’s a manner of us all being together, aligned toward the same goal.Just to be plain, this movie is not for everyone. In fact, I say its totally bizarre narrative and tone makes it one of those movies only made to appeal to a select few who can appreciate its narrative approach. Odds are, a woman getting brutally scarred by a horse is not your idea of funny and watching two women feeling up one another is not the best way for you to see the dangers of women abusing their authority. That’s why extreme caution is advised, but that’s the way it should be. Yorgos Lanthimos’ newest masterwork is indeed a complicated movie about complicated topics and is not something anyone should think of taking lightly. Now, who wants some blue waffles?"
    },
    {
      "rating": "3",
      "text": "A waste of excellent performances by Colman, Weisz and Stone.  Gratuitous, irrelevant scenes fail to add period flavor and detract from the already thin story line.  What a disappointment."
    },
    {
      "rating": "6",
      "text": "Looks great and features a trio of solid performances, but just wasn’t my cup of tea. Too slow and abstract (a fat naked man being pelted by oranges in slow-mo isn’t my thing) and just doesn’t relish in its cruelness like it should. But again, I know I’m in the minority here."
    }
  ],
  "recommendations": [
    "black_swan",
    "marie_antoinette",
    "phantom_thread",
    "the_last_duel",
    "youth",
    "the_beguiled",
    "roma",
    "annette",
    "20th_century_women",
    "trainspotting",
    "the_master",
    "the_rover",
    "melancholia",
    "legends_of_the_fall",
    "perfume_the_story_of_a_murderer",
    "tulip_fever",
    "revolutionary_road",
    "thoroughbreds",
    "the_good_shepherd",
    "a_most_violent_year",
    "hugo",
    "nocturnal_animals",
    "you_were_never_really_here",
    "alexander",
    "eastern_promises"
  ]
}