{
  "id": 3542,
  "title": "The Cell",
  "starring": [
    "Jennifer Lopez",
    "Vince Vaughn"
  ],
  "runtime": 107,
  "genre": [
    "Horror",
    "Science Fiction",
    "Thriller"
  ],
  "description": "A psychotherapist journeys inside a comatose serial killer in the hopes of saving his latest victim.",
  "releaseYear": "2000",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/58U0jRJmX8K62Zh1QcYVwQDoDtE.jpg",
  "categories": {
    "plot": 5.666666666666667,
    "acting": 6.285714285714286,
    "ending": 8.5,
    "soundtrack": 10.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "I am having a hard time wrapping my head around these bad reviews. I am a movie lover who normally is not a big fan of style over substance, but I found this film to have a good story with a well written screenplay. The film uses it's wild imagery to create suspense and to ultimately create a very engaging well paced film. The movie's themes were well laid out and developed and find resolution in a very subtle way. Overall the film ranks high on my favourite serial killer films. Not quite as good as the silence of the lambs but still good none the less."
    },
    {
      "rating": "10",
      "text": "Just like with Tarsem's next movie The Fall I'm baffled about the bad ratings this masterpiece got by critics. It's almost grotesque, as if they didn't understand it or failed to realise what visual impact this unique movie brings. Must watch, just like The Fall."
    },
    {
      "rating": "8",
      "text": "I have rarely seen a film that has the scope of this one; it really tests the little grey cells to the maximum. Some scenes are truly off the wall but at the same time totally beautifully conceived and enthralling. It"
    },
    {
      "rating": "10",
      "text": "For artistic influences, Tarsem Singh was inspired by music videos directed by Mark Romanek, such as \"Closer\" and \"The Perfect Drug\" by Nine Inch Nails, \"Bedtime Story\" by Madonna, and several music videos directed by Floria Sigismondi for Marilyn Manson."
    },
    {
      "rating": "10",
      "text": "One of the movies of my life. Futuristic. It was effective on me in choosing the psychology department. There are art, neuropsychoanalysis, fear, tension..."
    },
    {
      "rating": "10",
      "text": "Hypomelanosis is a rare condition with areas of the body lacking much skin color (hypopigmentation) in patches, streaks or spirals (whorls). Neurologic findings associated with it can include seizures, developmental delays, and scoliosis"
    },
    {
      "rating": "10",
      "text": "Catherine finds herself in a dream world version of the lab when entering Carl's mind a third time, but since he never saw this facility before he was wheeled into it, and he was comatose at that, how would he have any memories of this location imprinted in his mind? Though logic does not operate in the dream world, and nothing has to make sense, it still begs the question of why he would have memories of a place he never visited while conscious."
    },
    {
      "rating": "10",
      "text": "After Carl has corrupted Catherine in the dream world, she is then dressed in a black lace nightgown with a red collar as his puppet. This is meant to evoke a black widow spider; further evoked when Novak enters Carl's mind, she distracts him with a kiss whilst Carl incapacitates him."
    },
    {
      "rating": "9",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "9",
      "text": "°°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》@;@:@;@;@;@;@;@;@;@:@:@:@:@:@:@;@;@;@;@;@;@;@;@@;@;@;;@;"
    },
    {
      "rating": "10",
      "text": "A+ ........................................................................."
    },
    {
      "rating": "10",
      "text": "Vincent D'Onofrio later admitted that his wife refused to sleep in the same bed with him for two weeks after seeing his performance in the movie."
    },
    {
      "rating": "10",
      "text": "tsse2qstfybjhionojklmkpojohhiihuggyftrdrdyfseeardctfyhihionojjojoohigtdseyfihjiujj"
    },
    {
      "rating": "10",
      "text": "============================================================================="
    },
    {
      "rating": "9",
      "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"
    },
    {
      "rating": "10",
      "text": "Factual errors An albino dog would lack almost all color. Pink nose & eyes, not blue eyes & black nose."
    },
    {
      "rating": "10",
      "text": "▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■▪○●□■"
    },
    {
      "rating": "10",
      "text": "In the movie, the cops are looking for the breeder of the killer's dog, which they say is an albino German Shepherd, when in fact, the dog in the movie is an albino Siberian Husky. Note the blue eyes in the film that the dog has."
    },
    {
      "rating": "10",
      "text": "Absolutely Amazing Masterpiece!The director of The Cell is a genius who serves up some highly original artistic and disturbing images. I love this movie! Ok so maybe Jennifer Lopez isn't a great actor,neither is Vince Vaughn..but they played their roles quite convicingly and Ms Lopez is a beauty whose presence gives a brilliant stark contrast to the dark images inside a serial killer's mind. \"The Cell\" is one of those movies like \"Se7en\",\"Fight Club\"and \"Hellbound: Hellraiser 2\",people are either going to love this movie or hate it with a passion. If you can suspend disbelief and enjoy a movie for what it is..a M-O-V-I-E.then you will like this flick. Kudos again to the director,He used celluloid as his canvas and has made a masterpiece!"
    },
    {
      "rating": "10",
      "text": "Absolutely Amazing Masterpiece!The director of The Cell is a genius who serves up some highly original artistic and disturbing images. I love this movie! Ok so maybe Jennifer Lopez isn't a great actor,neither is Vince Vaughn..but they played their roles quite convicingly and Ms Lopez is a beauty whose presence gives a brilliant stark contrast to the dark images inside a serial killer's mind. \"The Cell\" is one of those movies like \"Se7en\",\"Fight Club\"and \"Hellbound: Hellraiser 2\",people are either going to love this movie or hate it with a passion. If you can suspend disbelief and enjoy a movie for what it is..a M-O-V-I-E.then you will like this flick. Kudos again to the director,He used celluloid as his canvas and has made a masterpiece."
    },
    {
      "rating": "10",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》●》■》■》■》■》■》■》■"
    },
    {
      "rating": "9",
      "text": "♤¿♤¿♤¿♤¿♤¿¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿:;:;:;:;:;:;::;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "9",
      "text": "++++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "9",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"
    },
    {
      "rating": "10",
      "text": "Brilliant ------------------------------------------------------------------"
    },
    {
      "rating": "10",
      "text": "(At around forty-two minutes) The scene when Catherine is chasing Carl through a stone hallway, right before she enters the room with the horse, is based on a painting by Swiss surrealist H.R. Giger called \"Schacht\" (german which translates to shaft or tunnel in english)."
    },
    {
      "rating": "10",
      "text": "The Cell (2000)Sinopsis:Una terapeuta presencia visiones espantosas cuando penetra en la mente de un asesino en serie que está en coma con la intención de descubrir sus motivaciones y salvar la vida de su última víctima en cautiverio.Opinión:Pecado haberme tardado 20 años en ver esta película, estuvo magnífica de principio a fin, leí que en su época fue mal recibida por la crítica pero aclamada por el público lo que significó en un éxito de taquilla. Quizás está película estuvo demasiada adelantada a su tiempo es cosa de ver sus escenas y efectos especiales, algo abrumador, novedoso y raro siendo que es del año 2000.No me cae mucho JLo pero encuentro que es buena actriz, al menos en esta cinta lo hace muy bien, en cuanto al retorcido personaje de Vincent D'onofrio se me hizo aterrador, pero por otro lado lo encontré muy bonito jeje.En fin, no me arrepiento de haber visto tan tarde esta película y aparentemente no envejece en lo absoluto.Valoración:5 ⭐ de 5 ⭐"
    },
    {
      "rating": "9",
      "text": "●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●●÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,÷,+,+,+,+,+,+,=,=,=,=,=,::.:.."
    },
    {
      "rating": "9",
      "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•"
    },
    {
      "rating": "8",
      "text": "The Cell is unlike a movie I've ever seen before. It's a mix of bizarre special effects, serial murders and fantasy that is far too uncommon in mainstream cinema. There's also the fact that this is a film with Jennifer Lopez that is actually good. The Cell is a sci-fi thriller film directed by Tarsem Singh with Jennifer Lopez in the lead. A social worker, Catherine Deane, is called to enter the mind of a serial killer who has fallen into a coma in order to find his next victim before she's killed. This guy can make Hannibal Lecter seem like small-time; he traps his female victims inside a cell that will slowly fill with water until it drowns them, then bleaches their skin after their dead so that they can be his own personal dolls. After entering the killer's mind, Catherine finds herself lost in his psyche and must find her way out, or else the killer will find her. The Cell has a lot of haunting imagery since it has to build an entire world inside someone's mind. Tarsem builds this world incredibly well and makes the viewer feel like they're trapped with Catherine in there. The serial killer plot itself is a little thin because a majority of the film takes place within the killer's mind, but the way the story is told is so original that most of the film's faults can be forgiven. If you want your average serial killer thriller told in an incredibly original and memorable way, The Cell will give you that and more."
    },
    {
      "rating": "8",
      "text": "I recommend this film. The end was a bit predictable but an overall good movie with some disturbing scenes."
    },
    {
      "rating": "0",
      "text": "9.0?   como es posible que una película tan mala, pésimo guión, pésima protagonista pueda estar rankeada tan alta.  Estoy más de acuerdo con la puntuación que le otorgan los especialistas.  En una sola palabra.  ABURRIDISIMA"
    },
    {
      "rating": "4",
      "text": "How cud spell check head check\" Roger Ebert Give this a 100. Bought off. critics are not? What? The movie isn't bad . But the whole premise of people being suspended on hooks and having their minds and dreams. SAY WhaT? hOEKEY. Hard to believe. Lame. but watchable."
    },
    {
      "rating": "6",
      "text": "Tarsem Singh's directorial debut, The Cell, contains more style than substance, and is weighed down with it's special effects and a side-story that should have been left on the cutting room floor. At the same time, elaborate costuming and great shots that turn the most desolate sand dunes into beautiful landscapes, present a great director in the making and enough story to keep the audience along for the ride.Catherine Deane (Jennifer Lopez) is a psychotherapist who has been working with a comatose child by getting inside his mind via a virtual reality styled setup that includes a breast accentuating suit, suspension from wires, and a face covering towel that looks like a computer circuit-board. Meanwhile, there's a killer on the loose and the FBI hopes that Catherine can get inside the killer's mind to find his latest victim before it's too late.It's difficult to discuss The Cell, without mentioning Tarsem's 2006 film The Fall. Because everything Tarsem did wrong in The Cell he did right in The Fall. The Cell was a learning experience for Tarsem, and he learned his lessons well. The Cell is set up like a coin, there are two sides that come together to make one movie, unfortunately one side of the coin is more polished than the other. In this case the polished side is Tarsem's non-CGI visuals, many of which are influenced by great paintings, but the CGI effects are in overload throughout many parts of the film and it's distracting. There are several moments within The Cell that hearken to David Lynch's Twin Peaks (1990-1991), which stands to reason as both, Tarsem and Lynch, are visual directors.Catherine's story line with the killer, Carl Stargher (Vincent D'Onofrio), is interesting and provides many great visuals. The parallel crime drama storyline, however, is lame, even by C.S.I. standards. Vince Vaughn is passable as Peter Novak, the FBI agent who has a past of his own to overcome, but the character is uninspired. Any actor could have played Peter Novak and it wouldn't have made a difference.Jennifer Lopez's performance improves with the increasing bizarreness of her costumes, which both come to a peak in the third act. Vincent D'Onofrio is good as the killer, whose fetishes would give Jeffrey Dahmer a run for his money. Although D'Onofrio executed the part well, I can't help but wonder what Philip Seymour Hoffman would have done with the role.Despite it's flaws, The Cell doesn't leave you empty handed, and it shows a first time director learning his strengths and weaknesses, which payed off six years later when he directed The Fall."
    },
    {
      "rating": "5",
      "text": "The Cell is rated R for bizarre violence and sexual images, nudity and language. To call The Cell disturbing is a bit of an understatement. I've never winced so many times during one film in my life. However, that is exactly the reaction Tarsem is going for. He doesn't want you to be unmoved. He wants you to be horrified--so horrified that you sometimes can't even watch. There are moments which are so hard to watch, you may feel as if you are really there, experiencing it all firsthand. I won't try and convey the disgusting acts portrayed on screen, as it isn't easy to put into words. This is a film based solely on visuals, and visuals alone. It works. And I know for sure, I won't be forgetting it anytime soon."
    },
    {
      "rating": "5",
      "text": "It's the usual style over substance from 'The Cell'. I won't deny the visuals and atmosphere present a visceral experience that helps its audience delve into the subconscious. That is the intent, and it is done well. But in terms of story and characters, there seems to be a lot missing, with the exception of D'Onofrio, a consistent favorite of mine, and Lopez, who is the only other character with any real depth. The additional crime thriller b-plot could have been done a lot better. Great direction and cinematography, mediocre writing and casting (save for D'Onofrio)."
    },
    {
      "rating": "5",
      "text": "Out of curiosity I saw The Cell, and the impression I had is that of good alike and indifference, both the performances and the scenery, the photography and the history were very good, the problem is that some scenes are very brutal that several do not endured And that's how an undervalued and extremely divisive movie is built."
    },
    {
      "rating": "0",
      "text": "this movie tries to dive into the mind of a serial killer. which i wouldn't mind to much, but it has to be handled with grace and care. which this film is more than lacking of! all of the information we are given about the killer is that he was beaten as a child, that is it! and it is filled with plot holes that make no sense, and like nostalgia critic said, the visuals are trying to make you think that the film is leading on more than what it is! and this film sometimes has either too much story or too much art!"
    },
    {
      "rating": "6",
      "text": "The movie wasn't really that good. Everything looked pretty awesome though. It was a really good idea for a movie, but could have been better."
    }
  ],
  "recommendations": [
    "you_were_never_really_here",
    "eyes_wide_shut",
    "mandy",
    "the_killing_of_a_sacred_deer",
    "the_birds",
    "the_invisible_man",
    "stoker",
    "dark_city",
    "under_the_skin",
    "constantine",
    "the_raven",
    "the_neon_demon",
    "color_out_of_space",
    "the_mothman_prophecies",
    "titane",
    "the_machinist",
    "ex_machina",
    "us",
    "trance",
    "a_cure_for_wellness",
    "zodiac",
    "last_night_in_soho",
    "candyman",
    "the_crow",
    "the_ninth_gate"
  ]
}