{"id": 2503, "title": "The Hurricane Heist", "starring": ["Toby Kebbell", "Maggie Grace"], "runtime": 103, "genre": ["Action", "Crime", "Thriller"], "description": "Thieves attempt a massive heist against the U.S. Treasury as a Category 5 hurricane approaches one of its Mint facilities.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/rAmcj5IZcx59dhev3UnVDEGlImK.jpg", "categories": {"plot": 4.833333333333333, "acting": 5.5, "ending": 4.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.0, "action": 6.0}, "reviews": [{"rating": "1", "text": "Class B movie in 2018... No words. Poor CGI and acting. It should be just on DVD or Netflix."}, {"rating": "4", "text": "Director Rob Cohen continues his trend of logically flawed, narratively uninspired actioners with \"The Hurricane Heist,\" an unfortunate waste of time and resources that ultimately spends most of its running time perpetuating what's going wrong with the action movie genre than what's going right with it. And with the film's two titular elements feeling as tacked together as the plot threads within, your inclination to skip this one might prove right on the proverbial money this time around."}, {"rating": "4", "text": "I gave it a 5..for the special effects only! I guess anything goes in movies nowadays. Not only is the plot not plausable. But the acting is TV rating stuff only. This seems like a nice movie for HBO or TNT. Good thing I got a free ticket to see this."}, {"rating": "0", "text": "The Hurricane Heist is certainly a disaster of a movie. With sh*tty acting, sh*tty writing, sh*tty plotlines, and even sh*tty effects, this film won't blow you away, but rather suck the life out of you."}, {"rating": "7", "text": "First things first, this movie is definitely no Citizen Kane. Hell, it isn't even a Porkys 2. What it is, though, is a delightfully daft, couple of hours of leave your brain at home and have fun. Cohen, though slightly let down by disappointing CGI, brings us a heist movie the likes of which any other director would probably have looked at the script and wondered if the writers were using too much prescription medication. What he does bring us is a silly B movie, with laughs and thrills a plenty. The actors certainly chew their scenes with relish, yes I'm looking at you Mr Cross, however with an enthusiasm that rubs of and delivers plenty of fun for your buck. He even gives MS Grace a slightly more interesting character than the shovelling, spoilt brat she has been lumbered with this past few years. See it on a Friday night after a couple beers and hopefully you'll leave smiling at how preposterous it all is but made by folks who didn't care and just wanted to entertain. On that level, it definitely works."}, {"rating": "7", "text": "The Hurricane Heist Is an Fun action movie WIth a Hurricane on them I like the whole cast in this movie The very beginning of the movie is the best part of the whole movie The ending is pretty neat there is no much is just a lot of fun it is like a taco bell movie to me the score is nice I liked it So I give Hurricane Heist An C"}, {"rating": "7", "text": "Like the title suggests, this is a hybrid of disaster flick with a hi-tech caper. A group stages the robbery of a Federal money facility in Alabama under cover of a major storm. It's up the an ATF agent and 2 men she enlists to save the day (and drive those semis for the final confrontation). While there are ridiculous aspects about this whole thing, it's got sufficient action and weather-related calamity to keep it entertaining in a purely popcorn mode."}, {"rating": "7", "text": "The plot... a destructive hurricane named Tammy approaches the town in Alabama. Treasury agent Casey Corbyn is ordered by fellow employee Randy Moreno to summon Breeze, who now works as a handyman, and whose brother Will is a meteorologist, to fix the generator at a cash storage facility. While she is out of the facility, rogue Treasury agents, led by Connor Perkins, infiltrate the facility and hold employee Moreno hostage. Their plan is to steal $600 million, and Perkins enlists computer hackers, Sasha and Frears, to crack the code of the vault. Failing to decrypt it, Perkins realizes that Corbyn may have changed it, so he has his men find her...The movie is made by the producers of the highly acclaimed 'The Fast and Furious' series. Naturally I have relatively high expectation going into this. The first thing that caught my attention is the top notch voice acting, nothing too cheesy or over the top. This film focuses heavily on action which scenes are flawlessly complemented by immersive background music. It does an excellent job at that. Also, the breath taking disaster scenes plus the well choreographed actions sequences make it double the fun. However... this movie falls heavily short on the story/plot aspect, it is just too simple and predictable, and wasted away the potential for the making of a great film, evidenced by the poor box office performance."}, {"rating": "4", "text": "\"The Hurricane Heist\" was a regular story, although the story and the plot were good, the performances were generic, and the special effects were cheap and bad. But it is also a crazy idea."}, {"rating": "4", "text": "That strange case in which is as bad as it is ridiculous that somehow ends up working."}, {"rating": "0", "text": "Totally inaccurate **** a hurricane does not move like this 9ne, the storm surge moves in BEFORE the storm and not with the eyewall, also, a hurricane does not dissipate like this one did at the end of the movie. It's total ****"}, {"rating": "6", "text": "Die Hard meets Twister in the new thriller, The Hurricane Heist. When I first heard about this film, I was really excited and hoping for something new, but the truth was this film was nothing more than a compilation. A severe hurricane is about to hit the Gulf Coast, and U.S. agents are in town to secure the U.S. mint. As the storm bares down they are confronted by a gang of thieves intent on taking millions. The only things between them and freedom are a lone agent, two local boys, and one hell of a storm. There were so many parallels to other films that throughout The Hurricane Heist I was getting nothing but deja vu. At some points I felt like they should have just made the hurricane a series of tornadoes and called the film Twister 2. That was bad enough, but when you combine lack of originality with predictable behavior, you get a story that is very dull. What saves the film from being just another disaster movie are some amazing chase sequences, from the minds behind The Fast & The Furious, as well as some incredible special effects. This film is definitely an adrenaline rush, but the story, star power, and originality are severely lacking. I was expecting a daring robbery in the midst of a cataclysmic storm, instead I got Hard Rain, without the star power. In the end, The Hurricane Heist wasn't a terrible film to watch, but it was anything but memorable."}, {"rating": "3", "text": "While the action is appropriately over-the-top, the film isn't melodramatic, light, or hilarious enough to satisfy the campiness its title and premise promises. 3.5/10"}], "recommendations": ["the_transporter_refueled", "the_ice_road", "escape_plan", "san_andreas", "skyscraper", "the_commuter", "taken_3", "london_has_fallen", "salt", "den_of_thieves", "infinite", "the_fate_of_the_furious", "lockout", "the_mechanic", "premium_rush", "hunter_killer", "seeking_justice", "angel_has_fallen", "21_bridges", "geostorm", "mechanic_resurrection", "white_house_down", "mile_22", "rampage", "death_race"]}