{
  "id": 2593,
  "title": "The Terminal",
  "starring": [
    "Tom Hanks",
    "Catherine Zeta-Jones"
  ],
  "runtime": 128,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "Viktor Navorski is a man without a country; his plane took off just as a coup d'etat exploded in his homeland, leaving it in shambles, and now he's stranded at Kennedy Airport, where he's holding a passport that nobody recognizes. While quarantined in the transit lounge until authorities can figure out what to do with him, Viktor simply goes on living – and courts romance with a beautiful flight attendant.",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vRYbjHs129MARMq1VDbnk9Jboen.jpg",
  "categories": {
    "plot": 5.9714285714285715,
    "acting": 6.5,
    "ending": 4.571428571428571,
    "soundtrack": 5.0,
    "cinematography": 7.75,
    "familyFriendly": 5.5,
    "funny": 7.538461538461538,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Cheap drawn-out overdramatization and awkward slapstick blows situations that were trying to ring true. Spielberg needs to go back to making movies where the characters are carbon-based life forms."
    },
    {
      "rating": "4",
      "text": "Anyone who has traveled by plane usually hates wait long at customs or passenger control, and can lose his composure with delays or baggage losses. In this case, the unfortunate passenger played by Tom Hanks will go through a bit of all that for having lost his own nationality, ending retained \"ad aeternum\" in New York airport terminal. Assuming that this film is a comedy with some romance, the idea is good, even if it seems little logic. Despite this promising start, the script ends up lost in trivialities and huge plot holes. One of the most egregious is the fact that Viktor, Tom Hanks' character, who hardly spoke a word of English, having learned so quickly the language. His story with Amelia (played by Catherine Zeta-Jones) also does not fit in the rest of the film, so that is quickly cut with a simple and abrupt ending.Tom Hanks deserves, however, congratulations. He was again perfectly up to his work. His character could be just a caricature of any citizen of the former USSR countries, but he managed to give it a very kind and patient soul, who easily conquers the public. Zeta- Jones had less luck with her character, poorly planned and poorly embedded in the plot but, nevertheless, made a decent and satisfying work. Stanley Tucci makes a good villain in the person of airport immigration director, Frank Dixon.This film is pure entertainment, and it works very well in this light. But it could have been more intelligently developed in several aspects."
    },
    {
      "rating": "9",
      "text": "What a fun film! I think this is one of Tom Hanks best performances. Its almost a throw back to 80's style sappy films but it does not go overboard. The character development was superb and even though some of the characters were not believable, they remained memorable such as the security staff and the port administrator.\r This movie is about a guy from a fictitious country who gets lost in the paperwork because his country ceased to exist while he was in flight. The shenanigans begin when his passport is rejected by US customs and the administrator of the terminal fails to communicate with him due to language barriers. From here everything goes haywire. The administrator cant get rid of Mr. Navorski (Tom Hanks) and and Mr. Navorski cant speak English and cant find anyone to help him translate what he sees on the TV (about the war in his country). Since his passport is not valid he cannot enter the USA and the airport authorities have no where to send him since his country no longer has any flights going to it. So what does he do? He starts learning English by comparing two travel guides, one in his language and one in English (recall this is pre-cell phone days). Along the way, he finds ways to make money so he no longer has to eat crackers with ketchup, lands a job, befriends a crazy Indian, goes on a date with a stewardess, helps a baggage handler meet and marry the girl of his dreams, helps people around the terminal in various ways, and eventually confronts the terminal authority that had him trapped (with the help of his new found friends).\r Its not supposed to be believable any more than Big was believable, and there are plot holes a plenty but it is a fun movie and was never meant to be taken very seriously. I highly recommend this movie."
    },
    {
      "rating": "10",
      "text": "superb film.this is one of my all time favourite movies.tom hanks has outshone himself in this great movie. The direction,camera,editing are all awesome.love this movie"
    },
    {
      "rating": "0",
      "text": "Considering how particular the states in immigration and border control, The film is so unrealistic. In reality , someone like tom hanks character would end up in a detention centre and eventually  kicked out of the states.However Spielberg sugar  coats and tones down such story to show how  kind the states to the american audience and  the world . Tom Hanks's character is coming from an imaginary Eastern European country in turmoil but all he would like to do in New York is to see a jazz concert. Such a thing can only happen in a Spielberg film"
    },
    {
      "rating": "8",
      "text": "Another great movie from Spielberg with Tom Hanks in the lead role. Nice comedy, great story and acting makes me wanna watch it again! 8/10 absolutely outstanding"
    },
    {
      "rating": "9",
      "text": "Such a funny and great movie with another perfect performance by Tom Hanks. Interesting, because of the brilliant acting I watched the movie with the idea that it's a real situation of life. Somehow this role past Tom perfectly, but I guess if you are so good actor and you are Tom Hanks as well, every role would past you perfectly."
    },
    {
      "rating": "3",
      "text": "This movie tries to charm in the cliched Spielberg way. But except for a few moments, this movie disappoints. Completely absurd and unbelievable, the story becomes more and more ridiculous as the movie progresses. Hanks is also disappointing with a stereotypical and uneven performance. This Spielberg fairytale is one of his worst."
    },
    {
      "rating": "10",
      "text": "This is definitely one of my all time favorite movies (and this is coming from someone who loves critically loathed summer blockbusters). Great movie to watch before travelling."
    },
    {
      "rating": "7",
      "text": "The Terminal is a slight yet memorable comedy from Spielberg. Hanks is magnetic as usual in the central role and Stanley Tucci is also great as Hanks' nemesis. The Terminal is superior rom-com fluff."
    },
    {
      "rating": "8",
      "text": "Well, this movie is awesome. The plot is very interesting, the actors did a good job and I liked it very much. This movie will make you laugh, and guarantees to entertain you. Also, I loved when Viktor makes the fountain for Amelia"
    },
    {
      "rating": "8",
      "text": "The Terminal is one of Spielberg's most overlooked films of his entire career. It's a soft, delicate and warming romance. Tom Hanks is outstanding alongside Catherine Zeta-Jones."
    },
    {
      "rating": "7",
      "text": "The Terminal is not exactly the most original film in terms of structure, nor is it the most daring Spielberg-directed film in existence, but it is still really good. Incredibly funny and cute, The Terminal features a great performance by Tom Hanks that really exceeds the overall quality of the film. It is incredibly safe and adverse to taking too many risks, but still manages to be an interesting look at this man's life in an airport after a crisis in his home nation leaves him stateless. Regardless, it is very entertaining and can be quite charming and moving at times in ways that only Spielberg films can. Somehow, that movie magic is still present in this film set solely in an airport terminal."
    },
    {
      "rating": "8",
      "text": "Another great movie from Spielberg with Tom Hanks in the lead role. Nice comedy, great story and acting makes me wanna watch it again! 8/10 absolutely outstanding"
    },
    {
      "rating": "8",
      "text": "With cinemas currently providing little refuge from disasters both natural and manmade, this buoyant, optimistic fable seems to share in the late Ronald Reagan's optimism for America. Tom Hanks stars as an immigrant unable to leave in a New York airport. Pic should quickly pilot its way to the helmer's usual numbers for non-genre fare.\r Fanciful as it sounds, the premise of “The Terminal” is rooted in fact — specifically, the case of Iranian expatriate Merhan Karimi Nessari, who has, since 1988, resided in Terminal 1 of Paris’ Charles de Gaulle Airport. (Previously, Nessari’s story was the inspiration for the 1994 French pic “Lost in Transit.”)\r Here, Hanks plays the Messari-inspired Viktor Navorski, who touches down on American soil only to discover that, during his flight, a political coup occurred in his fictional Eastern European homeland. Informed by businesslike Homeland Security officer Frank Dixon (well played by Stanley Tucci) that he is unable to return home or to seek asylum in the U.S. until our government recognizes the new regime, Viktor is ordered to stay put in the airport.\r Dixon reasons it’s only a matter of time before his virtual prisoner escapes into the Big Apple and becomes some other agency’s problem. But Viktor wants to enter the U.S. legally, for unspecified reasons that may concern the tin of Planters peanuts he carries around like a family heirloom.\r Restricted to the confines of the airport’s glittering, glass-and-steel international transit area, Viktor patiently goes about making himself a home, while the film evolves into a gentle satire of the dilemmas of immigration and the resilience of this new American’s entrepreneurial spirit.\r Screenplay slyly observes the terminal as a home to an entire community of uprooted persons — from Indian emigre janitor Gupta (scene-stealing Wes Anderson regular Kumar Pallana), who takes perverse pleasure in watching people slip across his freshly-waxed floors, to Mexican food-service worker Enrique (Diego Luna), who pines for the affections of a beautiful Customs officer (Zoe Saldana).\r There’s also knockout United Airlines flight attendant Amelia Warren (Catherine Zeta-Jones), whose meet-cute with Viktor owes itself to a waxy, Gupta-generated tumble. Embroiled in an unsatisfying affair with a married man (Michael Nouri), she finds herself drawn to Viktor’s honesty and warmth, and able to relate to his feeling of living in an airport (which she initially mistakes as a metaphor).\r Yet, while Viktor and Amelia continue to rendezvous, their relationship becomes neither the focal point of “The Terminal” nor a full-blown romance. And while Zeta-Jones is excellent at revealing Amelia’s sad, delicate dimensions, she ultimately isn’t in that much of the movie. Of course, that’s part of pic’s point — that in this crazy, mixed-up world, we rarely have time to stop and savor the things that really matter.\r For a movie about a man whose very nationality lingers in limbo for months, “The Terminal” lacks any significant sense of conflict, and an 11th-hour subplot involving Art Kane’s famous Harlem jazz portrait feels like something out of left field. But at its best, “The Terminal” finds Spielberg working in the breezy, freewheeling fashion that dates back to his early “The Sugarland Express” and his recent “Catch Me if You Can.”\r Spielberg does not appear to take himself or the material too seriously, and his steadfast refusal to see the proverbial glass as less than half-full is more inspiring than cloying. In Spielberg’s world, it’s possible for an immigrant to learn fluent English by reading a Fodor’s travel guide. And, in a summer when the likes of “Troy” and “The Stepford Wives” are what pass for old-fashioned Hollywood entertainment, it’s a pleasure to spend time there.\r Astonishingly, pic’s massive, detail-perfect set is just that — not a real airport terminal at all, but an exact replica constructed by production designer Alex McDowell in a Palmdale, Calif., aerospace hanger. (A few exteriors were shot in Montreal.)\r Though relatively minor compared to his superb work on the new “Harry Potter” pic, John Williams’ score still offers an enjoyable coupling of typically Holst-ian fanfares and more adventurous, klezmer-influenced riffs.\r Perhaps pic’s greatest technical pleasure, however, is the lustrous, color-saturated cinematography of regular Spielberg lenser Janusz Kaminski, whose work here registers at the opposite end of the spectrum from his signature faded hues and blown-out lighting schemes, resulting in a visual luxuriance that harks back to Spielberg’s classic collaborations with d.p. Allen Daviau (“E.T.,” “The Color Purple,” “Empire of the Sun”)."
    },
    {
      "rating": "10",
      "text": "Tom Hanks at his finest. This film is the very definition of heartfelt.\rThe terminal is a fantastic Rom-Com filled with laughter, tears, and fleeting moments of pity that all come together to form a classic. For those living under a rock and have never seen Tom Hanks in a film before would not be judged for thinking he is eastern European. His performance as Viktor Navorski,  a man from  the fictional country of Krakozhia is magnificent. The ease in which he performs his role is awe inspiring. But he is far from alone. Stellar performances from Catherine Zeta-Jones and Stanley Tucci help to make a brilliant story based of true events. The scenes with Hanks and Tucci are particularly of interest. The accompaniment for this film is beautiful and perfectly reflects the mood in each scene.\rOverall The terminals a brilliant film that deserves to watched, loved and appreciated by all."
    },
    {
      "rating": "10",
      "text": "I love this movie, it's has a unique atmosphere, which is delivered by directing, camera and great cast. Tom Hanks portreyed Viktor marvelously. This movie is something that I enjoy going back to and watching all over again."
    },
    {
      "rating": "3",
      "text": "Awful. Spielberg is a great director and Hanks a fantastic actor, we all know that. If, however, you were to take Spielberg's penchant for overly emotional schmalztz and channel that into Hanks' ability to emote you end up with this maudlin rubbish. Comedy can be farcial but should still be rooted in reality. The completely unbelievable nature of every plot point undermines any emotional resonance whatsoever. I give it 3 out of 10. It is still the product of a master of cinematic direction and very much looks like it. The minor characters are well cast and say something funny, every now and again. And, of course, Tom Hanks is extremely watchable. Honestly, if pretty much anyone else was cast in the lead role this films 2 hour duration really would feel like 9 months stuck in an airport terminal."
    },
    {
      "rating": "7",
      "text": "A lot of people panned this film, but I thought it was really cool if you could set aside reality. Tom Hanks did a great job (as always), as a man who visits New York from another country, and is not allowed to leave JFK airport or go back home. Stranded in the airport for almost a year he makes many friends (mostly from the janitoring staff) and falls in love with a history-obsessed flight attendant (Catherine Zeta-Jones). The movie is corny at parts, especially at the ending, but if you don't take it too seriously, I promise you you'll have a good time. Stanley Tucci is convincing as an a--hole. He almost always plays a--holes. I wonder why..."
    },
    {
      "rating": "8",
      "text": "If a lesser known director had made this movie, I doubt the reviews would be as negative."
    },
    {
      "rating": "2",
      "text": "This movie was inane and completely unbelievable. I expect much more from Spielberg and Hanks. A completely lame script has people acting in ways that make no sense. Huge disappointment."
    },
    {
      "rating": "10",
      "text": "Great!"
    },
    {
      "rating": "8",
      "text": "Why such the low rating? The Terminal=excellent!"
    },
    {
      "rating": "3",
      "text": "Could this be worse? One unbelievable plot point after another. Writing that only an idiot could tolerate."
    },
    {
      "rating": "7",
      "text": "Had some very good humor, Hanks did a really good job in this movie. It didn't have the clearest plot though."
    },
    {
      "rating": "7",
      "text": "While its script is somewhat flat and flawed, and some of the gags do not completely work, this film is still delightful and light-hearted enough to make us want to watch it over and over again. Another great performance by Mr. Hanks helps the film go up one step."
    },
    {
      "rating": "6",
      "text": "It's a good movie, don't get me wrong, just a loooooooooong and sometimes boring one."
    },
    {
      "rating": "5",
      "text": "The performances and premise are nice enough but the novelty wears off too quickly."
    },
    {
      "rating": "5",
      "text": "Não  um filme bom nem ruim,  normal, apesar de seu melodrama ser quase inevitável de fugir tem alguns momento bons para um filme com um roteiro fraco."
    },
    {
      "rating": "6",
      "text": "The biggest mistake in this movie is unrealism in some Scenes and some characters like Frank Dixon (the commissioner at JFK). Other than that the movie is good, especially Tom Hanks as a rusian-like foreigner is incredible. Also some jokes were funny, but some were stupid, because not realistic."
    },
    {
      "rating": "5",
      "text": "Meandering drama that drowns under the weight of it's own ridiculousness. There are some fun moments in here but it's clear Spielberg was reaching for something more high brow but everything just feels too on the nose and 'forced' that I never really felt any of the emotions from the poignant moments in it. Tom hanks feel wasted here I would've preferred to have seen hanks and tuccis roles reversed as the accent was far too distracting coming from Tom. Entertaining but vacuous."
    },
    {
      "rating": "8",
      "text": "How did i never seen this gem?So i was lucky on the last day on netflix i've seen this movie and i really enjoy it.The drama, comedy and feel good was great.Story : 10Drama : 6Comedy : 7Enjoyment : 8Easy to watch : 8Rewatchable : 10"
    },
    {
      "rating": "6",
      "text": "A good comedy, but nothing that we didn't saw yet. For Steven Spielberg I expected more. Tom Hanks did a great job, but for a comedy? There are people more fun and talented for this kind of movies. There are a drama too but it sounds like many other movies that I just saw."
    },
    {
      "rating": "5",
      "text": "Not a terrible film by all means, but one where it is easy to see why it would polarise viewers (as evident in the user reviews here) and why there are those considering it a lesser Steven Spielberg film.'The Terminal' is not Spielberg's worst film, to me 'The Lost World: Jurassic Park', '1941' and 'War of the Worlds' (which had a very good first half and completely fell apart halfway through and never recovered) are worse. Ranking it in his filmography, it is nowhere near close to being one of his best and while not rock-bottom to me it is lesser Spielberg.Starting with 'The Terminal's' merits, the production values are top-notch and Spielberg regular Janusz Kaminski's cinematography is once again beautiful and a major plus. While not some of his best work, John Williams' score is pleasantly understated and slick without over-emphasising the mood.Of the performances, which mostly are good, Tom Hanks makes a valiant effort in the title role and does an excellent job on the most part and Stanley Tucci clearly enjoys himself as Dixon. Hanks and Tucci's chemistry is where 'The Terminal' is particularly strong. The supporting cast are good, and Kumar Pallana is quite a scene-stealer (though the wet floor stuff does get over-used and repetitive).'The Terminal' starts off well. The story is intriguing, there is a razor sharp satirical edge to some of the comedy and there is an affecting whimsy.However, 'The Terminal' is hurt by the second half being nowhere near as interesting and Spielberg himself (regardless of his technical mastery) playing it too safe with a subject matter that should have been executed in the film more sharply and harshly. There is too much emphasis on the airport-terminal-as-microcosm-of-society angle and it just doesn't work because of how tentatively and safely the subject is approached.Credibility rapidly decreases and gets increasingly strained and too often replaced by the sentimentality going into saccharine overload. Really could have done without the romantic subplot, that was not necessary, felt like thrown in padding and was completely underdeveloped and featured far too much. The lack of chemistry between Hanks and Catherine Zeta Jones doesn't help, nor does despite her beauty Zeta Jones being so bland in a role that gives her practically nothing to do. The characters are also far too neatly black and white with stereotypes that won't bode, and actually hasn't boded, well with some.Overall, wildly uneven that had potential to be good but doesn't ever fully convince. 5/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "I love this funny film. It was superb. When I arrived in America. I didn't speak English. I had the same experiences such as meeting rude TSA officers and buying food with broken English. If you are a foreigner, you can laugh and love it!"
    },
    {
      "rating": "9",
      "text": "If you really want to see why Spielberg is uncommonly skilled, you have to strip away the extra storytelling weapons. Take the mundanity of, say, an airport terminal, and watch how he makes it appear so magical, sparkling, and alive."
    },
    {
      "rating": "4",
      "text": "The fake reviews on this site are just out of control! Tom Hank's attempt at slavic is just horrible to watch. I didn't give a shyte whether he made it out of the terminal or not by the end, and I cared more for Gupta's juggling tbh. The films also at least 30 min too long, and if you make it to the end like I did then you'll be dumber for doing so. Don't do it."
    },
    {
      "rating": "6",
      "text": "WHen it could've worked better as a grueling, tragically romantic indie-pic (which not to lie, i thought it was) turns into a happy-go-lucky Chris Columbus tale for the whole family, when i realized it was directed by Spielberg, it came to no surprise. BUt as magical as it comes off, doesn't ring with the same level of wonder as similar toned films such as \"Catch Me if You CAn\" or \"E.T.\"  Mainly because Hanks' character and the world in itself doesn't have enough dramatic juice to keep the steaks rolling, even though it plays like it does. In the end, you begin to retreat the hope and wonder that \"Terminal\" could've been a masterful exploration of an unnacepted immigrant and just fall into the seemlessly in-the-motions romancity that it plays off, so you go home with the splendor like it's Christmas Eve but without the substance it teased at providing."
    },
    {
      "rating": "8",
      "text": "This is a very heartwarming movie based upon something that really happened, although I wouldn't necessarily call it \"based\", but rather \"heavily inspired by\", still a very good movie. Someone experiences his mother country embroiled in civil war while he is stuck on a New York airport, which they only visited because of an old dream of their father. On the way the main character meets many friends, even someone he can love, but also people who just want to get rid of him. All in all a very uplifting movie, the eastern european played by Tom Hanks aside."
    },
    {
      "rating": "10",
      "text": "Just saw this movie for the first time here in 2022. I was blown away. Haven't seen a movie with a unique plot and genuine emotion in a long time. Fantastic all around."
    },
    {
      "rating": "9",
      "text": "A great **** movie, it's so underrated and all. The plot is great and I love it how we start to feel sorry for Tom Hank's character throughout this movie and how the people he firstly meets treat him and how they change throughout the movie. I'd have to say the cast are brilliant especially Viktor Navorski (Tom Hanks) and so is Frank Dixon (Stanley Tucci) he plays such a great villain throughout the movie. Also, I loved the side characters throughout the movie, they had some great scenes and they even had some funny ones. Finally, I think the score which was composed by the man himself John Williams is honestly beautiful and it works very well with most of the scenes they've been placed in but apart from one which doesn't work very well with the scene nearer to the end of the movie. Overall, it's a great movie and it's close to being a masterpiece in my honest opinion. It's got a brilliant plot, great characters, great acting, clever scenes, some hilarious moments from the characters and I could go on about how good this movie is. It's honestly worth the watch."
    },
    {
      "rating": "6",
      "text": "It's very slow but the acting saves it in most scenes could be shorter in run time."
    },
    {
      "rating": "10",
      "text": "The Terminal is Spielberg's most entertaining, funny, and romantic movie, all in one since Indiana Jones And The Last Crusade."
    },
    {
      "rating": "8",
      "text": "A good movie with humorous elements. A good family movie with a compelling story. With famous celebrities like Tom Hanks starring in it, I love watching this movie since it has such incredible performance. When I was kid, I frequently watched this, and I still adore it today. I adore all the oddities and memorable moments in this movie, which is almost comforting. One of those movies that you would kill to see for the first time again. This movie is a must-see, and I heartily recommend seeing it. This movie, in my opinion, is suitable for the majority of viewers' ages and doesn't have any flaws."
    }
  ]
}