{"id": 2789, "title": "The Animal", "starring": ["Rob Schneider", "Colleen Haskell"], "runtime": 84, "genre": ["Comedy"], "description": "When loser Marvin Mange is involved in a horrible car accident, he's brought back to life by a deranged scientist as half man and half animal. His newfound powers are awesome -- but their adverse side effects could take over his life. Now, Marvin must fight to control his crazy primal urges around his new squeeze, Rianna, and his rival, Sgt. Sisk, who both think he's one cool cat.", "releaseYear": "2001", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/oNxEXmKTZtECHs0bQbI6dQoXYMV.jpg", "categories": {"plot": 4.0, "acting": 4.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 4.0, "action": 5.0}, "reviews": [{"rating": "2", "text": "It doesn't have the feel of a feature film. It's boring, unfunny, stretched out cheese."}, {"rating": "4", "text": "What is the recipe for a great Rob Schneider comedy? Well, according to The Animal?s director, it?s a bunch of obvious jokes, a predictable ending, a sexy lady and a dorky hero who manages to be loveable and appeal to the hot lady for no reason at all. This director does not really understand a recipe for a great Rob Schneider comedy. This movie is simply a replay of all the bad ?dumb-fun? comedies from the past few years with a few more lame jokes added in and a terrible ending. Disappointingly, seeing Schneider jump around like a monkey, swim like a dolphin and leap like a leopard didn?t interest me, despite all the similes it can produce. Although The Animal?s premise does sound quite intriguing, it does not work with Rob Schneider and all the unfunny gags. As a smart, sophisticated comedy with worthy actors and a lot more clever quotes and comic scenes, this would?ve worked. Unfortunately, the chemistry sucks, the actors suck, the story sucks and the longevity factor sucks. This is just one big sucky movie that I can?t recommend even for teenagers and people who don?t look for quality in a film and just want brainless entertainment, you might like it. As any of the above, The Animal just really didn?t do it for me. Sorry, Adam, even your ?surprise? cameo can?t ?do it.?"}, {"rating": "4", "text": "Even though Rob Schnider does great jobs for Adam Sandler Movies, he doesn't do it in his own movies."}], "recommendations": ["the_watch", "the_longest_yard", "hubie_halloween", "zoolander_2", "30_minutes_or_less", "horrible_bosses_2", "the_wedding_ringer", "get_smart", "ride_along", "thunder_force", "welcome_to_the_jungle", "sex_tape", "baywatch", "scary_movie_3", "chips", "stuber", "dodgeball_a_true_underdog_story", "zoolander", "this_means_war", "paul_blart_mall_cop", "superhero_movie", "the_ridiculous_6", "forgetting_sarah_marshall", "masterminds", "old_school"]}