{"id": 2070, "title": "The Descendants", "starring": ["George Clooney", "Shailene Woodley"], "runtime": 115, "genre": ["Comedy", "Drama"], "description": "With his wife Elizabeth on life support after a boating accident, Hawaiian land baron Matt King takes his daughters on a trip from Oahu to Kauai to confront a young real estate broker, who was having an affair with Elizabeth before her misfortune.", "releaseYear": "2011", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/mCpYsKQNOtaBYJWCRYYuFmLsB6X.jpg", "categories": {"plot": 6.538461538461538, "acting": 6.153846153846154, "ending": 6.636363636363637, "soundtrack": 7.0, "cinematography": 10.0, "familyFriendly": 3.0, "funny": 7.181818181818182, "action": 8.0}, "reviews": [{"rating": "8", "text": "All performances in this movie were amazing, and the movie itself captures life with an uncommon grace. Funny, depressing, and moving, The Descendants is one of the year's best movies."}, {"rating": "8", "text": "George Clooney stars as the father of two girls (10 & 17), to whom he can't connect. This is thrown into relief because his estranged wife is in a life-ending coma. Although the previews would have you believe this is a dark comedy, it isn't. There's lots of tears and just because people cry a lot does not make it moving. The occasional laughs are provided by a teenage dude friend. Clooney's performance is one of his best and the rest of the cast is equally strong. Writer/director Alexander Payne has crafted a mature interpersonal drama set in the everyday world of Hawaii. While much of it is engaging, some of it is slow and flat."}, {"rating": "9", "text": "The Descendants is an emotionally resonant story that just happens to be consistently funny, touching, beautifully filmed along with the beautiful performances from Judy Greer, Shailene Woodley and George Clooney. And when all that is put together you have a beautiful picture of what a normal, real family is. I give this movie 93%."}, {"rating": "5", "text": "It`s a relaxing movie, but gets kind of dull and slow at time.If you just want to watch a movie while you eat, or drink something The Descendants will do just fine, but it`s not a movie that will blow you away, and keep you`re attention."}, {"rating": "9", "text": "This movie is fantastic! I love it! George Clooney did a good job. He nailed it! The way he talked and his body language was depicted very well. It is a beautiful story of a struggling father! The plot was done very well and so was the location of the story."}, {"rating": "8", "text": "I'm wondering if George is capable of choosing a bad script after the Batman & Robin fiasco.  It certainly doesn't appear so after enjoying The Descendants.  While slow in parts, the script and acting were emotionally intense, even by the two perfectly-cast children.  This powerful story of a man in mid-life having to come to grips with the unexpected, impending loss of his wife, the damage done to his daughters' upbringing and having to find a way to do the right thing after also discovering his wife had been cheating on him prior to her accident.  While George isn't the most versatile actor, this is the most human I've ever seen him.  He captured the pain, struggle, sadness and anger in his character so well that the final scene with his wife is so real, it can't help but bring on tears.  P"}, {"rating": "4", "text": "I left wondering what the fuss was about. Not awful, certainly, but nothing I would have recommended to others. I didn't feel any emotional connection to the characters - it was an oddly distant feeling film for such a personal story. Clooney is fine, as he typically is, but is a version of himself, again as he typically is."}, {"rating": "4", "text": "There is something going on in Alexander Payneâ"}, {"rating": "4", "text": "Disappointing! Overrated! Boring! This movie is one more reason to ignore all professional critics. The premise is interesting and the background story is encouraging but the plot takes us nowhere and leaves us with an ending totally unsatisfying.As far as awards season is concerned, I'll be upset if this movie or any of the actors wins anything and quite frankly I don't see how they can even expect any nominations. I was unimpressed with both of George Clooney's dauhgters and if Shailene Woodley is even nominated it will be a sad reflection on the state of motion pictures. Of course the drums are beating for another Clooney Oscar but quite frankly I didn't see anything  special in his portrayal of the main character. He was much better in the \"Ides of March\" and compared to his Oscar winning role in \"Syriana\" this performance is just ordinary. Both the real estate sale and the wife's final demise are too drawn out and by the end of this film I didn't care about any of the characters or what happens to them. If you must see this film wait until it's on HBO."}, {"rating": "10", "text": "The Descendants is one of those films that is a delight from beginning to end. It flits from happy to sad in the blink of an eye and from lung bustingly hilarious to serious in another. It's a film that is juggling so many themes and stories it would be easy for something to get lost in the shuffle but it never does. It is just a brilliant film from beginning to end.It follows the story of Matt King (George Clooney) and his daughters Alexandra and Scottie (Shailene Woodley & Amara Miller) who are thrown a curveball when their mother and Matt's wife hits her head in a boating accident and they discover she is never going to wake up. At the same time Matt is also dealing with the news that she was cheating on him as well as the sale of a huge chunk of Hawaiian land despite the fact he is having reservations. Not only is the story incredibly complex but the emotions are too with the characters being remarkably complicated with the character of Alexandra both missing the mother she lost while at the same time hating her for the last time they spoke. The conflicts and decisions made in this film feel real because they are handled so delicately by director Alexander Payne. The decision of when and how to tell Scottie about what is happening or how Matt reacts to the news his wife was unfaithful play out in unexpected yet understandable ways with the latter being both tragic while at the same time undeniably funny. Its a fine line that Payne has always been able to walk, much like in Sideways. His ability to make even the most depressing of news hilarious just by the way he works the camera or dresses the character. The Descendants may not be a comedy but believe me, it is hysterical in places. The supporting cast is perfectly cast with a few surprises. For instance comic actress Judy Greer plays the wife of Matt's wife's lover and is fantastic playing against type especially at the end of the film. Matthew Lillard is equally impressive as he proves he can be more than the stoner best friend or the crazy killer. However the film belongs to Clooney and Woodley who are just fantastic as a man trying to accept his responsibilities as everything falls down around him and the new matriarch, trying to protect her sister the way her mother would have. They both give captivating performances and the scenes they share are the best in the film. The film is long but never longer than it needs to be with every scene serving a purpose with most scenes having some emotion hidden beneath the surface. Even the landscapes and establishing shots give meaning to the film with the islands that make up Hawaii serving as a secondary character. The film is as much about heritage as it is about grief or betrayal. The Descendants is a story that has so many great moments and plot points that its easy to forget the point of it. Luckily Payne reminds us in a final shot that is both uplifting and sombre. It's his best film yet and easily one of the best of 2011."}, {"rating": "4", "text": "I went to this movie because of the director and GC who is always good at his craft. While the film itself is shot well and draws you in, at the end I was left wanting. The trailer made me feel the laughs would be steady throughout, but I found my wife and I laughing at how depressing the movie would get at times. I am guilty of expecting something as good as Sideways (which is in my collection and I've watched several times). I know it will garner award nominations, but all I felt afterwards was depressed and in need of a pick me up. Go back and look at the trailer after viewing the film and tell me I'm wrong."}, {"rating": "10", "text": "Clooney gives a great performance, and it made me want to go to Hawaii. I wish the characters were more likeable, though. http://luhathoughts.blogspot.com/2012/01/moments-of-bittersweet-alohas.html"}, {"rating": "2", "text": "After an hour, the movie hinted that it might get interesting. It did not. I can not understand how anyone could enjoy this movie. The scenery was good and the music was tolerable, so I'll give it a 2/10."}, {"rating": "4", "text": "I am very surprised at the positive reviews after just having watched this film.  The acting feels forced throughout, as if poorly directed.  Clooney's performance is superb sometimes and weak other times.  Many dialogues feel contrived.  The film fits nowhere: It is not quirky enough, not funny enough, not dramatic enough, not serious enough, not realistic enough, not anything enough to have an identity.  Nothing is unique or special about the movie.  It left me with no feeling at all - numb and bored."}, {"rating": "4", "text": "First, I have loved Payne's previous movies, in particular About Schmidt.  The problem with this movie is it felt like he was just trying to recreate the same movie in Hawaii.  And as much as I like George Clooney, he wasn't believable as an everyday Joe.  However, in About Schmidt, I bought Jack Nicholson as an everyday guy from Nebraska who was seriously depressed about his life.  I didn't buy Clooney as a father, or as a a husband struggling to understand what went wrong in his marriage. His performance felt forced, in the way he walked, talked, and other mannerisms, clearly placed by the director, but not believable coming from Clooney.  It actually was distracting from the plot.  I agree with other reviewers about not caring about the characters (with the exception of the daughters).  And this is what separates Nicholson's character in About Schmidt from Clooney's.  Despite Schmidt being completely oblivious, ignorant, and probably a poor father and husband, by the end of the movie you genuinely care for him.  I felt none of that in this movie."}, {"rating": "7", "text": "The Descendants is a very touching movie, because the level of reality of the situation that is living the King family is huge. A man whose job absorbs all his life is punch in the face by the accident of his wife, so he must take care of her two daughters, the older one has difficulty relating to her family and is immersed in drugs and alcohol; and the little one is following a bad life example. In the other hand the protagonist is in charge of a big piece of Hawaiian land, and has to deal with his cousins if they sell it or not.The character of Matt King is very interesting, because we see a man that thinks that has all what he wants in life, but the accident is the warning alert that returns him to earth. In that moment Matt discovers that he has nothing, so in order to recover what he had or believes that had; the protagonist must rediscover himself, but he must take with him, her two daughters. This process contains forgiveness and vengeance, truth and lies, and happiness and anger.The Descendants is a little bit slow and in some point it stagnates, but the charming performance of George Clooney, the delightful screenplay (won an Oscar) and the amazing direction of Alexander Payne, takes this film to the top. Sometimes a picture is worth a thousand words."}, {"rating": "10", "text": "Best movie of the year. There was not too much competition though. The acting was the best of the year and the whole movie just felt real to me. I thought it might be too sappy for my taste, but it wasn't too bad in that department. At some parts, I actually laughed. Overall, a must see."}, {"rating": "4", "text": "I watched it because of the high criticisms it received, but during the last hour or so, I really kept my finger from switching off the DVD player. What was the meaning of all this ?? And why all the fuss ? Classic scenario and nice scenery in Hawaii was all. Really mediocre movie."}, {"rating": "7", "text": "Pretty good film, Alexander Payne has come a long way as a storyteller since 'sideways', if your familiar with that film then you will know what to expect, although this is much more watchable. Clooney is less irritating than hes been in a long while, the story of family turmoil has been seen a million times before, but is well told, however, the ace card here was the decision to base it in hawaii, if it had been set, in say, pittsburgh, it would have been just another humdrum family tragedy movie, Payne doesn't waste the opportunity and uses the gorgeous scenery to good effect, the laid back feel of the islands also helps to compliment the pace of the film, its leisurely but never really boring. Clooney says at the beginning of the film that people on the mainland assume those on hawaii are living in paradise and don't feel loss or pain, they do, of course, but its a much better place to deal with emotional disasters than a bedsit in **** in january. Well written, directed and acted, not quite the Oscar winner, but definitely a decent film."}, {"rating": "9", "text": "Really great film! George Clooney gives the best performance of his career. Nominated for 5 Academy Awards including Best Picture, Best Director, and Best Actor. One of the absolute best films of 2011."}, {"rating": "5", "text": "The Descendants was a huge disappointment. After hearing of all it's critical acclaim-specifically George Clooney's Oscar nomination, my expectations were set fairly high. I was expecting an eventful and grabbing film but instead I was left bored, uninterested in the characters or the plot and ended up turning the TV off an hour into the movie. The acting was mediocre and the plot was boring as hell for those who could not relate. I did not create a connection with any of the characters and felt like I was getting an inside scoop into the life of a very average man. Sorry Clooney, no charming me in this one. Very disappointed."}, {"rating": "3", "text": "What movie did all these other people see that they liked?  There is little about this film that is enjoyable.  Some good acting performances is all I could muster to say positive about this.  None of the characters are either believable or likeable.  And why did they have to put the \"F\" word into the mouths of 7 year olds just to make this an \"R\" rated film.   WEAK"}, {"rating": "10", "text": "Excellent casting, setting, plot, pacing, and performances. A movie which really makes you step back and look at yourself as well as the world with a different perspective. Clooney's performance is superb; the characters can be easily related to, as well as their troubles, and their constant struggle to do the right thing. Typically my reviews for movies are quite loquacious, but with such a well-made movie as The Descendants, I've found myself nearly speechless, there's really not much more one can say other than \"wow!\""}, {"rating": "10", "text": "By no means should North Shore be confused for an accurate depiction of life in Hawaii. The 1987 film about an Arizonian surfing champ who nearly wins the Pipeline Masters, however, is honest enough to depict the racial strife that sometimes exist between the mainlanders and the locals. Rick Kane, oblivious to the tricky dynamics that govern the Hawaiian waters, rebuffs the advice of two seasoned surfers(who in a colonial context, are outsiders) to vamoose, when the \"hui\" suggests that he may be infringing on their turf. \"He's so haole, he doesn't even know he is haole,\" one wave rider complains. To put it more succinctly, Rick is \"haole as s***\", to borrow a phrase from Matt King in The Descendants. Chandler, a longtime board-shaper and resident, who despite being white like his protege, knows the island's stormy history, and explains to the political naif that his victimization(a local boy steals his stuff) pales next to what the Hawaiians lost during the transference of land ownership, the meat and potatoes of colonization. North Shore, warts and all, is redeemed by having a conscience that nearly matches the white guilt of The Descendants, in which Matt's diatribe about skin color, also extends to language, admitting how his clan \"can't even speak pidgin, let alone Hawaiian.\" Just before this searing self-critique, the filmmaker shows the land baron alone in a special room that contains old photographs of his ancestors, the people who made this generational inheritance possible, set to soft indigenous music that, depending on who you are, adds to the scene, either a sense of harmony or dissonance, in regard to the tradition of land stewardship. When Matt ends his backyard speech to the kinfolk with the assertion that they have \"Hawaiian blood\", that they are, in so many words, indeed local, The Descendants may still be deemed by some as being a film about the problems of privileged white people, a la Sofia Coppola's Somewhere. Despite the filmmaker's good intentions, is the King family Hawaiian enough to escape such easy ghettoization, the same upscale zip code where The Royal Tennenbaums reside. As the family takes one final look at their property, acres upon acres of verdant green that reaches, in both directions, the rolling mountains and crystal blue seawater, some will bristle a little when Scottie laments that she missed out on the King family tradition of camping with their comatose mother, like elder sister Alex before her, as if it was a tragedy on par with genocide. Although Matt takes great pains toward not instilling a sense of entitlement in his daughters, when he says that \"in Hawaii, some of the most powerful people look like bums and stuntmen,\" don't forget that he's including himself, not just his cousins in the boardroom, or Hugh, the unassuming barfly at that locals only hangout. In spite of himself, good man and all, there's still a whole lot of pride, and perhaps, a little hubris in Matt, as he surveys his kingdom from a cliff where King Kamehameha may have once stood.  But to the lawyer's credit, he's upfront about his soft-hearted tyranny, admitting in all honesty that \"we didn't do anything to own this land,\" and yet, it's not as if he would give the soil back to the rightful descendants, the homeless Hawaiians, whose forefathers were overrun by foreign interlopers who used religion as a weapon, soon after washing up on island shores. In George Roy Hill's Hawaii, a flawed, but relatively accurate portrayal of how an indigenous group of people lost the war against progress, it's one of the Hawaiian gods, surprisingly enough, not Jesus Christ, who makes his presence known, following the death of the \"alii'nui\", by creating a windstorm that all but blows away the Christian church ministered by the unctuous Rev. Hale. More importantly, as it relates to The Descendants, the 1966 film explains how a man like Matt could inherit such obscene wealth, in a scene where a preacher is expulsed from the ministry for marrying a native woman. \"My wife has bought me several thousand acres of prime land,\" he brags. Still, Hawaii is, by no means, historically accurate. The Hawaiians, inexplicably, don't surf. Just like Matt, who hasn't picked up a board in fifteen years, according to the island chain's unlikely spokesman. Unlike the aforementioned films, Soul Surfer, the inspirational true story about Bethany Hamilton, all but whitewashes the precedence of a self-governing island nation by filling the screen with nary a brown face. Not so coincidentally, the film is faith-based. And yet, one of the gods from Hawaiian folklore accidentally makes a subtextual cameo, in which chanting can be heard over the soundtrack during the shark attack, suggestive of Mano, avenging, perhaps, the wholesale death of his people. Whereas Bethany lost an arm, and the King family loses a wife and mother, the Hawaiians, in the end, lost everything."}, {"rating": "4", "text": "there is nothing, even superficially, original about this film. I don't understand how could anyone call this the best of the year. we see bunch of movies like this every year. it's good, people should definitely see it,it's not a terrible waste of time or money, but it is nothing special really."}, {"rating": "8", "text": "Alexander Payne's \"The Descendants\" is.....exquisite, if you would describe it. George Clooney gives it's best as the helpless father with 2 rebellious girls, having his near-dead wife in the hospital and being pressured by his greedy family about signing a land contract that will make **** go real. The story is very smart. It gets funny sometimes but melodramatic otherwise. I recommend it to the smart moviegoers."}, {"rating": "7", "text": "Don't get me wrong, this is a well made movie.  The script is good, the characters are well developed, the views of Hawaii are beautiful.  However, I think it suffers from pacing problems, in that it's constantly moving at the same speed.  There is no tension, there are no dynamics, the characters simply play events out under a blanket of ukelele music."}, {"rating": "2", "text": "To think this movie got its Academy award for Best Adapted Screenplay, of all things. I would say its script is among the worst of its features, and there is no shortage of bad features \"The Descendents\" boasts. From the cringeworthy dialogues, to the placid performances of underwritten characters, to the cliched ending, it's a snoozefest of terrible. The voiceover is tacky and disappears mysteriously halfway through, having served its expository goal. There are F words aplenty, none of which coming naturally from its utterers - be it preteens or the always charming but never offensive Clooney. The exchanges are forced and bland. The development of character, if any, feels forced as well - one minute somebody does something portraying him in one light, the next - its opposite, there is no gradualness or shades.I felt Clooney gave a good performance given the material he had to work with, and I was happy enough with Shailene Woodley. Somehow they even managed to get the score wrong, even though its Hawaiian music over a movie taking place on beautiful Hawaii.All in all, I was utterly disappointed, maybe I got in with the wrong expectations on the back of so much critics' praise (are they being paid by the studio to marvel in such drivel? I can find no other explanation for so many 10/10 scores in the face of such gaping chasms in the bowels of this movie) and award nominations. Don't make the same mistake."}, {"rating": "5", "text": "I didn't get it.  It was a good story about a family in transition.  The girls who played the daughters were pretty amazing.  In the end though I just was not into the characters.  It will probably win a lot of awards.  It will again leave me shaking my head."}, {"rating": "10", "text": "The Descendants is the movie you see if you've lost faith in the ability of Hollywood to make really good movies with depth, feeling, and mastery of the craft. Payne is amazing, and we all know it.  Sideways is one of the all-time greats, and even though this one doesn't quite scale those heights, it's incredibly good. The choice of actors is pitch-perfect - even some of the non-speaking roles (hello Sheriff Truman!) contribute tangibly to the fabric of the film.  I won't discuss any particulars of the story so as not to spoil anything, but the Oahu/Kaua'i scenes with the island music are wonderfully rich.  The islands are almost characters themselves. See the film."}, {"rating": "5", "text": "A \"could have been\" movie which failed miserably to redeem Clooney from his glory-seeking excesses. Clooeny's ego is way too big and jarring for this non-role in a non-story. He still has a long way to go to reach the class of actor-turned-director Clint Eastwood, who has enough true inner maturity and confidence to let fellow actors AND actresses shine through. Clooney the over-aged Little Prince doesn't understand fatherly responsibility, nor what being a truly loving husband means. He confuses self-pity with signs of empathy. Being a pushed-around and self-indulgent even as one's life partner is about to die is just..a bore. The lead character is just a prolong case of poor me why is this happening to me - about having to face his much-neglected family females, being \"bullied\" by his daughter and her seemingly vacant bf (yet seeking his opinion on managing his daughter from the teen idiot). Failure to assert entry-level parental authority at foul-mouthed teen children at a time when the family unit need it the most, is not adorable, nor does it score sympathy points. Scr3wing harmless relatives business agreement last minute self-righteously because one suddenly needs to feel some moral superiority about some grant notion is just super lame and NON-heroic. There are other ways to show that one's suddenly a true noble, like saying nice sweet gentle romantic spiritual things to wife in coma for a change, instead of meddling in other people's family affair and attracting a angry jilted wife into the ward and create drama before the near-dead wife. If he's a real man he should not allow the busybody daughter to drag him into a face-off with the non-consequential ex-lover of his neglected wife. The fact that Clooney's character was forced to grow from a psychological age of 15 to 18 because his wife has \"abandoned\" poor little self-involved him and leaving him with two difficult daughters and a huge fortune, or that he acts sort-of selfless trying to get wife's ex-fling to see her at her dead bed, doesn't make him a very interesting nor likeable person, nor does it make it a worthy story. He is a petty little prince who spent more screen time spitting venom at his departing wife and her harmless best friend, than being nice to the wife, a caricature of a role who could not talk back at him or defend herself. From start to end, it is about how HE feels, and not about HER. This is a man who is deeply interested in himself, which was supposedly the story problem, even as he pretends to care about something greater than himself as the story progresses. At the end, it remained all about him, how tough it is to do basic father/hubby thing, and his petty little ego injury. Clooney's shallow performance of self-pity as \"feelings\" demanded so much screen time, even the potentially interesting Electra archetype daughter character failed to emote beyond 1-D sullen self-involved teen princess to a real 3D human female. Still, her good looks plus at least five bikini changes, and lush beautiful Hawaii island scenes somewhat redeemed the boring subject of Clooney non-character and non-emotional journey."}, {"rating": "8", "text": "Everyone loves Clooney. And when I think of his other performances -- even in less-appreciated films like \"Solaris\" and \"The American\" -- I am not sure why this one got him an Oscar nomination. However, this film as a whole is moving and interesting. The characters, even the kids, have layers that are revealed gradually. It lacks the off-the-wall hilarity of \"Sideways,\" but does provide chuckles along with some tears."}, {"rating": "10", "text": "'The Descendants' is an amazing portrayal of a family whose life is shattered when the mother of the family lies in a coma. It's central themes of fatherhood and grief are dealt with in a sensitive and powerful manner. Very few movies of 2011 can come close to this kind of filmmaking."}, {"rating": "8", "text": "Although I didn't enjoy this movie as much as Sideways, it is still an enjoyable slice of life.  The pace is slow and a little too even-keeled, but the acting is good throughout.  I also thought it was just a little too predictable.  I was a little disappointed by all the cussing throughout the film and I'm not a prude.  I just thought it was unnecessary.  The scenery was beautiful, of course, as it is set and filmed in Hawaii, and the Hawaiian soundtrack almost lulls you to sleep at times.  Overall I enjoyed it but I don't think it's the best movie I've seen this year."}, {"rating": "5", "text": "The Descendants manages to take a potentially compelling story and drain it of much interest. The cuckolded husband comes across as merely clueless and his daughters as foul-mouthed brats. As for the storyline about the inheritance, it seems tacked on. This is a confused movie that could have been so much better had the writers been more skilled. It wasn't helped by Clooney's overacted comic moments."}, {"rating": "2", "text": "None of the characters touched me one bit. All unbelievable Mr Clooney plays his usual unemotional, twitching, sad sack (there have been notable exceptions-he was great in \"Oh Brother...\"). The kids were okay but what is the deal with every other word out of the young one's mouth is **** Is that supposed to be funny, when children swear, and dad gives an exasperated look? Maybe they wanted an R rating to pique some interest. What is the purpose of the boy friend? His character is inane. Perhaps the grieving daughter could get support from him; no way with this guy; every fathers nightmare that your daughter brings a guy like this home. And where was his family? He spent every minute with the Clooney clan. Mr Forster is good as usual. Once again the wrong person is blamed for the affair; in this case the man. The wife is absolved of all responsibility because she is dying, when she wanted to have the affair and cheated on her husband; but f course he feels guilty. Mr Clooney's Matt finally has time for his wife and falls in love with her in the coma, even though she lied and cheated on on him. We \"see\" no background just an occasional reference to his being too busy. Drama? Comedy? I could not have cared any less about the ridiculous back story (someone please help Mr Bridges to find meaningful work). You go to the trouble to make a movie in Hawaii and almost no one talks, looks, or feels Hawaiian ( except the beautiful scenery). Uninteresting people, uninteresting story, no emotion, no one to root for. It's a mess. Amazing how so many critics loved this film. Mr Clooney certainly has a stranglehold on Hollywood."}, {"rating": "5", "text": "Did you see \"Up in the Air?\" Probably, so don't waste your time with \"The Descendants.\" Clooney plays more or less the same person: a middle-aged man, who recently prioritized his love life in an attempt to make amends for past mistakes, only to find the one he loves is cheating. Clooney embarks on a search for understanding and forgiveness, which eventually brings him closer to his estranged family. La-de-da. This film, though not entirely bad, is up for Best Picture only because of the weak field this year. \"The Descendants\" would have had trouble keeping its head above water in last year's Oscars field."}, {"rating": "3", "text": "Renter. I nearly left the theater and in hindsight, wish I had. The pace of this movie is extremely slow. Unfortunately the slow pace does not include significant character development or storytelling. Certainly enjoyed the beautiful Hawaii scenery and Clooney has a great narrator's voice but this project would have been much better suited to a made-for-tv splash vs big screen."}, {"rating": "4", "text": "THE DESCENDANTS: DISGRACEFULGIVE IT A TRY IF... You really canâ"}, {"rating": "3", "text": "I like George Clooney. I really like Matthew Lillard. This movie just isn't much emotionally, spiritually or even artistically. There are some nuanced moments that work, a bit of Alexander Payne's trademark irony in scenes, sure. But this was a tough 2 hours to sit through. It's a depressing film about people struggling with little or no humanity. It doesn't have a pulse. The photography and production values are dreary and uninspired. George Clooney struggles with the Oscar clips, and comes off like a bloke(a likeable guy, but he really is just an aging good looking dude.) There are no great lines. It's actually super misogynistic about the youngest daughter, the 20 something daughter, the realtor's wife and the wife in the coma."}, {"rating": "2", "text": "This movie seemed to be about finding out how many times God's Name could be blasphemed and how much cussing and swearing could be vomited from the mouth of children, NONE of which was of any use to the already boring movie. If you like to be depressed and love to hear vulgar language, then this movie is for you."}, {"rating": "3", "text": "Awful. I had to turn this movie off after 39 minutes. No movie can redeem itself after that much crap.The performances were extremely inauthentic - I couldn't stop cringing at how much it felt like an amateur play. The \"actor\" who played the daughter's friend can count his performance as one of the worst in recent memory. I wouldn't be surprised if he was plucked off the street and told to act stoned. Oscar nominated?....That confirms what I already knew. I'm totally baffled that so many critics and users enjoyed this abominable turd."}, {"rating": "3", "text": "This movie was nominated for best picture?  Oh for the days of Spencer Tracy and James Stewart.  The movie did not have one breakout scene. I did not laugh. I did not cry.  Clooney nominated for \"best actor\"?His emotional range goes all the way from A to B. There was nothing in the movie that made it stand out, unless you count all the vulgarities from the 10 and 16 year old!!  Hollywood is in trouble. They are trying to manufacture stars and hype great movies. Didn't work here!  At least it only cost us $5.00"}, {"rating": "5", "text": "It has high scores because it is more an art film than hollywood film. Those art films all have high scores because they appeal to a small independent segment. This film will find such an audience. It is enjoyable but long at times, but didn't feel long in the end."}, {"rating": "8", "text": "No question the acting is tremendous as you feel as if you are looking in on a real family drama.  If you like dialogue without any action then this movie is your cup of tea.  The negative is you know where it is going five minutes into the film as there are no real surprises.  It is a one pace film but the cast is tremendous.  And the scenery breathtaking."}, {"rating": "6", "text": "The descendants is an ultra polished and extremely well acted film by George Clooney. However it is also very lacking. The film did not involve it's audience or build a sense of pathos for Clooneys character. In a film like the descendants the viewer must be enaged by the dillema the main characters are feeling otherwise the supposed tear jerking moments feel fake and cued. This is the descendants only problem but it is enough to stop it from being a good or very good movie."}, {"rating": "10", "text": "Hard to fathom the slew of 100 marks by professional reviewers for this film. All actors great. Story with undeveloped potential, bland instead of brilliant. We were dropped into this melodrama and given insufficient reasons to care about outcome but it's worse than that: we knew outcome of the land decision and the comatose wife, all telegraphed well in advance. When Matt leans over his wife to say goodbye to his best friend, his pain etc, it's a beautiful speech and absolutely without foundation in what we've been let in on for backstory. How hard would it be to show us some of this love in flashbacks. Same for her relationship with her daughters. Who were these people, really? Read the book, I guess."}, {"rating": "8", "text": "The Descendants is a good not a great movie . Overall i enjoyed the film with its interesting characters, some being quite annoying though . I usually am not a fan of George Clooney but i though he did a wonderful job in this film"}, {"rating": "2", "text": "Absolutely lame.  Uneventful, boring, and self-absorbed.  The writers try in vain to express human pain through cinematic garbage.  Clooney's character is the worst father and must be a concoction of today's liberal version of what a father should be like.  Best film of the year?  Possible since most films made today are terrible too."}, {"rating": "9", "text": "At times it could be melodramatic, but this was both hilarious and heartfelt in classic Alexander Payne style.  Total sidenote: who knew Shailene Woodley could act?  That was a shocker..."}], "recommendations": ["manchester_by_the_sea", "up_in_the_air", "marriage_story", "blue_valentine", "collateral_beauty", "revolutionary_road", "me_before_you", "the_glass_castle", "the_hunt", "into_the_wild", "the_intern", "silver_linings_playbook", "the_florida_project", "legends_of_the_fall", "closer", "the_fault_in_our_stars", "blue_jasmine", "the_curious_case_of_benjamin_button", "leaving_las_vegas", "lady_bird", "her", "the_impossible", "gifted", "captain_fantastic", "fences"]}