{
  "id": 1875,
  "title": "The Empty Man",
  "starring": [
    "James Badge Dale",
    "Marin Ireland"
  ],
  "runtime": 137,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller"
  ],
  "description": "Retired cop James Lasombra is asked by a friend to investigate the disappearance of her daughter, who seemingly packed in the night and left an ominous message on the bathroom mirror - \"The Empty Man Made Me Do It.\" As he investigates this mysterious figure further, James begins to see and hear strange things, and is forced to come to terms with his past and what it means for his future.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8apzu9JFTUMtOpYkHk6LNPOs3pY.jpg",
  "categories": {
    "plot": 6.25,
    "acting": 5.0,
    "ending": 4.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "It's fun to see a film that with its own title, unknowingly lends itself to the joke that a lot of people will use in their reviews, because for all intents and purposes this was a dud. Apart from its excessive duration, its biggest problem is its lack of conviction and it's not that the atmosphere and the tone have been a waste, however both never manage to be convincing and if you're trying to sell a monster, it has to be convincing no matter what. Perfect trifecta of irrelevant beings with Slenderman and The Bye Bye Man."
    },
    {
      "rating": "0",
      "text": "To those who pay to see this in the theaters, you have my sympathy.  The most boring 2+ hours I've ever spent watching a movie.  This movie isn't confusing, it's completely confused.  No scene carries any consequences from previous scenes.  It's like a channel surfing eight year-old wrote it."
    },
    {
      "rating": "2",
      "text": "Pretty good first 10 minutes.  Rest of the movie is boring and makes no sense.  What is the Empty Man?  Movie never explains so it feels like all the time is wasted."
    },
    {
      "rating": "8",
      "text": "Larga, algo lenta, misteriosa, psicológica y una historia y contexto que tiene similitudes con la película Slenderman, con la diferencia que The Empty Man si es una buena película y Slenderman no tiene sustancia y llegó 10 años tarde.No le tenía ni una pizca de fe, pero me gustó mucho pese a que es a mi parecer demasiado larga para una película de este tipo (137 minutos)"
    },
    {
      "rating": "10",
      "text": "Criminally underrated, \"The Empty Man\" is epic and visionary, existential horror dialed to 11. This is without doubt one of the creepiest movies I've ever seen.  Don't let the title fool you, or if you are going to think about it terms of other \"... Man\" films, think \"The Wicker Man\", because that's the only one worthy of being mentioned in the same breath.The never ending loop of expanding and contracting possibilities, experiences and visualizations that are established in the nightmare logic of the film will rattle your bones and make \"your brain itch\". The sound design is stunning and terrifying....like it was piped in directly from hell itself.The film went through quite a difficult process to get released, and terrible marketing choices (and trailer) took a toll, but ratings average will surely continue to increase over time as it finds the audience it was actually intended for. This is a guaranteed to be a future monster cult hit. \"The Empty Man\" has a very high rewatchability factor...it's a film that will invite and hold up to multiple viewings....if you like deep horror, get one in as soon as possible!"
    },
    {
      "rating": "7",
      "text": "Twisty, horror film is more in the reign of 'Jacob's Ladder' and the like, a slow burn thriller with a surprising twist.  It has since become a cult classic and it deservedly so. Not everyone's cup of tea for sure."
    },
    {
      "rating": "7",
      "text": "I feel this got negative reviews early on because 20th Century had no idea how to market it. It’s a 2.5 hour mainstream horror film that is both cliche and ambitious. Worth your time if you like the Midsommar-type horror films that emphasize atmosphere over jump scares."
    },
    {
      "rating": "1",
      "text": "Nonsense. Starts out interesting but the story falls apart minute by minute. It's a long film too at over 2 hours. The ending is total nonsense. Don't waste your time."
    },
    {
      "rating": "2",
      "text": "Long, boring, dragged out and utterly confusing with a whole bunch of loose ends that lead up to a whole lot of NOTHING! It was also unnecessarily long which just added to the pain of suffering through this brutal film!"
    },
    {
      "rating": "7",
      "text": "Surprisingly good. I don't get any of the negative reviews. In these times of lock down new movies are limited specially if you watch a lot of movies often. The Empty Man did a good job at making the movie interesting with its plot. I would recommend watching this movie. Is by no means a terrible movie. A solid 7/10 from me"
    },
    {
      "rating": "7",
      "text": "Great mystery thriller, melancholic atmosphere, an actually creepy entity, lovecraftian themes and story structure, great score. What's not to like about it?"
    },
    {
      "rating": "5",
      "text": "Former detective investigates missing girl and finds out that she's involved in a cult that worships a possessed guy in a coma before getting possessed himself."
    },
    {
      "rating": "10",
      "text": "One of the greatest horror films ever made. Deep, dark, terrifying with fantastic direction and music. It has tons of ideas and themes that are all so captivating and the visual connections are phenomenal. Don't have any issues with it. Definitely check it out it deserves your time."
    },
    {
      "rating": "10",
      "text": "Impressive scope and structure. Brave genre hopping story. Deserves more hype. The negative reviews are from people whos expectations were based on the trailer. Bad marketing, great film."
    }
  ],
  "recommendations": [
    "midsommar",
    "hereditary",
    "bird_box",
    "chernobyl_diaries",
    "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_",
    "it_follows",
    "malignant",
    "host",
    "the_medium",
    "the_descent",
    "dark_skies",
    "antebellum",
    "devil",
    "the_collection",
    "the_mist",
    "the_pyramid",
    "enemy",
    "the_cloverfield_paradox",
    "the_conjuring_the_devil_made_me_do_it",
    "summer_of_84",
    "pandorum",
    "the_purge_election_year",
    "the_witch",
    "annabelle",
    "get_out"
  ]
}