{"id": 311, "title": "The Book of Life", "starring": ["Diego Luna", "Channing Tatum"], "runtime": 95, "genre": ["Animation", "Adventure", "Comedy", "Family", "Fantasy"], "description": "The journey of Manolo, a young man who is torn between fulfilling the expectations of his family and following his heart. Before choosing which path to follow, he embarks on an incredible adventure that spans three fantastical worlds where he must face his greatest fears.", "releaseYear": "2014", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/aotTZos5KswgCryEzx2rlOjFsm1.jpg", "categories": {"plot": 7.131578947368421, "acting": 7.833333333333333, "ending": 4.0, "soundtrack": 7.5, "cinematography": 6.333333333333333, "familyFriendly": 8.0, "funny": 7.0, "action": 7.0}, "reviews": [{"rating": "8", "text": "The film combines life and death with heavy Halloween theme, Mexican culture and folklore might look a bit weird but overall a successful animation to draw the attention of family audiences. Its complexity offers a fresh potential to be creative, but there is slight imbalance on the story development between the unnecessary slow-pace first half and the too-fast progression towards the end. Unexpectedly, the surprising good choice and entertaining musics, colorful visual stunning feast and delightful romance are more than sufficient to make the film to be beautiful and refreshing. This joyful and crowding story about love, family, honor and friendship delivers a strong message that learning to forgive and to be yourself, love will truly live."}, {"rating": "7", "text": "Mexican folklore is brought forth in a movie perfect for families. It's got comedy, romance, and action. It's lacking in any real morals and the romance is totally predictable, but it's funny and unique enough to be worth a watch. The world is gorgeous and the characters look like marionettes come to life.\r While it may not be good enough to compete with the best Pixar and DreamWorks have to offer it's still good enough to be worth watching with the kids on a family movie night. The plot might not break new ground, but it's a memorable movie thanks to it's use of Mexican culture. One I recommend watching."}, {"rating": "10", "text": "The movie is a blast, loads of color, great music, bullfighters with a sense of humor! Overall it is a heartwarming movie with a lovely story about heroism and getting the girl no matter what."}, {"rating": "8", "text": "Delightful, funny and visually innovative. Not too distant from the feel of Frozen and Tangled, but with a lovely Mexican ethos and Del Toro's customary startling mythological beasts and spectacular 3D.  Loses a bit for average music and a bit too much go girl cliche, but makes up for it with some engaging support characters. A lot of fun, and ok for kids."}, {"rating": "8", "text": "Producer Guillermo del Toro and Writer/director Jorge R. Gutiérrez create a beautiful,stunning visuals of a virtual astonishing animation world. Zoe Saldana is stunning and nails it as Marie, Tatum is not the best characters of this movie. But still.Diego Luna is one of best characters throughout he is  kick ass  playing  Manolo. Here is the negatives: The movie is predicable and sometimes this movie sucks cause of the cliche's also the stupid humor. Grade A-"}, {"rating": "9", "text": "Beautiful visuals, lots of humor, excellent character definitions and an amazing soundtrack. There's nothing not to love about this movie! It doesn't exaggerate and provides you with a heartwarming tale."}, {"rating": "9", "text": "It's not 2014's best offering... But it's really damn close! The animation is fantastic, the characters are highly memorable and the story ain't half bad either, a must watch Halloween classic indeed."}, {"rating": "7", "text": "It has it's moments but the movie didn't deliver too much comedy. It's more action which that's what I like in a animated movie. The book of life is not perfect but it's definitely worth it. The designs were great too."}, {"rating": "10", "text": "A beautiful film from the inside out! Visually stunning, with tons of heart and humor, excellent character design and very strong female leads! A great celebration of the art and culture of Mexico, but also accessible and enjoyable for everyone. A must-see."}, {"rating": "9", "text": "The movie might be perfect if these 3 points have been taken into account:\r 1.- The characters singing in a movie are always leftover and even more if it is covers are misunderstood.\r2.- The scene of children at the museum is irrelevant and had no reason to be.\r3.- The history should be focus more time on the land of the dead than of the living.\r Everything else is perfect and the art of the characters are beautiful."}, {"rating": "7", "text": "The Book of Life is charming, entertaining and lively, accessible for audiences, but disappoints slightly on the front it promises to be more than it is with a plot and moral message that's muddled. That said, the eye-popping visuals are overpowering enough to gloss over my complaints and the soundtrack and voice acting is fantastic. The way various different elements of Mexican arts and culture are interwoven into the storyline is clever and intriguing and puts a fresh spin on its all too familiar plot. A good movie overall - a shame it couldn't quite achieve the greatness a more solid story could have reached."}, {"rating": "8", "text": "I didn't expected a lot from this movie, but there was something that saved the story for some reason, if you like children movies, you just have to watch it, if you don't, then you will probably not enjoy this one.\rAside from the story, the visuals reminded me a lot the game \"Puppeteer\", i loved the game... So i basically loved the movie too"}, {"rating": "8", "text": "This is a breath of fresh air in kids films. Planes and earth to echo were dumb, stupid and teach kids nothing. This has great morals lovely characters and a genius plot. I recommend this film with all my heart!"}, {"rating": "10", "text": "To the person who wrote that the museum children were pointless, thats not true! they were there so that someone would remember the dead so that they could continue to live in the land of remember! the visuals are beautiful, and the Female is not the  lead, the boys are not the lead, but they together are the lead. (it makes sense to me!! lol). the songs are cover songs that make it easy to sing along and the movie originals are just as memorable! My fav is the toro song!"}, {"rating": "4", "text": "This is the first film to come from Reel FX Animation Studios, and as visuals go, they have come to play.  But if there is anything we’ve learned while living in the Pixar Era, it’s that a film’s story is equally as important as its animation.  It takes more than fancy imagery (and a famous person’s name on the poster) to make a quality animated film in 2014.  Despite its gorgeous visuals and del Toro’s gravitas, The Book of Life is a disappointment."}, {"rating": "2", "text": "'I don't get it' states one un memorable character towards the end of this colourful but hysterical toon. This is a sentiment with which I can wholeheartedly concur. The in cohesive story set in Mexico is unengaging as well as being full of annoying and noisy wooden (literally!) characters. Two main protagonists come over like Glenn Close and John Malkovich in 'Dangerous Liaisons' and spark the occasional flame, but generally this is an unpalatable concoction living in no man's land. Too adult for kids and too boring for adults, I find it hard to believe that it could appeal to anyone.\rThe frenetic visuals are appropriately served by a score that is also all over the place changing its tone and mood so abruptly that it becomes fragmented and only serves to underline the chaos of the whole sorry mess. Events are also interrupted from time to time by a few less than memorable songs one of which is almost certainly a shoo in for an Oscar nomination."}, {"rating": "9", "text": "It the animation was good,the music was beautiful,it was very funny,\rand it was a actually interesting story.Also the voice acting on\rpoint and it really fit the character's look and personality I really\renjoyed it and recommend you watch it ^_^"}, {"rating": "7", "text": "This fantasy travels between 3 mythical Mexican worlds on the Day of the Dead, as two men vie for the love of a woman. Toss in bull fighting, love songs, ghosts and a message about following your heart. Although the story complex for young attention spans, the character design is absolutely fantastic (in both senses of the word). It's inventive style, vibrant colors and boundless energy combine to create a visually delightful experience."}, {"rating": "7", "text": "The animation is quite wonderful, vibrant colors and stunning imagery. The \"Book of Life\" is a story of, well, just like the title The Book of Life. However, it goes a little deeper than simply stating all things are living and have their own story. All things have \"Life\" because we provide love and everything that comes with it. The dead are still living because we, as people, hold on to their memories and love them endlessly. The only time we really go away is when we let it. The movie could get better dialogues or much fluid script but overall it is a great film to see. The soundtrack is also fantastic."}, {"rating": "6", "text": "Good family film, even adults will laugh at the jokes. Ice Cube even gives a great voice part!\rMost of time it is really touching and heartfelt.\rIn summary, see if you want a funny, feelgood family film. Worth a rent and possibly a theater visit if not doing anything and need a change of scenery out of the house."}, {"rating": "0", "text": "The most worst film that you can see entire of your life. Very bad charecters, boring story that make to wish ends soon. It was totaly a disaster and don't waste your time with this boring and very bad film."}, {"rating": "5", "text": "Purely for kids, only the saturated colors of the animation will keep adults mildly interested. The film is steeped heavily in Mexican culture, too, so there's a narrowly defined demographic here."}, {"rating": "4", "text": "This is not the great film,and critic reviews are lies saying that the movie is great.This is a okay movie.I prefer other movies like Rio 2 or stuff.so yeah."}, {"rating": "5", "text": "The Book Of Life es un film de animación que tiene una atmósfera colorida, pero no llega a ser muy relevante.\r Esta película, si bien contiene una historia alegre y un tanto estimulante, no se siente tanto como una película de animación para el disfrute familiar, si no más bien como una especie de publicidad a las distintas tradiciones, y eso quizá puede hacer decaer un poco su atractivo, aunque sin embargo, logra resultar entretenida y colorida en su trama abarcándose no de una manera potente, pero sí de una manera decente y admirable."}, {"rating": "7", "text": "The Book of Life’s story is nothing new but it is told and presented nicely. The characters are mostly likeable and the film doesn’t slap villain on characters that it easily could have and the film really comes alive when we go to the Land of the Remembered. Here the gorgeous animation becomes even more beautiful and I almost wish the story was written so more/most/all of the film was down here. The animation in this film alone makes this film a must watch. If you can get past the fact that you’ve heard this story a million times along with the occasional pop culture reference, you’ll probably enjoy this film."}, {"rating": "9", "text": "First off, this movie is visually beautiful.  Probably the best looking animated film ever made.  t's hard not to love the characters in this fun filled movie. Go watch it, I assure you, no regrets."}, {"rating": "9", "text": "A beautifully animated film with an entertaining myth and legend-like children's story. Both children and adults will love this film (unless of what some children may think with the skeletons everywhere)."}, {"rating": "6", "text": "3/5★ Taking a page out of Pixar's book, Reel FX Creative Studios created a film with stunning animation and detailed worlds that dazzle the eye. Unfortunately, they missed the chapter about having a plot deserving of the visuals. The lackluster dialogue and uninspired plot distract from the wonderful backgrounds and colorful scenes.\rThe Book of Life deals with death, an unusual subject for a children's film not directed by Tim Burton.\rVerdict: Watch if you like great animation."}, {"rating": "8", "text": "Fugindo totalmente das linhas tradicionais, essa animação mostra uma história toda ambientada na cultura e crença mexicana, o que a torna bem interessante. A história é bem diferente dos clichês tradicionais que predomina nas animações mais mainstream. A trama é focada muito mais na aventura do que na comédia sendo contada de uma maneira totalmente diferente com uma história de bonecos dentro da história. Personagens com designes absurdos e legais, tudo é muito colorido, bem estereotipado da região do México. Trilha sonora impecável. No geral o filme é bem divertido, e me surpreendeu de maneira positiva. Recomendo: 8/10."}, {"rating": "9", "text": "Certainly not the film I was expecting which believe me, is a good thing. The Book of Life genuinely impressed me. Definitely better than some of Dreamworks' films for sure. I wasn't that big of a fan of the romance but everything else was amazing. Great film!"}, {"rating": "7", "text": "You know what time it is? It's Animation time.\r The book of Life is about a young man finds himself on a path that can go two different ways: to follow the expectations of his family or to follow his heart. But before making a momentous choice in his life, he must face his greatest fears - and the fantastical journey begins.\r What I really like about this movie is that it's different and so it's so colorful with it's animation, and the movie has some frighting scenes about death and the other world that might scare kids, but just like most kids films we see we do see scary and messed up scenes in some kids movie.\r The good things in the movie: The animation in this movie is so colorful and so bright that my eyes couldn't get enough of the beautiful animation that was right in front of me. The voice acting was pretty good, the movie takes it different twist and turns which I like.\r The Problems: My problem with the movie is it's Jokes, the Jokes in the movie sometimes work and sometimes didn't, and they use modern music mix with old mexico music and that to me didn't really work for me.\r Overall I didn't love this movie, because the movie has problems but let's not forget it has it's good parts, and that's why I do think it's a fun time a theaters and it's a harmless movie for young auditions, well for some kids."}, {"rating": "5", "text": "Guillermo del Toro, el orondo director con mentalidad del dependiente de cómics de los Simpsons, que en dirección acierta en la mayoría de los casos, teniendo en su palmarés pelis interesantes como ejemplo Cronos, El laberinto del Fauno o Hellboy y algunos pufos  como Hellboy 2 o Pacific Rim. Pero en su faceta de productor, siempre le sale mal la cosa.\r Este señor o una de dos, o le hacen el timo de la estampita o no le importa un carajo que utilicen su nombre para intentar atraer al público con cualquier mierda. Pero claro, ¿quien demonios se va a pensar que un espectador que haya visto Mimic, El Laberinto del Fauno, Hellboy, Cronos o Blade 2, por mencionar algunas, va a ir a ver una película para niños?, Esto podía perfectamente haberlo producido, cualquier persona random. Por esa regla de tres, seguro que en unos meses me encuentro algo parecido a... Guillermo del Toro presenta \"Leche semidesnatada Hacendado\" y ni me inmutaré.\r SPOILERS POR DOQUIER\rPero bueno vamos a contar un poco este film, Manolo y Joaquín, que se debaten por el corazón de María, Joaquin se hace militar blablabla  Manolo, es un joven torero que se debate entre cumplir con las expectativas de su familia o seguir su corazón y dedicarse a su verdadera pasión: la música. Una apuesta entre dos guardianes del inframundo, blablaba, uno muere blablabla, viaje por una tierra para recuperar su vida, blablabla, se enfrenta un malo, todos ganan se lleva la chica y fin. Ah, y con temática Mejicana y el día de los Muertos y todo eso.\r Y ya está, si es que no hay más, un película OLVIDABLE, aburrida, un guión precipitado, una película fría, sin alma el villano es lo mas absurdo del mundo (Se vuelve bueno a la mitad PORQUE SÍ), Algunos diréis,\" jo, si es para niños que duro eres\", es lo que tiene ser una persona ADULTA y que estoy en una web de CINE, que debo analizarla como Película. Eso quiere decir que si tienes 5 -6 años, te parecerá una maravilla, si eres un adulto, pues desearás cortarte las venas.\r La verdad, no quiero contar más porque no hay nada mas destacable que contar, visualmente colorida (para los niños) y poco más, no digo que este mal hecha, sino que es del montón."}, {"rating": "8", "text": "Turn off the sound, and it's the most splendid-looking animated feature made in the U.S. in 2014.\r Watch this movie for free http://www.watchfree.to/watch-2a02b2-The-Book-of-Life-movie-online-free-putlocker.html"}, {"rating": "7", "text": "The Book of Life achieves the goal of being entertaining. The classic love triangle is given Grecian style with the addition of two meddling mythological creatures and a journey into the land of the dead. The classic tale of childhood love maturing into adulthood carries with it a natural charm and you find yourself actually rooting for the main character. Combine that with the well executed animation and on cue humor and you get a genuinely endearing little film.Its weakness lies in its inability to structure plot. The climax didn't feel to climactic because it didn't follow from most of the sequences of events following up to it. In the same way, much of the movie didn't really know how to build a cohesive series of events, as the hero's time spent in the actual land of the dead was somewhat minimal. Exposition might have been carried on somewhat too long compared to other moments in the movie that could have deserved time in the spotlight. All in all, the movie really worked like a charm to entertain me because it had incredibly endearing and intriguing elements, but its strength as an actual movie is put into question by its weak plot structure."}, {"rating": "9", "text": "I liked it a lot. The animation and voice actors were amazing. The story is actually very good. It had a magical feel overall and felt great to watch. Overall, it was a great movie for everyone."}, {"rating": "7", "text": "Even if the plot is predictable, the stunning animation makes up for it make it it a enjoyable movie. Very beautiful animation. Another good film 20th Century Fox."}, {"rating": "8", "text": "The bad luck of \"The Book of Life\" is the existence of \"Coco\", which may have overshadowed its space a little. \"The Book of Life\" is not a sensational animated film, but deserved to be more valued, for sure. It delivers a fun storyline with charismatic characters."}, {"rating": "10", "text": "I mean it such a good film and I think that Coco ant other excellent film took from this movie"}], "recommendations": ["klaus", "over_the_moon", "luca", "soul", "onward", "spirit_stallion_of_the_cimarron", "rio", "ratatouille", "how_to_train_your_dragon_2", "your_name", "the_incredibles", "the_little_prince", "kubo_and_the_two_strings", "atlantis_the_lost_empire", "wolfwalkers", "strange_magic", "how_to_train_your_dragon", "cinderella", "zootopia", "moana", "up", "trolls", "rio_2", "paprika", "raya_and_the_last_dragon"]}