{
  "id": 258,
  "title": "The Last Airbender",
  "starring": [
    "Noah Ringer",
    "Dev Patel"
  ],
  "runtime": 103,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "The story follows the adventures of Aang, a young successor to a long line of Avatars, who must put his childhood ways aside and stop the Fire Nation from enslaving the Water, Earth and Air nations.",
  "releaseYear": "2010",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zgwRTYWEEPivTwjB9S03HtmMcbM.jpg",
  "categories": {
    "plot": 1.2333333333333334,
    "acting": 1.1833333333333333,
    "ending": 1.3333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 2.0,
    "funny": 1.0,
    "action": 1.3
  },
  "reviews": [
    {
      "rating": "2",
      "text": "\"The Last Airbender\", a movie based on the famous TV series for kids, is just simply terrible. The story doesn't make any sense and is chopped into crude pieces. The acting and special effects are terribly illustrated like coloring black ink over a well-done portrait of someone. Man, all I can conclude is RAZZIE BUZZ!!"
    },
    {
      "rating": "1",
      "text": "Maybe the biggest rape of source material in movie history. The charm, heart and soul of the original is lost. The well written characters are gone. Only the names of the characters are well transferred. The story is compressed and soulless. It takes a lot of effort to destroy such good sourch material."
    },
    {
      "rating": "1",
      "text": "Avatar: The Last Airbender is a great TV show one of the best cartoons I have ever seen. This movie is terrible. Fans of the show will hate the film. The movie rushes through the plot only featuring the beginning and finale of the show and one or two moments in between. The acting is terrible with a lot of bad actors and underdeveloped characters that are nothing like those from the show. Additionally, various character names are mispronounced, which is insulting to the fans of the show. The effects and action are decent at times but for the most part it looks stupid. Even if you don’t watch the show you will dislike this movie. There is no substance in terms of story or characters. If you haven’t seen the show this movie will confuse you because you will not understand what you just watched and why this show is popular. If you haven’t seen the movie yet avoid it at all costs. This is an awful movie with almost nothing good about. The show offers nothing in terms of characters and story, which will piss off die hard fans and confuse non-viewers. This movie is garbage and I am grateful that the other two season were not given movies."
    },
    {
      "rating": "3",
      "text": "The Last Airbender is all eye candy and has no heart like the Nickelodeon cartoon it is based upon. The only thing really going for is the somewhat decent visual effects used for the action and bending effects. Other than that, the story is dull, the dialogue is uninspiring, and the acting is utterly atrocious. If the visual effects were not decent, this film could have been a lot worse. This is by far the worst film M. Night Shyamalan has ever made."
    },
    {
      "rating": "1",
      "text": "I guess you cant expect anything less from M Night Shayamalan, whos movies continue to get even worse as his carreer moves along. I dont think that he should quit the movie biz, i just think he should stop writting and directing movies peroid!"
    },
    {
      "rating": "1",
      "text": "I like watching the series on Nickelodeon but this movie was just so boring and I know it wasn't to long but it felt like it. I hope that if they make a sequel is better than the first one."
    },
    {
      "rating": "0",
      "text": "Do they hire people to give this movie a score of above 0? I thought Dragonball Evolution was brutal, but its actually not that bad compared to this POS."
    },
    {
      "rating": "1",
      "text": "TNot only considered the worst adaptation of a cartoon series, b ut also the worst martial arts film ever. Not only is it a butchering for fans but also non-fans will find not only everything wrong but also a poo man's recap of the first season. The dialogue is dumb, the acting is unwhelming, the 3D is a joke. Not to mention that its getting a sequel of a planned trilogy."
    },
    {
      "rating": "0",
      "text": "After watching this movie i can now say that M. night shama-whatever should quit making movies.  it is truly that awful. I'm a huge fan of the avatar series, and before watching it i knew it would be bad, but what i didn't think it would be this bad. for one thing they misrepresented the intentions of the fire nation when they started the war. the Kioshi warriors were completely absent from the movie. none of the character really felt like they should, they included the blue spirit (a character established in the third book), and the fire benders couldn't make fire from their chi like they could in the cartoon. instead they had to bend an existing flame. for the normal viewer who wouldn't care abut these or notice, the movie still has horrible pacing and dialog, the original series had wonderful and very natural dialog but the movies dialog is awkward and poorly paced. the acting was also awe full because half the time the actors seemed uninterested and the rest of the time they were just standing awkwardly. especially the fire bender soldiers, they would just stand around awkwardly attacking the air until it was their turn to get there butt kicked by one of the protagonists. so if your a fan don't expect any sort of fan fair, or general accuracy. if you have never watched the show then you may sightly enjoy the movie however even if it was disconnected from the Avatar franchise, its still not a good movie. in all if you think you might be interested in the Avatar series go rent the DVD's."
    },
    {
      "rating": "0",
      "text": "This is what you get for cramming an entire season's worth of story into a film that isn't even 2 hours long. The plot is terrible, The acting is pathetic, and the special effects are very weak. Easily one of the top 10 worst films of all time."
    },
    {
      "rating": "0",
      "text": "I'm an idiot. Getting fooled in because I am such a fan of the cartoon. This is one of the worst films I have ever seen in my life. Alienating, boring, effortless and lifeless which by any means never do any justice to the cartoon show.  The acting and dialogue is horrendous, the editing is awkward, the characters are boring, being badly written, the script is pathetic and the plot is completely rushed. Avoid it. It sucks."
    },
    {
      "rating": "2",
      "text": "Wrong score on first review oopsIf you are unfamiliar with the movies source material, the Animate series of a similar name this movie will have little to offer you ; If you are familliar or even a fan however, it will have plenty to offer, unfortunately all of it's offerings are bad. First off, I do want to give an honorable acknowledgement to the special effects in the move as well as trying to stay somewhat close to the story, one can understand that sacrifices have to be made to take a full season of a series into a one sitting movie timeframe. What kills the movie however is the acting, Bad diologue bad choreography, just about every name is mispronounced which to an extent is understandable perhaps if the source is either in a foreign language or a book but not if the source is in the movies originating language and has already established such things. Also the story is very shallow and some scenes such as a segment where the main character and their friend are practicing water bending stances (based off of tai chi) you can tell that they are supposed to be in sync with each other but are fare from it. All in all, at best this movie could be accepted as a very well done fan movie done by a third party with some of the best special effects programs available to the public, but when one considers that this is published and backed by major production companies, all of this films shortcomings are unacceptable. I find it to be hard to believe that this movie can leave a positive impression on any viewer, fan or not"
    },
    {
      "rating": "2",
      "text": "It is really depressing that something like this could have come out of such enjoyable source material. There is good intent, but that is about it. Save yourself some time and watch that."
    },
    {
      "rating": "0",
      "text": "Wow M. Night really messed up on this one. I saw no parts similar to the series in the movie. Oh and that wall of water was like the worlds biggest psych out! Hope they don't do book two."
    },
    {
      "rating": "0",
      "text": "While I respect M. Shyamalan's talents, I've got to say this is the worst film of 2010 (I bet nothing will top it). It will win the Razzie Awards, but its box office is so huge that they are going to make a sequel! No need for a big review. While the effects are quite good, I hated the acting and everything else about it. This is just like a Disney TV show with good effects. It is nowhere good enough to be in the big screen, yet people still come to check it out. The Last Airbender is by the far worst film of the decade and M. Shyamalan is the worst director of the decade for creating this film."
    },
    {
      "rating": "1",
      "text": "Has M. Night Shyamalan done it again? No, no he hasn't. Or actually if I look at it from a different point of view, maybe I can say that he has done it again. Based off of his last few movies, which were huge disappointments, The Last Airbender certainly followed suit. With a spectacular trailer and a well-written cartoon series to back it up, it was sad to see that the great storyteller, Shyamalan, did a horrible job at telling the story of The Last Airbender.Read full review at FlicksWorthWatching.com"
    },
    {
      "rating": "2",
      "text": "Wow, poor acting, worse dialogue just an overall terrible film. The movie had a TON of potential, yet it lacked just about anything to make it worthy outside of it's concept. Whoever casted and wrote the dialogue in the film should be shot. They made Hayden Christianson(Anakin Skywalker) look smooth in speech."
    },
    {
      "rating": "1",
      "text": "With an incomprehensible plot, laughable dialog, poor actors, and flat action sequences, The Last Airbender is a mockery of the original cult TV series and one of the worst blockbusters of 2010."
    },
    {
      "rating": "0",
      "text": "Okay, how do I put this........THIS IS ONE OF THE WORST MOVIES EVER!!!! Don't watch this. This is a disgrace to the TV show. The special effects are great, but the dialouge is laughable and the acting is wooden. Do NOT watch this. I hope Noah Ringer is better in Cowboys vs Aliens than he was in this. People often ask, \"What went wrong\" about this movie. A better question is: What DIDN'T go wrong?"
    },
    {
      "rating": "1",
      "text": "M. Night probably never watched the animated show 'cause this film is just a complete disaster! First of all, they pronounced almost every character's name wrong, the story is  up, the characters themselves aren't even correct, and the special water, earth, wind, and fire effects (which are very cool) don't seem right! I never minded M. Night's films, but this was just completely unacceptable! I had enough of his movies, you know what... F**K YOU NIGHT!!!"
    },
    {
      "rating": "4",
      "text": "Remember how I mention that the most talked-about stinker of 2009 was \"Transformers: Revenge of the Fallen?\" Well, in 2010, \"The Last Airbender\" held that title. Hated by critics, hated by fans, the winner of numerous Razzies, you name it, \"The Last Airbender\" was bashed, bruised, beaten and destroyed by pretty much everybody. And while I didn't hate it as much as everyone else did, I fully acknowledge that it's not good, and even though my 11-year old self was fine with the film (thank you, flashy visuals and action scenes and my lower standards), I now see what makes it so bad. The plot is not good, the characters are forgettable, and the acting is pretty bad as well. And even as someone that never really watched the cartoon (exile me all you want), you don't need to watch the show to see how bad it is. In fact, if you watched the show first, it will probably make the film even worse for you. If you can completely turn your brain off for this one, you might find something to enjoy, and if you're a kid that never watched the show, you'll probably like it, but otherwise, \"The Last Airbender\" is a film that's pretty hard to recommend overall."
    },
    {
      "rating": "1",
      "text": "I saw the midnight showing with a group or hardcore friends and fellow fans. The audience was actually laughing throughout that movie at just how bad it was. The only thing that this film has going for it, is the special effects. Thats it. Its bad. Stay away."
    },
    {
      "rating": "0",
      "text": "An absolutely terrible movie, The Last Airbender takes the first season of a decent kids show and makes it into a mess of horrible acting and confusing plot that makes the movie completely unlikeable by newbies and more than disappointing for fans of the series, having watched it with the former and been the latter.  However, the saddest part of this film might be that it takes itself so seriously. In the end, it deserves ever Razzie it got."
    },
    {
      "rating": "0",
      "text": "Alright, time to cut loose.  Swearing and insults ahead, so... ye be warned.  This is the biggest sack of sh*t I've ever had the misfortune of seeing.  The effects would have hardly been passable in 2005, the characters are generic white kids who can't act to save their lives, there is no development whatsoever, the action scenes are atrociously dull and sometimes downright stupid, the dialog is truly awful (Seriously, two of the three main characters' names are horribly mispronounced), the pacing is completely off and the plot incoherent on almost every level, and fans of the series, including myself, will feel insulted after watching this crapfest.  This is, in my honest opinion, the worst film ever made."
    },
    {
      "rating": "0",
      "text": "The Last Airbender is one of the worst films ever and definitively the worst film directed by M.Night Shyamalan, as a massive fan of the show i was extremely disappointed in this film, converting the first season that lasts 470mins into 103mins is atrocious, there's a lot of key elements and i mean a lot of key elements missing, the casting and acting are probably the worst part about the film and isn't even backed up by the special effects which are horrible, specially when 160 million (inflated) dollars went into this film and it still didn't deliver anything to enjoy, this movie is a disappointment to fans and film making. i'll definitively give this a 0."
    },
    {
      "rating": "0",
      "text": "This movie is so bad, that it's... bad. There is literally nothing I can enjoy about this movie. It had horrible special effects and cringe-worthy acting. It's a real letdown after the fantastic show."
    },
    {
      "rating": "4",
      "text": "It didn't have to be this way. It could have been great. It could have been a successful trilogy. But it wasn't. They had a great cartoon with great cinematic potential and they blew it. How could they mess it up?\rWell- firstly, the acting was horrendous. I liked Dev Patel's performance but the others, not so much. Their voices were just so... Robotic. And the names? Remember Aang, Sokka and Uncle Iroh? Well now meet Oong, Soaka and Uncle Earoh. No joke. That's how they pronounced their names. They butchered it. And no matter how much money this made, they know they can't make a sequel. Because now that everyone's seen this, a follow-up would bomb hard. Fans of the cartoon, just stick to the original."
    },
    {
      "rating": "2",
      "text": "Sometimes, there are moments where movies are watchable... and then there are those that are decent as ever... and then there are those that makes you wonder why were you even in the theaters seeing it. This is one of them."
    },
    {
      "rating": "0",
      "text": "What Last Airbender movie?\r(If you're asking why I don't know there was a Last Airbender movie, it's because I know there WASN'T a Last Airbender movie, if you catch my drift...)\rWHAT LAST AIRBENDER MOVIE???"
    },
    {
      "rating": "1",
      "text": "I am 17 years old and i loved the avatar series and my opinion of this movie is comming from a fan of the show's point of view; being that I am a part of the teenage demographic that this movie was targeting, I think I can speak for most airbender fans. this was by far the biggest disaster of a movie I have seen since Dragon Ball came out. I guess the best way to write this review is by the rating scale provided by yahoo: story, acting, direction, visuals, and overall. Story: I have got to give them credit for trying to stick to the series's storyline, but they made a massive fail in execution. The movie tried way too hard to reenact each episode and fit it into a movie that's under 2 hours long. also, the fire benders couldn't bend fire out of the air (all but one) which was EXTREMELY disappointing and i didnt understand why they chose to make that change. Acting: As for the acting of the movie, it was horrendous: everyone in the film either over-acted the whole time or didn't act it out enough to make me feel attached to the characters. when there was tragedy going on I either felt like \"what?\" or \"so, I've only seen you in like 3 minutes of screen time. who cares if your not around anymore.\" in other words, I never got attached to the characters like i usually do in good films. some of the dramatic moments were actually more humorous than sad. Direction: the direction of this movie was EVERYWHERE! I watched all of the episodes from the cartoon since it came out when i was about 14 years old so i know all about what they talked about in the movie with no explanation necessary, but for anyone that was new to the airbender storyline would have no idea what was going on after about 1/3 of the way through. they mentioned very important things from the series that play a major part in the story very quickly with little or no explanation IE: the \"hidden library\" was HUGE in the series and definitely required more talking than it was given in the movie, the spirit world left you feeling confused about what was going on, and alot more that im not even going to get into. Visuals: the bending in the movie really left you wanting more (not in a good way), it was super disappointing and did not look very fun to watch. the bending looked more like a dance with no elemental outcome than bending. im not too concerned with \"the scar\" that everyone in getting all worked up about, because if someone had a burn wound like he did in real life it would look very similar to what we saw in the film. anyway, i wish they had put more effort out on the bending factor and not chose to skip or shorten fight scenes by merely \"scaring\" away the bad guys (you'll understand if you dare to watch this movie). Overall: the movie was overall a cop-out of a film. i guarantee that the fans would have loved to wait a little longer for the films release if they would have gotten a better job on just about everything in the movie. I'd like to end this review on a good note and that note is..... (drum role) the trailers were pretty sweet looking, just watch them and bask in the mystery of not watching the film. trust me, it'll be better if you not know what it actually looks like, just use those images to visualize what it looks like and you will have a better time thinking about it, i did."
    },
    {
      "rating": "1",
      "text": "One of the worst movies I've seen. The effects were off (and by off i mean not timed right at all) the actors were cardboard cutouts and had NO comedy (like the series does) at all. The plot had soo many holes and scenes missing. Overall one of the worst movies I've seen."
    },
    {
      "rating": "1",
      "text": "Um dos filmes trágicos do cinema"
    },
    {
      "rating": "0",
      "text": "A disgrace to a show that clearly knew how to be awesome, and a disgrace to cinema all together. The last airbender is without a doubt the worst movie I've ever seen."
    },
    {
      "rating": "4",
      "text": "I don't think it is as bad as everyone says it is but still nothing good at all. I thought the beginning of the movie was ok introducing everything that part was entertaining enough. And then I thought it started going down hill from there with a couple memorable scenes until the end of the movie. Still not a good movie but not one of the worst either."
    },
    {
      "rating": "2",
      "text": "This movie is like the character's description of the play in season 3 of the show, it's awful but \"the effects were decent\" (as in mediocre, in this case). I watched this show when it was on TV when I was a tween, so it's like I grew up with it. This movie insults the entertaining family adventure that I watched. I would have had no clue what was going on if I hadn't watched the show. It's so incoherent and all-around poorly written. the acting and everything is blatantly bad. Don't waste your time on this movie! It's not the epitome of bad (there are a few decent parts, I guess... maybe), but it's pretty [expletive] close!"
    },
    {
      "rating": "1",
      "text": "The Last Airbender directed by the now-infamous M. Night Shyamalan is considered by many fans of the original show to be one of the worst if not the worst adaptation of all time. The film performed poorly at the box office and was had plenty of negative reviews upon its release. Those who have greatly enjoyed the original source material quite often show their distaste for the adaptation of their favorite show. The film has poor editing, cinematography, and horrid acting but the main problem with the film reflects a deeper issue. The film oversimplifies plot points from the show and it fails to go into depth with the show’s influences in Eastern philosophies and it even has some implicit message in racism due to the casting and the portrayal of those who are people of color. There are even some changes from the source material that added to the overall detriment of the film.\rAs mentioned before, some of the character portrayals in this film are a clear downgrade from their original counterparts in an attempt to appeal to a wider audience. The character Sokka was the comedy relief in the original show. He was used as a way to get some comedic antics to take a break from the action set pieces and heavier moments in the narrative. On top of that he was also the team strategist as he is the one who usually creates the plans that makes the team become triumphant in certain moments of the show. He goes through a character arc when he overcomes his sexism and some of the jokes that revolve around him parody the notion of the tough guy. In the beginning of the show he starts to believe that physical strength is everything but later realizes that strength is not the only thing that defines a man and he starts to have a growing respect for femininity. In the film though, the character noticeably lacks his trademark humor and is mostly stoic throughout most of the story. He does have a sarcastic comment every now and then but he remains serious throughout the majority of the film. He is even angry throughout most of the film which is in clear contrast to his original counterpart. This seems to be an attempt to appeal to the demographic who are attracted to the “bad boy” archetype. This promotes masculinity as he is never challenged for his ideas on real manhood in the film and supports the ideals that the original character was a parody of. Aang has also changed from his original version as he is changed to appeal to a wider western audience. In the original show he was influenced by the Tibetan Buddhist Monks as he teaches himself balance and he has tattoos of arrows all over his body as representation of enlightenment. Throughout the storyline he was conflicted about his role as the avatar. He spends his time not being sure if he could handle the responsibility until the end of the show when he reaches true enlightenment as he finds balance in his personal life and in his role as the Avatar. In the Film version though, Aang is noticeably white and his tattoos are shaped like a cross instead of an arrow and he never questions his position as the Avatar. This makes Aang an allegory for the life of Jesus Christ. It disregarded the character’s eastern influence in order to be the chosen one to save people from their sins. This does appeal more to an American audience since the dominant religion in America is Christianity but this not only undermines the point of Aang’s character but it also disregards the main philosophies that the show promotes through the Buddhist influences. The Fire Lord who is the main villain of the film is out in the open and lacks the menace he had in the show. Most of the menace was lost as he is shown in full view while the show had his face hidden until the final season. By removing the menace it makes the villain less of a threat and less engaging in an attempt to appeal to younger children. The one character who had the biggest disservice was Kitaria. Her character arc in the original show involved her overcoming the sexism of her culture. She was nurturing but she also had a quick temper. She valued her friends but she was also ambitious and wanted to be a great warrior. Her film counterpart on the other hand seems to be defined by her gender and nothing else. She is nurturing but she never evolves from the role that society has given to her. She doesn’t join in the battle and is even incompetent in battle. Kitaria in this film makes mistakes that her original version would never do such as charging into battle without a plan. The character in the film is hardly recognizable from the show as she merely accepts the role of only being a healer instead of being a capable fighter and even a feminist icon for younger children.\rAside from the changes in the character portrayals the depiction of other races in this film has a xenophobic essence to it which sends some questionable- implied messages. All of the member of the fire nation are Indian or middle eastern which heavily contrasts the show’s Japanese influence for them. The Fire Nation in the show was inspired by Japanese imperialism during World War II and they were motivated by desperation and through political prowess much like Nazi Germany. The film’s version though dismisses the political intrigue outside of the portrayal of the banished Prince Zuko in favor of making them purely irredeemable. According to the film’s narrative the Fire Nation wanted to conquer the world to fight against the spirit world. This gives the message that the noticeably darker skinned soldiers are heretic barbarians who could not be bargained with. There is barely any depth to the fire nation as they are nothing more than mindless barbarians as opposed to the show when the viewer starts to learn more about how their totalitarian society worked. It is strange considering that the director himself is Indian but it seems to be a casting decision by the studio. The only sensible member of the fire nation army is General Iroh who is Caucasian. The earth benders are depicted as incompetent as they cannot fathom the idea of bending the earth to their will in a prison when they are surrounded by Earth. The prison in the original show was on a metal ship in the middle of the ocean which was a deliberate choice since no earth bending was possible and they only raised up when they had the motivation by Kitaria. In this film though they had given up immediately until they are inspired by a white hero to give them the motivation they need. Unlike the fire nation the Earth Kingdom keep their Asian influence (mostly Chinese) but they are still less competent than the white heroes. The Water Tribe are based off of the Sioux and other Eskimo tribes but the two supporting characters are cast as white heroes. This gives the implication that Americans would rather have a white protagonist instead of one that is part of an ethnic minority even if the original influence was based off of a culture outside of white America. One of the biggest ways the representation of other races is problematic in this postmodern film was the introduction of a monk who was a creation purely for the film. This Monk in question betrays Aang in order to get more gold. This does complete the Christ like narrative that would be more accessible for an American audience but it betrays the Buddhist philopshy that the show was going for. The Monk’s reasoning for betraying Aang was that he was in a life of poverty but the main Buddhist philosophes is to get rid of your desires of the material world.\rThe biggest problem with this adaptation in regards to United States cinema is the overreliance on exposition. The majority of the dialogue is nothing more than to give background information without any regards for world building or character development. The film has a heavy reliance on the “tell don’t show” mantra even though one of the basic rules of storytelling is to take the exact opposite approach. The once scene that ultimately illustrates this was when the main character Aang discovered his destiny of being the Avatar. The animated serial went into great lengths to show the turmoil he went through. He was the designated chosen one but he was only a child and thus he couldn’t handle the pressure of being the hero of both worlds. His main character arc was accepting his responsibility of the avatar while also finding the right balance in his personal life. The film on the other hand has Aang stand in one room and merely tell the audience his backstory instead of giving the audience a chance to fully experience the character’s turmoil. Another example was when the audience learns why the banished Prince Zuko is trying to capture Aang. The show used a storm as a symbolic gesture about Zuko and Aangs relationship as both of their back stories are told simultaneously. In his cinematic version, Shyamalan made the choice to have Zuko’s backstory told by a child who just happened to be in the same room as the disguised prince. The film doesn’t seem to trust the audience enough to analyze the subtle character interactions and their relationships like in the show. Instead they are simply told what the characters are feeling and their inner emotions without any room for the audience to come to those conclusions themselves.\rThe Last Airbender is a perfect example of the worst case scenario for an adaption of a beloved storyline in order to appeal to a wider audience. Fortunately the attempt backfired on the studio as audiences realized that the quality of a film is not always based on the amount of special effects or attractive white actors one can put in a film. Modern audiences are starting to catch onto the trends of postmodern Hollywood and are demanding better films to occupy their time. The rise in popularity of online reviews makes it easier to spread the word about the quality and the artistic merit of a film. Peoples’ voices are being heard by Hollywood that modern audiences demand better writing and more effort in smart storytelling instead of only being reliant on the traditional block buster formula."
    },
    {
      "rating": "0",
      "text": "WHAT THE ACTUAL......Words cannot f*cking describe how awful, no awful’s too good a word for this pile of sh*t, how about ABOMINABLE this “film” is."
    },
    {
      "rating": "0",
      "text": "A disgrace of a movie to the tv show that I would describe as one of my favourites over the last decade. The actors, the special effects, the plot holes - I had to leave the cinema because of two reasons, 1: the movie was crap, 2: it was my first 3D-movie and I almost threw up... And that is summary of The Last Airbender, I hope they get it right with the live action series that will possibly be produced."
    },
    {
      "rating": "0",
      "text": "This is not only M. Night Shyamalan’s worst movie, but is probably the worst film of the decade! I’m a huge fan of the avatar show, I think the show is amazing. But this movie is a massive disservice to the show. This film has awful acting, terrible special effects, an awful story, and on top of that, they completely messed up the characters names. This movie is an abomination! Never see The Last Airbender film! Watch the show instead."
    },
    {
      "rating": "0",
      "text": "The movie is so bad nothing like the searisThey even miss spelled the names"
    },
    {
      "rating": "2",
      "text": "Broke into my house, killed my dog, stole everything that I owned, burned down the orphanage I live near, urinated on my bed, and called me names."
    },
    {
      "rating": "3",
      "text": "The movie's effects were awesome, but everything else could have been better. The characters' dialogue was very awkward and lacking that certain feel. I watched some of the cartoon episodes and Aang's character was portrayed differently in the film. Aang, as I recall, was quite carefree and had fun in the cartoon. In the film, however, Aang is very serious and I don't think he smiled once throughout the film. The story did not have good transitions. I mean I could follow what is occurring, but again it could have been better. I was very bored during the film probably because I did not really care for the characters. My friend who had wanted to see the film fell asleep and so did the person sitting on my other side in theaters. Again, the only parts of the film I enjoyed was the effects."
    },
    {
      "rating": "0",
      "text": "It seems like this film might end up as the next Battlefield Earth.  Battlefield Earth, which was released at the beginning of the last decade, went on to be the worst film of that decade.  The Last Airbender, which was released at the beginning of this decade, WILL be the worst film of the decade."
    },
    {
      "rating": "5",
      "text": "\"The Last Airbender\" is not terrible. The story is well put-together and flows well, considering it was all condensed from a whole season from a TV show. The visuals - save for the shameful post-production 3D that makes Clash of the Titans look like Avatar - are also very solid. Peltz's performance is bland, but aside from her, there weren't any huge problems. The screenplay, though, is a mess. Full of cliches and often incomprehensible, the whole plot falls apart by the end."
    },
    {
      "rating": "2",
      "text": "I have to hand it to M. Night, he is THE most consistent director in Hollywood... Every film he makes is consistently worse then the last! Check out all his movies on metacritic: 64, 62, 59, 44, 36, 34, 20... in that order!"
    },
    {
      "rating": "0",
      "text": "Whatever thread of similarity this movie had with the wonderful cartoon series I had fallen in love with was broken by stilted dialogue, incomprehensible storyline, and useless graphics. Don't watch this. It will break a fan's heart, and it will only confuse the uninitiated."
    },
    {
      "rating": "3",
      "text": "M. Night has taken one of the best story lines and ruined it. Mispronouncing names, choosing kids who CAN'T act, and failing to develop the characters, has proven that he no longer knows what he is doing. Unless you have seen the series, you will have no idea what is going on. I have seen the series and I spent the entire movie filling in the gaps in my head. Someone else needs to take this project over and remake the first one. Poor form M. Night."
    },
    {
      "rating": "2",
      "text": "The only reason this movie gets a 2 is because of the speical effects. It doesn't show the good and evil in Zuko, it has poor acting, to many movements before any bending is done (you could get smacked in the face before ang can use any air attacks) and how can Indians be portrayed as the bad guys ? Indians are not evil enough, nor strong. Bad casting, bad scripting and bad acting with good speical effect doesn't make for a good movie"
    },
    {
      "rating": "0",
      "text": "The Last Airbender, thanks to its horrendous screenplay and dialogue, horrible special effects, 3D that is just as bad as Clash of the Titans, bad acting, and horrible fan service, it is one of the worst movies of the year! It is also the worst movie of the decade so far. Even if you are a fan of the Nick show, skip this movie and you will not regret it!"
    },
    {
      "rating": "1",
      "text": "\"Last Airbender was such a rushed messed , it goes to quickly tho the action scenes were pretty neat , it could not save , these terrible performances , Awful script , and Laughable Dialogue ,One of the worst films released this year\" .. F"
    }
  ]
}