{"id": 4396, "title": "The Jewel of the Nile", "starring": ["Michael Douglas", "Kathleen Turner"], "runtime": 106, "genre": ["Adventure", "Action", "Comedy", "Romance"], "description": "Joan Wilder is thrust back into a world of murder, chases, foreign intrigue... and love. This time out she's duped by a duplicitous Arab dignitary who brings her to the Middle East, ostensibly to write a book about his life. Of course, he's up to no good, and Joan is just another pawn in his wicked game. But Jack Colton and his sidekick Ralph show up to help our intrepid heroine save the day.", "releaseYear": "1985", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/6VjsIhnIcrz2XdQVHdsMj5DdSa1.jpg", "categories": {"plot": 5.0, "acting": 5.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 7.0, "funny": 5.0, "action": 7.0}, "reviews": [{"rating": "7", "text": "Whilst I've been watching Romancing the Stone, I've decided to watch a sequel, The Jewel of the Nile. I was thinking about both of them films are as good as each other but in the recent years, it seems deteriorated because it's not as good as the first film. I remember watching it when I was a big kid back in 2007. The action scenes were pretty good. Lots of explosions and gun noises. Michael Douglas and Kathleen Turner are back and Danny DeVito is back as a crook again and this time he teams with Jack Colton to find Joan Wilder in Arabia near Africa. Omar who is a villain who has the jewel, the jewel of the nile who arabians called him ''Al-Julhara''. So they found Joan, escape from Omar and fly the jet aircraft and Ralph is left all alone with arabians. They go to the african people, go to the train and got kidnapped by Omar. The Jewel of the Nile is not as good as Romancing the Stone but it's still good. The song that Billy Ocean sings is good. \"When the Going Gets Tough, the Tough Get Going.\" I like that song even though Michael Douglas, Kathleen Turner and Danny DeVito singing along with Billy. As long as he film gets cheesy, it's still an enjoyable movie that has it's moments."}], "recommendations": ["beverly_hills_cop_ii", "beverly_hills_cop_iii", "crocodile_dundee", "beverly_hills_cop", "bad_boys", "joy_ride", "blue_streak", "sister_act", "the_rock", "speed_2_cruise_control", "red", "eraser", "lethal_weapon", "once_upon_a_time_in_venice", "days_of_thunder", "the_whole_nine_yards", "shanghai_noon", "lethal_weapon_4", "the_adventurer_the_curse_of_the_midas_box", "red_heat", "ride_along_2", "rocky_ii", "broken_arrow", "kidnap", "the_last_boy_scout"]}