{
  "id": 812,
  "title": "The Princess and the Frog",
  "starring": [
    "Anika Noni Rose",
    "Bruno Campos"
  ],
  "runtime": 98,
  "genre": [
    "Romance",
    "Family",
    "Animation"
  ],
  "description": "A waitress, desperate to fulfill her dreams as a restaurant owner, is set on a journey to turn a frog prince back into a human being, but she has to face the same problem after she kisses him.",
  "releaseYear": "2009",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yprv5PbnEksoVj2v6XEnDBg9joR.jpg",
  "categories": {
    "plot": 7.435897435897436,
    "acting": 7.923076923076923,
    "ending": 7.25,
    "soundtrack": 8.333333333333334,
    "cinematography": 6.0,
    "familyFriendly": 6.375,
    "funny": 7.75,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "It has some great music and fantastic animation with a few memorable characters, but without a memorable villain and a story we have seen loads before it almost is has the potential to be bad, but with the traditional Disney animation I enjoy it. I give this movie 76%. Not worthy of eight stars."
    },
    {
      "rating": "10",
      "text": "Beginning in 1989 with The Little Mermaid, Disney entered its \"Golden Age\". For ten years, they produced spectacular masterpieces such as Beauty and the Beast, Aladdin, The Lion King, and The Hunchback of Notre Dame. In the 2000's, however, everything changed; while there were some good Disney movies being released (the hilarious Emperor's New Groove, the heart-warming Lilo and Stitch, the underrated Brother Bear, etc.), Disney began to lose it's \"magic touch\", and traditional hand-drawn animation almost became a lost art. That was, until Disney began production on a new princess movie: The Princess and the Frog (originally titled \"The Frog Prince\"). As you would expect from any great Disney film, the animation is great, the characters are lovable, the music is enjoyable, the songs are catchy, the message is powerful, and the story is clever and heart-warming. Sure, Randy Newman is no Alan Menken, but his jazzy music style fits the New Orleans setting perfectly, and Tiana, the hard-working and kind-hearted protagonist, is a great role model for little girls. This movie is not only a great comeback for Disney, but it's also one of the best Disney films of the past ten years, and I highly recommend it for animation fans of all ages. (I won't spoil anything, but be sure you have a box of tissues with you when you watch this movie. Like most great Disney films, this one's a tear-jerker.)"
    },
    {
      "rating": "10",
      "text": "this is excellent! great voice acting, great writing, great animation, great everything!"
    },
    {
      "rating": "7",
      "text": "\"The Princess and the Frog\" differs from all that royal (white) princesses and stuff. The tone's very jazzy and light-hearted, which might get quite cheesy or over exaggerated at times, but is very amusing to watch such movie with love and friendship, the major components the Disney princess classics fail to pertain."
    },
    {
      "rating": "10",
      "text": "Excellent movie that really had a lot of 90s animation nostalgia. I was really glad Disney decided to go back and try 2d animation after a long absence, and I do hope the upcoming Winnie the Pooh movie won't be the last Disney 2d movie."
    },
    {
      "rating": "8",
      "text": "A good comeback for Disney, but it doesn't top any other Disney Classic, but it has the potential to become one."
    },
    {
      "rating": "6",
      "text": "I wouldn't call this movie bad. But I would put this movie between average and good. Don't get me wrong, Disney did a good job remaking this movie but these kind of movies aren't really my type."
    },
    {
      "rating": "1",
      "text": "This movie is terrible!!!\rEven though it's a girls movie i still went to see it and it was stupid.\rThe songs are stupid, it's not even fun to watch."
    },
    {
      "rating": "0",
      "text": "This was such a bad film that if i could i would give it -100 because it wasnt funny, to much singing and it was predictable. I will never watch a more horrificly bad film like that again... Hopefully"
    },
    {
      "rating": "4",
      "text": "The story concept & setting are interesting....promising fresh approach & view to classic tale. BUT the execution and production value just terrible...below average animation, so-so voice talent, average music, boring dialog...really bring down the whole movie to amateurish quality. Just too bad."
    },
    {
      "rating": "7",
      "text": "This movie follows the standard Disney formula. Bad guy is drawn thin and angular - looks the same as all Disney villains. Story completely predictable. The animation, however, looks great and the movie is well done even if it is uninspired. Disney needs to start making original films, like Pixar, instead of movies of fairy tales. Start showing some creativity. The biggest letdown of all, for me anyway, was the Randy Newman soundtrack. The songs were simply not catchy. You won't remember any songs after leaving the theater. Overall a good, solid Disney film."
    },
    {
      "rating": "5",
      "text": "Not even close to the complexity and brilliance of many other recent Disney movies, such as \"Up.\" Boring, predictable plot and ending. Extremely disappointing, especially for a huge Disney fan. Someone must have felt sorry for New Orleans and made a movie featuring the city."
    },
    {
      "rating": "7",
      "text": "Princess and the Frog is a great movie. The main characters are good and have an interesting relationship. The villain is cool. The message is awesome and differs from the typical Disney message. The story is good as well. It is the same story we"
    },
    {
      "rating": "7",
      "text": "Divertido, colorido e cheio de canções, A Princesa e o Sapo  interessante cheio de personagens engraçados e uma história bem trabalhada.............."
    },
    {
      "rating": "10",
      "text": "Great Disney....BRAVO!!!THE PRINCESS AND THE FROG is what we wantfrom a studio like you....I think Disney is back and give us that we want!!!i belive in the future Disney give us more wonderfll stories and it will be the first animation studio again"
    },
    {
      "rating": "9",
      "text": "John, Ron, Lasseter and the others at Disney have proved without doubt that it is the storytelling ability, and not the medium which sells tickets. Good story, great songs, funny, and not an entirely predictable ending. This finally feels like the rebirth of classic Disney, yet fresh for a modern audience."
    },
    {
      "rating": "10",
      "text": "A triumphant return to tradition indeed."
    },
    {
      "rating": "6",
      "text": "A wonderful movie yet I thought it could have been much better. I agree with Judy T. there wasn't really a memorable song."
    },
    {
      "rating": "10",
      "text": "Princess and the Frog was a delightful Cajun spiced black fantasy extravaganza. A+!"
    },
    {
      "rating": "9",
      "text": "Raymond the Cajun Firefly completely stole the show! To me, the entire plot is a vehicle for him. I'm in love with a joyous firefly."
    },
    {
      "rating": "6",
      "text": "This film receives 6 points for the animation alone, which was gorgeous. Unfortunately it doesn't merit much else. Throughout the entire 97-minute screening, there wasn't a single actual joke (it mostly relied on predictable slapstick), and not one particularly catchy or memorable theme tune. I desperately wanted to like it, I really did - but in the end, the writing was just bland and not up to par. Plus it all felt like it was over too soon. Hollow and run-of-the-mill. Now excuse me while I go and weep in sheer disappointment."
    },
    {
      "rating": "8",
      "text": "You could argue that Disney are slowly becoming a thing of the past in the film industry: they may have their name splattered across tons of live-action movie franchises, animated films and monstrously profitable television shows but Disney just isn"
    },
    {
      "rating": "6",
      "text": "Written by Michael Hutchence and Andrew Farris, the chorus for the INXS song \"Original Sin\" goes like this: \"Dream on, white boy/dream on, black girl/and wake up to a brand new day.\" What was once a provocative couplet back in 1983, now seems like a sentiment more befitting of a time capsule, since interracial relationships have long-gone been the stuff of controversy. With \"The Princess and the Frog\", Disney tries to be progressive, but is only half-successful in its introduction of a black princess; to be truly progressive, the prince should have been white. Tiana's skin color seems beside the point when she's standing next to the olive-complexioned Naveen, and needless to say, even less so as one of two frogs. Charlotte signifies Tiana, a juxtaposition worth the price of admission, for she's the starting point behind the notion of intergrating a minority princess among the genre's white predecessors. The hegemonic shift in narrative, the whole point of \"The Princess and the Frog\", take place the moment when the camera leaves the room where Charlotte and her father converse excitedly, and follows the seamstress(Eudora) and her daughter treading down a dark hallway, away from the normative foci. That's a good start. Too bad Tiana spends most of the film's running time masquerading as a cute animal. Almost by default, Tiana gets the faerie tale ending, because pairing the traditional princess-type with an exotic prince would have been equally problematic in the Disney universe. When push comes to shove, the hegemonic shift is delayed a bit, after Charlotte conveniently kisses Naveen too late, in which the machinations of tradition stops progress from happening. \"The Princess and the Frog\" doesn't quite have the swing of modern romance."
    },
    {
      "rating": "8",
      "text": "Overral, this was a good comeback foe 2D Disney animation, but I felt it was missing some of the magic of Pixar's movies."
    },
    {
      "rating": "8",
      "text": "It's a great movie, a fun movie, an entertaining movie, and a beautiful movie. But there is something missing. Something that doesn't quite live up to Disney standards, and I can't put my finger on it. Some scenes will have you thinking, \"Move it along.\" But all-in-all, I loved it. The ending was pure genius! SPOILER ALERT: Could someone please explain to me why Disney feels the need to continually kill off main characters? It was completely unnecessary, and I saw at least 3 kids crying."
    },
    {
      "rating": "5",
      "text": "This cheeky update of a classic fairy tale boasts almost as many talking points as merchandising opportunities."
    },
    {
      "rating": "10",
      "text": "An excellent movie that brings back memories from early Disney. A fantastic journey that reminds you of what Disney is all about. Thank you Disney for this wonderful holiday treat."
    },
    {
      "rating": "6",
      "text": "Far to pointless if you ask me. Disney, get a grip !"
    },
    {
      "rating": "7",
      "text": "Justin why did you just copy a pro's review? I though the film was a return to classic Disney storytelling."
    },
    {
      "rating": "9",
      "text": "Hey, Justin C. We see your review up above ok? Great, thanks! I forgive you though, because I know how being a 'film critic' can really just tire you out."
    },
    {
      "rating": "10",
      "text": "This movie is funny,and cool."
    },
    {
      "rating": "5",
      "text": "It's not easy being green. But to judge from how this hand-drawn movie addresses, or rather strenuously avoids, race, it is a lot more difficult to be black."
    },
    {
      "rating": "10",
      "text": "Finally, a memorable movie from Disney that we haven't seen in years. Definitely up there with \"Aladdin\" and \"The Little Mermaid\". It's no, \"Beauty and the Beast\", but certainly an instant classic. The characters are so well-developed, the relationships are strong, Tiana and Naveen have great chemistry, the music is surprisingly pleasant, and everything follows. This movie is this generation's versions of \"The Little Mermaid\", instantly."
    },
    {
      "rating": "10",
      "text": "This movie was nothing short of the traditionally-animated moviesfrom the 90's Disney Renaissance. Every single minute of the film was laced with nostalgia that carefully crafted the movie's own right of being an instant classic. Viewers will unexpectedly find the villian more grim than what he was advertised as and will also find the movie a lot more heart-warming and sad than just a cheap animated comedy. Overall, this movie will impress audiences with high or low expectations. It is a ticket for adults to travel back in time to their childhood and an opportunity for the new generation of youngsters to get a taste of Disney when they were at their best. \"The Princess and the Frog\" deserves 10, if not more, out of 10 stars."
    },
    {
      "rating": "5",
      "text": "Not one memorable song. Too bad for a Disney Movie."
    },
    {
      "rating": "10",
      "text": "It was dazzling and it can become a classic like the lion king."
    },
    {
      "rating": "9",
      "text": "I thought this movie was adorable! If you're a fan of the princess movies then you'll enjoy this one and of course i recommend it to anyone who has a little girl. The music was great, the singing by Anika noni-rose was great, and the characters were great. I didn't find any of the characters annoying which is often the case with me in animated movies. There was an incident towards the end that definitely made me cry, and I don't usually shed any tears at any of these movies! At least not anymore as an adult!"
    },
    {
      "rating": "9",
      "text": "Just marvelous story no matter what the ethnicity of the characters were. The first 10 minutes were sloppy, thereafter is just heavenly!"
    },
    {
      "rating": "5",
      "text": "For what it is (a typical, old-school Disney cartoon), it is not that bad. However, Disney films are not just intended for children - or are they? Even worse so if they are. They feed into misconceptions ideas about life and love, making our children believe in the fairytale love story. Yes, that might be nice when you are a kid, but it is rather misleading. For crying out loud, what this film comes down to is that if you find true love you will live happily-ever-after. Granted, most animated films are like that (even Pixar's to an extent), but they usually have some sort of important message ingrained in the storyline or the dialogue. Princess and the Frog does not have that, at all. That all being said, it does have some very nice, \"classic Disney\" animation, which is really nice to see again, and has a very good score with cute songs that work rather well. It is not an instant classic, that is for sure, but with fewer and fewer \"classic animated\" films coming out, I am sure it will join the ranks of \"Anastasia\" and \"Mulan\" but is far away from the glory that \"Beauty and the Beast,\" \"Aladdin\" or \"The Lion King\" are."
    },
    {
      "rating": "4",
      "text": "The previews of The Princess of The Frog indirectly promised a second coming of their famous two-dimensional musicals; Movies such as Lion King or Aladdin, that have been cherished in the hearts of adults and children alike.  With this promise, Princess  had big shoes to fill.  But unfortunately, Disney's newest film is wearing a size too small, and those shoes aren't comfortable at all.This altered story of the The Frog Prince is a film that tries way too hard to be like its predecessors.  From the cliche moments, to the happily-ever-after ending (SPOILER), it's exactly like the old Disney animated movies.  While these elements aren't necessarily bad, the movie just doesn't execute them well.  The characters do not connect to the audience at all, there is no emotional-reality to them in any way whatsoever.  In addition, the story and the plot are way too weak to be considered a \"childhood\" classic.  The only aspect that I believe the movie excels in is the Disney soundtrack that fits well into this \"magical kingdom.\" But even this redeeming aspect is flawed due to the excess of songs that the movie spurs out. In the end, its slow pace and lack of humor are just too hard to overlook.Although I can be considered too old to watch animated movies and appreciate them, I find that to the contrary.  Movies like Up and Ratatouille possess the ability to inspire all ages, no matter the target audience.  But Princess And The Frog fails to do so; With the flat characters and a plot that leaves me to question, \"Is it over yet?\""
    },
    {
      "rating": "9",
      "text": "Disney has done it again! 90 minutes of true inspiration. A story about a strong young lady, Tiana (Anika Noni Rose) who wants to open a resturant, in her father's memory. However as fate has it, when Tiana meets Prince Naveen (Bruno Campos), 'duped' and turned into a frog by the evil Dr Facilier (Keith David), she kisses him, thinking that he would turn Naveen human again. However, she turns into a frog herself. Now setting off to see Mama Odie (Jenifer Lewis),  to make them human again, with their friends Ray (Jim Cummings) and Louis (Michael-Leon Wooley), the audience discovers along with Naveen and Tiana, that what you want, isn't exactly what you need... you just have to look deeper.A absolute wonderful film, which the family can sit down and watch over and over again. As with any other Disney film, 'The Princess and the Frog' focuses on the theme of not giving up and finding true love. This gives today's youth a positive message of 'when the going gets tough, the tough gets going', as shown by the Fenner brothers, when they reject Tiana's payment for her resturant. In my opinion, I think that the directers, Ron Clements and John Musker has taken inspiration from their past films like 'The Little Mermaid' and 'The Lion King' which they have incoparated into the film. For example, the scene in which Ray sings 'Evangeline' seems inspired by the scene in 'The Little Mermaid' when Sebastian sings 'Kiss the Girl'. I thought that this was very clever and I must say, Musker and Clements shot it beautifully. Set in 1912, New Orleans it can be seen that the crew of the film have definately done their research and they show what life was like during that time wonderfully. I think everyone, old and young will definately enjoy this film, as the songs and storyline are so gripping that you can just forget everything happening in your life, whether good or bad and experience Naveen and Tiana's journey."
    },
    {
      "rating": "6",
      "text": "Overall This Movie Is Not The Worst Or The Best.. I Would Have Liked To See More Classic Stuff In This, But You Cant Please Everyone... The Voices Were Meh... Great Writing That Makes Up For The Voices... Overall It's A 6.."
    },
    {
      "rating": "7",
      "text": "I'm glad that Disney brought back its classic flare from classic fairytale stories. It's definitely a good movie but not as good as those classics in the 30's and the 40's..........."
    },
    {
      "rating": "8",
      "text": "The Princess and the Frog represents Disney's return to form, and to their natural home territory of traditional animation. It's a rich, heartfelt and involving story of a girl with a dream, and the journey she has to undertake to get there. The setting of 1920s New Orleans is lovingly and beautifully re-created by animators, and Randy Newman's wonderful Jazz and Blues heavy score adds further depth to the film. The voice cast are incredibly strong, with Anika Noni Rose making our protagonist Tiana, a poor waitress with big dreams, very easy to connect with and relate to (and she has a great singing voice). Bruno Campos' amphibian Prince Naveen, Michael-Leon Wolley's Louis Armstrong-inspired Louis the jazz-loving alligator, Jim Cummings' Cajun firefly Ray, Jenifer Lewis' bonkers blind shaman Mama Odie and Keith David's voodoo villain Dr Facilier all impress, and complete a very weird and wonderful cast of characters. The animation is great, the songs are great and the characters and story are also great. The only thing that lets The Princess and the Frog down is something beyond its control - the press coverage (both positive and negative) that the film received for having \"Disney's first black princess\". I really think too much was made of this - I don't remember the press picking up on Pocahontas being \"Disney's first Native American princess\" or Mulan being \"Disney's first Chinese princess\". Disney generally choose characters appropriate for the story being told, and it's the same case here - of course a story set in city like New Orleans, that African American culture is so much part of, is going to have a black princess. I personally feel anyone reading too far into why Disney now finally has a black princess (or taking offence at the film being set in New Orleans so soon after Hurricane Katrina) is taking the film a little too seriously. The film doesn't really make any sort of comment on race, or the state of the world, and never aims to - it's an animated family film, and only aims to take its viewers on an amazing journey. Hopefully you'll be able to recognise that The Princess and the Frog isn't some sort of veiled racial propaganda or some malicious tool of offence, but simply Disney proving that it's still the very best at what it does. The story is well-told, acting and singing top-notch, animation flawless and beautiful and the score truly evocative of the state of Louisiana. It's a fine animated film that'll bring joy to all but the most hardened and confrontational of hearts."
    },
    {
      "rating": "7",
      "text": "On its first act, the film is effervescent mostly due to its powerful music, but \"The Princess and the Frog\" starts to sound much more interesting on its second act, as Tiana and Naveen's chemistry turns the story into a heart-warming, satisfying experience."
    },
    {
      "rating": "8",
      "text": "Its not the best princess themed Disney film, but what you have here is a witty and colorful animated film with some heartfelt characters."
    },
    {
      "rating": "9",
      "text": "I firmly believe that \"The Princess and the Frog\" is one of the best non-pixar animated film ever to be created. There has never been a better argument for the revival of traditional animated films. \"The Princess and the Frog,\" follows of the story of Tiana, a young woman who dreamed of opening her own resteraunt since she was a child. She's so close to her dream, when she gets outbid for the building she wants, and worse; turns into a frog due to a voodoo spell. Tiana and the spoiled Prince Navine must find a way to turn back into a human. This film is visually enchanting, with gorgeous 2D animation that even rivals modern day CGI. One particularly dazzling scene, is during Dr. Facilier's song, \"Friends on the Other Side,\" a vibrant colored, and elaborate musical number that will win the audience's attention with ease. So, there are lots of songs, as I should probably mention. Some worse than others, but there's nothing terrible. They range from mediocre, and even incredible. Randy Newman pens all these songs, and composes the score. All Disney princess films have their magic. This time around, there's voodoo. Certainly there will be discerning parents, and sensitive children may be frightened. I personally enjoyed this unique, and far less generic take. It's darker, and has much more potential. It also provides a lot of unique bits in the film. The cast is colorful and unique, the movie is hilarious, and at times, quite emotional. There may not be a lot of tears, but you wouldn't be human not be touched by this wonderful film. I am disappointed that this movie has yet to spark any new 2D developments with Disney. This has to be one of the best examples of 2D animation out there. \"The Princess and the Frog\" should not be missed or overlooked, it is a treasure."
    },
    {
      "rating": "9",
      "text": "Disney's 2d animation is back and I hope is here to stay. Having being in the right target demographic during the Disney Reinassance I saw most of those movies. It's a shame that 3d animation and Shrek-style movies had become the \"rule\" relegating 2d animations to \"just for kids\". With that in mind i saw The princess and the Frog knowing it was just the breath of fresh air I needed from contemporary movies. I loved, loved, loved this movie. The characters are funny but not annying, the plot is not simple to follow if you're young kid but it's interesting enough to keep older audiences entertained. Music is not the typical \"I am sad, I want a non-specific-generic more\" but is vibrant, consistent with the setting and, while its' not trying to replicate \"a whole new world\" , it really stands on its own. I'm not going to spoil anything but this movie will make you laugh, will make you cry, will make you feel like you're a kid in the 90's again. Watch this movie you're not going to be disappointed!"
    },
    {
      "rating": "5",
      "text": "\"The Princess and the Frog\" wanted to be greatest come-back but It's wannabe. Old way that it was useful in 90's but in 2000's not. Tiana is too politcally correct, she has too virtue and no imperfection. Then, Tiana has no feedback. I'm sorry, I tried to love this film but I can't it."
    },
    {
      "rating": "8",
      "text": "\"The Princess and the Frog\" has all the emotions and wonderful songs, but somehow falls short in storytelling. Don't get me wrong as to think the storytelling in this film is all bad, as it is still good, yet not too good. First off, I truly loved the animation, as it brought the old Disney look, and enhanced it from the past CG releases from Disney. With the tale of Tiana, you get a strong woman who works really hard to get what she wants, and I love that about her. Tiana is an important role model, and though she may not be as perfect like other princesses, she is definitely one of my favorites, as she actually tries hard to achieve. Her story with her father is touching as well, and can shed a tear, but not as well told as others already told. \"The Princess and the Frog\" definitely falls after they he meets Prince Naveen and they have to look for Mama Odie. While fun and brisky, this large part of the story is not that well crafted and results to more as a kid-flick. The ending is predictable  everyone gets what they want, except the villain. Overall, I think that the \"The Princess and the Frog\" is Disney's strongest since \"Lilo and Stitch\" or \"Tarzan\", as it uses an old style Disney appearance, which does benefit the movie. Although I debated on a 8 and 9, I ultimately gave it an 8, due to the fact that the movie struggles with telling the tale of Tiana and Naveen as good as older Disney princes and princesses could."
    }
  ],
  "recommendations": [
    "tangled",
    "moana",
    "anastasia",
    "the_lion_king",
    "atlantis_the_lost_empire",
    "over_the_moon",
    "aladdin",
    "luca",
    "klaus",
    "winnie_the_pooh_blood_and_honey",
    "the_sword_in_the_stone",
    "cinderella",
    "rio",
    "trolls",
    "treasure_planet",
    "rio_2",
    "the_prince_of_egypt",
    "vivo",
    "finding_nemo",
    "the_book_of_life",
    "strange_magic",
    "toy_story",
    "spirit_stallion_of_the_cimarron",
    "the_polar_express",
    "wolfwalkers"
  ]
}