{
  "id": 130,
  "title": "The Hobbit: The Battle of the Five Armies",
  "starring": [
    "Ian McKellen",
    "Martin Freeman"
  ],
  "runtime": 144,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "Immediately after the events of The Desolation of Smaug, Bilbo and the dwarves try to defend Erebor's mountain of treasure from others who claim it: the men of the ruined Laketown and the elves of Mirkwood. Meanwhile an army of Orcs led by Azog the Defiler is marching on Erebor, fueled by the rise of the dark lord Sauron. Dwarves, elves and men must unite, and the hope for Middle-Earth falls into Bilbo's hands.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xT98tLqatZPQApyRmlPL12LtiWp.jpg",
  "categories": {
    "plot": 4.943396226415095,
    "acting": 5.423076923076923,
    "ending": 4.6571428571428575,
    "soundtrack": 6.5,
    "cinematography": 7.5,
    "familyFriendly": 6.0,
    "funny": 4.666666666666667,
    "action": 5.222222222222222
  },
  "reviews": [
    {
      "rating": "0",
      "text": "I was as irritated as most people when I heard that Peter Jackson would split The Hobbit into three movies because it was obviously a decision based on nothing more than getting as much money as possible, but even I never imagined that he would stoop to making a movie like Battle of the Five Armies (a.k.a. Battle of the 25 Armies plus a couple of random giant mountain goats and a pig thrown in for good measure).\r The CGI was as bad as something you would see in a B movie—even worse than the previous two Hobbit films. But even more noticeably, the script took a dive to rock bottom. Within the first half hour, such utterly laughable clichés as “You make me feel alive,” were spoken in a cheesy love scene that seemed like something straight out of Saturday Night Live, except that the audience was apparently supposed to take it seriously.\r Shortly before the battle started, there were a few much-needed moments of comic relief, and I thought the film might possibly turn around. But all my illusions were soon shattered during the ten-minute scene where Thorin walks on top of the ice that Azog is floating under with his eyes open, following the orc and apparently waiting for him to break through it, when—suprise!—he does, and (spoiler for those who have not yet watched the ten-minute scene that made this obvious) kills Thorin. Alas. It might have been sad if I hadn’t been waiting around for ten minutes knowing that he would get killed.\r Things were looking grim for the dwarves when who should appear? Our heroes the eagles, of course, who have managed to bail out the protagonists in every single movie of the trilogy.\r Although I couldn’t stop laughing during the scene where three dwarves find completely random giant mountain goats with no riders in the middle of the battle and proceed to ride them up a mountain, the worst part of the movie was easily the ending. As if the movie isn’t long enough, the audience is not only forced to watch Bilbo go all the way BACK to the Shire, they have to re-watch footage from Fellowship of the Ring! I knew it was a bad sign that Peter Jackson actually made a movie shorter than three hours (although it felt like six)—apparently, he had so little material for this movie that he had to re-use material from his original trilogy.\r When Tauriel discusses love with the abominably cliched line “Why does it hurt so much?” I think she described the feelings of most of the audience enduring the latest Hobbit movie."
    },
    {
      "rating": "10",
      "text": "The movie was good, i loved the visual effects, great work from Freeman and Armitage, exhilarating battle sequences  and apleasing connection to LOTR."
    },
    {
      "rating": "2",
      "text": "The Grand finale to the Hobbit trilogy left me terribly disappointed. I feel as if it did a discredit to the amazing book behind it,  and the tales of Middle Earth as a whole.\r The CGI was awful and unfortunately plentiful. The battle scenes were rife with a gawdy comic feeling, rendering all attempts at reiterating the epic scenes from the ring trilogy useless.\rThe pacing and dialogue were incredibly inconsistent, and many sections dragged on for way too long.\r A very disappointing end to the movie adaptations of Tolkiens gift to all of us."
    },
    {
      "rating": "1",
      "text": "A slow and tedious close to a series that lost its edge a decade ago.\r Here's a few reasons why Christopher Tolkien is a saint for turning down millions to keep Jackson from defecating on his father's work:\r 1) The Necromancer story arc ends up just being another crappy fight scene (why the hell is Saurumon's magical power Kung-Fu?) that feels more like a teaser for the LotR series. This would have been a perfect opportunity to expand on the back stories and roles presented in the Silmarillion. Doesn't happen, instead we get a lame light show.\r 2) What about the fight scenes we've all been waiting for? This would have also been an AWESOME opportunity to show off more of Beorn doing cool bear-man stuff but he's limited to a 2 second cameo.  Instead we see more combat involving Bard's 12 year old son. Great call.\r 3) The epic battle and armies feel more like rival gangs. I swear to god when the dwarfs show up it feels like I'm watching The Warriors. This battle didn't feel anywhere near as epic as it should have. It's not like cost is a limiting factor when everything is CGI. I don't understand why they didn't render in larger armies.\r 4) The movie moves at a crawl. They really drag out Thorin's Dragon Sickness and the only reason seems to be they gotta fill up time. I love it when Thorin sobers up and then asks his crew if they're willing to go out and fight... which is what they've been pleading for this entire time. What was with that sinking into gold scene? The CG was so bad I thought we were going to get a Beast Wars cameo.\r 5) The movie opens with Smaug's attack on Lake Town which SHOULD HAVE HAPPENED IN THE LAST FILM. Smaug's attack and death feel so anti-climatic that I'm 100% sure the decision to keep Smaug alive into this movie was just so Cumberbatch could help in the film's advertisement. For Christ's sake he has 3 lines.\r 6) Martin Freeman looks bored. Maybe the rest of the movie poisoned my mood but Bilbo seems like he's reading off lines. Hell, he doesn't even feel like the film's hero, Alfrid the Master's lackey gets more screen time.\r All of this has been done before and done better in the original trilogy. This could have been something great if Jackson and crew didn't phone it in as a cash grab.\r But I should end on a positive note: Hugo Weaving is still a bad ass and the only reason why this film doesn't get a 0."
    },
    {
      "rating": "10",
      "text": "A great ending to one of the best trilogys in its genre. I loved every part. Great in every possible way. We will all miss this characters, Middle Eart and Peter Jackson audacity and creative vision. All six films are now part of the greatest fantasy films ever made. I'm glad i had the chance to witness them all."
    },
    {
      "rating": "10",
      "text": "woooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooow"
    },
    {
      "rating": "8",
      "text": "In all honesty, I only saw this because I was curious. But I wasn't expecting much.  The trailers displayed a cgi-heavy, overlong movie that was basically one big climax. So imagine my surprise when it turned out to be an intriguing film that is undoubtedly the best of the three.  Of course, it was still ridiculous in some parts but the script makes up for that. And I did not think I'd say that about this movie. Trust me, it's better than the trailers tell you, even if you didn't enjoy the first two, this one will surprise you."
    },
    {
      "rating": "4",
      "text": "The parts of the book that were actually included in the movie were done somewhat decently.  However many of the added stories weren't very well written.  Bard using his son as a component of his bow to kill Smaug was insulting to the excellently done dragon.  The conversation between Legolas and his father was very cringe worthy and nothing looked more awkward than Galadriel carrying Gandalfs unconscious body.  The Hobbit is also not supposed to heavily tie into Lord of the Rings.  They are two very different tones that clash uncomfortably.\r I encourage the use of CGI in special effects but it needs to be done correctly.  Including practical effects gives your CGI artists something with real light and texture to work off of.  That could have helped because a lot of this movies CGI looked like it needed work or they ran out of money."
    },
    {
      "rating": "5",
      "text": "\"Too little butter spread over too much bread.\" That is my impression of the Hobbit series. It is a great story, however I found it to be very unnecessary to make it into three movies when I could have be much better in one four hour movie."
    },
    {
      "rating": "2",
      "text": "Mostly rubbish, a disgrace to the fine Tolkien's story. Too much mindless action, too much Disney style jumping around, altogether silly and unnecessary love story that is not in the original, almost everything Jackson and his team added to the story is of mediocre quality."
    },
    {
      "rating": "8",
      "text": "Time to say goodbye to middle earth for the last time.\r The story is about Dwarven party led by Thorin Oakenshield finally reclaims their kingdom of Erebor, the vast treasure draws out now only the wrath of Smaug but also the army of men and elves, who want the fortune for their own.\r Let me give you a quick feed back of the other two films then to this one. A unexpected Journey I thought was pretty amazing... when I first sawed it, after a couple of watchers later it's not as amazing as the first time, but I still enjoyed it even with the problems showing. Desolation of smaug in my opinion was way better and way more fun and better film paste then Unexpected Journey, and Smaug as the villain was icing on the cake. Now we got Battle of the Five Armies and I can conform that the movie is actually pretty good and it's a solid finale to The Hobbit series.\r Peter Jackson directs this movie in a way that middle earth feels like a real pace that we can go to anytime we want and I got to give him that. Jackson clearly adores middle earth as he really doesn't want it to end and I can see why, it probably makes him feel at home directing these movies and sometimes leaving you home behind sucks.\r The visual effect's at times looked really good and once again this movie had that shiny mix with grey color with the character's Armour and the background of beautiful New Zealand. But I like the Lord of the Rings effect's a little better, why you may ask. because the effect's in that movie still holds up today but that's just me... maybe.\r The all the cast members did a outstanding job, Ian Mckellen will always be Gandalf because his the best, Martian Freeman did a fantastic job playing Bilbo Baggins and to be honest I like Bilbo Baggins more then frodo in my opinion.\r My biggest problems with the film is some of the visual effect's in the movie looks very noticeable and I had the same problem with the other two films. The love story between Kili (The Dwarf) and Tauriel (The Elf), I didn't find their romance plot to really needed for the film and when something bad happens to the two of them I just sitting thinking \"Well stuff happens\".\r Overall The Hobbit: The Battle of Five Armies is a solid final to the Hobbit series with some problems there and then. Good action scenes, good performances and a brutal fight scenes."
    },
    {
      "rating": "4",
      "text": "This is not a good film, Jackson has massacred this classic novel and undone his good work with LOTR."
    },
    {
      "rating": "8",
      "text": "Peter Jackson's Hobbit trilogy has so far been entertaining yet a disappointment in comparison to it's Lord of the Rings bigger brothers. However after a promising final act in the Desolation of Smaug things were looking up for The Battle of the Five Armies...luckily that pulled through.\rThe Battle of the Five Armies takes place immediately after the events of the Desolation of Smaug, beginning as Smaug reaches Laketown. As Bilbo (Martin Freeman) the dwarves retake the city of Erebor in the Lonely Mountain, war is on the horizon as Thorin Oakenshield (Richard Armitage) becomes blind with wealth and power; the citizens of Laketown are left without a home; the woodland elves seek a treasure stolen from them and the Orc's led by Azog the defiler (Manu Bennett) want to claim Erebor to give them an upper hand in the coming age of the Orc.\rThe majority of the film is action sequences, beginning with Smaug's destruction of Laketown and culminating in the titular battle of the five armies. As such the pacing for the film is much faster than that of any of the previous Middle Earth films, allowing much less room for downtime and filler. The shorter runtime also lends in it's favour as the Hobbit films thusfar have been rather bloated with relatively pointless and at times boring sequences with little relevance to the actual plot.\rMy biggest problem with the two previous Hobbit films is the overuse of some shoddy CGI effects, BoFA does improve it's CG quality somewhat but ultimately pays the price again by literally swamping the film in CGI, particularly the opening sequence and the entire five armies battle. The CGI is so excessive in the film that it even produces frame rate stutter, something relatively unseen in the film industry but something extremely common in the video games industry. This could be due to the use of 48FPS over industry standard 28, but whatever the reason it does lower the quality of the film.\rThat being said this is the best Hobbit film in the trilogy, what it lacks in particular defining moments (such as AUJ's Gollum scene & Dos' Smaug scenes) it makes up for in scale, pacing and a very satisfying and brutal battle sequence that lasts most of the films second half; the biggest in Peter Jackson's Middle Earth films to date.\rA fitting farewell to Middle Earth, Bilbo, Gandalf and the rest of the characters we have come to know and love over the past 13 years and despite it's faults an extremely enjoyable film."
    },
    {
      "rating": "6",
      "text": "This, in my opinion, was the only decent one in The Hobbit line of movies, and I am a HUGE fan of Tolkien's Epic. But there are still some things going wrong here. First of all, I am really bothered by how you guys went through all the trouble of making the orcs look all badass, and then they act like they have never had fighting lessons in their life. Even little dwarfs and hobbits are running around killing them left and right. It really looks kind of like you're playing Dynasty Warriors or something.The entire screenplay is written in an asinine manner. Gandalf keeps telling these morons that there is a huge army of Orcs on the way, but everyone stands around and argues with each other rather than preparing an organized defense. Thorin stands there and watches his cousin's people get slaughtered, and then without any sort of explanation snaps out of \"the spell\" (gold can cast spells in this movie, but Gandalf apparently cannot). But does Thorin immediately rally the troops to go fight? No, he instead makes a long melodramatic speech, and when they finally do run out it looks like maybe 15 Dwarves. What the hell are 15 more Dwarves going to do in this situation? (Let's go after the leader, we'll just easily ride right on through this army that has been destroying us for a half hour now.)I couldn't stop laughing when the giant troll thing knocked himself out to punch a hole in the wall. But I also had to wonder why they even brought trebuchets at all just to use them for about 15 seconds.Here you have Gandalf, now he is supposedly like the best wizard around (even before his Zen Buddhism experience), but he really doesn't do anything wizardly. I mean, these guys are surrounded by orcs and giant worms (what happened to the worms by the way; they were there for one scene then they were gone), you would expect to see him shooting fireballs and all kinds of other stuff like he did in LOTR trilogy. But no, he doesn't even bother to charge his staff with lightning or anything when he hits fully armored orcs in the face. Maybe he invested too many stat points into strength and not enough into Magicka? If he was going to play battle-mage then why was he not wearing heavy armor? Gandalf and Bilbo Baggins pretty much stand there most of the time and shout things like \"fall back.\" I guess at some point the screenwriters remembered that Bilbo has a magic invisibility ring, because they decided to have him use it for no other purpose than delivering a message in the middle of battle that really didn't do any good anyways. He could have been running around all invisible-like killing orcs, but instead he was the mailman.Elf chick decides to go rescue her boyfriend (not in the book), who inevitably dies saving her life. Now the funny thing here is that elf chick herself has killed countless orcs during the course of the movie, but she gets tossed around like a ragdoll by this one. But of course, Legolas (also not in the book) comes along and is able to elf kung-fu this orc who for some reason seems to be able to fight a hundred times better than any of the other obes. This after somehow jumping up a trail of falling rocks and without even appearing to have super speed. It was absolutely spectacular to witness, though I have to question the physics of this universe they are in.Elf king tells Legolas to go find Strider (Aragorn) who, according to the timeline of the stories, was still a child growing up amongst elves. You are telling me that the elves don't know where is the human ranger in their own kingdom?All in all, this was not a terrible movie, but it was a terrible Tolkien port. Most of the Tolkien fans are adults now. We like adult movies that also feature some form of cohesive logic with regards to how the world operates and what constitutes a wizard. This series was so obviously meant for children. 5/10, +1 for all the laughs.Peter Jackson, retire."
    },
    {
      "rating": "10",
      "text": "Amazing, amazing trilogy. Wow, what an add on to Lord of the rings, this entire new trilogy is just adding to the masterpiece that is Middle Earth, a must watch."
    },
    {
      "rating": "8",
      "text": "This movie was great, but, it reached for the stars and missed by only an inch. The Hobbit: The Battle of Five Armies was very great to watch due to it's visually striking CGI which is no surprise to me, which also adds up to the extraordinary performances of the entire cast. This movie really got me going on it's climatic battle at the end which had me at the edge of my seat, but then I was very disappointed with the length of the film, unlike the other middle-earth movie that were almost 3 hours long, but this was only a mere 2 hours and 24 minute film which made the film feel a little rushed. In the future, if there is a future for the franchise, I hope the next films are just as great as the whole saga."
    },
    {
      "rating": "8",
      "text": "One of the best trilogy I have ever seen, in sum it's a masterpiece, composed of a blending action and humor - and even a bit of romance - to create a well-paced tale that ends up being almost as satisfying. \"The Hobbit\" is visually stunning in all its three-parts, beside the Oscar-worthy performance by Freeman as a Bilbo (Freeman was born to be a hobbit), also I couldn't ignore the great performance of all cast, the amazing music by Howard Shore that reprised from the previous trilogy and the genius director Peter Jackson who gave us this masterpiece trilogy.The disadvantage of \"The Hobbit\" is the ending of part 1&2, where the film ends with ellipses rather than a period, we know the story will be continued, but with a little effort and some clever writing, Jackson could make each chapter feel like its own complete story. The result is probably the most dissatisfying element of the film.\"The hobbit\" is surely worth to watch, just let your senses enjoy, even If \"The Hobbit\" doesn't equal the achievement of Jackson's earlier Middle-earth movies."
    },
    {
      "rating": "10",
      "text": "A very Good Movie from 2014/2015. I enjoyed each and every scene that was part of the movie. I mean, it has great sound, great effects and great acting. It is a very great movie that i recommend checking out."
    },
    {
      "rating": "10",
      "text": "Very good film. According to my opinion, the film allows to explore well the different characters, sometimes with inventions from Peter Jackson (like for the saga's movies) but this additions are generally very good. Simply I love this story."
    },
    {
      "rating": "6",
      "text": "Hollow FinaleBattle Of The Five Armies might have impressive visuals and impressive performances, But this movie focuses WAY TOO MUCH on CGI instead of the story and an overly bloated script."
    },
    {
      "rating": "8",
      "text": "Read the Hobbit it is unlike the more sophisticated Lord of the Rings trilogy. Well the hobbit is one simplistically written children's book. They did a good job of fleshing out these films and characters from one children's book. Not as epic as LOTR movies, but a darn good try considering the limited and simplistic source material they had to work with."
    },
    {
      "rating": "6",
      "text": "This is based on the trilogy as a whole.The Hobbit is a wonderful book but it simply doesn't have enough content to be spread between three movies. Each movie doesn't really tell a cohesive story on its own and while I judged the Lord of the Rings as a whole because it improves an already amazing experience, The Hobbit has to be judged as a whole because the movies make no sense in any other method of viewing. Even still they hit middling at best and never truly great."
    },
    {
      "rating": "10",
      "text": "The Battle of the Five Armies is definitely the best of the Hobbit trilogy. Amazing special effects, great actors and epic battles. One of Peter Jackson's best movie"
    },
    {
      "rating": "8",
      "text": "The timekeeping of the movie is pumped, though quite skillfully. This is the reason I give it 8 instead of 10. Simultaneously I am quite surprized how childish and even humble \"The Hobbit\" was changed to nearly a saga. I really appreciated the Torin's part of the story, and a wonderful play of all actors."
    },
    {
      "rating": "10",
      "text": "This movie was everything it should have been, and the extended edition is even better. It mostly focuses on the reunion of the different species on Middle-earth to avoid destruction and save themselves from the threat of the Great Eye (aka Sauron, an all-powerful ball of flame with a dark pupil). He returns to the battlefield and battles sorcerers in one of the best scenes in fictional history. It would seem any scene is scary as long as the Great Eye is involved in it. The only real buzzkill is knowing Smaug is making a comeback only for him to appear for like a minute and be defeated, just like Ronan the Accuser in the boring, forgettable \"Captain Marvel\"."
    },
    {
      "rating": "7",
      "text": "The film definitely suffers from it's theatrical release so if you do watch this go for the extended release, other than that the film is not as good as it's predecessor but offers a nice conclusion to a trilogy on the downside it takes 5 pages from the book and try's to make it an epic story that seems to go on for to long featuring a lame subplot about Legolas finding the 5th army which takes away from the main plot of the film, though still has unnecessary CGI which distracts you from the great battle but the film manages to make it boring halfway through"
    },
    {
      "rating": "1",
      "text": "The worst episode in an already appalling trilogy, The Battle of the Five Armies finally erases any doubts on the cashgrab nature of The Hobbit franchise, filling two and a half hours with action scenes and mindless dialogue, and tonnes, tonnes upon tonnes of CGI. I don't think there is one consecutive minute of this film which doesn't have CGI. What happened to The Lord of the Rings mentality, people say? It got corrupted, ironically in the same way Thorin gets corrupted in the movie; but unfortunately it doesn't redeem itself.\r And let's talk more about the CGI. One would naively expect, since it's the primary feature of this movie, that it be at least done well. And it isn't: half of the scenes look completely fake - there is no desire anywhere to produce at least a technical masterpiece. The Return of the King was made with a third the budget and more than 10 years prior, but it's still technically better, from the costumes to the makeup to the scenery.\r Now for the editing: especially at the beginning, there are several weird cuts to unrelated scenes, and it all results in a confusing storyline (not in the good sense, not in the Pulp Fiction sense), with the battle scenes lasting forever, to a point when, 90 minutes in, one finds theirselves asking \"Are we done yet?\" Moreover, they decided NOT to complete The Desolation of Smaug with its natural ending, that is the slaying of the dragon, but to drag it at the beginning of the third movie, I assume in an attempt to force people who liked the second to buy a ticket for the third to find out what happens to Smaug, with a cheap sit-com mentality.\r The Battle of the Five Armies is a pain to watch, never wants to end, and if you were to take a nap during the middle of the film you wouldn't lose one single important element of plot. It's not epic, it's not funny, it's not beautiful, it's not anything positive really. The producers must feel ashamed, but don't say you weren't expecting this."
    },
    {
      "rating": "5",
      "text": "The unintended comedy with the ridiculous Legolas stunts(far worse than in any other LOTR movie) is the cherry on this action porn cake of a movie.\r I appreciate that Jackson tried to spend time and effort on Thorin and some character study here and there, but ultimately it's action porn from start to finish with some really terrible decisions here and there, namely, death of Smaug 15 mins in the movie, what was the point of the huge cliffhanger of the last movie, love story between dwarf and elf which is to say the least unlikely and has the basis of the two having talked for a grand total of five minutes across prison bars in the last movie, Saruman, Galadriel and Elrond going into Dol Guldur like a ninja team to kick all of the Nazgul and Sauron's asses, going about it with martial arts move and a mix of big flash type of magic...it's silly really, all over the place.\r I liked Bilbo, liked Gandalf still, liked quite a few characters, perhaps more than in LOTR which was even more of a cliche parade, but really that doesn't save this movie from being an action porn movie. If you want dumb action entertainment in an LOTR world sure, this does the trick, but by no means is it a great movie, or even a good movie, it's just an action flick in the LOTR world.\r I'd give it 4 but I'll add 1 for all the laughs I had at every Legolas action scene."
    },
    {
      "rating": "5",
      "text": "Over-hyped, overrated and disappointing. The third and final installment in the Hobbit trilogy is disappointing for LOTR fans who have seen all the movies and read all the books. It's obvious proof that the Hobbit movies were dragged out way too much. I could understand two movies, but having a third movie was clearly to make more money and ended up ruining the experience. As much as I loved the book, this movie fails to maintain anything close in quality to the book. The acting is fine, but the movie itself is just a failure to the book. The fight scenes are far too long and are way too convenient. The important characters can literally fight off hundreds of orcs in hand to hand combat until the plot demands otherwise. The story is too slow and the fighting is too extensive. As much as I hate to say it, this hobbit movie is disappointing. Read the book or if you're a die hard fan watch it, but don't expect much."
    },
    {
      "rating": "5",
      "text": "Watching the final chapter of The Hobbit trilogy doesn't feel like an experience you engage with out of anticipation, excitement, or wonder.  It's one you do out of obligation.  The Lord of the Rings trilogy, despite their own warts and occasionally misguided narrative decisions, are perhaps some of the most influential and emotionally engaging fantasy epics to ever be put on-screen.  The hurdles jumped through to put J.R.R. Tolkein's trilogy on screen is one of the most amazing feats of creativity and ingenuity in cinematic history.   But Peter Jackson, whether in frustration or in delusion, has somehow managed to completely lose course of what made those films resonate.\r What we're left with is an effort to take a generally light-hearted adventure tale, and to make it an enormous, emotional spectacle filled with characters who we are told to care about because... well, we are told to care about them.  For all its thousands of on-screen characters engaging in thunderous action, and the dramatic soundtrack trying to emphasize each moment as a tragic and important, very little of it comes to mean anything.  The film's final action scene more or less encompasses half the movie, but unlike any of the Lord of the Rings movies, the narrative of these battles never feels clear.\r The film is not without its talent.  The talented cast aren't given much, but Richard Armitage's Thorin and Martin Freeman's Bilbo both manage to have atleast a handful of moments that resonate with one another and form a somewhat human core to this final act, even if it never felt as powerful as that of Frodo and Sam.  The rest of the cast reads their lines well and with intent, but as with the trilogy as a whole, it all ultimately feels fake and contrived.  The romance between the elf Tauriel and the dwarf Kili, and element that never existed in the books, never feels real or something we as an audience are meant to attach too.  Like the actors on countless green-screen sets talking to elevated tennis balls, we are told to believe that we are staring at something real and to respond accordingly, but we just know it's a lie.  Instead it just reads hollow.\r As with all of Jackson's Middle-Earth films, the artistry behind the world creates some striking vistas and beautiful ornate armor and creatures.  However, it still continues to be a shame that we lose so much of the tangibility in the director's increased reliance on CG instead of the beautiful (and sometimes terrifying) work created by the practical effects artists in the Lord of the Rings trilogy.  Moment to moment, it becomes harder to believe what any of what you're seeing is real.  Billy Connolly's own character was entirely replaced by a CG representation, which tragically illustrates the lengths to which he'll allow the work of his actors and artists be replaced by hollow animated puppets.\r In the beautifully put-together and extensive behind-the-scenes documentaries in the Lord of the Rings trilogy, there is an exceptionally poignant moment when Peter Jackson is directing the final shot with Frodo, played by Elijah Wood.  Jackson, trying to fight off his tears, struggling to say \"cut\" and finally end the filming, and instead continues to ask Wood to try the scene again.  Once he finally accepts the reality that his time with his cast is over, he embraces Wood and thanks him as the two shed tears together, ending their incredible once-in-a-lifetime journey with one another.  It is a heart-breaking moment for both the crew, as well as we as the audience.  I can't help but wonder what Jackson's attitude was when filming the final shot of these films.  Was it the same challenge to let go?  Was it exhaustion?  Whatever it was, I'm sure he could add some CG tears later to make us believe it's supposed to be a sad moment."
    },
    {
      "rating": "5",
      "text": "This film is sadly all style and little substance. While I am not a huge fan, I saw and enjoyed the first two hobbit movies, they were entertaining and well executed. This film is where the cracks began to show, there is simply not enough source material in one book to make these three movies, at the very most two movies would have been enough. While we do get the ending to the story it is after nearly three hours of what feels like stalling, the first fifteen minutes of the movie are the best imho. This really felt like a money making exercise to me."
    },
    {
      "rating": "1",
      "text": "Not fan of these kids books nor the overly long and dull Lord of the Rings movies, so I'm totally not the target audience for this. That said, I enjoy quite a bit of sci fi/ fantasy films. This is not one of them. It suffers from all the typical modern Hollywood bloat and excessive cgi. There is quite literally NO STORY to this film. No arch at all. Amazingly dull."
    },
    {
      "rating": "2",
      "text": "A poor excuse for a finale to the Hobbit trilogy. Although I feel that the other two films were also rather weak, Jackson's failings as a storyteller really come into their own in The Battle of the Five Armies. The film is little more than a showy collection of battle scenes and special effects that drown a poor screenplay, and in themselves are as tiring as they are bloated and pointless. Emotionally uninvolving, uninspiring and entirely forgettable: give me Jackson's old splatstick any day of the week!"
    },
    {
      "rating": "6",
      "text": "It wasn't bad. The battles (battle?) were (was?) pretty impressive, and the characters weren't devoid of emotion. In short, the film wasn't soulless, but that isn't saying much. The film's main problem comes from its conception, the fact that it's based on the third act of a single novel. That makes this film, in effect, just one big third act stretched into two and a half hours. So it starts with finale-style action (Smaug dying) and continues with it right through to the end. Because of its source material, it can't really have a beginning, middle and end; that's what the first two parts of the trilogy are. The Lord of the Rings was based on three books with their own three acts, each part of a greater story arc; Peter Jackson has his greater story arc with the Hobbit, but that's just the plot to the book. Each individual film doesn't really have its own individual story, and that really tells in the Battle of Five Armies. It feels like the end of a film and not a film in itself. That said, it doesn't do too badly at concluding Middle-earth. It's no classic, but it's still worth seeing, if just to get a sense of closure with Tolkien's universe."
    },
    {
      "rating": "6",
      "text": "Loved the second LOTR movie (the one with all the fighting in it). So I expected to like the battle of the five armies as well. But it has none of the easy flowingness that the LOTR has. Boss battles are to long and just plain stupid."
    },
    {
      "rating": "6",
      "text": "I`ve really tried to stay positive to The Hobbit trilogy, but it`s easy to understand why people respond with negativity. Personally, I enjoyed the film all the way until the battle begins. And for a while, I enjoyed the battle as well. It all follows the book to an acceptable point (except from the trolls, what are they doing there?).\r Suddenly, Jackson decides to make THAT turn away from the original story, and we don`t follow the battle of the five armies any longer, we follow Legolas, Tauriel, Fili, Kili, Dwalin and Thorin vs Azog, Bolg and another army. All that in an ice covered \"battle arena,\" just to make the whole thing more epic. And suddenly, the battle is over, and now Jackson wants to focus on Bilbo, and just Bilbo, without concluding the other story lines 100%. And then the film`s over.\r The book is a fine prequel to LOTR, why don`t make the movies that way? I liked this movie for the most, but mentioned plot twists makes it impossible for me to give it 10/10."
    },
    {
      "rating": "6",
      "text": "This is basically a good film, it is very impressive and done very well. And I guess I could say it's fun to watch.\r This third part, though, shows how unnecessary it was to split this one single book into three (!) parts, each taking about 2 hours and 40 minutes.\r The Battle of the Five Armies hasn't got much story in it, as it is mostly told on the first two parts of the trilogy, and here we come to the grand finale, where, well, most of the characters mainly fight. And fight. And fight. And fight. And fight.\r There were some moving moments, and some light moments, which is good, but still - most of the time I've seen only violence on the screen. There was simply not much else to show, because, as I said, there's not much of the story left to tell..\rBut how would we make a trilogy with each title lasting alone almost 3 hours?\rOf course, let's stretch those battles on and on!\r Well, that didn't work that well in my opinion folks.\r And yes, technically this is still a good movie. Still, I'm really glad this is over, as making three parts for The Hobbit felt like it's going to be mainly a slight torture to my wallet and not a fully enjoyable experience."
    },
    {
      "rating": "5",
      "text": "I preferred the other 2 by a wide margin, the start is the end of the second and after that imagine a 2 hours battle without any story developement. I should have rented it I guess."
    },
    {
      "rating": "8",
      "text": "Easily the best of the trilogy... while jam-packed with action (which is quite ridiculous at times), Battle of the Five Armies also has one of the best stories in the series, an Martin Freeman and Ian McKellen shine as Bilbo and Gandalf. Benedict Cumberbatch does an epic Smaug, and although the orcs are too easy to kill, this is still a fun and enjoyable movie."
    },
    {
      "rating": "1",
      "text": "The final entry to \"The Hobbit\" will leave you flabbergasted. The utterly incredulous \"Trilogy\" has finally hit rock bottom. Lines of actual dialogue are so few and far between that one can forget that the garbage in front of you is in fact a film, not a computer game. The characters are woefully underdeveloped as a result, and it is impossible to sympathise or care about almost anyone. The initial bit with Smaug was ok until he went all monologue **** on us and started the cliché \"bad guy talks to much before he gets undone by a seemingly impossible feat\" scenario.\r As I've hinted, my biggest problem with this film is the absurd special effects. There is so much going on, and the shots so short - you barely have time to understand what the **** is happening. The aerial shots overlooking the battlefield are done so from such a distance, it is near impossible to tell what any army is doing beyond the first 3 minutes of fighting. Everything down to the loading of arrows, dwarf shield walls, Orc charges, or anything else in the battle worth mentioning is done with a computer.\rI'd have really enjoyed actual people forming up a Dwarven shield wall, or loosing a volley of arrows, but it was not to be...\r The \"journey\" that Thorin Oakenshield  coming back from near insanity took approximately 3 days of my life in energy to care. The sequence when he comes back from the brink of insanity (walking around on the gold floor yada yada yada) is about 180 seconds of close shots of his glowing face, followed by a huge spanning shot of the room he is in. I chose this moment to use the toilet, and believe it or not, he was still ****ing around there when I came back.\r I can't remember if this character was in the book, its been so long, but lets take a moment to talk about \"Alfrid\" played by Ryan Gage\". Scratch that, I went and looked it up. He is an unnamed, barely mentioned character in the books. So why in ****s sake are we subjected to one of the biggest **** in film history? There is just no reason for him to be such an utter **** His plot within the film is totally inconsequential, ending with him running off dressed as a woman with boobs of gold. No I'm not kidding. His purpose, as far as I can gather, is to fill 15+ minutes of dialogue mainly showing just how much of a **** he is.\r My final rant, because I just can't bring myself to remember and write about more of this diabolical film, is of course about a particular character. I saved the best till last..... in a sense.\r Orlando Bloom. I think you are great. You are a funny guy and obviously switched on. Great in Pirates of The Caribbean, smashing in LOTR trilogy, and I especially enjoyed your performance in Extras (Ricky Gervais). With that in mind then...\r What the **** was Peter Jackson thinking? Ok, I get that you have to option to include Legolas, seeing as he would have been around, but like... What the **** was he doing?\rDuring this one film Legolas managed to:\r - Fly on a bat thing up into some ruins.\r- Drop 30m onto a troll then \"Ratatouille\" style 'drive' the troll (substituting hair for knives in the trolls shoulders)\r- Defy the laws of physics on several occasions\r- Slow motion run up a flight of stairs...........that are falling. Anyone with a braincell can work out why that is ****ing ridiculous, and that's saying something seeing as we are in a world riddled with magic.\r So my main point here is, there is such a fantastic array of things that you could have done within the realms of the world you are bringing to cinema. Indeed, Peter Jackson has the ability to access one of the most interesting, descriptive and magical worlds ever written about. Why did you have to include such utter **** alongside it?\r Other gripes include, but are not limited to:\r - The endless fight scene between Thorin and Azog. I naively thought it was a really cool way to end the fight, by Thorin simply stepping off the precarious ice shard they were both balanced on. Only to have my enthusiasm crushed when his stupid ****ing face showed up under the ice... and cliché \"bad guys eyes open again when you think he's dead\"\r - The **** with Legolas being told to go find \"strider\". At the time of that conversation, Aragon was 10 years old, and where did Aragon grow up? ****ing Rivendell. Thanks for the nostalgic **** Peter.\r - Finally, towards the end of the film... which may seem to take months, Gandalf makes a quip to Bilbo about his knowledge of the ring? So why would he wait 60ish years to rush off to Minas Tirith to read old scrolls documenting the ring? The answer is... he doesn't. He doesn't know about the ring until he sees Bilbo vanish completely on his 111th Birthday.\r Today I paid £8 to let Peter Jackson **** in my eyes and ears. I shan't make that mistake again."
    },
    {
      "rating": "7",
      "text": "The Hobbit: The Battle of the Five Armies Review\r Okay, it’s HighChronicler’s Review Time.\rThe Battle of Five Armies is the epic conclusion to Peter Jackson’s Hobbit Film Trilogy. I am a HUGE Lord of the Rings (LOTR) fanboy, HUGE. Like I will engage people in hours long conversations about it and they don’t even want to hear it. I am also a purist, I think that the Book should be reformatted and adopted to be the Screenplay, and from there reformat it to be the Script (Easy, right? Would save Millions of Dollars this way – you already have the script/screenplay/book.) I am willing to accept Peter Jackson’s adaptation of LOTR as the best book-film translation that we will ever see. EVER. As in Tenn’ Ambar-Metta. That’s right, unto the Ending of the Earth.\rThis Latest Hobbit does little to disappoint. It delivers in film format the thrilling final third of Tolkien’s book. (With a few changes, not all are bad.)\rThe cinematography is strange, but since I saw in 3D with enhanced Framerate, I’m going to attribute the choppy shots and scenes to the weird format. Also with the 3D the environment doesn’t exactly hold up. It looks fake, I don’t know if looks fake with the Standard viewing, but I would expect that it would be better. All-in-All The Hobbit: The Battle of the Five Armies is a really, really good movie, with two MAJOR, GLARING, UNACCEPTABLE FLAWS.\rRating: 7.5/10, 3.75 Stars, 75% whatever scale you use.\rIN CASE YOU HAVE NOT READ, HEARD, LISTENED TO, OR SEEN THE HOBBIT IN THE 77 YEARS IT HAS BEEN OUT: SPOLIER ALERT, STOP READING IF YOU DO NOT DESIRE TO HAVE KNOWLEDGE OF THIS FILM’S CLIMAX.\rGeez, I can’t believe I have to do that.\rOkay, I went into the movie with three major things on my mind: The Death of Smaug; Fili, Kili, and Thorin’s Death; and Thorin, Fili, and Kili’s funeral.\rFirst Ten Minutes, Smaug went down with near enough identically to the book, it was different, but wasn’t a bad different. It was fine, checkmark on my list.\rThorin, Fili, and Kili’s Death Scene. Oh boy, this one. I was highly disappointed when they did not pull the text directly into the film here. Thorin’s fight with Azog seemed to go on forever and Fili and Kili did NOT fall defending him. I was upset when I realized that the Dramatic Death of the King’s Nephews was not even close to the way it was. Thorin’s mortally wounded body was found by Beorn surrounded by many corpses of Orc and Goblins. Fili and Kili had fallen defending him. It was tragic, it was Dramatic, and it was perfect. But not in the Movie. NOT ONE BIT!\rHere is text taken from The Hobbit for The Royal Death:\r“Then Beorn stooped and lifted Thorin, who had fallen pierced with spears, and bore him out of the fray. Swiftly he returned and his wrath was redoubled, so that nothing could withstand him, and no weapon seemed to bite upon him. He scattered the bodyguard, and pulled down Bolg himself and crushed him. Then dismay fell on the Goblins and they fled in all directions. But weariness left their enemies with the coming of new hope, and they pursued them closely, and prevented most of them from escaping where they could. They drove many of them into the Running River, and such as fled south or west they hunted into the marshes about the Forest River; and there the greater part of the last fugitives perished, while those that came hardly to the Wood-elves' realm were there slain, or drawn in to die in the trackless dark of Mirkwood. Songs have said that three parts of the goblin warriors of the North perished on that day, and the mountains had peace for many a year… … Of the twelve companions of Thorin, ten remained. Fili and Kili had fallen defending him with shield and body, for he was their mother's elder brother. The others remained with Dain; for Dain dealt his treasure well.”\r NOT COOL. Did I even mention that Beorn shows up for all about 10 seconds.\r Then the Funeral. Oh my, it could have been such a scene, IF IT WAS EVEN IN THE MOVIE!\r These two things alone are why my rating is dropped from a 9 or 10. The Two most important things to me were botched. Granted the Death scene was not as bad I was thinking while watching it, but It still wasn’t what it should have been.\r Mayhaps the Extended Edition will have Thorin’s Funeral, and Beorn have more screen time. If so the ratings will spike to 8.75/10, 4.5 Stars and 85%."
    },
    {
      "rating": "8",
      "text": "This movie is probably the best of each. While the complaints are still there--over the top CGI, laughable stunts, and too much freedom with the source content. They are all still there, but to a lesser degree--the CGI has definitely improved, the stunts are still laughable but much much shorter, and they spent less time trying to make this about The White Council (they have just one real scene together).\r My complaints are simple: the love triangle was awful and never worked, despite Tauriel being a decent character; there are times where the movie (intentionally) makes you laugh only to instantly cut to the slaughter civilians (it was very awkward); they also were very heavy-handed with the corruption of greed (we got it, a million times over); not enough Dwarf character development (something they have continually failed at).\r It was still a good, fun movie. It did a good job of emphasizing events that did lead to the LOTR series--especially with showing how the ring is slowly and subtly corrupting Bilbo--without taking away from the there and now. However, this is a battle movie. There is action, combat, explosions and destruction. Peter Jackson, IMO unfortunately, focused on these instead of the great characters he had to work with. To this day, none of the fans of the films (that have not read the books) know the names of the dwarves besides Thorin and Kili (and by extension, Fili)."
    },
    {
      "rating": "4",
      "text": "I remember reading the Hobbit when I was a kid. I love the wonder and sense of adventure the book contained. This sense carried over to the Animated Hobbit film that I still love to this day. Watching these three movies has been more of a chore than anything else. I entered the first movie with such hope. Instead of joy I just keep hitting scenes thinking \"oh wow how can he screw up this time.\" This feeling extended to the final film. I don't need Thorin facing off in a duel on an icy river. I don't need an interracial love triangle with elves and dwarves. Smaug was great, but that was about it. It is sad that what could have been turned into these three drawn out stories with bad CG, horrible plot added in, and slop shod directing. I will be reading the Hobbit again over Christmas to wash the bad taste out of my mouth."
    },
    {
      "rating": "3",
      "text": "With dialogue so continually bad, it's as though Jackson simply gave up at some point or decided to build a LOTR cliche theme park in which now you simply laugh at the eagles arriving, rather than cheer them on. Bilbo is a supporting character again and you're left simply not caring because this final part of what should have been two movies at most is sadly just boring. A glorified extended battle in which Legolas tries to relive his best LOTR moves but, in a \"Game of Thrones\" world, it all seems so very dated. At times it borders on \"Kingdom of the Crystal Skull\" or \"Phantom Menace\" complete with its own Jar Jar Binks. You can see why there's a petition to keep Jackson away from \"The Silmarillion\". This is lazy and bloated and believes it hype. A sad end to it all. There and back again and again and again and...etc."
    },
    {
      "rating": "1",
      "text": "The only epic moment in the movie was the Star Wars:Force Awakens trailer in 3d.\r So boring scenes and a very poor CGI was in the movie.\rOne hobbit can knock out 3 orcs with 3 little rocks.Somebody can explain me how?"
    },
    {
      "rating": "3",
      "text": "The hobbit, the unsuspected flop. Yes, i was very exited for this movie, but after I have seen, I've changed my feel with this type of movie. Ignorance and without atmosphere. Sometimes I've thought that movie is more marvel or twilight than The lord of the rings. I'm disappointed."
    },
    {
      "rating": "3",
      "text": "To me, it was just a series of battles, one after the other. The love scenes were painful to watch since it felt forced. The plot was predictable, futile and monotonous.This \"grand\" finale does not do any justice to LOTR and practically recycled the same elements from it."
    },
    {
      "rating": "4",
      "text": "The Hobbit was not even close to the standards of Lord of the Rings. How could it be? The Lord of the Rings rightfully deserved a trilogy ( one movie for each book). The Hobbit was a tiny book and they turned that into 3 movies! The Hobbit dragged and there were way too many made up scenes. The battle took up too much time in the movie and they missed out many key factors of the book.\r All in all there was too much action and straying away from the main point of the book."
    },
    {
      "rating": "3",
      "text": "When I started watching these movies I was filled with joy and glee and excitement and now I could care less. If these movies were not a big phenomenon, I would’ve never gone. This movie was a whole lot of nothing. Lots of pointless action, lack of characters, and was just empty. I don’t think I’ve ever seen a movie that has made me feel so empty. Seriously this was just that one time I went ot the movies. This whole movie was just a let’s get this over with. I knew it was going to suck and suck. If you are reading this don’t see this movie it is waste of your time. Only see this if you have friends who are going to be talking that. If not stay away. If you aren’t a fan of these movies this one won’t change your mind. But thankfully its over and we can all move on. Congratulations Peter Jackson you are officially the next George Lucas. You created a beloved trilogy and then made a terrible prequel trilogy that we are all excited for and then were disappointed by replacing practical effects with CGI and great stories and characters with mediocre and terrible stories. I can’t wait for the abridged version."
    },
    {
      "rating": "4",
      "text": "The last film is the first bad LOTR/Hobbit film: just filled with so much stupidity that had me facepalming rather than enraptured.\r I think the extra hour they are bound to \"add\" to the film for the DVD release is a must to save this monstrous mess and indeed there's at least 2 moments missing from the film that were shown in trailers.\r PJ just did not seem to be arsed this time around, he's clearly had enough and chucked this one out without proper editing."
    }
  ],
  "recommendations": [
    "the_hobbit_the_desolation_of_smaug",
    "maze_runner_the_death_cure",
    "300_rise_of_an_empire",
    "the_matrix_reloaded",
    "the_matrix_revolutions",
    "pearl_harbor",
    "king_kong",
    "the_hunger_games_mockingjay_part_2",
    "the_hunger_games_mockingjay_part_1",
    "the_hobbit_an_unexpected_journey",
    "maze_runner_the_scorch_trials",
    "avengers_infinity_war",
    "the_grey",
    "transformers_the_last_knight",
    "jurassic_world_fallen_kingdom",
    "transformers_dark_of_the_moon",
    "king_arthur_legend_of_the_sword",
    "how_to_train_your_dragon_the_hidden_world",
    "jurassic_world_dominion",
    "mad_max_fury_road",
    "the_chronicles_of_narnia_prince_caspian",
    "war_of_the_worlds",
    "sanctum",
    "infinite",
    "avengers_age_of_ultron"
  ]
}