{
  "id": 84,
  "title": "The Green Knight",
  "starring": [
    "Dev Patel",
    "Alicia Vikander"
  ],
  "runtime": 130,
  "genre": [
    "Adventure",
    "Drama",
    "Fantasy"
  ],
  "description": "An epic fantasy adventure based on the timeless Arthurian legend, The Green Knight tells the story of Sir Gawain, King Arthur's reckless and headstrong nephew, who embarks on a daring quest to confront the eponymous Green Knight, a gigantic emerald-skinned stranger and tester of men.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/if4hw3Ou5Sav9Em7WWHj66mnywp.jpg",
  "categories": {
    "plot": 5.045454545454546,
    "acting": 4.333333333333333,
    "ending": 5.4375,
    "soundtrack": 5.0,
    "cinematography": 5.25,
    "familyFriendly": 3.0,
    "funny": 2.5,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The people who gave this movie a bad review were mad that they had to use their brains for once. This is the irony of moviegoers today; everyone says they want something deeper and more dark than the mainstream, but when they react like this every time they get it, it's easy to see why films like this one simply aren't made anymore. For those who like to be intellectually challenged and aren't looking for quips and action scenes, this is a fantastic film with stunning cinematography, brilliant music and editing, and a great lead performance from Dev Patel. I honestly don't know what more you can ask for from an A24 movie, and yet the whiners will have a field day with this one as they always do."
    },
    {
      "rating": "7",
      "text": "Definitely an A24 movie, (cue spooky female witch soundtrack).A fairly straightforward movie, looks good, sounds good, neat little mythic fantasy quest. The Green Knight himself is awesome, wish he was in it more. A tad long, and not too much going on between the lines, but the simple morals of piety, honoring the promise you made, and honor in the face of death work super well. \"What else ought there be?\""
    },
    {
      "rating": "6",
      "text": "Epic landscapes and good acting but didn’t have the payoff I was hoping for. The film kind of slips into art kid territory. A good movie to fall asleep to."
    },
    {
      "rating": "2",
      "text": "Beautifully shot drivel. The Mulholland Drive of historical fantasy. Avoid at all costs."
    },
    {
      "rating": "3",
      "text": "One of the most boring, pretentious movies I've ever sat through. I can see why critics love it. They don't get it either, but they pretend they do so they can feel better than us plebs."
    },
    {
      "rating": "3",
      "text": "There are certainly two ways one can look at this movie. I will start from the perspective of person who have never read the poem:-This movie is a solid piece of art, with some great thinking involved, and with good acting as well. However, this is where it stops.As a person who read the poem and wrote a great essay on it, I am utterly disappointed. First things first, Arthur's sister is Indian? Come on. Also, Gawain is not the son of Morgana le Fay, but a son of Morgause according to the WHOLE Arthurian cycle, which Lowrey decided to disregard and just make a movie on ONE piece of work. Second of all, the scenes with bandints, giants, and a fox a made up, which would be fine if they actually brought something to the adaptation, but they did not, so I consider them useless in the sense of this movie. However, when the movie gets to the point which was actually in the poem, it fails there as well. The whole point of Gawain being in Bertilak's castle for 3 days was to show how Gawain is able to resist temptations due to him being a knight and keep his honor in not sleeping with Lord Bertilak's wife. In the poem, the author demonstrates hunting scenes, where hunters have to choose different methods to achieve success when hunting different animals, namely - fallow deer, wild boar, and a fox. Moreover, the author shows scenes in which the wife of the owner of the castle tries to woo Gawain in various ways. While these two events do not seem related to each other, there are similarities between them, and the animals that are hunted seem to symbolize the lady's behavior towards Gawain. This is the most important part of the story, but it was TOTALLY missed by Lowrey for some reason. Therefore, the ending of the story was not on point as well, as it technically does not show Gawain's fate after his encounter with The Green Knight. In the poem, though, the knight strikes three times but only hits Gawain once for not giving him the green belt. At this point it turns out that The Green Knight is actually Lord of the castle himself, which was the ENTIRE point of the castle part. 3/10 for me as to being not a very good (at all) adaptation, but still being a decent movie, hence the three points."
    },
    {
      "rating": "2",
      "text": "If you want to get an idea of how bad this movie is, take a gander at all the fake 10 reviews. More than half are accounts created just to give a 10 to this movie. Google one of them and the only activity you'll see are other movie review sites where they give this movie a 10. The cinematography is pretty, but the direction is a disjointed acid trip. They took a classic movie and remade it into a progressive, inclusive and pretentious art show. The kind of art show where people worship the man-bun, ascot-wearing artist who stands in front of a blade of grass and applauds its profoundness."
    },
    {
      "rating": "5",
      "text": "As with nearly any subject nowadays, opinions are quickly polarised with broad and often incorrect assumptions - one being that if you don't think The Green Knight is very good, you are brainless cretin who does not appreciate non-mainstream cinema.But it is quite possible to have a deep understanding of the possibilities of convention breaking cinema, yet still regard The Green Knight as pretentious and hollow. For some reason, many film critics, perhaps starved of genuine new visionaries, have latched on to Lowery as a new 'voice' who has at least has the outward appearance of being fresh and profound.Why does Lynch's voice seem so strange yet also so very effective? Somehow, the specifics of his craft combine with a sensibility that commands your attention. One of the problems with Lowery is his craft actually obstructs your engagement. Overly showy shots and excessive reliance on cross-cut editing undermine the sense of engagement with the overall concept and give the film the consistency of a high level music video. The film also asserts its own greatness with an insistent score that has more in common with conventional Hollywood underscoring than it thinks. Lowery wants you to feel the impact of every image, yet you are never given the opportunity to engage, even on a subconscious level, as the film rarely settles long enough on any scene to be immersive, preferring to restlessly cut away. So the film feels both slow and very rushed at the same time.Unfortunately, whatever his intention was, Lowery's vision does not reach a level where it feels even necessary to analyse his interpretation of the original poem.  Dev Patel is good though."
    },
    {
      "rating": "2",
      "text": "This movie is beautifully shot, with decent acting. That is the only positive thing to say. It's boring as sin, nevermind, sin is actually fun... This is just.... Paint drying. It's well shot as I mentioned, but it feels like you sit there for 2 hours to watch nothing happen. It's aweful. No action at all, just a slow pensive walk in the woods with a lackluster plot and very little if any character development. I simply cannot recommend this movie to anyone looking to be entertained.It really shows how sad the movie industry is with payed reviews. There is no way anyone with integrity could give this film 100%As more people watch I'm sure you will see the average drop substantially.. shame on you critics."
    },
    {
      "rating": "4",
      "text": "Interesting cast, who have shown they have potential, however it all seemed muted, not enough of anything to make it good.Films like this are not intended to be clever, so to think there's a higher level of attention needed, nah, don't fall for it."
    },
    {
      "rating": "4",
      "text": "Truly terrible.  To be sure, well acted with good costuming, but those things alone never make a good movie.  It was clearly written by someone who thinks they are brilliant, with artistic talent, but in actuality sorely lacks both.  About an hour in I was wishing for the green knight to storm into the theatre and take off my head rather than finish the movie."
    },
    {
      "rating": "6",
      "text": "I would give it a 6.5/10 I was disappointed in it - there’s some really really bad CGI in the background shots; they have an entire animal CGI that is with him for a while and it just took me out of it. There are some amazing shots and costuming but it was more along the lines of like a Harry Potter or lord of the rings in tone- it wasn’t anything like I thought it was gonna be. I’m glad I saw it but it didn’t knock me off my feet like I thought it would"
    },
    {
      "rating": "4",
      "text": "Another art-house romp tarnished by its pretentiousness, with the goal to get the admiration of the critics while leaving audiences in the dust using vignettes of \"artsy\" sequences sprinkled throughout. Unlike the extreme edge of pretentiousness, director Lowery at least attempts to make the story watchable with bits of greatness that make it worth the effort if you appreciate cinema, albeit at an offensively slow pace (couldn't say the same for \"Ghost Story\", the other extreme of art-house trash that is somehow convincing modern critics to overlook the excessive pretentiousness in favor of a balanced approach). It is shot beautifully, very well acted, and actually well directed, but the pace and artsy vignettes are the death blow, with still shots and awkward sequences (a blindfolded woman just sitting in random places for the sake of \"allegory\", for example) that tend to take the reigns more often than they should. Head shrugging, to say the least, but it worked to convince the critics. Yet, as you can see based on the polarized audience reviews, anyone who doesn't buy into the pretentious notion of \"I created an important work of cosmic art attempting to tap into the transcendent nature of reality\" understandably found it a hopeless pursuit.You are taking 130 minutes of an audiences time, it would be nice to take that into consideration when putting together the final cut. Otherwise, you're making the film for yourself, and giving it much more importance than is due (ostentatious obliviousness). Luckily the bits that are good make it worth the overall effort (if you are willing to sit through it)."
    },
    {
      "rating": "3",
      "text": "For me, it was a pallid, joyless affair that stitched together sequences of blunt metaphors without much care for what their purpose was or whether they made narrative sense.I like the source material, although I wouldn't be against modifying it. Here though, the original themes are thrown out and just a little of the setting is roughly used.The pompous arthouse titlecards are the cherry on top. I don't need enormous blocks of art noveau text announcing a twee intertitle every ten minutes, thank you.To reviewers who say anything along the lines of \"The people who gave this movie a bad review were mad that they had to use their brains for once,\" you're the emperor in his new clothes, but without the imperial title. I guess you're just naked idiots.People who like this movie and don't feel the need to bag on others, you're cool."
    },
    {
      "rating": "4",
      "text": "Beyond style over substance. Stupidity over substance. Nonsense over substance. \"Coolism\" over substance. Don't expect any logic, plot sense or credible character behavior, just swallow Lowery's artsy pretentious crap. Don't think about the ridiculous nonsense that is fed to you, just \"feel\" that this is good and you will be one of those special and unique people that \"get it\"."
    },
    {
      "rating": "5",
      "text": "the film is more concerned with its aesthetics than developing the story in a watchable way. Patel looks great here but doesn't elevate the movie and I don't buy the ending. Another \"smart\" movie from A24 for film twitter. It's very uninteresting."
    },
    {
      "rating": "3",
      "text": "Shlubby. Liked the end, which was the best part. The rest was all “this man is special and needs to be taught the lessons of life by women.”"
    },
    {
      "rating": "4",
      "text": "I have not read the source material and have only seen this once.  So take this review as an initial reaction to the movie on its own merits.First the positives, the film was a gorgeous piece of imagery with some excellent music and sound design that really conveyed the mood at any given moment.  The final flash forward sequence of him aging was a great piece of story telling that required absolutely no dialogue and yet you knew what was happening and what the characters were feeling.  Green knight character design was fantastic.Now the confusing:There were so many things in this movie that were introduced and then produced no pay off.  They felt random and unmotivated and as far as I can tell had no impact on the story.-the fire at the beginning-the giants in the valley (gotta get that boob shot in somehow I guess)-the fox-the thief stealing the axe-the blind folded woman-the warning from the severed head stating \"the green knight is someone you know\" even though we had not met the lord at the castle yet.All of these things and more were put in the film intentionally and yet seemed to be pointless additions.Disconnected:The flow of this film felt hindered by a lack of connection between scenes or motivation leading from one scene to the next.  Now he's wandering and he finds mushrooms, now he starts seeing things, now it's day again and he's wandering, and now there are giants...just because, and now the giants are gone, and now he's wandering upside down some more.  Beautiful imagery that feels hollow.Clarity:By the end of the film you're supposed to realize the fox (in its one piece of dialogue) has the voice of his mother, and the green knight has the voice of the lord from the castle.  I found this out only once I looked up more info after finishing the movie, during the film it was not clear, I think mainly because of the sound design distorting the voices enough to keep me from placing them.  Also, I did not recognize that the brothel girl and the lords wife were the same person, but I think that's more due to me being the type of person that would be fooled by Clark Kent's glasses.Overall, my initial reaction was one of disappointment.  In another viewing I may enjoy this more, but the marketing had me expecting a dark fantastical epic about the journey and growth of a young knight on a quest.  Instead I think they should've marketed this as the abstract fever dream that it was, and I think in that situation my disappointment would be lesser."
    },
    {
      "rating": "6",
      "text": "The Green Knight and Round Table champion Sir Gawain are the stuff of legends -- literally -- and in more permutations than one can probably readily identify. Which is something that undoubtedly contributes to some of the recurring confusion associated with director David Lowery's latest take on these storied characters. In drawing from multiple source materials, the filmmaker appears to have come up with his own version of this legend, one that, in typical Lowery fashion, is not always the easiest to follow without making some assumptions and entering the theater with considerable foreknowledge of the subject matter. Even those somewhat familiar with the mythology may find themselves confused when they witness some events unfold that don't appear to jibe with whatever knowledge they may already possess. Add to that a number of protracted sequences that should have been heavily edited (especially in the dreadfully dull opening 30 minutes), and viewers are left with quite a frustrating movie experience. To its credit, some sequences are skillfully handled (such as those involving Barry Keoghan in a superb supporting performance), and a number of thematic issues are deftly raised and discussed. Dev Patel's portrayal of the intrepid hero is also commendable, a role that, at first glance, may seem like an unusual casting choice. But, considering how much of this film seems to leave audiences (even informed ones) in the dark, one can't help but wonder why the director makes his pictures so needlessly difficult to fathom. While it's understandable that spoon-feeding is certainly unacceptable, the same can be said for being excessively cryptic, a quality that seems to characterize -- and plague -- this filmmaker's work."
    },
    {
      "rating": "2",
      "text": "A promising setting is quickly spoiled by a surrealist trip into what could quite easily be described as LSD inspired waste of bloody time."
    },
    {
      "rating": "6",
      "text": "This movie will be divisive and its misleading marketing will do it no favors. I did not love it or hate it but I still think you should see it because it is unique. This is a spoiler free review. Starting with the positives. This movie captures the grit of the medieval period but is at the same time very mysterious and otherworldly. The storytelling is predominately visual and creative in its approach. Believable acting throughout and nothing is spoon-fed to the audience. The dialogue is delivered perfectly and authentically and I loved the color palette that was used. There is an incredible sequence near the end of the movie that I will not spoil. Now the negatives. At times I felt the film was too abstract or too moody for its own good. The pace of the film is slow and stays that way throughout. People expecting a lot of action will be disappointed (the trailer shows basically all of the \"action\" highlights). There are some fairly significant changes from the source material that I feel undermine the core message of the film and lead to a somewhat unsatisying ending. If you are unfamiliar with the source material you may be confused at times."
    },
    {
      "rating": "8",
      "text": "I actually signed up to show this movie some love as I'd rightly assumed that a lot of viewers would be thrashing it.'The Green Knight' is essentially a coming-of-age tale, its plot restructured and themes re-emphasized to serve as an allegory for the anxiety of impending adulthood (or manhood) - that phase of life when we are expected to assume responsibility and to carve out a path for ourselves. While the production values are beguiling the movie cannot, due to the opaqueness of its plot, its contemplativeness and reliance on symbolism, be judged and appreciated solely on the merits of high-fantasy. As an (imo) unsuccessful attempt at enhancing the already considerable moodiness many scenes aren't adequately lit, whilst many events are frustratingly hazy. An air of melancholy surrounds the entire enterprise.The Green Knight is auteur cinema in the truest and best sense, and an assurance that the Hollywood studio system still allows for personal movie-making in big-budget genre cinema. It is a lovely counterpoint to Peter Jackson's bombastic, but kitschy Lord of the Rings trilogy."
    },
    {
      "rating": "6",
      "text": "I was looking forward to this, but much like the protagonist, the closer the date came, the more dread I felt. Some people are saying the movie was hard to understand...it isn't. Remember \"Excalibur\"? How Arthur *literally* was the land? Well, in this movie, Gawain *figuratively* is mankind. I dare anyone to say that doesn't make sense. The problem for me is where the director sees mankind headed--or rather, his sloppy indecision about whether or not Gawain will be headed.I like cynical movies, cynical games...big Souls-like fan, here. But what this movie did was take what was arguably a hopeful allegory for humankind's potential for redemption and turn it into a prophecy of humankind's self-annihilation. This isn't exactly a twist in the movie; it's obvious where the film is headed, so you're really just wondering if our hero can turn it around before he reaches the end of his journey. The fact that he doesn't is foreshadowed before he gets there: The book-transcribing wife of the wealthy lord near the end of the movie 'confesses' to our hero that where she sees possible improvements in a book she is duplicating for her collection, she 'makes them'. This is just what the writer/director has attempted to do. And the cynical side of me says this was the only 'modern', 'intellectual' interpretation that makes sense. There is a fitting symmetry between this movie's prophecy and the hopelessness we feel about society. Edgar Allen Poe should be jealous.That would have been enough to get the film 7 stars, for being smart but predictable. What knocks it down to 6 is that this ending is revealed to be the miserable outlook of our hero torn between honorably meeting his end and running back home. It seems as though a test audience secured an honorable (and abrupt) end for Gawain's journey after all. So, facing his inevitable destruction with no tricks up our hero's sleeve, this miserable movie ends...on a joke. Like an episode of Seinfeld. I'm very sure that in the coming weeks we will hear that there was some indecision about how to end the movie and this ending is basically the equivalent of Harrison Ford mumbling his voice over through Blade Runner.\"Support the arts\" and all that **** but you should just see this movie at home, through a streaming service with a diverse production portfolio, and probably not right before bed or bath, in case the ugliness of the 'true ending' moves you to suicide."
    },
    {
      "rating": "7",
      "text": "I love the original, classic tale, and while this version pads it with what is not told in that, it sticks to the main plot at its core. It's a wonderfully stylized version of that, creating a world that oozes mythology. The world built here seems to team with ghosts, tales, and the superstition of the time in which it's set. Gorgeous to look at, well-acted, and well-directed, I got lost in this world (barring the terrible cgi fox). While it sticks to that original story, the added depth, especially near the end, reminds me of The Last Temptation of Christ. That's not a bad thing, though it is a tad unoriginal, and kinda mucks up the theme of the chivalric poem. Still, this is something you won't often see in today's cinema and worth the time."
    },
    {
      "rating": "0",
      "text": "Boring garbage and horrible acting wth A24? I am just typing words so that metacritic let me post this review ignore this"
    },
    {
      "rating": "6",
      "text": "Unfortunately style over substance. Clearly made with love, but there’s more passion in the crafting of the film than the characters seem to have being in the story. Better at posing questions than answering them, not that one expected to leave with a fully clear picture, but the story itself feels unclear on what it’s trying to achieve, leaving us even less certain."
    },
    {
      "rating": "2",
      "text": "Was not the type of movie I was expecting. I was hoping for a more action and lore based Arthurian movie. I don’t understand why the film industry lately has to make everything so “angsty”. There is no laughter and no fun to be had in this movie. Just one dark and dreary scene after another. I’m still waiting for an Arthurian movie to do the legends justice. I did enjoy the casting. The actors were believable in their portrayals of the characters they played. Just wish there was a jovial scene or two where the characters actually spoke in a normal voice instead of hushed whispers. Please someone make an Arthurian movie that fits the fantasy that lives in everyone’s minds. Instead of adapting some part of the story for artistic purposes. I’ll just go back to rewatching Excalibur for the umpteenth time until that day comes."
    },
    {
      "rating": "3",
      "text": "The cinematography here was excellent. The acting was superb…but my god wtf was that? A24 missed the mark. Hard. Slow burns do not equal bad movie. Tension and atmosphere over action do not equal bad movie. Every second of screen time used here was slow and methodical and meant to be thought provoking but instead you’re left scratching your head after every sequence. It all adds up to the most lackluster climax I’ve ever seen. I’m so disappointed."
    },
    {
      "rating": "5",
      "text": "A very visually pretty movie with some of the best shot scenes in any film that I've seen. However I found myself struggling to enjoy the film. Many of the changes from the classic poem acted as a deconstruction of the ideas of honor and knightly virtue bit failed to provide any alternative message with any depth."
    },
    {
      "rating": "9",
      "text": "I‘ve seen this film twice now and I absolutely adore it. The movie is slow, hasn’t got a clear tension arc and doesn’t lay out all the puzzle pieces for the audience. The Green Night expects you to have patience, is told in a fairytale kind of way as there are many crossroads that the hero has to encounter and shows a world that is full of wonder and a subtle but deep lore.I recommend this movie to anyone who is not afraid to come out of its comfort zone and is willing to show patience in order to see what’s so special about this gem. 9/10"
    },
    {
      "rating": "9",
      "text": "The Green Knight will almost certainly be a divisive topic for film buffs and movie-goers for a period of time. The film is very different from most movies, even including A24 films. However, it is of my opinion that The Green Knight is a beautiful work of art that not only looks gorgeous, but also has a well written main character and meaningful themes that have been woven through out the films two hour run time. This film is definitely meant for a niche audience, but if you have heard about The Green Knight and want to check it out, I absolutely recommend you do so and form your own opinion of it. Words of warning though, much like the types of ancient medieval literature the film was based on, there is more of an emphasis on the main character and themes in the story, rather than a focus on why and how things happen in the story. This is a change in direction that is sure to turn some people off of the film, but I grew to appreciate it and hope you will too."
    },
    {
      "rating": "1",
      "text": "I've never written this before: I am actively discouraging you from seeing this. The high-pitched women's wailing is still ringing in my head.Most negative reviews here say this movie is boring. They're not wrong. But they're missing the point. It's boring because this is a horribly, horribly told story. It's a knight's quest. A journey toward manhood and responsibility. But we don't track with the main character in that process at all. You just don't feel it.Amazing how critics always fall for style. They actively ignore how crappy the storytelling is because they're so hypnotized by all the costumes and dissolves. WTF were those giants about?"
    },
    {
      "rating": "3",
      "text": "I'm usually fairly generous and forgiving, able to find good and see the best in a lot of films, but this one was incredibly difficult. I wouldn't say it's \"bad,\" but it's definitely not entertaining. If you go to see movies for reasons other than entertainment, there's a chance you may appreciate it. If you're a fan of movies that offer little to no answers to anything, lack any real conflict, and just want to watch a guy walk from point A to point B, this movie will be tolerable. There's barely any dialogue, it moves slowly, the characters are mostly expressionless, and the plot is based entirely on whether or not a guy will commit to following through on one choice.Is he brave enough, or will he chicken out? You at least find that out, but then that's it. Nothing more to it.  But hey, if you like to find deeper meaning in the allegory or the themes sprinkled around, have at it. It was a disappointment to me, but to each their own."
    },
    {
      "rating": "2",
      "text": "Dev Patel stars as Sir Gawain, who’s sent on a quest by his uncle King Arthur to confront the ominous titular character. His mystical journey includes encounters with creatures, otherworldly and otherwise. While the film is full of luscious visual beauty, the pacing is painfully slow. It could have easily lost 30 minutes and been more effective. On top of the disastrous tempo (or lack thereof) the story is cluttered by ominious statements that make no sense. If I’d studied the 14th century poem on which it’s based, I might understand it better, but that’s not excuse for obtuse storytelling. Writer/director David Lowery must get all the blame for this tedious, pretentious slog."
    },
    {
      "rating": "0",
      "text": "Overlong, boring, and poorly shot.  No this film isn’t “beautiful”.  It’s riddled with pacing issues and dragged down by a nonsensical plot.  It’s about as deep as a mud puddle.  The protagonist is an unlikable coward.  I can see why the average millennial would identify with him.It fits right alongside every other A24 film I’ve ever seen.  Utter arthouse trash."
    },
    {
      "rating": "9",
      "text": "A fantastic imagining of a story that deserved to be told. With a track record of epic violence and devastating endings, A24 gave me what I was NOT expecting. The Green Knight is pure adventure with a splash of those staples A24 is known for. It’s wonderful. And… while it’s 2 hours, it truly doesn’t feel like it."
    },
    {
      "rating": "4",
      "text": "While I’m not a big fan of a lot of A24 movies, when I read the announcement for “The Green Knight” I was very excited. I loved “Sword of the Valiant” and the Sean Connery titular cameo and with the little I know of the Gawain mythos I couldn’t wait to see this new version. I’d say that this movie started out with such high promise with great atmosphere, costumes and wildly excellent sets. I would have given it an 8 or higher if it kept the energy it had up to the scene when the Green Knight makes his exit. After that it just goes down hill losing momentum, and half of a point from my score, nearly every 15-20 minutes. For how much the movie “insists on itself” it had nothing to say really. All it does is meander without any meaning till it’s dull end. I guess some viewers could see some parallels in current social politics here and there. However, if the film makers are intentionally doing this here it doesn’t holdup against the backdrop of the Arthurian legend. Alongside that the movie has some awful edits, terrible and unreadable reoccurring title cards and some questionable cinematography. I’m pretty sure I saw several “mistakes” that took me out of the film. Some of which felt like the kind of thing that a film student would have made and left on their thesis for “authenticity.” I’m not sure if the acting was good or bad because I was more bored then anything else by the end. The music and sound design are amazing and yet distracting at the same time. This is one of the times that without the strong score the film would have suffered and you wouldn’t have known what the film markers where trying to achieve. Overall it’s not a soundtrack that I’d be interested in as it barrows heavily from the sources that it aspires to be. I’m glad I watched it and oddly I think that most others will be as well. If anything it’s unique yet inoffensive even when it’s trying to be. For a film set in very tumultuous times and has gruesome tales within it’s own story, it only shows/tells it in the most uninteresting and uninspired way."
    },
    {
      "rating": "0",
      "text": "I would give this -5 if allowed.  This is poorly written, poorly directed, and totally unwatchable.  I challenge anyone to explain the plot.  The protagonist is frequently filmed lying on the ground or a bed.  Every scene takes twice as long as warranted.  The dialogue is rambling nonsense without purpose."
    },
    {
      "rating": "9",
      "text": "The story focuses on the main character's journey to become a brave knight.It is surreal but has a good delivery.It has a nice cast of supporting characters.The ending is ambiguous (in an irritating way).Its one of those movies which focuses more on the \"journey\" rather than the \"plot\".I think it managed to pull this off and give us a great story."
    },
    {
      "rating": "3",
      "text": "While this film was gorgeously shot and wonderfully acted, it ultimately felt ridiculous, pretentious, and like a complete waste of my time."
    },
    {
      "rating": "0",
      "text": "Horrible movie! Save your soul and your money and don't go see this! Lacked everything it was a flat line all the way through. Did nothing for me instead it took my time, my money and left me feeling empty and messed up in the end. Quiet possibly the worst movie I have ever seen or one of them."
    },
    {
      "rating": "9",
      "text": "I feel this film is far more compelling to those who are familiar with the source material as many of the deviations from the poem work as a response or commentary on it. I find this choice quite surprising given how unknown the original story would be to the vast majority of the audience, but I admire the filmmakers for doing this.It's difficult for me to imagine how I'd have found this movie if I hadn't read the poem first, but I think a lot of the themes and plot elements certainly would have gone over my head. Despite this there's was a lot to like here for those unfamiliar with the story and it is certainly one of the best medieval fantasy films I've seen."
    },
    {
      "rating": "10",
      "text": "David Lowery is always a surprise. His movies are full of emotional moments, but also deep explorations of what it means to be human. I loved this movie, and I can't wait to see his next one"
    },
    {
      "rating": "10",
      "text": "Wonderful Christmas movie.  Going to go see it again next year.  Beautiful cinematography and captivating performances."
    },
    {
      "rating": "9",
      "text": "A stunning Arthurian allegory. Do a little reading and your joy from this film will be truly enhanced!"
    },
    {
      "rating": "1",
      "text": "This is The most boring an incoherent movie I have ever seen. The director was obviously on drugs, and not in a good way."
    },
    {
      "rating": "9",
      "text": "Beautifully shot movie. Seems like a simple tale, but has a lot goin on. Slow, yet worth the time invested."
    },
    {
      "rating": "3",
      "text": "High hopes, massive disappointment. This film takes a lot of effort to watch, but it's pretentious and dense and feels like it doesn't want to be understood. Almost like there is actually very little of interest going on beneath its overblown exterior...Production design for some parts is very nice (love those crowns!), but frustrating in others (in trying to create a 'gritty' medieval world must we take the 'dark ages' so literally? Why does nobody own any interior lighting?). There is some very inventive cinematography, as any trailer will quickly demonstrate. Sean Harris and Joel Edgerton give enjoyable performances, but the screenplay does Dev Patel no favors and offers a thoroughly drippy, dumb, and unlikeable Gawain. Alicia Vikander produces a strange medieval English accent which wobbles between Geordie and Scouse—it's bizarre, and perhaps accidental, but actually quite compelling.The mood is pretty grim, and it's the same all the way through, with all the joy and fun and humour of the source material sucked out and nothing compelling or interesting added in its place. This is not a fun film, but it's also not an action film or a thoughtful film. It has one note and you are bludgeoned with it throughout. Fundamental changes to the plot and identity of the characters subtract far more than they contribute and produce a confusing overall picture where motivation and meaning feel pretty distant. It's just a bunch of boring stuff happening quite slowly in the dark. The screenplay and direction don't seem to have any patience—nothing is allowed to build slowly or gradually. Every scene attempts to be a knockout of great depth and of solemn, weighty significance. The only way in which the film attempts to earn or justify that kind of impact is with screeching music and visual tricks, rather than with plot or character. There is nothing to hold on to, and no reason to care about our characters. Style is cool, but here it totally suffocates substance.The score is melodramatic and bland, but worse than that is the fact that it's inescapeable. High-pitched acappella hooting is the recourse for every scene where the events and character of the film have failed to create any sort of interest or engagement.A deeply frustrating watch. Since learning about the film I was excited and eager to like it, and I was ready to fight for it if it turned out to be a middling or misguided adaptation. But it really is a turkey. The CGI fox is one of the most agonizing failures I have seen on screen for a long time."
    },
    {
      "rating": "0",
      "text": "A film is either made to win awards or make the big box office. This was the former. Super slow burn, visually pleasing, and I’m sure fans of the arts will love it. But this isn’t for your casual medieval adventure fan. Plot is so crazy slow and unclear."
    },
    {
      "rating": "0",
      "text": "10 out of 20 people audiance members walked out before we did. Absolutely boring, zero plot & zero entertainment. We stayed for an hour and 40 minutes before leaving. It was horrible. Between working full time, raising kids, and life we thought we'd have a great date night with a highly reviewed movie by critics. Absolute waste of precious time and money.  Pure garbage.  If you want to pay for a movie ticket, eat overpriced food, to watch somebody walk and other people stare at him, then this movie is for you. If you're looking for entertainment do not see this movie."
    }
  ]
}