{
  "id": 880,
  "title": "The Dark Knight",
  "starring": [
    "Christian Bale",
    "Heath Ledger"
  ],
  "runtime": 152,
  "genre": [
    "Drama",
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
  "categories": {
    "plot": 9.823529411764707,
    "acting": 9.877551020408163,
    "ending": 10.0,
    "soundtrack": 10.0,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 9.947368421052632
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I don't understand why this movie gets bashed so much because it's \"overrated.\" So what? Pretend as though you never heard anyone say how good this film is, then watch it, and then talk to me. And don't even get me started on people saying, \"People like it just because Heath Ledger died!\" Again, pretend as though he didn't die, watch his performance again, and then come talk to me. An outstanding performance by anyone who was ever involved in this film."
    },
    {
      "rating": "8",
      "text": "This super hero movie is a rare film that drills deep inside the character and the script more than the action. It may be boring to a few people who despise waiting for 2 hrs; However I promise you, Heath Ledger will keep you amazed the whole time. Ultimately, Christopher Nolan's \"The Dark Knight\" is a masterpiece, a film that doesn't just show off the visuals and action, but understands what deep pains and afflictions a superhero suffers."
    },
    {
      "rating": "10",
      "text": "\"The Dark Knight\" is proof that Chris Nolan saved the Batman saga. this is literally the best Batman movie we ever had in years! from the mind-blowing action, to the incredible acting, fantastic characters, strong script, layers of character depth and development, epic music, awesome special effects... i can't see anything wrong with \"The Dark Knight\". cause everything's the work of art, of a person who knows how to do the Batman saga justice. it's like if Christopher Nolan was like \"Outta the way, **** It's my turn now\". and he saved Batman, he brought Batman back to life again, and i thank him so much for that. also, Heath Ledger as the Joker: a phenomenon! other actors can try, but nobody's ever gonna top Heath Ledger's Joker. and Christopher Nolan still stays as one of the best directors we've ever had. \"The Dark Knight\" is a phenomenon!"
    },
    {
      "rating": "10",
      "text": "THE BEST MOVIE EVER! I just have to say that this movies are awesome, and so is Christopher Nolan. He's never failed us and he has made five movies and I bet all of them are possible contenders for best movie ever. So anyways, I liked how Rachel just gives up on Bruce for Harvey Dent, whom everyone deems \"The Better Man\" or \"The White Knight\". I also loved how the Joker is just psycho and he doesn't care for anything except bombs, gasoline, and crime. I believe he is just out there to prove a point. That even Gotham's best can fall. He even nearly completed his plan by corrupting Harvey but Batman/Bruce took the blame. I love how, in the end, Harvey's gun is pointed at the men \"responsible\" for Rachel's death (Batman, Gordon, himself) and how his mind is just twisted into thinking that they were actually responsible. I think Heath Ledger gave an excellent performance, all out, although it hasn't  turned out for the best. I'm sure we'd all prefer that this was never made or was never as good for the sake of Heath Ledger but, you got to admit, this is just such a good movie."
    },
    {
      "rating": "10",
      "text": "One of my favorite movies as a huge batman fan I couldn't be happier. The joker was easily the best done joker ever. Can't give this movie enough praise and can't wait for the next."
    },
    {
      "rating": "10",
      "text": "The Dark Knight dares to be more than it should be. It transcends the barriers of being labelled a \"Batman movie\" or \"superhero movie\" by excelling in all areas: character, plot, action, writing, acting, directing. The Dark Knight is not  for fans of Batman or fans of serious drama. It is a film for everyone and stands as one of the most important films of the decade."
    },
    {
      "rating": "9",
      "text": "Continuing from where Batman Begins ended peerless director Christopher Nolan reunites with Christian Bale for the continuing story of The Dark Knight. With the help of Lieutenant Jim Gordon and District Attorney Harvey Dent Batman sets out to put a halt to the criminal activity that plagues Gotham City. Just as everything seems to be going their way the peace is shattered by a criminal mastermind known as The Joker.\r Batman may be on the DVD cover but this is really The Jokers movie. Following the death of Heath Ledger prior to the movies release there was huge hype regarding his performance and he certainly delivers. His portrayal is a far cry from the camp 1960s iteration and as creepy and disturbing as any villain in cinema history. Running at about two and a half hours in length The Dark Knight needed a worthwhile plot to go with the high quality action scenes and on this count the movie again doesn't fail featuring plenty of twists and surprises.\r The Dark Knight is without doubt the best super hero movie of all time."
    },
    {
      "rating": "10",
      "text": "Regular readers of this blog know that I don't like super heroes, but Batman is the exception. As a kid he was the only one I thought was cool and the only one that i felt could be real. Apparently Christopher Nolan has the same idea. What I love about his take on Batman is that it's very realistic. Even the joker, as out there as he maybe, was a much more believable and realistic villain than the portrait by Jack Nicholson. As for the movie, it's an amazing story, with one of the best performances ever, by the late Heath Ledger who I really couldn't stand until this movie! As with all Nolan movies, it's a very visually appealing film, with a great story, and cast perfectly. I can honestly say that this is as good as it gets! There will never be a better Batman or super hero movie."
    },
    {
      "rating": "10",
      "text": "Batman's greatest foe yet is revealed in The Dark Knight. And he is amazing. The combination of Heath Ledger and Christian Bale is magnificent. This is truly the best superhero movie to date. Every little detail leads to something in the end. The special effects still remain some of the best and this movie was truly advanced for the year it was released."
    },
    {
      "rating": "10",
      "text": "This Film is great,Christopher Nolan really knows who is Batman he made this movie one of the best films of all time.The Dark Knight has a good plot a great villain and a good musical score(Hans Zimmer)."
    },
    {
      "rating": "10",
      "text": "One of only a handful of flawless films I have seen in my lifetime.    (To give this movie a 0 (Zero) is morally irresponsible.)"
    },
    {
      "rating": "10",
      "text": "i have 5000 character limit for writing my opinion about this movie..is it enough?  Absoulately not... The best movie ever...awesome...fantastic...amazing... you can find lot of words like this... you feel every emotion in the movie.Every scene has another feeling.Love, action, humanity, movie gives every feelings to you. i advise all world people to watch this movie. Because you wil not see a film like this for 50 years"
    },
    {
      "rating": "10",
      "text": "Christopher Nolan is an absolute genius. Batman Begins was a great film, but this just about blows it out of the water. Nolan knows good acting, and some amazing actors are in this one. Bale, Freeman, Oldman, Caine, LEDGER, all greats. The action scenes are suspenseful and aplenty (with a batmobile scene standing out) . and the script is superb. Seriously, this movie is super quotable. Ledger was born to play the Joker, and everybody that says his acting is \"overrated\" will never be happy. Aaron Eckhart is also superb. The best superher movie ever."
    },
    {
      "rating": "10",
      "text": "I was so pumped for this movie to come out for years and then Heath Ledger's passing made it an even bigger event. I went to see it on opening day and I swear during a few of the joker scenes I got chills because it was so good. And any movie that can have that much of an effect on me deserves a 10/10."
    },
    {
      "rating": "10",
      "text": "Absolutely stunning. This sequel is dark, sophisticated, and is better than its predecessor. It has emotion, powerful and superb acting, and impressive visuals. This film is, beyond any doubt, a must-see. Oh, and the Joker in the movie, is beyond fantastic."
    },
    {
      "rating": "10",
      "text": "The script is well-written, the performances are splendid, and the action sequences give the constant thrills. From the colored pages of its comic books to the glorious big screen, The Dark Knight is the greatest adaptation ever made."
    },
    {
      "rating": "10",
      "text": "The Dark Knight is a very tightly woven and smart movie. The plot is engaging, the characters are each unique and well acted (especially the joker) and the action is intense. Really, there is no issue with this movie. It's damn near perfect. You'll be interested and on the edge of your seat from the beginning to the end of the movie.\rThe Dark Knight is not only the best Batman movie ever, it is also the greatest super hero based movie ever. Do yourself a favor and go watch it."
    },
    {
      "rating": "10",
      "text": "The best of the franchise.  A perfect film from start to finish that never gets old.  This film is slightly better then the other two because of Heath Ledger his portrayal of the Joker is to me the greatest villain of all time."
    },
    {
      "rating": "10",
      "text": "One of the best super hero movies of all times. If you havent seen it yet then..just stop reading this review and go see it first. Strong villains against strong super heros usually make the movie and this is no exception."
    },
    {
      "rating": "10",
      "text": "This is my favorite Batman movie ever! Christian Bale did another great performance as Batman and Heath Ledger was amazing as the Joker. The plot is excellent and the action sequences were great. I cannot understand anyone who doesn't like this movie."
    },
    {
      "rating": "10",
      "text": "A single movie, with so many unique particularities and a simple proposal: be original and different at same time. Nolan brings us a mature and surprising Batman´s universe, with characters well made, including the Joker, the most impressive of all. Heath Ledger gives life to a scary, cold, shocking and overwhelming villain, that faces all Batman's limits with an unmerciful psychological game at absolutely flawless and triumphant performance. With a tense, accurate and efficient score by Hans Zimmer and James Newton Howard, led by the realistic and audacious proposal from Christopher Nolan, The Dark Knight is engaging and powerful, being the best adaptation of a comic-book to the cinema."
    },
    {
      "rating": "10",
      "text": "This is my favorite movie. I like Christopher Nolan movies. This is his best movie. Good plot, fantastic acting. Heath Ledger is genius. Good effects, action, drama."
    },
    {
      "rating": "10",
      "text": "This is definitely the best out of all the Batman movies. The plot is engrossing, the action is thrilling, the performances are exciting. Ledger deserved every bit of praise for his portrayal of the Joker; He's one of the greatest villains in movie history. This is a mature vision of the Batman universe, grounded in a splendid realism, while never losing sight of what made the original characters so engaging. Not only a good \"superhero\" film, but an enthralling crime drama. Nolan and the actors understand this material perfectly, and have made a movie that transcends the comic book stereotype. An enthralling action movie and a work of art."
    },
    {
      "rating": "10",
      "text": "The Dark Knight is everything an action movie should be: thrilling, suspenseful, epic and chock-full of action sequences that sometimes are as amusing as they are visually stimulating. But it's also an emotional journey that's so intricately weaved into the fabric of the movie it doesn't at all seem out of place (or disingenuous). Ledger's chilling (terrifying, nihilistic) portrayal of the Joker is certain to go down in cinematic history as one of the greatest villains of all time and even then it might still be slightly under-appreciated. Nolan has succeeded in creating a genre-defying (and defining) film on such a grandiose scale, and with so little room for error, that he must be praised for what he truly is: a directorial savant."
    },
    {
      "rating": "10",
      "text": "The Dark Knight is truly the best batman film to date. It starts with a great intro sequence and keeps the high quality trough the whole film.Dark and gritty the dark knight offers a thrilling plot with great characters, all of whom having their own motivations with the greatest villian of the entire batman franchise. Hans Zimmer also did great work with this soundtrack which fits perfect. A must see"
    },
    {
      "rating": "10",
      "text": "A masterpiece"
    },
    {
      "rating": "10",
      "text": "The Dark Knight is the superior Batman. This is what 1989 Batman should have been.Smart writing, smart direction, and incredible action sequences. Heath Ledger is the true Joker."
    },
    {
      "rating": "10",
      "text": "Taking, not just mine, but everyone's expectations and flipping them on their heads. Nolan managed to harness everything that was great in \"Batman Begins\" and augment those qualities to a near epic degree. He even added some newer things of his own creation into the mix. I speak, of course, of Heath Ledger's Academy-Award Winning Joker. Virtually every line out of Heath's mouth in this movie is amazing. In fact the entire script of this movie contains these little hidden gems that Nolan just flicks at your head throughout the entire film. However, it's Heath's performance that still reigns surpeme in this film overall. He and Nolan not only created an Oscar-Winning character, but a character that has had a pretty deep impact on pop culture. Aaron Eckhart did a good job as the tragic Harvey Dent character. All of the other actors were fantastic as well - including Bale's continually impressive Bruce Wayne/Batman performance. On a technical level, the production design and set pieces in the film were absolutely magnificant. I also felt Hans Zimmer and James Newton Howard did another wonderful job in crafting the score for this film. Overall, Christopher Nolan manages to create a sequel that is not only better than the original, but he manages to craft my favorite movie of all time."
    },
    {
      "rating": "10",
      "text": "This movie has to be viewed in combination with Batman Begins. The two really complement one another. At two and a half hours running time, if they had included more character development for Batman, it would have been too long to be watch-able by today's standards. So let me go ahead and say that I understand the decision to give Joker as much time on screen as possible, as this being a sequel some other character had to be focussed on to keep things interesting. However, this left Bruce Wayne with too few scenes without the mask where he wasn't being smug. Batman Begins showed us the human side of the superhero, and that is why I loved it so much. He felt so real and authentic. So the reason I'm giving it such a high score is only because of Joker. If he had not completely blown my mind away, I would have scored it much lower. The supporting cast did a commendable job but nothing which would have earned the movie favourable reviews and critical acclaim."
    },
    {
      "rating": "9",
      "text": "What a breath of fresh air. Such a brilliant step up from the previous movie. Fantastic performances all round. Ledger in particular was just amazing as the Joker. This is what a Batman movie should be. I would love to say more, but I really can not falter this movie in any way. As close to perfect as I could hope for a comic to movie film.\r Overall:\rThis is Batman!"
    },
    {
      "rating": "9",
      "text": "One of the best superhero movies of all time. The Dark Knight is much better than Batman Begins, mainly because of Heath Ledgers mesmerising performance  as The Joker. I won't go on about just take my word for it that he's amazing. Batman Begins had a weak plot, this has one of the best plots of any movie ever, Christopher Nolan took a risk and made the plot political instead of pointless like Batman Begins, and it worked. The Dark Knight is a very enjoyable and one of the best movies of all time."
    },
    {
      "rating": "10",
      "text": "After a great start to a new batman trilogy with \"Batman Begins\", Christopher Nolan goes deeper into the story and has created a true masterpiece. Not only as one of the best superhero movies ever made, but also one of the best superhero movies ever made. If one things for sure, not only is the story more thrilling but so are the characters. Especially the Joker and Harvey Dent. But still, the Joker (Heath Ledger) steals the show. It was truly the most villianous portrayl of the Joker I've ever seen. He keeps you on the edge of your seat with his tremendous acitng and his tremendously creepy new look. Plus, Harvey Dent (Aaron Eckhart) was surprisingly outstanding as well. Not so much like the Joker, but still, you got to love his performance. Also, the characters have definitely grown since Batman Begins. They've become more riching and engaging. This trilogy really has a great ensemle of actors, which is something that really works for the trilogy. Overall, this is the batman movie we've all been waiting for."
    },
    {
      "rating": "10",
      "text": "It isn't an overstatement to call The Dark Knight the most sophisticated and ambitious work of its kind. Superior to all three Spider-Man installments and even its amazing predecessor in terms of conceptualization, writing, acting, and direction, Nolan's follow-up to Batman Begins is a dark, complex and disturbing film, not the least of which because it grafts its heroics onto the blueprint of actual reality rather than that of spandex-clad supermen. And while such a distinction may make little difference to those already eagerly anticipating the return of the caped crusader, suffice it to say that The Dark Knight qualifies as the first official comic book adaptation that truly succeeds in being a great artistic achievement in its own right."
    },
    {
      "rating": "9",
      "text": "This movie changed the way I see Batman. This Part 2 of the trilogy was by far the best in the trilogy, and probably the best Batman movie I've ever seen. Sorry, Adam West, Michael Keaton, and George Clooney. And that voice!"
    },
    {
      "rating": "10",
      "text": "This thing has everything a movie could ask for: a complex set of themes that raise questions about morality and philosophy, but with enough action, memorable dialogue, tight pacing, and character development to not get bogged down by its complexity. Ledger's Joker is, needless to say, one of the greatest movie villains of all time. The whole cast brings its A-game, ultimately creating the best superhero movie and arguably one of the best films of all time."
    },
    {
      "rating": "10",
      "text": "The Best action movie ever made, the best crime movie ever made, the best villain performance ever performed by Heath Ledger the Joker, I Think I can watch it 100 times and never get bored, Great work from my idol Director Christopher Nolan, thank you for this one."
    },
    {
      "rating": "10",
      "text": "The Dark knight is definitely one of the best movie of all times, It put a batman on the sky, the performance of Christian Bale and Heath Ledger are OUTSTANDING!, All the characters played a strong role, this movie has everything, amazing soundtrack, and story, epic battles, best action fights!, the best movie of christopher nolan!\rthis will become a classic movie........."
    },
    {
      "rating": "10",
      "text": "Simply the most stunning, exciting and twisting movie ever made combined with a great cast including the best acted figure in any movie I've ever seen with Heath Ledger as the Joker. Never before a film was so cunning making a person feel crazy and godlike at the same time with Genius-Like Appearences at the Mafia on a Banquet or in a bank-robbery. Batman himself doesn't feel invincible and Two-Face has an awesome story to become what he is nowadays. Scarecrow has a little guest role (I love the actor), aswell as Morgan Freeman and an awesome Michael Caine.\rThe Unexpected trick of the Joker, the two ships, everything is perfect. Easily the best film I've ever seen!"
    },
    {
      "rating": "10",
      "text": "First of all, there is no doubt that the reputation of this film, and Heath Ledger's performance, were bolstered by his untimely death. That makes no difference. This is an accomplished and subversive work, and the most fully realised of Christopher Nolan's Batman trilogy - its predecessor did little more than establish the foundations of this film, whilst its successor lacked focus or a satisfying conclusion.\r \"The Dark Knight\", on the other hand, is an expansive, complex and soulful masterpiece of film, which spearheaded the re-evaluation and acknowledgement of the superhero genre as an art form capable of producing stories as daring, layered and emotive as standard art house fare, or modernist literature and being good for more than just action and special effects. This film is masterfully designed, scored, edited, acted, and shot, reminiscent both stylistically and in terms of storytelling as the classic thrillers of the 1970s. Much like New York City in \"Taxi Driver\", Nolan's Gotham breathes, and so do the characters, who are understood as real people and compelled to act as such, rather than just vehicles transporting the viewer from one action set piece to the next. Both Gary Oldman and Aaron Eckhart are fantastic, offering nuanced and desperate portraits of virtuous men broken by their own goodness. They deserved Oscar nominations as much as Heath Ledger. As for Heath Ledger, it is an astonishing piece of acting whether he lived to see it on-screen or not. He is explosive, twisted, visceral, and utterly terrifying - and damn near impossible to take your eyes off of.\r Is this is a perfect film? There's one too many leaps of logic involved, so it falls short, but only by a minuscule margin. This is certainly one of the best films I've seen - a grand and operatic morality play, breathtakingly colossal, searingly intimate, and unbearably sad. Detractors may try to use Heath Ledger's death to discredit its success as circumstantial. I remind you: nobody from \"The Avengers\" died."
    },
    {
      "rating": "10",
      "text": "So i thought the first film was pretty boring. Definitely not the case with this one. It's gritty, it's dark, brings brilliant character development along with far more interesting characters like The Joker and Two-face, and has the best plot out of all 3 films. A performance best by the sadly late Heath Ledger as the Joker, and Aaron Eckart and Christian Bale also bringing excellent performances. This film has a far more film noir feel to it (but obviously isn't film noir). Thr twists are brilliant and Ledgers transformation into the Joker is the best on screen performance to dub our screens yet. Film is filled with great visual effects also, awesome practical effects and great stunts too! A must watch!"
    },
    {
      "rating": "10",
      "text": "This is my favourite movie of all time. It's dark, awesome and has one of the best villain performances of all time, R.I.P Heath Ledger. Also I love Batman,he is my favourite comic book character.\r10/10"
    },
    {
      "rating": "10",
      "text": "This film is the perfect super hero movie. Gotham City is displayed so well visually. It is full of a great cast, and everyone is sharp in this film. I really need to see this movie again. What more can be said about the Dark Knight? Heath Ledger is dynamite as the joker which every knows by now. If you have not seen this movie yet go out and see it. You won't regret it."
    },
    {
      "rating": "10",
      "text": "The Dark Knight is the closest any superhero movie has come to \"perfect\" with transcendent dialogue, a sturdy plot and marvelous casting including Heath Ledger's iconic portrayal of The Joker all assured under Christopher Nolan's masterful direction."
    },
    {
      "rating": "10",
      "text": "Forget that The Dark Knight is one of the best superhero movies of all time.. it is one of the best MOVIES of all time.  In actuality it doesn't even really need to be a superhero movie.  It is a tense, intellectual thriller from the master of such movies, Christopher Nolan.  Heath Ledger is amazing as the Joker and I think his performance will never be topped."
    },
    {
      "rating": "10",
      "text": "By combining epic action akin to Michael Mann, an endearing cast and a blisteringly psychotic antagonist; Nolan has dropped his hero in the realms of realism and forever changed the superhero genre."
    },
    {
      "rating": "10",
      "text": "Easily the best movie of not only the Nolan batman trilogy, but of his entire career, this is without a doubt the perfect superhero movie. Its hero truly is a hero, not one who does what he does for the glory, but for doing the right thing, regardless of how much those he serves hate him in return. The hero is not perfect, as he does fall, showing even further his immense humanity. The villain is not a stock character who is easily defeated, but a man with a troubled and unclear past, whose genius seems to always win. The battle for Gotham's soul is fought between a strict moral code and nihilism, the immovable object and the unstoppable force."
    },
    {
      "rating": "10",
      "text": "This film is a beautiful metaphor for the greatest struggles of life itself; I have recently discovered that Nolan's masterpiece seems to address the problems created by a figurative or literal multiple personality disorder. We have three different angles of perspective on life, all grabbing for Rachel, who represents love, in one way or another.\r Harvey Dent is essentially a saint, an idyllic hero driven by hope and compassion that has presumably only been able rise up to the challenge of fixing Gotham City due to the changes set in place by Bruce Wayne, who sees the world for what it truly is: a hellish, twisted roller coaster of synthetic euphoria and very real pain. He too, though, is driven by his positive emotions and, because he has hope in his heart that he can \"save the day and get the girl,\" he decides to do what he can to make the ride as comfortable for the rest of us as he possibly can, even at the cost of his own life.\r But The Joker sees things differently. He is, if not more so, just as intelligent as the Batman. He understands that at least for him, there is nothing to be enjoyed in life. Selfishly he decides that he must drag everyone else down with him.\r It's easy to catch the symbolism here, as it's almost literal (and it somehow harks back to the Green Lantern mythos, though I am unsure of whether this is deliberate): Harvey is the side of a man that represents positivity - hope, compassion, and love, which combine to form \"Order.\" Bruce represents balance between all emotions, with a central focus on will. The Joker represents negativity - fear, avarice and rage, which combine to form \"Chaos.\" Later in the Dark Knight Trilogy a fourth personality is introduced, but that is not what we are discussing here.\r The beginning is quite literally the chaotic personality's entry into the world, taking advantage of everything that he can in order to do... nothing in particular. That's what's so excellent about this story! The goons would be his friends in the real life interpretation of it, and when he kills them or has them turn on each other, this is the loss that happens when you \"turn to the dark side,\" or choose to give up on the world, as The Joker has done.\r But enough metaphorical interpretation, let's talk about the literal aspects of the film. The first noticeable thing to me was not the direction, the acting, the cinematography nor the editing or action sequences, but Hans Zimmer's score for the film, which was at first deliberately disgusting, with the use of what sounds like a wire being strung for eternity, abused violins and electric guitar, but ultimately beautiful, with the most moving piece of music heard in \"Like A Dog Chasing Cars\" since Krypton's theme in Superman by John Williams, and until \"Time\" from Inception - yet another Zimmer theme! Mocked as it may be, his dense string ostinato sequences left me breathless.\r But back to the story, I'm going to skip a huge chunk and get right to the meaty part. I wish I could cue Zimmer's \"Horn of Doom\" here to alert you to the impending spoiler. Don't read if you haven't watched the movie!\r Rachel is indirectly killed by Joker. While he is being interrogated, the timer ticks down to the explosion of two buildings, each with one hostage inside: Gotham's White Knight, and Harvey and Bruce's only known love.\r Here is the great metaphor of the entire trilogy: Hope. Moving on. Loving more than just one - something both Harvey and Batman are, at the moment, incapable of doing.\r The Joker takes advantage of Rachel's death and Harvey's disfigurement (as you may remember, half of his face is burned off in the fire of the explosion), and convinces him to embrace the chaos of the world around him, and essentially, give in to evil.\r He accepts this offer.\r Skipping ahead to the final acts of this movie (and it has oh so many), we have The Joker about to kill dozens if not hundreds of people on a couple of ferries, who represent the good and bad sides of society, and Harvey, the hero, twisted into wanting vengeance on Commissioner Gordon.\r Once again I will take a break from the story. Let's talk about the other aspects.\r Is this movie effects-heavy? Surprisingly, no. You'd think it would be, given that, it's Batman. But in fact, it relies on practical effects more than anything else. For example, when the massive truck that the Joker is in gets flipped, it is not done with CGI, but with a spring of all things, that shoots it upwards.\r I won't even say anything about the acting - I want you to watch it, because in all honesty, words could not do it justice. In my mortal explanation of one of the various metaphors presented by this film (and believe me, there are other ways to interpret it - mine is just the most literal, emotional example), I have butchered Mr. Nolan's work, so I will just say that you MUST keep an eye on Heath Ledger.\r THE VERDICT:\r Direction: 9.5\r Acting: 10.0\r Cinematography: 9.0\r Editing: 9.0\r Soundtrack: 10.0\r Overall: 9.75"
    },
    {
      "rating": "10",
      "text": "This is my #1 movie. Ever since i saw it in theatres i've seen it over 80000000 times. I know every line from this great film. From the acting to the story this movie is solid, thought provoking and totally awesome."
    },
    {
      "rating": "10",
      "text": "A modern masterpiece of 21st Century Cinema. The Dark Knight combines great direction, with brilliant acting, and beautiful cinematography to create a film that transcends it genres and becomes a great film. It serves as a comic book film, but also a tragedy of Shakespearean quality, with one of the best villains of the last 20 years. On top of that Christopher Nolan's unflinching faith in practical effects create a truly realistic experience."
    },
    {
      "rating": "10",
      "text": "The Dark Knight that came out in 2008 starring Christian Bale, Heath\rLedger, Aaron Eckhart, Michael Caine, Gary Oldman, Morgan Freeman and\rMaggie Gyllenhaal is a superhero movie of Batman. When Batman, Gordon\rand Harvey Dent tries bring down the mob, they face a new threat The\rJoker, who raises hell in Gotham. What unfolds is a 150 min of high\rpace crime thriller.\r The story is quite dark, complex and engaging. The cast is just\ramazing. Heath Ledger gave legendary outstanding performance in his last\rrole. His each dialogue is just amazing. I kinda love every sec he is\rin on the screen. The Joker can be considered one of the best villains\rof all time. Christian Bale is amazing in his best role of Batman.\rThough not as screen time as he had in the last movie (Batman Begins),\rbut still he gave an amazing performance. Aaron Eckhart as Harvey Dent\rwas quite good. After Joker, Harvey had 2nd best dialogues of the\rmovie. Pacing of the movie is awesome too. There won't be any part of\rthe movie which feels slow or boring, mainly because every conversation\ris important. Action is kinda different and unique making it amazing .\rOverall The Dark knight is an OUTSTANDING movie.\r Plot:10/10\rDialogue:10/10\rActing:10/10\rAction:10/10\rPace:10/10\r Overall:10/10"
    }
  ]
}