{
  "id": 4547,
  "title": "The Karate Kid Part III",
  "starring": [
    "Ralph Macchio",
    "Pat Morita"
  ],
  "runtime": 112,
  "genre": [
    "Action",
    "Family",
    "Drama",
    "Adventure"
  ],
  "description": "Despondent over the closing of his karate school, Cobra Kai teacher John Kreese joins a ruthless businessman and martial artist to get revenge on Daniel and Mr. Miyagi.",
  "releaseYear": "1989",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zE58VthFwD9vKy1vEDnSYR6loqm.jpg",
  "categories": {
    "plot": 5.333333333333333,
    "acting": 4.285714285714286,
    "ending": 6.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 2.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Often fairly ridiculous but I actually enjoyed this more than the second one."
    },
    {
      "rating": "5",
      "text": "The worst of the original 3 in my opinion. The villains are way too over the top, Daniel as well with his frustrated, angry, and dark side Daniel persona, sequence of events is too much like the first, and the soundtrack is full of the worst of generic 80s pop rock, no classics. Like all the films, the main villains seem way out of his league yet he miraculously comes from bordering on being sent to the ER to win with some fancy move. As for positives, some of the scenes are great visually like in the first 2 films. It's hard not to feel bad for Daniel by the beginning of this film as the kid did nothing to deserve all the extremely negative attention and violence he keeps getting. He wants nothing to do with any of this from the beginning yet in each film, is pressured to fight. His love interests always end up getting attacked by the villains. Whatever is important to him and those he's close with gets destroyed over and over. His mom is barely present in his life. Only in the first film was she really a part of his life but then after that, she basically left him to be raised by Mr. Miyagi, the former super of the dive motel turned apartment complex they lived in."
    },
    {
      "rating": "10",
      "text": "this is the best sequel of the first movie. there is a good plot, a good villain and Miyagi is fantastic."
    },
    {
      "rating": "8",
      "text": "Overall, loved this trilogy. The first was perfection, I loved the second and liked this one. The only reason I saw these movies is because I saw the pilot of Cobra Kai (which I loved!) and afterwards found out it was based off of these films. There are so many great lessons and inspirational, moving moments in these films. I just can't believe I waited this long to get into this world. And RIP Pat Morita - you were an absolute legend. ♥"
    },
    {
      "rating": "4",
      "text": "I kinda like the premise, but man did I find this installment of 'The Karate Kid' to be an irritating watch at times.Pat Morita (Mr. Miyagi) remains the best part of these films, I had a solid time watching his scenes. Behind him, though, it isn't great at all. Ralph Macchio's performance is a little annoying in this, though he isn't helped by the very poor dialogue - which is seemingly just an attempt for Macchio (Daniel) to say as many words in as little time possible in a shouty manner.Robyn Lively (Jessica) is only there to fill yet another love interest role for Daniel, a third from three films which is actually impressive. Thomas Ian Griffith, Sean Kanan and Martin Kove play the antagonists and they are the most irritating of all - so lazily written.As noted, I did actually slightly like the idea that it attempts. It's nothing fresh or anything close, but if done differently it could've turned into an OK watch. Unfortunately, at least in my opinion, it's the opposite."
    },
    {
      "rating": "6",
      "text": "Too derivative of the original film, even down to the climax. It's not an awful film, but it isn't as good as the first two movies imo."
    },
    {
      "rating": "2",
      "text": "What were they thinking? Besides the epic fight scene between Miyagi and 3 villains, there wasn’t much excitement in this movie. It was a challenge to get through"
    },
    {
      "rating": "6",
      "text": "If you are a fan of the first two Karate Kid movies, you should not skip “The Karate Kid Part III”.  I feel like it does a good job of continuing the story in new ways that weren't already covered.  If you never liked the first two movies, this one will not win you over, as it is easily the weakest of the 3.  I feel like this entry lacks the moving character interaction scenes that the others deliver on.  I do appreciate that the villain has a plan more sophisticated than simply beating Daniel up, but the fact that it drives a wedge between him and Miyagi, means that we don't get those great scenes with the two of them together.  I give it a C, if you've already seen the best, but you insist on watching a movie, try this one out."
    },
    {
      "rating": "4",
      "text": "Basically they redo a lot of elements from the first movie with a few added new elements but it is less immersive and impactful. It is a lot weaker than the previous movies which is a shame as I like some of the ideas. Also the antagonist are overdone. They are often over the top bad guys that feel out of place (But it has also some entertainment value;-). While I said that it is weaker it is not garbage either. I think it is more unremarkable and not refreshing enough. The introduction deals with what happens to John Kreese after the first movie. After this set up Daniel and Mr. Miyagi return home from Okinawa after the events of the prequel. However things have changed as Daniel is now homeless and Mr. Miyagi unemployed because of a reconstruction of the apartment complex (Daniel lives there and Mr. Miyagi was the janitor). Meanwhile the antagonist start their schemes. I stop her with the introduction. It falls into the realm of stories that I can retell and it sounds amazing. Sadly the actual experience is weaker. It feels often like a retelling of elements from the first movie but water down to a weaker experience. There are some silly and some over the top moments that harm the immersion and enjoyment. I used often the fast forward function as it gets too boring otherwise. I like the themes they try to use but these are also harmed by the excessive performances and overuse of tropes. Let go to the actors. Pat Morita as Mr. Miyagi always delivers. He again is a true Sensei and role model. His performances is a saving grace of the movie. Ralph Macchio as Daniel LaRusso feels like he was downgraded from the last movie. Good performance in a weaker script for him. For the antagonists Martin Kove as John Kreese, Sean Kanan as Mike Barnes and Thomas Griffith as Terry Silver: I already said they are over the top but it is still somehow hilariously entertaining. It would be better if they were smarter magnificent bastards. All in all I think the performance is not that bad in this regard. It is the script that cheapens the experience. Maybe they ran out of ideas or they chose the first available script. Overall this is a weak experience and I fully see why many (rightfully so) say it is a pale imitation of the first movie. You can skip this without missing anything as even Pat Moritas good performance is not redeeming enough. It is the weakest movie of the franchise and they tried a restart with the next movie."
    },
    {
      "rating": "6",
      "text": "Esta película es decente y eso es suficiente para entretener; la trama es aceptable y las peleas son buenas; es una buena forma para concluir la trilogía."
    },
    {
      "rating": "7",
      "text": "For me, again, the bomb. After a minor disappointment in the form of the second one, the third one surprised me more than pleasantly. Okinawa is gone now and so at the same time boredom disappeared for me. I liked the story very much. This time it shows the dark side of Cobra Kai even more. Compared to the second one, where I thought it was really unnecessary, here I devoured almost every moment and especially the finale was again grandiose and for me a nice ending to the trilogy. The only thing that bothered me in places was the cinematography. Some scenes seemed a bit overexposed to me. Maybe it was just my imagination. I don't know. To sum it up. It's still not quite up to number one, but it beats number two for me. This is purely my opinion. I really liked number three. I thought it was a little darker, and I like that. I think it's a good film, and I recommend it to fans of the series."
    },
    {
      "rating": "5",
      "text": "Part III is the definition of \"overstaying the welcome\". It has the exact same plot and formula of the first two films."
    },
    {
      "rating": "5",
      "text": "Unnecessary. It's not bad, but we've seen the same formula twice already in more interesting versions."
    }
  ],
  "recommendations": [
    "terminator_genisys",
    "the_many_saints_of_newark",
    "glass",
    "elektra",
    "avengers_age_of_ultron",
    "bumblebee",
    "the_suicide_squad",
    "seventh_son",
    "pan",
    "kingsman_the_golden_circle",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "shazam_fury_of_the_gods",
    "x_men_apocalypse",
    "creed_ii",
    "nobody",
    "incredibles_2",
    "pirates_of_the_caribbean_on_stranger_tides",
    "the_karate_kid_part_ii",
    "i_am_legend",
    "rocky_v",
    "jumper",
    "thor_ragnarok",
    "justice_league",
    "ghostbusters_ii",
    "oz_the_great_and_powerful"
  ]
}