{
  "id": 2535,
  "title": "The Light Between Oceans",
  "starring": [
    "Michael Fassbender",
    "Alicia Vikander"
  ],
  "runtime": 133,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "A lighthouse keeper and his wife living off the coast of Western Australia raise a baby they rescue from an adrift rowboat.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/c9S6VKZPllNgdxBUuI3GYJiqcKO.jpg",
  "categories": {
    "plot": 7.0285714285714285,
    "acting": 7.472222222222222,
    "ending": 7.2727272727272725,
    "soundtrack": 6.5,
    "cinematography": 7.333333333333333,
    "familyFriendly": 6.0,
    "funny": 8.6,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "At first, I wasn't that interested in seeing \"The Light Between Oceans\" because the previews led me to believe it would be a tearjerker. However, a friend wanted to see it, so I said OK, and I am glad that I did. I didn't find it to be a tearjerker at all. Rather, it is a finely wrought story and deals with issues of conscience, war, forgiveness, loneliness, love, and yes, loss, but it's the kind of loss that we all experience to one degree or another. This movie has beautiful cinematography, with awe-inspiring views of post WWI Australia and its rocky coast. The two leads, Michael Fassbender and Alicia Vikander, are stunningly good, as is the entire supporting cast, particularly Rachel Weisz and Bryan Brown."
    },
    {
      "rating": "6",
      "text": "The lead actors, Michael Fassbender and Alicia Vikander are beautiful, not only physically but in their acting ability. The photography of the scenery by Adam Arkapaw, whether it be the New Zealand country or Tasmania or the ocean waves breaking on shore or the skies above them, are beautiful and in some scenes breathtaking. The music by Alexandre Desplat, never disturbs what is taking place on the screen and only underscores it. The direction by Derek Cianfance, who also wrote the screenplay based on a book by M. L. Stedman's, on the surface says what a tearjerker it is, not to forget so many scenes of actors crying, but he never gets to what should be a major payoff of \"The Light Between Oceans\".\r In many ways this film reminded me of old melodramas starring Bette Davis and Miriam Hopkins or Mary Astor. There is the pregnant woman having two miscarriages, a baby showing up in a rowboat with her dead father at an isolated lighthouse island, the couple decide to keep her, the real mother showing up 5 years later and tears, plenty of tears. Where the directors back then were accused of manipulating the audience and getting them to cry experiencing, in some cases, a catharsis, director/screenwriter Cianfance here only skims the surface of what is happening.\r As beautiful as the scenes of the country, water, sun, moon, lighthouse island, the town across the way are, there are too many of each making the movie last 132 minutes resulting in a rushed ending cutting off the emotions of the audience. There are too many voice-overs, too many letters spoken, distracting from the feelings of the actors.\r There is much to like about \"The Light Between Oceans\"--see the first paragraph--but a lot more could have been achieved with a little more effort."
    },
    {
      "rating": "7",
      "text": "Decent film with a tearjerker story, great acting, great cinematography, and a good soundtrack by Alexandre Desplat, The Light Between Oceans delivers a great cinematic experience from director Derek Cianfrance."
    },
    {
      "rating": "10",
      "text": "A beautifully made movie with a touching human message,the choice of the actors is successful and landscape is spectacular. In a world swept away by quick valueless movies, this one restores faith in the media production."
    },
    {
      "rating": "10",
      "text": "The Light Between Oceans is a beautifully shot film set in a stunning landscape. It tells the heartbreaking story of lighthouse keeper Tom Sherbourne and his wife Isabel, portrayed by real life couple Michael Fassbender and Alicia Vikander.They live on their own on a small island called Janus Rock, where Tom keeps the lighthouse going in every weather.He took the position after returning from the war, hoping that the isolation of this deserted abode will be the perfect place to escape his demons. He meets and subsequently falls in love with Isabel, a local girl from the main land. After they get married they live together in the little cottage next to the lighthouse. Life would be perfect if it weren’t for two miscarriages that Isabel suffered over the next few years. Shortly after the second pregnancy ended prematurely, they find a small boat washed up on the shores of the island. Inside they find the body of a young man and a crying baby girl.Isabel sees the baby's arrival as a sign and as her only chance of ever being a mother. She convinces a reluctant Tom to keep the girl and raise her as their own. Tom is not convinced but he does see the life coming back into Isabel, the woman he loves more than anything. He eventually agrees and buries the man in the dunes. They name the little girl Lucy.Tom, Isabel and Lucy are a happy family over the next few years. Life is good and they manage to all but put their secret out of their minds. Until they meet the Lucy’s real mother. Tom’s conscience and his old doubts return. Was it right of them to withhold the child from her birth mother?The movie deals with the moral dilemma that rises from this situation. Tough decisions will have to be made by everyone before long to ensure that Lucy’s best interests are met. Both Tom and Isabel are portrayed as good people who genuinely love each other and the child they have come to regard as their own. That makes it difficult to outright condemn them for their actions. Seeing the devastation they face at the prospect of losing Lucy, one can’t help but feel for them.Only in the second half of the movie do we really get to meet the the real mother and with this the other side of the coin. The producers could not have found a better actress than the ever so beautiful Rachel Weisz for the role of Hannah Roennfeldt. Her portrayal of the sorrow and heartbreak after losing both her husband and daughter haunts the viewer.In fact all three actors gave outstanding performances. I have never seen so much emotional turmoil in a movie. They must have felt drained after every day of shooting. The pain they portrayed was so real that I ended up feeling sorry for all of them. There was never going to be a winner, no matter what outcome.Even the landscape and the weather were used to convey the mood of the scenes. Shots of rough seas and stormy nights are sparring with calm waters batched in warm sun light.There have not been a lot of great movies with a lot of substance in recent years. We all have grown used to mindless action with lots of CGI and special effects for entertainment. Throw in a bit of humour and you are halfway sure to have a success. The bigger the budget the bigger the movie. The Light Between Oceans did not have a big budget or a lot of action scenes. There is certainly nothing funny about the subject. Instead it tells a beautiful story about people. It talks of feelings and struggle. And about doing the right thing, even if it breaks you heart and endangers yours and other people’s lives. It tell the story of happiness and heartbreak, of loss and redemption.The Light Between Oceans makes you stop and reflect on what is important in life. It is ultimately telling one truth: the love of a mother never dies. No matter how you became to be a mother."
    },
    {
      "rating": "0",
      "text": "tearjerker story, but extremely stupid - from the very beginning to the very end. Why they couldn't think that the lost child could has a mother and she may looking for her child? Why could not two mothers agree on the gradual transfer of the child's to real mother, or at least to raise a child together? All the problems in this story are far-fetched stories or characters are complete idiots."
    },
    {
      "rating": "8",
      "text": "A thoroughly flawed film, The Light Between Oceans is no doubt the least of Derek Cianfrance's first three mainstream efforts. Overlong with a plot that takes a bit too long to get to the good bits and the tearjerking, The Light Between Oceans receives such high marks for me for one reason: the cinematography. In my ever-so-humble opinion, all of the film's problems are reduced to ash when compared to the everlasting, remarkable beauty of the film. For me, it is easily one of the most beautifully shot films of all-time. Without question. Where it ranks amongst films in terms of cinematography is debatable, but this film is not just eye candy. It is an eye buffet.\r The film's plot has to be its weakest element alongside its pacing. A little slow and a little too manipulative at times, The Light Between Oceans keeps shoving melodrama at you and expects you to cry. When it fails, it shoves another handful in your face and shows discontent when you do not begin to bawl. That said, it does manage to get you a few times, especially with the love between Tom (Michael Fassbender) and Isabel (Alicia Vikander), as well as in scenes between Isabel and Lucy, These scenes really tug on the heartstrings and are effective at their goal. In particular, the final letter from Tom to Isabel, as well as the one from Isabel to Lucy really knock you on the ground in fits of crying. This is largely in part to the strong characterization of the major players, as well as the sensual chemistry between Fassbender and Vikander. They just worked together very well and the film benefits tremendously from their irresistible chemistry.\r However, as hinted to before, the film takes a little too long to get into things. It lays the groundwork very well, but some better pacing could have helped out this issue. It just felt like the final 3/4's were dedicated to the actual drama of the film. Before that, the first act just kept chugging along and developing the love between Tom and Isabel. While it is a very well developed love story - not so much romance, but certainly love - it is simply unbalanced. It needs more the drama and less of the melo.\r Now, pushing those issues aside, the cinematography made me want to run around the theater shouting, \"F*** YES\". I had to scrape my jaw off the ground multiple times with the beauty of the cinematography and I am not just talking about the beautiful aerial shots of the water. Whether it was cliffs, a shot in the distance from the lighthouse, a shot of the sunset, or shots of the waves crashing ashore, those shots are easily identified as being beautiful. These shots do not set it apart. Instead, what sets it apart are scenes such as the one in which Lucy goes missing. While the scene may be a little filler in the film to a degree, there is no way it could be cut because of the shot of the search party with flashlights in the dark. Brilliantly framed and truly arresting, the cinematography of that scene in particular was so perfect it caused me physical pain. As an overall, the film often takes the feeling of an old-time picture with a goldish hue giving the film the appropriate period look and almost a dose of nostalgia for the 1920s. This goldish hue is truly gorgeous and really blends perfectly with the aforementioned shots of the ocean. Together, all of these wind up producing a truly arresting and visually immaculate film. If this one does not get serious nominations for Best Cinematography, the film gods should blind all voters because they are not using their eyes for their intended purpose.\r As a whole, The Light Between Oceans is flawed. A hit-and-miss tearjerker, it is certainly overlong and a little manipulative. That said, I really could care less. The cinematography is not just a 10/10. It is a 500/10. It is that good. Not since I watched Days of Heaven or The New World by Terence Malick have I been this awe struck by the cinematography of a film. There are times when I obviously find it beautiful, but nothing like this. The Light Between Oceans, from grand sweeping shots over the ocean to shots in the town to the slight gold filter on the film, is truly a sight to behold."
    },
    {
      "rating": "7",
      "text": "Rachel Weisz as Hannah steals the film from its admirable leads. Though she enters the film halfway through her performance is understated and most deserves awards attention."
    },
    {
      "rating": "9",
      "text": "This film is gorgeous from start to finish and is masterfully shot.  I would truly defy anyone to find better chemistry in a film than the two leads here.  Fassbender and Vikander give terrific emotionally charged performances both showing why they are two of the best.  While you could knock the film for a couple of moments that were contrived and a little over the top late, these things are minor.  This is a dynamite piece of work.  A"
    },
    {
      "rating": "8",
      "text": "wow, after long time i see a good film , wow again . when the film is finished i feeling good. this film feeling me good. typical motion , very good and soft screenplay.again i said beautiful long shot and amazing view is very good and romance screen play . and the end is michael fassbender . strong play and romanctic play ."
    },
    {
      "rating": "6",
      "text": "Just another *yawn* romantic love story. May be watched or missed, but if watched, don't expect 'The Light Between Oceans' to be this surprising and cheerful because in the end, neither of those are seen anywhere from the movie's clichéd ending. (We've seen happy endings a lot, don't expect it to be new) It does seem to be a holding contender for its source material and you know I wasn't expecting much either."
    },
    {
      "rating": "10",
      "text": "I will go ahead and give this one a 10. I have not seen a TRUE drama to this extent in a long time. I was at tears at points in this movie because the dramatic moments would build and you could not believe the trouble and heart felt problems this couple falls into. It could easily win for best drama at the Oscars. Michael Fassbender will be up for best actor for The Light Between Two Oceans and is an amazing actor who brings dynamic depth to the character Tom Sherbourne."
    },
    {
      "rating": "10",
      "text": "One of the most beautiful and tragic film I've ever seen. The starring skills of Alicia Vikander are perfectly appropriate. I wanted to watch this film after I've seen \"The Danish Girl\", where Alicia was just a brilliant actress."
    },
    {
      "rating": "2",
      "text": "Very inappropriate film in terms of racial equality. The maker of this film apparently has no idea what happened in Australia around the same time. The stolen generations (also called stolen children) were the children of the Australian Aborigines and the descendants of the Torres Strait Islander who were removed from their families by their federal and state government agencies and church missions on behalf of their respective parliaments."
    },
    {
      "rating": "4",
      "text": "Michael Fassbender plays a troubled WWI vet who becomes a lighthouse keeper on a remote Australian island.  His marriage (Alicia Vikander) is idyllic, until a baby washes ashore and they decide to adopt it. Director Derek Cianfrance (The Place Beyond the Pines, Blue Valentine) likes to make deep, dark films and he's created a cinematic novel in this one: the scenes are slowly paced, there are quiet moments of atmosphere (and lovely oceanscapes) and the story sprawls (133 minutes). While the performances are noble, their complicated conflicts never create much emotional intensity. This attempt at a sweeping, classic romance has plenty of romantic fervor, but falls short of dramatic power."
    },
    {
      "rating": "8",
      "text": "A tale of imbalance between love and grief.The film was based on the Australian novel of the same name. It was a recent book, but a period drama about a World War I veteran who just returned home. So I feel this film was made too soon. Because it seems so classic, only if we had given some time to pick up its popularity. I mean the literature version which at least needed a decade of freedom before heading to the big screen. You know, this same kind of tales from the past is what now we consider epic, which looks even better in the cinema. Anyway, this film was good, but the future adaptations will be much more effective for its viewers.From the director of 'The Place Beyond the Pines' who also wrote for the screen. The title gives a brief insight of what kind of a tale it is. But the film was even deeper and darker with emotionally strong. The island where it takes place reminded me 'Song of the Sea', though it is not a fantasy film. If you love views, nature, particularly seaside, this film will suit you.Besides, the story was much stronger, so the backgrounds will fade away when all your focus fall on its narration. For me the location was the first in the film, the hundred year old setting, away from normal society was the most impressive. It helped to narrate this wonderful drama which contained the message of moral imbalance.Tom Sherbourne, a World War I hero who relieved from the duty returns home and becomes a lighthouse keeper in an isolated island on the west coast of Australia. He marries a woman whom he has instantly fallen in love. Now they are living far from the human world. A couple of tragedy strikes in their life following one another.Before coming out of that trauma, they find a baby on a lifeboat that washed up on their island and decides to adopt her. But after some times when they return to the mainland, they come to realise what they're doing is not legally nor morally correct. From onwards how it affects their each others trust, how far it all goes and how the story ends was told in the remaining parts.❝You only have to forgive once. To resent, you have to do it all day, every day.❞Despite the book was modern, the storytelling was so vintage. I'm talking about the way the plot and characters developed, including how it concludes. For the present generation, if you are familiar with a few similar works from the past, then you would predict this film. I mean not the entire film, but some scenes are at its initial stage can be foreseen. Because sometimes, some developments are called coincidence, but when you have plenty of them, that is called very intentional. That was the only negative of this film. By avoiding them the tale would not be possible. In other way, it could have had stretched even further which are unnecessary details.I did not care the clichés. For me it was a fine drama. The performances were magnificent. It looked to me an Oscar worthy, from both Michael Fassbender and Alicia Vikander. Even Rachel Weisz was for the supporting role. So tick marks for cast and locations, also the screenplay and score. But the sad part is the film was not received very well, especially by the jackass film critics.It's not the same case with regular movie goers, particular I think the older and matured people would like it better. But it's not another 'Pride and Prejudice' from the family audience perspective. The events of the film and the outcome can be wrongly judged. Most importantly, it sets in the same world as ours, so everything is the near fact based. So the right and wrongs are inside the film, but not applicable for the filmmaking which I think a well done job.The post climax scene, the one that comes before the end credit was very good. For this kind of tale, that kind of outro sets a final tone. Despite not an inspiring storyline, all the portrayal in the film was so poetic. Mainly because of slow narration with high influence of sentiments and most of the occasions being dialogueless. The length was not an issue if you like period dramas. Anyway, it was engaging theme, there's always something keeps happening. So I think this is one of the under-rated films of the year. It deserves much better recognition. If you haven't watched it yet, I recommend it and highly if you are 30+.8/10"
    },
    {
      "rating": "7",
      "text": "The Light Between Oceans, what a fantastic movie, I give it 7 stars because I hated the ending with all my heart. I found myself hating Rachael Weisz's character and wanted her to die. The first act is perfect, it's romantic, it's sweet, it's beautiful. It begins to go down hill when Weisz's character shows up. It's gets a bit melodramatic and soapy at times, but overall I think this movie works. I cried during this film. Alicia Vikander is outstanding, the cinematography is incredible, Michael Fassbender gives his best perforance, no joke. I really like this movie it had me on my knees begging for a happy ending."
    },
    {
      "rating": "7",
      "text": "With extremely strong performances by Michael Fassbender and Alicia Vikkander the movie is able to overcome some of its shortcomings with the plot being a little too predictable and mainstreamed. The movie is extremely emotional and sad at moments. But I feel the movie does it almost too much to become truly effective. With great performances the movie ultimately overcomes its shortcomings and is a good watch for anyone."
    },
    {
      "rating": "7",
      "text": "Looks like user reviews here either HATE this movie or really like it. Also seems to be nobody reviewed this movie since last user review before me (if you sort by date) was in 2018! Well it's 2021 now and I have to say I mostly enjoyed this movie because it was recommended by someone I really care about and we watched it together. So, I guess a bit biased here? :) On the other hand i probably would have not watched it at all but I am glad I did. It is not an \"outlandish\" story, quite realistic I believe, so it was interesting seeing how the story unfolded. Acting was great, movie shots were great, too."
    },
    {
      "rating": "5",
      "text": "The Light Between Oceans, based off of a book, is an unfortunately mixed bag of a movie. On one hand, the acting is very good and when the movie finally gets to its narrative (50 minutes in), it starts to thrive. In addition, I wouldn't hesitate to nominate this movie for best cinematography because the shots are so gorgeous that I don't even know where to begin praising it. Maybe I should start with the locations.\rHowever, so much of this movie's substance fails. As previously mentioned, it actually takes 50 minutes before the movie's plot starts kicking in. Everything before then is setup, which only needed to be 10 minutes long. At first, it starts to thrive, but by the end of this 135 minute movie, the movie never seemed to have traveled far. It isn't very deep or thought-provoking, especially because one of the characters needed much more development. Its subject matter needed a better representation, and this movie can only muster up a seal of mediocrity."
    },
    {
      "rating": "7",
      "text": "Schwer gezeichnet vom Ersten Weltkrieg flieht Tom (Michael Fassbender) in einen Leuchtturm vor der australischen Küste. Lange ist er nicht allein – denn die hübsche Isabel (Alicia Vikander) holt das menschliche Wrack zurück ins Leben. Als das junge Glück durch zwei Fehlgeburten beinahe zerbricht, schlägt das Schicksal ein viertes Mal zu: Der Sturm spült ein Ruderboot an, darin: ein Toter und ein putzmunteres Baby. Das traumatisierte Paar behält das Kind – mit verheerenden Konsequenzen. The Light Between Oceans ist ein wunderschön diesig gefilmtes und toll gespieltes Liebesdrama mit einer sich sanft entfaltenden Story voller unerwarteter Wendungen. Trotz einer eher konstruierten Ausgangssituation sind alle kommenden Konflikte bemerkenswert nachvollziehbar. Hier gibt es keine Schuldigen – was den Film zu einer teils unangenehmen Erfahrung macht. Leider verpatzt Regisseur Derek Cianfrance etwas den Spannungsbogen, sodass The Light Between Oceans vor allem mittig etwas vor sich hin plätschert."
    },
    {
      "rating": "6",
      "text": "a sculpture chiseled for the cast..The Light Between OceansThe Light Between Oceans is a character driven romantic drama about a couple who is ready to take immoral steps in their lives in order to seek happiness. After a thundering adaptation in \"Blue Valentine\", Cianfrance had an enormous amount of expectations to fill in, which it fails to do so, despite of making a decent feature. Ticking for more than two hours, such overlong features that too of this genre can milk its way out and offer mere dry emotions to the audience. But packed with finely edited screenplay; except for the first act, the feature is utterly gripping and compelling with layered concept emitting through each character's well thought out perspective. Meddling with such fictitious premise, it leads the feature on such a borderline edge where people's opinion arguably may differ. But this is where Cianfrance; the screenwriter and director, comes in and flaunts his experience of brilliant execution skills. There are moments in here which might be chalky around the edges due to inedible conversations and cheesy manipulative dialogues, but such sequences are confronted well enough by the cast and pulls them off with conviction. The background score is decent along with costume designing but the cinematography steals the show in here with some jaw dropping visuals and live locations which is beautifully shot in here. As mentioned, Fassbender is achingly good and Vikander's complex show-stealing act chills down the spine along with Weisz's surrendered support that binds all of it in and actually helps elevate the feature. Stellar performances, stunning visuals and morally complex and heartbreaking tale are the high points of the feature. The Light Between Oceans is a sculpture chiseled for the cast to flaunt their finesse on screen with a wide range offered to them by the smarter adaptation."
    }
  ]
}