{
  "id": 4630,
  "title": "The Young Messiah",
  "starring": [
    "Adam Greaves-Neal",
    "Sara Lazzaro"
  ],
  "runtime": 120,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "Tells the story of Jesus Christ at age seven as he and his family depart Egypt to return home to Nazareth. Told from his childhood perspective, it follows young Jesus as he grows into his religious identity.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ubehK1ZnM0NQphchuaMeE4A1BZk.jpg",
  "categories": {
    "plot": 5.8,
    "acting": 5.2,
    "ending": 5.0,
    "soundtrack": 2.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "It was not Biblical in the purest sense,. However, based on other movies ie Bible, it was thought provoking.  We do not know very much about Jesus' childhood.  I believe this film will cause some to investigate who this child really was and that is a very positive thing."
    },
    {
      "rating": "10",
      "text": "If you believe... you will understand it completely. Emotional throughout and beautiful scenes. The actor playing Jesus is such a sweet boy that you will be completely wrapped in the story."
    },
    {
      "rating": "10",
      "text": "Given the fact that we are not given historical data in the Bible of the years between the birth of Jesus and the beginning of His ministry, this movie is highly enlightening as to imagining what those years may have been like for the Young Messiah.  It is ridiculous to assume that he was struck one day with the realization of who He was and the reason for His being and suddenly set out on a journey to minister to the world.   He had to have known and grow into His calling.  The Young Messiah is astounding and truly inspiring as we imagine what His life may have been like growing up as both a human and the future King."
    },
    {
      "rating": "8",
      "text": "Very good movie, beautiful landscapes, uplifiting message, and interesting characters. Its harsh ratings are mostly due to it not being the 'true depiction' of Jesus Christ himself. It only shows the characteristics of Jesus instead of his facial features. Over look that, and you will enjoy the film. I'm not particulary religious but the positive morals and message made the movie worthwhile."
    },
    {
      "rating": "5",
      "text": "I have to give the movie credit for providing an interesting look at what the mindset of Jesus may have been like during his formative years. His search for answers and struggle to realize just what he really is mixed with his innocent and sweet nature make for a very believable child depiction. This is only bolstered by the Mary and Joseph angle. Their struggle in regards to what he is old enough to here and just what exactly they should be telling or keeping from him is just as compelling.\r Unfortunately the movie does stumble a lot though. Given that there is little information about these years in Jesus' life, the tale surrounding these themes is completely original to the movie. Sadly, it's just really boring. The characterizations are interesting, but the actual plot backing it all up isn't. It moves at a snail's pace and by the time the credits have rolled nothing will have happened.\r It's a nothing of consequence story. The idea of exploring who Jesus was as a child is a good one. This exploratory element, while completely made up, makes things a little more watchable. However at the end of the day there's just not much going on here to keep your attention. While I appreciate the sugary sweet nature of the movie, it doesn't make up for the lack of any sort of narrative significance. It's a boring movie with some good ideas and nothing writing wise to back them up. Mix in the decent, but rather flat performances and you have a faith-based movie that does little to entertain."
    },
    {
      "rating": "7",
      "text": "A very positive, uplifting, and fulfilling film, based on Anne Rice's brilliant (and yes, better) book about the early years of Jesus Christ. Strong acting holds this up, and thematically it is perfectly in line with Christ's message of hope, light, and reaching out to God. There is a bit of an issue with the lack of suspense, as the plot does not really find a way to heighten the tension and conflict enough to make up for the very well known ending, but regardless, a good film for sure.The hate is of course coming from atheists and Bible-belt conservatives alike, which are two groups that are always head-to-head for most ignorant on any subject they talk about, yet sadly their views are the loudest."
    },
    {
      "rating": "3",
      "text": "Another Christian movie, another failure. I just really cant wait until I can stop watching these made up storys of religion. If your religion you will like it."
    },
    {
      "rating": "0",
      "text": "Not based on \"Truth\".  The American public deserves not to be deceived.  This is not the Jesus in the bible.\rI am very concerned for those who are curious and don't know Jesus, thinking they will learn something about who He is from this movie.   They will only be deceived!  The public deserves better than this.  In my personal opinion this movie was only made to \"make money\"  not to show us who Jesus really is.  What a shame."
    },
    {
      "rating": "5",
      "text": "It was entertaining at times. Even though it was extremely biblical inaccurate I had somewhat of a good time. It also felt like it went on for 20 minutes to long."
    },
    {
      "rating": "6",
      "text": "The Young Messiah is lovable and decent as ever. Surprised? Well, this film normally surprises me but just fails to at the end. It would be better just by the second that I finally see ratings here."
    },
    {
      "rating": "2",
      "text": "Soft, warm, without emotion or depth.This film addresses the childhood of Jesus Christ and is based on a novel by Anne Rice, an author who has been an atheist for years, and this book will have been written shortly after her conversion to the Christian faith. Jesus is the most striking historical and religious figure in all of human history and it means so much to so many people that it is necessary to treat him with care when making a film. Making this film was a bold and courageous step, but also dangerous, as we know almost nothing about Jesus' life during his childhood and youth.The film, as I said, is largely based on an Anne Rice novel, and it is most likely that the author has gone to seek most of her information about Jesus' youth from the Gnostic texts and the apocryphal gospels. There are immense ideas that the film conveys, moreover, they are totally at odds with the Catholic Church, which states that Jesus would not have worked miracles in his youth and had a normal childhood, except for the famous episode where, at the age of twelve, he disappears on his parents' side and is found debating with the doctors and wise men of the Jerusalem Temple. However, here we can see Jesus performing several miracles without knowing who he really is and why he is doing it. Blasphemy ... for those who believe what is in the Bible, of course.When I saw the film, I felt that he tried to avoid being too preachy. However, the film is so lukewarm and makes such a mess with Jesus' youth that it is difficult to swallow. The cast's bland performance doesn't help. Adam Greaves-Neal is quite weak and warm for the character, he lacks charisma. Furthermore, he, Sara Lazzaro and Vincent Walsh seem too Western to represent Jews from the Middle East. In fact, this applies to virtually the entire cast. Rory Keenan has very strange hair and is bored in his role as Satan. Christian McKay was OK, but it sucks to see how an uncle of Jesus seems to know more about Jesus' future role than Jesus himself. Jonathan Bailey is weird and only exists in the film to bring a classic and manic villain to life.Technically, we have everything we could hope for, without major surprises. A regular and nothing special photograph, sets and costumes that try to recreate the time but seem to have been made with material and props from the \"Passion of the Christ\", \"Gladiator\" (those Roman military uniforms) or from the \"Rome\" series. The soundtrack is as bland, dispassionate and warm as the film itself."
    }
  ],
  "recommendations": [
    "the_case_for_christ",
    "the_shack",
    "son_of_god",
    "risen",
    "silence",
    "the_last_temptation_of_christ",
    "machine_gun_preacher",
    "unbroken_path_to_redemption",
    "i_still_believe",
    "heaven_is_for_real",
    "radioactive",
    "american_pastoral",
    "war_room",
    "exodus_gods_and_kings",
    "i_can_only_imagine",
    "the_reader",
    "overcomer",
    "the_book_thief",
    "the_giver",
    "the_hate_u_give",
    "tolkien",
    "the_tree_of_life",
    "the_white_tiger",
    "the_passion_of_the_christ",
    "mary_magdalene"
  ]
}