{
  "id": 4872,
  "title": "The Aftermath",
  "starring": [
    "Keira Knightley",
    "Alexander Skarsgård"
  ],
  "runtime": 108,
  "genre": [
    "War",
    "Drama",
    "Romance"
  ],
  "description": "In the aftermath of World War II, a British colonel and his wife are assigned to live in Hamburg during the post-war reconstruction, but tensions arise with the German widower who lives with them.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/slGZ8miznmAZAaDHEz6BKo7f1N5.jpg",
  "categories": {
    "plot": 6.230769230769231,
    "acting": 6.333333333333333,
    "ending": 7.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Well acted, though not very exciting. Rather predictable slow story that brings literally nothing new. The post-war setting is believable enough though the romance part feels more than just a bit weird. It's an acceptable way to pass the time, though at some point it just gets overly sentimental. You can continue to look at the beautiful people from that point on, but any real interest you might have had in the characters may start to fade away. They didn't need a post-war setting to tell this story."
    },
    {
      "rating": "7",
      "text": "5 months after WWII officially ended, we have here a love triangle, starring Keira, Aleksander and Jason Clarke. I watched this drama admittedly for a little escape. Is it the greatest thing since French toast? No. Was it an effective brief escape for yours truly? Yes. The triangle people are attractive, Keira lusciously costumed and the visuals are, in a word, fabulous. For me, it begged the question: What's not to like? But does it usher in World Peace? Alas! It does not."
    },
    {
      "rating": "10",
      "text": "Brilliant, atmospheric film about a time in history most of us in the West know little about. So many films around occupied France and the allied resistance but after the war in occupied Germany, with Nazi Resistence groups is an interesting new take. Glorious sets and very good performances, especially from Alexander Skarsgård as the widower trying to keep some kind of civility and calm amongst chaos. Forget the critics, this is entertaining, thought provoking and thrilling. Go see!!"
    },
    {
      "rating": "9",
      "text": "This movie acquainted me with a period of time about which I had learned nothing in history class, and I found the drama both depressing and extremely compelling.  Although the story progressed slowly, the actors did an excellent job of building and maintaining the dramatic tension among the characters; and so the movie engaged and held my attention to the very end."
    },
    {
      "rating": "4",
      "text": "I blame the director more than anything.The story wasn't bad and the actors tried but it's so insipid and boring that you never gain interest in the characters or their conflict."
    },
    {
      "rating": "2",
      "text": "(Mauro Lanari)It would have been legitimate and proper to expect a film on reconciliation, one of those dear to Robert Benton (\"Places in the Heart\", 1984). Nothing like that. It's a soap opera that could be set in any other place and time. Better yet: in the trash."
    },
    {
      "rating": "5",
      "text": "Aftermath never claimed to be anything more than its modest trailer: a fiery forbidden romance between a British housewife and a suspected Nazi in post-war Germany. It’s a little more feelsy than, say, Lady Macbeth, but it’s hard to imagine it aspiring to anything so great. It’s good to see Jason Clarke getting work out there (the week before Pet Sematary‘s remake).This movie did a better job of hiding some central tensions from the audience in its trailer than we expected. I won’t go into too much detail because this movie isn’t plot heavy enough to withstand too much of an analysis without revealing a lot of the action of the movie entirely, but at a certain point it dawned on me that we were watching the story of three very understanding people coping with an awkward relationship more than a period piece about the aftermath of the Second World War.The first half of this film is a fairly exciting story: insurgent attacks, illicit sex, and German jokes at Keira Knightley’s expense. As things progress, the story falls into the tracks of a more conventional romance. Wife mentioned at one crucial point in the climax that she had been suspecting something would happen with the daughter’s allegiance to an organization that would reveal her to be more duplicitous than she seemed after the makeover scene. She says that the scene on the frozen river after the car ride back from the party was so unexpected and disorienting that she could have believed any permutation of the scene to play out, which seems like high praise. She also really liked the twisty ending."
    },
    {
      "rating": "10",
      "text": "The Aftermath leaving one of the most satisfying ending in movie i've ever seen, it's smart, it's realistic, and it's right, The Aftermath didn't make the bad side as a protagonist, and that's the thing that \"Tulip Fever\" do and the result is making that film the movie i hate the most, The Aftermath is fills with an incredible perfomance by all the cast too, overall The Aftermath is smart, realistic, and incredible, i highly recommended."
    }
  ]
}