{
  "id": 4781,
  "title": "The Flintstones in Viva Rock Vegas",
  "starring": [
    "Mark Addy",
    "Stephen Baldwin"
  ],
  "runtime": 90,
  "genre": [
    "Comedy",
    "Family",
    "Romance"
  ],
  "description": "The Flintstones are at it again. The Flintstones and the Rubbles head for Rock Vegas with Fred hoping to court the lovely Wilma. Nothing will stand in the way of love, except for the conniving Chip Rockefeller who is the playboy born in Baysville but who has made it in the cutthroat town of Rock Vegas. Will Fred win Wilma's love?",
  "releaseYear": "2000",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nEkMYwctrUH8ueaAcJFZnAEltMX.jpg",
  "categories": {
    "plot": 0.0,
    "acting": 0.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 0.0,
    "familyFriendly": 5.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "not enjoyable, but not that terrible."
    },
    {
      "rating": "7",
      "text": "I see where and why this film coped a lot of slack but I honestly enjoyed it just as much as I did when I was a kid. Sure the first live-action Flintstones film was better but this one is still highly entertaining and certainly stays true to the cartoon in a lot of ways. There are a lot of funny witty jokes that really make the film as well as just being a bright colourful film to watch. Corny, yes and quite a bit too, but not in a way that ruins the movie, but some won't like it others will."
    },
    {
      "rating": "3",
      "text": "Even Worse Than The 94 MovieWith mediocre performances, Pretty bad humour, and overall boring, Viva Rock Vegas is not a “rockin” good time."
    },
    {
      "rating": "0",
      "text": "I always liked the \"Flintstones\" cartoon and I was able to appreciate some aspects of the 1994 live-action movie. However, this movie was a disgrace in every details. Running as a prequel to the first film and the cartoon itself, it shows how the four main characters (Flintstones and Rubbles) met and married, after a trip to the city of Rock Vegas (the equivalent, in the movie and Flintstones world, to the city of Las Vegas, of course). But the thing that really make me mad in this movie, personally, was that silly, green character, that seems to have come out of the \"Jetsons\" (another Hanna-Barbera cartoon). He was permanently out of context, his existence has been poorly explained by the plot and he only served to try to make totally empty jokes. I wanted to drown that alien several times while watching the movie.If the 1994 movie had already revealed several fragilities, beginning with an all-too-adult plot for a children-oriented film, this movie completely misses any attempt to improve these faults. The plot is miserably poor, which is probably the result of poor scriptwriting choices and the subliminal, lousy, intention of extorting some more box office money (we cannot forget the huge box-office success that the first film was). A bad choice: the public wisely didn't pay to watch this piece of trash. Dried jokes, a bad plot, poor acting, bad construction of characters, far-fetched props and sets, a tiring cinematography and a cast that did an absolutely painstaking job. For all this, this is one of the worst family movies I've ever seen."
    }
  ],
  "recommendations": [
    "free_birds",
    "journey_to_the_center_of_the_earth",
    "the_emoji_movie",
    "dolittle",
    "planet_51",
    "minions",
    "the_last_airbender",
    "national_treasure_book_of_secrets",
    "the_war_with_grandpa",
    "escape_from_planet_earth",
    "night_at_the_museum_battle_of_the_smithsonian",
    "zoolander_2",
    "independence_day_resurgence",
    "alvin_and_the_chipmunks_chipwrecked",
    "monsters_vs_aliens",
    "doctor_strange_in_the_multiverse_of_madness",
    "yogi_bear",
    "uglydolls",
    "baywatch",
    "teenage_mutant_ninja_turtles",
    "pixels",
    "guardians_of_the_galaxy",
    "thor_love_and_thunder",
    "space_jam_a_new_legacy",
    "the_day_the_earth_stood_still"
  ]
}