{"id": 1541, "title": "The Cabin in the Woods", "starring": ["Kristen Connolly", "Fran Kranz"], "runtime": 95, "genre": ["Horror", "Fantasy"], "description": "Five friends go for a break at a remote cabin, where they get more than they bargained for, discovering the truth behind the cabin in the woods.", "releaseYear": "2012", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/kjDXrK3ReIwuDrpWElI5OQkKYTA.jpg", "categories": {"plot": 9.413793103448276, "acting": 9.5, "ending": 9.526315789473685, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 9.387096774193548, "action": 9.0}, "reviews": [{"rating": "10", "text": "This movie was the definition of mind-blowing. It was absolutely fantastic. It's impossible to describe the film without giving anything away, thats why the synopsis is so short. I work at a movie theater and just the other day, a group of three guys went to go see this movie and left 10 minutes into it and said it was the dumbest movie ever made and it was a waste of money and time. Im sorry but if you are like these 3 men then you are a hypocrite and you are just plain stupid. Everybody and i mean everybody complains or at least acknowledges the fact that all horror movies are made the same nowadays. The Cabin in the Woods has listened to everybody and has turned the tides. This film is pure genius. It changes it up and shows you behind the scenes of every cheesy cliche horror film ever made, and it does it very well. It explains everything we've ever seen in a horror film, including the fact as to why you always have the athlete, the whore, the scholar, the fool, and the \"virgin\" as they say, but otherwise known as the good girl. It will have you on the edge of your seat, it will make you laugh your head off, and most of all, it will make your jaw drop. I loved this film and i believe everybody else will and has too, unless you are a hypocrite like those 3 guys. 10/10...perfection"}, {"rating": "10", "text": "This movie is a breath of fresh air for the horror genre. And holy **** I want that transformable coffee mug / bong that the stoner character used... too bad that prototype cost $5000 to make 0_o"}, {"rating": "10", "text": "This movie has been the best I have seen in years! You got all emotions in one film! You got fear, thrill, suspense, gory, comedy, romance, sexual, nudity all in one film. And that weird feeling that you get once in a while \"what the hell am am I watching\" However, what makes the movie really nice that in never thorough out the movie looses its seriousness. It keeps a real theme all the way. Even tho its meant as a comedy. I wont lie, this movie is not for every one.  When I first saw it, I wasn't it sure if I was suppose to laugh or get scared. Anyway, defiantly a must watch movie. Best part you got the pot head, the extremely hot Blondie`s with her boobs character, with the monsters, zombies and lost of blood. pop some popcorn and go to red box! And the best part, I mean, you got all these different seance from monstrosity to ghosts, to technology, to special effects, this is not a cheap underground movie, The producers really deserve some credit on the graphics and audio! great movie, cant say any more!"}, {"rating": "10", "text": "Whedon and Goddard switch it up three or four times before the shocking climax but never lose their exhilarating pace. It's funny, sexy, and scary as hell. It's also one of the best horror films of the past twenty years."}, {"rating": "10", "text": "It was an original idea! Joss Whedon is one of the best, he always surprises us.\rAnd have chosen perfect actor for these parts!  This movie should be awarded, 8!"}, {"rating": "10", "text": "One of my favorite movies & directors!! I get so frustrated when people say they bailed at the start of the movie then write a review (you have to see the movie to understand it!! Common sense!) If you are not familiar with Joss Whedon or his humor you may be surprised by his ability to be witty, sarcastic & smart all at once. By the way Whedon is the creator of tv's Buffy the Vampire Slayer, Angel & Firefly as well as movies like The Avengers & Thor. He also wrote 24 issues of Astonishing X Men in 2008. When I saw the movie on opening day I had a very vague idea of what the film was about & I'll admit the intro threw me for a serious loop. I was worried at first (I will never question Whedon again) but as always Joss delivered a horror movie full of witty humor, great characters & plot twists that were unique & not at all generic or obvious & an ending that you wont see coming (unless your a Whedon fan....) its a great movie that has earned a spot on my top 10. Its not your typical horror film & not all that scary but its got the makings of a cult classic, assuming people actually give it a chance & watch the whole film!"}, {"rating": "10", "text": "This movie just makes sense! Not single one of the characters in this movie makes stupid decision. Like the overused \"lets spilt up\", motherf***er got killed because you spilt up. This movie is not that clever, its just genuine and honest. Honest about this genre we call horror, which all of their formulas make zero sense. I'd say even the \"whore\" character is not that dumb, not to mention Chris Hemsworth character has an opinion on books, in the mean time he portrays a stereotypical jock. Also, that stoner guy is the best and lovable-est character from a \"horror\" film.\rAm I on speakerphone? I'm still on speakerphone am I?! LMAO."}, {"rating": "10", "text": "I really had thought the movie will be like another horror five young movie (tipic stuped american movies), but, this really one is so amazing. Original! Not as other. That was I waiting for"}, {"rating": "10", "text": "If you've seen the trailers, chances are this movie came across as formulaic, cliche, and painfully predictable.  After having seen the it, I can only think that they did this intentionally so that you'd be that much more surprised when you actually saw it.  If you go to this to see a run of the mill slasher with cut and paste characters, your world is going to be thoroughly rocked.  But since you know that a twist is coming (even though I've done my best not to spoil it) maybe you should take your friends to see it and don't give them any heads up.  Trust me, they'll thank you afterwards.\r This movie is anything but generic, and feels like a giant satire of all horror movies before it, but horror movie fans won't be disappointed for lack of horror if they go see this looking for viscera and terror.  The movie contains a healthy amount of both, but with surprising success it also tosses comedy into the mix (although admittedly it is pretty dark comedy).  Characters that at first glance appear to be bland stereotypes end up being extremely well developed and likable, and even the painfully generic plot and setting end up taking on an almost unreal depth.\r this movie points and ridicules every other horny teenager murderbox movie that exists, while at the same time elevating them far above their previous scope and making them seem more dramatic.  Honestly I really can't express exactly why this movie is so amazing without spoiling it for people, so all I can say is have a little faith and give it a shot.  It's on redbox now, is a dollar really that much to risk?  Trust me, this is a movie you don't want to miss (because if your friends want to talk about it around you, they're going to hate you for not having seen it)"}, {"rating": "9", "text": "This was a good movie. I think one of the writers was Joss Whedon, of Buffy and Serenity fame, and this film has that same sort of polish and quality as those classics. As so many other commentators have said, you can't really say much without giving away the plot, so I won't.  Its a clever, scary, funny movie. Lots of side references to other movies for those who like that sort of thing. What I will say though is don't be surprised if you can make a good guess at the overall plot quite early on into the movie. To me that doesn't matter, its a great movie, and one I'll watch several times."}, {"rating": "9", "text": "The Cabin in the Woods was unique. Constant fourth wall breaks and satire made this movie that much more enjoyable. References and inspirations from other staple horror films are evident throughout the movie as they compliment the unique narrative. It pays homage to the classic films of the genre while also playfully poking fun at them. The story itself uses the parody of horror cliches to its advantage to create a plot that is classic suspense/thriller inspired alongside comedic elements that don't interrupt the plot but rather compliment it. This combination of classic horror action and satire make The Cabin in the Woods unique and a film that is sure not to disappoint fans of campy gore and violence. The Cabin in the Woods is a must see for horror fans, or anyone in the need of a movie is truly capable of standing on its own within the horror genre."}, {"rating": "10", "text": "This film is nothing short of amazing and easily my favourite film of all-time! With twists & turns at every corner it was one hell of a ride to watch the first time and I'm still enjoying it now (3 times I've seen it). Lead by a great cast and with one heck of a storyline I would find it hard to find a Horror fan that didn't enjoy this film. The best thing about it is its such an original idea that hasn't been done and yes it had one hell of an ending! The best film there is, enough said!"}, {"rating": "10", "text": "One of the greatest and funniest horror films ever made, it has a great story and a powerful scenes with great visuals and exquisite acting, I am a big horror fan, this one is good, it is really good, although I was barging for something smaller and simpler, but it turned out to be way too different than expected!"}, {"rating": "10", "text": "Surprisingly smart entertainment. I don't watch or like horror movies, and prompted by a friend was told I had to see it. Finally went on the ride, and by the end was blown away."}, {"rating": "10", "text": "Rotten Tomatoes ranked this as the 34th greatest horror film ever. I don't blame them. Cabin in the woods will gain more cult following as the years go on, but after years of horrible horror flicks, The Cabin In The Woods will give you one of the greatest horror movies of all time. Just when you think it's your typical slasher flick, it takes a complete left turn down \"What the hell?\" lane, and I won't give away too much, but I will say this. There's a unicorn that stabs a guy. It's awesome."}, {"rating": "10", "text": "I went in this movie expecting a cheap slasher horror film, but I was having high expectations, because it has been announced in development since 2009, what I got was way too more in depth than I was barging for, this movie can't be reviewed without spoiling it, what I have to say is...SEE THE CABIN IN THE WOODS, it is different dark comedy with mystery and great visuals (hint) SEE THIS MOVIE."}, {"rating": "10", "text": "If you really enjoyed the Scream franchise, you're gonna love this one, and that is why. The Cabin in the Woods mocks the horror genre, but not the \"Scary Movie\" type of way, but in a smart, intelligent and frequently hilarious way. If you did not like the movie in general, you must have at least found the twist ending to be the most original in the past ten years!"}, {"rating": "10", "text": "Cuando creía que el Exorcista era el unico film de terror que valía la pena, estaba completamente equivocado, THE CABIN IN THE WOODS es divertida, violenta y novedosa, combina todas las bestias, todos los escenarios, todos los personajes y todas las situaciones de las mejores películas de terror de todos los tiempos, creando una maravilla en el cine de horror, es un homenaje al buen cine del terror."}, {"rating": "10", "text": "This movie was amazing. At first i was not sure if i was going to like it, but I fell in love with it. This movie is insane. I really hope that they create a continuation of it. At the end it looked like they might."}, {"rating": "9", "text": "An excellent blend of comedy and thriller The Cabin in the Woods has redefined the horror film genre. I have heard many say that this is one of the best horror films in the last 10 years and I believe that they would be mostly right about that. My only critique of that is that the movie is not so much scary as it is clever and well written. As someone who does not really like horror films I was pleasantly surprised by this film. One can definitely see the influence of Joss Whedon in the writing. This will likely be in my Top 10 of the year and is worthy of much praise. \"Am I on speaker phone?\" Odin's Score: 90/100"}, {"rating": "10", "text": "As someone who rarely watches horror movies, this movie made me realize the potential the genre has. That said, I've always been a huge fan of Urban Legend type stuff. SCP, Lovecraft, that sort of stuff. If you have any interest in anything like that, this is the movie for you."}, {"rating": "10", "text": "noihihihigufydtfjhjhojojohijihyrwassbmmvzchkopk9kjohihihuftdtghuryfyihihhiihhiihihihihih"}, {"rating": "10", "text": "++++++÷××××××÷÷÷÷÷=====÷÷÷÷××××++++=÷÷÷÷÷÷÷÷+++++÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "10", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}, {"rating": "9", "text": "This is far from the cliche horror movie. There is actually a sense of brilliance in this film. With a typical horror film start, the original finds its way to the top as it is filled with surprises and plot twists. I'd recommend it for it's cleverness and production."}, {"rating": "9", "text": "part horror part comedy is what The Cabin in the wood tries to be.the horror was an emotion of fearing the unknown that lies beyond human knowledge while the comedy is a satire on the young generation that was depicted with the killing of typical american teenager.  either horror or comedy,director Drew Goddard alongside Joss Whedon have crafted one of the most weird,twisted,and mind altering horror movie in recent years. it is a horror movie that surely will become a cult in years to come."}, {"rating": "9", "text": "Having re watched the trailer after the film, the it does pretty much give away what the film is really about and make the twists a lot less surprising. However it is a very good, if surprisingly simple story. It sets up a very weird situation and actually explains WTF is going on by the end, which most films wouldn't. Just don't watch the trailers if you haven't already."}, {"rating": "9", "text": "Cabin in the Woods is a uniquely crafted dark horror comedy that is writer Josh Whedon's homage to classic slasher flicks.  With an astoundingly funny vein of dark comedy running through the entire film, this film sets itself apart as a treatise of the horror genre, something that Scream accomplished a decade previously but Cabin in the Woods elevates to another level."}, {"rating": "9", "text": "Not exactly a horror movie, but more of a tribute to the horror classics, the Cabin in the Woods presents an original plot with literally TONS of references to cult horror classics and even some of the video games (Will you spot the Boomer, Hunter, Tank and the Witch from Left 4 Dead?) Can't describe the plot without spoiling it, you just have to see it for yourself, but I guarantee the twists (and boy there are many of them) will be unexpected. The only thing is that the movie isn't exactly scary, which doesn't make it any less entertaining. A must-watch for anyone, especially the horror fans."}, {"rating": "9", "text": "If you think that the Cabin in the Woods is just like any other typical slasher/horror film, then you are completely wrong. I thought the same before watching it and it totally proved me wrong and I'm really glad that it did. First of all, I appreciate the great work done by Joss Whedon and Drew Goddard, they have made something so unique and fresh that you start wondering that why did nobody ever think of it before. The writing is great, performances are good (just the right amount of what you need in a horror film). The storyline is brilliantly incorporated in the genre, the rituals and the sacrifices to keep the Gods happy. The dark humor element is fantastic, really made me laugh at times. The monsters are horrific. I read some reviews by people who are complaining that the film is stupid and terrible. When a typical horror film is made, they complain and when a fresh and original idea is penned into a film, they still complain. Those people can never learn to appreciate the good work. Most of the people who liked the movie also think that the ending sucked, it should have been something else, but that's where the writing of Goddard and Whedon comes in. They knew we would be expecting and predicting the typical ending but they made a daring move by making a fine climax. Not only the climax, the entire film is fine, I have never watched anything like this before and for that, I thank Whedon and Goddard's imagination. If you are a real fan of horror/slasher films and are fed up of watching all those same and predictable ones over and over again, then this film is an absolute treat for you. The Cabin in the Woods is definitely one of the best horror films of 2012 and a rebirth of horror genre."}, {"rating": "9", "text": "Although at times it suffers from cheesy dialogue, The Cabin in the Woods is easily on the best horror films of our time, poking fun at the cliches of horror, while being pretty scary ,as at least one of your greatest fears appears, in one of the best films of 2012."}, {"rating": "9", "text": "This movie was a great satire on modern horror. If you legitimately enjoy slashers and are looking for more of the same, this isn't the movie for you. It's a spoof, and judging it based on jump-scares and nail-biting suspense is like rating a romantic comedy on gore."}, {"rating": "9", "text": "The title kind of discourage me to watch it, i would have thought this movie would just be a murder / killing type, but i was wrong after i found out that Joss Whedon was directing the movie and i gave it a go. I enjoyed it from the beginning to the end of the movie. The storyline was really surprising and the ending was unexpected."}, {"rating": "9", "text": "The only reason this movie was unpopular was because they couldn't really give anything away in the trailers. It is such a great, interesting, new twist on horror movies. This is the first of 2 hits written by Joss Whedon, the second being The Avengers, and I'm eager to see what's next. I don't want to give anything away, so I won't say anything. If you see it without knowing much, then you'll have a much better film experience. This movie is just all around fantastic, and you HAVE to see this movie. Even if you don't like horror movies, you'll still find this movie interesting."}, {"rating": "9", "text": "Great movie\rWether or not its great horro movie will differ according to personal taste.\rI loved it.\rDramaturgical it is brilliant.\rYou can watch it as a horror if you are prepared to be more entertained then scared"}, {"rating": "9", "text": "The \"Cabin in the Wood\" never loses any momentum throughout the whole movie. There are many main points that connect very well. The only thing I don't really like is the killing scenes, it looks kind of unrealistic. But the plot is fantastic."}, {"rating": "9", "text": "Quite possibly one of my favorite horror films of all-time and not for the sheer scares or thrills, but for the dialogue and smart plot twists on the genre. Any film that ends with an angry god rising up from the Earth and Nine Inch Nails' \"Last\" blasting at your eardrums is a very big win in my book."}, {"rating": "9", "text": "I wouldn't have watched this if it were not for my best friend's recommendation  and boy was I surprised at how much fun and how fantastic this film is. So many horror cliches that it plays up well and that is the point of this project. Dark humor that both makes fun of the cliches in horror flicks while sticking to the actual horror and gore parts. Definitely recommended that you watch this!"}, {"rating": "9", "text": "Going into this movie, I had no clue what to expect. I had not seen any trailers or reviews. I knew absolutely nothing about it. Once I saw Joss Whedon's name on it, I got really curious. The first hour or so the movie more or less plays out like EVERY slasher movie that came before it. But as the second half of the movie takes over the real story leaps forward and HOLY S*** is it great. This movie just surprised the hell out of me. Great writing, intentionally generic (but likable) characters, fantastic FX. While it isn't a Horror-Horror but more accurately a parody of a Horror that knows what it is and plays with that as much as it can. It's been a really long time since I've seen a movie like this and I say thank you Mr. Whedon for giving me such a wonderfully entertaining movie."}, {"rating": "9", "text": "With a giant god like hand, Whedon destroys viewer expectation by carefully crafting the perfect satire film with a wit, intelligence and depth that is often lacking in the films it makes fun of."}, {"rating": "9", "text": "A film with a generic horror movie name is everything but.  When I first saw the trailer for this movie I thought it was good to be another awful horror film, but the twist led by the characters played by Bradley Whitford and Richard Jenkins makes this one of the most inventive horror films I've seen in a while."}, {"rating": "9", "text": "Summary: The Cabin in the Woods is refreshing, complex, wicked, and its final act is the dream of every horror fan. 94/100 [A-]\r Directed by Drew Goddard and starring Fran Kranz and Kristen Connolly, The Cabin in the Woods is definitely the best horror film of 2012, not only for its excellent reviews, it's the horror film of the year for its refreshing and original screenplay that revolutionized the horror genre. Although it has a slow start and the first 35 minutes are character development, the whole film was quite interesting. The characters were likable and friendly. Also, it is a very confusing and strange flick, but do not worry, everything made sense at the end.\r It was complex as hell and is difficult not to spoil it, but I will try. The direction was superb, the writing and the actions of the characters were smartly written and the movie is filled with lots of epic twists and memorable moments. It's not more of the same crap, everything in the film feels so fresh and original. The performances were amazing and effective. Shout out here to Fran Kranz, he's definitely the star of the film, he makes us laugh again and again, his performance was excellent. He's so underrated. It's sad that Chris Hemsworth gets all the attention and he's not even the protagonist of the movie.\r The rest of the cast was hilarious and extremely likable too. Richard Jenkins, Bradley Whitford and Amy Acker were terrific and they added some weird humor to the film. It was made with a budget of $40 million and that is very high for a horror flick, I believe that half of the budget was used in the last 30 minutes. They were truly impressive, believe the hype. In addition, I want to add that the special effects were just good enough, do not expect mind-blowing or extremely-realistic effects. The horror genre needs more movies like this one, I mean horror films with a decent budget.\r On the upside, the CGI was good enough, it has unexpected twists, comedy, tension, and gore; mostly in the last act. The second half was a bloody explosion of horror, there was a perfect balance between scares and comedy. It is a must see if you love the horror genre or if you want to watch something so messed up and different; seriously, it exceeded my expectations and it is not overrated at all. See it if you want surprises or violence, also if you want to laugh out loud. On the downside, some of the jump-scares were unnecessary and predictable, but that's my only issue with the film. I can't wait to buy it! [A-]"}, {"rating": "9", "text": "The Cabin in the Woods é inovador na sua proposta e a execução é digna de prêmios.Aqui há uma grande sátira relacionada ao gênero de terror. O roteiro toma a decisão sábia de desenvolver os personagens desde o inicio, a ponto de sabermos que há uma manipulação nas suas atitudes. Claro que o filme deixa isso claro, já que vemos o lado da \"manutenção\", mas isso serve de proposito justamente para fazer com que nos importemos e vejamos quão estupidas são as personalidades tipicas do gênero, desde o atleta tirado a machão, até o cara estudioso e a tímida. Eles os limitam a uma camada unidimensional para agradar os espectadores, e isso é uma critica clara aos filmes do gênero e o grande comodismo que há na industria. Também é interessante a reação da manutenção a longo prazo. Claro que não tivemos acesso ao inicio do projeto, mas a historia indica que isso acontece há muito tempo, e tudo que os restam e se divertir com as mortes e até capitalizar em cima delas, senão os mesmos não conseguiriam dormir a noite. Como os personagens tem o minimo de personalidade, consequentemente nós importamos o minimo, o que deixam suas mortes mais marcantes, principalmente quando elas ocorrem por conta do sistema e eles estranham aquilo. Toda a construção, desde a escolha do método das suas próprias mortes até o final pessimista - que, inclusive, não poderia ser melhor -, acrescenta algo aos personagens presentes em cena. A sacada que o roteirista utiliza para tapar alguns furos é genial, e as cenas de terror são de cortar o folego de tão bisonhamente satisfatórias num ponto da trama.Cabin in the Woods é uma clara critica e homenagem a industria de filmes de terror e, definitivamente, entra pra historia e merece ser lembrado por nós."}, {"rating": "9", "text": "This movie completely surprised me.  Without giving anything away, this movie uses horror movie tropes in very original ways and follows an entirely original, somewhat over-the-top premise making for a fantastic movie.  I knew nothing about this movie beyond the trailer, and as the movie slowly reveals what is actually going on, it makes you just want more and more.  Smart script and incredibly fun movie to watch.  Highly recommend."}, {"rating": "9", "text": "This witty deconstruction of classic and cliched horror stories is a must watch if you are a horror fan. You might just find it an unbelievably funny horror comedy once you've caught sufficient references."}, {"rating": "9", "text": "What a refreshing horror flick. It starts out as you expect but then it goes beyond all expectations. I don't want to put any spoilers in here, but it's safe to say you will never guess what happens after the initial 20 minutes into the movie. The acting is great for what it's supposed to be, and there's one scene in the movie that made me say to the person sitting next to me: \"If they  this will be the greatest scene in any movie.\" You need to see this movie to believe it. Such a gem."}, {"rating": "10", "text": "Absolutely brilliant movie.  I think some people are going in expecting a slasher movie.  Don't do that.  It's more a black comedy wrapped around a great central concept.  Whedon's humor is all over this flick, and he's never been funnier.  Everybody praised Scream for the way it disassembled the horror genre, but Cabin does it SO much better."}, {"rating": "10", "text": "Man this year has been full of great stuff. This is well worth seeing. I give it a 10 just because its actually creative for a change and such a fun movie.! Highly recommend this seeing this."}, {"rating": "10", "text": "The first 20minutes of this movie made me think.... How stupid are the people that reviewed this well? After that I saw the pure genius  behind the cabin. Going back to the ancient times of human sacrifices this makes me go back to when movies were witty and original and this takes that for the gold."}, {"rating": "10", "text": "This is the most fun I've had at the movies in a long time. It pokes fun at itself and horror movies that proceeded it in an original and entertaining way. Twists and turns keep you guessing about what will happen at the end until you finally see for yourself. I wasn't expecting humor in it, but the humor is what made it what it is. Genius."}], "recommendations": ["drag_me_to_hell", "saw", "scream_4", "malignant", "cabin_fever", "scream", "ginger_snaps", "the_collection", "insidious", "insidious_chapter_2", "the_texas_chain_saw_massacre", "the_babadook", "dark_skies", "from_dusk_till_dawn", "the_possession", "annabelle", "the_return_of_the_living_dead", "the_revenant", "wrong_turn", "it_follows", "wish_upon", "devil", "dead_silence", "the_grudge_2", "sinister_2"]}