{
  "id": 3315,
  "title": "The Number 23",
  "starring": [
    "Jim Carrey",
    "Virginia Madsen"
  ],
  "runtime": 101,
  "genre": [
    "Thriller",
    "Drama",
    "Mystery"
  ],
  "description": "Walter Sparrow is an animal control officer that becomes obsessed with a mysterious book that seems to be based on his own life. As soon as he opens the book, he notices strange parallels between what he reads and what he's experienced. But now he's worried that a fictional murder might materialize.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mlNU8a1SkTu6cKA4LAoZxfNPng0.jpg",
  "categories": {
    "plot": 7.043478260869565,
    "acting": 5.7272727272727275,
    "ending": 7.333333333333333,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 5.75,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The number 23 is an AMAZING movie, with one hell of a plot twist! Jim carry really shows us what kind of actor he is. He is a man with alot of faces, and boy do you see it in this movie.\r The movie is an almost never ending exciment, the only thing that I thing is a bit dull, is probably the start. But thats just my opinion, I wont say any spoilers though.\r The movie plot isnt a plot where you have to guess what \"actually\" happend, it gives it pretty much straight forward. But there is some minor plot points that the movie doesnt explain, which is nice for people who love to speculate!\r 9/10, great movie, great acting, great storytelling!"
    },
    {
      "rating": "8",
      "text": "A great mystery that personally confuses me, because of  the Jim Carrey-acting-in-serious role thing. He is an amazing actor, that immerses himself in his roles,  including this one. The movie is about obsession, which is a disease that people really suffer from, makes them live painfully, confused and frightened. The movie was interesting, tortuous, with plot twist, that will make you give high score to it."
    },
    {
      "rating": "7",
      "text": "Good film. For Jim doing a serious role he does it well. Better than what the media were saying about it. Im actually going to watch it again tonight lol only my second time but its worth another watch"
    },
    {
      "rating": "8",
      "text": "Wow. This is a strange, creepy horror film that steadily ramps up the fear as the plot chugs along. There are a few spots when it's a little tough to keep your disbelief out of the way, but you'll enjoy this film more if you just let go and have fun with it. It made me want to get books about strange math and science phenomena. Also, the cast did well. Jim Carrey's character starts out as a seemingly normal person, whose life gets increasingly caught up in a trap of obsession with the title number. Try to watch this film and not start counting stuff afterwards!  :)"
    },
    {
      "rating": "7",
      "text": "This is a good movie. Despite what the media may think of the plot and Jim Carrey's performance, it is a film that got me hooked the moment it began. Sure, there may be some scenes that fall below others, but as a whole, it is better than many may think."
    },
    {
      "rating": "8",
      "text": "Well, the number 23 is a special to me. It's my birth date and I consider myself, it's a lucky number. This is the number which always pops-out when I wanted to pick a number. During watching team sports I always watch-out for who's wearing a jersey with this number. So the number 23 is everything to me and watched this movie 7 years ago (today, 2014) with high expectations which stood up to my belief. Here I am after a re-watch.\r You know mystery movie are not meant to watch again and again, because you won't get that real twist when you re-watch. That is a big drawback in this particular genre. All we need is to give a good concentration while we watch for the first time and must not miss a single dialogues. But in my case I saw it a long ago,  now I didn't remember much of the movie scene except the storyline. So I had a little advantage over that to view it again and I am glad this movie impressed me in the second time as well.\r You won't see much of Jim Carrey in a serious role. This is one of those where he's out of his league, the comedies. I thought it was a dark comedy, at least it kick started sounding like that way. But after progressing with good story development it turned so ridiculously deep into a main character who was obsessed with the number 23. It began with a simple misunderstanding over a something, but later digs intellectually with more broader expansion towards a parallel story that was written in a red book.\r It is a great movie, which stays true to its genre and makes audience to begin their guessing game soon the red book enters into the frames. It also had a wonderful twist with the meaningful dialogues at the end. It is a must see movie from the perspective of the Jim Carrey's filmography. One of the movies of him to remember his appearance in a divergent character than usual. Hope I gonna see it again after some years from now on and expect to remain same warmth, maintaining everlasting strength from its main plot to deliver me."
    },
    {
      "rating": "1",
      "text": "Micheal Jordan`s number 23, 23 bottles of beer on the wall, 23 problems but a b&%% ain`t one, 10 plus 10 plus 3 equals 23  this is how this ridiculous movie goes! What a pointless movie."
    },
    {
      "rating": "10",
      "text": "A great psychological thriller that is done well with Jim Carrey and all of the critics that has been saying that this movie sucks, they suck."
    },
    {
      "rating": "6",
      "text": "I've watched many Movies of Jim Carrey.When he did something different than comedy in Man on the moon ,The Truman Show,Eternal Sunshine of a Spotless Mind,These movies were so great.When i watched the trailer of this movie. My expectations got high.After watching the movie i was disappointed.Clearly it is a psycho-thriller movie with neo-noir style.I quite liked the visual elements and Jim Carrey did a good job.Despite of the good concept.The movie is not that good.It has a promising start but when Walter starts to read book,slowly slowly everything goes wrong and somewhat boring.It's plot is too thin and movie is unimpressive in many parts.Cheesy dialogues bring it down and movie is never that creepy the way it should be.Overall, it delivers a rambling, confusing narrative with only a few stylistic elements thrown in.it could have been much much better as for JIm CarreyBut i liked it in parts."
    },
    {
      "rating": "6",
      "text": "Jim Carrey's performance was amazing, reminding us once more that he's not all funny faces and slapstick humor. Unfortunately for him the movie could be better. It's kind of well done from a stylistic point of view I guess? I'm not savvy about technicalities, but other than a slight inconsistency between the noir not-so-side story and the main plot which may very well be intentional/alternative, it wasn't bad. The idea was good too, I guess I can kind of relate to the numbers obsession in a way due to some sort of slight OCD I have when it gets to numbers and stuff. But yeah, the plot was kinda forced and had very weak points and minor nonsense."
    },
    {
      "rating": "3",
      "text": "23. 23. 23. 23! 23! 23! 23! TWENTY THREE! seflignogjaspibaoba bdglasdgdgadgadga...............................\r The director of Batman and Robin strikes again. To Schumacher's credit, he has made a few good films. Phone Booth is a good film. The Lost Boys. The Phantom of the Opera........ Kind of.\r This film just isn't good. I don't know who green lit this. All I know is they should be fired. This script really is one of the worst things I have had to sit through, and it was a shame. The performances tried and tried to give something interesting, but when nearly every line leaves me sighing or just plain laughing out loud. Something is not right.\r I liked the idea, but everything that followed was just ridiculous. Stupid, silly twists. And there is only so many times that the characters can say 23.\r The direction was also weird in places. Some scenes just made everything feel awkward- mostly down to the editing.\r Just don't watch it. Just *sigh*."
    },
    {
      "rating": "5",
      "text": "Jim Carrey to play in a psychological thriller??? No sir!! The movie could have been better if the role of Jim Carrey was played by someone else. There are so many actors to play this role and they chose Jim???? NOOOOOOOOO!!!!!"
    },
    {
      "rating": "4",
      "text": "It was difficult to tell if the Number 23 was an intentional joke or no. After the first hour I thought it was intentional spoof of the genre and came off as odd, but mildly interesting on account of the oddness. Then the film appears to become more serious as a mystery / thriller before making a strange turn at the end. If it was some intended cleverness, it was too clever for me, and if not then it was not clever enough."
    },
    {
      "rating": "4",
      "text": "With a middling to bad script in The Number 23, [Schumacher] is lost. This film treads way too close to Lifetime movie territory."
    },
    {
      "rating": "0",
      "text": "Pretentious and laughable. Stay away! Far away...This neo-noir thriller promises a lot and fails misserably.The worst part? The obsession of the main character with the number 23 is completely random and never explained. Those frisky scenes sex scenes are cringe worthy.Lots of scenes in this film are obvious filler time."
    },
    {
      "rating": "6",
      "text": "We know that the so-called \"conspiracy theories\" have become popular. To their fans, there is virtually no detail of our everyday life that isn't likely to be associated with any weird conspiracy. In this case, the film associates this idea with numerical obsessions and the search for patterns and relations between totally distinct occurrences. The concept explores the surreal, and is quite original, in that it's uncommon in thrillers (at least, I don't remember any thriller with this recipe before).The screenplay tells how Walter, a perfectly ordinary man, begins to feel threatened and chased by a number after reading a disturbing book. He seeks, and finds, these number attached to different facts and situations, and we begin to question ourselves about his sanity. The film starts well: the initial credits, graphically elegant, were an original way of introducing the theme to the audience and giving it some credibility. I also liked the way Walter is introduced, and how the film emphasized his normality. He's just a guy just like any other, with values and integrity, trying to get his life, who ends up getting caught up in an obsessive whirlwind. His transformation is evident and, at that moment, we're already attached to him because we gain some sympathy for Walter, and our curiosity is fed by every discovery.However, certain things become too predictable... for example, it's clear from the outset that Fingerling will be a negative alter-ego of Walter. Predictability should have been avoided and corrected, but it's still a minor problem... the biggest problem is the end, which leaves the guiding line too long and ends up having a disappointing and anticlimactic result. A more built and less conventional ending would have made this movie exceptional. At that point, it was a missed opportunity.I have nothing to say about Joel Schumacher's direction. He's far from being a very good director but has succeeded here. On the other hand, I have a lot to talk about Jim Carrey. I am increasingly convinced that this actor has been underestimated. He became popular thanks to comedies and got very attached to them in our head, so we were surprised when we realized that he can also be a great dramatic actor. But let's be honest: it wasn't his first dramatic film, on the contrary. He seems to be making an effort to show us versatility, and it's up to us to realize that. He was very good here, made a solid and well made work... and I believe I realized, I can see better the potential of this actor. Harder to swallow were the sex scenes. In fact, I felt that, sometimes, they were left in the film. But it's alright. Virginia Madsen also did a good job here, as a dedicated wife and companion or a fiery Italian, with somewhat nymphomaniac outlines (the two actors played two characters, ego and alter ego).Technically, the film has some brilliant moments. Cinematography begins with warm tones but suffers a violent concussion with Fingerling, carrying itself of cold tones, light-dark, emptiness and shades. From then on, as the obsession progresses, everything becomes colder. I also noticed some excellent camera shots, including the intelligent use of reflexes.This movie is one of those that can get us mad... it had everything to be very good. An original idea, excellent actors, an able director and good production values. The script started well and was convincingly developed... but when they should have put the cherry on the top, everything collapsed like a house of cards. Frustrating."
    },
    {
      "rating": "7",
      "text": "Obsession is a disease, a dark fleeting sensation that can drive one person to do things that they normally would not do, driving the individual to the brink of insanity that can destroy the personâ"
    }
  ]
}