{"id": 3884, "title": "The Santa Clause 3: The Escape Clause", "starring": ["Tim Allen", "Elizabeth Mitchell"], "runtime": 91, "genre": ["Comedy", "Family", "Adventure"], "description": "Now that Santa and Mrs. Claus have the North Pole running smoothly, the Counsel of Legendary Figures has called an emergency meeting on Christmas Eve! The evil Jack Frost has been making trouble, looking to take over the holiday! So he launches a plan to sabotage the toy factory and compel Scott to invoke the little-known Escape Clause and wish he'd never become Santa.", "releaseYear": "2006", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/2aGtjBH3birXp5KvZgwr1fLZXsi.jpg", "categories": {"plot": 5.666666666666667, "acting": 4.75, "ending": 2.5, "soundtrack": 4.5, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 4.857142857142857, "action": 5.0}, "reviews": [{"rating": "10", "text": "Love this holiday film, one of the best holiday movies ever made! There is so much laugh-out-load moments for all the family with such a lovely cast, an amazing story line and a warming family movie!"}, {"rating": "4", "text": "Shining's over, mates. It tried to jump over the shark, but the shark managed to kill it and then completely swallow it afterwards. Tim Allen, the Santa Clause days are now over for you."}, {"rating": "3", "text": "Thank god for Martin Short, as he is the only saving grace in this sinking film franchise. But even he can't save the ship, because it has too many holes that can never be filled up, even if the movie tries to pile on more and more gags and slapstick humor."}, {"rating": "4", "text": "I supposed it couldn't hold on forever. While \"The Santa Clause\" was pretty good, and \"The Santa Clause 2\" was not bad, \"The Santa Clause 3: The Escape Clause\" is legitimately bad (4 out of 10 is not \"mixed\" in my book, 4 out of 10 is \"bad.\" Just saying). The effort in making something new and interesting just isn't there, and it feels like the movie was made to make more money. It's a boring retread of previous films, only really featuring Jack Frost as a way of making the film feel slightly more interesting (again, slightly). The only reason I can't go much lower than a 4 is because it's perfect for young children. Otherwise, you should probably steer clear of it and search out better Christmas films. It's not the absolute worst-thing you'll see, but it's definitely not good, and there are definitely far better Holiday options than this film."}, {"rating": "3", "text": "Now comes the sequel to The Santa Clause 3 , and a conflict between Santa Claus and Jack Frost, but to top it an absurd and meaningless script and a decorated classics that are not very safe resaltables Yde could ruin a child 's childhood in a christmas, jolly incomfortable."}, {"rating": "3", "text": "This movie  is so boring and dumb that to me, I wouldn't even recommend to people who celebrate Christmas. I haven't seen the other films, but I probably wont because there probably just as bad as this film that doesn't feel like a film."}, {"rating": "4", "text": "The Santa Clause 3: The Escape Clause is nowhere near the epic conclusion to The Santa Clause trilogy that these three films deserve. It's tedious to watch, and a lot of the jokes have aged really poorly. Still, Tim Allen and Martin Short help make this movie watchable around Christmas time, at the very least."}, {"rating": "8", "text": "The second best Santa Claus movie. The acting was great, as always. The story is a clasic, unlike the second. It had great visuls also, the first in the series I can say that for (maybe the first too). The story was better than I thought, the villain was excellent. It is better than reviewers say."}, {"rating": "2", "text": "REALLY BADDespite a good performance from Tim Allen, The Escape Clause utterly fails with cringeworthy jokes, a highly annoying performance from Martin Short as Jack Frost, and a very poorly written script to make this a big pile of coal."}, {"rating": "8", "text": "Not too bad. There's a few funny parts, and a few others that tug at your heartstrings at least a little. The really good news is this: Martin Short does a great Jack Frost, and the movie is a lot better than the second one (although not as good as the first)."}, {"rating": "9", "text": "If you enjoyed the original you will enjoy this one as well. Better then the 2nd but not quite as good as the first."}, {"rating": "3", "text": "I hope the next movie will be Santa Clause- The Death Clause. Totally awful movie. The acting, the story, and the directing were sub par. I dont recommend you waste your time or money on this movie."}, {"rating": "0", "text": "Total CRAP!! After seeing this movie, I have lost all respect for Tim Allen and Martin Short. The only way you'd possibly like this movie is if you were 3 years old. Terrible acting! I can't believe I wasted 6 bucks on it! CRAP!"}, {"rating": "0", "text": "Snore Me a River!!! Santa....zZZZZZ...oops i fell asleep saying the title. Put it this way, if you have been cramming for Midterms, go here and it'll let you catch up on sleep."}, {"rating": "7", "text": "Better than the second one but not as good as the first. Tim Allen's acting is getting worse and worse as he ages and Martin Short is as good as ever in a character he was born to play. But the real star of this movie is Judge Reinhold's shirt. The shirt alone gets 5 points, one point goes to Short and the other point goes to Kevin Pollack who shows up shirtless as Cupid. Allen, take some acting lessons!"}, {"rating": "0", "text": "This movie was bad from all angles. 1. the story really never started until the last 30 minutes. 2. the musical score was not even christmas style music and they only used one christmas song that I can remember in the soundtrack. 3. There was no Scott Calvin sarcasm. This whole movie was slapstick. Not what we fell in love with in the first movie. 4. There was no reason for Mrs. Clause to be pregnant. There was no reason for Scott Calvin to bring his exwife and her husband to the north pole. they were useless characters and not apart of the story. And worst of all the #1 elf was so annoying with his lisp that I wanted to punch him. The should have paid the money it cost to bring Bernard back for the role. Do not waste your money. Not even at matinee prices. The story was written so poorly that I was angry when I left and not in the christmas spirit. Not one thing made me laugh. I laughed so hard in the first one."}, {"rating": "9", "text": "I think the SC3 was very good, ok not quite as good as the first 2 but still better than I was expecting... I think Jack S. needs to get into the Christmas spirit and not judge a move by the soundtrack or a speech problem a character has!"}, {"rating": "0", "text": "Lame, boring and Martin Short deserves a Razzie for worst irritating actor."}, {"rating": "10", "text": "This was the best of the trilogy. I will see it again. You will get in the holiday mood."}, {"rating": "10", "text": "I just saw the movie and now I am going to watch the first two films again. I think this carries on the spirit well."}, {"rating": "4", "text": "Personally, the whole Santa Claus thing with Scott Calvin has overstayed its welcome. Okay, the idea of Short as Jack Frost is cute, but ultimately is pretty lame."}, {"rating": "2", "text": "It's Christmas season so obviously, Tim Allen has to milk the holiday for all that it's worth by putting out another lame, derivative, pointless movie."}, {"rating": "6", "text": "Forget the horrible ratings, this is a great cheesy  movie to get you Christmas spirit on! I honestly don't understand why this film is receiving so much crap! Also, Martin Short does a really good Santa!"}, {"rating": "6", "text": "While this movie is nowhere near as good as the first two, The Santa Clause 3 is a decent movie to watch around the Christmas season. The story is that Mrs. Claus and Santa Claus are having a baby and must prepare for it while Jack Frost is causing mischief and havoc for the hopes of taking Santa's coat and become the new Santa. All the while, Mrs. Clause's parents are coming to visit her and Santa must try and keep the identity of the North Pole a secret from them.To be honest, while Tim Allen is certainly not giving his A-game here, I thought he did fine as Santa. Maybe because his overall appearance as Santa is very convincing but I thought Tim Allen didn't do that bad and did a decent job. There are some scenes where he's clearly phoning it in but it kind of adds to his charm, at least to me. Martin Short as Jack Frost is probably the best thing in this movie. He's so slimy and hammy that you basically can't help but smile or laugh when he shows up. He's probably the most lively thing in this entire movie.The overall makeup and set design is pretty good. The makeup on most of the characters look good, Tim Allen as Santa looks great (one of the better renditions of Santa in terms of looks and appearance in my book), Jack Frost looks good and the North Pole as a whole looks really neat. The movie looks pretty good in general and the shots of the North Pole look pretty nice.However, the problem with this movie is that outside of Martin Short, most people didn't seem to care about what they were doing and everyone at some point decided to just phone it in and you can tell with the overall writing. Most of the jokes aren't funny and the story is either non-existent, inconsistent or very dull. The actors don't seem to help much either. Martin Short is the most lively and energetic character/thing in this entire movie and Tim Allen does try in some scenes, in particular during the 3rd act, but actors like Spencer Breslin and Alan Arkin just didn't seem to care at all. Breslin in particular just sounds so incredibly bored and forced that every time he shows up it's so cringe inducing.The movie not as good as the other two but as a movie to watch around the Christmas time, I think it's a decent watch. Martin Short as Jack Frost will keep your attention and the overall look of the movie is pretty nice. It's a decent movie and pass-time during the holidays."}, {"rating": "8", "text": "The Santa Clause 3: The Escape Clause is overall an enjoyable film but isn't quite as memorable as the first two. The premise of this movie is a little far fetched causing the movie to get weird at times. Charlie was one of my favourite characters from the first two, and unfortunately he's barely in this third instalment. I'd still recommend watching it after seeing the first two however as it is still enjoyable."}, {"rating": "0", "text": "Totally awful movie. The acting, the story, and the directing were sub par. I do not recommend you waste your time or money on this movie. So you had better be off seeing the first two movies instead."}, {"rating": "5", "text": "Aunque tiene momentos conmovedores y buenas intenciones, no logra ser un buen final para la saga."}, {"rating": "6", "text": "This one was ok, better then the second one at least. Jack frost comes in as the villain and comes up with a plan to become Santa Clause."}, {"rating": "5", "text": "Martin Short is a fun addition to the North Pole, but everything else is recycled from the previous entries."}, {"rating": "2", "text": "*clears throat**sings...*It's not ok, ok, it's unwelcome,the worst thing that you'll ever see!Well anyway, anyway, it's unwelcome,like Charlie Brown's crumbling Christmas tree!All kidding aside, this movie was a monumentally unwelcome end to an originally promising series.  To be honest, it never even should have continued to become a series, for the sad, coal-filled stocking of a second installment completely discarded everything that made the first one so charming.  Filming a third was just adding insult to injury, and it was clear that the actors were just doing it for a paycheck at this point.  The comedy was juvenile at best, and overused at worst; the flatulent animatronics were just plain atrocious, and the ex-wife and in-laws were flat pieces of cardboard, fully equipped with unfunny and clearly-trying-too-hard humor.  The reel of bloopers during the end credits was the funniest thing about this shoddy, underdeveloped piece of reindeer dung; it might be worth it to turn it on, skip through the entire movie, and just watch the end segments for some real laughs.  Scott Calvin/Santa Clause was reduced to a bumbling idiot who couldn't see what was happening right before his very eyes, and his wife?  Well...  All she did was sulk, and genuinely suck.  The elves sounded like a bunch of kindergarteners, and lost all of the charm and humor that they had in the first film.  The acting was cringe-worthy and painful to watch, especially the final scenes which come together (in my mind, at least) to create one of the WORST movie conclusions ever.  In simpler terms, leave it IN the past, but OUT of the history books.  The only thing that was (seldom) entertaining about this hunk of crusty fruitcake was Martin Short's performance as Jack Frost.  (Way to go, Short.)  His antics were moderately enjoyable, and the character's narcissistic tendencies were cringe-worthy, sure, but still chuckle-inducing.  My advice, just watch the parts where he comes in and screws up everything that the other actors and producers tried so little to create.  In conclusion, trudging through a blizzard with nothing on besides your undergarments would be more fun than watching this movie from beginning to end (without taking my advice).  So, if you decide to ignore all this and put the thing on for family movie night: kids, don't bother buckling up, for this is the slowest, dumbest, and saddest ride you'll ever experience.  Teens, don't bother watching it.  Just don't.  And adults, don't forget to grab your sleeping mask and some earplugs.  So, sit back, relax, and enjoy falling asleep to the worst Christmas movie you'll never bother watching."}], "recommendations": ["little_fockers", "son_of_the_mask", "night_at_the_museum_battle_of_the_smithsonian", "alvin_and_the_chipmunks_the_squeakquel", "kangaroo_jack", "night_at_the_museum", "the_hangover_part_iii", "horrible_bosses_2", "night_at_the_museum_secret_of_the_tomb", "christmas_with_the_kranks", "one_year_one_night", "dumb_and_dumber_to", "venom_let_there_be_carnage", "the_babysitter_killer_queen", "diary_of_a_wimpy_kid_the_long_haul", "garfield_a_tail_of_two_kitties", "ghostbusters_ii", "thunder_force", "hubie_halloween", "the_bounty_hunter", "the_hangover_part_ii", "second_act", "diary_of_a_wimpy_kid_dog_days", "goosebumps_2_haunted_halloween", "30_minutes_or_less"]}