{"id": 3869, "title": "The Dreamers", "starring": ["Michael Pitt", "Eva Green"], "runtime": 112, "genre": ["Drama", "Romance"], "description": "When Isabelle and Theo invite Matthew to stay with them, what begins as a casual friendship ripens into a sensual voyage of discovery and desire in which nothing is off limits and everything is possible.", "releaseYear": "2003", "mpaaRating": "NC-17", "imageUrl": "https://image.tmdb.org/t/p/w500/gBb7GGaFYPu7nEUYvC8G4LaJJN1.jpg", "categories": {"plot": 6.7, "acting": 6.888888888888889, "ending": 7.0, "soundtrack": 10.0, "cinematography": 7.5, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "9", "text": "Desperation. Emptiness. Idealism. Naivity.\r \"The Dreamers\" reflects the lives of those middle class adolescents in the late '60s who felt the need to revolt against the mainstream without really understanding what they were revolting against and what they wanted instead. \"The Dreamers\" reflects the disconnect between a generation of adolescents lost in bourgeois society, longing to get out but not knowing how.\r Our main character is your generic intellectual who's living among people of a different culture and finds some people he connects with. He's dragged along a roller-coaster of sexual tension and alienation and enjoys every little bit of it, but in the end he realizes he's been living in a dream, he wakes up and moves on.\r The symbolism is deep. The emotions are deep. I've rarely been this impressed by a movie, so all I can say is this : watch it with an open mind and let yourself go...."}, {"rating": "9", "text": "\"The Dreamers\" is all about three young adult upscale hippy types who languish in a flat in Paris in the late 60's and talk about cinema, politics, sex, and other stuff while sharing some first experiences. Two are brother (Garrel) and sister (Green) identical twins (or so we're told) who have an almost metaphysical bond and the third is an interloper (Pitt) who falls in lust with the sister. There's little plot to this slice of young adult life flick which seems to be more of a Bertolucci pet project than a commercial product for the masses. Less than engaging and much less than compelling, \"The Dreamers\" immerses itself in the esoterics of the place and time to the exclusion of anyone who wasn't there then. Beautifully filmed and masterfully crafted with some young actors doing superb work under difficult circumstances with plenty of graphic nudity and sex, \"The Dreamers\" will play best with aficionados of French cinema, Bertolucci fans, etc. Those who are squeamish about sex/nudity should pass. All others, be prepared for a marginally interesting watch."}, {"rating": "8", "text": "THE DREAMERS (3 outta 5 stars) Interesting project by the renowned director Bernardo Bertolucci... dealing with the events of 1968 in France... a time of great social upheaval, as rioting students took to the streets to shut down the French government. The main characters are a young American student who has come to France to study film... and a very unconventional brother and sister who recruit him to their offbeat lifestyle. All three are obsessed by film (as many young people were in 1968... the glory days of the avantgarde)... and also with the concept of breaking rules and societal taboos. With their parents away for the month and the flat to themselves, bets are made on film trivia and the penalties for not identifying a particular moment from a particular film become more and more shocking. Only leaving their home to watch films, the trio are basically oblivious to the growing trouble in the streets... until finally they can sit passively no more. Very intriguing concept and the acting is fine... but ultimately I thought the conclusion fell a little flat... the transition from sexual hedonism to political activism didn't really work for me... it all seemed a little abrupt and could have been explored a little deeper. Worth watching and discussing though."}, {"rating": "0", "text": "So disgusting and gross. I mean, I couldn't find a single idea this movies stands for. So far from the communist rebellion, all the characters could care about is their sexual discovery. What sens does all of this make ?  Two hours of nonsense and disturbing sexual scenes."}, {"rating": "1", "text": "Un jeune Américain à Paris pendant mai 68 qui rencontre un couple de siamois (un frère et sa soeur) au bord de l'inceste. Putain.Férus de cinéma intello-ringard, ces **** bourgeois feraient bien la révolution eux aussi -parce que cela semble amusant- en criant \"mort aux fachos\", mais se comportent en vérité comme des ados attardés qui jouent à touche-pipi en citant des répliques de vieux films.Forcément érotique, car Eva Green est de la partie (fine) et paie et trimbale ses lourds attributs... malheureusement, cela n'a rien de particulièrement joli ni émoustillant puisque la vulgarité est tutoyée d'un peu trop près à de nombreuses reprises.Le seul intérêt potentiel étant tombé dans le caniveau, nous sommes fort dépités devant cet étalage d'imbécillités estudiantines (de gauche très vraisemblablement) aussi peu engageant que futile."}, {"rating": "10", "text": "very french very romantic very classic very modern."}, {"rating": "10", "text": "A great movie with acting, scenes and music you'll never forget."}, {"rating": "8", "text": "This movie is just beautiful, and it shines bright with all the colors and attractive Paris backdrop. Not much goes on, in terms of story other than sex and lots of nudity, but viewers can forget about that, since the movie is mesmerizingly shot an masterfully directed."}, {"rating": "3", "text": "Not a fan at all of this alternative types of movies. It has no point, and it's too much for my stomach."}, {"rating": "5", "text": "After watching this movie I got the feeling that the strongest point of it is the participation of Eva Green, in her first movie by coincidence. The whole story is about three young students who are in Paris: two are French and are brothers, the third is an American and is doing an exchange to learn the country's language. Chemistry between them is intensified by their interest by cinema. From then on, the film beggins a series of debates (a little insipid to normal public but curious to the experts and movie-goers) about cinema, with cameos and tributes to several films and actors. Here, sometimes, its necessary to know cinema and to have some cinematic culture in order to follow everything. Then, as the events of May '68 take place, the three are getting more and more intimately involved. Sex is a structural part of the story from the beginning, its introduced very well by the sensuality and eroticism of Eva Green and isn't ugly or sinful, as in many films usually ends up becoming. However, full nudity scenes are many, can hurt sensibilities of more modest audiences and advise discretion before watch the movie.This film is about revolutions, hopes, yearnings, dreams, sex and cinema. Everything is mixed, everything is a vehicle for dreaming, for the estrangement of reality. But if it weren't for the absolutely fantastic performance of Eva Green, seductive, strong and mysterious, the film would not have half the interest or quality it has."}, {"rating": "7", "text": "THE GOOD: Eva Green's hypnotic presence on camera elevates The Dreamers. I found the story truly interesting, with complex characters and themes. Some great shot compositions and dialogues.THE BAD: Despite showing glimpses of brilliance, the film as a whole resulted messy for me.  Also the acting and dialogue are a bit clumsy at times. The ending, though poetic, didn't feel totally right for me."}, {"rating": "3", "text": "Such a boring movie. I don't see how for someone it is considered a, masterpiece!"}], "recommendations": ["crazy_rich_asians", "20th_century_women", "elle", "unforgettable", "trainspotting", "secretary", "cashback", "shame", "stoker", "swallow", "call_me_by_your_name", "ingrid_goes_west", "moonrise_kingdom", "melancholia", "the_florida_project", "the_witches_of_eastwick", "nomadland", "antichrist", "incendies", "captain_fantastic", "titane", "disobedience", "closer", "thoroughbreds", "freedom_writers"]}