{"id": 4509, "title": "The Good Shepherd", "starring": ["Matt Damon", "Angelina Jolie"], "runtime": 167, "genre": ["Drama", "Thriller", "History"], "description": "Edward Wilson, the only witness to his father's suicide and member of the Skull and Bones Society while a student at Yale, is a morally upright young man who values honor and discretion, qualities that help him to be recruited for a career in the newly founded OSS. His dedication to his work does not come without a price though, leading him to sacrifice his ideals and eventually his family.", "releaseYear": "2006", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/ruyJwuDdxFJB0Tvumm1DKPRlC2p.jpg", "categories": {"plot": 6.131578947368421, "acting": 6.194444444444445, "ending": 5.666666666666667, "soundtrack": 6.0, "cinematography": 10.0, "familyFriendly": 3.0, "funny": 4.0, "action": 9.0}, "reviews": [{"rating": "10", "text": "The Good Shepherd is very much a difficult film to understand. At first glance, it is over 2 and a half hours of boring, sluggish history tracing the early history of counterintelligence within the CIA. But upon second glance, the film emerges as something quite different. Is it at all entertaining? No. Is it at all thrilling? For brief moments. But all in all, the film is not meant to be entertaining or thrilling. It is meant to be what film once thrived to be: pure art. It becomes difficult when first seeing this film to see the artistic majesty because most of us have become accustomed to watching a monkey throw **** on a wall and then calling that art. The Good Shepherd becomes like the Mona Lisa, but we must first remember that the Mona Lisa is art and **** on a wall is just **** on a wall. Then we see that this film is perfect because it is art, a true artistic piece of cinema."}, {"rating": "9", "text": "Thought-provoking, intense movie with Matt Damon's performance deserving of an oscar. The complexity of the character and the moral implications of the story deserves this high rating."}, {"rating": "4", "text": "The Good Shepherd certainly isn"}, {"rating": "4", "text": "A film about how the CIA was formed out of dodgy dealings and shadey characters with vested interests. Tell us something we don't know. This film was a pancake disguised as a fancy crepe, with Jolie as the chocolate sauce that covered the banana that is Damon. DeNiro added one too many eggs into this mixture. He must of thought that by adding a bit of cheddar he would give it a savoury flavour, but instead we were exposed to too many cheesy moments. Too many cooks spoilt the pancake. (I fell asleep at one point, I might have missed the best bit)."}, {"rating": "9", "text": "Don't understand why so many people and critics didn't get into this. It does demand a certain intellectual curiosity and understanding of history, but outside of that I didn't think it was slow or uninteresting at all. I was impressed with everything about it."}, {"rating": "0", "text": "To a teenager, this would be (and it is) an extremely boring movie. The movie focuses on one thing: a man and his boring life as a CIA operative. Although, it is intended for older audiences, but it doesn't please the action-movie goers who look for spy shootouts, automatic pick-ups of beautiful women, and, of course, a diabolical villain. Not a good choice to buy or rent. I made this mistake."}, {"rating": "10", "text": "This is an exceptional motion picture that might be lost on the majority of today's movie audience unfortunately. An intriguing story and a fascinating historical background, filmed with beautiful camera work and a great musical score. Some great performances from the cast make this one of the best films of the year. I'm actually surprised by its lukewarm critical reception; critics are often accused of being out touch with the general audience, but this time, it seems as if The Good Shepherd was even too sophisticated for them."}, {"rating": "10", "text": "Intriging, suspensful through out, For those who did not like it perhaps they did not want to think. Matt Damon was teriffic."}, {"rating": "10", "text": "The fall from heaven to earth is only a decision away; a decision of allegence. DeNiro reveals that humanity has fallen from truth into delusion, honor into shame, from passion into a plastic-existence. As much as we find it easier to create a dichotomy for humanity of light and darkness, DeNiro reveals in this great film that we live in murkier, more confusing waters than that. Those representing a nation's belief in its goodness appear plastic, emtionless, secretive while the darkness of the \"bad guys\" lurks beneath. This movie leaves us asking, \"Is allegence to a nation a high and noble trait, or is there just as much darkness as in the clandestine world that challenges that nation's values?\" Is it noble to sacrifice passion, truth and life for any cause other than love in its purest expression? This film leaves the viewer with the belief that genuine love cannot coexist with allegence to anything or anyone that stands in contrast and contradiction to that love. Damon perfectly plays the role of the passionless man who no longer knows how to live, as Jolie represents the challenge to such a life. Yes, it is long and plodding, but so is the fall into utter delusion. \"First there is country, then God.\""}, {"rating": "3", "text": "Very slow moving, confusing. While it has an impressive list of stars they are all rather wooden in their performances especially Damon whom I like a lot but not in this pic. He wanders through this film as a morose character wearing a felt hat and rain coat carrying a briefcase that looks almost too heavy. De Niro and Joe Pesce don't comprise 10 minutes of screen time. All in all, way too long. The only word that comes to mind to accurately describe this film is tedious."}, {"rating": "7", "text": "Complicated and intriguing, somewhat plodding but entertaining. Matt Damon could have had a little bit more personality, he was directed to be too flat, he appears to have a personality disorder."}, {"rating": "0", "text": "Honestly, I've never seen so many people walk out of a movie. What a waste of a wonderful cast. Once again, I was fooled by the critics. They got my hard earned cash. I can save you all 3 hours of your life. Here's the entire film in 3 words. Trust no one. Go watch Departed or 007 for the second time instead."}, {"rating": "8", "text": "You really get a great sense of unease and mistrust that surrounds the lives of modern day spies. It's a long movie, but it needed to be long to give us the depth that is required of this film. Matt Damon is truly excellent in this film despite looking too young to be an older man. He plays the laconic yet deep thinking protagonist perfectly. You truly get a sense of how these men utterly give up their lives to serve their country without ever being able to confide or reveal their true selves to anyone and without ever expecting any kind of recognition for their sacrafice nor influence on our lives."}, {"rating": "2", "text": "As the movie got started and was immediately bad, I sat there thinking, what an odd story for Robert DeNiro, a man of limited intellect and scope, to direct. And the script is terrible. You can tell a lot of money was spent on the technical aspects and storyboarding and all, but it is corny, inhuman and nearly all the performances are poor. It's frightening to hear Damon sing the praises of DeNiro's direction in interviews and think he'll continue this approach in the future; because it nearly obliterated his talent. As a sidenote, having thought DeNiro's acting itself was of such poor quality these last years because he was phoning it in, it was stunning to learn that, even in a project you knew he would want to come off well, his acting is now bad."}, {"rating": "0", "text": "This movie was boring, tedious, confusing, and slow. There, I said it. It's no thriller, and the drama is forced. The directing is horrible (2 words surrounded by 30 second pad of silence is not a dialog). The writing was painful. Instead of give us meaningful dialog, whenever there's a sex scene (roughly 4 or 5 I think) It always goes like this: him: stone faced her: \"Do you want (stay/get a room)?\" him: \"Do you want me to?\" her: \"very much so\" and then a brief sex scene. I don't mean to offend anyone, but this movie is for old people. The pace is slow, there is very little visual distraction or movement. It's based in the 40's and 60's, and did portray a lot of the \"good ol days\" when America was young and strong. After the movie was over, I looked through the theater and everyone was over 60 -- except me, at 26. Unless you're retired, think twice about watching this movie."}, {"rating": "7", "text": "It was alright. A little slow at the beginning and a bit confusing too but the pace picks up. Damon's performance was strong and the rest of the cast as well. Was great to see Joe Pesci again!"}, {"rating": "9", "text": "Everyone that gave this movie below a 5 is a complete moron. This movie is not for 13 year olds wanting to see Terminator. If you have the patience to appreciate some great acting, notably on Damon's part, then you will love it. Moreover, its the subtleties of the movie that make it great, not Americans blowing shit up left and right and saving the world from evil. Shows you how stupid people are."}, {"rating": "6", "text": "I don't think this is a bad film or, as some viewers have said, a mess. It just lacks the artistry and depth of the films it is aspiring to, such as The Godfather II. Ultimately, poor character development and De Niro's inability to change pace and provide tension at key moments left me feeling that although it was watchable, in the hands of a more capable director it might have been memorable."}, {"rating": "9", "text": "It is slow but never boring. I don't really get why it wasn't better liked. I have a feeling, too, that if you dig into it you'll find a lot of irony and no clear answers. (Which is a good thing, or, in this case it is.) About the only fault I can think of is, perhaps, in one scene with Ulysses, the music kicks up a bit too loud and there's a sense of too much 'drama' schmaltzed on to the scene, as if the director wasn't sure the point would come across without the music. But it's a small thing. Overall I found it absorbing from the get go."}, {"rating": "3", "text": "This was a terrible movie!! I have no clue what happened. I watch movies all the time and I can honestly say that this is only the second film that I found impossible to follow. The first was a David Lynch film! Dinero should stick to acting. If anyone can PLEASE tell me anything about what happened in this movie, I'd appreciate it."}, {"rating": "8", "text": "I would call it a great movie with espionage and political flavor. Dull and long as it may seem, it realistically portrays the early history of CIA through the eyes of main character. \"We've got the United States. The rest of you are just visitors\", \"The Agency comes first, God second\" - the film features many brilliant taglines and outstanding cast. However, Matt Damon looks too young both for the position of CIA director and for the role of father."}, {"rating": "4", "text": "This was a poor film and not worth the time and effort of following it (and before anyone says anything about my taste in films, my 2 favorites in the past year have been \"Zodiac\" and \"Inland Empire\"). It is beautifully shot, but it has no discernable plot; though it's oriented around a what-if concerning a CIA leak and the Bay of Pigs, most of the 3 hours is spent in tangents away from this storyline, to the point that you forget about it until you're reminded again. These tangents (the old college flame, is the defector who he says he is, Pesci's character) are presented as subplots, but they're all so abbreviated that none of them goes anywhere. A film like this can work if the characters are compelling; however, other than Damon, everyone in the film is on-screen so briefly that they feel like stick figures rather than human beings. And Damon, whom I usually like, plays his role with such emotional restraint that it's not clear that the events of the film have any effect on him. Insofar as the movie lacks a clear plot and fleshed-out characters, and that it asks you to identify with a protagonist who's both unlikable and improbably inhuman, it just doesn't work."}, {"rating": "5", "text": "Not nearly as good as some think it is and certainly not as bad as others see it, \"The Good Shepherd\" plods along at a snail-like pace as it jumps from one plot line to another."}, {"rating": "2", "text": "ZZZZZZ.... Sorry fell asleep just thinking about the boring movie. I just rented the DVD good thing they trimmed off the extra 16 minutes of yet another subplot or I would have wasted over 3 hours of my life. Angelina"}, {"rating": "9", "text": "I only just saw The Good Shepherd, some weeks after its release here in France. I thought it was excellent. Was anyone else struck by the importance of father/son relationships in the film? I agree that Matt Damon doesn't look old enough to be a father (at his son's wedding, for example), and that his character is emotionally cold and totally unfatherly. But so many relationships in the film were based on this theme, or on the theme of abandonment by the father. Maybe I'm just projecting my own issues, but I found the film all the richer for this."}, {"rating": "3", "text": "A movie tracing the early origins and eventual development of what we now know as the CIA, with performances by Robert DeNiro, Matt Damon, Angelina Jolie, William Hurt, and Alec Baldwin--including bit parts by Timothy Dalton and Joe Pesci--certainly appears to have the elements of a very promising and intriguing film that couldn't possibly miss. Yet, that's precisely what happens here. Muddled dialogue in scene after scene, baffling story structure, one serious case of miscasting (Eddie Redmayne as the main character's son), unreadable graphics, and film editing that must have been phoned in all combine for a major disappointment. Strangely, after I viewed it, I couldn't help thinking of Ted Williams, who many believe to be the greatest hitter of all time, yet he was a surprising flop as a manager. Could it be that DeNiro, who many consider our finest living actor, is doomed to the same fate when it comes to directing? Hey, Bobby, give Scorsese a call."}, {"rating": "9", "text": "This film -- which I watched again last night for a second time -- is clearly not your typical spy thriller movie that many reviewers seem to have expected. It's too bad that more people don't have patience for careful filmmaking, thoughful exposition, great acting, and extraordinary ambiguity. This is the genius of the story and how DeNiro realized it. What many seem to complain about -- it is slow, it is enigmatic, it is confusing, it is even dull -- is true, in the same sense that reading LeCarre is slow, enigmatic, confusing, and even dull. But let that not detract from a powerful evocation -- a much truer evocation than most \"spy\" movies -- of what espionage is all about, and the true human emotions that must be faced and overcome (or not) by a protagonist in Wilson (Damon's) position. This is a psychological thriller of great magnitude that probably suffered by being marketed as a spy movie. Painstakingly made, detailed, and very true to the human experience if not the Bond one. I like Bond, and Bourne, but for gut-wrenching truth, give me more movies like this. A tour de force. Damon is terrific, Angelina Jolie perfectly cast as either the jilted spouse or the conniving college girl ensuring her future by entrapping a promising husband. She's both. It's an enigma -- the movie is an enigma, and life is an enigma. Nothing is what it seems to anyone at the time -- and this is perfectly conveyed throughout this excellent movie."}, {"rating": "8", "text": "A very good movie if you're in the right mood for it (cerebral, patient). Hard to follow, but that's part of the charm (and it's not a mess like Syriana). The bulk of it will be comprehensible in one viewing, but it took a second time for me to catch some of the stuff."}, {"rating": "6", "text": "It creates the illusion and setting and atmosphere of a thriller--but there aren't any thrills. Other than the history of Matt Damon's career in the CIA and of his marriage, the only thiller plot line involves trying to decrypt a piece of intelligence, which can be figured out by the end and is only of minor interest."}, {"rating": "1", "text": "Slow, boring. No action, very little suspense or intrigue. If you've seen the trailer, you've seen every interesting moment in the movie. Can sum up the story line in a sentence or two: Anyone who works for the CIA is evil/corrupt, or becomes evil/corrupt eventually if they work there long enough. That's what happens when you are overly patriotic, so beware of patriotism!"}, {"rating": "3", "text": "So over the top that it becomes laughable. Great acting, but the directing is trying way too hard. The silence as subtlety is so beyond the pale. You can almost hear the director shouting, \"give me nothing.\" Angelina is great as usual, though under used. It left me wishing for the movie I thought I was paying to see. They keep trying for complexity and wind up with an almost laughable one dimensional baddness."}, {"rating": "9", "text": "Excellent movie whose ambiguities resonate with our times."}, {"rating": "10", "text": "Intense, cerebral, and as starkly uncompromising as its main protagonist, the film floats the viewer unsuspectingly ever deeper into an amoral jungle toward a chilling contemporary vision of the diplomatic \"heart of darkness\" that motivates states and the covert soldiers whose identities are as indistinguishable from each other as from those of the governments they serve. Evoking Le Carre's rich character development and the striking visual tableaux of Coppola (whose touch is seen throughout), Shepherd takes quiet control of the viewer's emotions, drawing us into a relentless, addictive web of conspiracy that, at the end, leaves us drained and needing more. This magnificent movie more resembles The Constant Gardner than Casino Royale, and requires an alert mind and attention to detail. When it is over, it is difficult to determine which is more brilliant, Eric Roth's screenplay, or its beautiful, calculating execution. One of the 10 best of the past 10 years!"}, {"rating": "8", "text": "I wish I could say it was a masterpiece. I tried to look past the fact that the movie lacks movement. I like the intentions of the producers, but editing plays a part in making movies strong or great. The film needs a climax - it builds and builds, but falls short. I still like the intrigue and style of the movie. Most movies these days only get climaxes, and no real crescendo. Nevertheless, the allure and acting of Jolie and Damon's presence cannot be discounted."}, {"rating": "9", "text": "Probably the first truthful movie in years (about American history anyway) , yet its greatest weakness is that its story arc is not allowed to go where the \"conspiracy theorists\" want it to go, namely, to the JFK assassination and beyond. Its greatest strength is that it need not go there once one understands that there are no moral absolutes when it comes to politics. To render so much truth in one movie is a marvel to behold, I only wish we lived in a world where we did not need to be so covert in its telling. But perhaps this all the more delightful for those who do know. I give it a 9 because it lacks the ability to speak to those who are not so well informed. It is too inaccessible to ever get the \"great classic\" status of The Godfather. This is a shame. But since I am not a great film maker (or any kind of a film maker) I cannot be sure that the complexity and lack of broad appeal is something that could be better handled by another director or if it is intrinsic to the subject matter. Either way this is a movie which will be studied by many students (of history, film, English Lit etc) for years to come. I look forward to the DVD in order to give it the close attention it deserves."}, {"rating": "10", "text": "A chilling tableau and a precisely revealing movie \"The Good Shepherd\" is not for those who want to experience action. This is a thinking man's perspective on the establishment of the CIA out of the OSS - created for international counterintelligence during WWII. The film is experienced much like reading a Kazuo Ishiguro novel (Remains of the Day, Never Let Me Go) composed of carefully fragile pieces of character and circumstance leading to its conclusion more through experience and observation than through explanation. Far from a Bond's movie or Damon's own Bourne franchise, the intrigue is played out like a chess game based on political maneuvers, power plays and most of all the manipulation of human behavior. Although Damon plays a cold hearted silent and stoic agent he delivers an incredibly effective performance through the smallest of gestures and expressions; his eyes are our window to his soul which, almost without human form, is at war with itself as much as the U.S and Russia are in its own cold war. Damon creates a character unlike any I have ever seen on screen; at the same time that he is us and we see the world and our responsibilities through him we revile him and are chilled to the bone by his stare. He is the ideological good guy and the practical bad guy wrapped up in one serving as the story's political metaphor for our Country's sad and confusing condition of unintended consequences. In fine execution of understated British acting, Billy Crudup (?) as Damon's mentor shows us that the espionage game is for young men and John Turturro creates a rich and believable character with just enough weakness to show us the moral consequences that an average man's actions can cause if he is willing to follow without questioning in the name of the State. The visual references of his behavior to the conflict in Iraq is not the least bit subtle. It is good to see William Hurt back in fine form and small parts by Joe Pesce and DiNiro himself are excellent in adding to the fabric of the movie. Finally, although Jolie has received praise for her work in the film I did not find that she created any particular depth of character although, to be fair, the role is superfluous to the movie. This is not a Robert Stone movie. It is a deep, sensitive, philosophical inquiry into the political, moral, and human aspects of espionage."}, {"rating": "6", "text": "Marginally better than average cold war spy movie. I don't think Damon is a very lively actor at the best of times, but he works out okay here as a colorless government man. Jolie seems kind of wasted in what's a relatively minor role. I enjoyed the spy intrigue but thought the acting was somewhat flat in spots, and felt that some important plot points were not telegraphed well. Overall, a 6 out of 10."}, {"rating": "10", "text": "The film is structured around the time it takes to analyse a murky intelligence photo of the protagonist's son. The analysts have trouble understanding the photo. It is the photo that functions like Proust's madeleine cookie in the tea. This is real film-making. Obviously, a sophisticated audience is de rigueur. The portrait of the wasp in the fifties and in his fifties prior to the sixties \"de-repression\" of society is very apt. These people are like that. And they are still in power. The film is a brilliant depiction of how unresolved issues just get pushed down the generations. The main character only reads the letter from his father who committed suicide when his own son is in trouble. This movie is not a thriller and anyone who expects one will be disappointment. It is fantastic film-making and blends the social with the personal in a very convincing manner. Bravo, de Niro."}, {"rating": "10", "text": "Espionage at its' finest! An amazing journey, splendid story, and a cast that does the story justice. Thanks Bobby! You are the man!"}, {"rating": "4", "text": "The film keeps changing pace by going back and forth as trying to mix up the viewer into thinking and trying to make some reasonable story that keeps you confused too find out what is going on. The only thing that is impressive is the control of Damons 'Poker\" face. 8 Stars up for that. My opinion is that I should have saved my money and rented a funny DVD."}, {"rating": "5", "text": "While intellectually interesting, this film could have benefited from losing an hour, tightening up the plot lines, and finding a lead actor who really looks and acts the age that Matt Damon's character is supposed to be."}, {"rating": "10", "text": "After reading preceding comments, I think the lower scores may be partly due to younger age. Having lived through the Bay of Pigs, etc., the \"living backdrop\" is built into those of us over 45-50. So, the character played by Matt Damon is as familiar as our remembered family dinner table, or most of the \"authority figures\" we grew up with (under). So refreshing to have to think while watching a movie. Lately, if we're lucky, we're usually only expected to carry an unexplained detail or two in our heads for 30 minutes, leading up to it's reveal. In this film, we are challenged to carry whole plots, visual references, audio clues (the Spanish word for pig) and patterns picked up in childhood. I think entertainment is being mentally challenged."}, {"rating": "3", "text": "This movie is long and very slow paced. Though the movie has great intentions and a great cast, it is rarely engaging and walks the line between drama and documentary."}, {"rating": "5", "text": "Extremely hard to follow; too many details omitted. To fully understand this film, I would have to watch it twice. However, I couldn't sit through two sittings."}, {"rating": "4", "text": "You know how some great films no matter how great they are feel too long at the 3 hour mark (except absolute masterpieces like The Departed and Almost Famous)? Imagine that film except it starts to drag at the 15 minute mark. This would have been absolute hell if I had to sit through it at the theater and I am so grateful I saw it on DVD and shut it off immediately."}, {"rating": "3", "text": "An episodic mess with no central narrative thread and completely devoid of compelling characters. The actors deliberately underplay their roles and mumble through most of their lines, which are in turn drowned out by the wall-to-wall ominous soundtrack that's meant to be foreboding and ends up anything but. You can put a lot of talented actors on screen and throw money at them, but that does not guarantee a good movie. What a mess."}, {"rating": "7", "text": "A laborious but undeniably intelligent expose of the career path of a counterintelligence operative."}, {"rating": "3", "text": "An intelligent spy film made without intelligence. There are numerous scenes and subplot lines that if they were cut would have improved the movie. The subplots really don't improve the main plot line, as do many of the characters. For its 148 minute running time, it asks too much and delivers too little. If it were cut to just under 2 hours, it would have been much better."}, {"rating": "1", "text": "Why no mention of the milestone Mohammed Mossadegh overthrow in Iran? Matt Damon cast as the spy-master was a comical touch. Crispin Glover should have had that role."}, {"rating": "10", "text": "The Good Sheppard is complex and fooregoes spy thriller techniques in order to accurately portray an organization embedded inScull and Bones and capable of anything, and destructive to the welfare of this country."}], "recommendations": ["hereafter", "the_master", "ex_machina", "a_most_wanted_man", "the_machinist", "beirut", "12_angry_men", "the_rover", "tinker_tailor_soldier_spy", "the_social_network", "her", "manchester_by_the_sea", "the_beguiled", "no_country_for_old_men", "predestination", "the_last_duel", "the_place_beyond_the_pines", "tenet", "crash", "a_most_violent_year", "sicario_day_of_the_soldado", "first_man", "the_devil_all_the_time", "the_killing_of_a_sacred_deer", "mark_felt_the_man_who_brought_down_the_white_house"]}