{
  "id": 2263,
  "title": "The Nutcracker and the Four Realms",
  "starring": [
    "Mackenzie Foy",
    "Jayden Fowora-Knight"
  ],
  "runtime": 99,
  "genre": [
    "Fantasy",
    "Adventure",
    "Family"
  ],
  "description": "When Clara’s mother leaves her a mysterious gift, she embarks on a journey to four secret realms—where she discovers her greatest strength could change the world.",
  "releaseYear": "2018",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9vPDY8e7YxLwgVum7YZIUJbr4qc.jpg",
  "categories": {
    "plot": 5.184210526315789,
    "acting": 5.096774193548387,
    "ending": 4.0,
    "soundtrack": 5.75,
    "cinematography": 4.0,
    "familyFriendly": 5.5,
    "funny": 7.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Хахахахахха,ну что толерасты?Что с ебалом,мать жива?Боже,как же я люблю когда левые животные сосут хуи,горите в аду мрази ебаные"
    },
    {
      "rating": "3",
      "text": "Oh Nutcracker, where do I start? This, for me, was a top 3 biggest disappointing movies of the year. I have trouble even trying to quantify what they were trying to go for this film. Where was the wonderment...the magic that made you feel like a kid again that this story brings with it? Much like Wrinkle in Time, they pumped a ton of money into the CGI department with hopes of stunning you with amazing colorful scenes, but forgot to deliver the captivating story to go with it, leaving you with a movie that is better as a baby sensory video. And I understand trying to \"shake things up,\" and giving a classic a new feel, but who greenlit the idea to make the mouse kind not a mouse but a swarm of mice that collectively together make one giant mouse...AND THEN MAKE HIM AN ALLIE IN THE END?! Ban that man from cinema altogether. And then they made one of the key plot points the total cliche \"all you need is inside of you.\" Could you possibly shoot anymore for the common denominator with that one? This movie makes it hard to point out anything they did right, which honestly may just be the fact that Morgan Freeman is in it."
    },
    {
      "rating": "2",
      "text": "The plot is practically incoherent, the acting is all over the place and it’s not even very Christmasy. Who was this thing even made for?"
    },
    {
      "rating": "3",
      "text": "Totally predictable. With a script that looks more like cake recipe, Disney makes a totally wrong bet at the time he thought of another  \"Alice in the Wonderland \". Its visual comes to be fluffy, but does not have the slightest coherence, both in script and in the performances. Even trying, Disney and its live-actions of recent stories (removing Cinderella, Christopher Robin and so on) are not giving more right at a time. 3.7/10"
    },
    {
      "rating": "2",
      "text": "An incoherent slog.  The story is a mess and the characters aren't compelling enough to make you care about any of them.On the bright side, at least they've managed to add in the multiculturalism so often lacking in Germanic fairy tales."
    },
    {
      "rating": "9",
      "text": "I do not understand the poor reviews at all. It was engaging, fun, funny, etc. The acting was well done, especially for the more important parts. The story was well done, and the movie was exactly the right length for it. When I finished the movie , my first thought was that I should just sit there and watch again."
    },
    {
      "rating": "1",
      "text": "Whoever thought this movie was worth making needs to seriously attend a psychologist. This movie is bad, don't go see it."
    },
    {
      "rating": "4",
      "text": "The Walt Disney Company’s latest film’s marketing has been almost non-existent, with Disney seemingly pushing the film into a toy chest and sliding it under the bed, for fear of an unimpressive box office run.The problem with the film does not lie with the visuals, but with the execution of the narrative goes from magical realm to old forgotten toy.The film follows a young Clara who is whisked away into adventure via the help of her godfather, Uncle Drosselmeyer, much like the original classic tale, yet everything that comes after gets a predictable formulaic rewrite, though that may not have been what screenwriter Ashleigh Powell intended.When the audience first meets Clara, she is rambling physics to her younger brother as they set up a trap for a tricky mouse, and then the audience is told and retold how smart, special, and how Clara is unlike anyone her age.Yet, aside from the scientific ramblings, Clara is pretty much no different – and the audience does not get any other character to compare Clara to.Not to mention, the two minor challenges that come her way at the beginning of the film, and then throughout the second act, that Clara seems to overcome without even breaking a sweat.For you see, Clara is another in a long line of female protagonists that seem to be good at everything from the moment they appear on screen, and though at the surface that might not seem like a negative, at its core, any character, regardless of gender, that is not challenged throughout a film and continuously succeeds is a rather dull character to cheer for.This is not only harmful to stories with female protagonists, but it is also painful for the audience because of lack of engagement.Witnessing a character trying their hardest to achieve their goal, and along the way winning some, and losing some, is why audiences go to the movies – they want to feel some form of emotional catharsis.Unfortunately, the audience never fears for Clara’s safety, nor ever doubts that Clara will survive in the end. Yet when considering all past Disney films, specifically the much-debated and mocked Disney princess films, even though the audience knew that the end would be happy, it would worry about whether Ariel would get her voice back, whether Pocahontas would be able to save her tribe, whether Mulan would be able to save China because the challenge was evident and it was not easy.On that front, the film fails to engage with the audience on a narrative level, and thus becomes a magical missed opportunity.To add onto the already problematic narrative, screenwriter Ashleigh Powell follows the new Disney agenda of turning what they view as stereotypical villains into the misunderstood heroes while characters who were once beloved heroes into diabolical, heartless villains.This was the intent behind Disney’s Maleficent, and the mechanics are used again here, making the plot twist blatantly predictable and disappointing.The power of classic Disney animations was the never-ending battle between good and evil, yet with this new wave of Disney films, the characters we grew up believing are villains are being restructured and repurposed into poor victims of circumstance that became villains, and that just makes the hero indirectly evil for going after the villain to begin with…On a positive note, the film’s production value, and color palette are quite mesmerizing to look at.From the astoundingly flamboyant costumes, to the grandiose sets and environments THE NUTCRACKER AND THE FOUR REALMS is a visual treat.The film opens with a fantastic long take that helps pull the audience into the world and ambience of the narrative.One of the most memorable sequences in the film would have to be the interlude ballet sequence due to the creative way that it was shot as well as the stage like set pieces that were placed with the ballerinas.That one sequence had more complex and layered characters than the entire film.The performances from the cast were decent when one looks at the screenplay that they were given, yet the stand out performance here goes to Matthew Macfadyen who plays Clara’s father.His nuanced performance and evident struggle in coping with the loss of his wife and having to remain a proper father to his children almost brings tears to the eye, all this considering he appears in the film a total of twenty-minutes.THE NUTCRACKER AND THE FOUR REALMS had a lot going for it in terms of visuals and cast but faltered in terms of lazy storytelling that doesn’t require any emotional engagement from audiences, specifically younger audiences who are the main target of such a film.Gone are the days when Disney used to tell stories that challenged the mind of child and taught them something, even if it was a hard truth. What we are left with now are cotton candy stories that disappear instantaneously leaving not a trace behind."
    },
    {
      "rating": "2",
      "text": "Visually, this movie had everyting it needs to be epic. And then they went ahead and screwed the whole thing up with a terrible script. I laughed at several parts of the movie that were definitely not meant as comedy, never a good sign. Keira Knightly and Mackenzie Foy's acting saved the movie from being the biggest bust of the year. Why all time great Morgan Freeman decided to appear in this monstrosity is beyond me."
    },
    {
      "rating": "7",
      "text": "Ok so let's get started here this movie was not as bad as people said I loved the action and adventure this one really got me in the holiday mood very good and fun movie one of the most imaginative movies this year and one of the most magical Christmas movies in years"
    },
    {
      "rating": "8",
      "text": "Reviews seem really divided on this. Though I admit the film could've been stronger in parts, I was still entertained.The whole thing looks great with deeply detailed sets, costumes, and makeup that evoke a classic fantasy feel. There are some clever design ideas, especially in the Land of Amusements.Acting's pretty good. Admittedly the fantasy characters are more interesting. Keira Knightly is fun in a quirky over-the-top performance. There are a couple of fairly funny guards and the Nutcracker himself is likable. Unfortunately, those three are not as well-utilized as they could be, especially considering that the Nutcracker is one of the main characters.Admittedly, the film is a little weak in the plot department. The main character Clara experiences a by-the-numbers getting over the death of a parent and learning to believe in them-self story-line. The Four Realms and its current threat could've been a lot clearer. Also, we could've spent more time exploring and experiencing the Realms. A little too much time is spent on throwing Clara from plot point to plot point. Her struggles are solidly delivered, but they spend so much time on it at expense of the world-building.The movie's not perfect, but it's all about the experience. The Nutcracker is fun and looks good. And though the story is flawed, it isn't bad. I think kids will like it and parents will like it or be indifferent."
    },
    {
      "rating": "8",
      "text": "An imaginative, supper-high-production value, Christmas-fantasy movie.This is top drawer, AAA US-UK film-craft. The swooping camera, the costumes, the 1800s Rube Goldberg mousetrap, the clockwork toys, mechanisms and gears, the set design, the behind the scenes 1800s theatrical set design insights, the hip-hop dancing to the Nutcracker music in the end credits--and--wait until you see the Mouse King for the first time.The first 30-40 minutes of the film are like flying to anyone who who still has the innocence of an eight year old.Despite the production troubles this did NOT feel like two movies to me, by two different directors. This is high-level directing and acting sustained thruout.The father-daughter and mother-daughter scenes are better than most. I credit both actors and directors here.If you are not a fan of world-class production design and CGI, and you are older than 8-9 years old, you may want more “meat” on this bone.  What drags it down to 8/10 for me is the script. To the screenwriters I recommend more study of Disney’s Return to Oz (1985) imdb.com/title/tt0089908/ on the theme of a troubled girl healing herself thru fantasy.This movie too was largely ignored by cynical critics but succeeds narratively way beyond later films in the genre of \"coming of age thru healing fantasy.\" The Never-ending Story script may also be useful here tho I recall Return to Oz being the stronger film on this theme.Then we have the issue of writers attempting to create a new fairy tale. This is one of the most difficult tasks in fiction writing. I imagine what usually happens in the writing process is the writer is willing to take the main character deeper into her own darkness so she can emerge Phoenix-like; however, the studio wants an \"upbeat holiday treat.\" This is the weakness of 50% or more of all films attempting to compose and present a fairy tale which can stand with classic fairy tales in literature."
    },
    {
      "rating": "9",
      "text": "I don't know but critics can't disney films reviews.be cause this film for children."
    },
    {
      "rating": "4",
      "text": "This film has numerous references to the classic ballet, including the title, many of the characters and bits of Tchaikovsky's music. The plot revolves around Clara, who enters a fantasy world in search of a special key. Since the script is pretty insipid and the \"action\" is never exciting, the lovely art direction is the only real reason to see the film. Young girls may appreciate the sweetness and the preponderance of strong female characters, but the overall effect is rather bland."
    },
    {
      "rating": "5",
      "text": "When it comes to live action entertainment, Disney's track record has been inarguably dominant as of late. Whether its the MCU films, the recent Star Wars installments, or the live-action adaptations of their animated classics, it would appear that they have their stuff together. But every once in a while you get your \"John Carter's,\" your \"Lone Ranger's,\" and your \"A Wrinkle In Time's.\" They're certainly rare. But they exist. This is one of those. This is a complete, hot mess of a movie, with a couple of unironically enjoyable elements. For one, it looks good. Now, don't confuse \"good\" with \"real.\" The backdrops and scenery may be cool-looking, but don't think you'll be watching anything out of an \"Avatar\" sequel or anything. Also the music -- of course -- is quite a delight. But when you have a movie called \"The Nutcracker\" that has the titular character reduced to a role of mere spectatorship and chauffeur work, I can't give you anything higher than the above score. This is about as far away from a \"Nutcracker\" adaptation as you can get. And when the swings come, boy, do they miss hard."
    },
    {
      "rating": "4",
      "text": "Visually dazzling but also incredibly empty.This film makes the same mistake that A Wrinkle In Time, where they believed the production and its extravagance was good enough and despite being quite colorful, it suffers from a very diluted script that hardly offers anything new.It's a pity because this is a first level production but to tell the truth it didn't make me feel anything."
    },
    {
      "rating": "10",
      "text": "Outro filme que ainda não assisti, mas vou procurar so pra ver a lenda do Prince"
    },
    {
      "rating": "5",
      "text": "Let us begin with the great aspects of The Nutcracker & The Four Realms. With a budget of $120 million, the producers and visual artists had quite a bit to work with, but certainly not enough to match the effects of the most visually splendid films, such as Avengers: Infinity War ($316-400 million), Pirates of the Caribbean: At World’s End ($300 million), and The Hobbit: An Unexpected Journey ($200 million). Usually, films that have the same budget as this film have very noticeably CGI effects that don’t come off great at least in my eyes, such as Rampage and Ghost Rider, which also aren’t good film company to serve as comparison. To compare to a fellow Disney remake, Beauty & The Beast has a budget of $175 million, which was used very well. However (in a good way), The Nutcracker’s visuals were absolutely on par with those visually splendid films. The world’s created with the CGI were beautifully rendered, and the set design in the real-world scenes was extravagant and fitting for the Christmas-based period in time. The costumes were also well-designed and fitting for the settings. Due to the bad reception, it is unlikely, but I truly believe that this film should be nominated for an Oscar for its costume design. Visual splendor cannot carry a film towards overall excellence, but the visuals for this film certainly keep it from sinking rock bottom.Another positive element of the film was the beautiful film score that incorporated Tchaikovsky’s classic pieces and some new content very well. Of course, being a film based on classic ballet, it must have Tchaikovsky and classical music or else it would be as dumb as Gotti using Pitbull music even though it was based in the 1980s. Along with the proper incorporation of classical music, the first half of the film was a great set-up that felt homely and harkened back to some childhood memories. The sets were great, we got more of Morgan Freeman, and the ballet performance by Misty Copeland was among the best scenes in all of the film industry for 2018. That is where the praise for this film ends.With the runtime clocking in at only one hour and 35 minutes, there is so much film to pack out in such a short timeframe. With these limitations, the movie moves too fast as we enter the world of The Four Realms. There is a lot of missing information that would allow the circumstances of conflict presented to make sense if they were properly explained. Instead, there is little explanation as to why there is any form of conflict. I’ve begun to care less about plot holes by understanding that filmmakers seek to reap box office results first, but when a film does not give explanation as to what events occurred for conflict to exist, it just doesn’t make sense.I’d say that another atrocity committed in the film was its use of clichés from other Disney films while utilizing them in the worst way possible. I was shocked by how much content and elements that The Nutcracker borrowed from other Disney films, especially considering that this is a Disney film itself. It was made worse by the fact that these elements were ultimately executed in the worst way possible. This movie borrowed heavily from the first Chronicles of Narnia, which seems like a bad sin made worse considering both films are made by Disney.Since the film aims to appeal to young viewers aged 10 and under, there was a lot of childlike humor and tone that made the film feel corny. It isn’t impossible to include quality humor in a kid’s film, but The Nutcrackerfell into the bad side of appealing to children. I should’ve expected that, but considering the maturity found in many Disney films such as The Incredibles 2and Big Hero Six, I was very disappointed and felt like I was an adult with a child’s mind for sitting through the movie.The last disappointing aspect of The Nutcracker & The Four Realmswas the performances of the main leads. Mackenzie Foy, whose claim to fame was in Twilight along with a great performance in Interstellar, was largely lifeless in this movie. The delivery of the lines came out flat, which contributed to the film’s corny feel. Keira Knightley exacerbated this feel with her awful, nasal voice and too many moments of overacting. I’d say that Jayden Fowora-Knight, who played Captain Philip who was supposed to be the Nutcracker but there never was any Nutcracker, also had the same problems as Mackenzie Foy. A few other actors weren’t bad but just overtly childish. Helen Mirren did well with what she had, but she was barely in the movie. The Nutcracker & The Four Realms has unfortunately earned its place among the very worst films of 2018, and worst films that Disney has ever made."
    },
    {
      "rating": "10",
      "text": "Epic Fairytale; Pure Disney, Like a christmas version of Alice in Wonderland !The Nutcracker and the Four Realms is a really magical movie. Full of Christmas and Magic. Featuring stunning sets and costumes and a good moral. The plot of this new adaptation of the Ballet and the Classic story that inspired it revolves around Clara a young girl who's mother has recently past away. On Christmas eve she discovers , with a little help from her Godfather Drosselmeyer played by Oscar Winner Morgan Freeman , A Magical World consisting of Four Realms each ruled by different regent. Three of the realms are good and peaceful. But one is dark and evil and ruled by the villainess Mother Ginger played by Oscar winner Helen Mirren.This is the kind of big budget Fantasy movie i love ! The sets and costumes are colorful and intricate, the cast has big stars playing larger than life roles and it has a good moral about believing in yourself and grief.The movie has magic and a good midway twist. Mackenzie Foy does a good job playing the lead and among the other actors Keira Knightley is a stand out , giveing her character a unique voice and set of mannerisms. The movie also really gives you a christmas feeling with all its snow , Christmas trees and presents. Richard E Grant and mexican comedy super star Eugenio Derbez also does a good job with their roles though both are slightly underused. Misty Copeland's role is also very small and i didn't even notice Miranda Hart. Actually i'm not even sure she was in the movie. Maybe her role has been cut from the finished film. I know there were reshoots. Speaking of shooting. The Director is a country man noted Swedish Director Lasse Hallström. But all the reshoots were handled by Joe Johnston( Captain America the First Avenger and Jurassic Park III). I don't know which filmed which scenes. Special shoutout must go to Two Time Oscar Nominee Guy Hendrix Dyas from his Production Design and Two Time Oscar Winner Jenny Beavan for her Costumes.It's a really good movie, I highly recommend it !"
    },
    {
      "rating": "4",
      "text": "If your family is going to see any holiday film this season, make it the Grinch. This film has crazy plot, creepy clowns, weird innuendos, just not a whole lot going for it. The cast is not used to their full potential.  There are some cool shots but kids are not going to enjoy the entire film and just see some cool shots. I`d much rather take my kids to see the Grinch"
    },
    {
      "rating": "2",
      "text": "Okay pros: It does look really amazing with the designs. Morgan Freeman's cool but then I again I've yet to see a bad Freeman performance and Keira Knightly as The Sugar Plum Fairy is pretty entertainingly funny. And I do give credit that they got professional ballet dancers for the scene where they show the history of the realms. But the cons: the story is predicable and full of tired cliches, the lead is pretty bland, the fact that the villain is a twist villain that comes out of no where where as the advertised villain isn't really the villain at all. And the message has been told before in other movies. But this is just my own opinion."
    },
    {
      "rating": "4",
      "text": "A really dissapointing movie, sin, from the trailer promised better. A really bad luck..."
    },
    {
      "rating": "2",
      "text": "Without miss mackenzie's beauty and ballet, there's noting to see or enjoy. The reversal of the movie was predictable. Clara's kicking is like a dancing and conflicts between the characters are too weak. At the end of the movie, Clara's retribution was closer to her execution and was not found to be childlike. I think it's one of the most terrible movie made by disney."
    },
    {
      "rating": "10",
      "text": "Nagyon jò film Helen Mirren ebben is jòl játszik mint minden filmjében az egyik kedvencem!"
    },
    {
      "rating": "6",
      "text": "Visually stunning but it would have been better. If it was actually based on the Nutcracker. Just like with A Wrinkle in Time, Disney was more focused on being diverse. Then actually doing the story justice. Yet they don’t even do anything with the Nutcracker or much with Morgan Freeman. The Nutcracker gets to do very little and the actor doesn’t stand out much.Hell the Nutcracker starring Elle Fanning that got 0% good reviews. Was more Nutcracker like since Mouse King was actually the villain. Oh and actually in it."
    },
    {
      "rating": "4",
      "text": "This movie has a good production design and story, but failed in performances, developing in the story, and photgraphy. With all the pros and cons we could say that The Nutcracker and The Four Realms wasn´t a good adaptation that Disney did, but it wasn´t worse that the 3D version of 2010."
    },
    {
      "rating": "5",
      "text": "Soulless, dull and utterly lacking in magic. This is every inch A Wrinkle in Time, only even more uninspiring, yet shorter and less cringe-worthy, and hence way more watchable.(5/10)"
    },
    {
      "rating": "1",
      "text": "Why does this movie even exist? It's just flat out horrible and I feel bad for director Joe Johnston for even taking part in this movie."
    },
    {
      "rating": "5",
      "text": "Un film avec un principal point fort (peut-être le seul...) sa mise en scène et les décors."
    },
    {
      "rating": "1",
      "text": "I was under the impression that The Nutcracker and the Four Realms would be The Nutcracker without dancing, but there’s actually a lot of dancing, including basically a PowerPoint in ballet format to (whatever the opposite of clearly and succinctly is?) explain the way in which the evil clown witch unsuccessfully attempted a coup.No nuts are cracked in this film whatsoever, nor is there any discernible difference between the Nutcracker and any of the other regular people in the world, except for the fact that he’s just about the only black person in that whole world who doesn’t dance ballet. We’re supposed to believe that the Godfather is living in some racial paradise of Edwardian London where no one from the posh crowd of socialites has any problems being hosted by a black man with an unexplained eye patch. The lack of diversity in both of these settings is part of a long, tired line of questioning about whitewashing and sci-fi fantasy: Lando being the only black man in the universe until Solo, everything about Shyamalan’s Avatar the Last Airbender (which I remember kind of liking, actually).Aside from the weirdness of those two things, there’s this very uncomfortable strain of parental favoritism that runs throughout the film. Morgan Freeman tells Clara that her mother called her her most prized creation, despite the fact that Clara has an older and younger sibling. For some reason, we learn in a lone flashback that Clara’s dead mom seems like she for sure knows Clara is going to have to go to the Four Realms by herself some day, but it’s not one of those wardrobes that sends all the kids at once, apparently. Little Fritz and Louise can go **** themselves, I guess.Also, Sugarplum acts shady as **** the entire film. No one comments on the fact that she eats her own air at one point. I was really not ready to have Keira Knightley play a sixteen-year old manic pixie for two hours, so I’m grateful that once her evil plans were revealed, she sort of plays it erotic, throws out a few surprisingly mature lines for a kids show: “a boy with a gun and a uniform sends a shiver down my spine.”Was it better than I was expecting? That’s a hard thing to say. My expectations were pretty dismal to begin with. I didn’t really feel bored at any moment, but I also wasn’t surprised by anything. Wife says that this was nightmare fuel for her, because of all the mice walking around which no one tries to exterminate. She wishes there had been fewer rodents and much less rodent-friendly propaganda, so take that as you will."
    },
    {
      "rating": "10",
      "text": "I think that the nutcracker reboot movie was excellent movie ever made in the 21st century."
    }
  ]
}