{
  "id": 578,
  "title": "The Martian",
  "starring": [
    "Matt Damon",
    "Jessica Chastain"
  ],
  "runtime": 141,
  "genre": [
    "Drama",
    "Adventure",
    "Science Fiction"
  ],
  "description": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5BHuvQ6p9kfc091Z8RiFNhCwL4b.jpg",
  "categories": {
    "plot": 7.24,
    "acting": 6.826086956521739,
    "ending": 7.545454545454546,
    "soundtrack": 7.5,
    "cinematography": 8.333333333333334,
    "familyFriendly": 6.0,
    "funny": 7.384615384615385,
    "action": 9.125
  },
  "reviews": [
    {
      "rating": "10",
      "text": "One of the best movies of this year, the Martian is not only a solid sci-fi intensity builder, but is also hilarious in it's own form with an outstanding cast, particularly Matt Damon. It's video game-esque sense of strategy to it makes it rich in science and just glorious shots of 'Mars' panned out like a real planet. Nothing felt wasted or left behind in this cavalcade of science, comedy and a charming message on the good side of humanity rather than against it. What a movie."
    },
    {
      "rating": "8",
      "text": "\"What makes a movie Good to Great is simply add a dash of Bowie and the film just glows like a Fabulous transgender diamond\"\r This is my favorite movie of the year. Yeah, Mad Max was absolutely incredible, but the Marian is easily one of the most satisfying science fiction films I've seen this year, and i love science fiction.\r This is the most grounded science fiction film I've seen. Everything felt so real, and the tension experienced by the main Character, excellently portrayed by Matt Damon, makes the situation feel ever so human as he find the determination to beat the odds and try his damnedest to survive. Also the film is just so dammed funny, its great to see a film not make this horrifying situation a sad angsty ride. The Martian is also the most motivational film i've seen in years. Do yourself a favorite and go see this amazing science fiction film and then read the book."
    },
    {
      "rating": "5",
      "text": "I didn't read the book and I'm not particularly into science. I'm very interested in space topics, though, so I thought I'd at least enjoy it. Sadly, I really did not.\r For a movie about such a truly horrific and desolate situation, I was shocked that its tone was highly upbeat for 90% of the movie.\r I found it lacking in tension, emotion, and character development. I thought it was much longer than it needed to be. There were times I was really truly bored. When the last montage came on, I felt myself drift off. There were so many montages.\r The stakes for Mark's survival were never very high. He didn't appear to have much of a family at home that he missed (he asks Lewis to send his love to his parents once, but that's it), everything seemed to go very well for him in general. He always had a perfect solution for everything, he was basically super human. The isolation of his situation raree showed in his character. He got a bit huffy once when something broke and he was a bit emotional when he was finally being rescued, but he showed none of the signs of a person completely isolated for a year. He had no development and no attachments.\r The sense of humor throughout felt cheesy to me. I cringed a lot. The jokes were like a what a 35 year old science professor picked up from a few months on the Internet. The use of curse words as humor is only funny if you're very young. I can't believe I'm seeing praise for that.\r I thought the supporting characters were soulless. When asked if they would spend another bunch of years in space to return for Mark, not a SINGLE one objected? Everything in this universe existed for Mark and no one else. He was the universe's priority\r Donald Glover's character was bizzare, he existed for cheap, immature laughs.\r One thing I will say is, it built a bit of tension when they were finally executing the rescue, but ultimately those scenes left me missing Interstellar and Gravity.\r Overall, I really don't get the hype. This movie was boring, often cringe-worthy and lacked tension. The protagonist was cocky, didn't have many emotional attachments to earth and was smarter than everyone else."
    },
    {
      "rating": "4",
      "text": "I realize this probably won't be a popular review, but I don't understand why everyone is praising this film so much. I'll list off the pros and cons to show why I'm giving it a 4/10.\rPros: The science is accurate,\rThe movie is visually stunning (seen in 3D IMAX)\r Cons: First, the film gets its tone all wrong. For a film that is basically Robinson Crusoe set on Mars, The Martian is oddly lighthearted. The result is that the movie has absolutely no tension. You know Mark isn't going to die, that he's going to be brought home safe, and that every problem is going to have a solution which requires no one to sacrifice their well-being, which makes for a boring movie.\rSecond, the other reason it's a boring movie is that most of the problems are solved through deus ex machina. \"Oh no, we blew up our rocket!\" \"Oh hey, how convenient that the Chinese government has a spare rocket engine we can use, and that they're willing to share this state secret solely out of the kindness of their hearts, despite the fact that there is no plot buildup to this solution whatsoever.\" There are plenty of other examples, but I won't list them all to save space. The point is that the film lacks verisimilitude as a result.\rThird, absolutely no person has any character development. Mark, who is stranded by himself on a hostile planet for two years, remains the same character type throughout the movie. His isolation doesn't seem to impact his psyche at all.This is really weird and took me out of the story. The script writer seems to think that everyone getting new jobs at the end of the movie serves as character development.\rFourth, endless plot points that are simply tangents. Mark talks about God once at the start of the movie, and we're led to believe he probably does believe in God. Does his faith (or possible lack thereof) change his view on things? Not really. Does his view on God change at all through this difficult experience? Not really. So why is it brought up? For a cheap, lighthearted joke. Mark talks about his parents once. Do we ever see them? No. Do we know anything about them or anything about Mark's other relatives? Not really. Most of the side characters work this way too. Donald Glover plays a geeky astrophysicist who solves a difficult science problem, receiving a few minutes of screen time. Do we ever see him again? Not until the end credits. Half of the characters work this way!\r Sorry this review is so long, but the cons take a lot of space to accurately map out. In short, The Martian plays out as if it was written by a high school science teacher. It's filled with science experiments meant to keep people interested, but all the characters are bland, static, and in no danger. Somehow, Ridley Scott managed to make an incredibly sterile movie about space exploration."
    },
    {
      "rating": "8",
      "text": "A feel good modern day Robinson Crusoe that is deserving of a high score for production values if nothing else. The science is very good. For example gravity is shown properly here and not just ignored away. Mars is also portrayed beautifully and realistically. Matt Damon is extremely likeable and upbeat.He is the embodiment of American can do spirit  ingenuity, wisecracking and problem solving using his American brain. He’s a frat boy in space. His solitary confinement seems to have no effect on him. Not realistic in any shape or form, but hey, let us let that slide. There’s a cast of 1000's working against the odds back on Earth cliche with their own personality conflicts and that’s OK. What’s not OK is an awful Jessica Chaistain scene that deserves to follow her around for an eternity it’s so crassly abysmal and I mean jarringly dreadful..Still for its flaws The Martian works very well on a cinematography level. No deep thought but very competently done..."
    },
    {
      "rating": "10",
      "text": "What a brilliant movie!!! The different scenes are still playing in a loop inside my head. This movie made me a fan of Mars :) after watching it I literally started studying about Mars, it's environment, about NASA and space etc. almost perfect script, characters and nail-biting climax made it one of the best movies of this decade."
    },
    {
      "rating": "8",
      "text": "A great movie all around, which should be expected when Ridley Scott is dealing with excellent source material. My only criticism is that Scott did not invest enough in the actors. The film could have been much more powerful if Matt Damon had been allowed to play up the personal, emotional struggles of isolation and fear his character must have been going through."
    },
    {
      "rating": "8",
      "text": "The Martian é um dos melhores entretenimentos do gênero.Tem um elenco maravilhoso, com o Matt Damon entregando uma ótima performance. Um roteiro muito bem escrito, com propostas inteligentes e que convencem, sem parecer muito forçado ou até mesmo viajado, o que é um ponto muito positivo pois acompanhar alguém inteligente é muito satisfatório. É claro que o filme abusa um pouco de arquétipos, principalmente no personagem do Donald Glover, que eu acredito estar lá só por conta da visibilidade, mas qualquer forma, o ritmo é fenomenal, propondo diversas cenas cômicas, de descobrimento e até mesmo tensas, o que me fez deixar de ser um pouco chato dessa vez.A atmosfera de marte é muito boa. Poderia ser mais imersiva, quanto ao calor e vazio, mas talvez fugisse um pouco da proposta, que é nos divertir, e nisso ele funciona muito bem - eu, pelo menos, dei muita risada. Enfim, a fotografia se aproveita bastante do tom quente no deserto e com uma paleta de cores mais clean na \"base\" ou na nave, o que dá um ótimo contraste entre condições. Alguns planos abertos são verdadeiras pinturas e o HDR acrescenta muito nessa obra. A OST está presente em diversos momentos e dá o peso que o momento precisa. A soundtrack, de acordo com meu gosto musical, não poderia ser melhor, com musicas clássicas que simplesmente nos animam só de escutá-las.The Martian é divertido, inteligente, conta com um ótimo elenco, e mesmo forçando a barra em um estereotipo ou outro, funciona muito bem como um todo.Audio: English, with Portuguese subtitles. Q60T 50' TV Speakers [Dolby 7.1]Quality: 4K HDR [Bluray]"
    },
    {
      "rating": "7",
      "text": "I've rated this film a 7 because while very good, it's also quite derivative, IOW you've seen many of these plot elements/devices before, only the setting is different. Also, it loses points because at 2hrs 20min it's really long and still doesn't cover everything you want to see, so the problem is that it should've been a six-episode tv mini-series to reveal the full end-to-end experience. Plausibility is good enough but there really should've been more unexpected problems, but that goes back to the need for a mini-series; a lot of stuff got left on the cutting room floor and is otherwise left to your imagination."
    },
    {
      "rating": "10",
      "text": "Not a perfect movie, but what movie is? This movie felt like  a breath of fresh air. Gone is the current American trend of DRAMA = SHOUTING A LOT, it feels real, the people, the science, the setting. But above all, this movie gave me something that most movies don't, a bloody good time."
    },
    {
      "rating": "10",
      "text": "This movie is a Masterpiece, the CGI was good, the story was original, the music is amazing and fits perfect with the scenes, and Matt demon does and excellent job as Mark Watney, some people might not like to much the ending because it was kind of unrealistic, but for me it gives the movie that action scene needed"
    },
    {
      "rating": "8",
      "text": "Space is not my favourite genre of movie but The Martian is really entertaining. Matt Damon's performance brings a humanity to the role which was lacking in Gravity and Interstellar for me. Strongly recommended.."
    },
    {
      "rating": "8",
      "text": "The book is amazing and I thought that the movie would be the same or better. I was a little dissapointed as far as accuracy but I guess it is as good as it gets. When I was reading the book I was crying laughing, not gonna lie. I thought the movie would be hilarious and it was at times. However, it just missed the overall LOL of the book. Now that I think about it, the book kind of ruined the movie."
    },
    {
      "rating": "9",
      "text": "I went to this movie by myself. In a new city. In a new state. Riding a new bus. Matt Damon, I felt a bit like a martian as well, although admittedly you are the bigger star. In what could have easily ended up as Interstellar's backwash, the The Martian holds its own. I've found so many similarities in my life here so I can't imagine a better movie to see at this time in my life. Loneliness, learning how to survive in a new environment. What's missing, however, is the rescue mission. Enough about my life – the plot was pretty much always known yet I was always intrigued by the details. The obstacles from Earth, strained communication, and especially the potatoes. Real-life martian problems are probably the most entertaining part, making us wait in anticipation to see the new innovative ways that the botanist will avoid death yet again."
    },
    {
      "rating": "10",
      "text": "This is a movie that I will purchase for my collection, it's that good.  It's a science fiction movie (Mars, duh) with desperation (alone with limited supplies), but also shows the humanity of the world as everyone pitches in to bring him home (a la Apollo 13.)  The man on Mars is Mark Watney, and since he enters a daily journal, he lets us know what he's thinking so we don't have a narrator or voice over (clever use of technology.)  To keep the mood going up and down, Mark has humorous comments (like Arnold Schwarzenegger movies.)  All in all, a well put together, enjoyable movie."
    },
    {
      "rating": "10",
      "text": "One of the best sci fi movies I have seen, I rewatched it in 2020 and it is still a great movie. Great script, scientifically made sense and Matt. D is just brilliant and believable. A must see"
    },
    {
      "rating": "8",
      "text": "Ridley Scott adapts Andy Weir's sci-fi novel about an astronaut, played by Matt Damon, left stranded and struggling to survive on Mars.\r Ridley Scott goes back to the future, a familiar destination for him, and returns in fine shape in The Martian. Although technically science fiction by virtue of its being largely set on a neighboring planet, this smartly made adaptation of Andy Weir’s best-selling novel is more realistic in its attention to detail than many films set in the present, giving the story the feel of an adventure that could happen the day after tomorrow. Constantly absorbing rather than outright exciting, this major autumn Fox release should generate muscular business worldwide.\r Scott has famously been up in space before, thrillingly in Alien, far less so in Prometheus (a sequel to which he is currently preparing). This time, he’s telling a survival story, pure and simple, of an American astronaut, thought to be dead, who’s left behind on Mars when an enormous storm compels his five fellow crew members to hastily cut short their extra-planetary visit. It’s Robinson Crusoe on Mars, but without the monkey and aliens.\r When Mark Watney (Matt Damon) regains consciousness after having been impaled by an errant antenna and knocked out, he quickly assesses the situation: He’s millions of miles from home and, based on the food supply, concludes that he’s got a month to live. But he’s by nature a can-do, optimistic kind of guy, a botanist by profession possessed of a sardonic, self-deprecating sense of humor, and decides that he has no intention of dying, even though the next Mars mission from home isn’t due to arrive for another four years.\r Most of the early-going is devoted to the man making calculations as to how he can maximize his time on the arid planet, beginning by growing more potatoes from the ones he’s got (in part by using his own homemade manure). Living in the relatively spacious quarters he and his colleagues set up, Mark cannibalizes everything he can, carefully apportions his rations and settles in for the long term; at moments the biggest threat to his sanity is the exclusive collection of ‘70s disco music left behind by one of his former astronauts.\r The claustrophobia and solitariness of Mark’s situation is shortly broken up by events back on Earth. After Mark’s tragedy has been duly mourned by the public, a sharp-eyed NASA technician notices ground movement in her surveillance of the Martian surface that could only be Mark moving around. Communication is duly re-established, which ignites both elation at his survival and frantic assessments of what it would take, and cost, to launch a rescue mission.\r Weir’s book is heavy with technical assessments of food and oxygen supplies, mechanical capabilities, flight duration and the physics of inter-planetary travel. Screenwriter Drew Goddard (World War Z, Cloverfield) has respected all these details while whittling them down to manageable and comprehensible levels. Officials at NASA and the Jet Propulsion Laboratory (represented by a lively and individualistic cast including Jeff Daniels, Kristen Wiig, Sean Bean, Chiwetel Ejiofor, Mackenzie Davis and Donald Glover) do everything they can to develop a feasible rescue plan and are ultimately helped out by a surprising foreign partner.\r But ultimately it comes down to the willingness of Mark’s astronaut colleagues (Jessica Chastain, Michael Pena, Kate Mara, Sebastian Stan, Aksel Hennie) to place themselves at great risk by attempting a long-shot rescue attempt, a decision that raises the provocative moral dilemma of whether it’s correct to put five lives at great risk for the remote reward of saving one life.\r Scott does generate a degree of suspense in this climactic stretch, but the film’s overall tone is dominated by the characters’ collegial humor, mutual respect among professionals and smart people being tested by an unprecedented challenge. The director and screenwriter downplay the conventional melodrama inherent in the situation in favor of emphasizing how practical problems should be addressed with rational responses rather than hysteria, knee-jerk patriotism or selfish expedience.\r Cinematographer Dariusz Wolski turns the neat trick of providing the film with a fundamental documentary reality while also making a thing of great beauty. Extra attentiveness is amply on display in all creative departments.\r Ridley's back in (a good) space."
    },
    {
      "rating": "10",
      "text": "I really enjoyed the movie. It dragged on too long . It always amazes me that the ELITES in Hollywood, with their political agenda do not  have a clue about flag etiquette. Through the whole movie except in one scene they had the American Flag on the Left side of the speaker. It should always be on the RIGHT side of the speaker when addressing an audience. How embarrassing, representing a Government agency like NASA."
    },
    {
      "rating": "10",
      "text": "Legendary filmmaker Ridley Scott (Alien, Blade Runner, Gladiator, Thelma & Louise!)is back in action with 2015's sci fi masterwork ''The Martian'' Ridley Scott shows us why he is still relevant and still a great filmmaker in hollywood, because he blew everything away with one of this years best movies.\r Going in i was afraid this movie was somehow going to be bad since Ridley Scott hasn't done a deal of great things since Gladiator, so me expectations were low, and on top of that i was prepared to witness an incredibly depressing and dower but great survival story (like The Revenant), but man was i wrong, I had some of the most fun watching this movie, i laughed so surprisingly hard at many points throughout the film, man what a special treat.\r When a movie like this can achieve both incredible, emotionally driven story and acting (Matt Damon was phenomenal by the way, also one of the best in years for him) and be hilarious, uplifting and witty at many points throughout the film, a movie like this gets my vote as (one of the) Best Picture ('s) of the year."
    },
    {
      "rating": "10",
      "text": "this movie has become one of if not my all time favorite movie, i do not give out 10's easily but this movie for me is one i could watch over and over and never become tired of. i wish i would have seen this in theaters but not knowing much about it i passed and regret it highly, if you have not seen this movie yet i very highly recommend getting it as fast as possible."
    },
    {
      "rating": "9",
      "text": "In an era where science-fiction survival tales are becoming a popular occurrence - with 'Interstellar' last year, and 'Gravity' the year before - writer Andy Weir and sci-fi connoisseur Ridley Scott team up to craft a complex tale that is carried by a single character, that character being Mark Watney, played fantastically by Matt Damon (Hollywood's biggest calamity, who requires being rescued... again).As the film tees off, we are instantly given a first-person view of the dangers of Mars and the fight for survival each astronaut is living out each day on the planet's surface, that is until their emergency evacuation - but nope, even Damon couldn't do that right. Abandoned upon the desolate surface of Mars after being presumed dead by his crew, Damon must do all he can to endure the martian environment. One huge thing I admire about this film's plot, is that it doesn't care about the intellectual level of its audience, as the quote above states so well: it'll science the **** out of them. It's such a complex and well-executed premise that on paper seems nothing more than a impossible feat to pull off.Technically this film is stunning, the cinematography, the CGI, the production design, all utterly gorgeous, and according to the Golden Globes, it's one of the best comedies of recent years too... yeah, sure. Admittedly the tongue-in-cheek humour does add a more fresh appeal to the film, making it a little more unique than previous sci-fi adventures, it piles on layers of thrills, emotional value and complex character development to create one of the finest science fiction films of recent years."
    },
    {
      "rating": "8",
      "text": "Emotional, funny, and compelling, The Martian dramatizes an extreme and risky situation through the thoughts and actions of realistic people.  It's great sci-fi entertainment, but what it has in story, it lacks in accurate scientific detail.  Sit back, enjoy, and don't bother taking notes during this one."
    },
    {
      "rating": "10",
      "text": "The martian manages to give you the experience of all the feelings of astronaut Mark, from sadness to anger. It was without a doubt the two best hours spent in my entire life, it became my favorite movie!"
    },
    {
      "rating": "10",
      "text": "One of the rare times that a movie lives up to its amazing source material. The Martian is a kick-ass (in a smart way), funny and thrilling adventure! It also proves the point that sci-fi Damon is the best Damon."
    },
    {
      "rating": "10",
      "text": "Ridley Scott and Matt Damon are at the top of their game in this thrilling sci-fi survival flick.Smart, captivating, and at times quite funny, this is one of 2015's best movies."
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "10",
      "text": "+++++++++++++++++××××××÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "9",
      "text": "The Martian stays true to it's source material and on it's own, spins a wildly entertaining yarn of human spirit and survival at impossible odds. As a movie, 8/10. But with Matt Damon's terrific acting and Ridley Scott's brilliant directing, 9/10."
    },
    {
      "rating": "9",
      "text": "A brilliant film and a grand return by Ridley Scott. We both want to see it again. Matt Damon is a standout and the main cast was great. Some slight missteps by the characters played by Sean Bean and Donald Glover but nothing major that I could not forgive.\r I read the book before seeing the film so the changes to the final moments of the rescue in the film were slightly jarring. The way he was rescued in the book was perfectly fine so I do not understand why they felt the need to change that in the film to a far less realistic rescue that is even more implausible. That was my only real negative for this film and stopped this being a 10/10 for me.\r The length of the film did not worry us. At no stage did we feel things drag on. If anything there was quite a bit of content cut from the book but I feel it did not damage the film. The way Mars itself was filmed (CGI, etc) was beautiful and haunting at the same time. Full credits to the cinematographer.\r Lastly we were worried US patriotism would infect this film but it was downplayed quite a bit. For us the film is a 9/10 and we will definitely see it again."
    },
    {
      "rating": "8",
      "text": "We thoroughly enjoyed the movie, The Martian. Having read & loved the book, I went into the theater with some reservations, and yes there are some big things missing, changed & moved around in the adaptation (for instance, I definitely prefer how the book ends versus the film) but that's to be expected. Overall the movie kept to the heart of Andy Weir's story, so bravo for that! Casting was pretty great --Matt Damon, Jessica Chastain & Michael Pena were particularly great, along with Sean Bean (& the fantastic LotR in-joke). We saw it in 3D, which was effective in a several key sequences, but the film is strong enough on its own that you don't need to see it in 3D if you're not into that. One of the better movies I've seen this year--definitely worth a visit to the theater!"
    },
    {
      "rating": "7",
      "text": "A solidly crafted sci-Fi drama that has botanist Matt Damon left behind on Mars by his fellow space travellers who believe him to be dead following an accident on the Red planet. Adapted from a novel, his survival and NASA’s subsequent rescue mission makes up the bulk of the story. Incredulity is kept at bay due to an intelligently credible screenplay. Damon holds centre screen effortlessly, but performances are secondary to the visuals as presented by director Ridley Scott. Despite being rather long the film manages to constantly command attention and the last 20 minutes certainly rack the nerves. The writing is peppered with humour and the score is appropriately and memorably fitting. With regards to the 3D format, I don’t think it is essential here, but does the job unobtrusively."
    },
    {
      "rating": "9",
      "text": "Ridley Scott should stick to space he's got that down.  Along with Scott I have to give credit to Matt Damon for his fantastic performance and Drew Goddard for a script that's full of tense drama but also has great comedy.  A"
    },
    {
      "rating": "3",
      "text": "The fact that this film received so many good reviews has made me lose my respect for humanity. It seems North American culture has been seriously dumbed-down, now lacking any measure of critical thought. This film was mediocre at best. Yes, the Mars landscape was nicely done; but visual effects alone don't make a decent movie - the effects of Gravity were much better, in my opinion. A  good film requires a good story, plot, dialogue, suspense, acting, etc. The Martian was so predictable it was boring. Damon's acting was adequate but forgetable. I felt nothing for any of the characters, and couldn't care what happened to them as the film ignored any potential psychological and emotional aspects of the story. Most of the characters acted like frat boys, not like professionals you'd expect in these roles. Damon's \"kiss my ass Neil Armstrong\" and other painful and foul-mouthed quips seem to appeal to a \"now generation\" too wrapped up in themselves to respect and honor past achievements - a professional astronaut certainly wouldn't act like that. And the disco music score was odd, jarring, like a drunk uncle karaoke-ing at a wedding. If this film was meant to be drama/comedy/sci-fi it fell flat on all accounts, appealing to the lowest common denominator. In my opinion, this is typical Hollywood capitalist crap, enabled by a well-bribed mass media, out to rip off people for profit (why can't I get a refund?), completely lacking in substance, made for dumb people who haven't picked up a book in their lives. And the positive reviews on here and elsewhere reveal a serious decline in taste. Has everyone become pigs satisfied with slop?"
    },
    {
      "rating": "10",
      "text": "Andy Weir's novel this film is based on is the closest you will ever get to a peer-reviews and NASA-vetted adventure story about survival on Mars. There is only one genuine scientific error in the story, and it was committed knowingly and deliberately as a plot device to strand astronaut Mark Watney: the atmospheric pressure on Mars is so low that the fiercest sandstorms could barely flutter a flag, let alone do the damage portrayed in the opening sequence. The only other quibbles involve things that we know more about today (thanks to NASA orbiters and rovers) than we did when Weir started writing: Mars does have tiny amount of liquid water at places on its surface, but it's hypersaline and undoubtedly full of toxic perchlorates; the dirt Watney wallows in would probably also have enough perchlorate in it to poison him; putting your intestinal bacteria into Martian soil, on Mars, is a major no-no according to international treaties about planetary protection: we still don't know whether Mars has any bacteria of its own, and we don't want to confuse the issue by contaminating the place with E. coli. Also, although the terrain at the novel's landing site looks smooth in maps made from orbit, in high-res view it turns out to be covered with huge potholes that would make driving vehicles difficult. And finally, the orbital maneuvers at the end of the novel, involving releasing air and flying \"like Iron Man\" are more comic book than physics book.  But those are \"errors\" only uber-nerds would cite. The novel is as hard as science fiction ever gets. The most improbable idea in it is that the US Congress would ever fund NASA enough to do these things, but NASA probably could do them were it given the funds.\r The movie stays about as close as it can to the novel, given that some of the explanations need to be simplified and some of Watney's language and humor expurgated for American audiences. So if you like rock-hard sci fi about survival on the real Mars -- with no aliens or monsters, but lots of \"I'm going to science the hell out of this\", you will love this movie."
    },
    {
      "rating": "0",
      "text": "I genuinely don't understand why this clichéd garbage is getting such high reviews! I thought it was awful!! Slow, boring and ridiculously implausible! One of the worst movies I’ve seen this year!\r Apparently being stranded on Mars is like taking a weekend away: you plant your potatoes, make lovely dinners with your plentiful supply of food, make a little video diary, or go for drives in your perfectly-functioning little buggy - all the while cracking jokes and listening to Disco tunes! It was like watching Nigella meets Big Brother mixed with some terrible one-man comedy routine! And as for the comedian, Matt Damon, himself: no charisma, smug, and not the slightest bit likeable; I was hoping he’d suffocate from lack of oxygen almost right from the beginning!\r Over-hyped drivel, and a disturbing testament to either how different taste can be, or to how little it takes to impress people these days - or how easily-pleased and dumb they are!"
    },
    {
      "rating": "10",
      "text": "The Martian is simply breath-taking! I went into the cinema with high expectations, and left with no words. This film, that's right I said film, has just the right amount of humour along with perfect acting, so good that I actually cared about the characters! I was able to let myself become immersed in an entirely extraterrestrial world that was portrayed using stunning graphics and cgi, and also managed to make the whole scenario seem incredibly realistic, while keeping me at the edge of my seat for almost two hours. I genuinely think that descriptions can't really sum it up properly, so go and watch it!"
    },
    {
      "rating": "2",
      "text": "Ridley Scott goes retrograde. Nearly all of his films have been ahead of its time, even historical titles(Duelists, 1492, Gladiator) had a modern style of its day. The Martian is more of a 90s popular film, propaganda for the Obama World view: Americans/Germans are led by a female captain to Mars, they leave the wise-cracking botanist who \"Sciences the **** out of It\" at every turn. Even the Communist Chinese in Beijing decide to save the day, while the Russians are nixed from any sort of existence. Ironic, considering NASA rides their rockets to space these days. Every single choice is politically slanted, and Ridley Scott returns to his TV Commercial roots. What is he selling? The film has no spiritual backbone, no depth, no real surprises and it recycles shots and models from Avatar and other films. It's a really ****ty movie, with a decent final 10 minutes. It's anti-introspective like Gravity, anti-curious like Interstellar, and sinkhole compared to 80s films like 2010 - when that was considered mediocre in 1984."
    },
    {
      "rating": "7",
      "text": "If you see the theme behind it, it follows the exact same base as \"Gravity\": someone lost in space... alone. It gets to be something repetitive, and it is not an Oscar winning movie such as they way in which, in my opinion, its predecessor did, but the thing that makes this movie unique is its originality. It reaches a whole new different level of feeling through the action of survival, and even though there some mistakes if looked through the point of science, the drama and intricate emotion behind each situation transforms it, in maybe not an unforgettable film, but one of the best space films from the last years."
    },
    {
      "rating": "9",
      "text": "Ridley Scott's \"The Martian\" is the best space movie made so far. Movies like \"Gravity\" or \"Interstellar\" are defeated for Andy Weir's 2011 novel \"The Martian\" . This movie have an beautiful and amazing story that was developed to perfection. Obviously, the most praise are for Matt Damon (Mark Watney) for his connection with the character. \"The Martian\" have a excellent interpretations (Matt Damon - Jessica Chastain - Kristen Wiig),  good scene sequences and the accurate and precise manner to show us a NASA story (Ares III).The soundtrack was very particular (Disco Music) but worked perfectly.The Special effects are a masterpiece of new technologies and give us a majestic 3D and 2D. In summary Twentieth Century Fox Film Corporation won the lottery with \"The Martian\". \"The Martian\" is one of the best movies of the year because is absorbent, unique, intuitively perfect, in a nutshell 'Excellent'. \"The Martian\" had, have and will have everything to be a Hollywood masterpiece. \"The Martian never be erased from their minds\"."
    },
    {
      "rating": "9",
      "text": "The Martian is one of the most anticipated movies this year for me that turns out to be very entertaining and definitely one of the best so far in 2015.\rThe cast in this movie is huge, there are a lot of big names and talented newcomers. Matt Damon, Jessica Chastain, Chiwetel Ejiofor are among the best performance in this movie. Ridley Scott did a really great job directing this movie as well as Drew Goddard for writing the screenplay. The movie is beautifully shot especially for the Mars and the space stuff. I didn't see it in 3D, and didn't think it would make a lot more differences since there are more \"non-space\" scenes than I expected. But I wouldn't mind watching it again in 3D as it is that enjoyable movie you could watch many times.\rThe writing in The Martian is good enough to keep you on the edge of your seat given how predictable the ending of this movie is. Few surprises are thrown here and there which is exciting. There is a lot of funny stuff that keeps this movie light and family friendly. For a sci-fi movie, there sure is a lot of science in this movie. For a person who knows just a little about science, this movie left me in awe watching what Mark Watney and NASA could do in a very messed-up situation one could imagine. This is also one of the weakness of this movie for me because with a lot of emphasizing in the science aspect, this movie lacks of depth for Mark Watney as the main character of this movie. I would love to see more beyond Mark Watney's optimism and his sense of humor and what is going on his mind that would make me not only root for him but also empathize for him just like what Gravity did with Sandra Bullock character. However, it is still very refreshing to me personally to see this optimistic character in a movie these days."
    },
    {
      "rating": "8",
      "text": "The non-space opera, non-action and non-emotional enduring version of Interstellar. But that stands out as an original, highly entertaining and beautifully directed sci-fi-adventure of science.\r The year was 2013, and ’Gravity’ broke all expectations. Both the critics and the audience adored the space-drama. It opened an almost closed subgenre; the more realistic and scientifically accurate side of sci-fi. It smashed the box-office numbers and it’s going to be the movie that changed the space-genre. 2014 delivered an ambitious and mind-but also a heart breaking-sci-fi adventure of the relationship between a father and his daughter. Christopher Nolan’s ‘Interstellar’ couldn’t match ‘Gravity’ and its box-office numbers, but it managed to bring big directors to the genre. 2015 is no exception and one of the most influential directors in the genre of space/horror is back; with ‘The Martian’ – the third installment in this realistic-science(-fiction) adventure that Gravity managed to put on the map.\r ‘The Martian’ stars Matt Damon as the leading role, and he subsidize with emotion and surprisingly much humor to the film. The direction by Ridley Scott is without any doubt excellent with the extraordinary cinematography and realistic views on Mars. The science-aspect is just as present and it keeps giving the movie realism in a not very distant future. We follow Mark Watney’s struggle to survive on the hostile red planet, and he’s very self-entertained, funny and extremely optimistic. Just his presence is exciting and the movie therefor never felt boring. He struggles with these almost impossible tasks, we see him develop through his ups and downs on his journey back to the blue planet. There’re much human traces like humor, attachment and morality, and it really is about one character, left alone by himself. So uniquely done!\r It’s not a movie that’s action-packed nor high-paced; it’s a well preformed and well written art of work and that really is entertaining. It’s one aspect that might result in lost of interest by some individuals, but there are some incredibly great wow-and-high-paced moments where you really want to be there, and experience it by yourself! The 3D is better than the average movie, but doesn’t add anything extraordinary to the experience. But something that totally did is the soundtrack; so fitting and baffling to the specific character and moment! But the dialogs might drag the movie down a bit; they can feel forced to the audience from time to time when it comes to facts, etc.\r The plot is not one-dimensional (but sometimes a bit predictable); it covers many characters at different locations (even planets). We have strong leading actors and well visualized characters. One minor concern is that it might have too many smaller roles, they absorb some of the excitement and focus of the movie. It loose some of the magic, especially in the third act. The main characters could also have had a greater attachment, there’s no strong chemistry between them. But these are just minor aspects that could have been even greater, and it really is good movie, even though the ending might be a bit too rushed and could have covered more of the climax.\r ’The Martian’ might not be flawless but it got a strong and funny lead from Matt Damon, and very rememberable moments that you should love to experience by yourself. It really is a realistic sci-fi flick full of humor, adventure, optimism and hope. It’s the 2015-Interstellar.\r Personal rating: 8/10\rCritical rating: 8/10"
    },
    {
      "rating": "9",
      "text": "Must watch for any space nerd. Movie is just as good & had a better ending than the book. One of most realistic sci-fi to date. Matt Damon is the first Space Pirate!"
    },
    {
      "rating": "9",
      "text": "Ares III, another group mission of NASA astronauts to the Mars may not have originality in plot due to source adaptation and visual effects not as amazing as Academy Awards winner Interstellar, director Ridley Scott and screenwriter Drew Gooddard still manage to turn it into a successful and brilliant sci-fi. It's definitely not scientifically accurate at all levels due to minor flaws, but the story mainly focuses on the survival skills and rescue efforts which are presented in a straightforward, entertaining, chilling, educational yet inspiring way. The film is surprisingly funny compared to Interstellar and Gravity thanks to the outstanding performance from Matt Damon who delivers the character's positive attitude overshadowing the fear of being a stranded stranger on the red planet, other strong star-studded cast including Jessica Chastain, Jeff Daniels and Chiwetel Ejiofor have solid performances as well as scores composed by Harry Gregson-Williams, not extremely powerful but strong enough to fit into scenes. While it seems to be a rescue mission, the film is able to deliver an important message - regardless the help from the whole world, self-initiation determines the survival opportunity. Overall at a smaller scale and fans perception, The Martian fits perfectly as sequel of 2013's Gravity and prequel to 2014's Interstellar."
    },
    {
      "rating": "9",
      "text": "Don't be surprised if Matt Damon's name comes up during Oscar season since he gives maybe his most compelling performance to date in one of the years best films. The Martian is the perfect mix of Cast Away meets Apollo 13 and marks the comeback from the great Ridley Scott."
    },
    {
      "rating": "9",
      "text": "The Martian is a thrilling journey into the deep space anchored by\ramazing visuals, terrific humor, and great acting. In the recent past Ridley Scott had\rbeen struggling to make a great movie, but he went back to his basics,\rand churned out one of the better Sci-Fi movies not just of this year,\rbut of the past few years. While all actors are good, this movie is the\rMatt Damon show, and he shines as a desperate man stranded millions of\rmiles from home. The film will undeniably be compared to Interstellar,\rbecause the cast and some of the premise are similar, but these are two\rvery different movies. The amazing special effects, and constant\robstacles make this movie truly thrilling. The Martian is my favorite\rof the Space Sci-Fi movies in the recent years, more than Gravity or\rInterstellar. The Martian is truly a theater experience, so see it on\rthe biggest screen you can."
    },
    {
      "rating": "9",
      "text": "A powerful, inspiring and possibly full of future awards story of Saving Matt Damon, in space!\r There's one common message on this year's cinematic experience: if you find yourself at hostile sci-fi world, see Charlize Theron (Furiosa) or Matt Damon for a lovely road trip. The Martian is an uplifting castaway tale on Mars. Brilliantly executed and acted, it's a triumphant story of a man surviving on his wit and sheer positive determination on live.\r The saying \"he might as well be on the moon\" doesn't apply to Mark Watney (Matt Damon) as he's stranded on a world much farther. After a critical failure on space mission leaves him alone on Mars, he must overcome multitude of problems to keep himself and the hope of rescue alive.\r For a desolated story, The Martian is incredibly inspiring. Much of it charm depends entirely on Matt's performance, his effort keeps the movie light and humorous even though tougher times linger just steps or miles away. It probably wouldn't have worked with lesser actor, not just with the dialogues but physical transformation. He brings strangely infectious joy instead of constant wallowing. The positive and identifiable attitude of his character will translate well to audience.\r This is not only a solo mission since there's also perspectives of people working on our planet. The assembly of cast is very good. From Chiwetel Ejiofor, Sean Bean, Jeff Daniels and many others, these personalities are highly memorable. They make the arduous and lengthy process of space travel into an engaging spectacle. While not everyone has contact with the solitary astronaut, they convincingly unite on the larger-than-life endeavor.\r Visual is amazing. This is not the beast Gravity was, but when it gets going, it's utterly beautiful and also bizarrely captivating since Mars is a barren soil. At times it appears that Matt Damon walks across red desert which is so strange but still give the feeling that it probably exist somewhere. The amount of details on science is amazing, it feels like an inviting project or a trip audience could take with these characters. The bits of pop culture reference from comics or movies are icing of the frosty cake.\r The Martian is what a movie should strive to be, an amazingly told story of men against their predicament. It's incredibly inspiring, highly enjoyable and simply unworldly."
    },
    {
      "rating": "9",
      "text": "A magnificent and surprising film. The performances are nuanced, the storyline is utterly compelling and the script is superb. The cinematography is sublime, and seeing it in 3D was worth the extra cost, and it is this aspect of the film that elevates it to be a 'must see in the cinema' experience. This is definitely a contender for best film of the year. 9.03/10"
    },
    {
      "rating": "8",
      "text": "Ridley Scott finally regains his footing with - of all things - familiar territory. \"The Martian's\" triumphant air and superior visual prowess, in conjunction with Matt Damon's unflappably charismatic performance, makes for something truly special."
    },
    {
      "rating": "9",
      "text": "Never a dull moment. The Martian has a great blend of tension and humor, and if you're a science geek, this movie will be a treat. Every problem encountered is solved through logic and reasoning. I would say the only problem I had with the film were in those moments the movie was trying to hard to be funny. Several of the jokes felt forced, which made them fall flat and even awkward at times. Other than that, this movie is one of the year's best so far."
    },
    {
      "rating": "0",
      "text": "I've never found myself disagreeing with the popular opinion so greatly - but this mess of a movie was really quite bad.\r To begin with this movie is tonally incoherent.  I was unsure if it was trying to be a serious Sci-Fi movie or a comedy.  It has a promising set-up of potentially being Cast Away in space but I never felt the drama of the situation.  This is  probably because the majority of the drama is being told - not shown and its done  uninterestingly by Matt Damon.  The cast would seem better fit for an SNL movie - but here the comedy is groan-worthy.  Also - this movie has very odd product placement.  At one point Matt Damon whips out a bottle of Heinz Ketchup circa 2015 with no explanation why they would leave him with no food but some how be able to have Heinz on board.\r This movie was off the mark in almost every category but it's worst offence was taking an interesting premise and cheapening by having it described through needless narration.  They either thought the demographic was too stupid to understand what was going on - or they wanted to save money by not filming the action.\r TL;DR don't watch this unless you want to see how a movie with a good premise can be rendered utterly mediocre"
    }
  ],
  "recommendations": [
    "interstellar",
    "arrival",
    "chaos_walking",
    "master_and_commander_the_far_side_of_the_world",
    "contact",
    "the_social_network",
    "mortal_engines",
    "in_the_heart_of_the_sea",
    "moon",
    "serenity",
    "sunshine",
    "annihilation",
    "the_monuments_men",
    "stargate",
    "avatar",
    "close_encounters_of_the_third_kind",
    "upside_down",
    "cloud_atlas",
    "ex_machina",
    "the_hunger_games_catching_fire",
    "deepwater_horizon",
    "coherence",
    "elysium",
    "inception",
    "the_big_short"
  ]
}