{
  "id": 4529,
  "title": "The 33",
  "starring": [
    "Antonio Banderas",
    "Rodrigo Santoro"
  ],
  "runtime": 120,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "Based on the true story of the collapse of a mine in San Jose, Chile—that left 33 miners isolated underground for 69 days.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hpXkIuAlIlcNYACRE2MssxnHvZQ.jpg",
  "categories": {
    "plot": 7.0476190476190474,
    "acting": 7.785714285714286,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 9.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "A solid entry of cinematic biography from ordinary men, much more accessible than, yet equally grounded in reality as the collapsed mine.\r Taking a true story event as theme of a movie can be challenging, audience who followed the actual incident might already know the story. However, The 33 delivers a sincere and detailed account without being too overbearing. On contradictory, it has a fairly lighthearted tone to the whole affair as to present it with poise and optimism instead of melancholy.\r Some might already know the tale of miners trapped in Chile mine five years ago. The situation spanned for about two months as the rescuers tried to dig their way through the collapsed mine, while the world interacted with the miners via most unusual webcam chat. The movie captures the spirit of the event, both its tragic moments and surprisingly serendipitous festive atmosphere.\r The visual is pretty nice, not many viewers realize in what space the miners were trapped. The film makes a fairly meticulous depiction, not just a simple pit hole, but more of a subterranean barrack. View of the underground settlement and outside desert are presented with fine cinematography. It's a refined look although still identifiable without being too glossy.\r This is a character driven story, which gives ample opportunity for the actors to shine. Antonio Banderas as Mario is a convincing leader role. He's a veteran actor who knows how to deliver reaction in a realistically rugged manner and makes it presentable for viewer. Lou Diamond Phillips, James Brolin and many other round up the crew of the miners while Rodrigo Santoro plays as the Laurence, the representative of government who is more optimistic and considerate than when he donned Xerxes’ role.\r These miners are rough men, working in extreme condition, but the most drama comes from when they must face with the anguish and desperation as they realize they might face their own demises. It humanizes them more than the blue collar label ever does. While it may have several dramatic moments, the movie keeps an overall positive tone, evidently shown with a rather merry soundtrack.\r The 33 is a compelling story of ordinary men in extreme situation, it is above all a tale of hope, much more accessible than, yet equally grounded in reality as the collapsed mine."
    },
    {
      "rating": "8",
      "text": "The movie is predictable and the acting is not always good.The story had without a doubt,a Hollywood touch that didn't happened in real life but, it was still entertaining and interesting enough to at least make you care a little."
    },
    {
      "rating": "7",
      "text": "I remember this cave in from the news.  But this movie gives the back story, which most \"Americans\" won't believe.  How can the boss send men down into a dangerous mine?  How can a company leave 33 men down below and not try to rescue them?  How can the government just watch and do nothing?  Couldn't happen in this country, but this is Chile.  Most Americans don't realize how bad it is in other countries, probably cause they're looking out from the tour bus and the 5 star hotel.  I wonder how many people see the parallels with our big business, the 1%, and our recent government decisions, or lack thereof."
    },
    {
      "rating": "5",
      "text": "\"The 33\" is annoyingly mediocre, painfully predictable, and grating dialogue. It has some shining moments and Rodrigo Santoro gives a great performance."
    },
    {
      "rating": "4",
      "text": "The story is fascinating. The film is inherently problematic. For one thing, as is noted at the end, the real miners who were trapped underground made a pact not to discuss parts of their experience with the rest of the world, which is reasonable but also means that anyone telling the story is forced to make up a lot of what happened. And frankly, they've Hollywood-ized a lot of plot elements that they didn't have to, which cheapens the reality of the historical events. Eyes will roll.\r For another, as the film notes at the beginning, people die in mines all the time. The fact that one group of miners was saved under extraordinary circumstances (and at extraordinary expense) is great news for them and their families, but should not blind us to the overall picture regarding the safety of mining practices and the failures that created the disaster in the first place.\r Also, it's silly that the film is in English. We could have handled subtitles.\r As it stands, this is a mildly entertaining movie at times; the surface elements are often more interesting than what happens underground. It should serve only as an afternoon's distraction or a primer to learning about the real story."
    },
    {
      "rating": "6",
      "text": "Based on the true event in 2010, this claustrophobic film about miners who are trapped underground surprisingly starts off straight to the disastrous incident but buried by its own formulaic plot. It offers the same horrific experience just like in \"127 hours\"; the underpaying jobs and risks faced by the miners, the setting and cultures in Chile, the fear and trapped in the mines, the rally, political plays, media propaganda and the rescue attempts are all included well throughout the story. However, screenwriters squeeze too much in the film, the background and life events of each characters seems to lose engagement, causing imperfect character developments and less inspiring. Scores from James Horner are trying to remain the tone of the film but it starts to deviate into lighthearted due to unnecessary scenes, making audiences wonder the existence of real tragedy. However, the film still offers a thrilling climax and satisfyingly ends in a beautiful note even though it should have just focused on the disaster, survival skills and rescue operations."
    },
    {
      "rating": "6",
      "text": "Personalmente no disfruto este tipo de trabajos basados en la desgracia de la vida real porque se cual será el final, claro que hay excepciones pues encontramos obras maestras. Los 33 no es el caso. Yo vi potencial en esta película, no es tan mala, pero pudo aprovecharse mucho mejor. Primero que nada, si el suceso original ocurrió en Chile, deberían usar actores chilenos no? Pues al parecer no, quisieron buscar actores Españoles y Mexicanos. Incluso cuando tienes a los 33 mismos que antes estuvieron atrapados en la mina disponibles para actuar, no se quieren usar. (tal ves se justifique porque no son actores, espero) O mínimo usar un reparto que se parezca a su contraparte en la vida real. Es largamente innecesaria, quieren meter mas y mas detalles que no servían y a nadie le importaba. El gobierno es inútil, tardado y supuestamente sabe hacer las cosas pero no tienen los materiales. Asunto tras asunto llegan a desesperar a tal modo de que no es lo suficientemente fiel, que quiere poner un asunto que fue una desgracia después de un tiempo como un lujo. Simplemente es una película que da una idea del asunto, pero no la da correcta del todo, si tiene actualmente esa calificación, es porque es lo que merece."
    },
    {
      "rating": "7",
      "text": "Most people will recall this incredible news story from 2010, when 33 miners were trapped for 69 days before being rescued. This cinematic retelling effectively captures the details of this incredible situation, while attempting to establish emotional connections with a handful of the men. The depiction the dire challenges is presented with dramatic incredulity and the personal moments are mildly involving. It's more fascinating than gripping, but still a well-told story. One weird Hollywood tradition still holds: this takes place in Chile, but everyone speaks English with Spanish accents. To make things even more confusing, there's one Spanish-speaking reporter and all the writing is in Spanish."
    },
    {
      "rating": "9",
      "text": "When the mountain swallowed the 33 men alive...\r This is one of the greatest movie of 2015, not because of twists and turns, but pleasingly illustrating a true disastrous event. So don't listen to the negative remarks about it, ignore the low scores and just see it already. Like any flick, it definitely had a few flaws, if you focus it properly, you won't be distracted for those faults in the movie. All the above, bringing that 2010's unfortunate mining tragedy on screen was a success, that's the very important.\r It was not a Marvel's superhero movie or a Disney-Pixar's cute animation that has its own large fan base to support. It is not even a Hollywood, but English language movie from Chile. So that's where the critics steered common people in a wrong direction. But as I'm a movie fanatic, I totally recommend it for all. This was not a simple disaster drama, but had a good amount of emotions, suspense, nationalism, light laughs, brotherhood and ultimately a good entertainment.\r It is no ones biopic as it was categorised. It is a single real incident based movie, especially the book 'Deep Down Dark'. All the characters had a fair scope and portrayed according to story growth. But it opened by introducing only a few main characters and other supporting ones out of 33 whose story this was based on.\r On an ordinary day, those miners started their day as usual. For some, it was their first day and for others it was the final days of their job, but everyone had their own reasons to go into the mountain's deep down. But what they did not know was the mountain was tired of being opened its mouth for the centuries. Finally, she decided to close the mouth by swallowing the 33. But those men stood against the chances they had and fought for their survival, which was finely told in this movie. What happened to them, how it concludes was narrated still the last minute with suspense.\r \"That's not a rock, that's the heart of the mountain.\rShe finally broke.\"\r To me there was no mystery left in the main theme, because when this thing happened 5 years ago, I closely followed the event. So I know how it ended and I knew how the movie would end, but surprising parts were the families, media, politics and all the other surrounding events composed together which was a quite fresh perspective that helped the movie to help shape well. So I am telling you, if you think you know this story, you probably wrong on that assumption.\r If I want to discuss about negative, that would the language of the movie. I am very-very disappointed with that choice, it must have been in the Spanish. Those Chilean characters speaking English was kind of jokes with their funny accent. It did not work for me, because Chile never was a commonwealth member. If Indian, Malaysian or Sri Lankan character speaks English would make sense. I know they wanted it to be an International product, so did they chose Internationally recognisable actors like Antonio Banderas and Julliette Binoche. Yes, on that aspect it paid off well.\r The movie almost got me on its emotional side, I did not show it physically, but surely I felt deep inside me. It also triumphs to tell how important the families are. They are the first ones to react if you are in a real danger to rescue, to shed tears, to standby on the scene looking for your return and to hug tightly. The movie might be categorised in a couple of genres, but it had other mixed ingredients as well. For example, the scenes called the last supper and the circus outside the rescue site. Movies are not all about perfection, sometimes demonstrating its purpose decently would do good enough. So on that facet I got no point to say to skip it.\r 9/10"
    },
    {
      "rating": "7",
      "text": "I don't think this is the best movie they could make, but it will break you down to tears, probably. A movie about ourselves, and about not losing Hope."
    },
    {
      "rating": "7",
      "text": "Blessed with a talented cast, interesting story-telling and an efficient direction, this film becomes one of the most succeful of the year. Not also for this real-life story, at least. It's worth to understand the lessons of the human history with this good film, which people will like to watch."
    }
  ]
}