{
  "id": 2848,
  "title": "The Brothers Grimm",
  "starring": [
    "Matt Damon",
    "Heath Ledger"
  ],
  "runtime": 118,
  "genre": [
    "Adventure",
    "Fantasy",
    "Action",
    "Comedy",
    "Thriller"
  ],
  "description": "Folklore collectors and con artists, Jake and Will Grimm, travel from village to village pretending to protect townsfolk from enchanted creatures and performing exorcisms. However, they are put to the test  when they encounter a real magical curse in a haunted forest with real magical beings, requiring genuine courage.",
  "releaseYear": "2005",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/v6J7QGCSrtvwvqAt6783BbO3h61.jpg",
  "categories": {
    "plot": 5.2105263157894735,
    "acting": 5.785714285714286,
    "ending": 5.4,
    "soundtrack": 5.0,
    "cinematography": 5.666666666666667,
    "familyFriendly": 6.0,
    "funny": 6.181818181818182,
    "action": 6.125
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Plot a little cliche, but a curious and interesting history. Maybe it was the kind of script that Hollywood directors have repeatedly hit the hammer. The performances are convincing and the scenery is beautiful."
    },
    {
      "rating": "5",
      "text": "For those who likes Grimms is good, for those who don't like them is a kinda boring. I think the story showed by a sensational way the fancy world of brothers Grimms."
    },
    {
      "rating": "6",
      "text": "The Brothers Grim may have horrendous CGI and a clunky plot to follow through, but the film was quite enjoyable and became okay at best. I did enjoyed Damon and Hedger's performances as the Grimm brothers, where they really stood out well for the characters they had to portrayed. The other performances however were okay. I also liked how many fairytale motifs were presented in such morbid conceptual scenes, but I would agree with others that the tone and dialogue felt campy, stale and out of context for something like the brothers Grimm and their fairy tales. The tone definitely felt like the film was trying to approach too many audiences but really cannot stick to one. The Brothers Grimm does not fully Live A Happily Ever After for this written review, but that does not mean it is a bad popcorn flick to rent."
    },
    {
      "rating": "0",
      "text": "This is a terrible terrible movie!  Tied with Hitchhikers Guide To The Galaxy as the worst in the world in my opinion....this has absolutely no substance, no underlying plot, and is in NO WAY faithful to the original tales...this movie is practically a parody of itself just as hitchikers was.  Do not watch this movie unless you want to get trolled by stupidity and utter, utter ****"
    },
    {
      "rating": "5",
      "text": "its pretty much a retooled Baron Munchausen scipt with excessive dialogue, annoying characters, threats of execution, a remote location under siege. they shouldve just focused on building the mystery aspects rather than the crappy sleeping witch story. Heath ledger needs to shutup while Matt Damon's character needs to get crap beat out of him."
    },
    {
      "rating": "8",
      "text": "Sometimes a little difficult to follow but very impressive visually, and yes, it does have a coherent storyline."
    },
    {
      "rating": "5",
      "text": "My favorite moment in \"The Brothers Grimm\" is when director Terry Gilliam seems to be poking fun at the intense farewell embrace between Boromir and Aragon during the former's death scene in \"The Fellowship of the Ring\". It's very funny. It stirred me out of my waking coma. To me, it's a great miscalculation to present the Grimm fairy tales as factual (within the diegesis), because that makes the brothers mere academics (as collectors of attempted child murder stories) rather than the fountains of imagination that they certainly were. It's a good idea to introduce the brothers as charlatans, but rather than present them as period piece ghostbusters, their occupation should be shown as a desperate means to support their fledgling writing career. A collection of enchanting fairy tales shouldn't be turned into a loud action film. \"The Brothers Grimm\" makes Gilliam's lost opportunity to bring Don Quixote to the screen seem doubly tragic."
    },
    {
      "rating": "1",
      "text": "it pretty much sucked.. had potential.. bringing the fairy tales to life in a dark fashion, but it completely flopped. wasn't remotely funny."
    },
    {
      "rating": "7",
      "text": "Because I was in it, I'd say I really enjoyed watching it all, but from someone elses view, I gotta say it was OK. The filming was great though, I really love Matt Damon."
    },
    {
      "rating": "4",
      "text": "So much potential gone to waste. Occaisonal spots of Gilliam's ingenious directorial flair get lost in a disjointed story line. The film seems to swing between childrens fantasy and attempts at more adult horror, leaving it lost some where in the middle. I can only assume Hollywood money men reigned in Gilliam to keep the age cert. down, hence this confused state the film exists in."
    },
    {
      "rating": "8",
      "text": "A little crazy, a little wacky...like i would expect from gillaim. but overall it was a fun ride and far more entertaining than most of the crap that came out this summer."
    },
    {
      "rating": "0",
      "text": "Oh My God! It was that awful. Stay away."
    },
    {
      "rating": "7",
      "text": "A good summer movie! Humorous and amusing! Acting was great and I thought it was fun!...."
    },
    {
      "rating": "3",
      "text": "This was an ugly movie, both in tone and visualization. About the only thing attractive in the movie were the horses. There was no sense of wonder, nothing to admire or root for and what passed for comedic relief was irritating and tiresome--not funny. Rather than exploring why German folk tales were so dark, the movie seems to enjoy wallowing in a squalid portrayal of its story."
    },
    {
      "rating": "3",
      "text": "This mess should never have made it into reality. A fairy tale it should have remained. And a forgotten one at that. A complete waste of time."
    },
    {
      "rating": "3",
      "text": "Looks good, when not let down by dodgy cheap SFX, but ultimately a mess."
    },
    {
      "rating": "3",
      "text": "Might've been halfway decent.....Except it wasn't linear or fluid in any way, form, or fashion. As a matter of fact, it was as if Terry Giliam just put the entire film into a shredder, mixed it all up, and taped it back together expecting it to be in order. The visuals were waaaaaay over the top, and looked fake and hokey. Like I said....it would have been a great story...if there \"WAS\" a story. 3 out of 10."
    },
    {
      "rating": "10",
      "text": "The most underrated film of the year."
    },
    {
      "rating": "1",
      "text": "I saw it because I am a Gilliam fan and afterwards, decided that it is best to not think that Terry Gilliam was in fact involved with this... Storyline made little to no sense... French accents were true in that they were completely incomprehendable, and the \"love\" storyline was just ludicrous. I would recommend you not see this movie unless you can see it for free."
    },
    {
      "rating": "8",
      "text": "This was a fun, exciting movie. While there have been some complaints about the script, the movie takes us on a ride through the haunted forest and it's mysteries that shows us that fantasy might be real and that cynically dismissing wonder won't lead you to fulfilled life. The visuals were another satisfying look at Gilliam's work as the beautiful opening titles foreshadow. This movie will give you as much enjoyment as you have the ability to suspend disbelief and enter this enchanted land."
    },
    {
      "rating": "0",
      "text": "How do they make these bad movies? Is there a magic formula on how to piss the public off? Avoid at all costs."
    },
    {
      "rating": "3",
      "text": "A confused mess. oy-vey. Such a shame... with just a little effort they could have made this into a really mediocre movie. Instead it was just a mess. At least when the curse was broken they all became Jewish and danced the hora!"
    },
    {
      "rating": "8",
      "text": "An underated movie to be sure. After seeing all the bad reviews I had to go see it. I found it entertaining, a little funny and occasionaly a little scary. The plot was easy enough to follow if you pay attention to what is going on. Anyone expecting a \"normal\" movie from Terry Gilliam has obviously not seen his other movies. I enjoyed this movie more than most of the junk Ive seen this year so I gave it 8 stars."
    },
    {
      "rating": "6",
      "text": "My my, what a cackle of negativity we have here! people, please! were you really expecting a fantasy film on par with lord of the rings? while i agree that jackson's film raised the bar, let's not forget that this is gilliam, and this is hollywood. so the story was a little messy and it didn't quite hang togethe; neither, as some have said, did it entirely fall apart. and if you were expecting a history lesson from this director, well ... it was a fun popcorn movie with nifty special effects, and that was all it ever claimed to be. so for all you naysayers who wish you hadn't \"wasted your evening\" i say: next time, rent a classic!"
    },
    {
      "rating": "10",
      "text": "This movie is TIGHT!!!"
    },
    {
      "rating": "9",
      "text": "Much, much better than most critics would lead us to believe. Also quite frightening (but in a good way)... don't bring the kiddies to this one."
    },
    {
      "rating": "10",
      "text": "Awsome!"
    },
    {
      "rating": "9",
      "text": "Trust Terry Gilliam's ability to con and bring fantasy to the audience in the same way we have fantasized and conned little children to uphold the Grimm Brothers' tales as sweet and cool bedtime stories. Absolutely a very creative and fun adventure story in which the two famous brothers are seen living out their own fairy tales! It's a joy to be fantasized by fantasies."
    },
    {
      "rating": "8",
      "text": "I loved this movie. I loved the lush, old world storybook painterly look of each scene that reminded me of my favorite illustrators. I loved the lovingly whimsical costumes and the delightfully caricatured characters. that reminded me of the original Wizard of Oz. Several of the characters made me laugh out loud without saying a word. I loved the delicious dark 'scary' scenes...the kind that used to titillate me as a kid. It's wit and humor and storybook moral and morale were wonderful. If it fell off the breathtaking punch of the Rings trilogy and the like, it was only because it was generously faithful to the whole Grimm's Fairy tale feel. I was happy it didn't try for blockbuster overamped action adrenalin rush or punch in the gut 'grit' or cloyingly sweet fluff. I had a great good time every minute that left a clean taste in the mouth. I was surprised and pleased by Damon's and Ledger's understated performances that stayed honest and well balanced within the tapestry of the movie. I'd give it 9 stars."
    },
    {
      "rating": "2",
      "text": "I'm usually easily entertained, but this movie was so awful I felt compelled to voice my opinion. I was only able to follow the story line thanks to the summary on the case cover. The characters, acting, plot sequences... nothing worked for me. Even getting to look at Matt Damon didn't help. Don't waste your time or money on this one."
    },
    {
      "rating": "0",
      "text": "I walked out it was so bad. Rather than scary it was laughable."
    },
    {
      "rating": "2",
      "text": "Pretty bad. Just short of terrible. It was completely directionless, completely lacking focus. It had something like a plot, but somebody forgot about it along the way. Sloppy, messy, and not bad enough to be fun."
    },
    {
      "rating": "9",
      "text": "Everyone that worked on this film seems to be having a bold, terrific and heartfelt effort. I love every Gilliam film ever made. This one is right near the top."
    },
    {
      "rating": "7",
      "text": "Once upon a time there was a filmmaker named Terry Gilliam whose last would-be effort, a gargantuan movie epic about Don Quixote, fell prey to all manner of evil spells, wicked elves, ogres and gremlins that prevented it from ever seeing fruition...but DID provide a fascinating how-it-didn't-get-made documentary. Gilliam's film work is that of an uncompromising independent spirit who often gets big budgets but calls his shots the way he sees 'em, like it or not...with predictably variable results that range from ballsy and bracing (Brad Pitt's singularly unhinged work in 12 Monkeys, the unexpectedly downbeat finale of the kiddie fantasy Time Bandits) to almost totally unendurable (Johnny Depp's obnoxious Hunter S. Thompson in Fear and Loathing in Las Vegas, who spends two hours I'll never get back again making sad, miserable people he meets on his drug-addled odyssey even more sad and miserable). That's why it's a little disappointing to see Gilliam reining himself in, however slightly, for the Weinstein boys who, despite their loud pronouncements over the past decade about encouraging independent film, tend to sit on their directors (Tarantino, of course, being a rare and obvious exception) as tightly as Louis B. Mayer did on his during the 1940s. A film about the famous fairy-tale compilers and retellers Jakob and Wilhelm Grimm seems like a natural fit for Gilliam, but he's hobbled by a rather witless, pedestrian script by Ehren Kruger (whose other work, such as Arlington Road and Reindeer Games, suggests that he's a lot more comfortable dissecting present-day paranoia than from the past) that refers to classic stories ranging from Goldilocks to Snow White to Little Red Riding Hood so haphazardly and perfunctorily that you'd swear he was working off a checklist, and by title performances by Matt Damon and Heath Ledger that are completely submerged by the surroundings and spectacle. Ultimately, none of this matters. As Gilliam has repeatedly proven since Monty Python and the Holy Grail, he is and remains a dazzling visual atmospherist and stylist who does peasant squalor as compellingly as he does patrician sumptuousness. Simply put, there's nobody around who films grass, dead leaves, wood, thatching, dirt and mud more fascinatingly than Gilliam...and I'm not being sarcastic in the least; it's really hard to do! In fact, The Brothers Grimm may be the only 2005 film besides Robert Rodriguez' Sin City in which every single frame is...well, suitable for framing. (In fact, I'd even rank Gilliam slightly higher than Rodriguez in this category because The Brothers Grimm is nowhere near so computer-dependent.) This movie's amazing, sepia-dappled cinematography and design makes the fact that we'll never get to see Gilliam's Quixote film even more regrettable, but even Gilliam running at half-speed here should be enough to ensure that The Brothers Grimm, though a box office disappointment, should live happily ever after as a cult success."
    },
    {
      "rating": "5",
      "text": "Terry Gilliam tells a story in a very unusual but captivating way. He has the power to turn nothing into something. And with the Brothers Grimm he almost is able to make nothing into something great with the help of two very talented actors. But alas Mr.Gilliam falls just short and makes a movie that is plainly mediocre. The ending provides the largest dissapointment of the entire movie."
    },
    {
      "rating": "5",
      "text": "Over the course of his career, director Terry Gilliam has earned a reputation for making adventurous and greatly imaginative films. Setting his sights upon the fairytales created by the Brothers Grimm and a story of the two brothers as con artists who encounter a true fairy tale that inspires their books, it certainly seems on paper to be a perfect match. In many respects, the final product demonstrates just how at home Gilliam is at with the inventive nature of the fairy tales that instill the film with a great sense of wonder to accompany the incredibly dynamic and imaginative occurrences in the plot. Unfortunately, the film is just missing that it factor. It has everything there, but lacks that defining quality to make this another classic from Gilliam. Instead, it winds up being nothing more than a typical modern day blockbuster that wildly disappoints.This missing factor is really what drives the film into feeling incredibly typical of mid-2000s Hollywood. In his best works, Gilliam's films have a few qualities to really define them as excellent adventure romps or imaginative explorations of the world. This defining quality is a great flow. With a light touch, Gilliam's films flow by nicely, never leaving you time to really notice the insanity on display and instead allow yourself to get swept up in the magical whimsy of the film. By the end, the worlds he creates are brimming with life, having scooped up the viewer and dropped them into this magical world of imagination. In The Brothers Grimm, however, every cog in the wheel is visible. Every imperfection. Every detail. Every bit is noticeable and the whimsical nature of the events is ruined. The sense of wonder is dispensed in the name of hitting every beat with no flow or sense of natural progression. Instead, it is an outline in film form with no connecting thread to make it all work. It is a Terry Gilliam that feels like an imitation of old school Gilliam, lacking the heart or grace with which he makes his films. Possessing every detail that a Gilliam film would have a decade prior, but lacking the purpose and wonder, The Brothers Grimm is a stiff production.This stiff nature is reflected in the comedy, which is never less than clunky. Matt Damon and Heath Ledger are a joy to watch in their respective roles as the Brothers Grimm, but the lack of flow and heart provided by Gilliam finds its way to the script and dialogue. In his best works, any one-liners would work because they are simply arising naturally in the course of the dialogue. Here, it feels as if there is an emphasis on the comedy or an extra bit of punctuation added on that makes it feel tacked on and greatly unnatural. Immediately after any scene where a telegraphed joke falls flat or elicits a small amount of air to escape from your nose, you can feel Gilliam sitting in the seat next to you saying that he thought that part was hysterical. It certainly can be a funny film at times, but just as with its plot, the film's humor is often clunky and forced.With regard to the story, the film is certainly mixed. Its sibling relationship is nice, but obvious. Setting it up with the two fighting as young boys when Jake (Ledger) sells a cow for beans, leaving the family with no money to heal their sister, it is always obvious how the strike will be resolved. Embracing magic and fairy tales in the world in direct opposition to the French government, the men will fight again before Will (Damon) realizes that Jake has been right all along: there is magic in the world. The story itself is a bit clunky as well with some obvious beats along the way and a shocking lack of originality. This is not a typical Gilliam film where a new and wondrous world is around every corner. There are moments like this, such as in Mercurio Cavaldi's (Peter Stormare) torture danger with cool torture devices and an orchestra to accompany the torture, but other than this one, the film is largely by-the-numbers. It is hard to hear Gilliam's voice amidst the sea of cliches and typical blockbuster events with the men being saved by conveniences (why did Will not get his throat cut), convenient and timely help, and squaring off with a comically awful Jonathan Pryce as the chief bad guy featuring a terrible French accent. Luckily for Pryce, he is not the only one with a bad accent here, as Peter Stormare is similarly comically bad with his accent. Together, they team up to create an opposing force who are demonized for not believing in fairy tales, even though Will himself does not believe in fairy tales and the duo con people by exploiting their hysterics related to fairy tales. So, by the end, it is clear that they are bad just because the film needed a bad guy, which is never true. If a film could come to fruition and reach the end without the bad guy being needed for the climax, it did not need that bad guy. The antagonist here is the Mirror Queen (Monica Bellucci), not Pryce's silly French general"
    },
    {
      "rating": "5",
      "text": "This film is based on the tales of the Grimm Brothers, but also makes a completely fictional portrayal of the brothers who, in real life, were German poets, scholars and linguists, who dedicated themselves to collecting traditional fables from the center of Europe. So the first step in understanding the film is to realize, from the outset, that its pure fiction, based on the mere existence of these two brothers. Here, they're two gamblers, who make money cheating the villagers, casting out witches and demons that don't exist. So their first reaction, when they're called upon to investigate a truly magical phenomenon in which several girls have disappeared, is of disbelief, thinking that they're dealing with an elaborate scold.The screenplay is clever, in the way it approaches Grimm's fairy tales and rebuilds them, but it lost from the middle, with some ideas and options looking absurd. Equally positive was the performance of Matt Damon and Heath Ledger in the lead roles. The two actors are versatile, strong and worked well together. However, the same cannot be said of Lena Headey, who seemed to me a bit artificial and cliché. Peter Stormare is the most humorous actor and the most remarkable moments of humor are made by his character, an Italian torturer at the service of Napoleonic officials. Jonathan Pryce is the French general and was perfectly capable of becoming contemptible. Good costumes and sets, clever cinematography, good use of colors and light and shadow games make the film visually appealing and beautiful.So, this movie is good and has several quality values. But the flaws in the story, the several moments when the plot is lost and becomes idiotic, overturn the attempts of this film to become truly iconic."
    },
    {
      "rating": "5",
      "text": "This movie has some major problems but there is an offbeat quality I can't help but love. Its not a good movie but also not bad, its just okay. The production design is fabulous and I love towns and rooms and sets built. The costumes are off-putting to say the least but there is a gross fantastical aspect about them that fits into the world. The major plus for The Brothers Grimm though is the leads in Matt Damon and Heath Ledger. These guys pop and are so likable and add so much to the story, they almost save the film alone. This is also a case of a brilliant director who had no limits and had all the money he wanted. It really shows and the film was a complete mess because of it. The cinematography was awful, the script was so clogged and plot hole filled I was being driven crazy, and the side characters were so annoying and awful I can't help but entirely blame Gillian. This film had so much potential its insane and there are some really cool things to take inspiration from but at the end of the day its just mediocre."
    },
    {
      "rating": "6",
      "text": "The Brothers Grimm The Brothers Grimm The Brothers Grimm The Brothers Grimm"
    },
    {
      "rating": "6",
      "text": "It's a good movie, but they have a horrendous CGI. Actors is good, scenery is very good, CGI is terrible. But they have a good history."
    },
    {
      "rating": "10",
      "text": "khjguhihuggdtfufyyufigughmmnbbvvccxxzzaaassssdddfffggghhjjjlllopuiouuyyttrrefygjghfjhjguhufygufyhjguihihihihydfj"
    }
  ],
  "recommendations": [
    "the_nutcracker_and_the_four_realms",
    "the_bfg",
    "the_ballad_of_buster_scruggs",
    "alice_through_the_looking_glass",
    "maleficent_mistress_of_evil",
    "maleficent",
    "reminiscence",
    "hugo",
    "okja",
    "colossal",
    "color_out_of_space",
    "victor_frankenstein",
    "bumblebee",
    "king_arthur_legend_of_the_sword",
    "the_green_knight",
    "a_simple_favor",
    "the_kid_who_would_be_king",
    "inception",
    "us",
    "suburbicon",
    "upside_down",
    "pan",
    "terminal",
    "fantastic_beasts_and_where_to_find_them",
    "alice_in_wonderland"
  ]
}