{
  "id": 2901,
  "title": "The Descent",
  "starring": [
    "Shauna Macdonald",
    "Natalie Mendoza"
  ],
  "runtime": 99,
  "genre": [
    "Adventure",
    "Horror"
  ],
  "description": "After a tragic accident, six friends reunite for a caving expedition. Their adventure soon goes horribly wrong when a collapse traps them deep underground and they find themselves pursued by bloodthirsty creatures. As their friendships deteriorate, they find themselves in a desperate struggle to survive the creatures and each other.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mxFPI4KYBk5ri9cPteIS8jiDFgj.jpg",
  "categories": {
    "plot": 6.863636363636363,
    "acting": 7.074074074074074,
    "ending": 5.111111111111111,
    "soundtrack": 10.0,
    "cinematography": 8.5,
    "familyFriendly": 3.0,
    "funny": 10.0,
    "action": 7.538461538461538
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Positive: The Descent is scary!\rNegative: The Descent hasn't a good sophisticated story.\rThis will entertain you but this wont haunt you for days or weeks like other movies!"
    },
    {
      "rating": "5",
      "text": "Eh, it wasn't bad at all. But it certainly wasn't all the critics made it out to be. Jumpy, sure (and it did this well...for the first hour or so...), but then it just devolves into one fight after another. And by the way...are Sarah and Juno Cave Tai Kwon Do experts or something? The Gollum ass-kicking got old quickly. They can't even walk forward without scraping against something for the first hour, and then suddenly there are whole underground fighting chambers? I didn't buy that. Great performance from most of the cast (Juno was overacted), decent concept, yet another ambiguous is-she-or-isn't-she Hollywoodesque ending. I would have felt more fulfilled if that logging truck had just taken Sarah's head off right after she blew cookies. That would have been as merciless and grim as this was supposed to be."
    },
    {
      "rating": "9",
      "text": "If no one in space can hear you scream, neither can underground. Nothing healthier than a horror movie that bets on a fresh idea and that knows how to convey the anguish suffered by the protagonists until the last minute, with an ending that makes the hair on the back of the neck stand on end. To see at night and with the light off."
    },
    {
      "rating": "6",
      "text": "The thrilling atmosphere is succesfully installed. The idea is very well thought, however I feel like it could have been developped a bit more. Still, the viewer is kept on the edge of his seat. Jumpscares are a big part of this movie, but maybe a bit too much sometimes it feels like the movie relies too much on it."
    },
    {
      "rating": "10",
      "text": "The Descent is extremely intense and unpredictable with a dark and original story. It is brutal and terrifying, with chilling action sequences, plus that you will remember the movie for sometime, it is a decent thriller that can be one of the scariest and best horror movies ever made. (The movie is not for anyone who have claustrophobia)"
    },
    {
      "rating": "3",
      "text": "I am actually amazed to see how much people liked this piece of c8ap. Not scary at all."
    },
    {
      "rating": "2",
      "text": "Ok, what can I say? First, that I am puzzled...I just cant get how people think this is the 'best horror movie ever' , a 'classic', seriously? Well, I never felt it.  Classics and good: films like The Omen, Carrie, The Birds, The Exorcist, TCM, and others...this...for God's sake...has to be a joke! I strongly believe his is bad. Incredibly overrated. Many also also say the performances are great. As someone who has worked in performing arts (Mostly in theatre, which is what I truly love), let me tell you that the performances are terrible! At least that is my opinion as someone who has seen a lot of both good and bad acting.When I rented this movie  I expected something different, smart horror, opportune gore. After 25 minutes -that are unnecessarily slow- I started feeling sleepy...30, 40 minutes...well I basically gave up. I don't care if there was gore after, or monsters, or whatever. It is just so frivolous. I felt no empathy for the characters. Not that it was required for this type of film, of course; but there is no real development of their personalities...it is all pretty shallow. The photography was good, and the idea interesting indeed; but that is not enough to make a movie good. Tension? Almost none. If blood is all you want...you will get there, but only  after the first 45 min; have a nap before! For those who do not share my point of view, fair enough; but sincerely, I hoped to watch a decent film, and what I found is something flat, less than mediocre that I will never recommend to anyone  and I have no intentions to watch it again...perhaps I will finish watching the last half.  I shall do that, while I am having a nice glass of a great sauvignon blanc from the  Malbourough region (NZ) and a creamy Tasmanian brie cheese... that I guess, will make it more bearable."
    },
    {
      "rating": "0",
      "text": "I turned off the movie after watching the first five minutes. But, when I looked at the reviews, I thought, if so many positive reviews, then something in this movie should be good. Probably, I need to watch the film more closely. Once again I began to look. Hardly watched 15 minutes more and could not anymore. I looked at another 30 minutes on fast forward and finally realized it was movie garbage. But whence then so many positive assessments? I see the list of reviews of the viewers and I see that one person (BittyR.) put more then 10 absolutely identical reviews at the same time with a maximum rating of 10. A lot of other reviews are put by other people, but for some reason they all look very much alike in content. This is an elementary scam. I think that in the list of assessments of professional critics there is also an element of scam. Apparently in 2006 this was possible. Otherwise, such a high evaluation of this movie-garbage can not be explained."
    },
    {
      "rating": "8",
      "text": "The descent is a smart original horror-action movie about six friends who go to explore an unknown cave somewhere in America. Everything is ok until they realize that in this cave some creatures live. And then the action starts. Before the appearance of the monsters it has suspense and in the beginning it is a thriller  But it becomes a really good horror movie. It has scary moments, and suspense during the whole movie. You will be scared and you will enjoy it. Trust me. The ending was a little strange. I would like to watch the sequel just to see what will happen. I am really curious. In general the descent is a claustrophobic horror movie and I have to say that it is the first British horror movie that I watched and it was pretty good. Thumbs up!"
    },
    {
      "rating": "9",
      "text": "CAVING! NEVER NEVER NEVER NEVER NEVER  NOT EVER!!!!!!! This movie has guaranteed I'm a surface dweller for life! I'm a tough character, not easily daunted, but several fear inducing facets contained within this film had me frozen in wide-eyed terror! Watch it and see if I'm wrong..."
    },
    {
      "rating": "0",
      "text": "There is no point to this film. None of the events have any reason to occur, the main character is useless, all the characters end up in a dire situation because the token retarded yank decided that they should all play explorers and went into a cave system with NO idea what they were doing.  You end up just hoping that they will all die quickly so you can do something else."
    },
    {
      "rating": "7",
      "text": "The Descent is of a rare breed these days, a horror film that is actually relentlessly scary. With a simple premise and nice cast to be picked away at one by one, the film is one of the jumpiest out. The setting is terrifically, creating immense claustrophobia early on. And the film is clever, easing the audience into the monsters, showing them little of the fairly simple-costumed creatures. A few points of darkness, a night-vision camera and just enough violence make the Descent an incredibly fun horror."
    },
    {
      "rating": "8",
      "text": "While the slow pacing may be off-putting to gorehounds expecting a train through the tunnel blood orgy, it does pick up in the final act, with blood for all, and baths of blood to spare! Featuring actresses who previously never showed any commercial or widespread acclaim, they boast their finest acting chops under direction in a flick that rattles your spine and twists your vertebrae one by one, as the minutes tick on. As you slowly watch each character be ripped limb to limb in the faintest lights by darkness, your mind begins to feel emotion as you realize you spent the first near hour actually growing fond of these women and their character development (how shocking for the Horror genre!) While The Descent may not be a classic to be praised for generations to come, it works best at delivering an hour of building tension, before 30 minutes of an relentlessness terror that leaves a bad thought of regret (if viewing the flaw-free director's cut ending.)"
    },
    {
      "rating": "6",
      "text": "Not disappointed. I'm impressed by the idea behind the movie, but not from the whole movie. It felt like 1 hour prologue and 15 minutes action. But I liked the love secret story and the revenge about it, the exploring new cave, because they were a bit crazy adventurers, the monsters. Also the end - plot twist. It was cool definitely. The beginning could be better, perhaps shorter, just to reveal some back story and then right to the action."
    },
    {
      "rating": "10",
      "text": "The best horror movie ever !"
    },
    {
      "rating": "1",
      "text": "What a snore. I actually came into this wanting to see what the big stink of it was but.....I lost interest quickly. Why do so many people jerk this film off? A bunch of young women get into a bad situation. Boring. They encounter monsters. BORING. They're blind and most of the fights are in pitch black darkness. A little neat.....then the entire movie is just gore scene with little light, the same monsters and no real build up of true fear, a disappointing ending an nonsensical...well, everything...ugh I just can't understand it at all. It's not that it's confusing to me, I just don't see AT ALL what people liked about it. So glad I only paid $3 in Xbox space-bucks just to see it otherwise I would've walked out of the theater had I seen this in one.Boring. Boring. Boring."
    },
    {
      "rating": "3",
      "text": "The movie was a pretty good horror movie but the issues come from its atmosphere. The movie falls victim to the problem of not developing the characters well enough to be able to tell who they were in the dark. The movie is set in an underground cave. This is a very cool and scary setting but the issue come from the fact that it is very dark underground. Most of the action scenes become cluttered and hard to tell what is going on because of the darkness. I am sure that this movie would be great on a big screen or in the theater but for normal folks its an issue. If the director had done something to help the viewer be able to see better, I would have rated the movie better."
    },
    {
      "rating": "0",
      "text": "Trash of a film. I repeat. Trash. Horrible. Great acting, but NO PLOT! Lacks so, so much. Worst movie of the year thus far. As fulfilling as starting at a wall."
    },
    {
      "rating": "8",
      "text": "A plot that sounds as though it is destined for B-movie massacre is saved by director Neil Marshall simply by playing by his own rules - it is comprised of an all-female cast, the first 20 minutes are actually used to develop them as characters, and the suspense and horror are all built up even before the real terror strikes."
    },
    {
      "rating": "7",
      "text": "Not too original as people calm it to be since it borrowed ideas from The Times Machine, Lurking Fear, Beast in the cave, C.H.U.D. It even has the main character falling into a pool of bones like in the remade version of The Time Machine. This idea has been rehashed several times in the past hundred years. Overall it's a good movie but not that great in my eyes. 7.1/10"
    },
    {
      "rating": "9",
      "text": "Solid Horror film from the UK and one of my personal favs, but it's fails to get the high score due to somewhat of a sloppy ending. Great all-female cast head deep into a cave system and get stalked by 'crawlers', and it makes for one hell of a Horror film that would freak anyone out! There is also some great character development, especially with the leads Sarah & Juno. Overall I highly enjoyed it and have seen it quite a few times now, and would certainly recommend it to Horror buffs!"
    },
    {
      "rating": "10",
      "text": "\"The Descent\" is possibly the scariest movie ever made, and it's one of the best horror movies of the 2000's, and, possibly, of all time. It's unpredictable, intense, enjoyable, and extremely original. It perfectly combines jump scares with pure tension. I give it my highest recommendation."
    },
    {
      "rating": "0",
      "text": "this is one of the most boring movies i've ever seen it irritates me that it has gained so much praise the first 20 minutes are good as soon as the monsters are shown, it's pretty awful."
    },
    {
      "rating": "9",
      "text": "brilliant and original film, bit of a crap ending though"
    },
    {
      "rating": "6",
      "text": "It was a decently scary horror film, and It will scare the **** out of you if your claustrophobic and are watching it in a dark movie theater. In fact, it was really suspenseful until the middle of the movie, when the blood starts flying and the amount of gore just becomes ridiculous. Falling into a giant pool of blood and organs? The bloody massacre of the creatures when the woman finds a weapon? At this point, all the blood is just silly, and it personally killed the movie for me. Aside from that and the ending, though, it wasn't bad."
    },
    {
      "rating": "8",
      "text": "To be honest, maybe one of the best horror films i have ever seen.  It was very unpredictable and gory.  I do admit I had to cover my eyes from one death scene, but other than that I was very impressed with the filming and the sets.  A definite must see!"
    },
    {
      "rating": "8",
      "text": "This film was enjoyable, well paced and certainly scary enough for most. It's tempting to think that perhaps the beasts in the cave were unnecessary, as the cave itself was forbodeing enough."
    },
    {
      "rating": "7",
      "text": "A excelent movie of suspense that compense certain conventions knowing explore very well the claustrophobic climate and the strain implied, besides as well as reckon an interested feminine time of actress. To the surface tension, suspense of the good. Every horror movie has that premise that, at first, nothing seems innovator. The objective the Descent is to show how it's possible do something with quality using the same product. Every scene is going be more deep and the idea of the total darkness scenes were brilliant."
    },
    {
      "rating": "6",
      "text": "The films technical qualities were unbelievable but seeing this film on dvd the technical qualities of the film did not add to any suspense. this may because i did not experience this film in theatres or there is no suspense present."
    },
    {
      "rating": "9",
      "text": "This is one of the best horror films I have ever seen as long as it is seen unedited with its original ending.  I recently saw it again on TV and was so disappointed at its \"hopeful\" new ending.  Since I tend to be claustrophobic \"The Descent\" made me intensely uncomfortable.  All horror buffs should see this film but only the unedited version which makes it that much more frightening."
    },
    {
      "rating": "8",
      "text": "Hands down one of the best horror movies of the 2000s. It's got scares, boat loads of blood and a near perfect pace to match the intensity. Underground evolved humans rejoice!"
    },
    {
      "rating": "8",
      "text": "The Descent is an expertly crafted horror film. Directed by Neil Marshall, the film is not only claustrophobic and incredibly uncomfortable. The performances are all very good, the score is solid, and the set design is great, but above all, it is entirely unsettling. Multiple times I was freaking out and scared out of my mind, which is a great thing for a horror film. The creature design was great and the whole story behind it was very compelling. For a film as contained as this one, the tension was always incredibly high and was very well put together. We are really inserted into the mind of the characters and that ups the terror even more. On every front, The Descent knocks it out of the park and is a really entertaining and fun film to watch."
    },
    {
      "rating": "7",
      "text": "The descent seemed a bit overwhelming, terrifying and gore. I like just enough to rate it a 7. There is a movie that you recommend but ................ okay."
    },
    {
      "rating": "9",
      "text": "The Descent is a very fantastic horror that definitely shows that not all horror movies these days suck. It has likable characters and an intriguing, yet dark plot. However, while there are plenty of great scares in the film, it does host some cheap \"boo!\" moments as well. And this may be nitpicking, but there are so many questions that could be asked about the crawlers that result in plot holes in the movie that I won't even go on about. All-in-all, fantastic movie that is a must-watch for any horror fans."
    },
    {
      "rating": "10",
      "text": "It's brutal,gore and the monsters are terrifying,this movie is just incredible.The female characters are plausible and the scenario is good.Probably one the most scary movie in years."
    },
    {
      "rating": "7",
      "text": "One of the best horror movies out there. The Descent is fantastic and terrifying, watch this movie."
    },
    {
      "rating": "10",
      "text": "Hi ! This movie is pure excellence, unlike the 'it's pure garbage' that I am\rreading from people whom did not like it at all. I will respect others\ropinions and if they fell it's an utter poss and it's 'the worst film I\rever saw in my life.. With that said. So back to my feelings on this. I\rreally can't understand people, I just don't...I'll try... I know it is\rnot a movie that tries to be Oscar-worthy with deep layers of morality\r(there is some in this movie) around\ra dramatic story. For horror ones (I despise this term I prefer\rthriller/suspense with horror elements, I know this is high\rcategorizing which I don't like either, since it's pigeon holing, The\raudience also forgets that there are over 50,000 movies, it's 'normal'\rAt some point, things can look similar when there are so many movies. ..so please cut some slack and\rbe considerate of how hard it is to make a movie. So with that,\rfurther, said. I want to say this movies is pure excellence because it hits the right\rnotes : claustrophobia (some don't like that, hence hate the\rmovie..understandable, still this element raises the movies scare\rfactor), darkness (extremely important to increase the psychological\rfactor (who is isn't afraid of utter darkness - stuck in a cave?),\rextremely impressive soundtrack and aural experience (the sound\rdesigners made sure there is reverberation and 'cave echo' everywhere\rin the movie (unlike in Descent 2, which is more flat sonic-ally and\rgreatly affects the viewers spatial situations effect (trapped in a\rsilent cave where every surround sound is heard in echo 3D surround\rsound fashion. In fact, The Descent boasts an incredible 7.1 channels\rinstead of regular 5.1 (still great), the difference is massive, you\rhear creatures behind you, (side left, side right) everywhere this\rlevel of 3D surround sound 'envelopping/engulfing' effect is not heard\rof in other horror movies, where you feel more a passive eye, here you\rfeel on the scene right in the cave - with the women.))), it features\rall-women cast (new, but not,,but new enough - as spelunkers, very new\rthus a originality), the creatures (which everyone laughs out as poor\rman's version of 'ghollum troll' or some other 'fake *ss'\r''costume-prosthetics''...great ''prosthetics'', like great '3D CGI', as a tool, have their place and I don't think the\r'bareness' of these cave creatures should be so dismissed (''a 'naked\rdude' with a 'ghollum mask'...nice..very scary.not.''). For me, the\rfirst part is a slow build-up, and the best one, I saw this at Fantasia\rin 2005, it took my breath away (No movie had done this in at least 20\ryears time, since the first Alien, and this movie is an homage to it\ralso, Mr.Marshall said that he was inspired by these great horror\rmovies such as the terrifying and slow potboiler Alien 1 of Mr.Scott),\rI remember looking at these women fighting the Cave, fighting\rthemselves (friendships dissolve as they are now - each fending for\rthemselves), fighting death (pure survival), fighting creatures (yeah\rOK they don't exist - its a 'FICTION' read that word/Calm down with the\r'it doesn't make sense/it's stupid and nonsensical brainless movie'\raccusation and an Excellent at that, but still they are late enough and\rhave a certain degree of 'fitting in', it 'could' be possible (even if\rsome said, these creatures would have evolved outside the cave/left\rit...not necessarily, they could have evolved Inside), When they face\rthe pits/chasm it's utterly terrifying (to try to cross over and not\rfall to their death), the cave is so mean and unforgiving. Mr.Marshall\ruses important elements like coloring palette (he uses red during\rdeadly scenes, green in more danger-free scenes, important red flare\rlighting and deep shadows blacks darkness to hide the elements and\renhance utter fear) scares (great) hate the 'jumpscare' 'boo! a flying\rcat!' categorization..you do not scare someone - with ONLY dread, you need higher\rthan that, 'jump' scares are that element that TAKE people by SURPRISE,\ryou need it, you may despise it but it's a reality, to scare you, you\rneed to be startled. The actress are incredible and heightened the fear\r(they are screaming, emotions and full of tears, you know this could BE\rYOU in the cave, surviving). , the scares are extremely well made with\rmusical accents (staccato) but the whole movie is almost in surround\rsilence (we only hear the surrounding noise of the cave and women's footsteps echos- frightening),\rthere is utter viscerally and 'fight to the death' to live. It's a\rstory of pure survival (blood, gore is never just for the sake, they\rreally fight to death and he makes sure we feel the grittiness\rof the survival. The cave is so foreboding is takes a form of 'character' itself (the\rshadows sculpt all the nice rock patterns, very detailed and realistic\rset construction. SIMPLY PUT : THE BEST SUSPENSE THRILLER HORROR/WITH HORROR ELEMENTS SINCE ALIEN 1 AND SHINING, YES, EVEN SHINING OR OR EXORCIST.Congrats\rMr.Marshall, please make Descent 3"
    },
    {
      "rating": "10",
      "text": "The caves look amazing, they are so convincing. For what could be a really dull film to look at it actually looks amazing. The sound is awesome. It uses the surround and bass to perfection. The score is absolutely spot-on. The pacing is perfect. It's rare that films get the pace so right! It is really scary, makes you jump, painfully claustrophobic and incredibly tense. The atmosphere and suspense is perfect. The creatures looked pretty cool but nothing too insane. It is really gory and grotesque. Hands-down best horror film of the decade. Intensely claustrophobic and riveting horror that never lets you relax."
    },
    {
      "rating": "10",
      "text": "The first genuinely scary - and I mean scary - movie in more than a decade. Take Pampers."
    },
    {
      "rating": "9",
      "text": "Scariest film I've seen in a long while. Yes, it's derivative, and yes, it's flawed. But, it's well acted, well directed, and creepy as hell. Personally, I feel the gore factor got a bit absurd near the end--excess is not always a good thing. It became desensitizing. But all in all, a welcome relief from Japanese-based \"poor little girl was mistreated by her Mommy so now she's back to kill everyone\" tedium. Let's hear it for strong women. And endings that aren't Hollywood happy. (My knees are still shaking...)"
    },
    {
      "rating": "9",
      "text": "the strongest creature feature in years, good acting, well directed, excellent cinematography, makes a fool out of the cave. If this is your kind of movie, it's a must see."
    },
    {
      "rating": "9",
      "text": "Great horror flick ! I had no clue for the first 45 minutes that it was anything but a well-done indie drama about loss and bonding. Man, was I wrong! Very well directed, shot and lit. Hope it comes to the US so I can see it on the big screen!"
    },
    {
      "rating": "10",
      "text": "Supurb acting and amazing horror. great twists and great director. well done, well lit and really smart plot. instant classic."
    },
    {
      "rating": "10",
      "text": "Supurb acting and amazing horror. great twists and great director. well done, well lit and really smart plot. instant classic."
    },
    {
      "rating": "10",
      "text": "Supurb acting and amazing horror. great twists and great director. well done, well lit and really smart plot. instant classic."
    },
    {
      "rating": "10",
      "text": "Supurb acting and amazing horror. great twists and great director. well done, well lit and really smart plot. instant classic."
    },
    {
      "rating": "10",
      "text": "Supurb acting and amazing horror. great twists and great director. well done, well lit and really smart plot. instant classic."
    },
    {
      "rating": "5",
      "text": "The side story and so called \"twist\" are both lame and meaningless,as is the final scene. I've seen the same creatures on a much more enjoyable episode of the \"X- Files\", and people simply would not engage in dialog or act in the manner depicted if ever presented with this type of incredible situation. The movie is nothing like the seventies classic \"Deliverance\" which was mentioned somewhere in another review here, and I am amazed at the relatively high scores for this tiresome flick. Also the voice of one of the 6 actors is the scariest thing in the film, sharp enough to cut right thought you. All in all I've seen it many times before."
    },
    {
      "rating": "8",
      "text": "What a perfect premise for a horror film--the claustrophobic passages of an uncharted cave. Ironically, the shock value diminishes when the creatures appear: nothing beats the nerve-jangling apprehension of the dark and slimey unknown. An shrieking, instant classic."
    },
    {
      "rating": "4",
      "text": "What a horrible movie. It was merely a bloodfest with no real plot and no outcome. There was no creation of fear. There were some mildly startling moments, but overall it was a yawn. The acting was horrible as well. Simply an unentertaining movie."
    }
  ]
}