{"id": 3595, "title": "The Guardian", "starring": ["Kevin Costner", "Ashton Kutcher"], "runtime": 139, "genre": ["Action", "Adventure", "Drama"], "description": "A high school swim champion with a troubled past enrolls in the U.S. Coast Guard's 'A' School, where legendary rescue swimmer, Ben Randall teaches him some hard lessons about loss, love, and self-sacrifice.", "releaseYear": "2006", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/iFOw9bXeLM6a2WbI7T1ytF8o0Wn.jpg", "categories": {"plot": 7.642857142857143, "acting": 7.869565217391305, "ending": 9.666666666666666, "soundtrack": 1.0, "cinematography": 10.0, "familyFriendly": 6.0, "funny": 9.5, "action": 8.533333333333333}, "reviews": [{"rating": "10", "text": "For a movie that is supposed to be so mediocre according to the critics it amazes me that I've heard that so many audiences reacted the same way that the one I was in did, applause and kudos. Good thing we were given a brain of our own to make judgments with. If we had to depend on the critics we'd miss out on a lot of the good stuff."}, {"rating": "10", "text": "Simply fantastic as Kevin Costner is the best I've seen him in years. Audiences should absolutely love this film as there is something for everyone."}, {"rating": "8", "text": "Great Movie"}, {"rating": "10", "text": "I read the critics reviews and I guess from a technical point of view like in ice skating they felt this film is mediocre. However the audience I watched it with last night absolutely loved it. Strangers were talking to each other after the movie and cheered when the credits rolled at the end. I thought the supporting actors were simply outstanding and especially loved the speech by Bonnie Bramlett. I wish we could have seen more of Sela Ward because she is one of my favorite actresses. I particularly loved watching her on the hit TV series House. Kevin Costner seems to have finally passed the baton as a Hollywood leading man to the younger Ashton Kutcher who does an outstanding job as troubled young hero. Costner's role is similar to John Wayne in the later years of his career where the audience still loved him because of his inner strength. This is a very entertaining film in that they take parts of an Officer and A Gentlemen, Top Gun and all the other films that really worked and blend it into this engaging story about Coast Guard Rescue Swimmers who before now never were given their just due. We see them in an entirely different light and realize how they risk lives on a daily basis for their fellow man. Kudo's to all on a great movie that everyone should enjoy."}, {"rating": "9", "text": "Excellent story and plot, well casted, good music. Displayed the sometimes forgotten drama of being a coast guard."}, {"rating": "8", "text": "Im not particularly a fan of these two actors, with a few exceptions- (Dances with Wolves, and the Butterfly Effect), but they didn't annoy me here, and the story was pretty good, and I'm sure they will get a lot of new recruits to the Coast Guard, despite how tough they portrayed the training."}, {"rating": "10", "text": "The best movie ever."}, {"rating": "10", "text": "I recently saw The Departed and The Guardian. Both are long movies and are extremely intense at times. The difference between the two is that the Departed is exceptionally violent while The Guardian you walk away feeling good with a new found respect for America's unsung heroes The United States Coast Guard. Yes, as you have read much of this script is a remake of An Officer and Gentlemen and Top Gun. So what? The Guardian is first rate with superb acting, directing and cinematography. Don't miss it."}, {"rating": "10", "text": "I just saw a matinee on Monday afternoon which was half full. It was so quiet that you could hear a pin drop. The characters were so likeable that you felt for each and every one. Yes, the movie was a bit too long and was also very intense in that it made me feel queasy. If I cared enough for the characters then the movie did what it was supposed to do because it felt so real. I absolutely loved it and recommend it to everyone. The acting was first rate and the ocean scenes were riveting. All the side stories were tied up in the end nicely. As for the critics, they had to be watching something else."}, {"rating": "8", "text": "Formulaic, but some interesting and fun twists. Costner and especially Kutcher are great. Their boss is the sadistic head guard from Shawshank Redemption."}, {"rating": "10", "text": "Loved the action sequences, it had me on the edge of my seat."}, {"rating": "10", "text": "Just came back from seeing it on opening night. Absolutely, the most entertaining movie this year. Thank you Hollywood."}, {"rating": "0", "text": "What a joke! Save your money and your time -- life is too short to waste on junk like this. This movie has been made 100 times before -- why the need to make it again?"}, {"rating": "9", "text": "A critic said it's predictable and  dated. I get what he means, the plot is predictable, but the coast guard thing just works. Cynical about Costner and Kutcher, but they seem to rise to the challenge and they just work in this movie, there is no stupid cgi, no stupid soundtrack, everything is pure, simple and the script just makes the whole thing work. You care about the characters, and when the action appears, it's more of a nice addition rather than a neccessity; it's entertaining, it's involving, it's inspirational, given the genre in which it resides, and the fact that this kind of thing has been done before, the fact that this still kicks ass, makes The Guardian one of the best films of its kind in years. Well done to all."}, {"rating": "0", "text": "What a horrendous movie! The critics were right when they said it was nothing special... The entire movie is a cliche piece of crap that tries way too hard to be epic and meaningful. The script is just laughable. The last twenty minutes were the best directed, but they were so boring and just full of action. Most people only like the film because of stupid action. It doesn't mean anything. Bad, bad, bad movie."}, {"rating": "8", "text": "An excellent albeit long film, superior acting by all. The bad reviews are confusing (and wrong)."}, {"rating": "3", "text": "I would have thought more of it if it wasn't so bloody long. There were about 5 times where I was sure it was over, only to have another unnecessary scene tacked on. Looking back, I can think of about 30-45 minutes that could have been hacked off to tighten up the film. Entire scenes and side-stories could have been dropped."}, {"rating": "10", "text": "I think this was an amazing film. Not only do the action sequences keep you on the edge of your seat, but the emotional pull is so well developed that the ending is a real tear-jerker. Makes you really think how someone would do such a thing and what you would do in such a sitution."}, {"rating": "9", "text": "This movie was increable, heart renching, that will be watched agian and agian!"}, {"rating": "9", "text": "I think this in one of the best movies that I saw during this year, it was well done I recommend it to everybody"}, {"rating": "8", "text": "This isn't an overly original concept. Nearly every scene is predictable. Yet... It is entertaining and fun. Ashton Kutcher is surprising in some of the movie"}, {"rating": "9", "text": "I was pleasantly surprised at how good this movie is, considering all the negative reviews. The sea rescue scenes are terrific. Kevin Costner is excellent; he seems to be getting better with age. Even Ashton Kutcher is fine. OK so the movie is formulaic, but that isn't automatically a bad thing if it's well done, as this one is. Yes, the movie is on the long side, but it's so involving that it doesn't feel over-long at all. A winner!"}, {"rating": "8", "text": "Yup - a bit formulaic. You know, the old formulas that make you feel good about having spent time at the movies. For the most part, the scripting was very good - bar scene #2 is a classic. We need more hero movies like this one to remind us there are people we can be proud to care about."}, {"rating": "6", "text": "Not a bad film... sure, it suffers from its share of clichés, is a bit long and has a so-so ending, but it is more of a feel-good movie. If you like the traditional sports movie, 'The Guardian' has the same feel to it."}, {"rating": "8", "text": "I liked it. I was surprised how much I liked it. Kevin Costner was good and I thought it was Ashton Kutcher's best, serious with a sense of humor. I was reminded of An Officer and a Gentleman and The Perfect Storm at times, but I loved those movies. It is a tribute to the Coast Guard and all they do to save the fools that get themselves into bad situations. Kevin Costner is still hot."}, {"rating": "10", "text": "One of the best movies of the year. I loved it."}, {"rating": "10", "text": "Saw it in previews. It is a remake of an Officer & A Gentlemen but it takes us past boot camp and into the real world. The acting performances are first rate and the audience leaves the theater feeling good. You actually care about all the characters, something that has been missing in many movies lately. Don't miss this one."}, {"rating": "10", "text": "One of the better movies I've seen this year. Of course the critics got it wrong again."}, {"rating": "10", "text": "This movie was a great movie. Good action and a couple of funny Scenes."}, {"rating": "10", "text": "Absolutely loved it. It reminded me of Debra Winger and Richard Gere in an Officer and Gentlemen. The acting was first rate and the action non stop. A really good popcorn movie."}, {"rating": "10", "text": "This movie reminded me of an Officer & Gentlemen in many ways. The ending was bittersweet but there couldn't be any other ending that would have made sense. It was the kind of movie that I could enjoy and then think about long after leaving the theater. If you care about the characters and the film makes you think then it did what it is suppossed to do. All these bought and paid for professional critics never seem to understand this. The acting, directing and cinematography is all first rate. Guaranteed to be a big hit as word of mouth spreads. Go see for yourself."}, {"rating": "10", "text": "My wife just returned from a matinee and we loved it. It has a little bit of everything for everyone. It combines the best plots of several very good movies and the acting is terrific. It gives the viewer a better understanding of the Coast Guard and how important their heroic service really is."}, {"rating": "8", "text": "Not an all time favorite but it contained the elements of a good but predictable plot. Overall worth a rent. Worth buying for the fan of military type movies."}, {"rating": "1", "text": "What an embarrassing movie. Scripts must be few and far between. I can understand Ashton Kutcher having to accept a part in a predictable movie such as this, because lets face it, he's really B grade. But, I thought Kevin Costner may have been able to pass. Has his career stooped to this? Flag waving, chest beating, hi five hand slapping crap!"}, {"rating": "0", "text": "This had to be the worst movie ever! About some stupid loser who joins the coast gaurd. That falls in love with a ugly lady who is a drunk. It was such a crappy movie that Icried. I highly doubt that the true coast gaurds drink like pigs on there free time!"}, {"rating": "10", "text": "WOW, after this movie I realize we take the Coast Guard for granted. Great movie, entertaining!!! I saw the critics reviews; WHAT! The whole family loved this movie... Watch it and judge for yourselve... Also do not understand the negative reviews!"}, {"rating": "10", "text": "This movie was AMAZING! I was so inspired and it just makes you realize how much we take for granted the amazing work people do. the acting was really good too. I'm reminded again of how great of an actor kevin costner and ashton kutcher are."}, {"rating": "10", "text": "Just saw it and without a doubt the MOST ENTERTAINING MOVIE of the year. It has everything. And, you actually leave the theater on a high, thinking and caring about the characters, which is it's appeal and charm."}, {"rating": "9", "text": "Overall, a very good movie. It was longer than I thought it would be, but it showed accurately how I imagined a military training camp being in my mind. Very interesting, and funny dialogue breaks up the dull moments.  Definately, a movie that I would see more than once."}, {"rating": "8", "text": "Yes, this military melodrama about the Cocky-But-Troubled-Recruit-Who-Makes-Good DOES travel the well-worn path of An Officer and a Gentleman (while stopping along the way to quote the most famous line in Speed). But three factors need to be introduced in order to put this in its proper perspective: 1.) while The Guardian borrows from Officer, it runs a very distant second in this 2006 category to Annapolis, which STEALS from it wholecloth; 2.) a viewing of many 1940s and 50s films in frequent rotation on Turner Movie Classics will attest that Officer isn't exactly a paragon of originality either, and 3.) The Guardian's obvious familiarity doesn't prevent it in any way from being as entertaining, rousing, exciting and ultimately quite moving as it is. Part of this is due to the novelty of its setting: very few service movies center on the Coast Guard, which--and in the following statement I mean absolutely no disrespect toward the other branches of the US military--is focused on saving lives rather than taking them, and this in turn allows The Guardian to neatly avoid the repellent jingoism that made Top Gun so obnoxious. (Philosophical question: can Quakers and other religious sects who are diametrically opposed to killing for any reason, opt to join the Guard if drafted or otherwise compelled to serve?). The two central performances work wonders: Ashton Kutcher, as a seemingly insensitive swimming champ who enters the Guard's rigorous training program, seems to draw on his awareness of how much he's (unjustly) disliked by some of the movie-going public in much the same way that Ben Affleck drew on the ups and downs of his own career to build an effective portrayal of ill-fated actor George Reeves in this year's earlier Hollywoodland, while Kevin Costner's work here as Kutcher's instructor, a Guard vet with his own shaky background, adds to an already impressive roster of films (Bull Durham, Tin Cup, The Upside of Anger and even Dances With Wolves) that establish him as our Number One interpreter of slightly burned-out, past-their-prime macho men who nevertheless still possess plenty of the right stuff. But the real hero of this enterprise is director Andrew Davis, who's clearly the most humanistic American director of action films currently working; everybody loves The Fugitive, of course, but don't forget that Davis was also responsible for both Chuck Norris's best movie (Code of Silence) and Steven Seagal's (Under Siege). He also did Arnold Schwarzenegger's underrated Collateral Damage, which unjustly suffered from being scheduled for release around 9/11 but turned out surprisingly to be a more thoughtful examination of terrorism and some of its causes than you'd expect from this genre and star...and then stepped completely out of form to give us the terrific Disney live-action kids' movie Holes. Davis's sheer professionalism in handling his actors, his staging of truly exciting action and rescue scenes while, unlike Poseidon, make it impossible to tell where the CGI ends and the real danger begins, and his sheer storytelling skill which enables him to get away with multiple climaxes that don't seem overdrawn or over the top are some of many qualities that makes The Guardian an almost perfect meat-and-potatoes movie; like most good solid comfort food, you shouldn't restrict yourself to a strict diet of it or even have it all that often, but it sure is satisfying when it's as well-served as The Guardian is."}, {"rating": "6", "text": "Yes, the critics are right. This is not a very good film. But the photography is outstanding and Kevin does a great job. Not a bad way to while away an evening."}, {"rating": "10", "text": "This movie is amazing. Many people say this movie was done by mostly wire work, but hear this: actor Tony Jaa, is an expert in these tricks and almost every single one of those tricks in the movie is real. The fighting is excellent and I recommend it to anyone looking for a \"edge-of-your-seat\" action movie."}, {"rating": "10", "text": "It was a very good movie. Good story line (although draggy in some spots) But overall it was very good. Ashton Kutcher tied up all the loose ends as best he could."}, {"rating": "1", "text": "It hurts me to do this because I really like Andrew Davis's directing and really think he's an underrated director. I really think Ashton Kutcher and Kevin Kostner deliver great performances and the music here is pretty cool. However, the simple fact is that this movie's just...boring. It's horribly boring. It's nothing, NOTHING, but a series of training sequences and montages. That's all it is. It's like one giant training sequence. It's incredibly cliche'd and just...dull. This movie also has the nerve to drag on for over 2 hours. It would be fine if all this training and preparation was building up to something BIG but the (predictable) climactic action scene is not nearly enough of a show to make up for the nearly 2 hours we spent watching these characters prepare for it. (They also ruin any sense of intensity by frequently cutting to other scenes during it.) A complete dud. Very few redeeming qualities. Andrew Davis is successful (like he was with the movie Holes) in creating bonds between characters that the audience can sense and there are some cool moments involving that but unfortunately, the movie is slow, boring, and outdated. I can't really think of any redeeming qualities here."}, {"rating": "0", "text": "Ever see Top Gun? Then you don't need to see this movie. There are so many rip-offs of that movie that it makes it unwatchable. Let alone the fact that Ashton Kutcher cannot act in a serious role and Costner plays the same character he's played in the past 10 movies. This movie was a complete waste of time."}, {"rating": "9", "text": "Excellent. A good reminder of what Coast Guard (and others) goes through to save lives. Kevin Costner was great. It's so nice to have a movie that isn't all filth, violence, gore, and sex. I recommend this movie to anyone that wants to be entertained."}, {"rating": "4", "text": "When watching this movie, I feel like I'm just watching a more modern version of An Officer and a Gentlemen. Yes, some of the parts were inspiring and uplifting, but I've seen inspiring and uplifting and it's making me bored!"}, {"rating": "7", "text": "Yeah, it was a bit cliche, but the acting was more than decent, and overall, The Guardian was an entertaining film."}, {"rating": "7", "text": "Good job Costner! This is a solid movie, I had my reservations, but it was good. Kuchner was surprisingly decent as an actor, too. This is a good rental, everyone will like it."}, {"rating": "6", "text": "Veteran coast guard, traumatic accident on the job, forced to become an instructor, does it his way, new brilliant recruit with issues, etc.Very predictable but also watchable action film with Kevin Costner & Ashton Kutcher playing their roles well.You can sort of grasp how it's going to turn out within the first half hour & inevitably is going to be compared with the homo-erotic fest that is Top Gun."}], "recommendations": ["hancock", "the_a_team", "gemini_man", "skyscraper", "terminator_genisys", "poseidon", "edge_of_tomorrow", "nobody", "the_tax_collector", "next", "logan_lucky", "san_andreas", "angel_has_fallen", "jumper", "the_departed", "contraband", "kingsman_the_golden_circle", "dark_phoenix", "seven_pounds", "gran_torino", "triple_frontier", "venom_let_there_be_carnage", "national_treasure_book_of_secrets", "captain_marvel", "the_taking_of_pelham_1_2_3"]}