{"id": 59, "title": "The Croods: A New Age", "starring": ["Nicolas Cage", "Emma Stone"], "runtime": 95, "genre": ["Animation", "Family", "Adventure", "Fantasy", "Comedy"], "description": "Searching for a safer habitat, the prehistoric Crood family discovers an idyllic, walled-in paradise that meets all of its needs. Unfortunately, they must also learn to live with the Bettermans -- a family that's a couple of steps above the Croods on the evolutionary ladder. As tensions between the new neighbors start to rise, a new threat soon propels both clans on an epic adventure that forces them to embrace their differences, draw strength from one another, and survive together.", "releaseYear": "2020", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/tbVZ3Sq88dZaCANlUcewQuHQOaE.jpg", "categories": {"plot": 5.166666666666667, "acting": 4.625, "ending": 8.666666666666666, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 6.444444444444445, "funny": 6.363636363636363, "action": 2.0}, "reviews": [{"rating": "7", "text": "+Great 4k hdr presentation+Superb voice cast+Great pacing+Entertaining screenplay-Story was pretty weakAll things considered croods new age is a decent sequel and entertaining way to pass the time."}, {"rating": "10", "text": "Okay, we (partner and our entire extended adult family) *love* The (original) Croods. Somehow never heard about it until we caught it on Netflix last spring. And then it was so wholesome, hilarious, entertaining and GORGEOUS from start to finish! I mean, we were just looking for a somewhat entertaining way to chill through a hangover when we found it, but what we got was such a treat! It immediately became one of our absolute favorites.Turn to Croods 2: WHAAAT?!It's perfect!!!Couldn't believe how much we loved this entire movie - obviously it was as good as the original, but maybe even *better*??Seriously, the whole thing was so creative and entertaining and the addition of new cast was a perfect fit!The *best* thing about this movie (and I don't think it's a spoiler - it's in the trailers) is that they turned the played out and awful jealous-girls-fighting-over-a-(literal)-Guy thing completely on its head. And they set it up so well! \"Oh no, Dawn and Guy have history? Oh no, they're even saying the same things at the same time? Aaah, and their matching lemur accessories just thrust them together?? Oh nooo!\"And then. Annnnd then. What immediately blossoms between Eep and Dawn was such a *welcome* surprise, not to mention heartwarming and realistic (\"Why are our voices getting so high-pitched - Eeeeee!\" Hahaha, teen memories).It was so *refreshing* to see that kind of healthy female friendship relationship portrayed and developed, especially with a \"Guy\" involved.Meanwhile, the whole Croods family just being themselves is great. Grug's biggest problem (as ever) is that he just loves too dang much. That's incredibly endearing for a literal \"cave-man\" character.And by the end of the movie? Oh, it is all wrapped up so nicely I wanna put a bow on it. It's so happy! The creators described wanting to make this movie a \"celebration\" of the Croods characters. And they achieved that splendidly. It's hard to think of any other stories so full of *joy.*So yeah, I'm leaving out a lot because I don't want to include any spoilers, but this is one of those rare cases where in making a sequel - they absolutely NAILED it.This movie is a gem. I don't think I've seen anything else that makes you feel so completely happy at the end. And for that, if *anybody* who was involved in this movie's creation ever happens to see this, I just want to say THANK YOU for this gift of a movie!! (*Especially* right now.) Thank you.I'm gonna go watch it again."}, {"rating": "5", "text": "I'm gonna feel really old by writing this, but I think it might be a bit overwhelming for kids, or maybe they'll be more into it than I was.Who knows with them now. It wasn't a bad experience per se, but I wasn't excited by anything either"}, {"rating": "4", "text": "It's just a crappy kids movie. You can take young kids to it, and they may like it. But this isn't a \"movie the whole family can enjoy,\" you know?"}, {"rating": "3", "text": "I loved the 1st croods very much.But this one is portraying men as damn and women are the saviours and all warrior in short Rolls of men are being acted by women and women rolls done by men crying and all feelings like most movies seem to try to push women agenda and talk and sensitivity these movies nolonger feel like movies they sound like female agenda driven. The croods that was funny is all full of feelings and feminism talk points driven as men are wrapped in bananas.Hollywood has really changed the way movies used to beImagine\"BANANA BRO'S\" as So the girl is fighting for her life what the heck and the guy tries to talk about feelings as the monster is trying to destroy them I've been waiting Al year to watch this crap this is unfair. Imagine EP grabbing the guy"}, {"rating": "4", "text": "Its a pretty average movie, it has a lot of over the top identity politics that Hollywood is continually ramming down our thoats at the moment and all the male characters are portrayed as dumb and hopeless, its like a 1920s damsel in distress film with the genders swapped... so progressive. The Mr Betterman character is especially nauseating and difficult to watch. The animation is decent enough and it kept my childrens attention to the end. There was one funny laugh out loud moment, but otherwise it was a pretty mediocre animation that we probably would never watch again. Trolls 2 was so much better than this."}, {"rating": "1", "text": "Not entertaining for adults, and young boys will be put off by all the romantic idiocy, and this movie has a lot of it. It seems to have been a choice for this film to focus more towards girls who have started liking boys as the main audience.The Betterman character is annoying, and also the Crood son. Cloris Leachman's few scenes are the best, which are mainly towards the end. Will a kid like it probably, but only after about 40 minutes into it once some action gets going."}, {"rating": "9", "text": "I went into this film expecting the worst after seeing the MC scores (my GF wanted to watch it anyway), but was pleasantly surprised! CG is a work of art and some LOL moments."}, {"rating": "9", "text": "Seven years is way too long to wait for such an anticipated and rewarding sequel. The Croods is one of our all time family favourites. This new instalment starts of with a very sad opening scene but ends on a wonderful note of reconciliation and compromise. Completely packed with humour and action, part two doesn't miss a beat. There's a little less world building and fewer locations but imagination is firing on all cylinders. Please don't make us wait another 7 years for the next one."}, {"rating": "10", "text": "Critics are on crack. Croods 2 is fun af. I barely remember the first one, but it wasn't bad or anything. This is great. I dug the whole thing. Kelly Tran redeemed herself for Rose Tiko. Metacritic, you may want to check your math. Seems like a lot more green than yellow. I rewatched it twice (one for each kid, ehem). Got better every time. THUNDA SISTAS!"}, {"rating": "8", "text": "This movie is really enjoyable and full of funny and interesting scenes. Watching this movie is very helpful for the mood."}, {"rating": "10", "text": "It so woooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooow"}, {"rating": "10", "text": "I love the croods! aaaaaaaaaahhhhhhhhhh!!!  You should tooooo!!! aaaaaaahhhhhhhh!!!!"}, {"rating": "9", "text": "I had a ton of fun watching this movie. Laughed out loud several times.Just a good fun entertainment."}, {"rating": "6", "text": "7/12It was cute and some of the childish jokes got me more than they should’ve. Also, I haven’t seen the first one so I’m missing out on any of that context. But, this was easy enough to understand on its own. Kids will love it and adults can enjoy it enough to sit through."}, {"rating": "5", "text": "If the first Croods is an 8 for you this is a 5, soft 6. I can't figure out who this is really aimed at though outside of someone that enjoyed the first. The lovey crap feels REALLY forced and cringey, too many jokes are aimed at adults that kids aren't going to understand at all, followed by terrible jokes only a 5 year old would find funny. There's a few gems here but the movie is so scattered all over the place it feels like a 60 year old liberal man and 11 year old girl wrote it without talking to each other.But the biggest sin was such a huge emphasis on bananas and how bad Crug wanted them cause he hasn't had one in decades when THEY WERE LITERALLY HANDING THEM OUT IN THE FIRST MOVIE when they ran into punch monkeys. Did NO ONE in production even see the first movie?!? Such a massive continuity break that I questioned the writing right away. Not worth a ticket, maybe a rental to have lots of pretty colors for the kids that won't have any idea what the heck is going on and some of the side jokes will get a chuckle if you leave your brain at the door."}, {"rating": "8", "text": "Didn't expect much from this but was genuinely entertained, Nicolas Cage is SO Nicolas Cage in this I have no choice but to give it - 8 stars"}, {"rating": "2", "text": "Its time to bury old and cute ways to make cartoons. It could be more interesting"}, {"rating": "7", "text": "Very Good compared to its predecessor, there are some cringe character arcs but the end makes up for it"}, {"rating": "7", "text": "I thought it was good, maybe even pretty good. I liked the story, the visuals are pretty amazing and so is the animation -of course-, and it has great voice acting too! But the two things I didn't like was that the humor feels a bit weird and forced at times, and this also happens with the chemistry of the characters. But overrall, I think its a good movie"}, {"rating": "8", "text": "Super funny family movie. One of my favorites of 2020. There was at least 10 scenes that had me laughing hysterically."}, {"rating": "4", "text": "1st is okay, but this one is worse. It is really, really cliché and dumb, joke are kind of  bad, story is cliché and most of characters kind of okay, but obnoxious because they are cliché. Animation is good and creative just like first one. I do not what to say. From the first scene with Dawn I known story in the details. Go watch a movie because I am to lazy to write this cardboard cutout of a story. It is little worse then average, 4/10."}, {"rating": "5", "text": "This movie is annoying. Sure there are some jokes that I laughed at, but most of the jokes are for kids. Guy and Eep's relationship is cringey, the Bettermans are boring, and the overall feel of the movie is generic."}, {"rating": "6", "text": "good movie. I had a good laugh watching it and it was nice of them to introduce other casts."}, {"rating": "5", "text": "It was an ok movie, had a bit of comedy but otherwise kind of boring. The story didn't really make sense, the plot was random and it got corny a lot of times. I only liked the funny parts, and my family likes it too. My dad didn't enjoy it though.I'm giving this a 5."}, {"rating": "8", "text": "When we watched the movie on the cinema we laugh out loud from the hilarious humor that it has. One of the best comedy films I've ever seen."}, {"rating": "8", "text": "This was amazing, when I finished to watch it, the only thing that I wanted to do was watching it again."}, {"rating": "6", "text": "This is in my opinion better than the first one. I loved watching it Thanksgiving night."}, {"rating": "7", "text": "Did not expect to enjoy this as much as I did. Was anyone really begging for a sequel to The Croods? I know they got a Netflix series but every DreamWorks movie gets a **** Netflix series these days. Were toy sales that high? Did their new Universal overlords demand it?Whatever the reason, The Croods: A New Age is better than its predecessor...in practically every way. The animation is rich with vibrant colours and lively cinematography, several of the characters go through well-defined arcs, it's very funny, it's heartwarming, the new cast members are delightful, and I didn't always know where the plot was going. I am genuinely surprised. It feels weird that I'm saying this but Grug has quickly become one of my favourite DreamWorks characters; I just find the guy really endearing and Nicolas Cage is perfect in the role.It's still not among the studio's very best, but I think many people will really grow to appreciate this sequel as an underrated gem as the years pass. And you don't even have to see the first movie to fully enjoy this one! But honestly you might as well, because that's valuable Grug time that you would be missing out on. Any Grug time is time well spent."}], "recommendations": ["cloudy_with_a_chance_of_meatballs", "alvin_and_the_chipmunks_the_road_chip", "zookeeper", "the_game_plan", "chicken_little", "the_smurfs", "the_spongebob_movie_sponge_out_of_water", "ice_age_dawn_of_the_dinosaurs", "alvin_and_the_chipmunks_chipwrecked", "minions", "hannah_montana_the_movie", "the_boss_baby_family_business", "diary_of_a_wimpy_kid_the_long_haul", "alvin_and_the_chipmunks", "hotel_transylvania_2", "alvin_and_the_chipmunks_the_squeakquel", "ice_age_continental_drift", "night_at_the_museum_battle_of_the_smithsonian", "herbie_fully_loaded", "superbad", "spy_kids_all_the_time_in_the_world", "diary_of_a_wimpy_kid_dog_days", "goosebumps", "jackass_presents_bad_grandpa", "good_boys"]}