{
  "id": 2641,
  "title": "The Space Between Us",
  "starring": [
    "Asa Butterfield",
    "Britt Robertson"
  ],
  "runtime": 121,
  "genre": [
    "Romance",
    "Adventure",
    "Science Fiction",
    "Drama"
  ],
  "description": "A young man raised by scientists on Mars returns to Earth to find his father.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lRBl9mfvUbZeaAyXoP09XwPOo0W.jpg",
  "categories": {
    "plot": 5.3125,
    "acting": 4.814814814814815,
    "ending": 5.333333333333333,
    "soundtrack": 0.0,
    "cinematography": 0.0,
    "familyFriendly": 6.0,
    "funny": 5.5,
    "action": 6.4
  },
  "reviews": [
    {
      "rating": "7",
      "text": "An astronaut on the first manned Mars mission dies after giving birth to an unexpected baby. Sixteen years later, the teen (Asa Butterfield) travels to Earth to meet a girl and find his father. This is an interesting blend of typical science fiction, adolescent romance and getaway flick. While there are holes in the plot (and the science), there's enuff mild adventure and fish-out-of-water humor to keep it interesting. It only bogs down with syrupy drama a few times. In addition to those incredible blue eyes (that often look like they're crying), Butterfield charmingly creates a sweet, smart character. The chase part of the plot strains credibility and the final outcome isn't expected, but there's still sufficient entertainment to capture the imagination"
    },
    {
      "rating": "7",
      "text": "This was a satisfying watch for me, but the movie had to bend some laws of physics to make it all possible, and there seemed to be some plot-holes, even so it kept me interested all the way through."
    },
    {
      "rating": "9",
      "text": "Some have said that the story line is predictable, but I didn't quite anticipate the ending myself. You can look at this film in two ways, you can write it off as just another teen movie, or you can choose it see it as something more. I personally think it was a very interesting idea carried out very well with a good plot and great actors. Perhaps some of the science is questionable, but it is set in the future, and no one can really predict where science will be then. It's not just about love, it's about the idea of home, personal identity, and the simple joys of planet Earth. It's definitely worth watching."
    },
    {
      "rating": "3",
      "text": "There is something great about The Space Between Us, but the fact how it focuses more on romance than what it actually is kills the purpose of why this film should indeed exist. This film failed to deliver an actual interesting plot of science."
    },
    {
      "rating": "8",
      "text": "You know how it goes. The boy (Asa Butterfield) meets the girl (Britt Robertson), there's mutual liking and they want to meet... but there's a space between them. So he will travel to Earth from the Mars colony where he was born. Also starring: Gary Oldman, Carla Gugino, and B.D. Wong, because even the coolest teenagers need some adults around.\"The Space Between Us\" rides on the current wave of Young Adult, or YA for short, novels and movies which has dowsed the cinemas for the last ten years or so. It's still about romance, some sci-fi and action like the most of them (or at least the most popular of them) but it brings some refreshing changes to the menu.It's based on an original screenplay and not novel. It offers sci-fi and action without relying on done to death YA cliches (dystopian society, dating or fighting supernatural beings, etc). It puts characters in real danger so you can't always predict whether everybody's gonna make it. It doesn't have clear-cut good and bad guys...And last but by far not least, the movie has a nice classic Steven Spielberg-ian feel which puts the sense of wonder and adventure back to sci-fi which, in my humble opinion, is often missing or buried under all those visual effects and pizzazz setpieces. Even good old Spielberg himself is not always able to pull it off: the movie makes you actually care about the characters because there's a real human backbone to the story. It's entertainment but it also has heart.All this rests very much on the lead man Asa Butterfield who was 18 during the filming and turns 20 this April. Former child star of \"The Boy in the Striped Pyjamas\", Scorsese's \"Hugo\" and \"Ender's Game\" fame, this guy has grown to become a fine young actor indeed. I very much enjoyed his soft but sure performance as an innocent and fragile alien braving the world unknown to him. He has found a seemingly perfect balance between strange, childlike and soulful that the role asks of him, and I'd be glad to see him getting some awards or nominations for this standout work. He even has this memorable, Pinocchio-ish appearance and style of moving which seems suitable for a person not used to Earth's gravity.The other characters stay more in the background, so this turns out to be Asa Butterfield's show, and he more than fulfills the promise. The next most interesting performance comes from Oldman who ventures in the land of brashness and theatricality, in a good way. The aging thespian hasn't offered this kind of colorfulness for quite some time (in a big movie, at least) and I enjoyed it to the point of feeling that his character was underused. Holding him in the background makes sense in the context of a whole story, though.If you find my score surprisingly high, please remember that it's made for a YA crowd, or at least a teenager in all of us. I would not recommend it alongside 8 out of 10 movies made for older viewer groups. Probably.But 8 is not too generous. I liked \"Space\" very much and its overall quality more than compensates a shallow story which surely would work better longer. This could be a bona fide modern classic if the characters and events had more room to develop and breathe. Maybe in the form of (mini-)series or something.If you like \"The Space Between Us\" and look for something similar to watch, I would recommend 2014's \"The Fault in Our Stars\" for moving YA story, or 2015's \"Tomorrowland\" as an uneven but good example of how to combine sci-fi and action in a YA movie.I choose to end this review with an off-topic anecdote which I just happen to like very much:Q: Why did astronaut leave his wife?A: He needed more space"
    },
    {
      "rating": "4",
      "text": "The Space Between Us: Look, I'm going to be frank, I was expecting this movie to be terrible. The trailers made it look like another unwatchable romance flick, the multiple delays which usually indicates a massive problem with the film, and an engaging premise dumbed down for most teen audiences. To my shock, it wasn't awful but it's far from good. Let's start with what they did right, It looked pretty good, Asa Butterfield gives a good performance as some socially inept kid finding love, and the humor that stemmed from that worked. What didn't work? Gary Oldman gave the worst performance I've seen from him, he either didn't give a damn or was too hammy. The story was also very messy, jumping from one extreme to another, and the ending is just goddamn awful. In the end I would give \"The Space Between Us\" a High School Relationship/10, It may be cute and entertaining at times, but it's not well put together and not meant to last."
    },
    {
      "rating": "10",
      "text": "it's amagazing the story thye dram is loved and sad and the actors are beautiful and cool i'm a loved the drama and story son increibles ademas me encanta la localidad donde se narra"
    },
    {
      "rating": "3",
      "text": "got dragged to this, but tried to keep an open mind.  It's not horrible, but I was struggling to stay awake.  Could have been some really good science interesting things, but ended up being just sappy.  And corny sappy, not the satisfying kind."
    },
    {
      "rating": "3",
      "text": "“What is your favourite thing about Earth?”It may be such a simple yet overwhelming question, considering all the wonderful things that make up our world and each and every little thing that makes up all the good in all our individual lives. Yet one of my favourite slogans so far of 2017 is one that asks very deep and a heavy emotional response.Sadly, the slogan seems to be one of the very few deep parts that comprise director Peter Chelsom’s newest inspirational film The Space Between Us. The UK director seems to be on some sort of positive cinema boost, given his last film Hector and the Search for Happiness is a parabolic film about one doctor’s real life pursuit of life’s greatest gift.Sadly, with The Space Between Us, Chelsom’s handle on science fiction is very scarce, even though space accounts for a very small portion of his newest film. The Space Between Us is a love story through and through. Dabbling with elements of the who-dun-it narrative, as well as the coming of age story arc, Space is a modestly budgeted film with some great ambition that really doesn’t live up to the hype and one film that has its gaze far beyond the horizon. Think of it as a film that promises finding the gold at the end of the rainbow, only to really deliver Skittles, I mean, if Skittles are your thing.The cosmic love story begins well before either of our love birds began their courting, nearly two decades before, when a young and ambitious astronaut, Sarah Elliot (Janet Montgomery) and her crew, become the first group of individuals to colonize and inhabit Mars for four years. Placed in the care of their precarious and idealist leader and founder, Nathaniel Shepard (Gary Oldman), Nathaniel’s Genesis program partners with NASA to deliver Sarah and her sacrificial crew to the unknown planet of Mars. Given that all the numbers, scenarios and outcomes were already pre-planned, the one situation no one anticipated, was Sarah pregnancy. Giving birth and losing her life before she makes it to Mars, the Genesis program agrees to make the child’s birth a complete classified secret. Luckily, Gardner Elliot (Asa Butterfield) makes it safely to Mars, as we flash forward to Gardner’s adolescents. It is in Mars that Gardner grows up, interacting with the brightest scientists from NASA, who continue to occupy Mars, practically and implicitly contributing to Gardner upbringing, Gardner lacks many average teenage characteristics, despite his closest maternal relationship on the spaceship to botanist Kendra Wyndham (Carla Gugino). Gardner’s intellect is established quite early on, showing off how book smart and scientifically minded the youngster really is.Bored with nothing but causing chaos aboard the station, Gardner uses his smarts to trick everything and everyone on Mars. Learning of his secrecy to Earth early on, Gardner begins using the Wi-Fi (yup, they have internet in Mars) to make new friends on Earth. Concealing his true identity and current situation to an online friend and potential love interest Tulsa (Britt Robertson), the two spark a friendship that originated on an Orphan based online chat room. As the two orphans begin developing a closer relationship thanks to futuristic FaceTiming and instant messaging to one another, it becomes quite clear that Gardner is ready to finally venture to Earth, despite his physical boundaries and various health issues, including his oversized space heart, brittle bones, his foreignness to gravity and his very poor human social skills.While Gardner’s time spent on Mars is very limited, his caregiver and closest friend Kendra, begins campaigning for Gardner’s request to visit Earth, not only to finally see Tulsa, but to find out the identity of his father. Half way across the Universe, once on Earth, Gardner surprises Tulsa at school, where the two team up and break many laws in search of Gardner’s father. While discovering America, Gardner falls in love with Tulsa, and the two love birds steal their way to Arizona where they embark on an adventure that involves the Grand Canyon, hot air balloons and some pretty romantic locales.Sadly, Space is a project that has been in development for quite some time, having Asa attached since before he was casted as Ender Wiggin in the sci-fi Ender’s Game. While many cast and crew moved on, Asa remained attached with the project until it was green lit, with Robertson as his Tulsa. Unfortunately, while Robertson and Butterfield continue to prove their strong acting skills on screen, the two never really convince audiences of their love story and romance, sharing an almost big sister/little brother type relationship instead."
    },
    {
      "rating": "1",
      "text": "Seriously, what a terrible movie. I saw The Space Between Us last night and every aspect of it was just laughable. The writing was terrible, the plot made no sense, and the acting was abysmal. You're supposed to believe that this Gardner kid is some sort of genius, and he's smart enough to hack into the internet to talk to this girl. However, he only seems to have access to old movies that people bring onto the settlement, and apparently he is too stupid to Google anything. When he gets on Earth he acts like a complete idiot to everyone he meets. His relationship with Tulsa just ends up being so cringe it's hard to watch. The plot \"twists\" are the most predictable things I could ever think of. This movie is a sad excuse of cinema. Don't waste your time."
    },
    {
      "rating": "0",
      "text": "Didn't liked the movie the movie was crap and I prefer people not to watch this movie and not to waste you time. Passengers is the best movie to watch. At least there was a life in a planet but in Mars there is no LIFE EXISTED.They are in a space not in a Sex machine."
    },
    {
      "rating": "0",
      "text": "haven't seen it yet, but was worst film i've seen tbhcan't wait to watch it! I'm sure it will be a great film! 10/10 - ign______________________________________"
    },
    {
      "rating": "0",
      "text": "I rolled my eyes so much, that I am now able to look in two separate directions at the same time.It was a struggle to sit through this movie, the only thing keeping me in the theater were the hands of my friends holding me back in my seat. Afterwards, my blood was boiling and my eyes were dry as I waspreparing myself for tears-- none came, in fact, my body couldn't find a reason to create any fluid.The beginning of the movie was the only decent part. An introduction to perseverance and innovation in the (not so distant, it's set in 2018) future. The saddest scene in the entire thing would be Sarah Elliot'sdeath, which was brilliant acting by the way.The whole film has an underlying message of Earth's destruction, covered up by a love story. Gardner and Tusla's love story is basically a modern day Romeo and Juliet: they just meet, make out, make love, and make out some more in a seemingly short span of time. It seemed so rushed I would pinpoint the duration to be two to three days max. What I only really got from their whole escapade is the empowerment for teen rebellion and idiocy, and that love is an essential thing to be able to 'live' and must be experienced. Gardner escapes NASA and multiple authority forces, creating a whole bunch of **** for everyone because he needs to see Tusla, the girl who he's only seen through a video cam but talked to everyday (because since it's the future, that'stotally safe and okay to tell someone your location and your life details!!!) But it's all okay, because it's in the name of love, right? Everything is reasonable if it's for love! Even though the purpose of their journey was to locate and meet Gardner's father, it really wasmore of how much Tusla and Gardner can make out and do everything love is. Another fault would be the casting, which (unintenionally I hope) gave off the aura of the acceptance of age gap relationships. Although Gardner and Tusla are supposed to be the same age, the age gap betweenthe actors is obvious. But wait, Gardner's father? Nathaniel Shepard, who seems to be at least twenty years older than Sarah based on features. But that's okay, age is just a number, right? It was consistently unrealistic, even for a futuristic movie. Tusla can drive any type of vehicle, and even though she hasn't driven (or barely knows how to) in her life, she is able to take off and land it. Tusla is also able to steal multiple cars with ease, without getting into trouble with Social Services or the cops. In this future, thetechnology is so advanced that Nathaniel and Kendra are able to hack into every camera in the world and everyone has holographic computers and devices, yet the police can't catch one girl.My favorite part about the entire thing was the soundtrack, the music gave me emotions that were appropriate for the scene while the actual performance could not.Overall, I wished I had seen A Dog's Purpose instead of being dragged to suffer the cliche of the day. Asa Butterfield used to be one of my favourite actors, but now he joins Britt Robertson on Satan's list for most terrible actors. This movie has lost my respect for the future of the industry as well as mankind."
    },
    {
      "rating": "0",
      "text": "Feb. 18,2017 starting time estimate 9: 45am This is written by Bethani Faith Eskridge on her laptop in Elizabethtown KY 42701. The algorithm formula is used for evidence and reasoning purposes. I believe I would enjoy this movie because it could possibly be an event that has or has not already happen. I don't have knowledge of all facts but I have beliefs. The main \"male\" teen character seems to be on a search to find his father. I think many people could relate to this. I enjoy the scenery of space and other planets. Lots mass colors in space which leds me to believe other viewers would enjoy the scenery as well. I use to be very interested in astrology, I use to read books about all the Zodiacs. I use to own like 6 books containing stories and theories about love, job, and family interactions between all the signs however the books were forced to be destroyed. When I became friends with a girl on my golf team (ironically enough her name was Bethany(my friend) and was supposedly a year younger than me)her mother and my mother became friends too. (Bethany (my friend) her mother was married to a pilot). Later my mother asked her mother to come visit me at my apt that I just bought in Jessamine County. The reason why I had an apartment is as follows in paragraphs labeled A) and B):A)After leaving the trailer that my daughter's father lived in. I was forced to move out by his actions of lying and stealing from my daughter and I. So my grandmother on my mother's side heard my problems through cellular device and financially helped me pay the deposit on the apartment. The reason why I was living in the trailer park in Tate's Creek KY is as follows:B)My mother found out I was texting my daughter's father on my cellular device and didn't approve. She made me leave and in conclusion I decided to stay with my daughter's father so my daughter and him could have the opportunity to get to know each other.Bethany(my friend), her mother came to visit me because my mother and I were not getting along so she came as a messenger for my mom to see what my apartment looked like and what she thought about it and to talk to me about religion. She talked about her relationship with God and how he speaks to her through prayer=(part receives knowledge of y factor)(Radius). She said he helps her control the weather so her husband's \"airplane\" could get where he was going. She asked me if I had anything against religion in the apartment? and I said that I had a few books about astrology and I showed her where they where and she said I had to throw them away because they contained portals that let demons in. She threw them away and told me the devil rides on a white horse. Bethan(y)'s mom is Eucranion.  Apparently each zodiac signs originates from different planets. I learned a month ago in psychology class with Dale Buckles \"Dean of Students\" at Elizabethtown Commmunity and Technical College that astrology is a pseudo science which means its false science because it is not proven by factorial evidence. However astronomy is a true science isn't it? Does NASA research that? Is NASA in space? Is NASA even real? Can anyone tell me with evidence where NASA is? My ex boyfriend says there is a space station behind his old house in Florida and the ships went out ever day. Reminds me of the song/ official video of Monsters of Men that I watched last night  The rising action and climax is enjoyable when places with astrological scenery. PS if you can include the song written by Celine Dion as used in the movie \"Titanic\" Heart Will Go On\" I think it would bring tears to the emotional parts of the movie. One might wonder why the ship \"titanic\" was called that in the first place? Was it made of titanium? Titianium must not be very good since the ship sunk. I bet if it were made of plastic it wouldn't have sunk. But wait? What is plastic made of? Polymers? (people orbit life through why? meaning: message radiation sounds)Two messengers orbit two lives. Massagers go around half fish internally :live facts message. That hydrogen only orbits half under water because the mother delivers 2 faces to first cells. Evolutional Faces are genetic because radiation originates first crossing inside orbits. Radiational half the distance to originals. Inside original intersects in orbital nitrogen (there is no planet in our solar system that has nitrogen but that is what our planet is made up of. Earth must have a magnetic field that took all the nitrogen so we all needed it to come here)But where there is light/radiation there is nitrogen. And where there is nitrogen there is other cell/ life to live. Fish born in the middle of siblings of s- electrons(symmetry) and are not faces under the original earth born.Once again this was written by Bethani Eskridge 2.18.2017 finished at 11:47pm timing took longer because thgis had to be 5,000 characters to submit."
    },
    {
      "rating": "7",
      "text": "What's your favourite thing about Earth?You might ask that question for yourself while/after watching this film. This is not a great film, but surely different and enjoyable. This kind of storyline can be acceptable for the todays space ambition by the humans they have to accomplish. A couple of decades ago, it was called a fiction, still it is, but quite close to realistically possible.So we had seen many films based on human connection with the red planet, Mars, but this one was a little different. It is romance theme, though not like east meets west. It is Mars meets Earth. The story of a boy from Mars and the girl from Earth. That's how it ends, but not that how it was initiated. It was the boy who searched for his connection with the Earth, and doing that, all the usual things happen, like some people come after him, like running and chasing.Well made film. It was not a complicated screenplay, but the twist was unexpected at the end yet I did not think it was strong. Explained everything with details, as well as intentionally added some of scenes to cover up later parts when the narration takes the unexpected route. Best cast for sure.Britt Robertson played the role ten years younger than her she is. But it does not matter, she still looks like a teenager. And Asa Butterfield was quite good too. The only usual thing about the film was the road adventure, though it did not take the usual route. Nothing was like you have already seen them. That's where it hand upper hand. The end was good, yet I felt it softened to bring a certain type of ending than a relevant one. Because it is a PG13 film and they wanted the conclusion that satisfy their target audience. So, it is a nice film and once watchable.7/10"
    },
    {
      "rating": "6",
      "text": "The Space Between Us retreads a lot of familiar themes and plot ideas from other sci-fi movies you've seen before. Its cast and performances are likeable but don't really do anything extraordinary to make them really shine. It doesn't do anything really memorable, but at the very least is still an entertaining watch if you enjoy sci-fi or teen-romance movies."
    },
    {
      "rating": "6",
      "text": "Let me start by saying, I’m a hopeless romantic so this could be the reasoning behind my positive review on this movie. I honestly don’t understand why the critics rated this movie so low. I thought it was cute, adorable, sweet, and a whole lot of fun. I always say I only have time for one to two spaces movies a year, and I’m glad I chose this one.Opening this movie we meet Gary Oldman’s character Nathaniel Shepherd. He is giving a speech at a convention about NASA’s mission to get to Mars.He introduces the group of astronauts going to space, led by Sarah Elliot. She answers questions from the crowd and tells everyone how excited and honored she is to be a part of such an important mission. Flash forward two months and they are in space. Sarah is very sick, and we learn she’s pregnant. Shepherd and the rest of the ground team at NASA try to figure out how to handle the situation, and are torn between bringing her back and risking the mission, or leaving her to deliver on Mars. They decide on the latter. When Sarah delivers the baby there are consequences and she dies.We flash forward sixteen years and meet her son, Gardner, played by Asa Butterfield, who has lived on Mars his entire life. He has a close relationship with one of the astronauts on Mars named Kendra, Carla Gugino, who is like a mother to him. He also has an online relationship with a girl named Tulsa, Britt Robertson, and he desperately wants to meet her. However, in order to keep the mission safe and keep NASA from getting a bad reputation, they never told anyone about Gardner or how Sarah died, therefore, Gardner must stay on Mars. Kendra works out a plan to get Gardner to Earth to visit, and when he gets there, we go an adventure of a lifetime.While this movie isn’t going to win an Oscar or any big awards, it definitely deserves some recognition in my opinion. Asa Butterfield gives a heart-warming performance as the sixteen year old boy who lives on Mars and doesn’t know “how to be a human”. He’s awkward, says what he thinks, and has more love in his heart than most people. I honestly couldn’t imagine anyone who would have been better for this role than him. His relationship with Tulsa was beautiful, and Britt Robertson delivers as the misunderstood foster kid. Together, they help each other be the best version of themselves. Watching their relationship bloom during his days on Earth is sweet and it will make you say “aww”. I found myself sitting on the edge of my seat smiling at the two of them.Like I said, I know I am a hopeless romantic and that could be one of the reasons I found this film endearing, but I can’t help but love it. I would go watch it again, and I would take my friends. It isn’t as cliche as a Nicholas Sparks film, and it isn’t too old for the age of the characters. It fits perfectly. Gary Oldman delivers a solid performance as well, and we even get to see BD Wong for a small role.I can’t say I would tell everyone to go pay to see it, because I would hate to disappoint, but I can say that I loved it. It won’t make any top 10 lists for me, but it was cute fun and I think it is something most everyone could enjoy."
    },
    {
      "rating": "2",
      "text": "This was so bad i can't believe it. It's a bummer because I love Asa Butterfield. He deserves better and I hope his career doesn't get affected by this tragedy."
    },
    {
      "rating": "8",
      "text": "I really enjoyed this film - its family friendly and its got a nice innocent feel to it, after some of the heavier films I've seen as of late. I thought it featured some decent CGI effects and I thought Asa Butterfield gave a good performance, as the child born in space who had never visited earth and was determined to meet a girl on the planet he came from. I enjoyed watching it, so I would recommend it."
    }
  ],
  "recommendations": [
    "voyagers",
    "the_adjustment_bureau",
    "the_age_of_adaline",
    "contact",
    "into_the_wild",
    "eat_pray_love",
    "greenland",
    "the_lost_city_of_z",
    "vivarium",
    "goodbye_world",
    "smallfoot",
    "about_time",
    "brave",
    "donnie_darko",
    "downsizing",
    "home_again",
    "the_titan",
    "endless_love",
    "colossal",
    "captain_fantastic",
    "the_road",
    "back_to_the_future",
    "up_in_the_air",
    "a_monster_calls",
    "the_hunt"
  ]
}