{"id": 4275, "title": "The Kingdom", "starring": ["Jamie Foxx", "Jennifer Garner"], "runtime": 110, "genre": ["Thriller", "Action", "Drama"], "description": "A team of U.S. government agents is sent to investigate the bombing of an American facility in the Middle East.", "releaseYear": "2007", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/1RkL0PGod3b75MSrc1nVJxZsoRT.jpg", "categories": {"plot": 6.083333333333333, "acting": 5.35, "ending": 7.285714285714286, "soundtrack": 6.5, "cinematography": 3.3, "familyFriendly": 3.0, "funny": 8.0, "action": 5.560975609756097}, "reviews": [{"rating": "0", "text": "An insult to all Saudis, whilst its shameless propaganda against the East. AGAIN! I wonder why they are no films about Israel and the U.S. bombing the crap out of innocents in Palestine and staving people in Cuba? Anyway despite all of that, it still is Hall of Turkey fame. Has Foxy done a decent film except Collateral and his Oscar success?"}, {"rating": "0", "text": "They should terminate this sorry excuse for a featured film. It's an embarrassment. What are the qualifications to be a cameraman? Whatever they are it is impossible to follow the inaction. No suspense whatsoever. A total joke."}, {"rating": "6", "text": "It was a good action flick. The reviews i read that say \"0\" are prejudiced at best. It's an action flick; it's not a deep, artistic film. Every film can't be. I'm a big fan of deep, intelligent movies, but sometimes i want to see a good action flick. Those of you complaining because it didn't lean properly to your overly self-conscious anti-American views need to get some perspective. I'm a Middle Eastern analyst and a friend of many Arabs. This film addressed the issue of terrorism fairly well, although somewhat simplistically. Yes, there's the revenge angle that's underlying in the film. I felt, however, that the positive work between the Faris and Fluery was more apparent, as it should have been. Americans need to see that there are a lot of positive people in the Middle East just as there are in America. Not every American is arrogant and self-centered, and not all Saudis (or Arabs in general) are terrorists or anti-progression. They want 3 square meals and a hot bed just like we do. Good flick...no Oscar nominee, but a good flick."}, {"rating": "3", "text": "You people are stupid. This movie is bad if you don't like mindless action with one of the stupidest plots I've ever seen since Transformers, but what did you expect. If you thought this was going to be an intelligent action movie your an idiot. The camera work was bad, but it was done on purpose. The camera shook to heighten suspense and action like in Friday Night Lights (The Guy Who Made Friday Light Nights Made This), but it just gave me a headache, like in Friday Night Lights. The Action Was Cool, but that is not enough. If they didn't care about plot, which they obviously did not, then they should have just made a \"Shoot Em Up\" type movie, don't make bad action movies, there are enough of them."}, {"rating": "0", "text": "Is this the best Hollywood can produce? A JHS class production has to be better than this. Boring with terrible acting, directing and camerawork. Pass-a-deena!"}, {"rating": "1", "text": "Upsetting in every way. There are no films showing USA, UK (You get my point) Terrorizing innocent Iraqis, or killing suspected terrorists in Afghanistan. Hollywood is at its worst in History and i can not bear another one of these films."}, {"rating": "0", "text": "Awful Hollywood gobbily gook. Are we to believe that every man, woman, and child have guns, rocket launchers and grenades in their bed next to them? Just a failed attempt by the Guru's in Hollywood to capitalize on the negative PR of the Middle East. Awful!"}, {"rating": "0", "text": "Much ado about nothing. Pay your money, sit down and be bored to tears. There is not a single character that the viewer cares about. The story is over the top ridiculous. And the action feels about as real as a professional wrestling match. Midway thru you start looking at your watch. And that ending, what a joke!"}, {"rating": "6", "text": "It's definitely entertaining, but easily forgettable. The first half plods along and has a firm grasp of reality where a crackteam of FBI agents are stifled in their investigation by an overpowering foreign government trying to retain some control. The latter half, while definitely thrilling and entertaining with random acts of violence and gun fighting, is poorly contrived and doesn't flow with the movie all that well, and appears to be based completely on comic book logic. Example: the SUV transporting the five characters finally comes to a complete stop from highway speeds after a crash and flipping over multiple times, and not a single person is injured or disoriented. Or, 20 vs 5 in a machine gun shootout with the 5 in a disadvantaged position and they win without a scratch. While the movie started off intelligent, it turned into a comic book near the end, and then the film ended with a poorly constructed cheese-ridden political statement that left me rolling my eyes."}, {"rating": "0", "text": "Boring beyond belief. And the terrible camera work was attrocious as it was impossible to follow. Almost as if this was an amateur production. The directing and acting were abdominal. REFUND ALERT!"}, {"rating": "5", "text": "Disappointing. I just spent $14 and saw it at the Arclight Cineramadome - the most optimal setting, yet the film was a huge letdown. I'd give it a C+. If I'm not mistaken, Michael Mann produced this... That's where my high expectations came from. I did NOT care for ANY of the characters. I think the filmmakers TRIED to make a good film however, and I appreciate the effort but I was BORED, even the action at the end bored me. Since a quarter of the film focused on the forensic investigation, they should have at the very least studied the last couple seasons of CSI Las Vegas on CBS - I mean, isn't that THE gold standard? The coolest thing in the film was the graphical timeline at the opening credits... at that point I was thinking \"hell yeah, this will try to put the action in its proper context! America's relationship with Saudi Arabia and the very real blood-for-oil necessity due to our addiction... I love it...\" but of course it was just downhill from there. I do appreciate lofty aspirations, even if pretentious. Nevertheless, if you have not seen this yet, SAVE YOUR MONEY. If you are drawn to the subject matter of THE KINGDOM, I suggest you do this instead: 1. BUY or rent the widescreen version of SYRIANA. 2. BUY Seasons 1 and 2 of SLEEPER CELL (the Showtime series). Really, I'm not always this discriminating. I do know how to watch films, know how to suspend disbelief. I tried to like this, wanted to like this... But it's just no good."}, {"rating": "5", "text": "Rather limp for an action film. I appreciate the effort to use cultural conflict to create drama, but I don't believe the Saudi Arabians were well portrayed as they seemed very Western in their behavior and attitudes which tended to undercut the drama. What to say about the plot? It was almost inconsequential, really, since there wasn't much to it, and it didn't seem to drive the film forward in any meaningful way. I also question the plausibility of four FBI agents being to solve the case in five day's time, especially given the difficulties they faced and the fact that they didn't really start the investigation in earnest until the third day. By the end, the film devolves into a standard action-movie shootout with the requisite implausible physics (i.e. characters outrunning RPGs or being only slightly injured by an explosion that is close enough to shatter the windows of the vehicle they're occupying). In short, THE KINGDOM doesn't work particularly well on any level. It's barely even worth a rental."}, {"rating": "0", "text": "How lame was this? The pits!"}, {"rating": "6", "text": "Chris Cooper and Jamie Foxx are amazing actors, but they were delegated to Hollywood stereotypes. Poor Jennifer Garner"}, {"rating": "0", "text": "It doesn't get any tackier than this. Run!"}, {"rating": "6", "text": "Ended up being pretty boring. The characters were annoying, several not acting at all like professional FBI people should act. That's one problem. Another problem was that the whole thing seemed so thrown together. The characters spend seemingly the entire movie examining a watery hole in the ground...and it adds to nothing. Eventually they get in a gunfight, leading to a big action finale, and then the movie's over. Nothing seemed to \"advance\" in the story and very little progress ever seemed to have been made. The \"mystery\" seemed completely disconnected from the final action scenes, the editing was jumpy and the camera moved at a nauseating level.....ugh. Too bad, the trailers made it look amazing. It was mildly diverting at times and the music was sometimes good (although at other times it was strangely absent) but the first 30 minutes or so seemed incredibly convoluted and the movie just never gets off the ground. Just...not good. Too bad."}, {"rating": "0", "text": "Jason I read your review and you sound about 15. You have no clue about the movie other than you liked the good guys versus the bad guys shoot em up action flick. By the way who exactly were the good guys? This was a propaganda piece to capitalize on the War in the Middle East except that it backfired big time. No one can be naive enough to think that every child in Saudi, Arabia carries a hand grenade and a rocket laucher in his back pack. But somehow this is what this sorry excuse for a motion picture conveyed. The camera work was attrocious, the directing awful and the acting was a total joke. Other than than Jason this was a great movie worthy of an adolescent without a clue."}, {"rating": "2", "text": "I saw this movie at a sneak preview. If you saw the trailer you saw the movie as that was the highlight. This is nothing more than a made for TV movie despite the hype and the constant advertisements. It is paint by the numbers without any suspense. The camera work is shoddy in that it is those annoying close ups with the camera moving so you don't know who is who during the combat scenes. The actors sleepwalk through their roles as it appears they are only there to pick up a paycheck. As soon as you leave the theater this movie is forgotten. My advice is to wait for it to come out on DVD and rent it if you must. Even then you will turn it off quickly. Avoid."}, {"rating": "0", "text": "One of the boringest Jamie Fox movies of all time. His boringest was Miami Vice. I'm still at least happier that this is even better. But I still am so disappointed, the story felt so dull. Nothing special really happened for it to be good. For me, they probably could have tried so much better. Chris Cooper, you gave the only performance worth it, thank you for your cooperation, but I'm sorry you were chosen with a good cast, good role, good story, but worked with a horrible director, writer, and producer most of all. The visuals were difficult to follow, there was so much camera-shaking that the action sequences hurt the eyes after a while."}, {"rating": "0", "text": "I knew I was in trouble when the theater was more than half empty when the flick started. After 15 minutes I wanted to put a bag over my head. The movie is lifeless and the actors snore thru their paces. Everything is predictable without any suspense. And that camera work was from hell. Run away as fast as you can."}, {"rating": "9", "text": "Wow! I am puzzled by all the really low reviews of this movie. Generally when their is such a difference in ratings as this one has shown, there is a political point of view that feels threatened. First of all, only someone who has been heavily sedated would say this movie was not exciting. The action scenes were intense and brutal. My only issue with any of them was that everyone walked away from the unbelievable SUV crash near the end. That was a bit difficult to take, but otherwise Berg's work was fantastic as it relates to action movies. I enjoyed the characters, especially that of the Saudi officer that is responsible for babysitting the FBI agents during their investigation, as well as the culture shock as it relates to Saudi and Americans daily lives that permeates this film. I would have liked a little more character development, but that takes times in a day and age when film editing seems to be at a premium due to so many people being unable to sit longer that an hour and 45 minutes. A longer movie would have also helped the investigation become a little more complex and interesting for those CSI types. The main point here for all reading these reviews is that this movie was not meant to make political point in either direction. So many of the reviews seem dead set that this was some attempt to glorify war in the middle east as some sort of a right wing propaganda stunt. This movie simply depicted the very real possibility of a terrorist attack against Americans on foreign soil, and how we as a country and individuals might desire for it to be resolved or at least dealt with in some measure. The human element of anger demonstrated by the FBI agents who lost a friend, and many American families that lost loved ones seems to have struck a nerve. Why? Whether we like it or not, this is a very real scenario. Forget being wrapped up in whose fault it may be that these types of incidents occur. This movies simply takes off after the incident and gives us a view into the very difficult situation, one alternative to responding, and how those involved might actually be effected. If we can leave it that, then maybe we could judge this movie appropriately."}, {"rating": "0", "text": "Jamie Fox and cast get the job done, while action that isn't effective, dialogue that annoys, a movie that has so much cam-shake that you can't even watch it. A poor letdown, way too cliched that it frustrates your mind."}, {"rating": "0", "text": "Absolutely horrible, with a bad script, and bad acting, especially from the good actor's. It is predictable and very weak, the plot is so weak that it isn't entertaining, it is boring."}, {"rating": "0", "text": "Just bad all around. Nothing to do with the political aspect, but everything to do with the weak script and weaker acting. Juat another failed Hollywood action flick; with a little politics thrown in."}, {"rating": "4", "text": "Too shallow to be taken seriously."}, {"rating": "0", "text": "Not really an action movie but a sci-fi!"}, {"rating": "10", "text": "As I key this the score for this fine movie is 56....can you believe it.  I guess it just shows that the smart among us don't write reviews.  Good script, tight action, fine acting by foreign actors and a compelling ending make this one of the best action/drama made.  Granted the story is balanced and thus fails to present the Red, White and Blue as all good, all knowing, but the balance of the tale is outstanding and is clearly superior to any other movie of this general type.  Name one that you think is comparable, then ask how layered the plot is in your assumed favorite.  Here we start with a massive bombing and move into cultural relationships, a clever cop/buddy movie, great action, and a story that makes sense almost all of the way.  Good flick."}, {"rating": "10", "text": "The first 20 minutes give us a vital history, economic, and geopolitical lesson on the West's relationship with Saudi Arabia over the last 40 years. No oil, no problem. But since modern economies run on hydrocarbons, deep mutual ambivalences get exposed and tested. The story turns on all the conflicts these ambivalences entail. How does police-work happen in such a deeply repressive regime? Or does it happen at all? The finale tells us the folly of \"policing\" as an anti-terrorism policy - the same Clintonian policy that failed so spectacularly on 9/11, which President Hillary would revive through her foreign policy adviser Richard Holbrooke. Will we let history repeat? Together with \"United 93\" and \"A Mighty Heart,\" this is the most important political film released in theaters you can see since 9/11. See it, grasp it, and vote accordingly."}, {"rating": "8", "text": "I read most of the reviews about this movie on Metacritic before watching it. I was puzzled by the users votes which were mostly 0s or 8s and 9s and nothing in between. Since the subject matter of the movie is one that interests me, I decided to see it, regardless. Well, the movie was actually pretty good. The Idea that we could actually look into Saudi Arabia was pretty exciting, though I don't know how much of it was filmed there. The plot held together and there was a great deal of veracity (which I enjoy). I think that the people whio are giving this movie a 0 or 1 rating are the same people who can't watch United 93 (a superb movie, by the way) because it contains too much truth. People don't like the truth for some reason. My guess is that they are people who are so tricked by multi-culturalism that they cannot even conceive of a good-guy/bad-guy scenario, and hence do not follow what they are seeing in this movie."}, {"rating": "8", "text": "Went in not expecting too much, due to low ratings on this site. However, came away pleasantly surprised. Good acting, story, incredible action scenes. Don't believe the haters, go check it out for yourself."}, {"rating": "6", "text": "I guess the film's sink into a generic action movie is great for anyone who can't stand politics for very long, but for the rest of us, we just walk away feeling cheated out of a potentially great movie."}, {"rating": "9", "text": "A very good action thriller that is just what is advertised...an edge of your seat thriller. Yes, the shaky hand held camera work is not what I like to see but we seem to be getting this kind of editing in action films nowaday so ....and yes the left wing looneys are panning it for no apparent reason other than to think they see something in this film that is proAmerican. So what else it new."}, {"rating": "9", "text": "I thought this was an incredible film, it had my attention from beginning to end."}, {"rating": "8", "text": "Why all the negativism about this really decent movie? Users have called it boring"}, {"rating": "10", "text": "This movie was well directed, well written and the fight scenes reminded me of black hawk down."}, {"rating": "9", "text": "I thought it was terrific, scary and brutally honest - great acting by the way."}, {"rating": "7", "text": "CSI DUBAI!!!...... amateur tv directing... he even used the same music from Friday night lights... good, but not great script, with amazing theme. Peter Berg blew what could of been a great movie. If only Michael Mann had stayed on as director. i still suggest seeing it, cause the third act is a great ride, and some of the political subtext is interesting. Jamie Foxx rocks as always, but Jennifer Gardner should stay at home with Ben. I think if you go in with low expectations, you'll love it. And I really just blame Peter Berg for not understanding the art of storytelling."}, {"rating": "8", "text": "Just saw it tonight in packed west side nyc theater. Very well made action movie that's about something real..."}, {"rating": "8", "text": "Great action, interesting story and characters. Good humour to between the FBI guys and the Arab handlers. I thoroughly enjoyed this movie. The final action sequence really had me riveted."}, {"rating": "8", "text": "Don't know what all the \"zeros\" are for. Obviously prejudiced views, i guess. Excellent movie. Did a good job presenting a complex situation in an understandable way (i.e. culture clash, military/political conflicts of interest, etc.). Good writing, good acting, incredible shots of middle east (I don't know how they did that). One of the best movies I've seen in recent years."}, {"rating": "7", "text": "Wow! Did this film stir a hornets nest! First off, this is not a documentary or a true story or even an attempt to convey truths. It is simply a action military film that was fun and exciting to watch. To read anything more into it assumes that the viewing public does not know it is not real."}, {"rating": "9", "text": "Too sophisticated for the average American viewer. Excellent blend of Hollywood entertainment and the political realities of navigating the complex ocean of foreign affairs."}, {"rating": "6", "text": "Kingdom was ok but it felt like every Middle East set terrorist vs. America movie I've ever seen. I literally turned to my wife in the theater and said \"I think I saw this in another movie before. Must be Deja vu\"."}, {"rating": "8", "text": "Saw it for free in a prerelease. Normally I don't go see Middle East war/terrorism themed movies, but it was free. The crowd was pretty into it, clapping (watch for a knife thru the groin), laughing (surprisingly humorous at parts), and groaning in outrage (because you know people are going to die). The Westerner/Middle Easterner themes are pretty cliche, but still well done and provocative. There are a few confusing points toward the end, where things start to get a little unbelievable (watch them take out a bunch of people in the inevitable huge fight scene and somehow avoid a few rocket launchers while they're at it). The actors were good, especially the guy who plays Colonel Al-Ghazi. Jason Bateman, the guy from Arrested Devolopment, is a good comic relief guy. Although Jennifer Garner doesn't look convincing when she cries... But oh, man... the shaky camera scenes gave me a headache halfway through. It won't happen to most people, but I heard a lady in front of me complaining about it, too. All in all, I would recommend it. Nothing groundbreaking, but worth the trip."}, {"rating": "8", "text": "I am amazed at the negativity of the critics of this film. They seem to think that because a lot of terrorists are killed in the film, that it represents a form of psychological revenge that the audience will enjoy. Careful viewing will show that the Muslim characters in this film are consistently many steps ahead of our heroes (the alleged Osama look-alike most of all) and that it is by admittedly somewhat hoaky action movie luck that any escape alive. America is involved in the domestic affairs of countries like Saudi Arabia, and often that involvement leads to violence. Americans do need to see a positive portrayal of Muslims like Barhom's character to appreciate the sacrifice of those who, as a result of our actions, stand between our hatred and the hatred of some of their own people in order to serve their country. As usual, many reviewers have viewed this film through a West-centric lens, refusing to see anything but Iraq and military frustration in a film that, while in many respects a conventional action movie, nevertheless has much more to say."}, {"rating": "6", "text": "This is a film that doesn't pace itself, first turning to plot, then action, then boredom, then ending. It has so many empty characters, so many missed chances to thrill us, to wow us. Boredom- Towards the middle of the film, the action takes a backseat to try and support the weak plot that follows. In fact, the entire plot seems to center around politics and not enough on character and action. If I wanted a movie about politics, I would've watched one. What I wanted was an action movie, and from the looks of the trailer it seemed like an action thriller. In other words, the action wasn't even action. They seemed more like scene to intensify the movie, in which it fails. There are so may flaws with this movie, it's hard to pay attention to it without losing interest in it."}, {"rating": "4", "text": "This movie was OK at best but the problem I had was it felt like an American propaganda film, especially with the \"Kill them all\" remark at the end. Just my two cents."}, {"rating": "8", "text": "A good movie that really shows what was going on in the Middle East at the time it was made."}, {"rating": "5", "text": "Well setup but fades into mediocrity by the end. Foxx is possibly miscast. Music is a highlight."}, {"rating": "6", "text": "The Kingdom, at its best, is a riveting and powerful look at the effects of war on those in the Middle East and in the United States, as well as the politics leading up to modern day conflicts. At its worst, it is an anti-Muslim film that plays far too much into action movie cliches. The positives largely come in the first half, in which the film is far more detective-based as this group of FBI agents head to Saudi Arabia to investigate who perpetrated a bombing in the American compound in the country. Here, the writing is quite good and the film showcases just how much the Saudis hate the terrorists as well. However, it seems as though director Peter Berg thought this was boring and decided it was best for the final half hour to turn into a shoot 'em up action movie that demonizes the Saudis and half hazardly tries to show some of their humanity, only to revert to concluding that everyone - even children - are evil anti-Americans. This is unfortunate, but luckily does not completely wipe out the positives of the first half, in which the film is a very compelling and interesting look at determining the guilty parties behind such an awful attack. If only Berg had confidence in this portion of the film enough to see it through to the end without relying on every cliche in the book."}], "recommendations": ["london_has_fallen", "the_purge_election_year", "zero_dark_thirty", "elysium", "jarhead", "run_hide_fight", "repo_men", "the_1517_to_paris", "american_assassin", "blackhat", "infinite", "sicario_day_of_the_soldado", "13_hours_the_secret_soldiers_of_benghazi", "guns_akimbo", "taken", "green_zone", "dragged_across_concrete", "mile_22", "equilibrium", "olympus_has_fallen", "code_8", "12_strong", "what_happened_to_monday", "geostorm", "children_of_men"]}