{
  "id": 3564,
  "title": "The Boxtrolls",
  "starring": [
    "Ben Kingsley",
    "Isaac Hempstead-Wright"
  ],
  "runtime": 97,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Fantasy"
  ],
  "description": "An orphaned boy raised by underground creatures called Boxtrolls comes up from the sewers and out of his box to save his family and the town from the evil exterminator, Archibald Snatcher.",
  "releaseYear": "2014",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xDw2kqSDsYneL3g9OIpExPfqpHJ.jpg",
  "categories": {
    "plot": 6.967741935483871,
    "acting": 7.2,
    "ending": 8.5,
    "soundtrack": 7.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 7.3125,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The animation is great, the voice characterizations excellent as well.  However, when I watch an animated film I expect to laugh.  I never laughed out loud once, only a chuckle here and there when the boy interacts with his fellow humans for the first time during a party.  In fact, I laughed more during the preview of the SpongeBob Squarepants movie before this movie started than I did for the entire Boxtroll film.  I'm sure you will be asking yourself the same question I did - how did this boy learn to speak perfect English since he was raised by trolls that don't speak English?  I also thought the filmmakers were trying to cash in on the Minion craze, and Minions are much funnier.  Still, I appreciated all the work put into the film and I didn't get bored so I give it a pass.  Barely."
    },
    {
      "rating": "5",
      "text": "Far from a visual masterpiece, the Boxtrolls misses the magic of the animated classics which have come before it. There are charming moments--but they are easy to miss amidst some grotesque visuals."
    },
    {
      "rating": "7",
      "text": "You know in those Claymation movies where the characters have skinny arms and legs, but they have big belly's, um... something is not right about that.\r The story is about a young orphan, raised by subterranean trash collectors, must find the hero inside when an evil exterminator threatens his family.\r The beginning of this movie started a bit slow and I wasn't feeling it, but as the film went a long it became better. The voice acting in the film was well done. The villain in the film to me had a really stupid plan that didn't make scenes at all, and he was a cliche messed up villain with nothing really new to him, but Ben Kingsley did a good job voicing him. The jokes worked at times and sometimes they don't. But overall the Boxtrolls is a solid family movie with so dark scenes and such messed parts that might scary kids a little."
    },
    {
      "rating": "5",
      "text": "Although the Boxtrolls is visually stunning and funny at times, it is still quite forgettable, with some unlikeable characters and a few unnecessarily random jokes. And, like most movies nowadays, Boxtrolls has the need to get all loud and noisy like some superhero movie towards the end."
    },
    {
      "rating": "9",
      "text": "Very very nice movie, its weird as hell, but that's what you should expect after Coraline, Paranorman and the night before Christmas. The downside its that this movie is not for everyone and its absolutely not aimed to children, it is going to have a lot of bad reviews just because the target population is not as broad as a disney-pixar movie."
    },
    {
      "rating": "10",
      "text": "A masterpiece. I can't understand why this doesn't have a perfect critical score. So funny and smart and beautiful to look at. Really loved it. I love that movies for children are evolving in the substance of their messages."
    },
    {
      "rating": "6",
      "text": "The first film from Laika was the wonderfully gloomy \"Coraline.\" They got even darker with \"ParaNorman\" and have moved into the grotesque territory this time. A strangely quaint village is terrified of the underground trolls who wear boxes like turtles. When an orphan who they raised surfaces, he sets out to make things right. There's no denying that the stop-motion animation is amazing, but the art direction and character design is downright bizarre. Some of the thick British accents present challenges, especially at the beginning. This variation on a traditional story is framed in a twisted creation. NOTE: Stay thru the credits for a fascinating look at an animator working."
    },
    {
      "rating": "7",
      "text": "The Boxtrolls has many of the hallmarks of the previous films; bizarre angles, strange-looking characters, and a kind of fearlessness, an ability to gaze at darkness head-on."
    },
    {
      "rating": "7",
      "text": "The Boxtrolls features an almost entirely English cast, the rest donning false yet convincing accents, in a stop-motion fantasy-comedy from the animation team responsible for Coraline and ParaNorman, two of the finest animated films of recent years in my opinion. This is a team that knows what they are doing when performing stop-motion. Here blending it seamlessly with computer-generated effects, lead animator Travis Knight is joined by Open Season director Anthony Stacchi and newcomer co-director Graham Annable in producing a creative and joyful, if a tad underwhelming, film with a look and color palette that can best be described as grimy; although since that is the point, this description is meant as a positive.\r In the town of Cheesebridge, a town largely obsessed with one thing (and it is not bridges), there live an underground group of creatures called Boxtrolls, strange little goblins who wear cardboard boxes for protection and who come to the surface at night to steal and collect garbage. One night, they are seen kidnapping a baby boy. Town exterminator Archibald Snatcher (Ben Kingsley) reports this to the town’s leader Lord Portley-Rind (Jared Harris), who charges Snatcher with the task of eliminating all of the Boxtrolls in exchange for a seat of power. Ten years later, the kidnapped boy (Isaac Hempstead-Wright), named Eggs after being fitted with a cardboard box of…well, you can imagine…is seen living happily as one of the Boxtrolls. He is spotted in town by Lord Portley-Rind’s daughter Winnie (Elle Fanning), who follows him. After realizing who he is, and that Snatcher is sure to try to kill him, Winnie helps Eggs and the rest of the Boxtrolls to fight back, and also to find peace with the humans.\r Reading this description, I realize you may be tempted to tag this movie as predictable and move along. This is perfectly understandable, and the film absolutely falls in line with many family film conventions in terms of story. However, it is the heart and humor of The Boxtrolls that sell it. I must remark on the first act of the film, showing us the underground world that the Boxtrolls have built, and Eggs adjusting to it. With the Boxtrolls speaking largely in grunts and guttural noises and Eggs at this point being an infant, this sequence is done almost entirely without dialogue. The filmmakers knew to let the scene rely on music and visuals alone, and it was a perfect choice. The first ten or fifteen minutes are enthralling as a result; heartwarming as we see the Boxtrolls bonding with Eggs, and humorous with seeing the creatures’ everyday activities and quirks. Unfortunately, it is when the plot kicks in that the film begins to slip.\r With the exception of Elle Fanning’s Winnie, the humans in the film are dependent on stereotypes and caricatures in order to keep the story moving. Winnie’s father, for example, is a caricature of the stuck-up royal father who won’t listen. With proper writing, that type of character can work very well; here, however, he is exaggerated beyond the point of return, and becomes exceedingly frustrating, more so than I think the movie intended. Ben Kingsley does bring out a supremely entertaining villain in Snatcher, and in terms of character, hits all the right notes. Snatcher is intimidating, and over-the-top in all the right ways; ways that make him wonderfully theatrical. Once again, though, writing creeps in and a running gag is introduced involving Snatcher and his love of cheese which frustrates once again, as well as disgusts with some of the imagery involved. If you read my previous review, you know I love disgusting imagery when it works, but here it is grotesque, unnecessary, and annoying.\r The film does admittedly attempt to comment on the absurdity of some cinematic stereotypes with a running joke regarding Snatcher’s henchmen, constantly wondering whether they are the good guys or the bad. Some of these jokes are funny and poignant, however the gag runs its course very quickly and becomes a bit too on-the-nose to sustain the humor that it wants to.\r The Boxtrolls picks up again in its third act and the final action sequence. One impressive thing about the film is that, where most animated family films of today would shy away from portraying death, this film is refreshingly blunt about it. As someone born in the early 90’s, I grew up with plenty of family films which showcased death proudly. One of my earliest movie memories is The Lion King, and although Mufasa’s death did strike me as a child, I don’t believe it to have had any sort of negative effects. In fact, I admire the film today even more because it didn’t shy away. For that very reason, I must give The Boxtrolls a level of respect and gratitude for not patronizing its audience. Without giving too much away, the third act gives us a rather shocking display of death, and the way it is dealt with and later resolved is very well done.\r Thus, although drooping in quality in the middle section with a slow-moving story and frustrating character, The Boxtrolls is a worthwhile experience for its beautiful opening, its captivating animation, and its mature, respectable conclusion. Since it is classified as a comedy, I must stress that the quality of the humor varies greatly throughout the film, however those funny moments which work are in fact very funny, and worth the groaners. I doubt this will leave much of a mark in terms of great animated films, but, for what it is, it is at the very least worth a rental.\r Thanks for reading!"
    },
    {
      "rating": "8",
      "text": "This movie has really good animation for a stop motion and the plot is emotional at the beginning. Though the entire plot is iffy and the suspense is weak, This movie is really good. 7.7"
    },
    {
      "rating": "0",
      "text": "I saw this movie in cinemas with a family member and I regret going. I thought this movie was terrible very boring. I don't think any kid should see this movie. I'm very disappointed. I thought some scenes of the movie weren't necessary. It didn't have much of a fun story. But if you are going to see it warning some scenes are dark.\rDont get this movie its very disappointing. WORST movie I've ever seen!"
    },
    {
      "rating": "9",
      "text": "This 3D stop motion animated film is for children, although some parts of it might give the kids bad dreams, even though all's well that ends well. The viewer is enticed by a richly dark vision of the streets of London circa  late 1800's, when the townsfolk were undereducated, vulgar, and easily seduced by myths, superstitions, and local legends. There are well-defined class strata characterized by the aristocracy, who eat the finest cheese in the town of Cheesebridge and who wear white hats, and the working class shmegegges, who speak a thick brogue, are quick to initiate witch hunts, and wear the inferior red hats. At the center of their low-class hysteria is the knowledge that the town is infested with little monsterlike trolls who live in the sewers and who are said to snatch children and valuables; the trolls are purported to have once eaten an abducted baby. The little monsters  have no clothes, and they hide their nakedness by wearing boxes around the midriff, taking their Christian names from whatever product appears on the box labels—hence, Fish, Oilcan, Wheels, and Shoe, among others. The boxes have a dual function because at any time they can hunker down and snap the lid closed in order to hide in plain sight, which they do whenever they feel threatened or scared. They speak a funny alien language understood by only one human, Eggs (Isaac Hampstead Wright), the baby they abducted but did not eat; in fact, they lovingly raised the child as their own, having abducted him only to rescue him from a malevolent force.\r Back in town the aristocratic mayor, Lord Portley-Rind (Jared Harris), feels that the boxtrolls are vermin who have to be exterminated. The trolls are safe in their underground lair by day, but by night they emerge to rifle through garbage cans for interesting odds and ends that they use for a surprising purpose—they are in fact brilliant engineers. Their underground cavern has a ferris wheel, fantastic gadgets, and they have strung the roof of the cavern with light bulbs that mimic the stars in the night sky. The trolls are a loving community of harmless little imps, so ugly that they are almost cute. They snack on ladybugs, their favorite meal. But a menace is at work in the land of the humans, as the mayor enlists the help of a ruthless businessman named Archibald Snatcher (Ben Kingsley) to use his mobile contraption to wipe out the trolls. It is a long and arduous process that goes on for almost ten years. As the troll population dwindles, Eggs turns 10 and begins to understand that he is different from the trolls, a human who tragically lost his parents as a baby. He becomes an advocate for his surrogate troll parents, and it is his destiny to save the trolls from extinction. In the process, he meets the mayor's daughter, who befriends him and supports his mission, little Winnie (Elle Fanning).\r Snatcher longs to trade in his red hat for a white hat, the equivalent of ditching his Honda Civic and buying a Ferrari, a goal he will attain if he wipes out all the boxtrolls. In Cheesebridge,  another symbol of ultimate class is having the luxury of eating the finest cheese at cheese-tasting parties. The mayor spends many tax dollars on acquiring the world's best cheeses, even if it means canceling the plans for a children's hospital. Ironically, Snatcher aspires to this cheese-loving elite even though he is violently allergic to cheese, which causes his face to become dangerously swollen.\r Snatcher's henchmen are the ones who have to actually take the adorable monsters by surprise and capture them as the trolls sit helplessly shaking with terror in their little boxes. The trolls are as innocent and as playful as pups, and Snatcher's henchmen become vaguely aware of this dilemma as they continue their roundup. They have been convinced that the trolls are evil and that humans are good, and that it is for the good of human civilization that all trolls should be exterminated. In reality, Snatcher postpones killing the trolls and takes them back to his factory where he employs their engineering skills through forced labor, a bit like a concentration camp.  The henchmen gradually become more and more uncomfortable with their reign of terror and their Gestapo tactics, as they begin to glean the true nature of the trolls, and it is up to Eggs to save the day.\r The children may end up having nightmares, nevertheless the film is an interesting child's morality play on the nature of good and evil, as well as a subtle commentary on racism, antisemitism, and intolerance."
    },
    {
      "rating": "8",
      "text": "It's a very entertaining film.Good storytelling, good animation and good characterizations, but what I liked the most is Dario Marianelli's score, really perfect.When it ended, I found myself singing ''The Boxtrolls Song''"
    },
    {
      "rating": "8",
      "text": "I loved this movie. It wasn't as outright funny as some pixar movies but the story was engaging and the animation great and I liked the atmosphere. I don't really get why some people didn't like it, it was much better than most animated disney flicks. I'd much rather watch boxtrolls than tangled or frozen again.\r The only warning I'll give is it's dark (there are scary looking british villains with nasty crooked teeth and loud grappling guns cackling and hunting trolls) and might not be suitable for a sensitive child. My 2 year old was scared during a few parts but she managed."
    },
    {
      "rating": "8",
      "text": "\"The Boxtrolls\" has been receiving some...criticism? I don't know how to describe it, but it's seems like filmgoers are generally seeing this as one of Laika's lesser films. Outside of this, I've only seen \"Coraline,\" so I can't really compare, but all things considered, \"The Boxtrolls\" is definitely a well-made animated film. It's pretty funny, the characters are solid, the animation is great, and the film is exciting. Sure, the writing isn't as tight as it could be, but all in all, \"The Boxtrolls\" is a fun animated film that, while it might be a bit too gross-out for some younger viewers, is definitely worth a watch."
    },
    {
      "rating": "9",
      "text": "The Boxtrolls es una de esas películasde animación disfrutables y que son bastante adecuadas para los niños.\r Esta película nos demuestra y es otro ejemplo deque Laika Entermainent nos ofrece trabajos de animación de calidad (ya que están también Paranorman, Coraline, Corpse Bride), y ya este es otro trabajo de esta empresa hecho en Stop-Motion, que resulta entretenido, carismático, divertido y que tiene un diseño de arte muy realista y bien hecho, que hacen de este film un placer para la vista."
    },
    {
      "rating": "8",
      "text": "Compared to other animation, even Pixar, this is a master class in character animation and what can be done.  I'm with the top review on Metacritic:  100\rI can't remember the last time I saw a family animation so visually rich, tightly scripted and charmingly performed which was also built on a sound and progressive message.\rNick Frost and he Snatcher voice really make their characters live and breathe.  Simon Pegg and Eric Idle also contribute to the Terry Gilliam Pythonesque rowdyness."
    },
    {
      "rating": "7",
      "text": "3.5/5★ Pixar, Disney and Studio Ghibliy all have a unique style and content. Laika, a stop-motion animation studio, has branded itself as the studio with movies that explore the darker aspects of human nature. Films like Coraline (a personal favorite) and ParaNorman explore themes that aren't Disney bright or Pixar precious. The Boxtrolls, Laika's newest film, is a continuation of that direction. There are truly awful people, a sense of unbalance(The henchmen have a continuing philosophical discussion as to the dubious nature of their activities) and there are no cutesy creatures to delight the eyes- if anything, The Boxtrolls are anti-cute.\rThe amount of detail is fantastic, almost to the point of distraction, but the story is a little weak and there's a lot of social class commentary under the surface that can be too obvious.\rVerdict: Watchable."
    },
    {
      "rating": "7",
      "text": "Gorgeously made with some smart and fresh elements -- namely the writing for Pickles & Trout. I think what holds Laika back is the maturity levels--I'm not entirely convinced the writing is accessible to a younger audience and it keeps them from wider box office success. But perhaps that's what makes films like The Boxtrolls so immensely enjoyable and meaningful for adults.\r As many have said, the credits and post-credits scenes offer a great lingering after-taste."
    },
    {
      "rating": "7",
      "text": "Laika Studio proves itself to be the \"Anti-Disney\" with this beautifully rendered but somewhat dark tale of creatures that lurk in the dark. It's not really all that family friendly as it proves to be kind of scary (even disgusting), at times, but it's quite well voiced by a stellar cast. It doesn't have the charms of \"ParaNorman\" because of its darker side, but it's still entertaining"
    },
    {
      "rating": "7",
      "text": "Grande animação, mais um belo projeto do estúdio Laika, que fez belíssimas animações como Coraline e ParaNorman. A exemplo dessas animações anteriores, The Boxtrolls é uma animação mais obscura que as animações tradicionais. Longe das coloridas animações da Pixar e da Dreamworks, a Laika aposta em animações com tons mais sombrios, mas mantendo sempre aquela 'graça' que toda a animação tem, que consegue encantar crianças e adultos. O estúdio Laika mais uma vez abusa da ideia de mostrar uma história com um plot simples, clichê, com uma lição de moral no final, para com tudo isso agradar as crianças... E ao mesmo tempo, utiliza várias camadas da história para fazer críticas sociais que com certeza apenas os adultos vão intender, como por exemplo a questão da divisão de classes sociais, o 'poder' representado pelos chapéis e do 'dinheiro' representado pelo queijo. Enfim, uma animação bonita, com uma história legal e divertida. O charme das animações stop motion está presente, entretanto com alguns leves toque de computação gráfica para melhorar alguns aspectos como iluminações e etc. Recomendo o filme para crianças e adulto! Laika mais uma vez de parabéns, mostrando que cada vez mais está rumando entre os grandes estúdio de animações de Hollywood. Para mim, 7/10."
    },
    {
      "rating": "7",
      "text": "It's predictable and a little too over the top for sure, but The Boxtrolls is definitely a fun and oddly charming movie for all ages. Combine this with beautiful stop motion animation and you've got a pretty solid flick."
    },
    {
      "rating": "9",
      "text": "Best animated movie of 2014. The characters actually mean something(unlike Big Hero 6), the story is entertaining, and the graphics are absolutely gorgeous. This should have beat that crappy Big Hero movie."
    },
    {
      "rating": "8",
      "text": "I cannot comprehend why this is always thought of as Laika's worst. It's the opposite. It's different. Snatcher was really well done, he was a really creepy villain, especially for a villain in a kids movie. It provided a lot of laughs and exceeded my expectations (I expected it to be decent but not as good as it was). It's a good movie, recommended for adults as well as kids. Not for very young kids though-as I mentioned before, the villain is very creepy and some scenes might scare small children. It depends on the viewer of course."
    },
    {
      "rating": "7",
      "text": "The Boxtrolls is another great film that sorta missed the feelings for Coraline and ParaNorman, but either way, it's another excitement waiting for you."
    },
    {
      "rating": "5",
      "text": "It's my least favorite Laika film. I fell asleep twice watching it. It has a weak plot. Visually speaking, I think ParaNorman and Coraline have a better and more beautiful animation. I really liked the way they handled the villain, his alter ego is probably the best thing of the movie. The film does leave us with a good message that Laika likes to put in their movies... The real monster is the human being."
    },
    {
      "rating": "7",
      "text": "Gorgeous animation, likeable characters and a talented voice cast make The Boxtrolls a solid, if not memorable addition to Laika's library of animated films."
    },
    {
      "rating": "0",
      "text": "I've never seen such a bad movie. The Boxtrolls has a poor story and voice overs, and nothing can save it from the creepy animation. The visuals are so distracting because it looks so stiff, and is really hard to watch. The whole film is awful, and I didn't enjoy one part."
    },
    {
      "rating": "7",
      "text": "Laika's The Boxtrolls is yet another flawlessly animated film with a great story as well as some pretty good characters. I have to say, I didn't really like this film as much as the previous too. It has a lot more childish humor that I didn't really like. But overall, this is a great film and my rating is 7.4/10"
    },
    {
      "rating": "7",
      "text": "This is an adventure comedy film, featuring themes including genocide, adoption and prejudice. It was filmed using stop motion animation and indeed it reminded me of the Nick Park Wallace and Gromit films at first, with shots of old cobbled streets and rather quirky old buildings shown, plus numerous examples of our titular people. The only trolls I knew of in my childhood were the tiny Scandinavian made ornaments with brightly coloured hair but thats just a sidenote lol. I liked the sound of the story and I'd heard this film was recommended by BBC film critic Mark Kermode, so thats why I decided to give it a watch.I did think that it appeared slightly dark at times, in terms of lighting, including quite early on, during scenes set on streets outside. This could perhaps be an issue depending on the environment your in when you watch such a film. I was left thinking about when I was much younger and struggled to be able to view films clearly in full as a large window was right behind our one TV screen back then and in summer, obviously the sun had a habit of causing a lot of reflection, which was never entirely fixed by curtains, so trying to watch what were quite prevalent back in the 80s, that of dark lit films, was an issue. However, things do brighten up a bit after a short while and I was taken aback by the quality of the visual effects, the stop motion animation, which was really quite impressive. Viewing the titular creatures in their underground lair was (to  me anyway) quite cute in one sense but also engrossing and pretty, as I say, impressive, with a nice use of multiple colours lighting up different areas.I found said Boxtrolls to be really quite endearing, with their talents shown including playing music and doing numerous quirky things, while trying to entertain the young boy, known as Eggs. I found myself hoping for the best outcome for both Eggs and the Boxtrolls and I'd say the characters are really quite endearing, if you allow yourself to have any potential emotional attachment to inanimate objects of course but I could well imagine children quite enjoying this film and while it isn't especially choc full of jokes that adults may pick up on and appreciate but which wouldn't register with kids, which is sometimes the case in kids films, I'd be surprised if a great many adults wouldn't appreciate the film for the style of animation used and the generally enjoyable characterisation overall.Cast wise, Isaac Hempstead Wright provides the voice of Eggs, while Lord Portley-Rind (if that isn't an upper class aristocratic name then I don't know what is!) features the voice of Jared Harris and Mr. Pickles is voiced by Richard Ayoade. Nick Frost voices Mr. Trout and Tracy Morgan (of US show '30 Rock' fame) voices Mr. Gristle. However, perhaps the biggest name present in the cast is that of Ben Kingsley, who provides the voice of Archibald Snatcher (booooo).I quite liked the musical score, with some tracks featured including the titular 'The Boxtrolls Song', featuring words and music by Monty Python star Eric Idle and performed by Mark Orton and Loch Lomond. Most of the other pieces featured are by Dario Marianelli - they sounds fairly typical of a family film, quite rousing, tension enducing orchestral style pieces.Content wise, the film features one or two very mild instances of partial nudity, mention of somewhat violent or otherwise distressing acts, although these aren't visually depicted and there is a clear sense of peril present for a fair amount of the film. The film has been given a PG rating to reflect this content.The plot was a little bland for adults I suppose but it is primarily a kids, or certainly a family, film. I liked it overall and think its a generally good film but it could perhaps have been a bit better.Yes, I'd recommend this film. I thought it was quite endearing, very watchable and with quite quirky characters and a good voice cast, plus the stop motion animation is impressive, plus the themes are fairly honorable. There is little to complain about really, although the plot is a little bland for older viewers and there were one or two scenes featuring very dark lighting, which may or may not irritate the viewer."
    }
  ],
  "recommendations": [
    "the_good_dinosaur",
    "ratatouille",
    "the_road_to_el_dorado",
    "okja",
    "the_croods",
    "smurfs_the_lost_village",
    "antz",
    "rio_2",
    "shark_tale",
    "trolls",
    "gremlins",
    "finding_nemo",
    "rango",
    "flushed_away",
    "the_iron_giant",
    "cloudy_with_a_chance_of_meatballs_2",
    "shaun_the_sheep_movie",
    "smallfoot",
    "turbo",
    "kubo_and_the_two_strings",
    "raya_and_the_last_dragon",
    "the_lego_movie_2_the_second_part",
    "despicable_me",
    "the_secret_life_of_pets",
    "madagascar"
  ]
}