{
  "id": 631,
  "title": "The Expendables 2",
  "starring": [
    "Sylvester Stallone",
    "Jason Statham"
  ],
  "runtime": 103,
  "genre": [
    "Action",
    "Adventure",
    "Thriller"
  ],
  "description": "Mr. Church reunites the Expendables for what should be an easy paycheck, but when one of their men is murdered on the job, their quest for revenge puts them deep in enemy territory and up against an unexpected threat.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4EBO8aIeP2bF1jGpwbuRS4CFMca.jpg",
  "categories": {
    "plot": 6.818181818181818,
    "acting": 6.2,
    "ending": 7.909090909090909,
    "soundtrack": 8.333333333333334,
    "cinematography": 7.5,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 7.7701149425287355
  },
  "reviews": [
    {
      "rating": "7",
      "text": "To anyone who give this movie a Negative review... C'mon!!! This movie was EXACTLY what it intended to be; mindless, over-the-top, cheesy fun. If you went into the theatre expecting anything else, that says more about you than the movie. No one set out to get any Oscar nominations for this film, and the acting is downright laughable at times, but it's fun! Stallone, Arnold, and Chuck Norris delivered exactly what one would expect from them. Even Jason Statham, who always seems to take his characters a tad too seriously, seemed to be having a laugh making this. Grab some popcorn, check your brain at the door, and enjoy this film. Just don't take it - or yourself - too seriously!"
    },
    {
      "rating": "6",
      "text": "What do you expect from Expendables 2? More of the same; a homage to action stars of the 80's, this time including Van Damme and Chuck Norris into the mix.  Highly entertaining and a bonafide world wide box office hit. However, actions sequences felt derivative, the only entertaining value was seeing all of your action heroes of the past, collected under one 'roof' so to speak."
    },
    {
      "rating": "8",
      "text": "Simon West's impressively mounted comeback feature after Con Air, is packed with a collage of 1980s era testosterone action awesomeness, homages, references and a very good time at the movies. The Expendables Team is far more comfortable in their roles, and the added players, especially Chuck Norris and Van Damme greatly contribute to that rare sequel that dramatically surpasses the original. The action sequences are well crafted, production values are higher than expected from the trailers - and most of it all works. Stallone and Team have created a great vehicle for expendable talent in front and behind the camera to showcase they've still got it, or for deserved stars like Terry Crews, those who should have a  feature shot. Redemption for the lame original has been earned."
    },
    {
      "rating": "10",
      "text": "Despite the actors showing signs of aging, this movie as they say in the 'Good Ole Days' is action packed from beginning to end. I seriously loved the 2nd Expendables movie than the first one. Get ready for a lot of one liners and tons of action from our old heroes. I can see people adding this one to their collection when it releases to DVD. Despite what the critics say, go see this movie if you were ever a fan of any of them in the movie. Just seeing Rambo, Terminator, John McClane and Chuck Norris with Weapons of Mass Destruction shooting the screen up at the same time is worth it!"
    },
    {
      "rating": "10",
      "text": "Some films represent a director's vision for a masterpiece. Other films are nothing more than the wild fantasies of boys and men. The Expendables 2 is certainly the latter. It's an example that not all films have to be epic masterpieces or avant-grade art galleries. As a sequel to the first Expendables film, there is relativity little continuity. But with plenty of explosions, gunfire, crazy stunts and the world's greatest action stars, you have the perfect recipe for a mindless action romp. With corny one-liners, a satisfying climax and vehicle stunts that you wish you could try at home (but probably shouldn't), The Expendables 2 is great for bachelor parties and mens' night out. To sum it all up, The Expendables 2 is like a video game come to life, complete with a throwaway story, quirky jokes and more lead than a pencil factory (even though pencils don't use lead anymore, but how else could I have made that joke?\"). If you want some serious drama, then this film is not for you. If you want to see some multi-million dollar action stars doing what they were born to do, then this film is the place to see it!"
    },
    {
      "rating": "8",
      "text": "This is everything you could have ever asked for in an action film: Tons of action stars, lots of explosions, bodies flying everywhere, and lots of one liners. Oh, and don't forget the cheese. Nothing makes an action film more entertaining than making it cheesy and over the top. The Expendables 2, although not art, will entertain any fan of crazy action films. As long as you don't take it TOO seriously, even though I thought the film got a little too serious for its own good in a couple of scenes, you will walk out satisfied. The acting and story are nothing worthy of an Oscar, but the actors and the writers, one of them being Stallone, get the job done. Some may gripe about how the film takes about 40 minutes to go from the 1st action scene to the next, but at least this establishes the actors and the tone that we're settling for in an hour and a half movie. When the action happens, it's great fun to watch, and that's all that should matter in a film like this."
    },
    {
      "rating": "10",
      "text": "The second installment of this action series is a significant improvement over the first. The additions of Chuck Norris, Van Damme and additional screen time for Bruce Willis and Arnold help. Adding a new director gives the movie a bit more depth than the original. All in all, if you are a male who lived through the 1990's, this is clearly a must see."
    },
    {
      "rating": "8",
      "text": "I'm giving this movie an 8 because it was way more fun than any critic seemed to understand.  That said, please note this caveat - I'm a product of the 80's when all these guys were the stars of the day and I'm a big believer in action movies where you can actually tell what's happening in the action sequences, which you can in this.  I'd go as far as to say this is Simon West's best film.  But if you're under 25 and don't care about old movies at all, this flick may hold no satisfaction for you.\r I also don't think it has quite as much soul as the original and it isn't as much of a surprise.  I miss those scenes with Mickey Rourke in the tattoo parlor which were aimless but heartfelt.  But in every other way I think it's a better movie.  By today's deplorable standards, the plot is standout.  The Chuck Norris stuff is great but if you're not in on the Chuck Norris joke or you think it's played out, then, I don't know, go see \"Beasts of the Southern Wild.\"  (I've killed a lot of quillboars in the Barrens, so that's my idea of beasts of the southern wild!)  Also, I do believe this is Dolph Lundgren's best work.  I know that's not saying much, but it's got to be worth something."
    },
    {
      "rating": "9",
      "text": "I don't understand the low reviews given out by the \"critics\". They obviously did not read the genre of the movie. It is an Action Adventure movie. So before you say \"oh it was terrible, I couldn't watch, the guns made my ears hurt...\" and whatever else that people are afraid to see in a movie just judge it for what it is. It's a cool action movie. It had some great lines, scenes, and a surprisingly decent story for a movie where it's main emphasis is the combat scenes and action. The special effects were some of the best I've seen and not to mention they gathered most of the best action heroes of all time to make this film. This movie deserves better then a 5/10 it's at least a 8+..."
    },
    {
      "rating": "6",
      "text": "This is another so-so sequel. They threw a lot of big name actors at it but then they ran into the problem of what to do with them all.  They just did not have enough big hero scenes for that many big action hero guys. The plus was some of the slap stick comedy that was tossed into the big action scene.  I loved the first one......   keep it up guys someone has to try to spice up the somewhat dull movie season."
    },
    {
      "rating": "8",
      "text": "If you're looking for a meaningful story and characters that evolve and all that Academy award winning stuff, look elsewhere. For adrenaline junkies and action fans alike not giving a d*** about story, The Expendables 2 delivers with high octane stunts, vicious gunfights, and explosions. Lots of explosions."
    },
    {
      "rating": "9",
      "text": "How about that opening scene?! Wow. The opening of Expendables 2 is like the climax of most action films now days. Stallone sure knows how to give us what we want to see. Who would have thought that the fight between Stallone and Van Damme would have been so bad ass at their age? These guys still give it better than most. Action packed is an understatement."
    },
    {
      "rating": "9",
      "text": "Just what you'd expect for a movie like this, the story isn't very involved, Bad Guys do bad things and Sylvester Stallone and the rest of the Expendables (aided by Bruce Willis, Chuck Norris and the Governator) kick their A$$es. Full of explosions and one-liners my favorite being when the Governator runs out of ammo he says to Bruce Willis \"I'm out, I'll be back!\" to which Willis replies \"you've been back enough I'll go!\" Overall just a fun movie, leave your brain at the box office and enjoy."
    },
    {
      "rating": "10",
      "text": "...................................................................A Masterpiece that never stay tied............................................................."
    },
    {
      "rating": "9",
      "text": "Cheesy, action packed and gloriously violent, The Expendables 2 is even better than the first, set aside terrible Chuck Norris jokes."
    },
    {
      "rating": "9",
      "text": "There seems to be two worlds in action movies nowadays. There are action movies with regular Hollywood actors, that were cast to bring in some cash. Then there are the action movies starring action movie stars. Those dedicated to the genre. Those who practice their own stunts and the budget is spent on props and sets rather than CGI. The latter is a dying breed.\r The Expendables 2 has a lot of heart, and it all goes into the old action hero style movie of the 80s and early 90s. Sly Stallone does not disappoint in any way. Then there are the action movie vets you know and love. Arnold and Bruce do not disappoint either. There are less frequent than the main cast from the first movie, but their parts are funny and exciting.\r The highlight of this movie comes when you open your mind to having a blast. Enjoy the violent over the top kills. For example, the entire Expendables crew unloads on one man well past his dying point, then they drop a one liner. The whole theatre was smiling, laughing, ooooHing. It is fun in that sense.\r The final battle simply put is just Jean Claude Vam Damme vs. Sylvester Stallone. It is made knowing that you are watching two action movie heavyweights battle. JCVD shows off some cool kickboxing, while Stallone shows off plenty of muscle. It was a fun end battle that man action fans are looking forward to.\r All in all, The Expendables 2 could be the greatest action movie made. It is exciting, the kills are brutal, all actors show off their athletic skills. The cast are truly action movie stars, not just cash in actors. When you accept this movie is to get your adrenaline fix, then you have yourself a great movie."
    },
    {
      "rating": "10",
      "text": "I just got back from the midnight viewing of Expendables 2. For the critics, you dont understand that this is an action movie. An action movie that has more action than any movie since the 80s. Its not just explosions either. Well thought out story, didnt seem to slow down or put anyone in the crowd asleep even in the middle of the night. Even some descent jokes and one liners. Action with everyone in the cast, and not just a few lines by some from the first movie. The soundtrack didnt seem that great to me for this level of action, but music is more of a taste thing. Highly recommended, excellent film, and does not disappoint!"
    },
    {
      "rating": "5",
      "text": "The Expendables 2 has everything you want in a movie of this sort: explosions, giant body count, bullets and cheesy dialogue self aware of its stupidity. But for a film that has the greatest action stars from the 70s, 80s and 90s it disappoints. Jean Claude Van Damme was awesome as the villain, but he gets too little screen time and not much action. On the other hand, Bruce Willis, Arnold Schwarzenegger and Chuck Norris have a little bit more than cameos, but they get to shine when they appear. Their presence is only there for the sake of fan service. Unfortunately, Jet Li gets thrown away of the movie out of nowhere and gets replaced with a Michelle Yeoh wannabe that tries too hard to be badass and fails miserably. Her role would have been better if it was played by Brigitte Nielsen, Sigourney Weaver, Linda Hamilton or Michelle Yeoh herself. More than an action dream team film, The Expendables 2 is a Rambo movie which happens to have JCVD, Arnie, Bruce Willis and Chuck Norris in it."
    },
    {
      "rating": "10",
      "text": "For those who remember when action movies were over the top and ridiculously fun, this is for you. As someone who grew up in the 80s, the golden age of action films, I enjoyed the nostalgic glee this movie excites. It's ridiculous and cliched, sure, but it hearkens back to that time when action films didn't take themselves seriously. Excellent fun."
    },
    {
      "rating": "3",
      "text": "The first was alright, good enough where when I heard about this sequel, it caught my attention. Then  today I finally went to see it. I'm not sure if shows like Breaking Bad, The Walking Dead, Homeland or Dexter, has ruined everything that doesn't have the high level, quality content that these shows have, or if this movie was actually very bad when it comes to content. Don't get me wrong, I wasn't expecting a MASTERPIECE, but I was expecting some excitement . It honestly seemed like a Call of Duty movie, with a stacked cast. The movie is mainly action sequence after action sequence, strung together by irrelevant conversations with poor writing with constant jokes that try WAY too hard. Honestly, don't bother, I wont stop you, I just want to inform you, It's not very good"
    },
    {
      "rating": "8",
      "text": "Good action flick.  I really enjoyed seeing all the old familiar faces together one more time.  I thought the story was much better than the first one and so were the one-liners and the attempt at comedy by some of the actors was damn funny.  It did seem a bit rushed at the end, seemed to finish a bit too quickly, but the finale was still good for what it was and it wasn't disappointing in any way.  There are two new additions to the team in this one, and they both do a fine job.  One of the original Expendables goes on a 'side' mission part way through and doesn't show up again, but I think this was due to a scheduling conflict he had while the movie was being filmed, although I could be wrong.  So the producers used this angle as an excuse for him to not be in the rest of the film.  Overall, this was an enjoyable way to end the summer movie season and I hope there is at least one more mission left in these guys.  I recommend it to anyone who grew up with these actors when they were starring in their own films.  Even if you're younger than that, if you like action, you'll like this."
    },
    {
      "rating": "8",
      "text": "Who needs plot or even story.  When you have most of the action hero movie royality from the 80s and 90s in one movie.....you're set.  Being over 40, seeing Chuck Norris, Stallone, Willis, Lundgren, Arnie and of course Van Damme.....it almost brought a tear to my eye.  Everyone held their own and in the end - tons of guns were fired, tons of one liners and of course the body count was high.  I turned my brain off at the door and I was not disappointed.  If you enjoyed any action movies from the above, you owe it to yourself to see this movie.  Thanks"
    },
    {
      "rating": "10",
      "text": "The movie Expendables 2 was so awesome and thrilling at the same time. If no one out did not like this movie they really need their head examine from top to the very bottom. I was not boring at all and I got every dollar I paid to see this thrill ride of a movie. I think Stallone a wonderful job as usual and so did Jason."
    },
    {
      "rating": "10",
      "text": "are people crazy who don't enjoy this awesome chessy 80's adaptation action movie? get outta here and go watch mary poppin then. this is great, i enjoyed it far better than the first! stallon, schwarzenegger, stathem, norris, van dam, crazy they all worked, it was fun action, great humor, definitely recommend this to anyone who grew up watching there movies and enjoyed their past movie productions, i had a blast and look very forward to seeing it again !!!!!!"
    },
    {
      "rating": "10",
      "text": "This movie is for people who appreciate the old fun of movies like Commando, Rambo, Die Hard and just guns, explosions and mayhem. I loved this movie because I grew up with the classic action films of the 80s and to this day still watch them. Not to be missed if you fit into this category. It does not disappoint. Yippey ki-yay.....M&^%&^$R F%^&*%&^R!"
    },
    {
      "rating": "10",
      "text": "This movie was f***ing awesome!! Yeah this won't win any damn oscars but is that what Stallone and his badass cred are going for? Hell no! They made this film to give us exactly what we action fans wanted, all of our favorite action heroes and villains put together in one film to kick ass, and damn did they deliver. I don't even know what to say about it other than how badass and awesome this was. The Expendables 2 is a must see for anyone who loves action, and a crapload of fun put together in a matter of 110 minutes. If you're looking for an oscar nominee, or a drama, or a peaceful film, your looking in the complete opposite direction and i think you know that haha. This is pure fun and awesome. You must see this! 10/10 of course!"
    },
    {
      "rating": "8",
      "text": "Schwarzenegger is the F ucken man. come on people, how could you not love a movie with all these awesome actors in it? Kicks the first ones arse in a big way!!!!"
    },
    {
      "rating": "7",
      "text": "Decent, funny picture, which contains a load of memes and jokes about the fading action-movie stars. I laughed during all the movie. Probably that's why I overlooked dull plot and absurd production. Expendables 2, though, aren't about the plot. This movie is about fun and action. And fun and action it provides."
    },
    {
      "rating": "9",
      "text": "What on earth were the critics expecting from this film? Oscar standard acting? This is a fantastic classic action film that doesn't take itself seriously, and that's why it's great. The film is self-aware that it's cheesy with RIDICULOUS amounts of action that is just fun to watch. I walked into this film, wanting to see a cheesy-plot with Arnold Schwarzenegger doing one-liners that make you feel nostalgic and laugh. This film works because it self-aware of what it is and doesn't take itself seriously. For God's sake, Chuck Norris is in it!! (and he's friggin hilarious) If you want a good time, this film is great."
    },
    {
      "rating": "10",
      "text": "This movie is a love letter to hardcore action movies of years past.  And it does it well.   In fact, it's much better than the first film (which I also loved).   I think this one is just shot better.   You see the action more and see what these guys are capable of doing.  Which is kill lots of bad guys in awesome fashion.\r Plus, I mean JCVD, Arnold, Sly, and God himself Chuck Norris....   This movie was getting a \"10\" no matter what.   It just so happens that it totally earns it.   It was an absolute blast and if you like action movies I can't see how you don't have fun watching this one."
    },
    {
      "rating": "7",
      "text": "This movie is not for people that wants an amazing story with great actors. This is all about action, 80s style. With actors like Stallone, Schwarzenegger, Van Damme, Chuck Norris, Dolph Lundgren and Bruce Willis combine with new actors like Jet Li, Jason Statham and Terry Crews, you're in for a **** load of action.\r The story itself isn't that great, but seeing all these actors together is a true joyride. If you're cool enough to have lived during the 80s, see this movie."
    },
    {
      "rating": "0",
      "text": "Absolutely useless. it's got every single actor who doesn't know what acting means starring in it. Just giving in to the masses with explosions and verbal diarrhea."
    },
    {
      "rating": "9",
      "text": "INCREDIBLY better than the first. Usually the original outruns the second one but this one blew me always when I saw it. Much more realistic action, a way better storyline, and very little slow parts. Arnold and Bruce Willis have way more screentime and the whole movie is just plain BAD@$$! This is the one you are looking for if you want to relive the good old days but with a touch of modern things!"
    },
    {
      "rating": "9",
      "text": "Stallone: I heard another rumour, that you were bitten by a King Cobra.\r Norris: Yeah I was, but after five days of agonizing pain.... The Cobra died."
    },
    {
      "rating": "0",
      "text": "No the best movie I've seen action is not very intense don' t really feel physically exhilirated. Story line was average but could be better and should also be a bit longer duration."
    },
    {
      "rating": "7",
      "text": "This is a much better movie than the original. However, the confusing plot at the beginning just happens to get fizzled out till the end. Sure enough this movie has the most epic cast ever yet having more veteran actors to do their job, but it wasn't really long enough to be more epic, explosive, exciting and..... expendable."
    },
    {
      "rating": "8",
      "text": "The movie follows the most simplest of rules when it comes to entertainment: give the people what they want.  You won't find oscar-worthy performances, but you'll find exceptional beat-downs and a huge cast of \"who's who\" of the action stars with a couple more guys joining the mix the second time around.  The films captures the glory of the 80s with big celebrity-like villains while giving the more modern badass touch, and Van Damme pulls it off reasonably well.  It's great fun and every bit as good as the first film."
    },
    {
      "rating": "1",
      "text": "absolutely atrocious movie on so many levels. I love mindless action but the dialogue is so good awful that I wince with nearly every line. Cliches flying around left right and center. And how the hell are none of them getting shot? They're running around in the open like a bunch of **** making loads of noise, there's no way these guys would last five minutes in the field. Ok the special effects are good and the deaths are realistic but as the film has no substance the violence just seems gratuitous and pointless. Great, well done Sly, you can accurately depict a mans head being blown to pieces, but can you make a decent film? No. Not since Rambo 4. Van Damme bagged this film 1 star from me by just being in it though."
    },
    {
      "rating": "7",
      "text": "Disappointment. My first allegation to this movie is that it was too funny. During watching of it I felt as if I was watching Hot Shots. There is too much of a disparity between parody and darkness here. And I don`t think it`s because of Chuck Norris. He actually made a good character and played well. Some of the lines are just silly and completely out of place. Also the action scenes are average at best, vastly inferior to the first Expendables. In the first movie, every kill had its place, here it is just chaos. One would think that with such cast and setting anyone could make a great killing movie, but here they failed. The director did not manage to use the image of every gun toting hero and certainly every one of them got much less than they deserved (Schwarzenegger and Willis for example). Also, the first sighting of the main villain (named Vilain, haha) seemed just right, but he turned out to be a total wimp in the end. For sure Van Damme also deserved to be bigger here. I must say that again, it is not the fault of all the actors who played great, but fault of the whole scenario. If one had given theme adequate action scenes then it would have been simply epic. There was faaaar too much of Statham, and his knive scenes are much inferior to martial art scenes of Jet Li from the first Expendables.  I sincerely hope the director will take notes on EX2, improve on the downsides and bring back some of the magic from the first movie. Everything else in this film is great so if you don`t mind lots of parody  then go ahead and watch it."
    },
    {
      "rating": "3",
      "text": "Although this film should be considered to be one of the worst movies of the year for it's horrible acting pointless dialogue and possibly the dumbest and most cliche story ever, it should be noted that some of it's self aware humor does land. For example Chuck Norris telling a joke about himself. I couldnt stop laughing."
    },
    {
      "rating": "8",
      "text": "At last! A major improvement over the overrated original. All your favorite action heroes are back for the sequel. Good to see Arnold get some more screen time and Chuck Norris was badass too."
    },
    {
      "rating": "7",
      "text": "A movie so crammed with testosterone and gunpowder you can whiff it oozing from cinema screen, The Expendables 2 is everything I expected it to be. It's literally a line up of almost every action heroes for the past two decades, shooting dozens of extras with probably thousands of bullets. This movie is self-aware enough to make jokes about itself, using cliche puns for self-deprecating instead of macho bravado to entertain audience. It's efficient, predictable and quite fun actually.\r It has a degree of story, decent enough to get things started, although it doesn't push the movie beyond the ludicrous over-the-top premise, and it doesn't really intend to. Safe to say, it's a group of mercenaries against another, the only downside is the lack of villains, only Van Damme and Scott Adkins plays the bad guys. It gives a decent set-up for the carnage to come, even though some ridiculous scenes change the short tone of seriousness.\r The cast do what they are supposed to; shooting and bashing people, then pose for camera for a catchphrase. For what it's worth, Stallone has a screen charisma and believable as an experienced leader of this rag-tag band. Van Damme as antagonist is imposing, mostly because he brings knife to gunfights. They don't exactly escape their action hero roles, but the script uses more personal touch so they look more natural instead of acting at some parts. There are a few chuckles here and there, some in the expense of Lundgren or Chuck Norris' internet joke. It embraces the silliness rather than pretending the audience will buy their overly stern personalities. The rest of the script is accumulation of catchphrases from ye olden days, highly overused and could derail the movie from the plot, yet oddly still entertaining. Set pieces are more constructed this time, the end stretch in airport gleefully reminds me of Max Payne 3. For those who wait the mano-a-mano showdowns, there are some to be had as Adkins and Van Damme provide convincing threats.\r This time, Willis and Scha... Shcwaz... Arnold also have more screen time, I think fans will appreciate them shooting side by side. Action is predictably loud, explosions everywhere and piles of dead bodies. It's not exactly the type of excellence from melee brawl The Raid had offered though. For all the bang and cheesy one-liners The Expendables 2 brings, it won't go beyond the hay day of action movies despite the modern grimy visual. If you come for just that action overdose, that's plenty here.\r Rate 7/10"
    },
    {
      "rating": "5",
      "text": "Look, the film was ok, it's just that it could've been so much better with a more youthful cast instead of the geriatric squad. Seriously, what was the casting call ad like for Expendables 2 ? \"Major action film seeks has-been action stars.\" Because that's exactly what this is, a bunch of seen-their-glory-days action stars who somehow left out Hulk Hogan and Clint Eastwood, though for some odd and disrespectful reason Chuck Norris got Eastwood's GB&U theme music for his character. Oh, and the one young character on the team  gets killed off halfway through. Give it five more years and Expendables 3 will include Tom Cruise and Daniel Craig, ha."
    },
    {
      "rating": "2",
      "text": "Once upon a time there was a group of filmmakers that did something special at the time. They blew stuff up! Genius! Specially in the 80s. Coming out of the decade-long homage to dialogue that was the 70s (translation: they had no money for effects in the 70s, so they had to use language; who knew?!) And hence the invention of the summer blockbuster.\rCut to the dawn of the 21st century. Where, at this point, we have seen so many things, people, and/or aliens, get blown to bits in such a variety of both creative and absurdly implausible ways that audiences actually forget that the actors in a dramatic endeavor are supposed to get hired for their skill to convince you that they are someone else, not because they look awesome blasting everything in sigh to smithereens. Plus, somehow, now they all look far too sexy to kill anyone. There's a long-forgotten photo shoot they all escaped from apparently.\rIn any case and back to my point. My apologies. I'm getting lost just out of the sheer stupidity that seems to be happening in cinema lately. On to Expendables 2...\rI'll clue you in on something blatantly obvious about the title of the \"Expendable\" series. The title. It means, and I quote: 'Designed to be used only once and then abandoned or destroyed.' ... Are you guys out there catching on yet? ... First of all there is a sequel, and second, they are all there, plus a few extra guys and a girl on top of that... Soooo? Who or what was actually expendable?\rI mean, I get that we are supposed to be dumb and jump for joy every change crap gets shot to tears, but, if we look closely at this film, we must be the dumbest people around! Specially because the movies is holding on the top weekend spot for the second week in a row and there are plans to make a second.\rI should probably tell you a bit of what actually goes on in this madness of semi-comedic testosterone. I have to warn you, there are some spoilers ahead.\rThe film opens with such an insane action scene that it's impossible not to envision these guys as the strongest military force on the surface of this planet-and probably beyond, but the aliens haven't weighed in yet. Let's face it, when you are this good, any government would hire you at top dollar and you wouldn't have to live in hiding.\rContinuing on with what's presented on the first ten minutes of the picture. Let's point out a few fun details. For example, how these \"ex-military geniuses\" dress in no way like any military force anyone has ever seen. Or the completely impractical, post-apocalyptic design of their custom-made vehicles. And how about  their well thought-out military intelligent strategy to rescue someone with a gun to their head by driving violently through wall after wall. Sure, why not. I guess that would never put a subject at risk. To make it even funnier, the enemy just stands there waiting to get shot! As if our \"experts\" are not being blatantly loud enough! ... Good comedy from the start.\rLook, this is not the 80s. When simply blowing a cute little car would draw audiences to theaters en mass. This is 2012, where carefully crafted military based video games sit in the consoles of almost every member of your potential audience. You have to treat us as if we were only partially stupid, not flat out dumb. Any 14 year old with a copy of MW3 at home can do this better... Twice... While holding ice cream and texting their 16 year old girlfriend... That was meant for the marketing guys at the studio. 'You guys listening?'\rThis would probably be a good spot to stop, but since I'm having so much fun, I'll keep going.\rA personal peeve was the \"appearances\" of celebrities. Starting with Jet Li. For the record. I love the guy. I think \"Hero\" is one of the coolest movies around. However, even though he is in every single piece of marketing for this film, he is literally in it for less than ten minutes total screen time (go for it, clock it.) He says a couple of cliché lines and then drops off the plane. Just like that. The funny thing is I was watching this happen and I said to myself. Hey! Look, that's how the studio drops a couple million dollars down the drain. Off it goes. Byyyyyye!\rAnother good one is Chuck Norris. Or the \"Lone Wolf\" as they call him. A name that I find very appropriate since he's in the movie even less than Jet Li. But at least Mr. Li had some kind of believable involvement in the plot,if you can fathom that... Basically there is a scene where everyone of our guys is trapped by an overwhelming force, and I mean, so large that they are going down. There is even a tank bearing down on them. No way, no how they survive... Until Mr. Norris arrives... In a split second, literally, everyone is machine gunned down and the tank blows up. Kaputs!  Like that. As if they weren't even there... Not bad for a guy you can catch on TV after 2 am hustling exercise equipment. Wow..."
    },
    {
      "rating": "8",
      "text": "Freakin loved it.... Big explosions, awesome dialogue and the sooo many old action stars from the 90's and 80's. Now its not for everyone but if you love a good cheesy action movie then go see it. I hate when big time critics and wannabe critics get their panty's in a twist becasue it wasn't \"deep enough\". Sorry leave your purse at the door and try and enjoy it. The only complaint i had was that it may have been too short and the final fight scene was a little lacking. Also the part with Dolph Lundgren and the asian chick may have been little too creepy. Still good though, just watch and forget about you think makes a good movie and you may actaully like it."
    },
    {
      "rating": "1",
      "text": "This could have alternately been called Men Who Look Like Thugs and the addition of Maggie does little to dissipate the testosterone fog. The characters are all underdeveloped, they"
    },
    {
      "rating": "3",
      "text": "Full Review : http://www.youtube.com/watch?v=4feQcW3a3KE\r Its one up on the original, its definitely better than that, its got some great action, it has got all the familiar faces, its has all the toppings of the blockbuster commercial film, it has even got the presence of three bigwigs Bruce Willis, Arnold Schwarzenegger and of course Sylvester Stallone himself. The team is back in action in this film.\r While it is great to see all of them come together in fact there are some of the best moments in the film when you actually see those three big wigs on screen together. Its quiet an awesome feeling. The first 10 minutes and the last 10 minutes are probably the only big reason i would actually recommend going to see this in a theater but apart from that i am going to have to say that even though the film has a lot of one liners has attempts at comedy, has all the elements that are required in an action film without of course giving us really any substance or meat to sink our teeth into because thats not really what an action blockbuster is all about. I still feel that i can not recommend this one and can not tell you to waste your money and go and watch it in theaters. I just feel that we have seen all of this before in terms of the plot, the one liners, the attempts of comedy & the mission, its all very very tried and familiar.\r They set out on a mission, they have obstacles, ends up being about revenge, there is a female thrown into picture to join the team. There is one thing that i liked about the film was that there was a lot of laughing at oneself in which stallone did a good job yet i feel that he just underestimates an audience's expectations. When you have bigwigs like Stallone, Bruce Willis you just expect a little more.\r I am sorry i am just going to say go and watch a video game instead or go watch Die Hard or Terminator or any of the Rocky series for now Ira Say's \"TRASH IT\"."
    },
    {
      "rating": "9",
      "text": "Right from the spectacular and frenetic opening sequence, \"The Expendables 2\" makes it clear there are no punches being pulled in this tremendously entertaining sequel to the dark and explosive highlight that is the first film. Everything is just ten times more enjoyable here - the atmosphere is a bit lighter and more fun-loving, the action is just breathtakingly awesome, the sparse CGI effects are updated from the first movie, and this one actually made me laugh a whole lot. You just aren't an action movie fan if you're not squeeing through Jason Statham's bada*s knife-wielding. An instant adrenaline rush that you will be watching again and again . . . and again."
    },
    {
      "rating": "10",
      "text": "it`s a great movie with great actors(chuck norris,bruce willis,arnold SchwarzeneggerJean-Claude Van Damme and others). had a film not so long ago. I hope the third is even better"
    },
    {
      "rating": "10",
      "text": "I absolutely loved this movie.  It became my favorite movie as soon as I saw it.  If you are a fan of action movies I cannot recommend this movie enough.  It's a blast!"
    }
  ],
  "recommendations": [
    "the_expendables",
    "the_expendables_3",
    "xxx_return_of_xander_cage",
    "the_marine",
    "6_underground",
    "transporter_2",
    "death_race",
    "mission_impossible_iii",
    "bullet_to_the_head",
    "salt",
    "furious_7",
    "live_free_or_die_hard",
    "crank",
    "bloodshot",
    "the_transporter_refueled",
    "lockout",
    "the_a_team",
    "mechanic_resurrection",
    "the_fate_of_the_furious",
    "venom_let_there_be_carnage",
    "transporter_3",
    "escape_plan",
    "angel_has_fallen",
    "12_rounds",
    "the_losers"
  ]
}