{
  "id": 2320,
  "title": "The Bourne Identity",
  "starring": [
    "Matt Damon",
    "Franka Potente"
  ],
  "runtime": 119,
  "genre": [
    "Action",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "description": "Wounded to the brink of death and suffering from amnesia, Jason Bourne is rescued at sea by a fisherman. With nothing to go on but a Swiss bank account number, he starts to reconstruct his life, but finds that many people he encounters want him dead. However, Bourne realizes that he has the combat and mental skills of a world-class spy—but who does he work for?",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aP8swke3gmowbkfZ6lmNidu0y9p.jpg",
  "categories": {
    "plot": 8.181818181818182,
    "acting": 8.25,
    "ending": 6.75,
    "soundtrack": 5.0,
    "cinematography": 9.0,
    "familyFriendly": 6.0,
    "funny": 7.0,
    "action": 7.966666666666667
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The Bourne Identity is in many ways your classic spy thriller and in many ways not your classic spy thriller. The ways in which it subverts it genre largely rest in the blending of mystery with the action spy thriller genre. The mysterious nature of the film and its protagonist really help it to become different than your classic spy movie. However, it still is a spy movie, right down to the over-the-top European location. This does not mean it is not a good spy movie, however. Endlessly entertaining with brilliant action set pieces, added in with the twists and turns of every good spy movie, The Bourne Identity really does it job well. Mat t Damon, Franka Potente, and Chris Cooper, are all very good in their roles and it is no surprise as to why this one exploded the way it did. Overall, very satisfied."
    },
    {
      "rating": "7",
      "text": "A cool action movie with some boring scenes and it looks even better than The Fugitive. This is the movie that starts the long spy series of Jason Bourne."
    },
    {
      "rating": "8",
      "text": "A good action flick with an interesting story but it never really captures you in the way it should have but its good enough to make you wanna see the sequel. Matt Damon was a solid lead and the rest of the cast was good as well. I enjoyed it."
    },
    {
      "rating": "10",
      "text": "This film defines what makes a great action thriller. The pacing is perfect, with no fillers but just under 2 hours of epicness. The balance between action and story, suspense and cinematic scenes is perfect. The story is very easy to follow, it's direct, intriguing and filled with great voice acting from Matt Damon and almost perfect direction. There's not a single moment in this film where you are not immersed. You don't want to take your eyes off it, whereas a lot of action films tend to go for all-out explosions and miss out on the story. You can switch on and comeback to it later and still enjoy, like the Transporter films, but this one is so gripping and almost perfect in every way. All it's really missing is a bit more action and scenes to go in between - basically a tiny bit longer. On the whole it's a must watch."
    },
    {
      "rating": "8",
      "text": "This movie is a near perfect espionage thriller. It delivers on every side: the story is strong, perhaps shallow at first glance but efficient the way it is told; the actors are truly great, Damon acts exactly the way it should be and Potente is particularly honest in her performance."
    },
    {
      "rating": "8",
      "text": "A rather original action film that is helped along the way with the interesting plot and solid acting by the cast. It's one of few modern day action films that is actually good."
    },
    {
      "rating": "8",
      "text": "Starts the series of with a huge bang. The Bourne Identity is not only action packed and tense, but also features a very, very smart script. This one's not just for the action junkies."
    },
    {
      "rating": "9",
      "text": "\"The Bourne Identity\" is a 2002 film directed by Doug Limon and starring Matt Damon. The film follows the story of Jason Bourne (Damon), an amnesiac desperately attempting to discover more about his true identity while simultaneously embedding himself in a convoluted conspiracy involving the CIA. Now, when I had first heard \"The Bourne Identity\"'s fairly original and intriguing premise, I was already expecting this movie to be great. Did it disappoint? No. No, it did not. This is one of those movie's that just cannot fail - it has a rock solid story crafted by one of the most intelligent authors of our time, a brilliant screenplay written by one of Hollywood's most sought after screenwriters, and an intensely entertaining lead performance. \"The Bourne Identity\" and it's sequels are often credited with setting the par for most spy thrillers of the past decade - Does it deserve that credit? I believe so, for I have seen a multitude of films with similar concepts that have come out since \"The Bourne Identity\"'s release. However, most, if not all, of the movies that have tried to replicate what The \"Bourne\" movie's have done, cannot reach the level of intrigue that each of the \"Bourne\" movies have reached - and they promptly fall flat in comparison. That being said, everything about this film, beit it's fighting sequences, it's car chase, or it's intense cinematography has made an impact on the spy thriller genre, and the modern film industry, as a whole. All in all, I felt that \"The Bourne Identity\" was an intensely entertaining thriller with a large amount of intelligence clearly woven it."
    },
    {
      "rating": "6",
      "text": "The Bourne Idenity is a solid action flick that had a good plot. The movie started strong but towards the end I didn't know what Damon's character goal was. He wanted answers but  he didn't really know what he was looking for in which turned to me not knowing what to look for."
    },
    {
      "rating": "8",
      "text": "Compelling and exciting, The Bourne Identity follows a sturdy plot with great characters and a swiftly paced thrill ride. It also has the perfect amount of suspense and a big scope to cement it as a success."
    },
    {
      "rating": "8",
      "text": "the bourne identity is a tremendous film with suspense, action and a gripping story to take you on a thrill ride of fun and brilliant film-making the film also has in my opinion Matt Damon's best performance yet my only flaw with this film is that the plot can get a tad convoluted at times."
    },
    {
      "rating": "8",
      "text": "The Bourne Identity is an interesting, well-made and thrilling start to the Jason Bourne franchise. Matt Damon fits the title role perfectly, and the script manages to focus on both action and character development. It's certainly the least propulsive of the franchise, but nevertheless, there are still plenty of impressive action scenes to keep you on the edge of your seat. Overall, The Bourne Identity kicks off the Bourne franchise with a fun spy thriller that features a charismatic performance from Matt Damon."
    },
    {
      "rating": "8",
      "text": "A well paced, well acted, well directed, and well told, The Bourne identity does a solid job when it comes to making an action thriller. This movie is very enjoyable to watch."
    },
    {
      "rating": "8",
      "text": "A solid action-suspense package that gets the job done. The movie proceeds in a precision fashion that keeps you entertained while managing not to insult your intelligence. All in all, The Bourne Identity is a refreshing departure from the typical largesse of big-budget action films."
    },
    {
      "rating": "7",
      "text": "The Bourne Identity is a fun thriller that has great pacing, great action scenes, and a wonderful mystery. There is a lot of downtime and dead air that really doesn't add to the tension, and only slows the movie down. The dead air holds this first installment in the Bourne franchise back from being truly great, but it is memorable nonetheless."
    },
    {
      "rating": "6",
      "text": "Beginning of story about Jason Bourne. Quite second-grade movie, though has been shot 2002, but throughout all movie it seemed that a setting of the movie of the end of the 80th and the beginning of the 90th years. The movie obviously looks as B-movie, only Matt Damon takes out all movie. As the beginning of a series of movies isn't bad, but as separately taken movie - it is very mediocre."
    },
    {
      "rating": "3",
      "text": "The Bourne Identity is a mindless hack and slash action film.  There is an attempt at embedding some sort of intrigue into the plot, but it's really just an excuse for more boring violence. This has its appeal for certain audiences, but in the modern day when time is such a precious resources this movie just doesn't have value."
    },
    {
      "rating": "6",
      "text": "I will give it a 6 out of 10 because I found it too slow paced for an action movie, the first third of the movie was very entertaining but then after that it started to get tiring."
    },
    {
      "rating": "10",
      "text": "Can't believe this has weakest rating out of trilogy. Wonderful movie with scenes to remember. Two other ones are just too fast and without decent plot. Nice work, one of my favorites"
    },
    {
      "rating": "6",
      "text": "\"Bourne Identity\" is a serious action movie that looks cool, but creating a game off of this might have been a better choice."
    },
    {
      "rating": "9",
      "text": "This is a 9 out of 10 movie. Acting pretty good. Matt Damon is really good at Jason Bourne. Action is pretty great. Which leads to the great story. It's really good. Score is good to. Overall, this is a great start to a great series of Jason Bourne movies. You should watch it."
    },
    {
      "rating": "10",
      "text": "From start to finish, this is a great movie. It's got just the right amount of suspense, just the right amount of action, just the right amount of character development. I don't have a single complaint about this movie."
    },
    {
      "rating": "2",
      "text": "Fairy tale about glamorous boy for little girls....All very primitive and predictableIf you want spy history try \"24 hours\" series."
    },
    {
      "rating": "10",
      "text": "Oh my god. Love it. Espesiall since it is Taylor Lautners favorite movie. I heart Taylor Lautner. Must watch again. Gotta go because I am going to watch the movie again. Thankyou for reading my review. Goodbye."
    },
    {
      "rating": "9",
      "text": "Love this movie."
    },
    {
      "rating": "10",
      "text": "So you wake up and don't remember a thing.  What do you do?  Some of the Users see this movie as an action movie with boring scenes.  I think it's more of a mystery movie, \"who am I\", with some action scenes.  Yowie, I don't know who I am so why are people trying to kill me?  As he tries to discover who he is, he finds he has skills, like spy training CIA skills.  I don't have many DVDs but this one is in my collection."
    },
    {
      "rating": "9",
      "text": "This movie is truly great. I expected it to be good, not this good! Jason Bourne is ready to start his adventure in this great series. It was worth it to watch."
    },
    {
      "rating": "10",
      "text": "The start of the Jason Bourne adventures is very entertaining and interesting."
    },
    {
      "rating": "9",
      "text": "The story of a man (Matt Damon), salvaged, near death, from the ocean by an Italian fishing boat. When he recuperates, the man suffers from total amnesia, without identity or background... except for a range of extraordinary talents in fighting, linguistic skills and self-defense that speak of a dangerous past. He sets out on a desperate search-assisted by the initially rebellious Marie (Franka Potente) - to discover who he really is, and why he's being lethally pursued by assassins. Expertly blending genre formula with bursts of unexpected wit, The Bourne Identity is an action thriller that delivers -- and then some. I'll give The Bourne Identity an A."
    },
    {
      "rating": "10",
      "text": "Gahhh! Can't resist! MUST... WATCH... AGAIN..."
    },
    {
      "rating": "9",
      "text": "This movie was intense and at the same time, made you think. I loved it!"
    },
    {
      "rating": "9",
      "text": "An incredibly satisfying thriller because it's so smartly done - all the usual action movie cliches are absent, and thank goodness. Damon is very good. Franka Potente is outstanding. One of my favorites of recent years. It deserves more credit for its intelligence and sheer entertainment value."
    },
    {
      "rating": "8",
      "text": "As far as action movies go, The Bourne Identity has a charm like few others. Its world is simply more real. The people look closer to average, vehicles are worn down, and the clothing isn't gawdy or fashionable. Another movie would have slick cars and immaculately groomed cast members who would be CG'd through their fight scenes. Here, so much of what you see feels genuine that it's easier to fall into, and easier to like the characters, for what they are. Damon in fits particularly well into the role of amnesiac assassin Jason Bourne. Once the action kicks in it doesn't try to reach the bar that The Matrix or X-Men set, but rather follows a more realistic, but still entertaining kind of action. And because it's unafraid to be what it is, it's its own kind of cool. If you have this is one hand and another action flick in the other, do yourself a favor and pick this."
    },
    {
      "rating": "9",
      "text": "I loved this movie. It had lots of action and suspense. I think Matt Damon did a great job bringing Jason Bourne to life. I can't wait till the third one."
    },
    {
      "rating": "8",
      "text": "This is the first and strongest of the Bourne trilogy, based on the novels by Robert Ludlum. It deviates greatly from the books but is no less of a film for that. It"
    },
    {
      "rating": "8",
      "text": "Unconscious man gets rescued in the sea by fishing boat, amnesia, has \"special\" skills, someone trying to kill him, befriends German girl, tries to find out what's going on & who he is.Sharp action-thriller which has its fair share of twists and turns and outright action with some great fight choreography.Strong cast helps it & Maaaaatttt Daaaammmon is very believable as Jason Bourne. Good turn too from Franka Potente, Chris Cooper & Clive Owen as the deadly sniper."
    },
    {
      "rating": "8",
      "text": "The Bourne Identity is a great action movie that kicked off a decent franchise. This movie is a lot of fun, mainly because it sees Jason Bourne discovering his own powers along with the audience. The film also features some strong performances and an unforgettable car chase. That said, it doesn't quite achieve the same heights as it's masterpiece sequel The Bourne Supremacy... But then again, not many action movies do."
    },
    {
      "rating": "8",
      "text": "Found floating in the Atlantic Ocean Jason Bourne awakes to find he has no memory of who he is.Unfortunately Bourne has enemies and they certainly know who he is. The hero with Amnesia story is not exactly original but The Bourne Identity tells a more interesting story than most as Bourne fights to find out why everyone seems to want him dead. The movie whips along at a cracking pace featuring all manner of exciting fight scenes and car chases meaning the two hours will fly by."
    },
    {
      "rating": "8",
      "text": "First, this is not an adaptation the Robert Ludlum novel that it's supposedly based on.  It's a completely original, standalone work, with the only similarity being the central character, while everything else built around him from scratch by the director and screenwriter.  And as that standalone work it's an excellent action thriller that delivers on every front."
    },
    {
      "rating": "8",
      "text": "Brilliant action film with great story, screenplay and music. Damon nails the role."
    },
    {
      "rating": "7",
      "text": "Though it's not quite the incredible film critics were making it out to be, The Bourne Identity manages to entertain the whole way through, and it's hard to imagine someone being bored during the film. A body of a man is found floating in the ocean. This man has no idea who he is, who he was, or anything about his past. His ability to speak many different languages and provide detailed summaries about surroundings and people by just glancing at them suggests he was part of something big. Turns out, his name is Jason Bourne. And he's an assassin, and a good one. But now, he's on the run with the girl, in order to figure out more about his past, and not die. As I watched the film, I was constantly reminded of another action film I saw recently: The Fugitive. The Fugitive was a 90's film with Harrison Ford, who plays a man named Richard Kimble, falsely charged with the murder of his beloved wife. He escapes prison, and is on the lam. There are many reasons why The Fugitive is better than The Bourne Identity. For one, The Fugitive is more emotionally involving. We care about Dr. Kimble, and we feel his loss. The Bourne Identity offers no reason for us to care about any of the characters, so it's hard to root for either side. Also, The Fugitive is much more frantic. Dr. Kimble's race from the cops never really stops until the very end. Jason Bourne stops every so often, as if to take a breather from the action. We don't feel the thrill with The Bourne Identity, like we did with The Fugitive (and the generic chase scenes don't help). The film lacks smarts as well. The Fugitive was a nice little mystery alongside an action movie, but The Bourne Identity requires little thinking. We learn Jason Bourne's main role within half an hour. But The Bourne Identity isn't as bad as I'm making it out to be. There's lots of action. Maybe even more so than The Fugitive. There's gun fights, and fist fights. There's some exciting (and somewhat unrealistic) escape scenes as well. The film also benefits from a solid cast. Never for a minute will you question a lack of quality in the performances. Matt Damon provides a frustrated man who lost his memory. Franka Potente acts convincingly as an even more confused and worried Marie Kreutz, who wants nothing more then to get out of this mess. The rest of the cast is equally strong. I usually don't comment about the score in action films because they're usually very run-of-the-mill. This one was a little bit better than that, but the over-powering drums keep me from praising it too much. The main flaw with The Bourne Identity, however, was it's lack of a final fight. No cinematic duel to the death. In The Fugitive, we had a manic fight/hide-and-seek/out wit game going, that was heart-pounding. We get no such thing in The Bourne Identity, which surprised me, considering the fact that this was in fact, a movie about action. The Bourne Identity is perfect for teenage boys. It's fun, it's got some good action scenes, and a strong cast. It entertains from start to finish. It does suffer from problems though, such as a lack of thrill, no cinematic duel, and no need to think. But in the end, good outweighs the bad, and I'm ready for the sequel."
    },
    {
      "rating": "7",
      "text": "The Bourne Identity makes for a fantastic thriller, with the pivotal positive element of the film being that Jason Bourne doesn't care for violence: he only uses it when provoked."
    },
    {
      "rating": "7",
      "text": "[1/4 The Bourne Legacy Marathon]\r The Bourne Identity [2002] - 3.5/5\rA solid action film, with some well-made action setpieces and fight choreography."
    },
    {
      "rating": "9",
      "text": "Near perfection action/drama film. The action is not overblown and focuses on intelligent aspects instead of lots of explosions/gunfire, with the winter scene in the countryside being a prime example.\r Great dialogue, intricate plot, great pacing, great character dynamics (like the changing relationship between the two main antagonist characters).\r And the film does a great job of showing how Bourne completely outsmarts his opponents instead of using brute force.\r It has some small flaws but is otherwise one of my favorite action films."
    },
    {
      "rating": "8",
      "text": "From the beginning of the movie to the end of it I always felt suspense. From the 3 movies following it the story continues although the story is kind of confusing if you don't understand it from the beginning, or don't have someone to properly explain it."
    },
    {
      "rating": "9",
      "text": "Awesome movie for James Bond fans! It is better for younger audiences in terms of suggestive content, but still pretty violent. Good story, characters, and stunts, not really a downside I could find, but it's still not the best movie I've seen. Still a good 9 out of 10!"
    },
    {
      "rating": "9",
      "text": "The ultimate start to one of the best action movie trilogies, the Bourne Identity satisfies your action cravings, and gives you a dose of life on the run in foreign countries, something the majority of movies don't cover."
    },
    {
      "rating": "9",
      "text": "The Bourne Identity is the beginning of one of the best trilogies in recent memory and perhaps even of all time. This movie is really something special."
    },
    {
      "rating": "8",
      "text": "A brilliant novel forged into an equally mesmerizing film.\rThe Bourne Identity cruises with ease as Matt Damon plays a humble but skilled agent in search of his own name."
    },
    {
      "rating": "8",
      "text": "Compelling and exciting, The Bourne Identity follows a sturdy plot with great characters and a swiftly paced thrill ride. It also has the perfect amount of suspense and a big scope to cement it as a success."
    }
  ]
}