{
  "id": 3359,
  "title": "The Big Lebowski",
  "starring": [
    "Jeff Bridges",
    "John Goodman"
  ],
  "runtime": 117,
  "genre": [
    "Comedy",
    "Crime"
  ],
  "description": "Jeffrey 'The Dude' Lebowski, a Los Angeles slacker who only wants to bowl and drink White Russians, is mistaken for another Jeffrey Lebowski, a wheelchair-bound millionaire, and finds himself dragged into a strange series of events involving nihilists, adult film producers, ferrets, errant toes, and large sums of money.",
  "releaseYear": "1998",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9mprbw31MGdd66LR0AQKoDMoFRv.jpg",
  "categories": {
    "plot": 9.24,
    "acting": 9.3125,
    "ending": 10.0,
    "soundtrack": 10.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 9.515151515151516,
    "action": 9.333333333333334
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Simply put this is a comedic masterpiece. It is one of the Coen Bros. best films and features some superb writing and comedy. This is my all-time favorite comedy and is either #1 or #2 for best movie period."
    },
    {
      "rating": "10",
      "text": "Man, this is totally like an awesome experience you know? I mean, hilarious characters and actions, yet with awkward reasons. The story is like; you know,  confusing and disjointed. Yet it it, ravels me with performance, so I don't really understand the story, but that's the point man. Our protagonist is the dude (Jeff Bridges) who is minding his own business, but is wrapped into this complex; and might I add pointless, hostage plot, and has to figure out how to get his rug back. What's totally sweet about this picture is Jeff Bridges as the dude, he like is so mystical like in the role as the dude. He is such a likeable person; an enjoyable loser maybe, and is accompanied by his best man Walter (John Goodman). Who is also cool. With a over the top attitude, and can't help but try to relate every event to Vietnam. While the dude's performance is sweet, the story and pacing is not as sweet. While one may feel great for being able to follow what is going on; I sure did man, but like this does get a bit muttled and mind mumbling. That aside, this is totally worth a watching; you'd be really uplifted if you saw it multiple times, and is a art house masterpiece man."
    },
    {
      "rating": "10",
      "text": "One of my all time favorites. Pure comedy genuis. It's original, uniqu and hilarious. It deserves it's cult following and fan base. And if you don't like it, Well that's just like your opinion man."
    },
    {
      "rating": "10",
      "text": "The Big Lebowski is the gold standard for cult movies, and is an incredibly inspiring film. The stoner humor is great and remarkably high brow. The performances are great, and the script is constantly quotable. This is a lot of people's favorite movie, and it's one of mine too! Very inventive and a lot of fun!"
    },
    {
      "rating": "8",
      "text": "The Cohen brothers hooked me with No Country For Old Men and Fargo, so going into this film I was expecting to like this. It's save to say that I love The Big Lebowski. It's really the absurdity that makes this movie great. The eccentric characters work so well and John Goodman is hilarious in this. Some of the structure seemed muffled and there was some exposition but other than that, this is an awesome movie that's driven by its own self aware insanity.80/100"
    },
    {
      "rating": "7",
      "text": "I don't know if 98% of the humour went over my head, but I don't think this is a \"timeless masterpiece\". It's a story about a guy who just wants to get a new carpet and who hangs out with his friends who couldn't be more socially deviant. Still a very enjoyable movie."
    },
    {
      "rating": "10",
      "text": "The Big Lebowski is honestly a masterpiece and a half, it has to be one of the most funniest comedy movie's I've ever watched and I've watched a lot of comedy movies.The plot is really good, it's about these two rough guys who accidentally mistake The Dude (Jeff Bridges) for the millionaire Lebowski. So, they end up pissing on his rug.So, he tries to recompense the rug which he's got from the billionaire Lebowski and he later gets involved in this big kidnapping case.Also, all of the cast throughout this movie are honestly brilliant, either that being with their dialogue or just anywhere throughout this movie.The cinematography from Roger Deakins is honestly beautiful and it's really shown that, he's beautifully shot this movie as a whole.The fight scenes are honestly pretty funny especially the one with Walter (John Goodman) near the end of the movie, that's honestly amazing.Finally, the scenes which The Dude and Walter have together throughout this masterpiece and half are honestly amazing and hilarious.The movie's even got a great soundtrack, which is honestly another positive for this movie in my opinion.Overall, this movie is honestly a masterpiece and a half, it's got a really good plot, a brilliant cast, brilliant dialogue, beautiful cinematography, some pretty funny fight scenes, there's some great moments which The Dude and Walter have throughout, loads of hilarious moments and a great soundtrack. It's honestly worth the watch, I'd honestly recommend this movie to anyone who's wanting to watch a brilliant comedy movie with a great plot."
    },
    {
      "rating": "10",
      "text": "The Big Lebowski isn't just a movie, it's a way of life."
    },
    {
      "rating": "10",
      "text": "the one thing you can almost always say about the coen brothers is they are inovative with there films . this is a very funny film with a entertaining plot . great acting especially by goodman and bridges . its a great film that if you wana see some thing funny and differnt then you should deffinitly check this out."
    },
    {
      "rating": "10",
      "text": "Some of the most surreal sequences I have ever seen, this has to be the slacker equivalent to Pulp Fiction. Like it or not, we all know the Dude, and there is a little of the Dude in a lot of us."
    },
    {
      "rating": "10",
      "text": "My favorite comedy film of all time (Hot Fuzz is A VERY CLOSE 2nd), it is just genius and very subtle. The story is highly underrated, Walter Sobchak really makes this movie better, and The Dude being the main character is a genius choice (especially considering The Dude would seem like he would be a comic relief character in 95% of other movies if he were to be a character). This is a movie you should just see at least once just to get why this movie is a big deal. I am not one of the biggest fans of it (there's a religion based around this movie), but you should still see it because of how it shows a representation of the period (the 1990's) and I could go on more, but just see this important film."
    },
    {
      "rating": "10",
      "text": "Absolute genius. One of my favorite movies ever made (along with The Royal Tenenbaums). Hilarious, visually wonderful, with a dozen lines that should be bronzed and framed in the screenwriters' hall of fame (\"Say what you want about the tenets of National Socialism, at least it's an ethos\")."
    },
    {
      "rating": "9",
      "text": "I've heard good comments about this movie for years, but finally got around to seeing a copy. Hilarious! The basic story is unoriginal, but the dialogue is funny and imaginative. I highly recommend this if you're looking for something a bit quirky and off-beat."
    },
    {
      "rating": "10",
      "text": "This movie is spectacular....I must admit that the first time I saw it I thought it was \"OK\" but I've seen it many times since and it gets better as I listen to the dialog more carefully. John Goodman is like a cranky Grizzly bear and steals many scenes with his angry outbursts and irrelevant rationale. The \"real\" Lebowski is like Dick Cheney poured into a wheelchair with a porn star wife......Phillip Semour Hoffman is a brilliant brown noser and the Dude really ties the movie together with turns of defeated slacker logic and certain charming familiarity that makes him an ironic and lovable hero."
    },
    {
      "rating": "9",
      "text": "The Big Lebowski finds that middle ground between the most realistic depiction of life and the strangest dreams that sometimes we all have. There is plenty of material here that the critics should of loved  but as it is,maybe its better that not everyone understands. Let this movie be a cult classic, for that is exactly what it deserves."
    },
    {
      "rating": "10",
      "text": "Quite possibly the funniest, and greatest movie of all time."
    },
    {
      "rating": "10",
      "text": "Mark it zero dude."
    },
    {
      "rating": "10",
      "text": "Smart, funny, ironical, delirious, surreal, sarcastic... and with a very nice soundtrack.To me, one of the best movies in the history of cinema! This dvd really ties my collection together ;)"
    },
    {
      "rating": "8",
      "text": "I had never seen this movie until yesterday, and totally enjoyed it.  Pure, intelligent, exciting entertainment.  It's very well written, with a tight plot that will keep you engaged from the get go.  Jeff Bridges, John Goodman, Julianne Moore and all others in the cast create such wondreful characters.  Especially \"The Dude\"  You just love The Dude, man.  John Goodman's character his hilarious, and he's calmer than you are.  I see why this film is such the cult classic that it is.  Be sure and check it out if you havent."
    },
    {
      "rating": "10",
      "text": "\"The Big Lebowski is strange, off-putting, and unrefined. . .but that is exactly why it's the perfect comedy. It tickles you in nearly every spot you can be tickled in and it never, ever, ever stops."
    },
    {
      "rating": "5",
      "text": "entertaining film the whole way threw, 10 years ago funny but still a good watch. acting was good, story was decent. not a movie you take seriously at any point."
    },
    {
      "rating": "10",
      "text": "First and foremost I am a Coen brothers fan, HOWEVER I hate FARGO and BURN AFTER READING and a few more.  When I first  watched LEBOWSKI I was not a huge fan. For some reason (I am most certainly NOT a prude) I didn't like the use of the word f**k throughout the film. After the fourth or fifth time I watched it (it was on commercial TV) the bleeped every F**K. Oh my God that totally wrecked the humor and continuity of the film. This film has great actors ( Steve Buscemi is a Coen brothers fav and mine too). The plot is funny, and most of all the cinematography is the best ( only second to Hudsucker Proxy).After the fifth time this became one of my top 5 Coen brothers films. THE DUDE ABIDES!!!"
    },
    {
      "rating": "10",
      "text": "A film that should be mandatory for anyone who calls themselves a fan of the cinema. The Coens are at their goofy best here, twisting and turning through multiple plot changes, genres, styles, and berserk characters. \"The Big Lebowski\" somehow involves us by showing inner America (though it's set in California) at its weirdest and most truthful. It's gloriously goofy and unabashedly silly, one of the best films this duo has made."
    },
    {
      "rating": "10",
      "text": "Personally this movie was fantastic and I loved every minute of it cause I mean why wouldnt any person like a movie with Jeff Bridges and Bowling! Haha"
    },
    {
      "rating": "10",
      "text": "Best movie ever! It's one of those movies where you have to be smart to understand the comedy and if your smart, you'll love it."
    },
    {
      "rating": "10",
      "text": "This movie got some bad reviews because it takes a few watches and some real thought to get its fantastic humor. It's a highbrow comedy in a lowball costume, and many critics didn't understand that when it was released. Ultimately it is deep with rich themes and a great cast, and nearly every line in the movie has become legendary. There's a strong case to be made that this is the funniest movie of all time, and one of the best movies overall; it's a shame it suffered critical distaste due to its complex nature and, of course, that it was the Coen bros. follow up to Fargo."
    },
    {
      "rating": "10",
      "text": "This movie proves that critics don't have a clue. I absolutely loved this movie. I will be buying this one for my collection. Listen to the user reviews, not the critics."
    },
    {
      "rating": "5",
      "text": "Some funny stuff scattered about but overall I thought it was pretty flat, misfiring more than it hit. Occasionally clever and inspired moments were often undone by heavy-handedness and a tendency to overindulge in them. I kept feeling a real good movie could've broken out with a little more subtlety and nuance."
    },
    {
      "rating": "10",
      "text": "It is my honest opinion that this movie is the best cult film ever made. You can watch it over and over again and it never loses appeal. Immensely qouteable, fantastically funny, and full of great dialogue - this is the ultimate shaggy dog story. 'The dude abides...'."
    },
    {
      "rating": "10",
      "text": "Many people get frustrated with this film with the fact that the story does not make sense or goes anywhere. To me, this is part of the reason why this is one of the best movies ever to be executed. It's more about the amazing characters created along with the perfectly crafted jokes and timing of them. This movie also has some great visual work. It is an original work of art. Perfectly cast, directed, and edited."
    },
    {
      "rating": "10",
      "text": "An ingenious parody of Chandler-esque P.I. thrillers, and one of the most important comedies of the twentieth century."
    },
    {
      "rating": "10",
      "text": "Its the best fricken movie!!!!!!!"
    },
    {
      "rating": "10",
      "text": "My favorite movie -- hysterically funny. After a hundred viewings it's still hysterical...it takes a special soul to know that this one is a gem!"
    },
    {
      "rating": "10",
      "text": "Simply the funniest movie I have ever seen. I have seriously watched this move over 100 times, and I still find new things to laugh at, as well as the classic lines. Almost every scene in this movie is quotable, and it is very satisfying to run into someone who knows the movie as well as you do. If you're scared off because of any of the Coen Bros. earlier work, like Fargo (which is an excellent movie, but nothing like this one), go rent it and be prepared for a hilarious tale. Like a fine wine, this movie gets better with time."
    },
    {
      "rating": "10",
      "text": "Absolutely brilliant, funniest film ever!"
    },
    {
      "rating": "10",
      "text": "Best movie ever... f*#k it dude lets go bowling."
    },
    {
      "rating": "10",
      "text": "Absolute the best comedy in my world. Amazing story, cast, acting, and everything else. The humor in this film went to eleven on every sense. It's smart, funny, and legendary. Watch this gem!"
    },
    {
      "rating": "10",
      "text": "Up there with Spinal Tap and Bull Durham as my favorite comedy of all time. The characters are unforgettable and dialogue is priceless."
    },
    {
      "rating": "10",
      "text": "This is a hilarious movie! F the TV Guide! Rent it and have fun!"
    },
    {
      "rating": "10",
      "text": "My absolute favorite comedy of all time and the best movie the Cohen Bros. have made."
    },
    {
      "rating": "10",
      "text": "This is a masterpiece. I don't know much about film but I do know when something is great. This is something that is great. Take the scene when the Dude is talking to an apparently despondent Mr. Lebowski in front of his fireplace. While Lebowski laments, Dude just sits there dumbly, as if only half-aware of his surroundings. This scene could have been an emotional window into Lebowski's soul, but all such connotations are ruined by the Dude in all his stonerdom. The hero is just that, a stoner walking though life as if by accident."
    },
    {
      "rating": "10",
      "text": "This is absolutely the only movie which I never tire of watching. The overcomplicated plot is indeed just an excuse to tie together a melange of colorful and hilarious vignettes -- the Coen brothers recognize the meaninglessness of the story by showing us in the end that no kidnapping actually occurred. It matters not. The movie like the enduring music of Ravel is about style and flair over substance. And like that music The Big Lebowski is absolutely classic."
    },
    {
      "rating": "10",
      "text": "I recently saw this movie for the first time. I came in with low expectations - I was told it was a silly stoner movie. And I'm a pretty tough critic on movies overall and no big fan of stoner movies. Well they were right, it IS a stoner movie. And it is also absolutely freaking brilliant. As in hilarious. This movie absolutely gets into her head and won't leave it. Some scenes are now indelibly etched into my brain now. Among many others, the scene with The Dude morphed onto a bowling ball and rolling down the lane - between the legs of a horde of beautiful women - and to some groovin' music - may be the funniest and most surreal thing I've ever seen in film. So ignore the up-tight critics. If you want something really different and can relax and go with the flow, this flick is for you. As for it being a stoner flick, well, it probably wouldn't hurt if you lit one up while watching this film either. It no doubt would make it even funnier. Why not - he actors and the Coen brothers were all definitely under the influence while making this masterpiece."
    },
    {
      "rating": "10",
      "text": "Masterfully written, cast, acted, and directed, this is an absurdist romp that never disappoints, sometimes surprises, and always entertains. Eminently quotable and relentlessly funny, this movie is worthy of its cult status. I feel sorry for the people who do not enjoy it; one of my all time favorite movies."
    },
    {
      "rating": "10",
      "text": "\"Ve f*#cks you up! Ve takes ze money.\" Simply put, the greatest movie to ever enter my psyche. I have sat for days quoting it to my friends who also feel the same. The Dude is quite possibly one of the most memorable characters in cinematic history. So too is Walter, Donnie, Maude, Ullie, Brant, Jesus... If you don't get it, thank God. The little Lebowski urban achievers that do are that much cooler due to your ignorance. My dirty undies Dude, my f.ckin' whites."
    },
    {
      "rating": "10",
      "text": "One of my absolute favorites...and I'm a movie guy...don't like TV. Several of the lower scores by the reviewers refer negatively to how 'scattered' it is, but frankly that's what it's supposed to be. The metaphor is bowling as life...and we're the pins."
    },
    {
      "rating": "10",
      "text": "This is as close to a masterpiece as a movie about an unemployed bowler embroiled in a kidnapping scam can be."
    },
    {
      "rating": "10",
      "text": "He fixes the cable?"
    },
    {
      "rating": "8",
      "text": "Personally my favorite Coen Brothers film. Funny to see that it has the lowest critic rating. The Dude is one of those characters that you know in real life. Whether you have a friend like him or there's a little bit of Dude in you, you know this guy. Quotable lines, great actors, great storyline, this is definitely the Coen Brothers movie you don't want to miss."
    },
    {
      "rating": "10",
      "text": "The Big Lebowski is the greatest comedy ever made. It's relentlessly funny no matter how many times you see it. The amount of quotes from this movie that have sneaked into my daily life is frankly absurd!"
    }
  ],
  "recommendations": [
    "the_spongebob_squarepants_movie",
    "minions_the_rise_of_gru",
    "the_green_hornet",
    "ghostbusters",
    "zack_and_miri_make_a_porno",
    "pitch_perfect_2",
    "hot_fuzz",
    "deadpool_2",
    "pulp_fiction",
    "pineapple_express",
    "sonic_the_hedgehog",
    "click",
    "seven_psychopaths",
    "thor_ragnarok",
    "the_three_stooges",
    "friends_with_benefits",
    "deadpool",
    "forgetting_sarah_marshall",
    "this_is_the_end",
    "the_princess_bride",
    "zombieland_double_tap",
    "johnny_english_reborn",
    "the_lego_movie",
    "thor_love_and_thunder",
    "megamind"
  ]
}