{"id": 3082, "title": "The Impossible", "starring": ["Naomi Watts", "Ewan McGregor"], "runtime": 113, "genre": ["Adventure", "Drama", "Thriller"], "description": "In December 2004, close-knit family Maria, Henry and their three sons begin their winter vacation in Thailand. But the day after Christmas, the idyllic holiday turns into an incomprehensible nightmare when a terrifying roar rises from the depths of the sea, followed by a wall of black water that devours everything in its path. Though Maria and her family face their darkest hour, unexpected displays of kindness and courage ameliorate their terror.", "releaseYear": "2012", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/k0DLCiDbnYywOHiISALbl2EH2NE.jpg", "categories": {"plot": 7.054054054054054, "acting": 7.761904761904762, "ending": 6.625, "soundtrack": 5.666666666666667, "cinematography": 9.0, "familyFriendly": 6.0, "funny": 3.5, "action": 7.8}, "reviews": [{"rating": "6", "text": "The movie, in my opinion, is a mixed bag. Some of the scenes are done perfectly yet others are so cheesy that I cringed when I was watching it.\rThe phrase \"like in a bad Hollywood movie\" was coming to mind. The script could definitely be better. Cinematography is impeccable. Kids are not always acting believably. Overall, the movie is good but definitely not great."}, {"rating": "4", "text": "mawkish\radj.\r1. Excessively and objectionably sentimental.\r2. Sickening or insipid in taste.\r To describe The Impossible as mawkish is like calling Joe Pesci's character in Goodfellas \"not nice\".\r The Impossible is one family's story of survival in the aftermath of the tsunami that struck Thailand on Boxing Day in 2004. The special effects used to recreate the tsunami are very impressive. I was saying \"Wow\" at that point of the movie. As the film progressed, I found myself saying \"Wow\" in a different manner; while rolling my eyes in disbelief at the acting and dialog. A better title for this flick would have been The Implausible.\r The screenplay is by Sergio G. Sánchez from María Belón's story. Belón is the woman portrayed in the film by Naomi Watts. Since the writers were Spanish, we can only hope that something was lost in translation since I hardly believed any of the characters' words.\r Watts does a decent job in the lead role, and it's a credit to her that she succeeds even to that extent, considering the direction and writing. Other actors don't fare as well. Tom Holland, who plays her son Lucas, shows some promise as an actor, but here he mostly comes off as an overly sentimental caricature. The other main character is the father portrayed by Ewan McGregor. McGregor's \"acting\" consists mainly of looking anguished in blood-smear makeup while screaming out the names of his family members.\r Director Juan Antonio Bayona has decided that the best way to convey the hardship and emotions experienced by the poor souls who suffered through this ordeal is to show closeups of their faces to the accompaniment of some Williamsesque music done to the nth degree. I could just imagine John Williams (a.k.a. The Big Schmaltzy) sitting in a theater where this was playing, wincing and saying, \"Eww, too much music.\"\r I have to say that I felt a little uncomfortable while watching this movie. Here was a real and devastating tragedy, and I was feeling as much emotion as I do when I watch my computer run a virus scan. Those who suffered through this catastrophe deserve to have their stories told with dignity and gravitas. At the very least they deserve more than this uninspired and maudlin celluloid effort."}, {"rating": "4", "text": "The Impossible is a movie about a family that goes on vacation to Thailand and had to survive to the tsunami. As the title of the film suggest this story is impossible to believe, although is based on true events. The plot is constructed by the separation of this five member family, in two: the mother with the older son and the father with the two following children, so they are supposed to find each other, yet they must not only endure physical pain, but also break psychological barriers, like fears, solitude, forced independence, hopelessness and post traumatic shock. Because of that this is a story of big magnitudes, treats topics like courage, hope, never giving up, facing fears and overcoming problems. The most outstanding thing of the picture, apart from the devastation images, are the performances: Naomi Watts is fine, but Tom Holland, as Lucas, is absolutely brilliant. The only problem is that The Impossible does not have nothing new to present, the stage is different, but the message is not original at all."}, {"rating": "6", "text": "\"The Impossible\" is a solid, well-made disaster film fueled by the human spirit fighting for survival with fine performances, especially by Naomi Watts. \"The Impossible\" faces and never quite overcomes, Ocean tsunami sets up an excellent premises in terms of showing the audience the aftermath of such an extravagant human atrocity. However, \"The Impossible\" feels every bit average, never rising above its own genre conventions--but it compensates with fine performances and outstanding realistic effects. The tsunami sets up the plot and the rest of the film-the catastrophic situation allows the audience to sense the aftermath of such an overwhelming human atrocity. However, \"The Impossible\" feels every bit average, never rising above its own genre conventions. \"The Impossible\" soon becomes a painful experience to endure; not for the reasons one might expect, either.\rWhen the tsunami slams into the resort (in the first 15 minutes),  Maria (Naomi Watts) and Henry (Ewan McGregor) are taking their family to Thailand for the Christmas period, hoping to enjoy a festive season complete with unflinching sunshine and exotic beaches. Arriving on Christmas Eve, the family rejoice through the 25th, savoring their time together in the island paradise. However, on Boxing Day a massive Tsunami crashes into their resort, leaving them separated and facing one of the nastiest natural disasters of modern times. The first half of the movie unfolds as a survivalist picture, pitting the characters against horrific conditions and devastating conditions--creating gripping tension in the process. There are inspirational moments of perseverance, families reuniting, people pulling together and overcoming. The film's most dramatic sequences focus on Lucas (Todd Holland), assigning himself the role of his mother's lifeguard and protector. However, as the film continues it becomes more disjointed with seamless wandering as it stumbles toward its denouement. In relation to seamless wandering--Ewan McGregor's performance just doesn't nearly stack up next to Naomi's Oscar worthy performance. As the husband, separated from his wife and searching for her, McGregor finds himself walking aimlessly and hopeless-- he does a lot of tripping or falling through floors and screaming. Even worse, it's through McGregor's role that we meet other people searching for family members, and this hint of the broader story makes the movie's little story seem trivial. What Juan Antonio Bayona is trying to do with \"The Impossible\" is honorable, but it's hampered by a weak script that does absolutely nothing with an endless number of possibilities. There are so many unique and truly tragic stories that spawned from the 2004 tsunami, but it feels like none of these possibilities were explored here. By the end of the film, I was bitterly scoffing to myself as the family was flown away on a private airplane to the safety of another country while many other families were left behind with missing mothers and fathers and sons and daughters. The story of this family just isn't as whole-heartedly inspiring as it could have been. I'm aware of the purpose of each character. They exist only to serve as a component of the guiding narrative that takes us on a \"tour\" of the aftermath caused by the tsunami. But because of this, the characters are nothing but cardboard cutouts of people. They're not interesting or worth sympathizing for in the most basic cinematic way because there's nothing distinguishing them from the hundreds of thousands of other people. But when watching the actual footage posted on You Tube, and listening to the real victims-- their gut-wrenching stories of their experiences, the movie fails to capture the same reaction of astonishment."}, {"rating": "5", "text": "I have to disagree with many of the reviews here. This movie is way too fluffy. It coincides with movies like Soul Surfer.\r I have a hard time with movies that just pile on the “feel good” and “feel bad” scenes with a strict plan to simply make you cry.\r I know this is a true story, but the fluff makes it feel like it’s in no way a true story at all. It makes it appear not very realistic. Zero Dark Thirty would be an example of a movie based on a true story that doesn’t pander to the “I really need to “feel good” and “feel bad” audience (and thus feels like it really happended).\r I do have to give thumbs up on Naomi’s performance. She was outstanding. I didn’t believe the rest of the cast’s performance however."}, {"rating": "5", "text": "While not close to a masterpiece by any means, The Impossible does have some great performances and moments that keep the film afloat. While Naomi Watts is great and carries the story, there's a lot of bad Hollywood movie moments that overshadow the good parts of the story. The Impossible ends up being a bore, in spite of its achievements."}, {"rating": "3", "text": "This is another great real life story (modified obviously) that gets turned into an insipid film. It could have been a great film since its based on a great story, but it lacks the profundity to really get it because it stays superficial. You can almost forget about the natural disaster and about how fragile life is. You just see this family making questionable decisions at times, the mother crying and moaning most of the movie and desperation of being lost. You can almost forget that this family is VERY blessed since they all ended up alive. I guess that wasn't important to the director as to show Naomi's breasts a few times. How was that useful? Even though it wasn't sexually oriented, it was completely unnecessary. She is a great actresses, she can do well without showing her nipple a couple of times. It just makes me feel that producer picked up a tearjerker story and mixed it up with breast flashes."}, {"rating": "10", "text": "\"The Impossible\" é extremamente emocionante, profundo, realista e nele podemos sentir na pele as emoções das personagens. Possivelmente, o melhor filme de 2012. 10/10"}, {"rating": "4", "text": "Probably the best advertisement for expensive private healthcare that I have ever seen. It was watchable, emotional, and if you like a cry you may like it."}, {"rating": "10", "text": "The Impossible is one of the best films of 2012. Never has a movie been so depressing and at the same time so uplifting. Naomi watts does an incredible job, but Lucas, her son, is the star of the film. A movie that should be seen, remembered, and not forgotten."}, {"rating": "9", "text": "As a drama film far better than Avatar & Co., mostly due to three reasons: The whole film is based on a true story and, of course, an actual event, which makes it so threedimensional. Secondly, there are amazing actors, especially an astonishing Tom Holland, who will surely get a row of offers after his critcally performance. And thirdly the amazing story and enactment of the fatal 26. December 2004, which is geniusly directedand well written. If you watch it, bring enough tissue with you!!!"}, {"rating": "8", "text": "No suelo ver películas que puedan estimular el fenómeno secreto-motor complejo que es caracterizado por derramar liquido del aparato lagrimal, evito al máximo la punzada en el pecho y verme ante la labor de mirar para otras partes intentando buscar fuerzas que me alejen de la escena que me acongoja, sin embargo"}, {"rating": "4", "text": "Even if everything is heartbreaking, and the actors give their best, everything is spoiled by the unsatisfying conclusion that just cancels the whole truth of the film."}, {"rating": "9", "text": "\"The Impossible'' is a true story very intense story of family's survival against the odds.worth checking out for the acting and effects ,and is not a remake movie."}, {"rating": "10", "text": "Director J A Bayona's vision for this film is simply spectacular. It manages to be extremely emotionally enticing, authentic, visually brilliant, and rooted in showcasing humanity at its finest. The entire acting assemble was flawless, but it was the scenes between Naomi Watts and Tom Holland that made this film so beautiful and real."}, {"rating": "9", "text": "\"The Impossible\" was surprisingly effective - it manages to capture what it would be like to actually experience a tsunami - but while those impressive special effects capture the carnage, the Director has also managed to sketch out vivid characters as well.  Naomi Watts maintains a focused determination amid the tragedy, while Ewan captures a father a bit more out of control - for reason clear as the story unfolds.  Suspenseful and heartbreaking."}, {"rating": "10", "text": "The best Spanish film of the history of cinema."}, {"rating": "10", "text": "Best movie i have ever seen. It's has a lot of heart touching moment that can make you cry  . it's was so real that can make you believe in that movie"}, {"rating": "8", "text": "Very good film, good character development, the eldest son in the film is outstanding, and as you'd expect Ewan Mcgregor and Naomi watts are very good, the scene where the wave hits is very powerful and the special effects are brilliant . Throughout the film i heard many people in the cinema cry, i didn't but i was very close, the eyes were glossing over believe me. Go and watch it, you won't regret it :)"}, {"rating": "9", "text": "Por mucho que sepas lo que pasará sigue impactando. Parece realmente imposible lo que sucedió. Es difícil no llorar o al menos que se te ponga la piel de gallina. Espectacular, dramática, grandes interpretaciones. Arriba el cine español."}, {"rating": "2", "text": "What am I missing here?  This is one of the worst movies I've seen recently.\rThe 5-10 minute tidal wave reenactment  while spectacularly filmed, can't make up for the hollowness of the remainder of the story.  There is barely any character development.  But the most frustrating thing is that the viewer already knows the eventual outcome of this whole pointless exercise... that all the family members are still alive and in safe hands, and that they simply need to find one another amongst the chaos of survivors/aid workers.  In the real world, one knows that eventually all will be reunited (at the very latest),  through a phone line and next-of-kin contact."}, {"rating": "9", "text": "The 5 members of this family seem real. I teared up several times. Kudos to the director who gets realistic performances from all the actors. It is particularly difficult to get good performances from children but he managed it. It is Naomi Watts, however, that is the centerpiece. The main crux of the film follows her and the oldest son on the path to safety. The Tsunami seemed real, and there is a cast of thousands around the hospital. Not sure how they filmed it but it is quite an achievement. I'm not sure I would ever want to see the film again - much of it is hard to watch, but overall a very affective film that I thought about long after the final credits.  Lastly, I would like to mention that the entire movie was given away in the trailer I saw for this movie which is a shame.  There is an art to making a trailer that makes you want to see the movie without giving too much away and more and more movies are giving away too much of the plot."}, {"rating": "9", "text": "The Impossible. As close as you will ever want to get to a natural disaster let alone one of the worst in recorded history. The movie is not all about when the waves hits, with the emotional performances of Ewan McGregor and Naomi Watts hitting just as hard. Some amazing visuals and sound design from an up and coming Spanish director Juan Antonio Bayona. Interesting how I was left feeling at the end which I believe is the point. I would say a must see movie."}, {"rating": "3", "text": "c'The Impossible' is an absorbing, well-shot, well-acted film with convincing special effects. It is based on fact. It provides the experience of having one's family caught in a catastrophe with a vividness few other films have had. My qualm is with the film-makers' decision, faced with an event that killed an estimated eight thousand people in Thailand alone and devastated countless families, to take for their subject an extraordinarily fortunate family of British tourists who were violently separated and endured terrific trauma, but who managed to find each other and return home with every family member alive.\r The story of this family is pretty inspiring, but should Bayona have considered making a film about a Thai family that did suffer loss, as innumerable families did? Is his message that when calamity strikes us we suffer great terror and difficulty, but it will all be O.K. in the end? And why are nearly all the other people we meet in this movie also European? Why are there so few Thai people? Why does nearly every one speak English? Amid so much destruction, why do we see barely any dead people? Did one of the only films made about this titanic South-East Asian cataclysm really have to star Ewan McGregor and Naomi Watts?"}, {"rating": "10", "text": "There's a feeling of triumph and bittersweet emotion when watching 'The Impossible', tragic yet triumphant on various levels of filmmaking, acting and adapting a true story of one of the most tragic events in history, the Indian Ocean tsunami that changed the lives of many caught off-guard in this natural catastrophe. We hear the story of Maria Bennett, who is based on survivor María Belón, who recounted her story for the film, where we see Maria and her family visiting Thailand on their Christmas holiday, their common worries and life problems are swept away as the family is torn apart by the devastating tsunami. Naomi Watts gives a spellbinding performance as Maria, who manages to find her eldest son, Lucas (Tom Holland) nearby, but cannot see her husband or other two boys anywhere. From here we see the brute force and devastation that an 'Act of God' can deliver, injuries and sickness aside, the destruction of family is an act that is beyond repair, especially when nothing can be done to stop it.\rIt's Watts and Holland who  masterfully command the screen as a mother and son brought closer together by loss, young Lucas must bear seeing his mother in some very vulnerable situations, but manages to help others around him, accepting that his father and brothers may be dead.\rBut it has been shot with such clarity and depth that we get one story after the other, where Lucas is in a terrible place, but his father Henry (Ewan McGregor) is also in a terrible place, more so because of how helpless he feels that he cannot find his wife and eldest son, these three stars each give performances that demand perfection and respect.\rThe film shows how a situation brings the common man together, through hope and sometimes heartache, the film is a testament to the good inside everyone, something we see throughout the film as strangers from various parts of the world band together in the face of danger, and it is also a testament at how differences and problems are put away when something natural can affect the lives of everyone in the same way as the person next to them. The title hold relevance to many aspects of the film, the unlikelihood of survival, the mission of finding survivors, the devastation caused, but also the bond that can be shared in times of need, highly improbable, but not impossible.\rThis is an honest and detailed film, which is shot in an emotional sense of being there, where we can relate with terror and angst with these characters, and revel in their hopeful good fortunes, the film takes pride in cataloging an horrific incident with such force and thrill, but also showing human nature winning out."}, {"rating": "10", "text": "The Impossible was one of the most suffocating and powerful emotional dramas I've ever seen and the fact that it is a true story constantly plays in the back of your mind while watching, effectively multiplying the emotion and drama even more. The acting was incredible and the special effects, especially the tsunami scene in the beginning, were fantastic. Having seen almost most of the critically acclaimed films in the 2012 year, I can now say that they made a mistake in giving the Best Actress in a Leading Role to Jennifer Lawrence for her role in The Silver Linings Playbook. That award should've gone to Naomi Watts for her incredible and moving performance in this film. Lawrence did great but Watts was amazing, key difference in my opinion. The Academy's blunder aside, The Impossible is a movie that is definitely worth a watch."}, {"rating": "3", "text": "A rather boring flick about a father, mother and three sons who are separated when a tsunami hits. The rest of the film is about them trying to find one another. That's it! The star isn't Naomi Watts but rather all the flotsam and jetsam in the aftermath of the tsunami. There are many more shots of the devastation and debris than there are of her, and for her fans, half the movie features Naomi's face full of bruises. I think you can do better."}, {"rating": "7", "text": "Great film. It´s not a masterpiece by any means, but the acting from all the cast and the way they recreated the tsunami alone deserve the 8 I´m giving it. Naomi Watts is really into the character and gives one of her best if not her best performance to date. The kid is also great for his age and the few scenes in which Ewan McGregor takes the lead are also really well made, very realistic. After the big tsunami happens I thought I was going to be a little bit bored but it managed to keep my attention. Its flaws: it´s not original, it´s a little bit cheesy at moments and bases it´s strength in playing with the audience. It´s predictable but you don´t mind. The tsunami scenes are so realistic. 8/10"}, {"rating": "10", "text": "I had low expectations going in but this movie was phenomenal.  Such powerful storytelling found in very small moments and superb acting.  The disaster scenes are not overdone and this movie does not contain all the cliches that you would expect from a movie of this subject.  I don't know why Naomi Watts isn't considered a front-runner for her performance.  It was breathtaking."}, {"rating": "3", "text": "The plot is bold and simple, soundtrack is over the top, and it is mocking the real victims of the disaster by focussing on the supposedly heartbreaking story of some westerners spoiled holiday while 300k died around them."}, {"rating": "0", "text": "One start because the tsunami scene is technically realistic. That's all, you can change channel or change movie just after that, the movie is so unbearably and annoyingly predictable that is a real waste of time to watch. The lucky family survives and everybody else dies...what a shame and an insult for the people who really suffered in this event."}, {"rating": "8", "text": "Focusing heavily on the human aspect, The Impossible is on the other end of disaster movie spectrum, and one born of true struggle. While the first half has plenty of carnage, the latter shows its terrible repercussion. Acting from everyone is incredibly solid, it appeals dearly to audience by showing the family's struggle in such vivid fashion and without overselling the already grandiose effect of the tragedy.\r It's emotionally moving as each member of the family tries to overcome the peril and find strength to do so in midst of the wounded. Naomi Watts (Maria Bennett) gives a fantastic performance, she really portrays the pain and helplessness, but still a mother who has to comfort her child. She displays such rivetingly agonizing grace beyond what make-up, while it helps, could possible show visually.\r Tom Holland (Lucas Bennett) is equally impressive, he's so young but already performs such mature role as a child who needs to not only cope with the catastrophe but stay firmly strong for her mother. It's one of the best performances from young actors to date. Ewan McGregor (Henry Bennett) plays the kind father convincingly, who is torn in the overwhelming circumstance. He looks weary, tired and knows he most likely will not succeed, yet marches on staggeringly for his family in daunting shattered scenery.\r This family of five endear to audience, especially the children, it's really easy to invest in their story. However, the dialogues are very plain. It's somewhat emphasized on the real life as it"}, {"rating": "10", "text": "This is the most haunting and realistic portrayal of a natural disaster in a movie, that I have ever seen.  Naomi Watts and the young actor who plays her eldest son are wonderful.  They bring such emotion to the scenes.  Maybe I'm a sap, but I cried at the tear-jerking parts.  It worked for me and moved fast.  One particular scene, where Naomi Watts' character is unconscious during surgery is amazing---how they filmed this movie astounds me."}, {"rating": "0", "text": "There is no way this movie can have a 73 rating on here. The movie is just so agonizing to watch. To start out with, there is no way the entire family could have survived this, as they show the guy and his two sons taking the full impact of the huge wave at the beginning of the movie. The boys don't even have a scratch. Just ridiculous. The endless sequence of the mother and the other son is just that...never ending moaning and screaming. They show a wound in the mother's right leg that is so huge that there is just no way she could walk, let alone...live. The blood loss would kill her in less than two minutes. The young boys say things young boys would never say in real life, it is way too obvious that they are just saying memorized lines. There is no character development whatsoever. The father leaves his two young boys, possibly all he got left, in the middle of the night to search for his wife and other son who are likely dead  He doesn't even know where the boys are going. No father would do that.\rEven the only possibly redeeming scene, the wave hitting land is, cheap and bad. This could easily be Ewan McGregor's worst role. Almost two hours of agony."}, {"rating": "7", "text": "It's a much better, more emotional movie than I thought it would be. The actor who plays the oldest son is phenomenal, and he should be considered for a supporting actor nomination come awards season. Naomi Watts is excellent, as usual.  The movie as a whole, however, is a touch conventional."}, {"rating": "10", "text": "Inspired and deeply affecting, notwithstanding some of the churlish notices the film received from snobbish, politically correct critics at the New York Times, The New Yorker et al.  One suspects their Liberal dander was aroused because 'The Impossible' depicted the (true) story of a white family that survived a Third World disaster in which People of Color died by the hundreds of thousands. Ignore these intellectually dishonest reviewers. As an achievement in art, 'The Impossible' was excellent in every way -- the best film I've seen so far in 2013."}, {"rating": "10", "text": "I am not to mourn, and this movie tears me out. With a message of love and family, this film proves to be a jewel of the tragedy and drama; giving us harrowing scenes with Naomi Watts, proving it is an Oscar nominee."}, {"rating": "10", "text": "Absolutely stunning. It was the first film I saw to be released in 2013 (in the United States) and already I can see it as being the best. Many times, I don't fall for attempts for sympathy in movies. This was entirely different. Prior to seeing this movie, I watched a documentary about the Tsunami which primarily seemed to primarily focus on various people who were vacationing to various countries in the Indian Ocean. It was brutal, sad, and disturbing. This movie being based on a true story of a foreign family that visits a resort in Thailand, it was like I was watching a dramatized version of the documentary all over again, and because of the reality of the situation, the movie was incredibly powerful in its emotion. I can easily say that this may be the saddest movie I've ever seen, and also one of the most tense. There isn't really a moment in the movie past the twenty minute mark where you won't feel at least a decent urge to cry, and honestly I'm surprised I didn't show as much outward emotion as I did - When I left the theater, I had a headache because of it. Every actor and actress in the movie did a stunning job in portraying realistic emotion and desperation, creating a sense of real fear, grief, loss, and sorrow. This movie will affect you. It certainly affected me."}, {"rating": "8", "text": "One of the most harrowing natural disasters in recent history forms the basis for The Impossible, the most recent film from director Juan Antonio Bayona, the acclaimed director of the Orphanage. The film follows a family vacationing in Thailand for Christmas back in 2004 when the Boxing Day tsunami hits. the film tells the true story of a families struggle to survive in the most shocking of conditions following an unspeakable horror. Much like The Orphanage, The Impossible is a story more about reconnection than survival as this family of five struggle to find each other in a country that is completely alien to them, in a place where almost everyone is trying to find someone and has no time for others. Films like this have the tendency to over sentimentalize the material and its true that the film loses its identity in favor of a big dose of cheddar as the film draws to its conclusion but it almost doesn't matter after the ordeal that is the first hour. The Impossible is a grueling watch in its unbiased depiction of a people and a country ravaged by an unapologetic ocean of water. The cast is led by Ewan McGregor and Naomi Watts, who both give give stunning performances as Henry and Maria, parents to children Lucas, Thomas and Simon. Watts deserves her recent Oscar nomination for her all in performance as Maria, a woman with great courage and conviction tasked with the unbelievable task of keeping Lucas safe even though she doubts she will make it. Mcgregor's worried father Henry is equally as affecting as Watts is because he is exactly the opposite of Maria, he doesn't know how to hide the fear he has for his family, especially Lucas and Maria. Lucas is played with great skill by child actor Tom Hollander who shows the heart of the character even when the script forces him to film flop from a teenager to a child and back again. The characters are the best thing about the script by Sergio G Sanchez but Lucas seems to regress into a 5 year old boy half way through the film to service a side plot that is thoroughly irritating. The script itself is absolutely woeful, in fact the only reason the film isn't a 9 or a 10 is because the script is so bad it ruins both the opening and the end with the opening being unnatural and stiff and the end being over the top and borderline offensive. The actors struggle through lines about leaving the alarm on, something that in a better script would seem like a perfectly normal thing to talk about but this script is so dreadful it makes the lines seem like comedy, something you really don't expect from a film with graphic content and highly distressing themes, it just feels wrong. Overall though the film is saved by some fantastic direction through the initial wave right up to the uplifting finale, as well as by some devastating performances, none more so than Ms Watts, an actress I had not rated until this film. It's fearless and powerful and for that reason alone it will make most people bawl their eyes out in the most cathartic way possible. An emotional roller coaster of a film."}, {"rating": "6", "text": "The film starts off very unpleasant, but it eventually builds up to a solid climax, with some very inspirational and honest emotion along the way. The film is definitely not for everyone."}, {"rating": "10", "text": "A total \"wow!\". This film touches the deepest of emotions when it comes to family and love. This is unforgettable in every aspect. Best performance from Ewan McGregor and Naomi Watts. Excellent screenplay, cinematography, sound, and editing. Possibly the best film of 2012 and the-one-to-beat for the decade.\r movienotesbook.blogspot.com"}, {"rating": "7", "text": "Naomi Watts just seized her second Oscar nomination (ended with an inevitable lose though) in this tsunami catastrophe survival drama which happened in South Asia 2004. Directed by Spanish young director Juan Antonio Bayona (yes, it is a Spanish production in spite of its mainly English-speaking cast), which marks his comeback after the internationally-accoladed debut THE ORPHANAGE (2007, 8/10), an ingeniously orchestrated horror-fest. The film’s first half is a lip-smacking triumph not only for the special visual effects simulating the walls of water and its overwhelming impact, it’s like HEREAFTER (2010, 6/10) meets 127 HOURS (2010, 8/10), vividly renders a kindness of faithful vicariousness on viewers through the white-knuckle self-salvage from the mother-son dyad. And if HEREAFTER could nab an Oscar nomination for BEST VISUAL EFFECTS, THE IMPOSSIBLE easily trumps it. But for the second half, the storytelling adopts a middle-of-the-road sentimentality, it is all about the reunion, still, there is a remarkable achievement for the editing team (and the cinematography group as well) to interlace Watts’ flashbacks under the water with the operation she is undergoing, which is done with an eye-opening flourish. Adapted from a true event, from one hand, it affirmatively obviates the barbs like what’s the odds the entire family (one couple with 3 son, age 12, 7 and 5 respectively) could pull through the calamity, it is a genuine miracle literally had happened (as far as the denouement concerned), so just deal with it! But  from the other hand, the film shamefully sacrifices the accuracy for the sake of the emotional climax, which is a prerequisite for selling the tickets I suppose, and it worked (my eyes swelled with tears for many occasions), even simultaneously there is a tint of bathos ascending when the five of them finally find each other altogether at one place one time, it is so lame! Anyway, the film is also a victory for the cast, although Watts is bedridden for half of her time on screen, her hard-earned Oscar nomination is well-deserved, an impeccable endeavor out of the mundanity of her character (a woman try to survive under a dire circumstance). Tom Holland, the true leading man and great discovery from the film as the eldest son, has a stunning resemblance of a young Jamie Bell (what a coincidence, Tom was actually had a stint in BILLY ELLIOTS the musical to play the titular role in 2008, and call it sexism, academy never nominates teenage actors for their leading roles), most of the time he is the audience’s proxy, we see through his eyes, his precocity and gallantry dominates the most chunk of the film’s narrative and it has been executed unimpeachably. Ewan McGregor, absent for a disturbingly long time in the film, can only descend himself in a supporting part, he is a consistent great player in the race who is unfortunately always falling under the Oscar radar by only a notch, his cellphone-calling scene should be inscribed in every Oscar voter’s mind, so next time, his glory will be duly justified. Also, the great Geraldine Chaplin, delivers the punchline “the impossibility of death stars” in her unforgettable cameo.\r Juan Antonio Bayona has warranted his craftsmanship in dealing with spectacular sensations, so Hollywood might beckon him to their wonderland, even if not, I daresay the next big thing is on the rising.  ps, I guess Seth MacFarlane did see this film since apart from MULHOLLAND DR. (2001, 9/10) we also saw your boobs here, Naomi, but this time we are in a rueful mood."}, {"rating": "9", "text": "The Impossible is based on a true story of a family who were vacationing in Thailand during the 2004 Tsunami. From everything I've read, other than changing their nationality from Spanish to British, the story is almost spot on as told by the mother of the family. That's why accusations of coincidentality I've heard leveled at this movie are far off base. After a few scenes setting up a loving although imperfect family dynamic, the movie veers headlong into tragedy. The minutes picturing the tsunami and family members dragged along by its force are incredibly visceral. I found myself wincing multiple times. However, after these harrowing minutes, the movie goes on to show the incredible will to survive and how tragedy can bring out the best in people. The story that unfolds is both emotionally satisfying and bittersweet.  Before seeing The Impossible I had mostly heard the acting was wonderful and the politics execrable. Naomi Watts and Ewan McGregor both do great work, but the real star is Tom Holland who also has to hold up for more screen than any other character. As for the politics, the goal of the film is obviously to tell the story of a single family who were vacationing in a resort area of Thailand. Therefore, it is unfair to accuse the film of not showing the thousands of Sri Lankans who were also killed. That being said, because of these accusations I expected to only see whites almost throughout the movie. However, this was not the case. One of the most heart-wrenching scenes in a heart-wrenching movie were the scenes of lost children without parents who were a mixture of races. How could anyone see this and accuse the movie of thinking only whites were the only victims of the disaster?\r While not a movie for people with weak stomachs, The Impossible is well worth the time of anyone who is interested in the triumphs that can come out of tragedies."}, {"rating": "10", "text": "Beginning with a terrifying dramatization of 2004 Indian Ocean tsunami which is considered to be one of the worst disasters of the history, The Impossible is an uplifting and exceptional story of a family that survives the disasters but they lose each other for some time, they don't know where to find each other, obviously, because of large casualties and also because one cannot think properly after encountering the most shocking thing they would haven't even imagined. The story of Belon family is based on a true story of the survivors and I must say that this is an exceptional piece of story penned into the film. The cast members especially Naomi Watts and Ewan McGregor give phenomenal performances, so powerful that it makes you cry at times. Their characters seem believable, you can get inspired by them, it doesn't feel like there is no development in their characters. Hats off to Juan Antonio Bayona for such an outstanding direction. From beginning to the end; everything from the occurrence of the disaster to the reunion of the family; everything from the screenplay and camera work to the editing; everything is flawless, perfect, emotional and motivating. The Impossible is clearly one of the finest and the best films of 2012. IT IS AN ABSOLUTE TEARJERKER. A MUST WATCH!"}, {"rating": "8", "text": "A powerful and truly emotionally harrowing drama, The Impossible is a stirring and inspirational film about the human spirit, survival, and love. Ewan McGregor, Naomi Watts, and Tom Holland, are all incredible and emotionally powerful in this film about a true story set in the 2004 tsunami in Thailand. While it was criticized for being whitewashed, the film's story is simply too powerful to be constricted by race and instead it is a truly human story. Additionally, the cinematography and special effects are truly breathtaking. From beginning to end, I was struck by the beauty of this film and it really contributed to the overall inspiration and feel of the film. The direction from JA Bayona was very good and it reinforced my belief that he is a guy to watch and keep an eye on. Overall, The Impossible is a truly harrowing film that both breaks and warms your heart with ease thanks to its powerful premise and effective approach to its true material."}, {"rating": "7", "text": "Naomi Watts' moving performance is only surprising because she spends much of the film very weak and comatose. The story is life-affirming, but it is hurt by the pounding orchestra that accompanies most if not all of the more emotional scenes. The direction is incredible. A visceral experience, never more so than during the impressive tsunami which is more impressive than anything out of a disaster film."}, {"rating": "7", "text": "If you've been to the movies in the last couple of months chances are you've seen the trailer for The Impossible. You know pretty people on vacation, the tsunami hits, nature at its worst, tears, screaming. The most manipulative sentimental crap ever. It dared me not to tear up. Forget about that; the actual movie is very good, and while I cried many times it was not manipulative at all but rather a sobering horror story about the dark side of nature and human connection and survival.\r The film tells the true story of one European family of five during the 2004 Tsunami in Thailand. They are British in the movie although Spanish in real life, as is the director J A Bayona (The Orphanage). The set up from the family plane trip to Thailand until the waves hit is intense and scary using horror genre techniques to get you on edge of your seat. Bayona builds up the tension using every trick in the book; the plane turbulence, the distant rumbling sounds of the waves - all serve as ominous signs for the horrors we are about to see. The immediate aftermath is also depicted effectively particularly the confusion, panic and disoreintation and the very horrific loneliness of separated people against nature.\r Bayona has several tricks up his sleeve to keep us entertained and scared. There is a thrilling set up piece in the hospital as the separated family members search for each other. Another is a subplot about a young lost boy found by the family that pays off in a major way both emotionally and as an engrossing plot device.\r Naomi Watts and Ewan McGregor play the parents and Tom Holland is the oldest son. All three dig deep to expose how fragile we all are in the face of nature. Watts' character suffers the most both physically and emotionally. The physical part was very hard to look at; her body is battered, bruised and purple all over. However she is magnificent at portraying pain, anguish, resilience and utter and complete fear without resorting to sentimentality. I was mesmerized whenever she was on screen.\r McGregor gives a fully emotional performance;only a hardened soul would not be moved by his break down scene. It is particularly effective because men are never really given a chance to get this emotional in movies. If George Clooney almost won an Oscar for one lousy tear in The Descendants, McGregor should get some hardware for this performance too.\r Holland acts the audience surrogate and we are with him every step of the way. And what a harrowing journey it is. But it's also a very human experience as we watch the young man mature and understand what's important in life.\r Some people may have issue with the movie concentrating on one family's story when the devastation was all consuming. Particularly because said family is white. It's not an issue since the movie does not pretend to be anything but this one family's amazing story of survival. Yes there are millions of similar human stories that happened during the Tsunami and maybe one day we'll see some of them on screen. And if we are lucky maybe one will be from a Thai filmmaker.\r The movie works because of the performances and the genre elements that keep the viewer engaged. Because this disaster was felt in every corner of the world, there might be expectations put on the movie to tell a grander story. It does not but what it tells is interesting and moving."}, {"rating": "8", "text": "Visual and hits you right in the feels. It is during the times without dialogue where it really strikes an emotional chord. The unreal situation that surrounds this family is unbelievable, them surviving is seemingly impossible (hence the title). I imagine this is one of those \"only good in theaters\" movies. It demands, nay, it deserves your undivided attention. As far as acting/directing goes, one of the best of the year. The performances rank up there with other diasaster flicks, although this one is real, and raw. Brilliant performance goes to the son, Lucas in the film. He stole the show from Naomi Watts and Ewan McGregor."}, {"rating": "10", "text": "A harrowing account of one family's desperate attempts to survive a devastating Tsunami. Based on true events that happened on Boxing Day in Thailand 2004, The Impossible offers an almost unbearably realistic depiction of the catastrophe. Director J A Bayona utilises a variety of camera set ups to immerse us into the heart of the story, whilst at other times allowing us to just observe the resultant chaos. The cinematography and special effects are amazingly good and the music score and sound stirringly compliment the visuals. Heartfelt performances by Naomi Watts, Ewan McGregor and Tom Holland add pathos to the proceedings. On the evidence I'm now totally convinced that this wonderfully intense movie experience is as close as I ever want to get to a real Tsunami."}, {"rating": "10", "text": "This is my first movie review I have ever done. I watched the film looking for a \"normal\" movie. Instead of that I Realized that this is one of the best movies I´ve ever seen in my life.  Very touching and breathtaking."}], "recommendations": ["manchester_by_the_sea", "only_the_brave", "the_florida_project", "hotel_rwanda", "first_they_killed_my_father", "21_grams", "legends_of_the_fall", "just_mercy", "the_boy_who_harnessed_the_wind", "melancholia", "blue_valentine", "the_light_between_oceans", "a_monster_calls", "lion", "the_descendants", "12_years_a_slave", "the_hunt", "minari", "the_last_king_of_scotland", "the_road", "leave_no_trace", "collateral_beauty", "call_me_by_your_name", "revolutionary_road", "marriage_story"]}