{"id": 4273, "title": "The Wrong Missy", "starring": ["David Spade", "Lauren Lapkus"], "runtime": 90, "genre": ["Comedy", "Romance"], "description": "A guy meets the woman of his dreams and invites her to his company's corporate retreat, but realizes he sent the invite to the wrong person.", "releaseYear": "2020", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/A2YlIrzypvhS3vTFMcDkG3xLvac.jpg", "categories": {"plot": 3.75, "acting": 3.5714285714285716, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.235294117647059, "action": 5.0}, "reviews": [{"rating": "0", "text": "To be honest, in lots of scenes if the roles were inverted it would have been assault. So why it is not just because the protagonist is a male? This is so wrong on so many levels."}, {"rating": "9", "text": "Great Comedy Film. i laughed a lot and Lauren Lapkus had this crazy look.The End is a little bit lame but its worked really good."}, {"rating": "4", "text": "If you like the \"don't think\" comedies, it's average. Only problem I had with the movie, was the plot, the \"wrong Missy\" (Lauren Lapkus) was not likable from beginning, and since the real Mellisa \"right Missy\" (Molly Sims) was on screen, I loved her, and the movie just pushed you to \"like\" wrong Missy, but i just couldn't. Average Happy Medison movie."}, {"rating": "6", "text": "What do people expect with a Happy Maddison production, Funny slapstick comedy that's it!!!.I can honestly say the film is ok there's some laugh out loud moments but you can tell these guys are not wanting oscars, they are all friends and love to have a laugh.Definitely worth a watch to have a chuckle over complete stupidness that does not take itself  seriously."}, {"rating": "9", "text": "I know movies are obviously very subjective. That being said, my wife and I absolutely LOVED this movie and laughed our asses off from beginning to end. Missy's character was so over the top and funny and just made the movie. Our all-time favorite movie is and always will be Step Brothers but The Wrong Missy has easily clinched our number two spot. I highly recommend watching. If you're not laughing hysterically in the first 15 minutes, turn it off because this movie is clearly not for you. However, if you are laughing hysterically, enjoy...because it won't let up until the end."}, {"rating": "2", "text": "The lack of effort is insulting but this **** gets produced because it's what people consume in Netflix and unfortunately I'm part of that statistics because I watched it there.I would be ashamed to be David Spade and know that I only get jobs because I'm friends with the producer"}, {"rating": "4", "text": "This film reminded me a lot of Adam Sandler's Jack and Jill as it tries way too hard to be funny and relatable and it just results in a boring movie with an overly annoying main character."}, {"rating": "10", "text": "This movie is now my new favourite comedy! I cannot understand these fools saying “ I didn’t even laugh once”...please."}, {"rating": "1", "text": "Absolutely awful, didn't laugh once. I did groan and cover my eyes a lot. Can we please stop trying to make David Spade happen? The dude is awful and has been awful pretty much his entire career and the main character playing Missy was so overbearing and over-the-top that I wanted to push her off the 50th floor of a high rise building. Avoid this movie at all costs if you have a brain in your head as it's clearly made for the lowest common denominators."}, {"rating": "9", "text": "was not expecting a good movie....wow was I Happily surprise, funny, physical comedy... be sure to watch it...adult humor...so not with the children... highly recommended."}, {"rating": "3", "text": "Rarely do you want to strangle the female lead in a movie unless she is the villain. Not so with “The Wrong Missy.” The “wrong” Missy (Lauren Lapkus) is so egregiously, teeth-grating, head-bangingly annoying that you’re ready to kill yourself or her within the first 20 minutes. She gets better, but not much.  At least David Spade, Vanilla Ice, and Rob Schneider were temporarily saved from the Hollywood “whatever happened to…?” dustbin with this project, but for how long? OK to see when: stoned, drunk, on heavy pain meds, hungry for low comedy, or just bored out of your mind and churlish about “Tiger King” being over."}, {"rating": "10", "text": "My wife and I were looking for something to get our minds off the current COVID crisis. Then we stumbled onto this gem which might be the funniest thing I've seen in years. Don't do too much thinking, just sit back and enjoy it."}, {"rating": "4", "text": "Has a few funny moments but overall more cringey than funny.  Lapkus' performance is the only real highlight as she somehow makes the extremely eccentric Missy feel both real and likeable."}, {"rating": "6", "text": "Just your average brain dead comedy it's fun for what it is, the jokes can be insulted as sexually harassment, but i think it's fine for what it is.Plot : 6Sound : 5Enjoyable : 5Easy to follow : 7Easy to watch : 7Laugh factor : 6i had a few good laughs like in the plane scene.Overal just watch it when you have nothing to do."}, {"rating": "5", "text": "While the idea was good for the comedy and some jokes I found quite funny, overall it was too over the top and at times it was too annoying. I get that the main character there should've been like over the top in a way and annoying but I found it a bit too much for the viewer at times too."}, {"rating": "3", "text": "Too often it's too exhausting too annoying for me. On the actors performance it's actually done very well, but the chosen form of the comedic interludes is just too blatant."}, {"rating": "8", "text": "Generic Happy Madison’s movie with a predictable plot. However it did make me relax and enjoy it. Movie has a really nice vibe and a strong message. I recommend this movie for a “netflix and chill” night."}, {"rating": "0", "text": "This movie is wrong. So wrong at so many levels I truly can't believe this was made in 2020."}, {"rating": "8", "text": ", click expand to view"}, {"rating": "0", "text": "I felt so strongly about how bad this film is that I took time out of my day to join Metacritic and write this review. It is awful, there is one scene where \"The Wrong Missy\" full on sexually assaults Tim (David Spades Character)and it's fine. I'm not offended by it, it's just not funny its just gross. Lauren Lapkus's Missy is so super predatory it goes beyond playing for laughs and just becomes uncomfortable.I don't know why David Spade is wearing a bad wig and I have no idea why any woman would want to pay attention to someone as dull and as 2 dimensional as his character in this POS. I wasn't expecting much from this film going in, I just wanted to watch something goofy after a bad day at work, but this was bad, badly written, badly directed, badly acted.Please for the love of god!!! Save yourselves and don't want this film!!!!!"}], "recommendations": ["good_luck_chuck", "the_hangover", "the_watch", "dinner_for_schmucks", "30_minutes_or_less", "grown_ups", "trainwreck", "the_change_up", "this_is_the_end", "the_ridiculous_6", "what_happens_in_vegas", "tammy", "rough_night", "miss_march", "jexi", "ted_2", "couples_retreat", "jackass_presents_bad_grandpa", "ted", "thunder_force", "dirty_grandpa", "hot_tub_time_machine", "dumb_and_dumber_to", "superbad", "hubie_halloween"]}