{"id": 3849, "title": "The 15:17 to Paris", "starring": ["Ray Corasani", "Spencer Stone"], "runtime": 94, "genre": ["Thriller", "History", "Drama"], "description": "On Aug. 21, 2015, the world watches in stunned silence as the media reports a thwarted terrorist attack on a train that's bound for Paris -- an attempt prevented by three young Americans traveling together through Europe. The heroic and courageous actions of Anthony Sadler, Alek Skarlatos and Spencer Stone help to save the lives of more than 500 passengers on board.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/qxJQ0VBCuJkJhJmuWzxI408ngwd.jpg", "categories": {"plot": 4.928571428571429, "acting": 5.0, "ending": 4.888888888888889, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 2.0, "funny": 5.0, "action": 2.8}, "reviews": [{"rating": "6", "text": "\"The 15:17 to Paris\" is the newest movie from director Clint Eastwood.It is a docu-drama describing an event that happened in August 2015 on-board of a train to Paris when a few brave people stopped a terrorist from committing a massacre.I salute the bravery of the those few who risked their lives to stop the terrorist but the movie is definitely not Clint's best.I can understand why Eastwood picked that incredible story. It is quite inspiring that a regular person can become a real hero. Three Americans, main characters, play themselves in that movie. To my knowledge no director did it in a feature movie before Eastwood. But I could see why no one did it. You could tell these guys are not actors and that they were \"acting\" in the movie.Additionally, there was too much of nothing in the film, especially during the trio's vacation in Europe. Much attention was devoted to development of the main hero, which is fine. But it would be much better to make it a short film, not full feature."}, {"rating": "3", "text": "The 15:17 to Paris is one of those movies that I'm not quite sure why it was made. Is it a heroic story? Yes, but the actual story is an event that lasted maybe 10 minutes. So to make an entire film about it, and cast the actual people from the event in the movie... Let's just say my expectations were pretty low going in, and it didn't even meet them. The acting in this movie is quite painful to watch at times. I don't think this is entirely the fault of the actors considering how few takes Clint Eastwood has been known to take, but it really sticks out like a sore thumb at times. You can also tell that the actual people from the event had never acted before this movie, although they weren't as bad as I was expecting them to be. But, the acting isn't even the reason why this movie is a stinker. This movie is a stinker because 96% of it doesn't matter. None of the plot matters that much when you reach the end. It's as simple as that. It's all just fluff until you reach the final 20 minutes of the movie, and not good fluff at that. I wasn't gonna mention this originally, but there were also some fairly random religious references throughout this movie that felt quite out of place to me and the person I saw the movie with. Just felt shoehorned in."}, {"rating": "7", "text": "In the day-and-age where everyone is asking for something different, Clint Eastwood delivers on that and gives the audience something different. The 15:17 to Paris focuses more on the events leading up to the incident adverse to the incident itself. By using the people who experienced the event adverse to using actors, the movie allows these brave heroes to justly tell their story."}, {"rating": "0", "text": "Such an atrocity of a film. Boring, stupid, pointless. Everything about it is terrible. The acting of terrible, the pacing is the worst I've ever seen, and it literally takes the WHOLE movie to reach the train scene. At this point I am convinced that Clint Eastwood has lost his mind."}, {"rating": "8", "text": "Spoiler-freeThe 15:17 to Paris is definitely nowhere near as bad as the professional reviewers and some of the audience comments might lead you to believe. Were there moments of cringe-worthy dialogue? A few perhaps. Was it obvious that the three main actors weren't really actors? Yes, but, honestly, that was actually refreshing. Because we live in a very photoshopped and airbrushed and overly-rehearsed and overly-polished society media-wise. The media in almost all of its forms offers us the common man and woman these near impossible standards of beauty, grace, athleticism, eloquence, etc, and not to mention in films especially, absolutely over-the-top and outlandish unreal action sequences. So it was more than refreshing to see something that matches up more with real life and that shows some of the awkwardness and banality, and even mundaneness and mediocrity, of the average Joe and average Jane.Now, in my opinion, yes, the three Heroes / actors are a bit too wooden and solemn in their dialogue. I would assume that in real life they have more banter and more of a joking nature in at least some of their interactions.  But in the movie, this either wasn't shown, or when the attempt was made to show some levity, it usually seemed to fall fairly flat.But again, I did not personally find that nearly as offensive and detracting from the overall quality of the movie as did the majority of the critics and some of the non-professional reviewers. In fact, again, I found it to be rather refreshing.For me, the movie worked, and worked very well. It's certainly not a masterpiece like Unforgiven or Gran Torino. And it certainly doesn't have the same dramatic punch throughout like Sully and United 93 had. In fact, I think it would have been interesting if they had made some mention of United 93 in the movie as a form of foreshadowing. These young men / heroes are all in their mid-twenties, so they would have been around 10 years old when 9/11 happened, and probably in there early to mid-teens wind the movie United 93 came out, so, in my opinion, that certainly could have made for something that might have inspired these boys.Overall, an excellent movie and well worth watching. And if you go, make sure you stay at least halfway through the end credits."}, {"rating": "3", "text": "Using actual people was a good concept but would have been better in a made for tv version and about 1/2 the length.  This is not a hollywood quality movie.  Traveling around Europe felt stretched out and didn't add much to the overall story.  It was a good attempt but ultimately falls short."}, {"rating": "5", "text": "I have so much respect for these guys, and the story is very heroic, but honestly aside from the train scene (which only takes up like 10 minutes) this story just isn't interesting enough to make for even a 90 minute movie. It has the best of intentions which is why I hate to say this is just bad"}, {"rating": "3", "text": "I was extremely disappointed in this film.  Everybody has their 15 minutes of fame (and not to diminish the heroism of the actual heroes) but I struggled to find 15 minutes of enjoyment in this film.  It seemed like the film space had to be filled with a lot of \"stuff\" to make up the time.  I was thoroughly bored."}, {"rating": "10", "text": "I didn’t really want to see this movie until I found out the heroes played themselves, including Mark Moogalian. It made the recreation more real to me where there was less “dramatic license” than most movies based on true events. These guys won’t be getting acting awards, but the story was told well (a little slow though until the incident) on why they were able to stop this gunman. It was a worthwhile experiment to use the real people!"}, {"rating": "3", "text": "How does a filmmaker depict an event that lasts only a few minutes, but reverberates with terrorist consequences? For director Clint Eastwood, he chose to go into deep the backstory of the 3 Americans who saved the day. For authenticity, he cast the actual trio as themselves, which is a cool concept, but resulted in somewhat wooden performances. To compound matters, the script is stunningly simplistic and the wanderings around Europe are crushingly dull. Considering what actually happened, the climactic event has little suspense or even a discernible timeline (there's also no conclusion of what happened with the terrorist or the man who was seriously wounded). It's admirable to salute the bravery of these young men, but this re-creation creaks with a one-dimensional approach that's exacerbated by mediocre acting."}, {"rating": "0", "text": "Tragically bad mishandling of what was a compelling true story. There's a reason actors exist...they can act. Casting the three actual guys, and then apparently letting them ad-lib for two hours, was fatal miscalculation. Eastwood also f'd up Sully by creating a whole fake story line about the crew being second-guessed by the NTSB. Never happened, and the movie revolves around it."}, {"rating": "3", "text": "Incredible story but no direction whatsoever and it wasted most of talking about their super boring backstory and nothing about the terrorist."}, {"rating": "4", "text": "Honestly, Eastwood will be remembered as a great American filmmaker, but these American military fluffer propaganda movies he keeps making about how star spangled awesome people in the service are, makes me want to vomit. I was in the Army. Just as many jerks there as there are anywhere else in life."}, {"rating": "10", "text": "The critics got this completely wrong. The point of this film is to show that average people, with all their flaws, can achieve greatness if they have integrity and if given the opportunity. Eastwood conveys this theme with realism, style and grace by using the original characters. He also conveys how hard it is for the average person to discover their values and translate them into a career or job in today's world. This is the best movie I've seen in a long time.  I applaud its honesty and unpretentious realism."}, {"rating": "2", "text": "This is one of the worst movies I have ever seen. It was so slow, the dialogue & story line was like watching paint dry. I kept hoping it would get better but was very disappointed. I don't really understand how someone playing themselves could be so unbelievable. I understand the young men were heroes & feel they should have let actors portray them. The fanatical religious propaganda was ridiculous. I actually like some of the real actors in the movie unfortunately this movie was subpar. I really think this story could have been told better, with a deeper connection.  Clint Eastwood did not do a good job of directing or producing this film."}, {"rating": "2", "text": "I think Clint could have made this into a nice movie short-maybe 45 minutes. That's about the length of time it would take to cover relevant detail on Spencer Stone's background and add some detail for Anthony Sadler and Alek Skarlatos that was missing. At 96 minutes running time, it still needed significant editing. The middle portion of the movie, which showed the guys touring Europe before the fateful train trip, was especially tedious and included banal dialogue and little of interest. We didn't learn much about our heroes from that, so why include it?  And how did I emerge from that movie having watched four people subdue a terrorist and aid a badly injured man and still not feel a sense of tremendous pride and nationalism? Perhaps it was too unpretentious and too concerned with an accurate retelling complete with mundane detail?  I don't know.  What I do know is there was vastly more dramatic tension and emotion in the low budget Bollywood movie I saw yesterday, Pad Man, about a dude in India who devoted is life to developing a cheap menstrual pad to save the lives of many women there.  That's a movie worth seeing.  This was a mess and should be a source of embarrassment for Clint Eastwood."}, {"rating": "1", "text": "I would have to say that this is Clint Eastwood's worst film to date.  I was truly bored for 95 percent of the film and only at the end was there something to keep my interest.  I hope this isn't his last film, I love his other movies!"}, {"rating": "10", "text": "I enjoyed this movie immensely, and I left the theater deeply moved.  Now, I certainly can understand why a movie critic would hate “15:17 to Paris.”  It makes normal Americans feel extremely proud.  The hero of the story is a big, strong military man, as is one of his two buddies.  The heroic trio, as boys, loved to play war games with guns.  And the worst parts: all three were raised in Christian homes, and the one who jumped and subdued the Muslim terrorist later asked the wounded man to whose artery he was applying direct pressure if he wanted to pray.  (He did normal Christian stuff, and he looked really admirable while he did it.)  The leg-crossing pencil-necks said the long buildup to the climactic showdown on the train was boring and it was a mistake to let the three heroes play themselves rather than hire professional actors.  I was not in the least bit bored by the depictions of events that had shaped the men's characters and of the activities that led up to the fateful day, and I came to like all three men very much.  They drink, swear, and go places I wouldn’t go; but they are the embodiment of what sets Americans apart.  So remember that critics live in a bubble and break into a rash at the sight of perspiration, and go see this wonderful inspiring film.  I suspect that word-of-mouth will turn this film into a blockbuster."}, {"rating": "0", "text": "Not sure what Clint was thinking. Something like this could have maybe been written for the stage where awkward acting is a little less noticeable. The movie is...not good. Terrible even. I have incredible respect for him as an artist but honestly I hope this is his last film."}, {"rating": "0", "text": "I created this account specifically to write this review to warn off anyone on the fence about this movie. I don't say this lightly, but it was probably the worst movie I've ever seen in my life. There just wasn't a story. It was literally all filler-- and not even good filler. It is 90%+ flat, lazy dialogue, plot points, and appeals to long worn out tropes. I'm not sure why Eastwood and co. decided to include the actual men as the actors, but it did not pay off. I seriously just can't believe that this movie made it past any of the stages of production without someone calling it off."}, {"rating": "8", "text": "Creo que la mayoria de la gente no entendió el mensaje de la película. Leo por muchos lugares la palabra \"propaganda\". No es así. Es una muy buena película (no de las mejores del Sr Eastwood), pero es entretenida, y con un gran mensaje."}, {"rating": "2", "text": "The movie 15:17 to Paris was slow, with many irrelevant scenes. The theme of the movie was nonexistent. Although it was based on an amazing true story, they tried to stretch it out drastically by adding in scenes that had no importance."}, {"rating": "10", "text": "I had read that the main characters were the actual guys and not actors and the much of the film showed them growing up. Not once was I bored, not once did their acting take me out of the story. How this film received such low scores from professional critics is beyond me (unless they, like obama, want to brush this story under the rug). I shouldn't have doubted Clint Eastwood. This was an excellent movie. Moved me to tears as the main event unrolled. Inspired me to be the best man I can be, not knowing what I'll need to face in the future. Thank you Mr. Eastwood for honoring these men, especially since obama refused to. THANK YOU to the three men that acted bravely and sacrificially!! You are now heros of mine."}, {"rating": "10", "text": "There's only one reason that this film is receiving so much negative criticism; it deals with reality. Christianity, terrorists, the military, the chaos of this world; all of this plays a very important part in this film. Of course, this is not the world that critics would want their audiences to think about since film is about creating an artificial escape that perfectly resembles liberal/atheist ideologies. With this film, the choice to keep it real and deal with the reality that our mainstream media does not want us to know is what makes this film so controversial. But it is nonetheless a film truly worth watching."}, {"rating": "8", "text": "\"The 15:17 to Paris\" honours its real-life story with a touching and surprisingly terrifically-acted character-driven story that displays the braveness of its three heroes while also working as an entertaining tour of Europe."}, {"rating": "3", "text": "With the insane amount of unnecessary backstories, Eastwood misses the mark in promoting a proper propaganda."}, {"rating": "6", "text": "Respect for casting the actual people involved in the incident, but stretching out a whole film for a payoff that lasts a couple of minutes didn't really work for me. The medal ceremony at the end reminded me of Star Wars. When I found out Clint Eastwood had directed it I instantly saw many similarities to some of his other work, particularly American Sniper."}, {"rating": "6", "text": "Has a lot of unnecessary back story but essentially succeeds in conveying the casual heroism of its protagonists."}, {"rating": "6", "text": "This movie struggled to find filler content. It was ok but probably was a tad to short for a movie. I gave it a 6 and thats being liberal. If you are waiting to rent it rather than spend 7 to 10 dollars at a theatre..then YOU..are smart!!"}, {"rating": "2", "text": "Imagine if Unforgiven was just a movie about the Eastwood character riding his horse to the one and only shootout scene and the end of the film. Nothing exciting but talking and telling stories while on horseback for 3/4 of the film. I can now echo the call for this film's need of Hollywood phoniness. Now I not only understand but truly celebrate those disclaimers of \"some events may have been dramatized for entertainment purposes\"."}, {"rating": "1", "text": "C'est vraiment très étonnant... après le très réussi Sully qui a rendu hommage avec intelligence et émotion au fameux pilote héroïque, on pouvait s'attendre à ce que Clint Eastwood fasse de même avec les héros du Thalys : des Américains eux aussi et des soldats de carrière qui plus est ! Peut-être n'y avait-il pas assez de \"matière\" pour en faire un fim entier cela dit... Toujours est-il que Papy Clint s'est viandé et s'est étalé de tout son long... On dit qu'en France, on est pas mal, voir souvent \"anti-américain\", bien que ce ne soit pas une généralité (attention, pas d'amalgame) mais il est vrai qu'on est volontiers assez critique à leur égard.Mais le film de Papy Clint est un brûlot anti-français de bout en bout... ou presque ! il nous prend vraiment pour des cons. C'est vrai qu'on est le pays des terroristes depuis quelques années : on les élève, on les nourrit, on les accueille. Mais on les met quand même en taule s'ils ont tué des gens, si, si... Au moins pour quelques mois, voire quelques années. Malgré Dupont-Moretti. Mais faire croire, laisser entendre que la France n'attire pas les touristes étrangers, que les Amerloques qui viennent en Europe se demandent s'ils vont \"passer\" à Paris, dire carrément que les Français sont mal polis à l'égard des touristes, ça c'est vraiment insupportable !! En tout cas, ces héros croient toujours que Hitler s'est suicidé parce que l'armée américaine arrivait... mais non, bande de cons, c'étaient les Russes, les Soviets, les Rouges !!Quoi qu'il en soit, ils sont des héros mais certainement pas des acteurs, heureusement pour eux. Et le scénario incroyablement faiblard ne fait que nous raconter la petite vie de ces 3 potes qui bossent pour la patrie, qui sont à la fois des machines à tuer et des bigots premier choix. Fils de mères divorcées. Qu'est-ce qu'on en a à foutre... sérieux.Je retiendrai en fait deux moments du film, plutôt intéressants ou moins nuls à chier que tout le reste : la visite à Rome puis Venise et... l'allocution de notre Président Flanby devant son pupitre-hommage. Allocution réelle qui ne doit absolument rien à ce film de merde soit dit en passant. On dira ce qu'on veut mais les hommages de Flanby, c'était toujours émouvant.Plus émouvant que cette retape pour la fierté nationale yankee, la gloire des armes, de l'armée, de la gonflette et de la bigoterie dévote. Or, Le \"bon dieu\" n'a rien à voir là-dedans, vous avez eu de la chance, car si les faits relatés sont exacts, la kalash s'est enrayée mes chers héros. Mais merci quand même."}, {"rating": "7", "text": "Clint Eastwood's latest film marks the end of a trilogy about modern American heroes.This movie has some of the sappy army drama and hokiness of American Sniper, but also the very down to earth and inspiring elements of Sully.  I enjoyed all the films in this trilogy, and found this to be a solid 7.  It's a bit on the nose in the beginning, and there's a bit of fluff in the middle, but it gets the job done, and the great ending reaches the same heights as the plane landing in Sully."}, {"rating": "4", "text": "A tale of true heroism is unfortunately marred by an hour-long buildup of religio-patriotic hokum. I get that Eastwood wanted to show what led these men to take the action they took, but it feels more like flag-waving hero worship than realistic biopic. Some of the dialogue is hopelessly stilted, especially when the boys are young and talking with each other. Sorry, boys -- and kids in general -- just don't talk like that.That said, the confrontation in the train is truly dramatic, and Eastwood's direction shines here... except for Stone's thumb. I mean, we get it; his thumb got effed up. WE GET IT, Clint.The final scene was genuinely moving, and I found myself actually tearing up. The heroism of these men can't be denied, and the speech given by the French official should move anyone with a pulse."}, {"rating": "4", "text": "I understand that this could be considered a tribute, I applaud that but I think Eastwood's biggest mistake was to choose the real ones involved to interpret themselves.I mean, having done something heroic in real life doesn't mean that it works in a movie. Let's be honest.This is by far one of the most forgettable movies in Clint Eastwood's filmography, it's incredible that the man who delivered Unforgiven 26 years ago is now reduced to this."}, {"rating": "5", "text": "The only reason this film is scoring a 5 for me is just the basic concept and story behind it.  Regular people can do extraordinary things, and in this case, save a lot of lives.  But as for the film itself, it really didn't need to be a film.  The events on the train seemed like they took place over the course of like 5 minutes.  It did not need to be turned into a feature film.  The dialogue and acting were equivalent to basically a high school project.  I have the utmost respect for what those 3 guys did on that train, but this film was unbearable and cringey in dialogue, and they showed the fact that they have never acted before.  Maybe see it if you have a moviepass, otherwise don't waste your money"}, {"rating": "6", "text": "So I think I like the idea of this film but had some problems with execution.  The heroic acts that the movie is based on is an incredible act but is it enough to create a feature length film.  I liked how they used the actual people involved instead of actors."}, {"rating": "5", "text": "Buenas intenciones, pero una serie de factores como: las actuaciones, el libreto o las escenas innecesarias hacen que Tren a parís se convierte sólo en una cinta sin algo especial sino sólo un relato de heroísmo que carece de un sentido especial y se centra en ser emotivo."}, {"rating": "8", "text": "A very underrated film this is a film of 3 heroes who stopped a shooting on a train. They actually were the actors in this film very underrated its a must watch and it shows the events leading up the events of the bombing. It also shows their backstory and it was a great movie. The acting was very great. The movie honored out heroes well"}, {"rating": "3", "text": "I give it a 3 strictly because the real-life people portraying themselves in the film did a credible, if very high-school drama production quality, job.  The rest of the movie pretty much rates a 0.The events the movie is based on, while interesting and heroic, are barely enough material to fill up a 30-minute TV show let alone a 90-minute movie.  There is about 15 minutes of interesting movie here surrounded by 75 minutes of banal filler.  No offense to these young men--they are heroes and did a solid job acting.  There just wasn't ever really a movie here."}, {"rating": "0", "text": "I couldn't pinpoint what felt so awkward about this movie at first but i really think its a combination of the terrible acting, badly written dialogue, and most of the story being completely pointless which ultimately makes it unwatchable. I sat through the whole thing because i saw it was based on true events but the entire time i was waiting for it to get exciting but nothing happened until the last 15 minutes of the movie. Even during the action at the end, i still felt like it was a film students first ever project. I 100% don't recommend this"}], "recommendations": ["argo", "13_hours_the_secret_soldiers_of_benghazi", "valkyrie", "the_kingdom", "zero_dark_thirty", "red_tails", "unbroken", "hereafter", "the_american", "12_strong", "pearl_harbor", "all_eyez_on_me", "blackhat", "jarhead", "the_monuments_men", "midway", "american_gangster", "alexander", "sicario_day_of_the_soldado", "public_enemies", "dunkirk", "chaos_walking", "samson", "tinker_tailor_soldier_spy", "the_last_duel"]}