{
  "id": 1335,
  "title": "The Bourne Legacy",
  "starring": [
    "Jeremy Renner",
    "Rachel Weisz"
  ],
  "runtime": 135,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "New CIA operative Aaron Cross experiences life-or-death stakes that have been triggered by the previous actions of Jason Bourne.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ucqtAussxYNRw4lGvRaSbRJLskV.jpg",
  "categories": {
    "plot": 4.753846153846154,
    "acting": 5.033333333333333,
    "ending": 5.722222222222222,
    "soundtrack": 0.0,
    "cinematography": 3.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.413043478260869
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Wow, I thought the reviews were misleading, especially given how Bourne has to compete with Batman, and that Retner's previous film, Mission Impossible, was IMHO underwhelmingly reviewed at this site. But this time they got it right.\r Both Bourne and TDKR are films generally for fans of the series only. Anyone not privy to The Bourne Ultimatum is going to get a bit lost in Legacy. Luckily the film does a bit of hand-holding. But the first few minutes can be confusing, and in general the film suffers from somewhat mediocre storytelling.\r Retner does a good impression of a Bourne-esque hero, which tries to be this offshoot of Treadstone, but ultimately the whole film was trying to achieve the Bourne trilogy in 2 hours. And unlike Batman, which tried to approach the story via a new method of exposition, this film suffers from recycling plot points, general characters, and even action sequences from the previous movies. Its as if it tries to be a homage, but ultimately it is made to look like it can't survive on its own without hearkening back to Matt Damon's time.\r Characters are not very memorable apart from Cross. Like I said, the characters look recycled, and unoriginal. Fans of the series can only recall these people from previous movies, like its a homage.\r The story, despite the exposition, does expand upon Ultimatum. Ultimately, Legacy does show the fallout of Ultimatum, both during the film (but parallel using Cross POV), and  shortly after the film. It does feel like a sequel is in the horizon, and it does feel like Jason Bourne's saga is not going to end in New York.\r Overall it is not a very bad movie, but only to fans of the series. Again the whole setup feels like a throwback to the Damon era, whilst trying to establish a mythos on its own. Unfortunately Cross would at best come out as a Bourne without the amnesia or struggle with his emotions, and his life's story would not be any different (some say even ripping off) from Bourne."
    },
    {
      "rating": "7",
      "text": "Here they try to flesh out the backstory of 'the program' and the agents a bit more, but it's all very thin and it doesn't matter much in a film which like most Bourne films is mostly action orientated. Where the previous Bourne films mimiced James Bond by being very international in their locations, this one plays out mostly in the US. It's not to say it's bad, the cast is A-level with Renner, Norton and Weisz who make the film allot more enjoyable than B-actors would have made it, but it's certainly not the best in the Bourne series."
    },
    {
      "rating": "2",
      "text": "If you make a Bourne movie without everything that makes a Bourne movie awesome you get The Bourne Legacy. While I watched it, I perfectly understood why Matt Damon and Paul Greengrass didn't want to get involved in this piece of junk. While in the original films you get exciting action sequences that kept your attention and very good editing, The Bourne Legacy has tons of dialogues that go nowhere and a terribly awkward pacing. Not to mention it's 30 minutes too long. As a matter of fact, there's barely any action. The few there is would be ok if it was a Jason Statham movie, but for Bourne standards is cheesy and absurd. The only good thing about The Bourne Legacy is the solid acting from Jeremy Renner and Rachel Weisz, who make a very sexy couple and are both very likeable. Yes, the talented Edward Norton is in the movie, but unfortunately for him, he can't do much of a thing with a very poorly developed character that only has the function of throwing exposition at computer screens. I'd be surprised if anyone cared for the pills conflict which wasn't any intresting. Tony Gilroy should stick to writing, because he isn't a good director. He should be ashamed of making such a terrible film for a great franchise he helped to build. Specially in the ending, which was a cheap way to leave everything open for a sequel unlike The Bourne Ultimatum, which tied everything in its place. The only thing this movie has of Bourne is the title and it's not worthy of it. The Bourne Legacy is the perfect example of Hollywood beating a dead horse."
    },
    {
      "rating": "3",
      "text": "Its unfortunate but I was expecting great things for this movie. I am a huge Bourne fan, having read the Ludlum novels and watched the Bourne trilogy at least 5 fives already. Seeing the average reviews for The Bourne Legacy I was determined that this could not suck. It could not. Oh how wrong I was.\r Having got this movie on Blu-Ray just recently, I was pumping for this film. First ten minutes in, I had a horrible feeling. This feels...wrong. Half an hour in, I was like, hey it seems to be picking up. Now, I am not asking for a lot of action. To be honest, I want a movie to be balance of action and dialogue.  A lot of the diehard fanboys of this movie (A few in the metacritic reviews) attack those of us who gave his movie mediocre scores as they accuse us of giving it a bad score due to the fact that 'there's not much/not as much action scenes as the previous Bourne films'. To that I say, bullsht. In fact, the action scenes in this movie are alright and the lack of them isn't key in bringing down the score. What does bring it down is a combination of several elements. Firstly, the plot. The plot has to be one of the worst action film plot Ive seen in recent years. And the bad thing is, they're serious here. Unlike the Expendables 1 and 2 where they know its bad so they dont take the plot seriously, Legacy takes it all way too seriously. The movie is full of rudimentary segments and parts that felt way too long. It felt almost like as if the writer wrote a epic plot with visits to several exotic locations, plot twists and sequences. Instead, in filming, they discovered that the script was too long and it was too late to shorten it down. So they just did what they did. About what can be done in 30~50minutes stretched out into 2 hours. Nice work guys. It almost felt like a chore watching this movie after 40 minutes because it just felt so slow and plot progression movie like a slug up a ramp. Unlike the previous Bourne films which mixed a variety of sequences (chases, gun scenes, escapes etc) with excellent plot dialogue segments, Legacy just fills about 85% of the movie with slow dialogue segments that do little to move the story forward and throws in 2 fight scenes, each only around 2 minutes long and single chase scene at the end. That's it. And the asset send to hunt down our protagonists? He's apparently superior to the assets seen the previous Bourne films as he's in a newer, superior program. But heck, in the movie...he's not that good. Especially when going against Renner, who is in an inferior program to Bourne.\rAnd why the Philippines? That's right folks, half the movie takes place in Manila. I have nothing against the Philippines and have been there before. Its a great country...just with a lot of uninteresting places and lots of slums. Its not really the ideal locale for a top-notch action film. Had this been set in say, Japan, Korea or China or hell, have it back in Europe like the previous Bourne films, it would've been a lot more appealing. Its like saying, \"hey, lets set Lord of the Rings in a swamp and have it there for half the movie!\". Or \"Hey, lets have The Dark Knight set in Antarctica! That's exotic right?\" And I felt sorry for Jeremy Renner. This guy has done a great job in this film and its sad to see the rest of the movie being utter dung. Now Rachel Weiz...yea she's a hot milf. Since The Mummy Returns, Ive always had something for her. She's hot. But her acting? Its alright, not too bad, but there are some scenes where you would just wonder...is this an industry veteran or some new girl on the block. But yea, at least she's a much-needed eyecandy for this horrible film. Bourne Legacy doesn't receive a 3/10 purely due to a lack of good action scenes. In fact, its action scenes are okay and while there is a lack of them, its not the critical factor. The crucial aspect that nails this film in its coffin is the combination of a boring/shallow plot, boring characters (and a complete lack of chemistry, good or bad, between the Weiz and Renner to the point where it feels like they hate each others guts in real life and wanted to avoid doing anything/speaking with one another), a lame premise, bad locale choice and basically, having next to no relations with the Bourne Trilogy. Its like Prometheus to Alien...sure there's the hints and links here and there, but its not the same thing. This is The Bourne Legacy. While I can see Prometheus fit within the Alien universe, Legacy doesn't really feel like its part of the Bourne universe. Sure, it has Jason Bourne it in...on TV, but overall, if you remove the 'Bourne' title in this movie, it really would not making a difference. So shallow, uninspiring and boring, this film dampened the Bourne namesake so bad that I had to rewatch the Bourne Trilogy again just to make myself feel better. A horrible, Grade-B spinoff of the Bourne franchise with no class nor brains."
    },
    {
      "rating": "2",
      "text": "A promising new lead and decent anticipation turns to a considerable let down. The latest Bourne film is Boring. Jeremy Renner is a quality actor, who this time plays a rougher, more aggressive, more believable bad ass member of Secret Government Operation: Treadstone. The main issue with the film is that it doesn't deliver the action, the villain or build into anything interesting. The final act in Manila features one of the weakest car chase sequences of all time.  The film is more missing Paul Greengrass than Matt Damon. The action and tension isn't there."
    },
    {
      "rating": "6",
      "text": "The Bourne Legacy does two things wonderfully. One; it fills the shoes of the killing machine Jason Bourne with Jeremy Renner"
    },
    {
      "rating": "8",
      "text": "Jeremy Renner takes the place of Matt Damon as a CIA superagent , who's life is threatened by his own boss. The plot unravels slowly and is confusing for a while. However, multiple unexplained events and sharp filmmaking maintain interest. Other than some quick fights, almost all of the action takes place in one final burst. Following the style of the previous Bourne's, there's flashy editing and blurry camerawork, which makes it hard to tell what's happening"
    },
    {
      "rating": "4",
      "text": "An unworthy, unwelcome, and unnecessary addition to what is the greatest trio of spy movies ever made. The movie was only saved due to Jeremy Renner's solid performance as the lead actor, however his character was done injustice due to poor writing. This movie lacks all things Bourne: the intensity, suspense, action, compelling villains. Identity, Supremacy and Ultimatum were actually about a government conspiracy about elite Assassins. Legacy is about a science project creating Terminators, there's a difference. Jason Bourne was badass and all, but in the end we could all relate to him. We could all connect to his situation whether he was shot, fighting, being chased all around the city, we could relate to him. Aaron Cross was poorly developed, but like I said I wouldn't blame Renner, it's the poor writing. The trilogy was all about Bourne being hunted by Treadstone and later Blackbriar, his main objective: find out who wants him dead. Cross is in the same situation only with a different objective which translates to \"I need some meds!!\", no connection to the story there. Likewise for the villains, they didn't give a rats ass about Aaron Cross, and where the Matt Damon movies features non-stop amazing action, here we have a bunch of guys doing chit chat. Not only does it fail there, there are other Bourne moments absent: Where's the agent vs agent fight? Where's Cross making a call to the people after him? Where's the confrontation with the man who wants him dead? Yes this movie is a disappointment, and not worthy of the Bourne title. Yet to me Bourne remains a trilogy. Ultimatum wrapped up the story with near perfection, I never really saw the need to continue the story at all, my expectations were never really high in the first place so from what I can conclude this movie failed to prove me wrong and it actually didn't even manage to live up to my moderate expectations. This movie gets a 4/10 only because of Jeremy Renner's acting, the man gave it his best. Honourable mention to Rachel Weisz and Edward Norton who also put up solid performances but like Renner they were victim to the terrible writing this movie had."
    },
    {
      "rating": "5",
      "text": "I wasn't exactly looking foward to this film, mainly due to the 5 years since the last one, and while I love Renner, he's no Matt Damon. After it received poor reviews, I was diswayed even more. But I saw it, and its exactly what I thought it would be. It featured two greatly entertaining shootouts and some cool CIA stuff, but a lot, A LOT of talking and a run time that overstays its welcome. Hopefully this is a bridge to a 5th film with both Renner and Damon, which will be a resurrection of the franchise."
    },
    {
      "rating": "8",
      "text": "The Bourne Legacy. There have been many questions surrounding the Bourne Legacy. One is, how will Jeremy Renner fill Matt Damon's shoes? And another one is, how will this follow on from the Bourne Trilogy. Personally, I believe that Jeremy Renner has done the fans justice, it was however the poor script letting him down. Aaron Cross, who is played by Jeremy Renner is hardly like Jason Bourne. He knows who he is, but never really questions why the 'CIA' are after him. That is clearly not Renner's fault. The script doesn't really make sense, as it feels as if the writers are trying to milk another film out of the famous trilogy. The beginning kicks straight into the action, as Renner's seen on the mountain tops, but the story doesn't really get any more interesting than that, apart from the Car chase (I'll get onto that later). The story line introduces a new twist, which we didn't know about before, which is the 'blue and greens'. I think this is quite a good addition, as many people felt like they didn't know why Treadstone or Blackbriar made these assassins think and act like this. Awesomness is on another level when Rachel Weisz is added to the story. I think her character is thought of really well, and is like Marie in the Trilogy but better. She gets involved with Cross more than Marie did with Bourne, which in a way is a brilliant thing. Her character, as a scientist, is intriguing as she makes the assassins who they are through gene changing. The car chase. Wow. Unlike the chases in the Bourne Trilogy, the chase is faster, and more nerve racking as they are more naive with how they deal with it. However, I feel like the assassin who was sent after Cross wasn't as compelling as the other assassins. Overall, I thoroughly enjoyed the film. I hope in the future we could see a Damon/Renner team up, which would be utterly amazing. I gave this film an 8 as I thought some improvements could be made with the script and the story line, but I would really recommend going to see it!"
    },
    {
      "rating": "4",
      "text": "This film is just simply boring. It takes an hour just for Bourne to start kicking somebodies ass. What do we get for the first hour? A storyline about some scientists, treadstone, and Jason travelling in some mountain for ages... The action is weak and just doesn't have the thrill like the first two films did. (I haven't seen the third one yet)"
    },
    {
      "rating": "5",
      "text": "I really enjoyed the first two-thirds of this movie. It was filled with intrigue, complexity and character development. They also did a masterful job of weaving the timeline into the end of the previous movie in the series. But like so many of these spy thrillers, it degenerated into one long chase scene at the end. And when the movie ended, I was thinking, \"That's it?\"\r Clearly, they're setting it up to continue the series, but the ending was a real letdown. After building such great tension between all the characters, we're left with zero resolution."
    },
    {
      "rating": "0",
      "text": "If you are a HUGE Bourne fan like myself this movie will probably not be for you. This is Jason Bourne without Jason Bourne. The movie was disappointing to say the least. I must admit there was one good part and thats the part where I dosed off for 5min and nearly got a heart attack when my wife woke me"
    },
    {
      "rating": "8",
      "text": "The reason nobody liked this film is because there was much less action and much more dialogue than the previous three. But what they don't realize is that this new twist on Bourne is just getting started, and if the entire film had been judo and shoot-outs, what could we expect from the sequels? Legacy sets the foundation for what looks to be like an excellent parallel on Jason Bourne's story."
    },
    {
      "rating": "6",
      "text": "I loved the first 3 Bourne movies and I love Matt Damon. I was hoping for a cameo in this movie but no dice. Regardless, Jeremy Renner does a fantastic job, and overall this was an enjoyable movie. A couple of criticisms:\r1) The movie is too long. Specifically the car/motorcycle chase at the end should have been about half as long as it was. It got pretty boring.\r2) (Related to #1) Cross should have fought LARX #3, instead of just having an overly long motorcycle chase.\r3) Overall there seemed to be a lack of good fight scenes us Bourne fans have come to expect from the first three movies. The few that are in the movie are good (especially the scene vs. the 4 CIA agents), but the rest are quite short, and Cross never fights anyone that seems to give him a real challenge. Again, he should have fought LARX #3. In fact, the movie builds up this inevitable confrontation between Cross and LARX #3, only to have the movie end shortly after their boring and too-long motorcycle chase, never having them engage in hand-to-hand combat.\r4) I tend to dislike abrupt and open endings, and I understand they were setting it up for the next sequel, but it just felt like a weird place to end it.\r Overall a good and enjoyable movie. Renner is great, and Weisz does a good job too. Ed Norton is fantastic as the not-quite-villain but definitely-not-good-guy-either antagonist. He makes some tough moral choices and they have definitely set it up for a confrontation between Cross and Norton's Byer in the next sequel. Hopefully we'll get to see both Damon and Renner in the next one."
    },
    {
      "rating": "5",
      "text": "Here is what I think happened... There was a man. They were chasing him. Then in the end.. he got away. Story was overly complicated. Actors were great. Action was exciting but could of used a little more."
    },
    {
      "rating": "8",
      "text": "Its Bourne without Bourne, but still a decent movie. And I'm very interested to see the next part when \"hopefully\" we will have Jason Bourne and this new character meeting, etc...  Its a good solid flick that is slow to start, but all of them for the most part was like this."
    },
    {
      "rating": "0",
      "text": "One of the worst films I have ever seen. As a huge Bourne fan (even loved the game), I can't believe how much they've managed to ruin one of the greatest movie franchises. First of all, it starts of extremely slowly, with no explanation. It jumps from one scene to another for about 45 minutes but doesn't link them together. The backstory doesn't exist at all, and there is no connection to Treadstone or Bourne AT ALL. What's more, the new characters and their motives and the entire story is not only dull, shallow and without any explanation, but even the action scenes are laughably pathetic. Far too much Hollywood cliché rubbish. At the end I had no idea what the film was about and still didn't get how anything linked together. Honestly, there is no reason why anybody should watch this film."
    },
    {
      "rating": "4",
      "text": "A promising new actor (Jeremy Remer) takes over as Arron Cross for Matt Damon's Jason Bourne character in the latest Bourne film but even with the talented and beautiful rachel Weisz in support they are not enough to save this turkey from thanksgiving day dinner. The opening chapter in Alaska with the drone attack shows promise of building suspense and action but everything ultimatley crashes due to a poor plot and a lousy closing chase scene. In a spy file, if the plot is  improbable, you are in big trouble (unless its a Bond film-then no one apparently cares). Writer/director Tony Gilroy who wrote the scripts for the first three Bourne films, and takes over as director has lost the magic. The Bourne Legacy attempts to connect the dots from The Bourne Ultimatum before heading into new territory but instead the US government (again) tries to wipe out not only all the agents but even all the scientists behind the \"new \" program. Why? who knows? We know in reality our goverment wont care, but this leads to alot of silly murders to unsuccessfully build suspense.  Because all suspense and credibility is lost, all the old Jason Bourne characters who are in this film (Ed Norton; albert Finney; davis strathern; joan allen etc) appear like retreaded tires.By the end, everything about the file seems like an old worn out tire."
    },
    {
      "rating": "9",
      "text": "The ending is trash, the rest is badass. The change of lead actors from Matt Damon and Jeremy Renner is surprising but you will definitely enjoy this movie, especially if you're a fan of the franchise. Aaron Cross is a solidly-built character and Renner's portrayal gives enough rope to hang either the doubters or himself. Brace yourself for a summer action flick that will keep the adrenalines pumping."
    },
    {
      "rating": "3",
      "text": "Jason Bourne is one of the more intriguing film characters of the past decade.  He methodically and purposefully found out who he was, who was responsible for his condition, and attempted to bring everything back together again.  Even better, he was not a superhero; Jason was just a guy who went through a lot of training.  He is elite, but deep down he is still one of us.  Aaron Cross (Jeremy Renner), on the other hand, has been tweaked a little bit.  He pops pills to up his physical and mental skills.  Yes, he is still human too, but perhaps a bit genetically modified.  This splash of sci/fi does not help an audience tuned in to the adventures of Jason Bourne connect with the new guy.\r When I first heard there was another Bourne installment, this time without Matt Damon, I figured someone either wrote a good script to carry on a new story line, or the studio wanted to churn out a guaranteed cash cow under the title of a proven and successful action series.  Writer/director Tony Gilroy wrote the scripts for the first three Bourne films, but this is his first time behind the camera in the series.  He successfully directed Michael Clayton and the under-appreciated Duplicity, but now the magic is gone.  The Bourne Legacy is stale.  Enduring a painfully slow beginning, The Bourne Legacy reveals it is set at the same point in time as The Bourne Ultimatum.  In fact, if you have forgotten the plot points and supporting characters of the previous film, take the time to either watch it again or read about it online before heading into the new feature.  Jason Bourne's escapades have thrown multiple CIA operations out in the open and the shadowy powers are frantically trying to sweep them under the rug before either Congress or the press start asking questions.  Eric Byer (Edward Norton) orders the termination of Project Outcome, the new series of super agent represented by Aaron Cross.  Instead of telling the agents to pack up and go home, the CIA chooses to assassinate them instead.  Oh, and they try to wipe out all of the scientists who made them so super in the first place.\r Dr. Marta Shearing (Rachel Weisz) is one of those scientists seeking ways to alter chromosomes to make a more perfect human.  After surviving annihilation himself, Aaron conveniently scoops the good Dr. out of harms way which sets up an 'us against them' theme quite similar to the one you remember from The Bourne Identity.  Unfortunately, The Bourne Legacy noticeably lacks the quality script and thrilling action sequences of that first film.  The chase scenes in the new film are edited so atrociously, especially during motorcycle elements, that they are almost impossible to logically follow.  You know they are weaving in and out of traffic, there are near misses, and flying bullets; but there are only quick glimpses of that on the screen in the midst of the unsteady camera work and split-second jump cuts.\r The Bourne Identity also had a mystery to unravel and wandered around the world trying to find out who was behind the curtain.  There is no curtain now, Edward Norton is pulling the strings in plain sight using all of the means in the intelligence community he can lay his hands on.  There are armed Predator drones, devious mop-up CIA killing squads, and even a possible super-duper agent; imagine the Schwarzenegger Terminator battling the new T-1000.  Renner and Weisz do their best to remake a film which was already pretty great.  Yes, they have new names and faces, but they are running from the same agency, dodging the same bullets, but this time they have a higher chromosomal level on their side.  The Bourne Legacy will be known as that film which derailed the very respectable Bourne franchise. Paul Greengrass, the director of The Bourne Supremacy and The Bourne Ultimatum, was correct when he said any further film would feel like The Bourne Redundancy."
    },
    {
      "rating": "0",
      "text": "This movie simply has no art at all. No art in the action scenes, no art in dialogue, no art in acting. The plot sucks and makes me want to sleep, this movie doesn't teach you anything and the soundtracks are frustrating simply. I'm giving it a 0 out of 10 because for me it was a waste of time."
    },
    {
      "rating": "10",
      "text": "Here we see a real lack in the...well, all I can say is intelligence ...of many film critics. If you see the term confusing in a review...that is a red flag the critic was not paying attention, has poor listening or analytical skills or is just not too smart.\r The movie on the other hand is very smart, really fast, exciting and well done. Everything, every line and action makes sense within the integrated whole of the movie.\r If you like your movies intelligent, exciting fast we complex and sophicticated characters and writing see this move. Highly recommended."
    },
    {
      "rating": "10",
      "text": "The fight scenes in this film are FANTASTICALLY choreographed - Renner turns killing into a dance.  The ending leaves just enough open that we can realistically expect a sequel."
    },
    {
      "rating": "9",
      "text": "The Bourne Legacy, the new movie of the Bourne saga. Ok, what happen? We know the story about this movie, and after some producers decide do a remake, but this movie is really amazing."
    },
    {
      "rating": "3",
      "text": "This was a huge, essentially plotless disappointment: zero intrigue, zero character/relationship development, zero point, very little suspense, and empty dialogue. Renner and Weisz carried the entire thing, but outside of liking them I cared little or nothing for the \"characters\" or the \"story.\"\r What made Jason Bourne so intriguing was that he was completely lost and there were strangers trying to kill him - a double nightmare loaded with action, mystery, and suspense. And we cared about him because he was repenting and struggling with what he did while brain washed at Treadstone. Aaron Cross and Dr. Shearing however are two characters of little interest simply running for their lives from the government they were working for. Aaron Cross in fact, as per a scene with Ed Norton, could be considered a ready and willing villain! He's not trying to get his life back, or get out of the business, or clear his conscience, he's just a killer that wants to stay smart and not get killed. There's nothing to figure out and no ending to arrive at, and therefore nothing to follow, connect to, or really care about. This movie was total bore that simply rode on its loose association to the far superior Bourne Trilogy."
    },
    {
      "rating": "5",
      "text": "This film was such a disappointment. The first hour was spent explaining the program and the second hour was spent trying to kIl the agents in the new program. The film was not not suspenseful or exciting. I felt like they took the footage that did not make the last film and just added to it so they could have another movie. How many times do we have to see the finale where our hero is sailing away with the beautiful girl?  This film was just a cheap effort to make a quick buck."
    },
    {
      "rating": "3",
      "text": "Bourne Legacy was so disappointing. And we were really looking forward to seeing this.  All it was was a 2 hour set up for a sequel. Which they could have done in 30 minutes. Not the two hours and 15 minutes that this thing was drug out\rWe felt like we really wasted our money"
    },
    {
      "rating": "1",
      "text": "This movie was an utter disgrace to what is probably my all-time favorite movie franchise. While the first Bourne movies were smart and engrossing - this movie feels like it was written by 3rd graders. The script is awful, the plot doesn't progress, and the characters are completely 1-dimensional. Not only that, but the entire premise of the movie involves borderline sci-fi garbage that has no place in the Bourne series. Certain scenes like the series' trademark chase scene clip and are unrealistic looking - and I can point to one (unimportant) scene in particular where an agent drops 20 feet from a tree in a blur like superman.\r Some people may have not liked Jeremy Renner - but as most reviews indicate - he was certainly not the problem. No plot, no script, and boring. I'm going to go on pretending that this movie doesn't exist, and hope they do the next Bourne movie the right way - with a plot and a script. Disgraceful."
    },
    {
      "rating": "1",
      "text": "This is the first movie that i've actually FELL ASLEEP watching in the cinema. It was utterly awful. The only saving grace was the performance of Jeremy Renner, who was incredibly good in the role."
    },
    {
      "rating": "7",
      "text": "More aptly named \"The Bourne Without Bourne\", it's quite surprisingly that Legacy manages to use the franchise's formula to good use. It does suffer slight reduction to the pace, which was initially blinding fast, into a more exposition-filled story. The writers keep the plot from derailing off the original three and using a parallel story of another burned agent in a grander scheme affected by the previous events. Acting by Jeremy Renner and Rachel Weisz are superb and action is definitely there to meet blockbuster demand, it only lacks the fast cut of its predecessor and the titular hero.\r Jeremy Renner is a definite great choice for Aaron Cross, the new marked agent. He looks lively compared to the others rigid agents, it humanizes him and makes him more natural without compromising the resourcefulness of the character. The franchise always uses an agent in distress style and it stays true with Aaron's story, although he leans more on frantic attempt for self-preservation rather cold calculating and vengeful motive. Even though the story deems him a bit flawed, that actually makes him more sympathetic to the audience.\r Rachel Weisz as Dr. Shering delivers a spledid performance. She is convincing on her struggle as if she's doing a ballet piece on the verge of mental breakdown. She appears as strong as an ordinary person would be, but in the same time frail in the face of trained killers. The story gives much time to her, understandably so. This might hampers the pace a bit, but considering her quality acting, it's a safe investment. Her role's attitude switches from methodically calculating for the sake of survival to slowly growing affectionate towards her savior.\r Action is good, true to grimy Bourne stunt, it has plenty of chases and fights, mostly on densely populated area. I like the fact they use real stunt rather than CG, because it gives more organic motion and danger to it, especially the scenes in South East Asia. The editing is still lightning fast, but a bit slower and more concentrated this time around. The main concern is it has lesser content than the previous Bourne titles. With each of them packing a hefty amount of plot and action, Bourne Legacy feels only half of those. It doesn't give satisfying end, as I expect there might be more sequel(s) to it.\r Regardless of not reaching the height of previous endeavors, which is ironic since the main allure somewhat lies in the title, Bourne Legacy is still an enjoyable espionage thriller.\r Rate 7/10"
    },
    {
      "rating": "8",
      "text": "This was a really good movie. It hit all the right notes with a good spy story, believable characters, and awesome action. Aaron Cross is definitely not as unstoppable as Jason Bourne, which in my opinion made him seem really weak. Two things I wasn't too fond of: 1. I felt part of the plot with the virus and chromosome was difficult to follow at times. 2. The movie ended pretty abruptly and was very anti-climatic. HOWEVER despite the couple negatives the movie was a fantastic ride that kept me very engaged. Highly recommend."
    },
    {
      "rating": "5",
      "text": "I have to admit that the low mark is mostly due to the fact that I didn't watch the 2nd and 3rd installment of Bourne series. This meant that I could not understand roughly 30% of the discussions between the government characters. Otherwise, a solid action movie for Sunday afternoon."
    },
    {
      "rating": "3",
      "text": "I have not seen any of the other Bourne films so this is my first film a have seen out of the Bourne films, and what a let down. Very boring and I didn't really get it the films story. The Bourne Legacy 3.8/10"
    },
    {
      "rating": "4",
      "text": "How do you review a movie that was so boring you fought to stay awake, who's characters were poorly written and unable to engage you in any interesting way. A spy movie that either has the thinnest plot ever or none at all depending on your perspective. Who tried to copy all the cool things about it's predecessors and put them all in one cool action film, but instead somehow made all those things much less intriguing. A movie who's only redeemable quality is that it has pretty good acting, and looks good. I guess that's how."
    },
    {
      "rating": "4",
      "text": "As others have said, this film is overly complicated.  If you don't remember everything that happened in the first three movies, you will have no clue what's going on.  Even if you, like me, remember just about everything from the first three movies, you'll be sadly disappointed.  This film does nothing to further the Bourne story except to say that they introduce a new agent.  Overall, the story is pretty boring and pointless.  I had a free ticket to see it, otherwise, I would be regretting my ticket purchase.  Save your money and see something else."
    },
    {
      "rating": "5",
      "text": "Not a close follower of this Bourne series, but caught this on a flight and was not impressed. Seemed as though there was not a lot of action and alot of unnessessary dialog. Hard to picture/watch the film without Damon (although not a fan of him either) in it. Glad I didn't pay $ to watch this in the theater or on DVD."
    },
    {
      "rating": "9",
      "text": "A worthy addition to the Bourne franchise. The action is non-stop and frequently breath taking. Great script. Great acting. Great editing. Great movie. My only problem was all the references to Damon. He isn't in the movie so why all the talk about his character."
    },
    {
      "rating": "5",
      "text": "The Bourne Legacy has moments where it's electrifying, pulse-pounding, and everything else it's supposed to be. The problem is those moments don't add up to anything worth your while."
    },
    {
      "rating": "7",
      "text": "The Bourne Legacy doesn't have Jason Bourne in it. But Jeremy Renner gives us an excellent performance and the end scene rocks."
    },
    {
      "rating": "6",
      "text": "The Bourne Legacy picks up in the aftermath of the CIA's failed attempt to take down Jason Bourne in 2007's The Bourne Ultimatum.  With Bourne on the run and the agency facing the threat of having their entire operation exposed, a new unit headed up by Edward Norton's no nonsense agent begins covering their tracks.  Jeremy Renner has the lead role of agent Aaron Cross who must outwit the forces working to take him down.  It's pretty standard stuff, especially when compared to the last two Bourne films, but it's well made and delivers plenty of action.  Still, it's hard not to miss the enthralling direction of Paul Greengrass who helped elevate the series to where it is today."
    },
    {
      "rating": "8",
      "text": "The directing, acting, and intrigue are great. The problem is there is no climax, it feels more like a first act to a trilogy coming. In the other Bournes, Jason Bourne always took down the person that set the story in action at the end, here Edward Norton and Renner never meet. We may look back after the next two Bournes with Renner and appreciate it, but now it does feel very anti-climactic... but still better than any superhero movie."
    },
    {
      "rating": "7",
      "text": "I enjoyed this movie, although I wish it had something new to offer.  It was very similar to the first movie, Bourne Identity, in several ways, almost as if they took that script, changed just a few things, and recast it.  Ok, it's definitely not exactly the same, but it was very reminiscent.  Also, as a huge fan of Matt Damon, it was sad to watch it with them referring to Jason Bourne a million times, and the character not actually being there.  That being said, I found it enjoyable (cameras every so slightly less shaky than previous movies...I know that has bothered a lot of people), and I'd say it's worth seeing in the theatre.  Also, I've always loved Rachel Weisz, so she added a lot to the movie in my books."
    },
    {
      "rating": "8",
      "text": "Smarter than the previous installments but a bit of a stretch to fit it into he scheme and story line which made it tough to follow at points. I'd have preferred a bow tied around the ending but it's clear they plan to continue to milk the franchise. The \"superhuman\" action sequences were believable enough to keep me from being distracted by them. The \" ...science... \"  (loosely in quotes) was weak at best. Overall my score of 8 reflects my general good time had."
    },
    {
      "rating": "5",
      "text": "The Bourne Legacy tries really hard. Jeremy Renner is a likable hero, Rachel Weisz is unbelievably hot and the movie contains the requisite action scenes and foreign locations to make it work. Yet it doesn't. Something is missing in this installment. It could be linked to the fact that the movie takes FOREVER to get going and by the time it does, you've already slipped into tedium."
    },
    {
      "rating": "7",
      "text": "I can say that as a fan of the original trilogy I both liked it and had issues. It has the same time line and lots of the same characters and the same style, which is all good. The main problem is that while Jeremy Renner is good he is just never going to be Matt Damon. Also he has no memory loss, which was what gave Jason Bourne and the original trilogy an emotional hook. You have to wait but there is a great chase/bike scene. For fans only I'd say."
    },
    {
      "rating": "7",
      "text": "I don't mind give it high rating for this movie. I didn't watch the prequel before, for a stand alone movie, Bourne Legacy wins. Breathtaking and intense action, ambush and chase scene. And Tony Gilroy's script is gold."
    },
    {
      "rating": "5",
      "text": "The Bourne Legacy. Take away a lead character with a sense of mystery about him with a guy you pretty much have figured straight away, add to the mix with not very tense shady government office exchanges, with a side order of chase / fight sequences which are sub par to the previous three films, and there you have it. Honestly, thought it wasn't too bad until the end chase sequence with a guy jumping from one motorbike to another at high speed [ not very realistic ] to the ensuing crash being not very cgi, instead of the real thing which made previous offerings so refreshing, with a sense of realism. In all, a waste of Renner and Norton"
    },
    {
      "rating": "8",
      "text": "This was a great film. Was it perfect? No of course not, its extremely rare to find a perfect film. The Bourne Legacy is a fast paced and intelligent film. It does have its flaws with some wooden moments from Rachel Weiz and the upsetting fact that Edward Norton really doesn't do anything besides word off some facts about the field agents and whats going on. It was a bit overly lond as well. 145 minute running time is pretty steep for this type of movie. Jeremy Renner of course didn't disappoint as he never does. It didn't seem like their were very many action scenes but now that i look back at it, i think theres a good healthy amount, and in everyone Renner is just awesome. He's a great action star and a great actor period. The story was well written but it wasn't executed to the best it could've been i believe, but overall it was a great and entertaining film. As good as the original trilogy? No, its a tad bit off from the original Matt Damon featured trilogy but it was still a damn good film and its definitely worth the admission price. I'd go see it again and i will most certainly purchase the blu-ray in the future. 8/10"
    },
    {
      "rating": "7",
      "text": "Overall a decent action movie with a good cast. However it's that's really only where it excels, it's action. The story is interesting enough to keep you watching but with a pretty lacklustre ending, you won't be discussing this film for the story. You'll be talking about all the really well put together action scenes. Worth watching."
    }
  ]
}