{
  "id": 1095,
  "title": "The Aristocats",
  "starring": [
    "Phil Harris",
    "Eva Gabor"
  ],
  "runtime": 78,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Adventure"
  ],
  "description": "When Madame Adelaide Bonfamille leaves her fortune to Duchess and her children—Bonfamille’s beloved family of cats—the butler plots to steal the money and kidnaps the legatees, leaving them out on a country road. All seems lost until the wily Thomas O’Malley Cat and his jazz-playing alley cats come to the aristocats’ rescue.",
  "releaseYear": "1970",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7GVekZRvV25OzUQIw1Gn4sikkVo.jpg",
  "categories": {
    "plot": 9.333333333333334,
    "acting": 9.333333333333334,
    "ending": 10.0,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 10.0,
    "funny": 9.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Buena en animación, pero lo demás no me gustó, la historia es muy simplona y poco atractiva, los personajes gatunos tampoco ayudan mucho y es que ver a animales presumido de clase alta no es realmente lo mío."
    },
    {
      "rating": "9",
      "text": "The Aristocats is really quite charming, and is rated far too low on IMDb. The songs aren't as memorable as the ones in the Jungle Book, but they weren't bad at all, Everybody wants to be a Cat is a classic and the title song is brilliantly sung by Gigi's Maurice Chavelier. The animation is really lovely, the best sequence being the landscape of Paris in general. It looked beautiful. This is probably Disney's most relaxing animation I think, and as another reviewer quite rightly said, who doesn't love cats? Another great piece of animation was O' Malley looking into Duchess's eyes, as their romance was so believable while not obvious.(a good thing)The plot(about a greedy butler and a fortune, reminds me of Bailey's Billions) was a little unoriginal, but worked very well, and the script was really funny, especially the fights between the kittens. They remind me of me and my brother and 3 sisters, always fighting. My favourite scene was the chase of Edgar with the two dogs, who were always fighting about who was the leader. The voice talents were a delight, most notably Phil Harris, whom I recognised from the Jungle Book, and Eva Gabor, from the Rescuers. The supporting characters, namely Scat Cat, were also well done. In conclusion, a really pleasant film, that is definitely underrated. 8.5/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "My friends and I really like this film so I gotta say when I got older I found out that this is a forgettable disney classic so I watched one of the videos of people reviewing it like the Nostalgia Critic. The characters are forgettable which is crazy because I really like the characters like Thomas O' Marley who sounds like Baloo from The Jungle Book, the butler named Edger and so on. The chase scenes from 2 dogs and Edger are funny so I think Edger is funny."
    },
    {
      "rating": "8",
      "text": "UnderratedAristocats may be more moderate Disney, But it is still a lot of fun. Oh and Marie is friggin adorable!"
    },
    {
      "rating": "8",
      "text": "Great Disney movie about cats. It’s really sweet and interesting but like many old Disney films. It can be quite cheese"
    },
    {
      "rating": "10",
      "text": "When a very rich Parisian lady decides to leave all her assets to her cats, her jealous butler decides to make them disappear so he could have it all. Directed by Wolfgang Reitherman, it features a soundtrack composed by George Bruns.We are probably facing one of the most underrated films of Disney Studios. It has a simple script, based on an inheritance dispute between a butler and a family of cats. The voice actors are good and the work of designers is great. The use of softer tones, combined with a firm but discreet pencil, make it very elegant and charming. The film has some important moral messages: the union of the family, as well as help to those in peril, are values ​​visible in the way the cats help each other. On the other hand, the adverse consequences that the butler suffers show the children the punishment for his envy and greed. In the film, the \"dating\" between Duchess and O'Malley recalls the dating scenes made twenty years earlier for \"The Lady and the Tramp\".One of the most appreciated features of this film is the soundtrack, which contains a number of interesting musical moments, from the song of Siamese cats to the song that kittens sing at the piano. But the most striking piece is \"Everybody wants to be a cat.\" It comes near the climax and it's a very fun jazz, played by the stray cats."
    },
    {
      "rating": "5",
      "text": "RIP Walter Elis Disney this was his last movie he oversaw but it was reles years after his death whell animation back then took a long time but the movie  isnt good as it songs"
    },
    {
      "rating": "6",
      "text": "La música es buena, pero la trama es muy simple y poco memorable; la recomiendo a niños pequeños."
    }
  ],
  "recommendations": [
    "the_fox_and_the_hound",
    "the_many_adventures_of_winnie_the_pooh",
    "the_jungle_book",
    "aladdin",
    "tangled",
    "the_princess_and_the_frog",
    "winnie_the_pooh_blood_and_honey",
    "mary_poppins",
    "the_sword_in_the_stone",
    "the_little_mermaid",
    "the_nightmare_before_christmas",
    "sing",
    "vivo",
    "trolls",
    "moana",
    "cats",
    "pocahontas",
    "tarzan",
    "mary_poppins_returns",
    "the_lion_king",
    "anastasia",
    "grease",
    "rio",
    "the_hunchback_of_notre_dame",
    "brother_bear"
  ]
}