{
  "id": 3256,
  "title": "The Golden Compass",
  "starring": [
    "Nicole Kidman",
    "Daniel Craig"
  ],
  "runtime": 113,
  "genre": [
    "Adventure",
    "Fantasy"
  ],
  "description": "After overhearing a shocking secret, precocious orphan Lyra Belacqua trades her carefree existence roaming the halls of Jordan College for an otherworldly adventure in the far North, unaware that it's part of her destiny.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lyaS7S4emzEaYUcSnCvyqfJpOcA.jpg",
  "categories": {
    "plot": 6.027777777777778,
    "acting": 5.538461538461538,
    "ending": 5.117647058823529,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 2.6666666666666665,
    "action": 7.166666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I think the reason for low US gross is number one it stars a GIRL (Most male reviewers panned it and female reviewers loved it) and it requires you to think which is something of a lost art here (we keep electing crooks who are stealing us blind). I do not think the Christian Nazis are the problem as they do not go to Hollywood movies anyway. The only reason I went to see it was that the Pope said that I should not. Until then I thought that it was just another mind numbing fantasy for children like Lord (Bored) of the Ring. I fell asleep during the first LOFR movie and have not watched any of the sequels. GC was two hours long but only seemed like an hour. I have gone back and seem it twice more. Once to catch the details I missed the first time and again to analyze the story. I hope the sequels will not have to be dumbed down even more for the US audience just to get a higher box office."
    },
    {
      "rating": "7",
      "text": "A visually beautiful film, that unfortunately tried to do too much in too short a space of time. Obviously elements of the book had to be left out, otherwise the film would be too long, but the director failed to capture the suspense in the book. This left the brilliant actors very little to work with and develop their characters, despite many strong performances on their part. The ending was typical Hollywood, in that the sad ending in the book is completely missing. An enjoyable film, but could've have been great."
    },
    {
      "rating": "9",
      "text": "A wonderful film. Where did these low scores come from? Is the Bible Belt trying to suppress dissenting views?"
    },
    {
      "rating": "8",
      "text": "I thought was pretty good, it didn't follow the story very well, but it's a movie."
    },
    {
      "rating": "8",
      "text": "Unfortunately this film starts with a massive handicap: trying to live up to people's expectation. The book was brilliant, probably the best of the trilogy and very dark for a \"children's\" book. People expected the film to follow suit and follow Peter Jackson's Lord of the Rings with it's careful character development and deliberately slow pacing. People expected a dark fable with a 12a rating that asked as many questions as the book did about religion, life, death and everything in between. What we have is film which seems to have achieved the impossible, to actually be entertaining universally. As a parent these types of films are like goldust, I have fallen asleep through so many disney/dreamworks productions recently and been ripped off by their merchandise. My 5 yr old daughter loved it and I thought even without the appropriate amount of character development and rushed scenes it encapsulated enough of the book's magic to make it one of the finest fantasy films in recent years. Ignore the critics who are all in their mid-40s, single and voice a demographic rather than a universal opinion."
    },
    {
      "rating": "8",
      "text": "I loved the Golden Compass, it was action filled in every scene, I loved the Golden Compass."
    },
    {
      "rating": "8",
      "text": "This should have been a three hour movie. Deeper plot/character development and a real ending would have made this so much better."
    },
    {
      "rating": "9",
      "text": "A great adaption, if you look deep the original themes are still present and it does not fail to promote an open mind and retake a look at our own world in a different perspective. The ending seems aprubt but leaves with a very good hint on not only what is to come, but also what to look into and analyze deeper until the sequel is released. All in all I can only recommend it."
    },
    {
      "rating": "9",
      "text": "I really enjoyed this film, which was a fairly faithful adaptation of the book (except for the ending). Having read the books and enjoyed them, I found the movie built on my visualizations of Pullman's original creation. The armoured bears and witches were stunning, and I found Mrs Coulter and Lyra to be engaging characters in the film adaptation. I recall thinking after seeing the changed ending of Jackson's Fellowship of the Rings from the books and being shocked, but later after seeing the context of the 3 movies, I appreciated the deviation from the source material. Similarly, having the ideology of the book presented more subtly in the film probably kept it from feeling too \"preachy\". All in all, I hope to see a sequel. (Finally, how can people give this film a zero? Even if you found it lacking, it wasn't Daredevil or League of Extraordinary Gentlemen)."
    },
    {
      "rating": "6",
      "text": "I thought this was an average fantasy film based on a brilliant book. Too many wooden performances dragged the film down (which was mostly dependent on the special effects anyway). The ending was neither as suspenseful or as satisfying as I remember the book to be which only keeps me wondering how the sequel will be dealt with."
    },
    {
      "rating": "8",
      "text": "I suppose my view's a bit clouded on this one, as i'm such a fan of the books, but i'll tell you what i could see. The film tries to be faithful to the books, using many scenes verbatim and actually to the point where the speed of the plot and exposition is too fast. However, the characters are strong (although Lyra's not as urchin-y as Pullman's), and the film retains much of the charm of the book. I only complain of the parts Chris Weitz deviates from the story at the expense of realism or plot aesthetics. Specifically, three of the best chapters in the book are removed, for no good reason. The film is even rather short, post-climax-ectomy."
    },
    {
      "rating": "9",
      "text": "Beautifully shot and ornamented with some of the best CGI I've ever seen. I found the story line a little obscure and the church / soul metaphors a bit heavy-handed, but not objectionable. It was a delightful film that should entertain any from 12-80 yrs old. I think it has been very under-rated!"
    },
    {
      "rating": "10",
      "text": "If you didn't read the trilogy you would feel a litle lost, except that the movie is fabulous the effects the voices the cast everything..I can't wait for the second movie."
    },
    {
      "rating": "3",
      "text": "Very boring movie, but better than the book, which is the biggest crap, I've ever read."
    },
    {
      "rating": "2",
      "text": "Awful, I can't believe anyone would give this movie any credit at all. The story is obscure and while some people call the ridiculous plot intriguing, I call it boring and slow. I haven't felt this way about a movie since Larry the cable guy health inspector. I wouldn't even recommend this movie to rent. I felt as though I wasted 2 hours of my life that I can't ever get back."
    },
    {
      "rating": "5",
      "text": "The movie was entertaining and beautiful. The cast all did an excellent job. However, it's ironic how one of the film's themes is about soul severing, and then they went and took the soul out of the movie. The movie felt rushed and there was no character development. Also, the worst mistake the film made was that it cut out the ending. They practically gave it a happy ending instead of the suspenseful and emotional ending of the book. They neutered this film."
    },
    {
      "rating": "8",
      "text": "Prepare to enter another world of the fantasy genre as New Line Cinema (the producer of The Lord of the Rings Trilogy) presents Chris Wietz's \"The Golden Compass\". It revolves around Lyra Belaqua, a young girl living among scholars in Oxford's Jordan College. Her world may seem diverse, from physical embodiments of souls that take the shape of an animal, but similar with people around you to become friends and enemies. She is thrown into a perilous adventure when she overhears a conversation of an extraordinary microscopic particle, Dust. This particle is said to unite different worlds, and is feared by many who want to destroy it forever. As Lyra is flung into the middle of this horrible struggle, she meets wondrous creatures both big and small, and villains who are not what they seem. Gobblers, that kidnap children, will turn out in the most unexpected places. And a magical compass of gold that will answer any question if one is skilled enough to read it. Lyra's adventure continues throughout these three books, and the first is about to be told. The only problem that I had with this movie was the Anti-Christian overtones of the Magisterium during the film. I'm not with the Catholic Church, but I agree that the word \"Heresy\" was the only reason why the second and third movies would not be adapted into screen. That's it for my problem. The casting was great and the actors were very decent. Daniel Craig was solid as Lord Asriel despite the fact that he wasn't given enough screentime. Nicole Kidman was decent as Mrs. Coulter, but her hair is very different from the book counterpart as it describes her hair as blond. Ian Mckellen was amazing as the great armoured ice bear (also known as a Pansjorborne) Iorek Byrnison, and Dakota Blue Richards was very convincing and compelling as Lyra when it comes to actresses in movie adaptations and the rest of the actors turned out good. The sets were very creative, but at most times, they were quite dark due to the Svalbard place. The CGI on the animals are very damn impressive. The daemons (just like in the book despite the fact that it was mispronounced) were very visualized and the polar bears are also visualized. The action scenes were very epic and the direction from Chris Wietz was well-paced. The Golden Compass lacks in any depth, but it is a darker, deeper, and fantastic adaptation of Phillip Pullman's greatest fantasy series. 8/10"
    },
    {
      "rating": "10",
      "text": "Amazing! Roger Ebert and I agree for a change. If a film inspires people to go out and read the books (His Dark Materials) then it is has done its job. I am currently reading the books again because thanks to a group of silly devolved organizations based in the USA, the rest of the story will not be made into film despite the Golden Compass doubling its money at the box office. There is always going to be the book versus the film arguments \"oh, the film is not like the book.\" Perhaps people who say things like that should read a single chapter out loud and time themselves. When they figure out an average chapter will take around 10 - 15 minutes to read properly, then perhaps they will understand a scriptwriters job better. Yes, the film is not like the book, but it has taken the essence of the story and made the Golden Compass into something different from the usual film fare. I very much hope the cowardly filmmakers in Hollywood lift a suitable digit at the silly organizations attempting to censor what the masses can see and hear."
    },
    {
      "rating": "8",
      "text": "I really liked this movie. Visually, it was stunning. The effects were wonderful and I loved watching all the animals! The only problem I had was that, not having read the books, I didn't realize it ended kind of in the middle of the story, a la Lord of the Rings. But very good movie!"
    },
    {
      "rating": "0",
      "text": "horrible movie. my son and i almost fell asleep. it is so dark, not a sequel I want to see. seems like the movie was a let down unless you like dark, gloomy, boring films. the best thing about this movie were the end credits."
    },
    {
      "rating": "8",
      "text": "This was a good start to the trilogy and should not be a serious disappointment to any fans of Pullman's trilogy. The last 3 chapters of the book were not included in this first of the three movies but will be at the start of the next one. A bit of a shock to anyone who knows the story, but hopefully it will be worth the wait until The Subtle Knife comes out in a couple of years! Dakota Blue Richards does a great job as Lyra- in fact, most of the characters are really well cast. I recommend seeing the movie and, even more so, reading the books!"
    },
    {
      "rating": "5",
      "text": "A dull and perfunctory adaptation of one of the greatest books of our time. Feels flat, should have been half an hour longer to let scenes grow and characters breathe. MASSIVE mistake in cutting the ending and changing the running of the plot (to create several unfathomable strands)"
    },
    {
      "rating": "2",
      "text": "I can only assume the people who made this movie were so mesmerized by the source material and the computer generated graphics that they didn't feel any need to craft an entertaining movie. Read the book. Skip the movie."
    },
    {
      "rating": "3",
      "text": "Too childish for adults, too complex for kids. Average CGI and wooden performances throughout. Yawn."
    },
    {
      "rating": "2",
      "text": "I haven't read the books, but could still feel that some significant things must be missing from the original story. All bad fantasies lack one essential quality--immersiveness. The world that they create has to seem real and completely whole. LOTR accomplished this. This movie does not. The fantasy elements just seem silly and contrived (except for the daemon thing) and are pulled out of the sack whenever it's convenient. Need a deus ex machina--how about an armored bear that suddenly appears out of nowhere? Or a convenient flock of rescue witches? Like the worst of the Harry Potter movies, where a hastily-remembered spell saves the day, resolutions here are never really struggled for. ALSO--what the hell is Sam Eliot doing in this movie with his absurd cowboy twang (has there ever been a more one-trick pony than this guy)? I found myself predicting his lines before he said them, and, again, I never read the books."
    },
    {
      "rating": "3",
      "text": "Nothing special. Another movie for kids."
    },
    {
      "rating": "10",
      "text": "My favorite of the year. After reading the book, I couldn't wait to see how the movie would turn out. The action was amazing and the acting was incredible."
    },
    {
      "rating": "10",
      "text": "A wonderful Family movie, but it might not be good for under 10, but it's the best fantasy film of the year! Wow!"
    },
    {
      "rating": "10",
      "text": "Excellent film. Surprisingly little was cut, and one of the most faithful book-movies I've ever seen."
    },
    {
      "rating": "8",
      "text": "A fantastic movie. Wonderful execution, great acting, and breathtaking visuals (seriously, the polar bears look insane.) The ending, however, lacked."
    },
    {
      "rating": "0",
      "text": "Awful not at all representative of the source material."
    },
    {
      "rating": "3",
      "text": "If you have read the book do NOT go and watch the film you will be disappointed they have broken the story up and do not develop the characters at all. They keep the skeleton of the story but then rip out the guts and fill it with classic Disney rubbish. As a final insult they cut the story short leaving a happy ending so as not to upset anyone, in all a sham."
    },
    {
      "rating": "0",
      "text": "Special effects without a coherent plot."
    },
    {
      "rating": "8",
      "text": "Movie was quite excellent. However, as everyone mentioned previously, the plot indeed felt a bit rushed. Numerous scenes from the book were left out, but then again, it's only natural for a film to do that, due to the limited time frame a movie can hold. What I found the most amusing is the complaints of numerous parents who bring their children (5-11 years old) to watch the movie. From what I can see on their faces, they were appalled at many of the scenes which they redeemed as \"inappropriate (ex: bears lower muzzle gets ripped off).\" However, just as John P. states, this movie is rather for teenagers and adults, and not for kids. Overall, the movie was satisfactory, but only probably due to the fact that I re-read the book to refresh my memory. My friend who never read the book often needed explanations on what was going on... So before watching the movie, people should remember some things: 1. It's not really kid-friendly 2. It's only the first part of a trilogy, so don't be disappointed at the cliff-hanger ending 3. Best to read the book before watching."
    },
    {
      "rating": "10",
      "text": "Great film. Excellent. A superb adaptation. Performances are really good. The bad thing is that New Line has rushed the film, all goes too fast, but it's really a great film, deep and really fun. Go and watch this, you will be very pleased."
    },
    {
      "rating": "8",
      "text": "A brave and mostly successful attempt at adapting a challenging and intellectual fantasy book for the screen. The film has pacing problems, but the visuals and acting are great -- Dakota Blue Richards as Lyra is marvelous. Well worth seeing!"
    },
    {
      "rating": "3",
      "text": "I don´t know if The Golden Compass will go down as one of the biggest bombs in cinematic history, but it certainly deserves to. Seldom has so much effort and money been invested in creating a movie so thoroughly unengaging. It seems the entire movie should be plastered with little notes on the screen saying \"Courtesy of Lord of the Rings\" or \"Inspired by Harry Potter\" and the list goes on. Its desperate reaching to cash in on the success of those series is pathetic. The question one asks throughout the film is \"OK, and why is that interesting, and why should I care?\" None of the characters are intriguing or likable. The plot is fragmented and episodic and lacks any tension. The effects are impressive, but seem sadly wasted on a movie that, above all, is just really, really boring. And the end is the most shameless plea (which should be denied) for a sequel(s) in movie history. Please, spare us."
    },
    {
      "rating": "2",
      "text": "Terrible, terrible, terrible. I went to see No Country for Old Men, but apparently you have to be 18 to get into R-rated movies now, which is why I saw this. This is not the next CoN or LoTR...for god's sake stay away!"
    },
    {
      "rating": "8",
      "text": "As an adaptation of the brilliant novels it's not very good, but it's a great kids fantasy film nonetheless."
    },
    {
      "rating": "5",
      "text": "Had all the ingredients to make a great film, sadly, the chef was an idiot and the great performances and killer storyline get left behind in a mad rush. Hopefully they will put a more talented helmer in charge for the next one."
    },
    {
      "rating": "3",
      "text": "Big, beautiful, and boring. Kidman is totally miscast."
    },
    {
      "rating": "5",
      "text": "I think this is a movie with a lot of potential but sadly, New Line was afraid of controversy and thus you have instead a flick that bounces around from subject to subject with no explanation. I would very much be interested in seeing an unedited version of this movie should one come out on the market. As this is now, however, it's a lot of misused acting and good CG and not enough exposition to tie it all together. A shame really, as I would love to get excited for another fantasy epic in theatres....but this won't be it."
    },
    {
      "rating": "3",
      "text": "Good acting. Good CGI. Good Source Material. Complete lack of quality scripting or any notable direction. 30 seconds scenes where various characters just tell you what has happened/is happening/ is soon to happen. Descends into a series of set-up scenes followed immediately by their respective conclusion scenes. No ending to speak of, just a muddle of confusing answers to questions no-one asked. Succeeds only in leaving the viewer asking WHAT anyone is doing, let alone why they might be doing it. Poor movie for a good book."
    },
    {
      "rating": "10",
      "text": "How Chris Weitz managed to bring dramatic tension and build-up to such a short movie is beyond me. But I loved every minute of it, save for at few scenes that were just a bit too short. I will be seeing this in the cinemas for the third time too."
    },
    {
      "rating": "4",
      "text": "Terrible. Boring in parts - generic action sequences, relies heavily on CGI and impressive soundtrack to cover up the weak acting.Many changes made to book, character development sacrificed to CGI."
    },
    {
      "rating": "5",
      "text": "Here is a paradox for you. Arguably, we want to learn more about the dust from one of these parallel universes Lord Asriel(Daniel Craig) prattles on about, but sitting through two more installments of this upstart trilogy(billed as the thinking man's \"Harry Potter\"), methinks is a taxing proposition, because \"The Golden Compass\" lays an egg, and it certainly isn't golden. For starters, a disproportionate amount of time is spent at the university, in which the exposition is laid out to us; at one point, in seminar-like fashion from a lectern. Lyra(Dakota Blue Richards), eventually, like Bilbo Baggins, leaves behind her sheltered existence and accompanies Marisa(Nicole Kidman) to the north as her assistant. That's when \"The Golden Compass\" starts to pay the price for its needless dawdling. Kidman is cheated out of precious screen time as Marisa, or rather Marisa's spirit, makes us wonder what it would be like if Joan Crawford had a monkey(what makes Marisa angry reminded me of the wire hanger scene in \"Mommie Dearest\"). This is where the film loses its footing. There's evidence of heavy editing here. \"The Golden Compass\" should've established Marisa as Lyra's mentor before the girl learns the truth about her duplicitous nature. The movie never truly recovers. This filmmaker is a novice at staging action scenes, and it shows. Kidman is upstaged by a talking polar bear. That's some bear, though."
    },
    {
      "rating": "0",
      "text": "This movie was a complete waste of my time. I have not read the books and if the movie is anything to go by I do not want to. One of the more stupidly memorable quotes was \" I am an armored bear, I lift heavy things\" (Iorek Byrnison). The kid who played Lyra was a sub standard actress who switched accents often during lines. Don't get me started about the poor casting of Kidman. Although this movie is supposed to be serious and thought provoking I spent most of it laughing at the bad acting and terrible script. The superman style flying of the witches summarizes the terrible special effects which I expected to be okay due to the technology available these days. Lastly the final battle was ridiculous with not one main good character being injured, yet every one of the bad guys was annihilated. Don't bother to see this at the movies, don't even bother hiring it on DVD. I want my money and time back!"
    },
    {
      "rating": "6",
      "text": "My 10 year old nephew loved it but I wasn't so blown away. Whilst the sets were impressive and the cast gave the film some gravitas I couldn't help feeling disappointed at the ending. Indeed I didn't actually expect the film to end when it did, I was expecting another showdown at least. I suppose the unresolved story lines were designed to open the way for a sequel, only I don't get a sense of completion of the first film. Can I really wait till 2009 at the earliest to see the next installment? Well the film needed to be much more rounded for me but having said that no doubt I'll be viewing the sequel whenever it may come."
    },
    {
      "rating": "10",
      "text": "This movie was incredible. Although it was made family-friendly it was still unexpected when the jaw went flying off of the enemy ice bear. Nicole Kidman was fantastic and I would recommend it."
    },
    {
      "rating": "10",
      "text": "The secenary and the whole movie is done perfectly."
    }
  ],
  "recommendations": [
    "the_hunger_games",
    "the_dark_tower",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "the_hobbit_an_unexpected_journey",
    "the_chronicles_of_narnia_prince_caspian",
    "artemis_fowl",
    "the_hobbit_the_desolation_of_smaug",
    "harry_potter_and_the_goblet_of_fire",
    "percy_jackson_sea_of_monsters",
    "inferno",
    "the_maze_runner",
    "ready_player_one",
    "city_of_ember",
    "the_mortal_instruments_city_of_bones",
    "the_giver",
    "eragon",
    "maze_runner_the_scorch_trials",
    "the_hunger_games_mockingjay_part_2",
    "inkheart",
    "the_hunger_games_catching_fire",
    "it_chapter_two",
    "the_lovely_bones",
    "ben_hur",
    "harry_potter_and_the_chamber_of_secrets",
    "cloud_atlas"
  ]
}