{"id": 1822, "title": "The Christmas Chronicles", "starring": ["Kurt Russell", "Darby Camp"], "runtime": 104, "genre": ["Comedy", "Adventure", "Family", "Fantasy"], "description": "Siblings Kate and Teddy try to prove Santa Claus is real, but when they accidentally cause his sleigh to crash, they have to save Christmas.", "releaseYear": "2018", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/5Il2EMSF2KecrUKZPuen6BZmaCP.jpg", "categories": {"plot": 8.875, "acting": 9.083333333333334, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 8.0, "funny": 8.5, "action": 5.0}, "reviews": [{"rating": "7", "text": "It's a fine movie. Yes, it will entertain you for two hours, and yes, you will laugh, but at other times, you'll wonder what the heck you're watching. But the weird parts are made up for 10 times over by the good parts, so you'll still find plenty of enjoyment and holiday fun in this charming little Netflix movie."}, {"rating": "8", "text": "Some of the acting was sketchy at the beginning, but that changed when Kurt Russell showed up. He basically carries the movie, and when the gremlin-like elves made their appearance, I was sold. I'd watch an entire movie just about the elves. Also, the CGI is really good, like next level good. As a Christmas movie, you have to expect some cheese with that wine, but overall its a pretty good watch."}, {"rating": "10", "text": "I’m a huge Christmas-movie-buff! I mean I have this whole list of movies I have to go through before it feels like Christmas! -sidenote/ I can’t stand the Hallmark Christmas movies!Most of the movies on my list, like 99%, are pre ’00. The movies after 2000 simply doesn’t do it for me! And for a long time I have dreaded that no more movies would be added to my list because the movies all ready on it was connected with my childhood Christmases, and therefore new movies, no matter how good they would have been, would have a chance!But last night I decided to give “The Christmas Chronicles” from Netlfix a chance. The trailers and featurettes didn’t really do it for me, so my expectations were very low…I must be honest… I loved the movie before the intro was over! It gave me that sorely missed nostalgia fix when you went thru the old VHS recordings of the family’s Christmas pasts.The movie actually had a lot of “The Santa Clause” vibes! The delinquent youth (Teddy) reminded me of “Charlie” in the second Clause movie and the “true believer” in Kate was as lovely and goodhearted as Lucy in the third Clause movie. Some would say that it was a copy of the characters and therefor would be a bad thing, but for me it meant that those 2 characters gave me a feeling of recognition and (again) that all important nostalgia from when I saw the Clause movies as a child.So yeah, the kids “did it” for me. But what about the all-important Santa? Can Kurt Russell actually portray that big hearted/bellied, fuzzy and all loving Santa? It turns out he can’t… But this is in no way meant as a bad thing, because Russell made Santa into a goodhearted, weight conscious, sneaky cool cat! I mean… he sings the blues in Jail with some prostitutes and other criminals who magically gets musical talents and instruments. Russell manages to give the Santa character a lot of edge (escaping the law, dunking presents, lying to kids, heckling the portrayal of Santa on billboards and soda cans) but also still keeps that Santa “feeling”. It’s definitely my favorite “Santa” of all the movie Santa’s out there!In the end I even started liking the Elf’s. At first it annoyed me that they where portrayed as these small hairy things. But as the movie progressed, I started loving them like the little minions they are(seriously.. one of the Elf’s almost cut the balls of Teddy with a chainsaw! Such a minion thing to do)! Even their language sounded like when minions talk mixed with some Nordic/Scandinavian terms and names. And coming from Denmark that’s always a good thing"}, {"rating": "10", "text": "This movie is a must see!  It put me in the Christmas spirit immediately and captured my imagination and sense of wonder like no recent Christmas movie has.  Grab the popcorn and eggnog, sit back if you can, and enjoy a great movie the whole family will enjoy.  Bring on the holiday cheer!"}, {"rating": "10", "text": "The Christmas Chronicles is one of my top 5 favorite Christmas movies and one of my favorite movies of all time. Kurt Russell's performance as Santa was stupendous and very funny. The other cast performances were great especially Darby Camp's and Judah Lewis's. The visual effects were spectacular and magical. I loved the elves they were adorable. An A+ Christmas movie."}, {"rating": "9", "text": "A trite dramatic angle of two siblings struggling with the loss of their father aside, this might be the freshest family yuletide yarn since Arthur Christmas. Kurt Russell plays a mischievous version of Saint Nick that brings his own magical twists to Santa's established arsenal of toy delivering tools. The two likable young leads allow for some genuine emotion to come from the film's more sentimental material.The primary focus is on the ridiculous hijinks the characters get involved in on their quest to save the holiday they inadvertently put at risk in the first place. It's rambunctious energy leads to a lot of things you wouldn't expect to see in a Christmas movie. Like a car chase, a battle between elves and a gang of thugs, and Santa turning the jailhouse into a rock concert. It's delightful, funny, warm, and charming. My rating might be a little inflated because of how much of a sucker I am for mischief, but I think this is solid escapism regardless.A fun bit of Christmas cheer with plenty of magic, style, and heart. And darn it if Russell isn't having fun. He may be a snarkier, hotter, and thinner the Santa than we're typically used to, but he still manages to have the same goodwill and lovability. It's got everything you could want from a holiday movie along with a whole bunch of the unexpected."}, {"rating": "7", "text": "I never realized I needed Kurt Russell as Santa until now. Well first you have to enjoy Kurt Russell just being Kurt Russell. If you found him entertaining in anything like I have. You will like this movie.It’s magical but flawed when there’s a scene where the sleigh is in the middle of the street during daylight. Yet no one even notices.It’s also cliche that Santa is arrested and of course gets everyone in jail to sing. I also saw that in Ernest Saves Christmas and probably many others."}, {"rating": "7", "text": "The Christmas Chronicles is a really entertaining Christmas movie with some good characters and Christmas spirit. Like many Christmas movies, its definitely unoriginal in a lot of places but is still enjoyable to watch as a whole."}, {"rating": "8", "text": "Found this to be an enjoyable little Christmas film.Kurt Russell is Santa Claus and it's everything you'd expect him to be. He manages to maintain his charm and swagger while keeping the basic core of Santa intact.The film has a Home Alone-esque 90's feel to it with that right balance of heart and humor and like the films of that era surprising moments of darkness and pushing the edge a little while maintaining a PG rating.Be forewarned that the movie mostly runs on the cast and presentation. The plot is full of Christmas tropes and you can pretty much predict everything.Also, this is a modestly budgeted film. (I'm guessing that most of the money went toward Russell,) The sets and computer effects just look okay."}, {"rating": "9", "text": "The Christmas Chronicles. It doesn't do \"ho, ho, ho\". A funny, sweet and very family comedy about the real Santa Claus, and not the one on the Coca-Cola bottle. Kurt Russell played Santa Claus brilliantly, as if he were. Funny and cute elves and a prison Christmas carol add even more value to this movie."}, {"rating": "8", "text": "This was a nice surprise! The children wanted to see it and I was expecting to be bored out of my skull with another low quality family movie.But even though the story is simple, the visuals, the sound and the cast do a really nice job and since it says 'chronicles' I look forward seeing more."}, {"rating": "10", "text": "What the heck happen to Rubolph !!!  Great family movie ! Dig the band!! Will watch it again"}, {"rating": "6", "text": "Kurt Russel plays Santa. Is there anything else to add. It's a dumb Christmas movie. If you like elf and not but not Christmas chronicles you do not make sense."}, {"rating": "6", "text": "Kurt Russell is Santa Claus? It kinda works.Very Christmasy movie, I can't imagine watching it any other time of the year. Was an Ok movie, we also get a cameo at the end of Kurt Russell's Mrs playing Mrs. Claus."}, {"rating": "6", "text": "Cheesy, harmless childish fun, the Christmas Chronicles is little more than your average holiday flick. The film expresses much of the same messages of friendship and belief as any other Christmas film, supported by solid performances all round. This is an easy watch. Not a lot more to it."}, {"rating": "10", "text": "I was thoroughly entertained with this movie.  Kurt Russell makes a great Santa!  It's a very clean movie with very cute humor.  I loved the special effects, too.  It's a hit for me."}], "recommendations": ["elf", "fred_claus", "arthur_christmas", "the_santa_clause_2", "deck_the_halls", "the_muppets", "the_santa_clause", "christmas_with_the_kranks", "the_night_before", "nanny_mcphee", "hannah_montana_the_movie", "the_grinch", "enchanted", "jingle_all_the_way", "bad_santa", "night_at_the_museum_secret_of_the_tomb", "paddington", "how_the_grinch_stole_christmas", "the_game_plan", "a_cinderella_story", "ice_age_the_meltdown", "17_again", "stuart_little_2", "puss_in_boots_the_last_wish", "the_peanuts_movie"]}