{"id": 4884, "title": "The Bridges of Madison County", "starring": ["Clint Eastwood", "Meryl Streep"], "runtime": 135, "genre": ["Drama", "Romance"], "description": "Photographer Robert Kincaid wanders into the life of housewife Francesca Johnson for four days in the 1960s.", "releaseYear": "1995", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/8TfLAfIh5Qxp2J4ZjOafHYhWtDb.jpg", "categories": {"plot": 8.6, "acting": 8.944444444444445, "ending": 9.0, "soundtrack": 10.0, "cinematography": 9.0, "familyFriendly": 6.0, "funny": 5.0, "action": 9.0}, "reviews": [{"rating": "10", "text": "Cry my butt off watching this one. Great performance both from Clint and Maryl. Real emotions during the whole movie. Highly recommend it."}, {"rating": "9", "text": "this electrifying tale..The Bridges Of Madison CountyThe Bridges Of Madison County is a character driven romantic drama about a strange and unique friendship that takes place within four days. The chemistry between the lead cast is the primary reason why there is such pulsating energy emitting from this electrifying tale. The crisp and the uneasiness is bred, without any flirty talks and the way it surfs around the edgy with a shady note, is stupendously breathtaking. The attraction depicted in here plays a vital role and the makers being aware of the strength of the cast, milks it out from them that lures the viewers in, in its innocent bubble. The background score is mesmerizing, the cinematography is pure magic with fine editing and well detailed camera work. Contrary to premise where it suggests it has a limited span to be spent upon, the feature is maturely calm and soothing where eschewing their characters appropriately, the actors cast in their spells in a subtle tone. The narration is adaptive, elaborative and exquisite with gripping screenplay and pragmatic conversations. Sculpted to communicate for subsequent generation, the tale speaks volume metaphorically in those calm silent pitches that is harrowing and heartwarming at the same time. Streep is a revelation in her convoluted and unsure portrayal that is probably one of her best and underrated performance and on the other hand Eastwood is poised and reserved, supporting her thoroughly in each aspect.LaGravanese's exquisite adaptation gets better execution than anticipated from Eastwood's deck and is probably his finest act. The poem that flows fluently across the entire feature, a stunningly beautiful tale and stellar performances at the heart of it are the high points of the feature. The Bridges Of Madison County is a rare art where its poignancy is naturally cathartic for its innocence foliated through chivalrous allegory."}, {"rating": "10", "text": "One of my favorites movies! Great performance of Meryl Streep. The soundtrack of this movie is really good. Old fashioned times..."}, {"rating": "3", "text": "This was a horrible movie. It plods along haphazardly with very two-dimensional characters. This did not feel like a romantic movie for the ages, but a lame attempt in justifying a superman-like lover that could do no wrong. This was not believable, and the prose was laughable. Avoid this movie and watch something else. A complete waste of time."}, {"rating": "9", "text": "After watching David Lean's brilliant film Brief Encounter yesterday, it seems like fate that I would encounter Clint Eastwood's The Bridges of Madison County. Though it is possible that Eastwood did not take inspiration from Lean's film, the two are incredibly similar thematically and plot-wise. Portraying two people meeting for a fleeting few days in 1965, this film is a transcendent look at love and denial that is positively heart wrenching. Set in both 1965 and the present day, the film looks at the affair between Francesca Johnson (Meryl Streep) and Robert Kincaid (Clint Eastwood) as it occurs and as it is viewed by Francesca's two children as they learn about it after their mother's death. Both a passionate and mournful look at love, the film is a brilliantly constructed look at relationships.In 1965, Francesca is an unhappy housewife. With her husband and children out of town for a few days, she plans on just getting some time away from them and breathing. However, photographer Robert Kincaid comes to town to take pictures of the bridges of her Iowa hometown for a National Geographic spread. Quickly falling for him, their relationship is brief, just four days, but very much akin to the one in Brief Encounter. Robert is not married to a woman, but is married to his work. Taking him all over the world, he is devoted to the world to the detriment of his relationships with women. Francesca, meanwhile, ditched her dreams long ago to have children. The part of her that would jump and leave at the drop of a hat is long gone, for fear of instilling a bad message to her children. Thus, both know their relationship is doomed. It will end because there are forces beyond their control that pull them away from one another. Yet, as much as it hurts them both, neither wish to forget what they felt over the course of those four days as they, by their own admission, cram a lifetime of passion into just four days.With the relationship defined in small moments - Robert picking her flowers, dancing in the kitchen, taking photos at the bridge, laying in the bathtub, and simply talking at the table - the romance is incredibly authentic. Yet, no moment really rips your heart out akin to the last chance they have to be together in spirit. With her husband Richard (Jim Haynie) home now, Francesca goes into town with him where she sees Robert. Staring at one another in the rain, the film refuses to go for the overly dramatic and unrealistic conclusion. They look at one another, Francesca leans over in the front seat to get a better look at him in the pouring rain, but they go their separate ways. Leaving town, Richard winds up behind Robert. In his truck, Robert can be seen hanging the crucifix Francesca gave him on his rearview mirror and waiting at a green light. He gives her one last chance to come with him. She clutches the door handle and waits. Her worries about Robert no longer wanting her are long gone. The connection is mutual. The experience unique. They are brief soulmates, but Francesca must choose: her family or Robert. In this tense and dramatic scene, the drama feels real. It is not manufactured and you can feel her dilemma. Regardless of what she chooses, she will never feel complete as her heart is guaranteed to be pulled in two separate directions. As is the case throughout, Streep beautifully portrays this complex character and the dilemmas before her. She acts out at Robert for making her feel this way, is set to leave, and is set to stay. She cannot make up her mind, but settles on hurting the least amount of people. Were it not for Streep's powerful performance, the film would still be good but not great. This is the perfect marriage between actor and material as she brings power and grace to the picture, as well as the dilemmas put before her character.One of the film's greatest assets, however, is the portrayal of Francesca's husband. Often times in these films about affairs, the spouse is shown to be boring or abusive or any number of things. Robert, however, is not treated in such a way. He is a great husband and father. On his death bed, he expresses his regret that he never gave Francesca her dreams. His role in the film is moving and powerfully written. A large part of why Francesca stays is to not hurt Richard and it is easy to see why. He is a beautiful soul who never hurt anybody. Why would he deserve to be hurt in such a way by his wife, who he never wronged. Thus, by not portraying him negatively, The Bridges of Madison County brilliantly shows the pull her marriage has on her heart. Had he been portrayed negatively, it would be a mystery as to why she would stay when she was so unhappy. But, due to his characterization, it becomes clear that she stayed because she loved him. She could not hurt somebody she loved for the simple reason that he was not her soulmate. It is a truly selfless act and yet another example of her giving up her dreams for her family."}, {"rating": "1", "text": "please stop making movies like this. you are making the world a worse place."}, {"rating": "10", "text": "A romantic and wonderful movie"}, {"rating": "10", "text": "Clint Eastwood is working on full cylinders here. A very moving portrait. Close to melodrama, but never slipping into the mushy abysm of the novel on which it's based. It deserves all the praise in the world for it's honesty, bravery, and intelligence."}, {"rating": "8", "text": "To me this movie is about the child parent relationship.  Parents know their children - but do children know their parents.   And even as an adult child - what effort do we make to really know our parents?"}, {"rating": "0", "text": "De temps en temps (même si ça reste heureusement assez rare !) le grand Clint a un sacré coup de mou et nous démoule un film complètement et désespérément tarte... il étale sa merdasse romantico-pleurnicharde sur deux bonnes heures qu'il n'hésite pas à bourrer de guimauve avariée... Il rajoute et surajoute un gros paquet de clichés qu'il balance n'importe comment, puis il engage une actrice expérimentée qui va se pâmer sur le grand Clint puis regretter le grand Clint, encore trop merveilleusement séduisant en jeune papy... ou en pépé pas encore trop fossilisé.Pendant ce temps-là qui est très long, on ne sait plus si on doit rire de dépit ou s'auto-flageller, le film étant lui-même une auto-flagellation à tenter de regarder : une niaiserie lente mais très concentrée qui s'insinue dans nos veines et nous fait mourir d'ennui. En vérité, devant un tel \"film\", une telle \"oeuvre\", toute la collection Harlequin est partie en auto-combustion...C'est donc ici une chose atroce, atrocement niaise et dégoulinante, interdite par la Convention de Genève... même pour faire parler les prisonniers (trop de cervelles qui implosaient)."}, {"rating": "7", "text": "A bit too cheesy for me to overly enjoy, but 'The Bridges of Madison County' is a sweet romantic drama.Clint Eastwood and Meryl Streep are a strong pairing and produce very good performances, with Streep particularly standing out... even if her acting Italian doesn't always feel convincing, to me anyway. The parts of the story told via Annie Corley and Victor Slezak aren't the best, though the eventual pay-off with their characters is worthwhile."}, {"rating": "9", "text": "If they would have ended up together it would of been 10/10 . being only 5 year's old when this first came out I wouldn't have been thrilled to see it. but now at 31 year's old, and a sucker for forbidden love. It is one of my top 10 favorite movies! always will be a fan of Clint as well as Streep! such an amazing love story that will make you want more and more. To think about the story, and try to see it as a ''real life'' synario, I can honestly say that it would be really creepy if a random bridge photographer stopped at my place and ask for directions in a remote small farming town. But its fiction, so there for I absolutely love it and I will watch this repeatedly through out my life while teaching the children to never trust anyone who says they're lost even though they new what their profession entailed."}, {"rating": "9", "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡¡●●¡¡●¡●¡●¡●¡●¡●¡●¡\";:;;:;:;:;:;:;:;:;:;::;:;:;:;:;:;:;:;:;:;:;:;:;;::;:;:;"}, {"rating": "10", "text": "Changed my life, thankful for seeing this movie at the time I needed to see it. It opened my eyes and my relationship with my mother."}], "recommendations": ["carol", "the_father", "the_glass_castle", "blue_valentine", "still_alice", "marriage_story", "adore", "lion", "spencer", "call_me_by_your_name", "disobedience", "the_danish_girl", "leave_no_trace", "our_friend", "american_beauty", "fences", "gifted", "brothers", "minari", "my_cousin_rachel", "belfast", "legends_of_the_fall", "the_light_between_oceans", "the_descendants", "jackie"]}