{"id": 2115, "title": "The Santa Clause 2", "starring": ["Tim Allen", "Elizabeth Mitchell"], "runtime": 104, "genre": ["Fantasy", "Comedy", "Family"], "description": "Better watch out! The big guy in red is coming to town once again. This time, Scott Calvin -- also known as Santa Claus -- finds out there's an obscure clause in his contract requiring him to take on a wife. He has to leave the North Pole to fulfill his obligations, or else he'll be forced to give up his Yuletide gig.", "releaseYear": "2002", "mpaaRating": "G", "imageUrl": "https://image.tmdb.org/t/p/w500/g8snUzCS8JhRAzAxZUCAktEGU7d.jpg", "categories": {"plot": 7.666666666666667, "acting": 6.5, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 2.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "Love this holiday film, one of the best holiday movies ever made! There is so much laugh-out-load moments for all the family with such a lovely cast, an amazing story line and a warming family movie!"}, {"rating": "8", "text": "This sequel is not as good as the first because of the story, but it is still a lot of fun. It has some great moments and Tim Allen gives another great performance."}, {"rating": "4", "text": "The Santa Clause 2 manages to keep a low distance behind the first installment, while still having enough cheer to pull it off. But like the first one, it has many flaws, and it feels like we've seen it already."}, {"rating": "6", "text": "It's harmless entertainment, but unfortunately \"The Santa Clause 2\" just doesn't have the same charm that made its predecessor so good. That said, it's still not bad, and it's definitely a fun watch around the holidays. Just don't expect anything close to the first film."}, {"rating": "6", "text": "The Santa Clause 2 brings another round of Tim Allen and his ultimate shining and sadly, that shining he gave us in the first Santa Clause movie wasn't even in one part in the Santa Clause 2. Still seems enjoyable without the shining though."}, {"rating": "7", "text": "Santa Clause 2 works more for having an inventive story-telling, but it continue suffering a lose of imagination and true love, mixed with the wrong continue of the ore desires message, and not-funny enough stunts or jokes. But at the end, the result is satisfying for the family or for young viewers."}, {"rating": "6", "text": "While not as good as the original, The Santa Clause 2 is far from a bad Christmas movie, and even far from a bad movie. The scenes in the North Pole are the weak point of the film, and I found the reindeer characters to be incredibly annoying. The scenes in \"the real world\" really shine, and Tim Allen's chemistry with Elizabeth Miller is by far the high point of the movie."}, {"rating": "9", "text": "The Santa Clause 2 is a great follow up to the 1994 original. I like how much of a time jump is between the two movies. Charlie is now in high school and we see how the trouble he gets in directly affects his family and most importantly his father Scott. Scotts new girlfriend is great, Lucy is adorable, and overall the movie is filled with lots of holiday spirit."}, {"rating": "4", "text": "The only people you could like in this movie are Tim Allen and the guy who played the tallest elf with black hair. But the boy who played the \"smart\" elf was TRYING to make his voice sound \"grown-up\", and made the worst gestures. The girl who played the elf who brought Santa's cocoa was an awful actress. Did you notice that when she screamed it looked like she was smiling? ..... And those giant toy soldiers he made were absolutely disturbing (especially the look on their faces...yikes!) This film had its moments, but the lines were stupidly written. Epecially when the pilot says, \"I hear something. It sounds like little hammers.\" Little hammers? What KIND of pilot says that?! Yes, this movie was definitely made for the youngsters, though it had some adult-humor in it."}, {"rating": "2", "text": "Slapstick,zany,and above all STUPID. It's amazingly boring and the humor isn't the greatest."}, {"rating": "5", "text": "Scott Calvin/Santa Claus: \"I have to get married?\"Bernard: \"Yes. It's the Mrs. Clause.\"The darkest chapter in the Santa Clause universe!"}, {"rating": "7", "text": "Not as good as the original. The story needed work and felt unfinished. It had great acting as usual of course. It isn't a classic like the original, but still good."}, {"rating": "7", "text": "Decent SequelThough it lacks some of the magic of the first one, This sequel is still worth a watch during the holidays."}, {"rating": "5", "text": "Está bien para niños; aunque se queda corta si se le compara a su predecesora."}, {"rating": "6", "text": "Loved this movie when it came out, still do. This was the first Santa Clause movie I've ever seen done this way. Killed Santa then he becomes Santa, great! My favorite out the series."}], "recommendations": ["the_christmas_chronicles", "elf", "a_cinderella_story", "fred_claus", "freaky_friday", "american_pie_2", "spies_in_disguise", "bad_santa", "17_again", "marmaduke", "night_at_the_museum_secret_of_the_tomb", "ice_age_the_meltdown", "bad_santa_2", "beetlejuice", "the_spongebob_squarepants_movie", "the_flintstones", "hannah_montana_the_movie", "the_santa_clause", "the_santa_clause_3_the_escape_clause", "despicable_me", "hotel_transylvania_2", "despicable_me_2", "igor", "second_act", "paddington"]}