{
  "id": 1056,
  "title": "The Hunger Games",
  "starring": [
    "Jennifer Lawrence",
    "Josh Hutcherson"
  ],
  "runtime": 142,
  "genre": [
    "Science Fiction",
    "Adventure",
    "Fantasy"
  ],
  "description": "Every year in the ruins of what was once North America, the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games.  Part twisted entertainment, part government intimidation tactic, the Hunger Games are a nationally televised event in which “Tributes” must fight with one another until one survivor remains.  Pitted against highly-trained Tributes who have prepared for these Games their entire lives, Katniss is forced to rely upon her sharp instincts as well as the mentorship of drunken former victor Haymitch Abernathy.  If she’s ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love. The world will be watching.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mgZKtOvxtDX5HtUa5fAVQ5d1Afh.jpg",
  "categories": {
    "plot": 6.462962962962963,
    "acting": 7.175438596491228,
    "ending": 6.5,
    "soundtrack": 2.0,
    "cinematography": 6.2,
    "familyFriendly": 3.6666666666666665,
    "funny": 6.333333333333333,
    "action": 6.545454545454546
  },
  "reviews": [
    {
      "rating": "5",
      "text": "The premise is excellent. An Orwellian future where children are offered to the state as entertainment. There was so much promise. Not having read the books, it's like being invited to a party but not knowing anyone. There was very little character development. Further, the casting of Peta seemed poorly done. Lenny Kravitz does an excellent job in the background. The \"Rue\" racial thing, I don't get and can't imagine it makes a difference. But my real question is, in a dystopian future, why are all the children so beautiful? Shouldn't there be some level of emaciation if the outer sectors struggle just to be fed? Despite these problems, the first half of the movie is well pace and knitted together. Something happens in the first \"combat\" sequence. The combat fog falls and the pacing changes. The whole experience is uninspired. The action sequences themselves are far too close. Take your dramamine if you're in the theater and be prepare to have no idea what's happening. The movie is interesting. But a good premise and interesting plot don't necessarily make a quality movie."
    },
    {
      "rating": "10",
      "text": "I haven't read the books yet but I certainly will now that I have had the pleasure of seeing one of the best films in recent memory. The screenplay is tight and fast paced but the story keeps its integrity throughout the film. The acting is first class and Jennifer Lawrence will have a long and prosperous career unless she does something really stupid. (see Lohan, Lindsay). The only criticism I have is that they \"dumbed down\" the graphic violence to get a PG13 rating. The killings are done so quickly and cleanly that the camera barely gives you time to realize what has happened. The \"anti- CSI effect\" sanitizes the brutality of the contest and in a way it hides the evil of the adults who have orchestrated these \"games.\" I look forward to the sequels with same anticipation of the Harry Potter movies."
    },
    {
      "rating": "0",
      "text": "I don't blame the books. I haven't read them but just looking at wikipedia the overarching story as a lot of rich material to draw from. This movie just will have none of it. It was poorly written. Poorly acted (the lead girl was good but that was pretty much it). None of the backstory was explored. Just a bad movie plane and simple. The movie is really about a 3/10 but I'm giving it a 0 because of others voting it up. Basically the movie is totally overhyped. It really isn't good at all. Characters have no back story besides the 2 leads and they expect us to connect to other characters when something happens to them? Literally characters are introduced for 5 minutes and we are supposed to feel sad when they die? Ha. If the point of the games is to kill everyone else then why would these people form teams? Why would they sleep all at the same time? Why did one not wake up to betray the others silently. Just far far too many plot holes."
    },
    {
      "rating": "3",
      "text": "The movie left a lot to be desired and did not do the book justice.  Character development in the movie was weak and if a viewer has not read the book, the characters and their relationships with each other is shallow and confusing.  This confusion is clear when reading reviews by people who admit to not reading the books.  In particular the relationship between Catniss and her family needs to be expanded upon and built upon so we can understand the relationship between Rue and Catniss and the tragedy of the circumstances they are put into.  The relationship between Peeta and Catniss is also confusing and shallow, sanitizing the internal conflict felt by them.  And finally we get to Haymitch, who is a shadow of the character he was in the book."
    },
    {
      "rating": "3",
      "text": "Having read the books numerous times, the movie is lacking is so many ways.  Scenes were redacted which I understand you have to keep the film lengthen under consideration but do not add scenes that have no mention or relevance into the movie.  Also, the time lines are important in this film.  You are building up to something.  When you leave so much out how do you have that reference for later films.  You do not get to connect with Katniss and Peeta in the film like you do in the books.  I blame the SIGNIFICANT shortening of the cave scenes.  The whole last 30 minutes of the film was horrible.  Adding the extra fighting in the last scene did not add any value but took away from the film.  Had the last Cornucopia scene been left as originally written, it would have made for a much more dramatic conclusion and wrap of the film."
    },
    {
      "rating": "10",
      "text": "To me the Hunger Games was sort of like Lord of the Flies meets Mad Max.  Has anyone read Lord of the Flies or seen Mad Max with Mel Gibson?  There was also a Japanese movie called Battle Royale that came out a few years ago but was never released in the US."
    },
    {
      "rating": "8",
      "text": "A solid start to a promising franchise, The Hunger Games thrills with good action sequences and a brilliant performance by Jennifer Lawrence as Katniss Everdeen."
    },
    {
      "rating": "10",
      "text": "I think the goal was to translate the Hunger Games series into films that would still get it a PG-13 rating so that it's primary audience could actually go see the movies.  It could have been much darker and more violent, but I think it was faithful to the book - and a thoughtful treatment of the various dystopian themes.  There's so much more to the books than the violence of the games.  Had the movie focused only on that it would have shortchanged the story.  Instead, this film reaches for higher-hanging fruit.  Jennifer Lawrence is a terrific actress who brought depth to the role of Katniss, but I thought Amandla Stenberg's portrayal of Rue was wonderful.  I look forward to the next installment!"
    },
    {
      "rating": "9",
      "text": "It's not flawless , but it manages to keep the viewer engrossed from start to finish thanks to some very thrilling action and a superb emotional emphasis that will stay with you for a very long time to come ."
    },
    {
      "rating": "5",
      "text": "The Hunger Games, based on a novel of the same title by Suzanne Collins, fails to deliver as much suspense as the novel does and even though it tries to deliver some action it delivers no action. The Hunger Games is also extremely complicated for those who have not read the book. There are countless things that the viewer won't know if they haven't read the book. The scenes also went by way to fast in my opinion. For a movie that is two hours and twenty-two minutes (about two hours and ten minutes with out the ending credits), this movie should have been made way better. The special effects, though, were extraordinary."
    },
    {
      "rating": "10",
      "text": "The Hunger Games - 10/10 - The Hunger Games is inventive, inspirational and at times mind-blowing. It's not the greatest adaptation of the novel but this film stands alone. The shaky camera might be a little must but it's a brilliant way for this film that's about kids killing kids to bypass the MPAA and a R rating. Also a blockbuster of this nature made for under a hundred million and not being a total disaster is a feat within itself. Hunger Games is a must watch blockbuster in a randomly placed March!"
    },
    {
      "rating": "7",
      "text": "\"The Hunger Games\" is probably one of the very few movies that doesn't get swept over by the teenage fad curse, with a huge thanks to excellent performances from Jennifer Lawrence."
    },
    {
      "rating": "8",
      "text": "Oh sinnerman where u gone run to? where u gone run 2? Its She-Robinhood of Sherwood Forest. Read it. Breakthrough film introduce younger audiences hunger for blood and gore instead of family friendly Disney. Made Twilight look like a cartoon but its a bit cold and dry. Direction+Art is SUPERB! Not borrowed. Original!"
    },
    {
      "rating": "9",
      "text": "Now, this film isn't incredible, but it fulfilled everything I had hopes for when I went into the cinema. I think a lot of the scenes were done done very well, and it made me feel very tense, which is good. The only bad thing I could say about it was there were a few cliches that they used, but all in all it was a good film, at least, I enjoyed it, and that's why I gave it the score that I did."
    },
    {
      "rating": "7",
      "text": "Angels: I have not read the book. Also, I am an old dude who likes all kinds of movies-including movies with well constructed scenes of realistic violence...So, I went to this movie with high expectations. Unfortunately, for me, and I should have realized this from the ratings, the violence was sanitized so as to be suitable for high schoolers, with a low tolerance for violence.   It is a great story, and the young actors did a fine job. Katniss was  appealing, and believable as a 'tough enough\" heroine (though not an ass-kicking one.)  However, I found that the pace of the movie flagged in places,  and there was an implausibility factor at a detail level.  (I know it is basically implausible to imagine a society sacrificing children, but I got over that hurdle easily enough.) What I did not understand is why there  were not any(?) desperate nihilistic young characters.  (I grew up in a big city, and I came across quite a few.  And judging from the crime in rural areas there are quite a few there too.)  But why did the young tributes cooperate so meekly with the murderous theatre. I know some of the kids I grew up with would have tried to kill/assault their tormentors at the capitol. Does this happen in the next book/movie?  Anyway, the movie was entertaining enough.  And to put this movie in perspective, my son, who is college age, and sophisticated about movies, really enjoyed this one.Glow brightly Angels."
    },
    {
      "rating": "7",
      "text": "I enjoyed The Hunger Games a lot, but there are definitely some problems with the movie that prevented it from being truly amazing in my opinion. For starters the movie has some very interesting themes and ideas (like using terror to subdue the masses, etc...) but sadly they're very underused, which is understandable as you don't have as much time in a film. But if the movie is going to lose in depth I expected it to make up in pacing and action, and unfortunately the pacing was very slow at times and I found myself very bored in the middle of the movie because of the heavy exposition that wasn't very well done, so it was a lose-lose situation. The next problem I had were the action sequences, it's simple you couldn't see a damn thing. Now, this has some upsides, for example the violence wasn't shown in a epic fashion and at the same time they would spend a great amount of time showing you the consequences of it, which makes it very real and poignant, but the big downside like I said is that you can't see a damn thing and have no idea what just happened. Overall though I enjoyed the characters and performances a lot, the actors did a great job I think. So yeah all in all The Hunger Games is the perfect example of a good movie that has the potential to be amazing with its sequels, if they manage to fix the small issues, and turn it into a great trilogy, which I'm hopeful they will."
    },
    {
      "rating": "10",
      "text": "Beautiful. The adaptation for the book was beautiful. True, the camera style was shaky and the relationship between Peeta and Katniss was shallow, and also true, some of the important parts of the movie were left out, but there were only 20 DIFFERENCES--you can count them on wikipedia if you don't believe me, they have a list--BETWEEN THE BOOK AND THE MOVIE. You see, pretty much almost all of the movies made nowadays bases off of books are AWFUL. They have too many differences to distinguish from the book it turns into a completely different plot, and soon enough, the movie turns into something different than what it was based off of. WHY THE NEGATIVE REVIEWS??? THE ADAPTATION WAS BEAUTIFUL!!! The acting was purely wonderful to watch; I have never seen a movie with such great acting. For all of those who say the acting was terrible, you should Google what the other possible choices are, and you'll probably be out of school for weeks due to nausea. Suzanne Collins was strictly GENIUS for choosing Liongate to to the remake. The criticism for the adaptation is unnecessary, the racial views are completely out of line, and the movie is lower on the user score than it should be. People, have a heart and have good taste to know when a movie that comes out is actually GOOD!"
    },
    {
      "rating": "10",
      "text": "I was so excited but also so concerned that they were going to screw up this movie, based on a book that is one of my favorites. But I am pleased to say, they did great! The casting is great, the story is great, the direction is great (but, maybe a little bit too much shaky cam?) and the pacing is great. Of course, some parts of the book weren't included, but that's to be expected with an adaption of a novel."
    },
    {
      "rating": "7",
      "text": "The Hunger Games stomps the Twilight saga flat, and though I found those films somewhat amusing, this one is the real deal... http://www.facebook.com/ElvisPresleySonElvisAaronPresleyJr"
    },
    {
      "rating": "8",
      "text": "There are scenes that left me feeling confused because of its jumpiness, but for a book adaptation, this first installment of Suzanne Collins' great series is more than one could've asked for. Lawrence is the best choice for Katniss, and she does it excellently. Even for someone who hasn't read the book, I don't think there will be too many confusions because the movie manages to keep the story both complex and simple at the same time. It's been a long time since I enjoy a movie with female heroine and seems like Jennifer Lawrence is truly destined to be the actress of her generation."
    },
    {
      "rating": "10",
      "text": "To me, the Hunger Games was like watching something in the future. I know that it leaves out lots of parts, but if they took it right from the book, It would probably be rated R."
    },
    {
      "rating": "6",
      "text": "A refreshingly grim and realistic premise for an American film meant for teens. Disney it ain't and that's a strength. The weakness? Way, way too much fidelity to the source material. The first hour and a half is ponderous and keeps repeating plot and character points that may have been useful in the novel, but really drag the movie down at least when it pertains to the villainous characters. They are portrayed without an ounce of balance or empathy! As an artistic choice, it's fine, but then someone should have taken some liberties with the script to assure that we weren't treated to endless scenes of Tucci and company being wretched and evil. It got old very quickly. Casting was mostly well done. Rue worked for me and I believe was a true artistic choice especially in Katniss' final acts for her. Lawrence was much, much better in this role than in anything she has done before. It's the first time I've seen her reveal herself in her acting. She worked for me and the nuances of the premise made me feel like I was not watching something put out there to make the kids \"feel empowered\" which is 90% of teen film. To be commended."
    },
    {
      "rating": "6",
      "text": "Despite not really enjoying this film, I am still going to give it a slightly positive rating. My reasoning for this is that it is actually a decent film, however my opinion on it has been altered as I read the books first. The books has in depth politics and lots of violence and excitement. The film left a lot of the politics and violence out to make it watchable for the younger ages, which subsequently created a cheesy, not brilliantly written film. If they had 'juiced it up' a bit and made it a 15, I'm sure I would have enjoyed it a lot more.\rI would recommend this film if you have not read the book, if you have steer clear of it."
    },
    {
      "rating": "8",
      "text": "Being a huge fan of the book, I had high expectations for such a big-budget adaptation.  Collins did an excellent job adapting her novel to a different media, and with exception of a few changes, held true to the original source material.  The few changes that were made in foresight will enhance future film adaptations by removing confusing details or adding new plot devices that, while exceptional in the original novel, do not translate as well to the film.The characters, with a few exceptions, were superbly acted and well developed.  I applaud the director for limiting the amount of romance in the film (which becomes almost sickeningly annoying in the sequel novels), which allowed for good character development but did not leave me feeling like I was watching characters from twilight in a different movie.Plot wise the film follows the novel fairly consistently;  a few plot holes exist which take away slightly from the overall feel.  Otherwise, it is an excellent movie and an enjoyable experience."
    },
    {
      "rating": "3",
      "text": "This is a movie about a brutal gladator like event for people who don't like violence and like sparkly vampires. This is book i simply a short story called \"the lottery\" merged with a far supiorior Movie called battle royale. The lead actor \"whos a hunter\" does inane things like sit in a sunny clearing and run around in a blue blazer in the forest while shes supposed to be in a life and death game. Totally unrealistic and the combat was poor."
    },
    {
      "rating": "7",
      "text": "Based on the book by Suzanne Collins, the hunger games movie is a good tribute that will probably leave fans delighted. Though not as exciting as the book, it is still worth seeing."
    },
    {
      "rating": "7",
      "text": "They missed a few few key points of the book, but otherwise did O.K. in adapting it. Other than that, The Hunger Games was well acted (especially by Jennifer Lawrence) and just helps create the atmosphere of The Hunger Games universe well."
    },
    {
      "rating": "2",
      "text": "Shameful ripoff of \"Battle Royale,\" and much lower in quality.  It's Battle Royale for \"the Twilight crowd.\"  The acting was stale, the action was bland, and there wasn't any reason given to me to really care about anything going on.  The author of the books claims to have never heard of Battle Royale, and that's a laugh!"
    },
    {
      "rating": "7",
      "text": "The movie was overall fairly good but when you read the books, you always heard what she was thinking and in the movie you could just see the look on her face but never understand what she was thinking off. The movie left out a lot of important details and was definitely not as good as the book, but it was still good and I'll probably buy the DVD version when it comes out."
    },
    {
      "rating": "2",
      "text": "\"It all makes sense if you read the book\". Well, I guess it's time to put a warning label on the DVD cover about that, because this movie makes no sense. At all. I really hope the books are better thought and better written than this movie, that can be described only as garbage on garbage on garbage that the viewer is forced to swallow. Plot holes, unanswered questions, non-sense, \"The Hunger Games\" has them all. During the movie you'll find yourself simply asking two kind of questions: \"Are they really that stupid?\" and \"What the hell?\". Some examples? Here we go, but I doubt I'll have enough typing space. --The participants make teams. Yes, you read that correctly: they make TEAMS. For like an hour you're told only one of them can survive but, yeah, they make teams. You could understand that behaviour from the kind-hearted Katniss, but, wait, it gets better: the BAD GUYS make teams. And they sleep together. Of course, no one of them thinks about slaughtering all of his teammates during the night to win the games, because, yes, they are that stupid. --You managed to get all the food supplies? It would be a good idea to surround them with two dozens land mines, just in case the good girl wants to blow them and starve you to death. Yes, they are that stupid. --The good girl climbs a tree while chased by a bunch of bad guys? No problem, since no one of that uber-skilled teen assassins is able to climb a tree aswell. Again, it gets better: she kills one by throwing an hive full of killer bees on them while they're sleeping (somehow the bees can tell the good guys from the bad ones). --At one point she's about to be killed, but the bad guy is kind enough to wait, go close and confess all of his murders, so the not-so-good-but-not-that-bad girl can get revenge. Oh, it gets even better: she kills only the bad guy and spares Katniss, since she somehow forgot (again) only one of them can win.--On the \"What the hell?\" category: when short on participants, they \"summon\" two giant rabid dogs through a computer. No explanation whatsoever, they just click a couple of times, make a 3D drawing and...here we go, giant dogs. Also, these dogs are like 6 feet high, but can't jump over a 4 1/2 feet high roof, otherwise the good girl would've died. --The baker-guy manages to disguise himself as a rock. And he's damn good at it, but...wait. What tools did he use? And when? No explanation. --The end would have been a great comedy moment if I hadn't payed real money to see it. It goes like this: \"We changed the rules of the game, you both win. No, wait, it was a joke, the rules stay the same, one of you have to die. Wait... What? Are you killing yourselves? For real? Nononono! Wait! Wait! We change the rules, ok, we change the rules. You both win, long life to the Hunger Games!\". I mean, are you serious? Are you f***ing serious? These games go on for like a century and no one, never ever thought you can simply cheat by threatening to kill yourselves as the last survivors? Again: are they really *that stupid*? And these overpowered, totalitarian organizers never ever thought about this *little flaw*? They have to be tricked by a couple of teenagers to realize their idiocy? --These are just some of the pearls you'll find in this movie, let alone the poor acting of everyone, including Woody Harrelson that was probably *really* drunk during all the shoots. If \"The Hunger Games\" was a movie from Mel Brooks, it would've been a round 10 in comedy. Don't waste your money on this rubbish."
    },
    {
      "rating": "10",
      "text": "Best Movie I've Ever See. If you've read the book you will absolutely love this movie.Jennifer Lawrence is a sexy beast and the movie is just sooooooooo good you have to see this movie i swear."
    },
    {
      "rating": "9",
      "text": "The only reason I'm not giving this movie a 10 (even though I was totally planning on voting a 10) is because I watched the movie before I read the book.  Overall, The Hunger Games is a unique and refreshing film.  However, towards the last few minutes of the movie I started experiencing confusion between Katniss and Peeta's relationship.  Keep in mind I did not know there was a Hunger Games book series at all before stepping into the theater.  It was obvious towards the last few minutes a cliffhanger was coming and left me hoping for a sequel.  I had many unanswered questions though about the characters relationships with each other and a few even on the technical aspects of the Games.  The questions were not answered in the book Catching Fire.  They were answered in the book Hunger Games.  Because of my unanswered questions being answered within the book the movie was written about and the lack of details that I considered to be important in the book that were not shown in the movie I cannot give a 10."
    },
    {
      "rating": "8",
      "text": "I did NOT read the books. With that being said, I liked this film! The performances are all great and the story, as you can imagine, is strong. It drags here and there but nothing that sucks the life out of what's going on on-screen. Harrelson does a fine job and he provides a likeable character here. Of course, the gorgeous pitch-perfect Lawrence is stunning as ever. There is some strong potential here and I believe with time and a couple sequels that are equally as good, this will be another franchise powerhouse."
    },
    {
      "rating": "7",
      "text": "I didn't exactly know what to expect going into seeing this movie. I personally have only read the first book in the series and there are a few things that books can do that movies can't, like spending ALOT of time developing the characters while movies need to introduce them and move on. I personally felt like the story between Katniss and her mother, particularly the reason why there's such a rift between them, was overlooked, but they were barely featured in the movie even if her family is her motivation to participate in the Games. I felt like the relationship between Peeta and Katniss was kinda forced in the movie and just generally didn't seem to flow very well with everything else. Katniss' relationship with Rue was the best part of the movie and really brought the emotional roller coaster to it's greatest height. I thought everything else about the movie was very well done and it definitely was fun to watch. However expect some of the movie limitations on character development to dampen your opinion of this movie if your an avid fan of the series as you won't get anywhere near the amount of development that the book can bring. But fans and newcomers to the series alike will both like this movie as it still does a good job selling the raw emotions that each of the characters bring."
    },
    {
      "rating": "8",
      "text": "I thoroughly enjoyed the film, although the story line of a battle-to-the-death sounds bizarre to me (NOT familiar with the book; don't read fiction). I thought the lead actors were very well chosen. Loved it that the characters' personalities were developed throughout the film. Definitely looking forward to the sequels."
    },
    {
      "rating": "8",
      "text": "A great adaptation of the novel that Gary Ross does well with much help from Jennifer Lawrence's great performance. An immersible experience with Ross's directing, he carefully places The Hunger Games a movie for any audience, displaying the underlying emotion, violence, and steady storyline for the fans of the novel and newcomers alike. Lawrence really embodies herself as Katniss and displays another award worthy consideration. While The Hunger Games is a great start, it seems as there is a large potential in the trilogy that Ross is not fully uncovering. Needless, Catching Fire hopefully is something that expands the initial story to more epic proportions like The Dark Knight did with Batman."
    },
    {
      "rating": "9",
      "text": "Extraordinary film! But, I did feel it left out to much. The book gave way more information (like always) but, I felt it was a little peculiar that they left out Madge's character. Katniss's bestfriend and the girl that gave her the pin. I didn't picture the cornucopia like the movie's version. But, that doesn't matter. It was a great film. Brought me to tears at least 3 times and it was full of great acting."
    },
    {
      "rating": "9",
      "text": "As someone who was a fan of the books, I was a little nervous going in to this movie.  Not just because I was worried that it would be good enough, but also because first person narratives are generally harder to adapt to the screen.  I was worried that the main character would lose a lot of her complexity in the translation, just because of the limitations of the medium.  I'm happy to say that Jennifer Lawrence's performance absolutely proved me wrong.  I think they made the character a little nicer for the movie (or, they left out some of her meaner stuff for the sake of pacing) and there were a few times where she had to have something explained to her rather than working it out herself (again, that has more to do with translating a first person narrative to screen without including a voice over), but the integrity of the character is still very much intact.  Lawrence's performance was nicely understated while also selling the key emotional moments.If I had one complaint about this movie (which I do), it's that the story probably would have been better served if they were willing to let it have an R-rating.  I understand why they wouldn't want that, considering the demographic they're aiming for, but a lot of the violence of the actual Hunger Games was a little too sanitized for my taste."
    },
    {
      "rating": "9",
      "text": "The move was GREAT! It was missing very little explanatory details that if you read the book, you would spot. But, two thumbs up! The casting was perfect and my questions about if Josh Hutcherson was a good pick for Peeta was answered with a Yes."
    },
    {
      "rating": "8",
      "text": "HG is FAR better than it had to be, and not as good as it could have been. But, like the characters forced by the game to do things they otherwise wouldn't Ross and his team work within the PG-13 constraints to make a good action movie that still is about kids killing kids for sport. Lawrence is simply stunning in the lead role, and the orbiting characters are all top notch (Special kudos to Lenny Kravitz are in order). Sadly, the boys of HG are almost pointless, and Peeta is completely clueless to boot. In the end it is riveting and enjoyable too, but I cannot help but think what this could be in a world where an R rated HG could get made by Chris Nolan. That would be something that would satisfy a real hunger."
    },
    {
      "rating": "10",
      "text": "Being a huge fan of the book ever since it came out in 2008, my expectations were extremely high for the film adaption, and I have to say I was not disappointed. Although I feel like some characters were very underdeveloped like Gale and Prim, they obviously can't include every little detail in the book, otherwise we would be in the theaters for hours and hours (which I would actually be OK with, but probably not with others.) Living up to such a sensational book is not an easy task, and I thought Gary Ross did a great job with this adaption. Hopefully with the next couple of movies, they focus more on the characters themselves and more of their background story. But it was definitely the best movie I've seen in a REALLY long time."
    },
    {
      "rating": "5",
      "text": "Sure, blurring the violence with shaky-cam helps to obtain the PG13 but I can't go along with the blatant choice to make a purported $78M production look like amateur hour by using handheld cameras throughout. I don't care if it was an \"artistic\" choice or not. This is a science fiction movie and no one is fooled that it is a documentary or an attempt at realism a la Blair Witch Project. A simple conversation between two people in a room involves snap pans, quick cuts, even a few focus deficient zooms. I would say it looks like the kids from Super 8 made it but JJ Abrams knew that even seventies kids were smart enough to use a tripod."
    },
    {
      "rating": "9",
      "text": "This movie is fantastic, the action is not to childish, and Jennifer Lawrence's acting was impressive. My only complaint is that, in the novel, the story was more about the Hunger Games, in the movie, they try to make it more about teen romance, disappointing."
    },
    {
      "rating": "10",
      "text": "This is one of my favorite movies!! Jennifer Lawrence made the perfect Katniss and Josh Hutcherson the perfect Peeta!! If you want to see an AMAZING movie, i totally recomand this one!! It was almost as good as the book!!"
    },
    {
      "rating": "8",
      "text": "not exactly like the book, but still very good. Not if the beginning of the movie, the camera recorded badly on purpose or is he had Parkinson's....!!!"
    },
    {
      "rating": "10",
      "text": "Based on Suzanne Collins' Hunger Games trilogy, in a futuristic time where a nation had fallen apart after a horrific war two tributes from each district are chosen to fight to the death until one victor remains in what you would call a reality television show that is broad cast live to audiences. To those who are familiar with The Hunger Games trilogy, prepared to be impressed with this sensational adaptation and to those who aren't, prepare to witness an incredible journey filled with suspense and originality.Katniss (Jennifer Lawrence), a citizen of District 12 volunteers to tribute for The Hunger Games to save her little sister Prim from being tribute. Against a fellow citizen Peeta (Josh Hitcherson) who she develops a relationship with, has to fight to the death and although we don't see much of Gale (Liam Hemsworth), there is a clear understanding of their relationship and how he feels for her. Katniss must fight for her life on this suspenseful and emotional must see journey.Filled with convincing performances by all the cast, The Hunger Games is a winner! Staying true to the book, director Gary Ross does a flawless job of introducing the first of the trilogy. It's an emotional fight to the victory that instantly captures you. A fearless adaptation where every minute keeps you enthralled. With its inventive story and strong cast, The Hunger Games works on screen and ends on top ."
    },
    {
      "rating": "2",
      "text": "Not worth seeing at all. I only saw it because while planning to see 21 Jump Street (which is rated R) and having already been standing at the ticket booth, I found out my friend was still 16, and The Hunger Games was the only other interesting looking movie playing. I was with 2 friends, and none of us enjoyed it, mostly because it was painfully long, the plot was dull and slow-paced, and the character development was horrible, with useless characters and unnatural character relationships, that would have only made sense if you've read the book. On top of that, the cinematography was awful. The camera was constantly shaking, which made it look very unprofessional as a film. And the fight scenes were painful to watch because they were so poorly done. Bad camera work + bad fight scene choreography = severe motion sickness. And to add to that, the music never fit, especially during the fight scenes. In fact, the music was lazily written, with more focus on ridiculous audio effects rather than the actual musical aspect of it. And one more thing: Editors have no reason to tone the color down throughout the entire movie just to give it a slightly darker feeling. Be more creative. In conclusion, we would have had a much better experience had we seen 21 Jump Street instead of this over-hyped, lazily put together piece of crap."
    },
    {
      "rating": "8",
      "text": "The Hunger Games is off to a much better start than the Twilight films. The action was exciting, the story was engaging, and all the actors know what they are doing."
    },
    {
      "rating": "8",
      "text": "The Hunger Games is highly successful at delivering a substantial emotional investment. The premise of a Most Dangerous Game alternate society has been done before, but the story has a far greater humanity and depth than the genre has ever delivered. It has the neon of the The Running Man, and some similar B-movie characteristics. However, the lack of slickness and advanced technology filmmaking allows for some young actors to do some very good work. It's an emotionally engaging movie. Jennifer Lawrence is a real movie star. She is a very good actress and has electricity on screen. The action sequences and final act aren't spectacular, but these are characters I want to follow for their next adventure."
    },
    {
      "rating": "8",
      "text": "I waited eagerly for this movie to come out for months, bought tickets in advance, and showed up to the midnight premier trembling with excitement, and I was not disappointed. The cinematography at the very beginning was stunning. I was reminded of footage from the Great Depression, with the ragged children and old people, the downtrodden workers. The poverty in the districts was apparent. The movie was very tensely shot, the audience felt physically nervous when the characters did, and several of the key moments were heart-wrenching. (When Gale carries Prim away and Katniss is marched to the stage was just terrible to watch.) Cinna was absolutely masterfully done- he was a quiet, graceful, honest presence.  Rue was PERFECT. They way Rue and Katniss' alliance was formed was quite masterful as well, though a bit truncated. Rue was such a lovable character though, that her death was 'toned down', probably because people don't want to see a sweet little curly headed girl be rent in half with a spear. It seemed almost too quick and they cut out most of the song.  I enjoyed how they showed the uprising of district 11 ( I like to think the man who started it was Rue's father) but was disappointed that they didn't include District 11's gift. The violence over all was toned down considerably, which I expected since they wanted to keep it PG13.  Mostly you saw a lot of scuffling a la \"cloverfield\" and then a body fell.  There were a few exceptions, but mostly we just saw brief ( and I mean, a second) shots of the aftermath.The Capitol was fairly  well done- attention to detail was excellent. It appeared very ominous, with all the bright colors seeming off, the people looking frightening in their candy-colored costumes.  Seneca Crane easily makes himself hated, and President Snow is like an evil Santa Claus.  There is a foolish blood lust in the capitol, accentuated by Effie Trinket and her horrible comments like \"You're only here for a short time but you get to enjoy yourself!\" (Read: we feed you well before we kill you) Effie lacked some dimension in my opinion, though. She seemed to be soley comedic relief.  Haymitch did a great job. His drunkenness was minimized, and he displayed genuine caring that wasn't seen originally in the books, but it played out well. This movie inserted lots of excellent sensory techniques to suck in the viewer. There was a high pitched buzzing after an explosion, and the familiar sound of \"far away\" that most people are familiar with when they are nervous. There was flashes of light and sudden swoops to indicate pain and dizziness. These little additions made the film more believable. You felt like you were there. Overall, the movie met my expectations, though, honestly, they should have just made it rated R and served into the violence like it should have been. This story isn't about violence for violence's sake, its about corruption and moral latitude. You have to see the horror to understand. It is definitely worth seeing, in fact, I saw it twice."
    }
  ]
}