{
  "id": 3878,
  "title": "The Guest",
  "starring": [
    "Dan Stevens",
    "Maika Monroe"
  ],
  "runtime": 100,
  "genre": [
    "Mystery",
    "Thriller",
    "Action"
  ],
  "description": "A soldier introduces himself to the Peterson family, claiming to be a friend of their son who died in action. After the young man is welcomed into their home, a series of accidental deaths seem to be connected to his presence.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6zyl8uGWYjcCb8CJVMk7BZK0SfU.jpg",
  "categories": {
    "plot": 7.818181818181818,
    "acting": 7.526315789473684,
    "ending": 7.916666666666667,
    "soundtrack": 7.9375,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 7.75,
    "action": 7.785714285714286
  },
  "reviews": [
    {
      "rating": "10",
      "text": "OK, so I just randomly stumbled upon this gem on a list of films that was not shown on the big screen this year in my country. And man, was I in for a surprise. I mean, this is truly one of the best movies that I have ever seen, and one that I will tell all my friends to watch. The tension and the unique atmosphere it builds is truly remarkable, the lead actor who I never even heard of before gave an astonishing performance. And don't even get me started on the soundtrack. Great movie, don't miss it!"
    },
    {
      "rating": "10",
      "text": "I went in knowing nothing about this movie and had a great time.  Its a really fun well paced movie, if its not my favorite of 2014 its totally in my top 3."
    },
    {
      "rating": "10",
      "text": "The Guest is a fast, fun, action packed thriller and the final act is one of the best in recent years. Stylish, slick, well-acted, and well-shot, you can tell that the filmmakers put a lot of heart into it."
    },
    {
      "rating": "10",
      "text": "One of the most entertaining films of 2014, The Guest is 90 minutes of retro-thriller flashback, dazzling with a chilling Dan Stevens performance, incredibly well-thought-out cinematography, and an incredible campy, Drive-meets-Rambo atmospheric tone that's aided by a wonderful 80s' synth score. Great stuff."
    },
    {
      "rating": "10",
      "text": "This is a brilliant horror grindhouse film which builds tension well and keeps you guessing the whole time. Dan Stevens oozes cool from every pore and I just want to climb inside his body and be him. The synthwave music is very well done, kicking in nicely to build up the tension leading up to climactic scenes. The whole thing has an old-school 70's feel about it. The acting is superb and the action scenes are well filmed and intense. The film keeps you guessing right up until the last minute so the pacing from start to finish is spot on.It's good to see these quirky little films still being made, especially with some known faces in them. More like this please Mr Director man"
    },
    {
      "rating": "10",
      "text": "David is a smooth motherf***er! No disappointments! I have nothing else to say, so I'm just gonna type a bunch of characters until I reach 150 'cause... aaaaaaand I've reached it. (Y)"
    },
    {
      "rating": "9",
      "text": "The whole cast are terrific, but the chemistry between Dan Stevens and Maika Monroe is fantastic, whose climax is in the final scene. The whole film is very reminiscent of John Carpenter, including music, which is a good influence. A highly recommended film."
    },
    {
      "rating": "10",
      "text": "This movie is really awesome. I could not believe it was Matthew Crawley. He is an awesome actor.\r Fans of action, suspense, good acting, good scripts. Watch it. It's sweet."
    },
    {
      "rating": "9",
      "text": "Hilarious and hugely entertaining throwback to pulpy 80's genre thrillers with a fantastic psychotic performance from newcomer Dan Stevens.   This is killer follow up to \"You're Next\""
    },
    {
      "rating": "10",
      "text": "I really loved this movie! I swear, no matter how many terrible things David does, you just can't help but love him! He's so smooth and convincing that you're just in awe of this wack job lol. I found it to be a great thriller and definitely recommend it."
    },
    {
      "rating": "9",
      "text": "This movie was really well made. The acting, the scenario, the practical effects, everything was great. it may have been predictable at times, but one thing is sure, it was one hell of an entertaining movie."
    },
    {
      "rating": "9",
      "text": "the guest is one amazing film that kept me guessing early on. it does loose itself a bit at the end but that will not be distracting when you have excellent directing from Adam Wingard as well a stellar performances from Dan Stevens, Mika Monroe and Brendan Meyer. if you enjoy movies like terminator and any of John Carpenters movies this is one for you"
    },
    {
      "rating": "9",
      "text": "A slick suspense movie that doesn't waste any time diving in.  Intriguing and keeps you guessing, as well as debating your idea of what is going on the entire time.  Great acting and story set to an amazing 80's tech-noir type soundtrack.  Being a movie I had never heard of before I watched it I was really blown away."
    },
    {
      "rating": "9",
      "text": "Adam Wingard the director of this movie Previously did: You're Next and the short films from V/H/S 1&2, but now he direct's his new film The Guest and this is one of his best.\r The story is about a soldier comes the Peterson family, claiming to be a friend of their son who died in action. But as a series of accidental deaths occurs, the welcomed man soon turns into a suspect.\r Before seeing this movie I known nothing about it. I haven't heard anyone talking about it so I pretty much went in with a open mind knowing nothing, and after viewing I can say that The Guest is freaking amazing and brilliantly flawless with one of the best soundtracks I heard since the 2011 movie Drive.\r Dan Stevens did a outstanding performance as the nice guy that has a dark and uneasy side to him, which Stevens nailed that and I would love to see him in more movies. The rest of the cast did really good as well.\r The soundtrack in this movie is just so beautiful to listen to, and it may be the best soundtrack I've heard since Drive and all John Carpenter movie soundtrack. The soundtrack had that 80's and 90's nostalgic feeling to it which made the movie and the soundtrack even more awesome. No words can describe it, it should be viewed by people who love nostalgic music and movie lovers.\r The cinematography and the writing in the movie was just top notch and this has to be the biggest surprises of the year for me, because I wasn't expecting how fantastic and well done it was. I'm not going to give it the perfect rating as I thought I was going to give, because I don't this movie was \"The best movie ever made\", no it's really not, but still this movie is awesome."
    },
    {
      "rating": "9",
      "text": "Amazing movie. Highly Recommend seeing. Blew my mind, Dan Stevens steals the show... a must see film.\rFilled with plot twists and leaves you constantly wondering what David will do next."
    },
    {
      "rating": "9",
      "text": "This movie has pretty much everything I like: an 80s/modern synthwave soundtrack, military special forces, dark humour, mystery and surprises. The final act of the movie feels quite different to the opening act and is justifiably divisive, but I didn't mind that much. I loved Drive and the original Terminator so I'm glad I heard about The Guest. Shame it didn't come out in my local cinema."
    },
    {
      "rating": "6",
      "text": "Eine Familie trauert um den in Afghanistan verstorbenen Sohn. Unverhoffte Ablenkung verschafft sein Kriegskamerad David (Dan Stevens), der sich charmant und hilfsbereit in ihren Alltag drängt – durch verständnisvolle Gespräche mit den Eltern, eine Sixpack-Vorführung für die verwirrte Tochter und einen Satz Prügel für die Bullys von Sohn Luke. Dass der Überraschungsgast Tödliches zu verbergen hat, ist angesichts der Regievergangenheit Adam Wingards klar: Schließlich war You’re next ein knallharter Home-Invasion-Slasher. Auch The Guest ist brachial blutig, hat seine Wurzeln aber im 80s-Action-Thriller – was Wingard mit bewusst peinlichen Prollszenen, übersteuerten Farben und einem pumpenden Carpenter-Soundtrack verdeutlicht. So unterhält The Guest nach einem etwas zähen Start auf hohem technischen Niveau, überrascht in puncto Action, jedoch niemals beim Plot."
    },
    {
      "rating": "9",
      "text": "Dan Stevens is great in this mystery thriller. The pacing is excellent and his cool demeanor adds an extra charm to the movie. The third act delivers a satisfying conclusion."
    },
    {
      "rating": "10",
      "text": "bjjbhigugionknknkbjbjbjbjbigih+×÷=⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙¡¿¡¡¡¿¡¡¡¡¡¿¡¿¡¡¡¡¡¿¡¡¡¡¡¡¡¿..........++++++++++++++++++"
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "10",
      "text": "One of the most stylish and fun thrillers of the decade. Briskly paced and wonderfully scored. Dan Stevens is electrifying as the seemingly charming enigmatic guest."
    },
    {
      "rating": "9",
      "text": "Please release this wider - it's a GREAT MOVIE\r-------------------\r-Great movie - one of the best of the year in my opinion\r-Very clever B movie\r-Lots of laugh out loud moments\r-Great neo 80's style music\r-reminds me, stylistically, a bit of Drive (one of my favorite movies of all time)"
    },
    {
      "rating": "10",
      "text": "Adam Wingard showed his basic talents in \"V/H/S\", got stronger with \"You're Next\", and now he is an acclaimed director among all critics for \"The Guest\", starring Dan Stevens and Maika Monroe and the 70's, because if there is anything that brings the vibes of the 70's, 80's and 90's, it is absolutely this year's \"The Guest\"."
    },
    {
      "rating": "8",
      "text": "This film is simply cool with a very engaging performance from its lead.  I admit to being skeptical after Adam Wingard's last film Your Next which many critics liked and I happened to think was awful, but I'm happy to see he learned some things.  There were some moments you wonder why this family just goes along with this guy so easy, but that is forgiven with its infectious score and exciting tension.  A-"
    },
    {
      "rating": "2",
      "text": "I'm not a severe movie critic and I appreciate most movies people don't.  This however is just plain bad.  Everything was incredibly cliché and predictable.  Not impressed at all.  Save your time and watch something else."
    },
    {
      "rating": "9",
      "text": "Adam Wingard can really do no wrong, in my book. He takes these worn-out genres and looks at them with fresh eyes.  I loved everything about You're Next, but that felt like a bigger, more mainstream movie.  This one reminded me of The Hitcher, but weirder, more marginalized. Great lead acting, amazing score, and such a playful, fun tone to it that you don't get bogged down in the extreme violence. Highly recommended at the end of a tough summer for mainstream flicks."
    },
    {
      "rating": "6",
      "text": "When I saw the first fighting scene against the bullies I was surprised of how good this movie was going to turn out to be. It's like watching a classic action film which that's what I liked. The movie goes downhill for me like in the middle of the film. For example when he was going to buy the guns and turns out that he kills the two guys. That scene dropped for me. But one good thing that saved this film before I almost hated it is the suspense and the surprises that I got."
    },
    {
      "rating": "10",
      "text": "A horror film in disguise \"The Guest\" is packed with everything a normal horror fan would love, even if it's not lumped in with the genre. With a tons of musical nods to Halloween 3 The Guest is just plain fun."
    },
    {
      "rating": "7",
      "text": "The first hour is genuinely good, but the final 30 minutes is ridiculous. Everyone involved is much more adept at the build-up than executing a convincing action-thriller / \"scary movie\" climax."
    },
    {
      "rating": "10",
      "text": "●●●●●●●●●●●●●●●●●○○○○○○○○○○○○○○○○○○\",\",\",\",\",\"\",\",\",\",\",\",\",\",+,+,+,+,×,÷,÷,÷,÷,÷,÷,÷,=,=,."
    },
    {
      "rating": "7",
      "text": "The Guest is a seductive, enthralling thriller which feeds off of emotion and suspense. Dan Stevens, along with Maika Monroe, are well-cast and flourish."
    },
    {
      "rating": "7",
      "text": "Ummmm.... I don't quite know what to say about this movie. First of all, the soundtrack is absolutely awesome. It's a shame that the soundtrack doesn't fit the mood of the film in the slightest. The movie has no 80's flair to it at all.\r Also, the story completely derails in the second half. I lost track of it when they started into the whole super-soldier thing.\r I did love the haunted house set-piece though. Definitely the standout moment of the film."
    },
    {
      "rating": "0",
      "text": "I lost one and half of my life. The Critic Reviews becomes untrustworthy. I can't believe that are critics rewarding this movie with more than 0 (zero)."
    },
    {
      "rating": "0",
      "text": "Didn't expect such rating from metacritic. A complete waste of time. Please don't bother to watch. Although in the beginning the movie seemed promising."
    },
    {
      "rating": "3",
      "text": "Illogical, bad acting and unsupportable final scene... what the hell. It's like they tried to imitate the vibe from the movie \"Drive\" but badly done.."
    },
    {
      "rating": "8",
      "text": "surprisingly entertaining move.  A throwback to 90s movies done very effectively.  From the sound effects, to music, to be B plot.  Reminds me of Cold July, also an underrated movie."
    },
    {
      "rating": "3",
      "text": "All those \"green\" ratings must be from people with a crush on Dan Stevens.  I admit he was charismatic but that's about it.  This movie is absurd.  Nothing original here, just lots of cliches and violence.  I give a 1 for the main character and a 2 for the first half of the movie which was fine. The rest is a big zero.  Seriously, this movie getting a 7+ overall rating shows how the bar is low these days with people.  The world is really sinking in a sea of mediocrity.   People eating crappy food, listening to crappy music and watching crappy movies."
    },
    {
      "rating": "8",
      "text": "The Guest is like a friendly guest. You'll pretty much enjoy so many limits out of this one and call out all those limits for a guest to replace them with a guest."
    },
    {
      "rating": "7",
      "text": "So much fun!\r Issues with editing and a feeling that some bits are missing mean this isn't a perfect telling of this story but it is a good, violent, and funny tale.\r You will like."
    },
    {
      "rating": "8",
      "text": "Every once in a while there are movies that fail in the theaters that you watch on dvd and scratch your head and wonder why? I see why the critics really enjoyed this movie and rated it so high but it is disappointing when movies like this fail but transformers age of extinction which could be summed up by watching an explosion on repeat for over two hours does well. I guess choke it up to the dumbing down of society. The guest can be summed up as making a movie about michael meyers taking his mask off and finding out he is a pretty cool guy. The movie was a well acted and filled with suspense captured so well on the screen that I found myself holding my breathe at times. The soundtrack was also very well done. Do yourself a favor and check out this movie."
    },
    {
      "rating": "7",
      "text": "This film is hella a fun to watch! Dan Stevens is the main selling point for the film, he plays \"David\" flawlessly! The film starts off genuinely intriguing and whilst it does get intense further through the film, it does get a bit confusing and ridiculous. But the film seems to be reasonably self aware and play with it in a B-movie style fashion. The exposition that is given is a little unbelievable but that just adds to it's B-movie charm. Not the most amazing movie of 2014, but i'll be damned if i don't say this is one total fun movie to watch and definitely worth the watch!"
    },
    {
      "rating": "0",
      "text": "Unwatchable. Succeeds neither as horror nor as camp. I don't know how on earth this movie ended up with a 76 on Metacritic, but then again we're the species that invented global warming, too."
    },
    {
      "rating": "7",
      "text": "Creepy stranger premise has been used in horror or mystery to varied effect, the latest Jennifer Lopez's flick is an example of how not to welcome this premise. Luckily, The Guest has the luxury of having suave lead actor and good atmosphere for a thriller. Some of the kinks are predictable, but the dark humor as well as bizarre revelations offer much needed novelty to the movie.\r David (Dan Stevens) arrives at the Petersons resident, claiming that he was a friend of their fallen son. He's well-mannered and seems trustworthy, thus the family welcomes him openly. Upon his stay, strange accidents begin to happen, and suspicion arises with the casualties. The most important hook is Dan Stevens' portrayal of David. He looks like a rugged debonair, this is not average smooth, this is Ryan Gosling's level of smoothness.\r Stevens delivers a wide variety of emotions, he can be either friendly or deadly. Backed by good cast, such as Maika Monroe as the Anna Peterson and Lance Reddick as Mayor Carver, the movie has a solid degree on acting performance. The exchange of banter is enjoyable, often resulting in manipulation or downright violence for David’s benefit. It elevates the human drama between him, the Peterson family and whoever unlucky enough to be in their immediately vicinity.\r Mystery of David's real identity is crafted slowly and it's compelling enough to pique interest without revealing too much. The film also has a touch of humor, albeit slightly crude. Strangely, in the third act it changes tone drastically for the climax. This shift is a bit odd considering it plays the thriller aspect with steady pace for the majority of early parts, although this explosive tone does have the merit of being entertaining.\r There are short bursts of Hollywood style carnage, but they are modest, not all out gunblazing from the start like Bourne or the recent John Wick. Action sequences are well choreographed, it has both devastating and ridiculous impact.. Good practical effect for the blood and explosion as well as its highly unorthodox soundtracks make the faster pace scenes more satisfying.\r Having good mesh of action, mystery and comedy, The Guest is enigmatically fascinating."
    },
    {
      "rating": "8",
      "text": "A dark, brooding mystery thriller, The Guest keeps you on edge throughout with a creepy atmosphere created by director Adam Wingard and the score from Steve Moore. Combined, they manage to borderline scare you, while also thrilling you with some killer action sequences and numerous twists and turns that both reveal and confuse things further. Dan Stevens is fantastic in the lead role, while Maika Monroe turns in a supporting performance that provides further proof of her brilliance. This film really manages to heighten suspense throughout and has a chilling coolness that both pulls you in and scares you that really underscores how cold and calculated everything done in the film is. In addition, the film is also really shot and has some great production design and the final act as a whole is brilliant and wraps the film up brilliantly. Overall, The Guest is a very good film that deserves far more attention than it has received."
    },
    {
      "rating": "5",
      "text": "I watched this based on the glowing reception of so many paid critics (many listed here⬅️) It started off promising. But the transition to total looney bin psychotic now I'm going to kill the people who took me in seemed to hinge on one line of dialogue. (Paraphrasing) He was part of a group of military men that they did tests on. Are you serious? That's it!.? Big thanks I didn't audibly fart at that very moment or I might have been lost in the story's conclusion. (Yes, that was sarcasm)\r On the plus side Dan Stevens was convincing from start to stop. Something felt legitimately off from his very first smile. His revelation from defenders of the defenseless to just plain balls out crazy off his rocker was truly scary to watch. It's a shame 10-15 min of back story wasnt invested in us. Could have elevated this promising idea and performance from saturday afternoon special (if there ever was one like this) to friday night must see chiller. This is truly a thriller movie with the veneer of action movie trailers finished with a dollop of horror. Or just a thriller totally off the rails In the end."
    },
    {
      "rating": "7",
      "text": "Some of its twists and turns might not be for everyone, but I personally enjoyed the audacious, genre-splicing fun behind \"The Guest's\" outlandish story. Some pretty cinematography and music to be experienced throughout this flick too. Interesting and thrillingly unpredictable at times, \"The Guest\" is a pretty fun personality test of a movie."
    },
    {
      "rating": "8",
      "text": "This movie did a great job not showing the real tone of the movie in the trailers, and not revealing any important plot points. The movie's twist could put some people with closed senses down, but for movie lovers and people who enjoyed the 80's action thrillers and horror movies it could not be better. The soundtrack is superb and it matches the tone of Dan Stevens's character \"David\", the fight scenes are really well done without silly shaky cameras and the action scenes are realistic.Overall this movie had a few great performances, not the best plot in the world but a plot that will entertain you and intrigue you until the end, and a few surprises topped with a great soundtrack. It's most definitely a must watch if you liked titles like \"Drive\" or \"Cold in July\"."
    },
    {
      "rating": "7",
      "text": "Ok, it's not the best movie ever, but it is entertaining. Besides the fact that it has the most cliched family characters ever (the hot older sister, the smart young brother, and the two fighting parents), the additional story to that can be pretty interesting. It's well directed and written. Though, I didn't like the ending (the las ten seconds)."
    },
    {
      "rating": "7",
      "text": "I just little bit confused after watching it, story is fine but ending of the movie is not much good, but i love dan stevens, he is so handsome and charming specially when he wears blue jacket: http://goo.gl/oYSNQ6"
    },
    {
      "rating": "7",
      "text": "Awesome theme to the movie....\"burn down their houses with their families inside\"......but what really makes it awesome is that the cast is perfect. Though the movie seemed like it could have been made in the time it takes to burn a cd....i still had no trouble believing it was going to have a huge third act....even though i like music ive never heard before.....i still feel that david was almost too cool to hurt the family and i would have preferred to see him just help out one last time.....but i guess he taught the kid to save his sister-not something i would do.."
    }
  ]
}