{
  "id": 4633,
  "title": "The Possession",
  "starring": [
    "Jeffrey Dean Morgan",
    "Kyra Sedgwick"
  ],
  "runtime": 92,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A young girl buys an antique box at a yard sale, unaware that inside the collectible lives a malicious ancient spirit. The girl's father teams with his ex-wife to find a way to end the curse upon their child.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/loZYdcmgvnonHtH0XH0RI7rm8iA.jpg",
  "categories": {
    "plot": 7.8125,
    "acting": 7.052631578947368,
    "ending": 7.5,
    "soundtrack": 7.0,
    "cinematography": 6.0,
    "familyFriendly": 6.0,
    "funny": 3.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "This is the first horror movie that not only totally engrossed me, but that I enjoyed enough to buy afterward. \"The Possession\" is a beautifully well-made exorcist film with great acting and plotwriting, and relies on a plethora of authentically creepy and thrilling imagery for its scares and punches, rather than cheap, gimmicky, completely UNscary CGI blood and gore. I loved everything about it and highly recommend to any horror fan, period."
    },
    {
      "rating": "5",
      "text": "A solid and engaging performance from Jefferey Dean Morgan is the only thing that keeps this monotonous 'Been There Done That' horror wannabe from dropping lower on the Metacritic scoreboard."
    },
    {
      "rating": "7",
      "text": "What can be scarier than being possessed by a demon? Not much really and the original exorcist film ignited peoples imaginations - but it seems that somehow films and possession just don't work that well - possibly because everyone knows the demons are no match for God and his exorcist servants - its kind of like a superhero movie - you know the bad guys will be defeated in the end - even if the hero has to shout \"Come into Me\" and jump out the window.\r This film does have its moments but overall the story is predictable and I thought it took way too long to get going for a 90 min film. The divorced parents, the grieving children, the dad having to put up with the ex-wifes jerky boyfriend, the dad who misses the school play because of work - etc etc.  Will they somehow overcome the evil and realize the most important thing is life is each other? Is their daughter just acting out when her eyes roll up in her head or moths start flying out of her mouth? Still to be fair - it was better than most of these types of films and they used a tripod. I looked into the true story this was based on and think it might have made a creepier film to explore the supposed actual events ( http://www.dibbukbox.com/story.htm) which were much less sensational -  and the concept of the dibbuk - which is not really a demon but a tormented human soul forced to remain on the earth after death.\r Still a lot of people in the audience were scared and therefore if you like this sort of thing - you'll probably enjoy it. More scares during the set up would have made it better."
    },
    {
      "rating": "7",
      "text": "Ok, the last week we watch The Apparition, the 2 horror disaster (the first is The Devil Inside), and this week we have The Possession, a new horror movie. In The Possession we watch a really horrible (but in a good way), have much scare scenes, and the sounds are creepy, maybe this movie don't have any new, but have really scare moments."
    },
    {
      "rating": "6",
      "text": "I absolutely love Horror movies, so this might be a little biased. But this film had a little possessed child in, who was the star of the show. I had great fun watching this. I love exorcism and stuff.\rMy only problem with this film, is that it needs to take bigger risks. I want more Horror."
    },
    {
      "rating": "10",
      "text": "Huge props go to Ole Bornedal, best directed horror flick I've ever seen. I love this movie. Jeffrey Dean Morgan is an amazing actor, he plays the father really well, also like in Supernatural. Also this film is so unique, it makes its supernatural-ness feel much more natural. the dialogue/script is well written, this is a very smart scary film (esp. the back story montage, and also learning the name of the demon, Abyzou). More on that note, i've actually read the article/stories of people irl with a dibbuk box. I also love the cinematographer Dan Laustsen, his work is phenomenal hes known for Silent Hill and The League of Extraordinary Gentlemen."
    },
    {
      "rating": "7",
      "text": "This was quite a fun movie. It had some great atmosphere and a ton of really creepy and scary scenes. The acting was good for the most part, especially from the child actors, and the cinematography and score were beautiful and stylish, although the editing was absolutely atrocious. The last 20 minutes were especially scary and fun. I wasn't completely wowed by this movie because it lacked in the originality department, but it was a flat-out intense and entertaining flick."
    },
    {
      "rating": "6",
      "text": "I kinda like all these kinds of flicks..i enjoyed this one a lot..you should check this out..!"
    },
    {
      "rating": "10",
      "text": "I can't believe all of these negative reviews. I enjoy scary movies and this is the scariest I've seen in a while. I'm extremely impressed with how creative the director was in finding ways to make it so creepy. Yeah maybe it is just another \"exorcist\" movie and doesn't have a ton of crazy twists but if you want to be scared- this is the movie for you! The actors were also amazing."
    },
    {
      "rating": "6",
      "text": "Picture the exorcist... Remove some of the most disturbing scenes and replace the priest by a Jew and you have the film figured out. The possession is not a bad movie, but the possessed child theme is an over-used formula. Either the movie takes the risk to be different with it or it tries to be better.... The possession achieves neither as it is very unlikely to surprise you with it's very familiar plot and characters. Now does it beat the original material it inspires itself from? It doesen't. The \"entity\" is a bit too shy. Sure you know it's there... But it doesen't do much. Even the parents take 3/4 of the movie before actually figuring out that the child is possessed. The movie actually starts really strong with a very creapy opening scene. I really loved the voices coming out of the box. But after 20-30 minutes it's the \"oh too familiar possessed kid scenario\", and for the next hour nothing really happens. I was struggling to stay awake. The last 20 minutes are good, but it takes way to much time to get there. The movie needs  a better pace, and  the story should focus on the box rather than a possessed child. The box scared me because i didn't know what was in it or what it could do. Once the entity from the box switches to the child, you are in familiar ground, you know what to expect. Don't get me wrong, the girl was creapy and scary, but again... i have seen that girl before in other movies and it just dosen't scare me anymore. I give the last 20 minutes a solid 8, but the first hour just dosen't give you enough to keep you sucked in so i have to go down to 6. If you just want a good scary movie, it's good enough. If you are a fan of movies likes the exrocist... don't expect much out of it."
    },
    {
      "rating": "0",
      "text": "I found this film very bleak. It lacked what the trailer had promised, horrifying events, and a spine-tingling feel. The film had a very basic and predictable plot, the acting i have to say was very poor and overall could possible pass for a dark comedy for avid horror fans."
    },
    {
      "rating": "5",
      "text": "'The Possession' was incredably boring, I found myself almost falling asleep. The film's dull, unimaginative and has no substance whatsoever. The film is cliche and really just took too long to 'get into it' and by the time it did I had already lost interest. The acting is the only good part about this film really, apart from the Jewish guy who was hard too take seriously (you'll see what I mean). The editing is the most annoying thing about this film; it's very choppy and unorganized. The film will have an incredabley loud scene which will then cut to a silent scene and then a cliche horror movie soundtrack plays, this annoyed me so much. It probably happened over five times. Also the film isn't even scary, which really does just say it all, honestly I wouldn't bother with 'The Possession' it's dull and lifeless, you're better off watching the actual Exorcist."
    },
    {
      "rating": "9",
      "text": "What an incredibly scary and exciting horror movie. From start to finish I was on the edge of my seat. The ending was perfect because it wasn't such a downer like most modern horror films end. The acting was also perfect and the character development was great and not rushed. Sequel?"
    },
    {
      "rating": "3",
      "text": "I'm sorry hollywood but can you do all of us a favor and make a GOOD horror movie, and please for the love of god (literally) stop making films about possessions, it is seriously getting overplayed, and they seem to only get worse, except the devil inside is probably impossible to beat on a stupidity level. Everybody, do not see this movie. 95% of it was laughable crap. I'll give it 5% of positivity, and that was in the 3rd act, but everything leading up to it was incredibly boring and like i said before, laughable. During one of the most serious parts of the film the jewish guy cracks a joke, like come on, really? This film is most certainly not worth the admission, do not waste your money or your time. 3/10"
    },
    {
      "rating": "9",
      "text": "So i just watched ''The Possession.'' I though is was great. It kept me on the edge of my seat the hole time. Their wasent a part of the movie that didnt. The people really worked hard to make this movie what it is. Congrats to you all. I see people say that its like the exorcist, what do you expect, its a movie about demonic pessession. They're all going to be similer. And the kind of movie it is, it's going to be long. It's not like a regular action or thriller or a horror movie. i really like the actors and actress to. You can't just jump write in and thast's it. The begining was really good way to kick off the movie. The voices and the way they made the girl look like was really well done. This movie was really good."
    },
    {
      "rating": "6",
      "text": "If this movie was original for sure I would have liked more. All films are equal possessions ... A girl or boy who is possessed demon and his parents have to resort to other priests or to forfeit the devil."
    },
    {
      "rating": "8",
      "text": "I can't believe that this movie has negative reviews, low critics and highly underrated! This movie really holds the meaning of horror, thank god we have a nice demon-possessing movie, YES FINALLY!"
    },
    {
      "rating": "6",
      "text": "This \"true story\" is full of clichés, has a sprinkle of creepiness, has [some] poor animation, and has intentions to be a drama film.  Full Review Coming Soon."
    },
    {
      "rating": "5",
      "text": "It's ok but some scenes are just not necessary like when a guy starts to spit out his teeth and blood. Film is similar to the exorcist (wich is a comedy not a horror), worth watching only if you are to boring and have nothing else to do."
    },
    {
      "rating": "4",
      "text": "Another non-scary horror movie, and as we all know a horror movie that isn't scary is not worth anyones time. It has a creepy vibe to it at times, but never manages to turn into something that will scare you. It relies on the same jump scares that every modern horror movie relies on and some gross out moments. The gross out moments are unintentional but still gag worthy. It's not scary, it's not interesting, and it's not worth watching. Pass on this film."
    },
    {
      "rating": "7",
      "text": "Saw The Possession on TV with my 8 cats, its an horror based on a true story, it's really the Exorcist again, but this time, its an Jewish demon (A Dibbuk) and they get help from the Synagogue to cleanse the spirt of a child ghost, I was uncomfortable the most of the film, but it was not that scary, I would probably **** myself if I was an pre-teen age"
    },
    {
      "rating": "5",
      "text": "Well, at least this movie doesn't have an extremely crappy ending."
    },
    {
      "rating": "7",
      "text": "A better than usual scary movie....if your looking for a scare, this movie does the trick! I recommend it for date night! :) However, at moments it can be a bit dry and in need of more scary moments, but overalll its a good movie."
    },
    {
      "rating": "5",
      "text": "Whoever edited this film needs to be fired quite frankly, I've never seen such a ham-fisted job of even simple scene cuts. The film will spend a good solid portion of time building this incredible suspense and drama and then, just while your balanced on the threshold of any resonance it violently cuts to black, a single piano note, and then the over-shot of some houses. This isn't a good technique, much to the point it's infuriating. The film had good moments, some excellent cinematography and I praise Natasha Calis and Madison Davenport I thought they both did an absolutely fantastic job and I see a bright future for them. Other than that, this film lacks any sort of depth. The ending in particular was extremely weak and predictable, a poor effort from an idea that could have potentially made a great film."
    },
    {
      "rating": "5",
      "text": "The Possession wreaks of unoriginality. The Sam Raimi produced psycho-show is just another exorcist knockoff propelled only by its startlingly ridiculous performances and amusingly overwrought score."
    },
    {
      "rating": "6",
      "text": "Nothing really new here, but it was a decent watch.  This is a movie you may choose to watch once, but don't expect to be ready to go buy this movie on Blue Ray."
    },
    {
      "rating": "6",
      "text": "The possession tries to scare though it doesn't succeed it. It is a good idea which could have been better made. There is no action and suspense in the film and that's a negative point. It also doesn't tries to put yoi in an atmosphere. Really many things with similar films like the possession din't happen in that film. It didn't have many demon things. The Jew priest was an extremely bad idea, though I really liked the ending. It leaves you a message that they are going to make a new movie. Despite all that facts, If you like The Exorcist you might also find good the possession"
    },
    {
      "rating": "4",
      "text": "when  you watch a movie like 'The Exorcist' or any demon  movie and you expect good jump scares and thrills, When i watched the trailer for \" The Posession\" i was gonna watch this movie and give a shot. I did watch the posession, it was not scary but it has it's moments of scares but its a good horror movie after all that's all i am gonna say. Sam Raimi has produced some **** scary films like The Grudge , Boogeyman, But this is his genre and you got give to him he is the master of horror. Grade B-"
    },
    {
      "rating": "6",
      "text": "The Possession es una película de terror que está inspirada en hechos reales (algo que se me hizo muy difícil de creer, pero sí, lo creo) que quiere tratar de lograr un buen posicionamiento en el género ,eso para su suerte, lo logra."
    },
    {
      "rating": "3",
      "text": "Cliché, predictable and ultimately pointless, The Possession doesn't offer anything new to justify it's existence. Supported by average acting performances, terrible CGI effects and a lame ending, It's definitely not worth your time."
    },
    {
      "rating": "4",
      "text": "\"The Possession\" 10 Scale Rating: 4.5 (Mediocre) ...\r The Good: Not a bad idea and the film had a few creepy moments ... when they decided to actually have any creepy moments at all. For a few minutes, the film looks like it is going to be a good one as it all comes together roughly halfway through.\r The Bad: The film is just over 90 minutes, but feels much longer as it nearly grinds to a halt. A very boring movie, for the most part ... which should never happen in a horror flick. Amusing when it wasn't trying to be, I found myself laughing out loud during a couple of supposedly \"tense\" moments. Flat ending."
    },
    {
      "rating": "8",
      "text": "Sam Rami, you are perfection. This was a great movie. It was scary and disturbing, and it's a really well acted film, especially from the little girl and father. The one is worth every penny to watch, and you should buy it on dvd, because your gonna want to watch it more than once!"
    },
    {
      "rating": "9",
      "text": "In this film, which I think has become quite well-known, a young girl is attracted and ends up attaching herself too much to a mysterious wooden box full of Hebrew carvings. As her behavior changes and several people get hurt along the way, the girl's father is the first to realize that the box is the center of the whole problem. After research it, he discovers that the box is cursed and contains a spirit or demon inside, through ancient Jewish magic rituals.I saw this film recently but I already knew the true story where the film was inspired: an old wine box that supposedly trapped a spirit through Jewish magic. The story appeared on the Internet when the owners tried to sell this object and is well known to the world of Internet users and supernatural fans. I have my doubts about the veracity of these true story, but the fact is that it gave the film a good basis that that it develops very well, telling us a scary and intriguing story. It is similar to other films of exorcisms, possessions and cursed objects, a very explored genre, but it brings something original by showing Jewish beliefs and rituals instead of the much explored Catholic exorcism.The cast does what needs to be done. Jeffrey Dean Morgan, who has the lead role, is very good and has never seemed histrionic or forced. Natasha Calis, the tormented girl, gives us, in my humble opinion, one of the best children's performances in horror films I have seen in a long time. Both characters were well thought out and the way the film develops allows the audience to care about them. Kyra Sedgwick is also good but her character is annoying. I think the film takes the father's side in the marital issue that divides them, and this is reflected in the way Sedgwick's character was developed. The rest of the cast is limited to what they have to do, and Matisyahu was not happy. He takes part in the problem of that family without any clear reason (all the other Jews have left the subject), and he screams the devil's name so many times and so loudly that I got the impression that the devil must be deaf.Technically, its a discreet film. I don't know the budget, I didn't research about it, but it is possible that the producers were not swimming in dollars. The special and visual effects are there, they work, but they are discreet and without anything spectacular. The best production values is cinematography, with good fast-cut footage and lots of movement, well-placed aerial scenes and a skillful use of light and dark. We also have a soundtrack and simply excellent sound effects, which greatly intensify the tension and dramatic impact.In the middle of the garbage that is done every year in the horror genre, it is difficult to find something that is really good and worthwhile. But this film is worth it and deserves to be enjoyed."
    },
    {
      "rating": "7",
      "text": "________________  Ein guter Horrorfilm. Super. :-)) War schon unheimlich...7/10 *"
    }
  ],
  "recommendations": [
    "annabelle",
    "dark_skies",
    "insidious",
    "dead_silence",
    "insidious_chapter_2",
    "the_grudge",
    "devil",
    "the_curse_of_la_llorona",
    "malignant",
    "chernobyl_diaries",
    "the_grudge_2",
    "the_haunting_in_connecticut",
    "sinister_2",
    "cabin_fever",
    "mama",
    "it_follows",
    "ouija",
    "the_eye",
    "the_ring",
    "slender_man",
    "countdown",
    "the_conjuring",
    "it",
    "the_hills_have_eyes",
    "the_descent"
  ]
}