{
  "id": 4012,
  "title": "The Big Sick",
  "starring": [
    "Kumail Nanjiani",
    "Zoe Kazan"
  ],
  "runtime": 120,
  "genre": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "description": "Pakistan-born comedian Kumail Nanjiani and grad student Emily Gardner fall in love but struggle as their cultures clash. When Emily contracts a mysterious illness, Kumail finds himself forced to face her feisty parents, his family's expectations, and his true feelings.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qquEFkFbQX1i8Bal260EgGCnZ0f.jpg",
  "categories": {
    "plot": 7.938775510204081,
    "acting": 8.523809523809524,
    "ending": 8.125,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.215384615384615,
    "action": 7.666666666666667
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The best film so far this year. A true slice of life in a melting pot world. It is not a laugh filled show because it takes place at a comedy club but the humor is real from real people facing a tragedy."
    },
    {
      "rating": "10",
      "text": "A powerful and emotional film that touches upon topics not normally seen in romantic comedies. The assimilation of culture and what the meaning of family and love can mean to a person, what pursuing your dreams can do to your relationships to both family and significant others, finding out who you want to be despite everyone telling you you're wrong."
    },
    {
      "rating": "9",
      "text": "Easily the best romantic comedy since Silver Linings Playbook.  Just a great, great film. It's refreshing to see a comedic actor who is able to cross-over to drama - when necessary - to pull off a heavy sequence.  Kumail is really amazing in this part, and the supporting cast is phenomenal.  Ray Romano and Holly Hunter are pitch perfect casting choices.  And I love Kumail's on-screen family.  They didn't feel like comedy caricatures played for laughs.  His dad, in particular - the same guy who played the therapist in Silver Linings - is always amazing.  It's a slam-dunk summer film amidst a minefield of crappy, big-budget, comic book fare."
    },
    {
      "rating": "8",
      "text": "A funny, heartfelt movie that's fun for the entire family. Totally. Bring your 7-year old child, they'll learn a lot about Muslim culture and traditions, and its clash with Western culture and traditions. Yeppity yep. Humor gets a little dry near the end, but that's ok."
    },
    {
      "rating": "10",
      "text": "No one is more shocked than me at how much I enjoyed The Big Sick. It rises above and beyond the boring and generic rom-coms that we’re subjected to year in year out. Powerful, heart-warming and highly emotional.Based on the real life relationship between Kumail Nanjiani and Emily V. Gordon. From the moment their relationship blossoms to the difficulties arising from their contrasting families you can’t help but become fully invested in this story. The chemistry between the two main characters is electric. Although it drags a little in the middle and I don’t know what they were thinking when they came up with the title I loved The Big Sick. It’s got drama, romance, plenty of awkwardly comedic moments and if it could melt my cold heart then there’s no reason why you shouldn’t see it. Highly recommended."
    },
    {
      "rating": "10",
      "text": "This was a great, funny, heartfelt movie. I truly enjoyed it. I'm sad that there appears to be some negative review bombing going on. Make sure to read the reviews instead of just looking at the user score."
    },
    {
      "rating": "10",
      "text": "Brave, fresh and endearing, yet always felt earnest and real. Kumail Nanjiani is a rare breed of comedian who manages to stay elegant while being funny and who also delivers heavy scenes without batting an eye."
    },
    {
      "rating": "9",
      "text": "“The Big Sick” stars Kumail Nanjiani, Zoe Kazan, Holly Hunter and Ray Romano in this beautifully written story of a Pakistani would be stand up comic and a North Carolina graduate student who find themselves in a relationship that  defies  the conflicting cultures from which each is a part. What makes this film even more charming and interesting is that it is based on the true story of the two writers, Emily V. Gordon (superbly played by Ms. Kazan) and Mr. Nanjiani (who plays himself). Directed  by Michael Showalter, the film moves at an easy and pleasant pace as the lead characters find themselves in both comic and deep dramatic circumstances with the audience a more than willing participant throughout. I give this film a 9 rating and suggest that the only thing “sick” about it would be to not see it."
    },
    {
      "rating": "10",
      "text": "I really enjoyed this movie.  I kinda want to watch it again, which is a good sign that it's a great movie.  The humor is more of a subtle, witty humor more so than laugh out loud humor, so don't expect anything zany. I really liked the characters and the story is very sweet and heart warming, and it was awesome to find out at the end that it's based on a true story."
    },
    {
      "rating": "6",
      "text": "The Big Sick is an earnest movie. I just can't help but feel Apatow is cobbling together pieces of his other films. The relationship struggles of Knocked Up, getting over an illness like 50/50, and amateur comedians like Funny People. The comedy was very mild and the relationship felt lukewarm. The Pakistani struggling against his culture was interesting but the girl just seemed ordinary. These aforementioned elements have been done more intensely before. Of course they play out with little to no twist."
    },
    {
      "rating": "10",
      "text": "Really more of a 8.5 or so, but chose a 10 to offset the odd review bombing going on hereA very heartfelt film that actually brought tears to my eyes (pretty rare for me) though a little bit uneven in some respectsKumail Nanjiani was excellent in the film in particular"
    },
    {
      "rating": "5",
      "text": "More than a snooze for the first hour until the real stars and pros of the movie show up. Makes the most of every stereotype, Pakistanis, comedy club wannabes, and the stars of the movie. The only reason to see the movie is for Ray Romano and Holly Hunter."
    },
    {
      "rating": "6",
      "text": "This movie is not as great or amazing as folks are making it out to be. *Spoiler Alert* follows:The part where he goes up on stage and instead of going ahead with his comedy routine, gets all emotional, is frankly - unbelievable and hammy. It all goes downhill from there."
    },
    {
      "rating": "6",
      "text": "I'm sorry, but I just didn't understand the hype surrounding this rom-com/dramedy. Sure it had a few funny one-liners and jokes here and there, but I never laughed out loud once to be honest. I also personally felt as though most of the actors were trying too hard at times. Overall, it made me smile more than a handful of times throughout due to its good heart, but nothing else about the film really stood out to me or made me want to get too excited. Simply put, I really didn't find it too funny or memorable."
    },
    {
      "rating": "9",
      "text": "Awesome movie. Hilarious movie and a lot of serious parts mixed in beautifully. The acting was incredible and I busted out laughing multiple times. One of the better comedies I've seen in recent memory and definitely one of if not the best one of year."
    },
    {
      "rating": "9",
      "text": "So this is basically the best comedy of 2017, best way to summarise. I'm not even a big fan of romantic comedies but this barrely feels like one, it's honest and different, and super hilarious. Characters are very interesting and their issues are super real too. I seriously don't know why i didn't watch this earlier"
    },
    {
      "rating": "9",
      "text": "One can't help but conclude that there are a number of racist, xenophobic or bigoted reviews panning this wonderful movie as none of the negative user reviews are viewable.  Maybe they didn't bother actually writing a review because they are small minded racists, xenophobes or bigots.  Either way, their ratings make no sense.  This movie is funny, touching and sweet, with terrific performances and a great heart.  Kumail Nanjiani is terrific playing himself in this autobiographical romantic comedy.  Zoe Kazan is charming and perfectly believable as Emily.  Their relationship, and its ebbs and flows, feels genuine.  Holly Hunter is wonderful as Emily's mother.  You forget how good she can be in the right part.  She is a real joy to watch in this film.  Hunter sort of carries the middle of the film.  Ray Romano is fine as Emily's father, though the role is rather thankless.  Hunter's Beth is the critical parent here.  Kumail's family is played well and they are perfectly annoying and seeped in their traditions.  Kumail has to deal with racist bigots and a family who wants him to stay within their culture, even though they've transplanted to Chicago from Pakistan.  This movie has many laughs and a few tears.  The movie has an independent film feel and is bogged down with typical corporate Hollywood conventions.  It is well worth watching and I truly enjoyed it.  The 5.5 rating right now is a joke."
    },
    {
      "rating": "9",
      "text": "Best movie of the year so far BUT...“The Big Sick” is an excellent movie with only 3 negatives, two really minor and another, in my opinion, major but I got over it!The movie is being sold as a romantic comedy, which two thirds of it is, but a major third is the drama and all are in equal parts. With Kumail Nanjiani, who I am familiar with from the HBO show “Silicon Valley”, starring and Judd Apatow producing I expected a lot of laughs and they are delivered in grins, smiles, laughs, out loud guffaws along with nods of the head that derive from real moments in life that all can identify. The drama also gets the spotlight and in some scenes you will be crying and laughing at the same time while in others the tears will flow. Yes the romance is there and it is as romantic as in any film you have seen.The two really minor negatives, surprisingly, are the stand up routines by the real in life stand up comics Aidy Bryant, Kurt Braunohler and Bo Burnham and the interactions between them and Kumail but none really take up that much time.Not getting into the screenplay itself, written by Nanjiani and his real wife Emily V. Gordon and based on their true romance, the acting is some of the finest from the whole cast including what would be considered minor roles such as the nurse played by Myra Lucretia Taylor and Kuhoo Verma as a potential bride.  Anupan Kher and Zenobia as his parents could teach today’s parents in how to make your child feel guilty, especially the mother.A big discovery for me was Zoe Kazan who I don’t recall seeing before. She makes Emily a real person whether it be in her kookiness, ‘only having sex once the first time with somebody’, who is going to be a therapist and in some scenes could really use therapy. She makes a lasting impression any time she is on screen but also has you thinking of her when she is not in a scene.Ray Romano has never caught my attention as I was usually more interested in his co-stars, whether on television or movies, but here as a father, referring to his daughter, says “Being a parent is a nightmare. Loving somebody this much sucks” he is funny and heartbreaking sometimes in the same sentence.I could talk for days about Holly Hunter’s performance in “Big Sick”. She appears on screen about 30-40 minutes into the film and steals every scene from everyone in the film for the rest of the film. No way do you want to get her teed off in a comic club because no matter how tall or big you are you aren’t going to win! Don’t you dare hurt her daughter because you will get her wrath, sneers and coldness but show her daughter love and with one gesture you know you will never be able to do anything wrong again. I certainly hope she is remembered at award time.Yes Kumail Nanjiani is playing himself, even being called Kumail, but you get to know more than the comedian. You get to know the man, the actor, the writer, the comedian, the man who can woo women with doe eyes, a smile and caring. I hope he gets to do more roles where he is involved as a person who happens to also be a comedian or not.The “The Big Sick” is a must see movie and be prepared to laugh, cry and, yes, experience the drama of the title."
    },
    {
      "rating": "8",
      "text": "In writing, it is said that it is best to write what you know. That way, you can bring that authentic and real emotion, feeling, and touch to the events depicted. Perhaps no recent film has better embodied this than The Big Sick. Though directed by Michael Showalter, this is really Kumail Nanjiani and Emily Gordon's show. The married pair of screenwriters who sat down and put the story of their meeting, Emily's illness, the issues regarding a Pakistani immigrant and American girl dating, and their eventual reunion. Wherever they may take liberties with their own story to make it more cinematic - if these moments exist - does nothing to stamp out the way in which the film deftly handles a variety of issues. Whatever bridge is tries to cross, it does so running. Finding the comedy in joy, sadness, pain, rejection, and anxiety, The Big Sick is often a profound and moving experience, but is always a thoroughly enjoyable one. How it manages to become this is because of one simple fact: Nanjiani and Gordon were there, so they know how it all felt.Kumail Nanjiani is this romantic comedy with Zoe Kazan starring as Kumail's real wife, Emily. A Pakistani immigrant, Kumail is a stand-up comedian who must cope with his family's strict religious beliefs and fervent desire for him to meet a Pakistani girl. Along the way, he meets cute with Emily and the two quickly hit it off. In portraying the issues Kumail has with his family and how it impacts his relationship, The Big Sick benefits greatly from being written by those who experienced the feeling. As a result of Kumail's family, their relationship is highly complex. If they stay together, then Kumail is exiled from his family and Emily feels remorse for being the cause behind him losing his family. However, if they keep their relationship hidden as Kumail intends, then Emily is hurt as it makes it feel as though he does not want her in the way that she wants him. It is a slippery slope and one that must be confronted. Having everyone walk away happy is likely improbable due to the steep barrier of culture keeping them apart. Worsening the situation is all of the little intricacies of which they remain blissfully unaware, highlighted by Kumail having to constantly explain arranged marriage to Emily and those around them. This gulf in culture, no matter how Americanized Kumail has become, will always be there and must be approached cautiously by both sides.Where the film really soars, however, is when Emily is not even there. Zoe Kazan is fantastic, but the film becomes quite profound when Kumail is thrust into a situation where he must cope with Emily's illness and meeting her parents. Terry (Ray Romano) and Beth (Holly Hunter) rush from North Carolina to care for their daughter as she fights off a mystery illness and also meet Kumail for the first time. Reeling from the two breaking up due to Kumail's unwillingness to lose his family and Emily's unwillingness to make him lose his family, it is a rather awkward situation for him with Beth knowing all of the sordid details, including Kumail's lying and dishonesty regarding his family. Thus, tensions run quite high initially before they come to bond over one thing: Emily. Their love, care, fear, and pain, that is shared with each ebb and flow of her illness and the frustration felt when the doctors are clueless, brings them together. They reach deep within themselves to overcome this and the writing by Nanjiani and Gordon is raw, emotional, and powerful. This area is perhaps mostly driven by Nanjiani considering Gordon was not there, but the film nonetheless captures the emotions of everybody involved brilliantly. Watching a loved one fight an illness is a truly helpless feeling, worsened when doctors are unsure why it is happening (which is always). The Big Sick never feels exploitative, is smartly written in this arena, and captures both the light moments that bring a smile to your face - Beth showing old high school photos of Emily in her \"goth phase\" to Kumail - and the shared sadness when the news is particularly hard. All of this culminates into the greatest release: Emily overcoming his illness.Though a true story and obviously going to end up with Kumail and Emily being together, the film smartly never falls into the trap of rushing them back together when she overcomes her illness. As she fights, the film lays the groundwork for this in its inclusion of Terry's infidelity. It is clear before this reveal that Terry and Beth are constantly at one another's throats. In hearing it from Terry, he was forgiven by her but she never let go of it and never was able to overcome her hurt from his transgression. For his part, he still hates himself for what he did to her. It is a slow process of healing for their relationship with both sleeping in separate beds. Taking years of healing, The Big Sick sums it up quite neatly with Beth coming back into Terry's bed, but it highlights the slow build-up."
    },
    {
      "rating": "5",
      "text": "Overall this was not a very witty or perceptive film, but rather self-indulgent and with a passive hero who seemed to take forever to get his act together (literally). It could have been much improved by someone having the discipline to snip out at least 30 minutes – it was really not necessary to tell the story in such excruciating detail. Luckily the plot was stolen by Ray Romano and Holly Hunter (was the Romano-Hunter dialogue better or were they just better comic actors?), but when they were not on screen, things dragged. The coma went on much too long until it was suddenly over.  For me the biggest disappointment was the clichéd way in which the Pakistani-American family was treated where some insight would have been greatly appreciated and a public service. And why is this film called a romance when the love interest spent most of the film off-screen? Plus the hero seemed more charmed by her parents than the girlfriend. But then he spent a lot more time with them."
    },
    {
      "rating": "9",
      "text": "A charming yet edgy romantic comedy that breathes new life into a genre that has grown progressively tiresome and stale. Based on the protagonist's own unusual courtship experience, the film takes chances that movies of this ilk are seldom willing to do. Despite a slight tendency to drag a bit in the final 30 minutes, this fresh, lively offering features fine performances all around (especially by Holly Hunter and Ray Romano in strong supporting roles) and raucously funny bits not typical of rom-coms. See this one -- you won't regret it."
    },
    {
      "rating": "9",
      "text": "This is a kind of modern day \"Guess Who's Coming to Dinner\" where the uncomfortable family is Pakistani and the outsider is a white, American co-ed. The humor is a little off-the-wall, and takes some warming up to, but once you're in, you're in deep with the sharp acting and writing. A feel good movie in these divisive times."
    },
    {
      "rating": "10",
      "text": "Great movie and engaging story. So far one of the best movies of 2017. Kumail Nanjiani and Emily Gordon have written this movie based on their life story.Don't mind the bigotted people's negative reviews for no reason on this movie."
    },
    {
      "rating": "10",
      "text": "The perfect date movie no matter how long your relationship. The actors did a magnificent job. The writers really shine. And the director and crew make every scene feel authentic. Job well done to all, especially to Kumail and Emily (the real one and to Zoe)."
    },
    {
      "rating": "10",
      "text": "This film is a revelation that is part romantic comedy, part drama to perfection.  Kumail Nanjiani is hilarious, but he also has this awkward approach that really endears you to him.  Zoe Kazan is also great and there chemistry together is amazing.  It was great to see Holly Hunter and Ray Romano in this film as well.  Some of the scenes between them and Kumail were some of the best in the movie.  Overall I really have no negatives for this film, while some may say it was a little long in the third act I was enjoying myself so much I didn't care.  A+"
    },
    {
      "rating": "9",
      "text": "This is a wonderful movie!  I really enjoyed it, start to finish.  Loved seeing the contrast between the two families and the cultural differences.  The fact that it is a true story makes it so much more fun to watch.  Kumail Nanjiani stars as himself, a Pakistani stand up comic just trying to get noticed in Chicago.  One night he is \"heckled\" by an American girl, Emily, who catches his eye.  They definitely have a spark between them, but love is not always easy, as they find out.  We see Kumail with his family at dinner where his mother always acts surprised when another one of her Pakistani prospective brides \"drops by\".  Kumail knows if he pursues a serious romance with Emily, he will lose his family.  They will disown him.  Through circumstances, Kumail meets Emily's parents, wonderfully played by Ray Romano and Holly Hunter.   Their first meeting does not go well.  Holly Hunter is often hilarious as she says whatever is on her mind.  Everone is oerfect i their role and the story is interesting and fun.  Loved it!"
    },
    {
      "rating": "7",
      "text": "There’s a lot to root for in ‘The Big Sick.’  Not a lot of small budget romance-drama-comedies (romdramadies?) receive such publicity or praise this time of year.The film premiered at Sundance and started a bidding war for the distribution rights between Sony, Focus Features, Amazon, and Netflix, which certainly must have made the producers feel like the pretty girl at the prom (Amazon ultimately won with a $12 million bid).Co-creator, co-producer, co-writer, and co-star Kumail “Coco” Nanjiani—along with the rest of the cast—turn in great performances.  Considering the story is based on Nanjiani’s real-life dating experiences and subsequent marriage, it should come as no surprise that he delivers a heartfelt, authentic turn as a young immigrant looking to break free from the bonds of tradition.Unfortunately, there are just too many times when the plot veers into unrealistic territory.  For example, what parents would visit a comedy club while their daughter is in a coma, especially with surgery scheduled for the next day?  None that I know.  Furthermore, the writing just isn’t as funny or witty or incisive as all the mid-summer hype might suggest.  However, there are times when the film feels like a refreshing respite amongst all the super-budget action flicks currently flooding local cinemas.  And, if nothing else, it’s a good movie to support for those who want to send a message to Hollywood that they need a greater emphasis on making original, auteur-driven films."
    },
    {
      "rating": "6",
      "text": "Comic Kumail Nanjiani and his real-life wife Emily V. Gordon wrote this story from their life experience. He's a Pakistani Muslim who's expected to marry one of his own kind, but his relationship with a white girl (Zoe Kazan) causes concern. When she becomes extremely ill, this complicates matters with his family and hers. Considering that Nanjaini & Gordon both write comedy for a living, this film isn't very funny. Sure, it's lighthearted and charming, but lacking in laffs. Once the drama kicks in, the pace drags. Sure, it's a sweet story and well-told, but it lacks that extra spark that would have made it a disarming romantic comedy."
    },
    {
      "rating": "7",
      "text": "Carol Burnett once said, “comedy is tragedy plus time,” a theory that gladly speaks for itself in the personal testimony written and starred by Kumail Nanjiani in his cinematic standup performance: The Big Sick.Everything Kumail narrates about his background resembles a comedy show’s beats: first, he briefly tells about his history with a grainy yellow-tinted film reel of Pakistan accompanied by his childhood photos; then, he goes through the highs and lows of his new romance with Emily, the White woman he falls for after she shouts at him from inside the audience. He helps us listeners to emphasize with his memories by showing their first awkward talk about high school embarrassments. Their secretive dates begin with her positioned in the car’s backseat and end with an awkward hug, their conversations intimate enough to place you in the moment. She is divorced, he is forced by his parents into meeting other potential wives from his home country, and his passive acceptance of the family standard hurts her. Unfortunately, he gets no chance to apologize to her, since a possibly fatal disease puts her into a coma.Therefore, this movie resembles a drama more closely than a comedy, because we experience the moment how it felt to him, minus time.Alongside the key story, Kumail also strives to teach us more about Paki culture, only after he openly mocks his family’s expectations to worship Allah. Other minor quirks of a standup routine are spiced in for extra flavor in the atmosphere: he laughs, he cries, racist comments are thrown at him, and we even hear his other comedian friends tell their catastrophic backstories, plus time.Under the wrong hands, Kumail’s story would have fallen into a schmaltzy, predictable rom-com trap. But nope, you continue to guess whether the two end up together. Some little visual stimulators make you want to see good bloom out of the turmoil, such as Kumail listening to every voicemail Emily sent him.Instead of resorting to attractive A-listers for the leads, the casting director got whoever best fit the requirements to play the roles, and thankfully the casting director had good taste. Kumail deserves more attention after his acting endeavor, as even something non-story related like him losing his cool over a fast food order communicates his inner condition. Everyone else gives fantastic performances too, expressing distinct reactions to Emily’s predicament as the walls close in on them. Although the most real performance was Holly Hunter, who played Emily’s mother; she does not play a stereotypically frustrated old woman, but displays an even balance between happy and sad moments. Expect to see her name in the Oscar lineup come January.Just don’t expect to see any awards in the technical categories. The clearly low budget was no problem itself, except minimal effort exploited the minimal resources to generate any stunning visuals besides plain white, apart from the orange Paki home. The lack of artistic care made this look like every other rom-com out there, yet the enjoyment remains intact.However, the jarring editing work might interfere with the enjoyment. The editor, Robert Nassau, rarely kept the actors’ positions consistent between shots, several of which ran too short to support the mood consistency. The sound editors deserve some blame to share too, for the voices talk over each other too much during conversations that were not meant to sound heated.You may notice several other bothersome issues; it could be the standard, unromantic musical score by Michael Andrews (Donnie Darko), or the way it stereotypes fraternity boys, but perfection still drifts a long way from shore.Although that matters little—I applaud Kumail Nanjiani for bravely sharing the most difficult period of his life with all of us. Based on my personal experience, the best stories come from real life, so we each should see The Big Sick to learn more about the meaning of love. Especially if you’re unsure about your role in the American dream, I for one recommend taking your significant other to hear a remarkable testimony by a greatly valiant soul."
    },
    {
      "rating": "3",
      "text": "Extremely cheap and shallow, with cringe-worthy performance. I used to over-hyped movies, but this looks like the new era of stupidity. People called this fresh. What kind of stale pieces of sh*t they have to watch to do that, is beyond me."
    },
    {
      "rating": "6",
      "text": "I saw this film because I’m a huge Kumail Nanjiani fan, but I found it disappointing. First of all, everything about it reeks of its producer Judd Apatow. And while I usually like Apatow’s films, his approach doesn’t work with this subject matter. In addition, Nanjiani’s cerebral brand of humor gets dumbed down. But what bothers me above all is the fact that while the film pretends to be in part about “tolerance” and the way Nanjiani’s character strikes up a relationship with his comatose white girlfriend’s parents  (and thus with middle-class white America at large), this is rendered possible only by the fact that his character renounces EVERYTHING about his Pakistani origins. The film’s message seems to be: white Christian Americans can sympathize with Muslims and /or south Asian or middle Eastern types , but only if the latter reject everything about their own culture in order to assimilate completely to ours. This is an empty sort of “tolerance” that allows for no compromise. The Big Sick lets middle class white Americans feel good about their “tolerance” while in reality not asking them to expand their imaginations at all. And I say this as a middle-class white American myself."
    },
    {
      "rating": "7",
      "text": "A pretty good rom com that doesn't do anything special, but what it does do it does because it wants to and has something to say and that seems to be enough here. It also reminded me how much I miss Ray Romano and Holly Hunter - I would have never guessed."
    },
    {
      "rating": "8",
      "text": "The romantic comedy of the year which is full of hilariously funny and genuinely touching moments (it is based on a true story after all) and on my list of those that I would happily sit to watch again if given the opportunity."
    },
    {
      "rating": "8",
      "text": "The Big Sick...To be frank, in the beginning I didn't know what to expect from this non-blockbuster movie. I watched the trailer, read some reviews and was looking forward to see how this movie would surprise me (since it impressed so many people - imdb, rottentomatoes, metacritic).The combination of real life events and how they occur in movies is really something hard to master. Michael Showalter did just that...The actors were amazing, the story was amazing, and there was a more than captivating energy based on a balance between comedy and drama that really gave me the chills (in some moments) while also keeping me on the edge of my seat.By the end of the movie I am pleased to say that it more than fascinated / intrigued me on multiple levels and I am pleased about it being considered for multiple Oscar nominations.I am new at this review \"thing\", so please feel free to share your thoughts on my review. Thank you!"
    },
    {
      "rating": "10",
      "text": "I go to movies frequently and it's been a long time since characters in a movie moved me like they do in this movie. Both sets of parents were believable in their different dilemmas for the young couple who are a mismatch to the parents and to themselves. I found it very funny and it's always good to laugh especially when it's about people's deficiencies. Laughter is often the best way to overcome situations people don't understand, i.e., different cultures, different traditions, and racial issues."
    },
    {
      "rating": "8",
      "text": "Man, i feel as if the \"big sick\" is probably gonna be one of those flicks that's sadly forgotten by a lot of people. It's just a truly beautiful flick about love and family, and the hardships and problems that come with it. But what really sets this flick apart from other films is the cultural aspect of the film, and also the way it allows u to meet and understand the parents of the two leads, and just tells this awful unorthodox complicated romantic story that is absolutely hilarious, as well as relievent and touching.  It's just a very fascinating film that honestly, sadly, might not be seen by so many people. So please, do yourself a favor and go see \"The Big Sick\" it's easily one of the best films of the year."
    },
    {
      "rating": "9",
      "text": "\"The Big Sick\" was a true delightful treat to watch. Backed-up with amazing performances from the whole cast, the plotline sheds light on a very important social aspect that stops this film from being an average rom-com and turns it into a truly thought-provoking relatable movie, that takes on a story, although already depicted in previous movies, in a fresh way with new light. Not only does it discuss a `forbidden` inter-racial relationship, but it also focuses on the relationship between the boyfriend and his girlfriend's parents, rather than with the girlfriend herself, and that's new and original. The characters are very lovable (Emily's parents are my absolute favorites, I loved them), and the humor makes you giggle all while staying so simple and charmingly-effortless. The two-hours length is surprisingly well-fitting, for the film was made to entertain during each second of them. Truly a heartfelt and emotional film, it is definitely a must-see!"
    },
    {
      "rating": "8",
      "text": "The phrase \"art imitating life\" has almost never been applied so literally in any movie I've seen in recent memory, for real life subjects and screenplay co-writers Emily V. Gordon and Kumail Nanjiani successfully spin a yarn that's not only uniquely and undeniably their own, but one that's earnest, warm, heartfelt, and uncommonly funny. Major props also go to the sure-handed direction from Michael Showalter and some memorable supporting turns from both Holly Hunter and Ray Romano."
    },
    {
      "rating": "9",
      "text": "“The Big Sick” is heartfelt, heartbreaking hilarious, and accurate. No moment feels manufactured. The writing, directing, and performances are phenomenal."
    },
    {
      "rating": "8",
      "text": "Great movie because it's a really unique mix of seriousness and comedy, but I would've loved a few huge laughs.  Super solid movie."
    },
    {
      "rating": "5",
      "text": "While a love story between a minority young man and a white girl seems original, the outcome of the story often seems predictable. Funny at times, Nanjiani does underscore the important racial problems and family dynamics well, but falls short on the actual plot line with his relationship with Emily."
    },
    {
      "rating": "7",
      "text": "I am afraid this movie is not as appealing to myself as an asian. I understand this movie could be a culture shock to American, European or Australian, but to asian, it was the norm back in a 100 years time. Parents would arrange marriage and apply family pressure to their kids. In addition, the pressure about career for asian is probably no less than Kumail in the movie, and it is not even funny and I am still a disgrace to my family in terms of career choice.I do agree the view from Kumail about how their people behave as where they are from instead of being American, which is a rare opinion. As a Chinese in Australia, I have seen 99% of Chinese would hang our with Chinese in China town, talk Chinese, eat Chinese food. And they would never interact with the local community at all. Some of them would have never watched a T20 or football game despite they live in Australia for more than 10 or so years. I try hard to be part of the community, and tbh it is not as difficult in Australia because the Aussie are generally not racist. I get most of the jokes, and they are not as funny, whereas I find the situation / interaction between people is funnier. I would recommend you to watch it."
    },
    {
      "rating": "8",
      "text": "Not being one for romantic comedies, I was nevertheless thoroughly charmed by this delightfully funny and poignant film. Based on the true story of how Nanjiani met Emily, the compelling storyline is driven by the exceptional script, with the dry humour and a unique cultural context ensuring that there are some moving and hilarious moments throughout. Nicely paced, with excellent performances, this is an entertaining and personal story that is well worth your time. 8.48/10"
    },
    {
      "rating": "9",
      "text": "\"The Big Sick\" was a very good movie, the performances were excellent and the plot together with the subplots have managed to entertain me. It was a funny movie with a beautiful and inspiring message."
    },
    {
      "rating": "9",
      "text": "Was this show funny? No, not really. There were maybe a couple laugh out loud moments but surely you would get a lot more laughs if you just went to an average comedy. Regardless this is a good movie. Coming from someone who hates romance films, this film got it right. It was a lot different from many other romance films you'll see. If anything this is more of a romantic drama than a rom-com. The film does a great job setting up the familial relationships between it's two main characters and in fact this is more of the focus than their romance. I can see how some could fault the movie for this, but it is through these familial relationships that both the audience and the main character come to understand the relationship. Kumail (the lead) comes to understand that the problems in his Pakistani family and his cultures views on marriage are not just a product of his culture, but exist in the american culture of his girlfriend. And through this he learns that he can either choose to be like the hard but rewarding relationship like his girlfriend's parents, or he can settle into a safe marriage like his brother. The film is not saying that one is better than the other, but Kumail himself has a speech about how he needs to do things his own way. Normally I don't like this PC we are all not so different stuff. But for some reason I found the message this time oddly refreshing. My only main complaint for this movie is the frat boy scene in the comedy club. That scene felt very out of place and over done. Regardless this is clearly one of the best films out right now."
    },
    {
      "rating": "7",
      "text": "Perhaps my expectations were simply too high; but this film really didn't blow me away. It is on the line between \"fine\" and \"pretty good\", but I am settling on a 7/10. Sure, it is a charming little film and the characters are likeable, but that doesn't really add up to an amazing film. As a comedy, it isn't particularly laugh out loud funny. There are a few one-liners you'll smile or maybe even get a laugh or two out of. As a drama, it isn't particularly gripping (perhaps because we know that it is going to be a happy ending so you don't have to worry about something tragic happening). I wouldn't discourage anybody from watching it, but I don't think I'll remember it much in a year... or a month."
    },
    {
      "rating": "8",
      "text": "This is a smart film for 2017. Consider the association between Pakistan and terrorism then take a Pakistani leading man and make him funny and likable. The humor is great but subtle. The barriers that need to be broken down for a Muslim to fall in love with a \"westerner\" prove to be hilarious. His family and her family are priceless. Great cameos by his parents and her parents, Holly Hunter and Ray Romano. This movie is well intentioned and entertaining. What more do you need ?"
    },
    {
      "rating": "10",
      "text": "Hilarious. Genuine. Contemporary. I don't know how you could not like the main actor, he is one of the most likable characters I've seen in a while. One can only hope there's more to come..."
    },
    {
      "rating": "8",
      "text": "Warm heart-felt comedy about people from two different cultural backgrounds trying to work out their relationship. Well directed and acted and has a contemporary indie feel to it. Only negative I would say is it isn't as filled with humour as I thought, and leans more towards the drama side."
    },
    {
      "rating": "9",
      "text": "Great date movie.  The first act of this movie is nothing short, of a realistic, funny, romantic, charming amazing love story.  The following acts are not bad, they are still amazing but there is a point in the movie where it feels more like a movie than it does a real story.  Normally not an issue, but it is when the movie felt like sooo real.  It's still incredible though, Holly Hunter and Ray Romano being the parents were incredible, great acting and fun to watch.  The jokes land, you care for the characters, the ending drags a bit but isn't bad, and it does feel real.  And really charming."
    }
  ],
  "recommendations": [
    "instant_family",
    "me_before_you",
    "love_actually",
    "captain_fantastic",
    "the_intern",
    "little_miss_sunshine",
    "the_edge_of_seventeen",
    "the_perks_of_being_a_wallflower",
    "silver_linings_playbook",
    "about_time",
    "five_feet_apart",
    "me_and_earl_and_the_dying_girl",
    "jojo_rabbit",
    "moonrise_kingdom",
    "the_glass_castle",
    "seeking_a_friend_for_the_end_of_the_world",
    "lady_bird",
    "fighting_with_my_family",
    "the_upside",
    "the_spectacular_now",
    "the_help",
    "blue_valentine",
    "wonder",
    "eddie_the_eagle",
    "the_notebook"
  ]
}