{
  "id": 3503,
  "title": "The Bounty Hunter",
  "starring": [
    "Gerard Butler",
    "Jennifer Aniston"
  ],
  "runtime": 110,
  "genre": [
    "Comedy",
    "Action",
    "Romance"
  ],
  "description": "A revered bounty hunter's latest gig is rather satisfying, as his bail-skipper is his ex-wife, who has no intention of getting nabbed without a fight.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fJPKar0jnAsS09l3xfP6LL8sUkX.jpg",
  "categories": {
    "plot": 2.5,
    "acting": 3.9,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 2.6666666666666665,
    "action": 3.5
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Okay The Bounty Hunter is a premise that shouldn't have been put to screen in the first place, but then you got Gerard Butler and Jennifer Aniston and you think maybe. Then you watch it they have simply no chemistry and the film is so badly written it isn't funny. It isn't bad enough to be good. I give this movie 13%."
    },
    {
      "rating": "2",
      "text": "There is not much to like in this pretty awful romantic \"comedy\" that does not have a single intentionally funny thing to laugh at. The story is predictable and cliched, the dialogue is laughably bad, and not even Jason Sudeikis (great on \"SNL\" and \"30 Rock\") can bring any humor to this."
    },
    {
      "rating": "1",
      "text": "God, I hope Ms. Anniston and Mr. Butler should've just started action movies or a drama instead of wasteless piece of crap are Jennifer Anniston rom-coms. Can we please get a \"Friends\" movie or something because you are way spending too much money on these Gucci shoes? I really don't like Jennifer Anniston and it's time for her to give it up because \"The Bounty Hunter\" is one of the most absolute drenched-up movies of all time."
    },
    {
      "rating": "2",
      "text": "Oh my god, what is this? \"The Bounty Hunter\" isn't even a rom-com movie with guy catches girl and girl catches guy thing. It's a movie that is filled with idiotic dialogue and stupid-ass acting. A true movie goer will know what I mean."
    },
    {
      "rating": "10",
      "text": "This is the IDEAL flick for people who are bored of watching Robert De Niro  Charles Grodin's scrotummy old faces every Christmas when Midnight Run is on the telly. That was well overdue a remake and the Hollywood guys have delivered in spades. There's a bit of a twist this time tho. The bounty is on a girl and the bounty hunter is her ex boyfriend. You can understand how awkward it's gonna be when they're cuffed together for the duration of the film. Comedy actors Gerard Butler and Jennifer Aniston positively sizzle throughout... on-screen and off. That's method acting."
    },
    {
      "rating": "2",
      "text": "Jennifer Aniston will be in anything.And i mean anything.She is the only thing that kept me watching this dead end, dreadfully boring film that its only good part is where she grabs her breasts, other than that, the film is pretty terrible"
    },
    {
      "rating": "8",
      "text": "Don't understand the hate for this film. I appreciate the actors and the characters they play. It's funny, romantic, bit of action here and there and simply ticks all the boxes of a romantic comedy. Recommended to couples for date nights. I would gladly watch this again and again."
    },
    {
      "rating": "2",
      "text": "Save your money. Instead rent this at a REDBOX as a \"safe\" movie for a couple, if nothing else is available. The movie contains just a teeny tiny touch of action for the male and a smidgen of believable romance for the female, although both elements are done poorly. With all the hype of the stars' off-screen romance and the oft-repeated trailer on TV, I was looking forward to this movie. This is my first movie critique -- I was so disappointed I felt it necessary to warn others."
    },
    {
      "rating": "2",
      "text": "It's the same old stuff nothing new, the more the see Jen, i realize she can't act I am sorry its the same old boring acting boring."
    },
    {
      "rating": "4",
      "text": "If you have nothing better to do and you just want to waste time then this movie is great for you. It's not painful to watch like twilight, but it isn't anything like a decent movie."
    },
    {
      "rating": "0",
      "text": "This is the worst film I have seen in 20 years. I never laughed. I didn't care. The characters were unlikeable. The plot was unbelievable. The writing was intolerable. People who see this film may not want to return to the theater for months. A dreadful, awful, cruel waste of time and money."
    },
    {
      "rating": "1",
      "text": "Just watching the trailer said it all. Sure it has Jennifer Aniston and Gerard Butler, but the script/plot stinks so much that I pretty much left the movie theater after 20 minutes of watching it."
    },
    {
      "rating": "0",
      "text": "Horrible movie, make sure the Razzie Awards voters will make this movie the biggest winner of 2011!"
    },
    {
      "rating": "3",
      "text": "Saw it. Trust me, the bad reviews are well earned. Although a sucker for romantic comedies might find it tolerable."
    },
    {
      "rating": "0",
      "text": "Absolute rubbish. Waste of time and money. Why bother when the actors just go through the motions for a pay cheque and fame. Con."
    },
    {
      "rating": "0",
      "text": "Can't say I saw the entire motion picture, as it was so horrible I had to leave the cinematorium before it's end. Both the humor and the serious elements in this motion picture are horrible, and it's the worst romantic comedy since Titanic."
    },
    {
      "rating": "3",
      "text": "Nicole, an investigative journalist lucky enough to still be writing for a newspaper, skips her mandated court appearance so she can work on her story, and becomes a fugitive of the law. Since her crime is barely a misdemeanor, it seems a bit overblown that a bounty hunter would be warranted for such a minor offense. This is a police matter, or a PETA concern, but Milo, a former cop, is given the assignment and rejoices at the opportunity to track down his ex-wife. Going into this film, the moviegoer already knows that the bounty hunter will get his woman in more ways than one. It's the chase, the pursuit of the bounty hunter's former spouse, like a domesticized version of Andrew Davis' \"The Fugitive\" that might have given this film some heat, had Nicole been hard to outfox. She's not; she's too easy to find. \"The Bounty Hunter\" is a comedy all right, but it's the wrong kind: romantic instead of screwball. Even though he incapacitates Nicole by throwing her in a trunk, and she tasers Milo in a motel room(dealbreakers both for most reconciling couples), the old feelings return, as the film jettisons its premise in favor of a routine crime drama, where the bounty hunter becomes \"Her Boy Friday\" instead. There's at least one storyline too many, as this tired film completely loses its footing when Milo stops hunting Nicole, and hunts her bounty instead in tandem. \"The Bounty Hunter\" should have been an all-out war of the sexes: the woman constantly outsmarting the man, like Jane Sibbett in an episode of \"Quantum Leap\", where she's always one step ahead of the sheriff's body that Sam(Scott Bakula) inherits."
    },
    {
      "rating": "1",
      "text": "Ooouuuccchhh. This movie is terrible. Bad doing Bad things. You have to like RomComs in order just to even accept what is going on. Definitely not the worse (cue: Sandra Bullock) BUT DEFINITELY NOT GOOD."
    },
    {
      "rating": "0",
      "text": "The same pile of crap that has been made over and over (and over). Every scene is predictable, i guessed the entire movie from just the poster, i was right about all of it."
    },
    {
      "rating": "4",
      "text": "While the film does not really have anything particularly good about it, it does not have anything particularly bad about it either. Going into the film with the expectation to laugh and be entertained a lot will definitely produce a disappointment. There is, really, barely anything that is funny about the film at all, so that is a let-down.The screenplay is rather messy, with really boring dialogue and a rather confusing and unnecessary mixture of different characters and side-stories that come into it. The acting was.. well, what you'd expect of Aniston and Butler - not very much.Nevertheless, I cannot give this film a straight-out negative grade, just because of the fact that the film did not leave such a strong (or negative) impression on me. Actually, it did not leave any impression on me what-so-ever.It's one of those films that one can watch if you're bored one afternoon and it's on TV. You won't like it, but you won't hate it either."
    },
    {
      "rating": "1",
      "text": "I have seen my share of bad movies but this one knocks it out of the park big time. I was not entertain people I was bored out of my mind. I ask the same question that my favorite critic Roger Ebert asked. Why was this movie necessary, why was it made. Iâ"
    },
    {
      "rating": "1",
      "text": "Yet another movie for morons.  It continues to be a downhill slide for Jennifer Aniston who finds new ways to carve out bad decisions in selecting films.  She was so good in \"The Good Girl\" and respectable in \"Friends with Money\" and \"The Break-Up.\"  Other than that, whoever is picking vehicles to showcase any talent she may have continues to fail...miserably.  I won't even go into Gerard Butler who is immensely overrated and an absolute pathetic actor."
    },
    {
      "rating": "4",
      "text": "Another movie lately that was given hype that it was going to be very funny and again it was just okay. This i will say had the chance to actually be a good movie but i think there needed to be some rewrite areas that would have made it better. A little better action scenes and actually put the comedy into it."
    },
    {
      "rating": "2",
      "text": "I always have such high expectations for Jennifer Aniston. Maybe that is part of the problem, but this movie was terrible. It was almost like a \"Mr. and Mrs. Smith\" wannabe - and I see the connection, but if you want a troubled marriage combined with action then watch that instead. It was very predictable with a silly storyline that doesn't even try to pretend the couple won't end up together in the end."
    },
    {
      "rating": "2",
      "text": "Even with its starring cast -- Gerard Butler and Jennifer Aniston -- The Bounty Hunter is unfunny, predictable, and ridiculously cliched, igniting not even the tiniest spark of chemistry between Butler and Aniston."
    },
    {
      "rating": "4",
      "text": "A very big disappointment of what could have been a great movie."
    },
    {
      "rating": "2",
      "text": "A horrible mixture of romance, cuffs, a mediocre actress and actor, lame plot; well, that's a recipe for an ugly movie. The film at its best is a guilty pleasure that doesn't seem to work on any type of level. There's no redemption for this piece of crap. I'm at a loss for words.\rDiagnosis: Pass."
    },
    {
      "rating": "4",
      "text": "The Bounty Hunter is one of the those films that tries to cross genres and blend different types of humor, but it fails miserably as the jokes fall flat and the action is lame."
    },
    {
      "rating": "0",
      "text": "Okay The Bounty Hunter is a premise that shouldn't have been put to screen in the first place, but then you got Gerard Butler and Jennifer Aniston and you think maybe. Then you watch it they have simply no chemistry and the film is so badly written it isn't funny. It isn't bad enough to be good. I give this movie 13%."
    },
    {
      "rating": "8",
      "text": "Love the concept of this movie. Really funny. I bet all husband's all over the world would love to hunt down and arrest their wife or ex-wife, and lock them up and throw away the key. And also get paid for doing it. That would be awesome."
    }
  ],
  "recommendations": [
    "thunder_force",
    "trainwreck",
    "killers",
    "this_means_war",
    "couples_retreat",
    "baywatch",
    "the_proposal",
    "no_strings_attached",
    "tammy",
    "little_fockers",
    "paul_blart_mall_cop",
    "30_minutes_or_less",
    "identity_thief",
    "ride_along",
    "the_change_up",
    "the_hangover_part_ii",
    "the_tax_collector",
    "27_dresses",
    "the_bye_bye_man",
    "second_act",
    "good_luck_chuck",
    "the_boy_next_door",
    "abduction",
    "confessions_of_a_shopaholic",
    "the_hangover_part_iii"
  ]
}