{
  "id": 852,
  "title": "The Three Stooges",
  "starring": [
    "Sean Hayes",
    "Will Sasso"
  ],
  "runtime": 92,
  "genre": [
    "Comedy"
  ],
  "description": "While trying to save their childhood orphanage, Moe, Larry and Curly inadvertently stumble into a murder plot and wind up starring in a reality TV show.",
  "releaseYear": "2012",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/b0nNQCL90RGTwjxLEFsFFLQZKNe.jpg",
  "categories": {
    "plot": 6.722222222222222,
    "acting": 6.421052631578948,
    "ending": 6.8,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.5,
    "funny": 7.452830188679245,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie stayed true to the show. Unlike the Little Rascal's Remake, This movie didn't mess up. From the minute it started the whole room was laughing. Go Watch, keep an open mind, and get ready to laugh your socks off!"
    },
    {
      "rating": "8",
      "text": "Those who did not grow up with The Three Stooges may wonder what it's all about.  But for the rest of us it was a touchstone to earlier times.  Great slapstick and old time old style jokes that are clever and funny.  At the end of the movie many viewers applauded.  If your looking for meaning you will be disappointed.  If you get a popcorn and soda and just let yourself go with it, you will love it."
    },
    {
      "rating": "9",
      "text": "\"The Three Stooges\" is a miracle. The humor not only stays true to the original, but updates it for modern times in a way that makes the slapstick genre feel fresh."
    },
    {
      "rating": "9",
      "text": "First off, I would give this a  9.25 out of 10. It's amazing how close the actors did to the three stooges. Everyone else also did a good job. score is cornky. Surprisingly has a good story. You would think it would be stupid, but it's actually good. Overall, this is a great family movie that everyone should see. This movie is for anyone."
    },
    {
      "rating": "10",
      "text": "Hilarious.  I went with low expectations and was thrilled.  It starts a little slow, but quickly ramps up with the adults.  There are some fantastic sight gags.  The scene in the hospital is one of the funniest that I have ever seen in a movie.  You can't go wrong with this movie."
    },
    {
      "rating": "8",
      "text": "As a lifelong Stooges fan I can say The Three Stooges is a proper, if a bit wrong-headed, homage to Moe, Larry and Curly.  There were many, many moments in the film in which I had to sort of rub my eyes a bit as I had to tell myself, \"These aren't the originals.\"  I think the performances go beyond impersonation.  Especially Moe and Larry.  Do you belief in possession...or in-habitation?  Well if you know the Stooges and see The Three Stooges, there are moments when the performances will leave you with a gaping awe-provoked maw.\r And then there are the other moments when you will be slack-jawed at how terrible some of the other moments are.  While I have seen folks say that \"you can't outdo the originals\" and such like that...it isn't the moments when the Three are on screen that are the real problem.  It's everything else.  Yes, you get the fan service.  You get the bad puns.  You get Larry getting something totally wrong, or playing with something he shouldn't.  You get Moe being Moe.  You get Curly being both the innocent and the Robin Goodfellow.  It's all there, and you should expect that.  There's some modern displacement in there as well and yes, they should know what a smart-phone is, but they have been raised in an Orphanage, so give that stuff a break.  Heh...\"Hey, Jumbotron, have you seen...\" oh that had my theater rolling.\r But you get everything else that has to plague a movie like this.  I recalled Jim Carrey's Grinch movie while watching what could only be called \"filler\".  That cinematic suppuration had to include sort of back story to the Grinch, he had to have some sort of motivation to being the Grinch...as if just being the Grinch isn't good enough...well, the Farrelly bros know the Stooges are just the Stooges, there's no need for us to analyze them, to try and explore their dynamic.  And that is where the movie stumbles, steps on the hoe in the yard, gets the stick in the mush, falls over into the swimming pool and gets the rich patron of the social party wet.  But the Grinch was a movie...they had to have some filler.  But you didn't have to do that with the Stooges.\r I, and everyone in my theater, would have been pleased to have actually seen three Stooges shorts, instead of having a continuous movie broken up into three episodes.  Because trying to layer a narrative over a movie about the Stooges...while I can understand why they did it...and it stinks of studio pressure from Puddinheads wearing suits...it just doesn't work.  And herein we see the inherent problem with making a Three Stooges movie.  You would have been better off making a few Shorts to show in front of other movies (or a teevee series) than trying to make a Three Stooges movie.  Yes, Sofia Vergera hams it up, so there's two other good things about the film.  But most everything else doesn't work.  Sorry.  They need to make a truncated edition where everything else is deleted.  No, don't break out into song just because you can sing and need an excuse for Curly to dance.  Yes, Larry's hair is weird...we get it.   But I can't give this anything less than an eight...why?  I'd be a chowderhead to give it anything less.  It's the Stooges.  It really was...Yes...Curly's too tall/big.  They're all too tall, etc.  But this is an homage of the top order when we see the Stooges and their shtick.  Yes, there are moments when it becomes a bit much.  There are times when the \"violence\" becomes a bit too real, again for story purposes.  There's times modern sensibilities ruin the fun.  But trust me, when you see the Jersey Shore cast as Moe's mercy, and when the Kardasian joke hits like a 2 ton bag of flour...you'll get the funny.  Also stay into the credits for a bit of extra Stooges fun.\r Do I recommend it?...well, soit...oh, you saw that coming, didn't you, porcupines?  Why I oughta..."
    },
    {
      "rating": "10",
      "text": "You can not take this movie too seriously! It was craptactically great! Only the truest of Stooge fans will appreciate this movie for what it is. I laughed so hard, I walked out in tears. My son had a mild case if the flu and wasn't so lucky. Two things that bothered me are1) The whole Jersey Whore thing was pointless!2) The Farrellly Bros disclaimer at the end was painfully forced by Hollywood legal weasels. And came across painfully contrived...Can't wait for the sequel ( I know wishfull thinking ), but will be happy with the unrated Bluray edition with outakes.....hear that Farrelly Bros..Hint, Hint..."
    },
    {
      "rating": "8",
      "text": "As a 55 yo, the Stooges were part of my childhood and even through college. I remember being VERY cynical upon first hearing of a movie being made. Saw it last night with two 40 year old guys and 2 teenage boys. It was much better than I expected. One of those..\"so silly it's funny\" sort of movies. The adults appreciated it more than the kids. (adults laughing out loud funny). The three stars captured the characters perfectly (amazingly even). and there is a plot, and plot-twits even..kinda..(but that was secondary to me). TheF  Bros. caught the essenese of the stories and jokes. Much research must have gone into  it. (tough job, huh?) While the jokes are good, you have to enjoy slapstick humor. I now hope it does well enough for a sequel. Nothing offensive. There is a disclaimer at the end for kids NOT to do this at home. It wasn't needed in the 40's but I am kind of glad they included it in this day and age."
    },
    {
      "rating": "0",
      "text": "This movie is so stupid. It makes me want to put my face in a blender and pour citric acid into my eyes. Thanks for a parody, Twentieth! Now step it up and make a real Stooges film."
    },
    {
      "rating": "7",
      "text": "The new update is hardly what people want to see. Since the trio's best trait is slapstick, however, the Farrelly brothers are well-experienced to do justice on that front. This is pretty much the best we'll ever get, and we'll be glad to go along with it."
    },
    {
      "rating": "8",
      "text": "I wouldn't say they were as funny as back then. However, I still find The Three Stooges movie pretty funny. Though, I didn't like the scene involving Jersey Shore. But yet again, I think Moe did some payback on the cast. That's what the cast of Jersey Shore gets for being bad. But anyway, the movie is pretty good. It has some funny moments. If you like The Three Stooges, you might like this movie. If you hadn't seen it, you should probably see the original show first before seeing the movie. I would give it 10 out of 10 but since it wasn't as funny as the original Three Stooges and Jersey Shore being in it, I'm only gonna give it an 8 out of 10. but still, I suggest seeing the movie."
    },
    {
      "rating": "10",
      "text": "The Three Stooges were not my generation (by a long shot), but i wish they were! This movie had me laughing at a non stop, while still having an at least interesting and entising plot. I can't saw that the movie didn't have a few \"oooh, looky there\" moments, but i would give this movie three thumbs up!"
    },
    {
      "rating": "5",
      "text": "Yeah, but what was with the: Hey, I'm a buff guy here, and half-naked, and am now going to put on a girl's shirt and not button it, and show you what a stage hammer prop is. WTF? Should have shown what a REAL hammer would do to a watermelon or faux real head hit!!! Now, THAT would have been funny. The film was a LITTLE RASCAL'S MEETS THE THREE STOOGES, very little heart, but, not bad in that respect. Yeah, a lot of lame social reference jokes, but, FUNNY in a lot of places. Really. WHAM! Into the door. Good one. Things like that all throughout."
    },
    {
      "rating": "10",
      "text": "I was laughing so hard during this movie. You know, I looked at the top yellow comment, and thought, well... I like stupid humor. I was not disappointed, at all. It took slapstick, and threw it way up in the air, and loogied all over a baby with this movie. It was fantastic!"
    },
    {
      "rating": "10",
      "text": "this was one of the was the funniest movie ive seen about 4 years i thought they would ruin it but they didnt it was hilarious and i recommend anyone to go see it its an instant classic"
    },
    {
      "rating": "10",
      "text": "movie was GREAT.... if your a FAN of the stooges...period....then you will dig this movie... total homage to the og stooges.... watch n laugh.....nyuk nyuk nyuk"
    },
    {
      "rating": "0",
      "text": "To start I'm James. I'm 27 and I can remember some of my earliest memories being that of the 3 stooges slapping and poking each other silly. I absolutely love each and every short that was made. I own all of them and even have many pieces of stooge memorabillia. I recently just returned from the middle east where I was sent when I joined the M.C.  When I returned I was delighted to hear about a tribute being made of the stooges by the Farrelly brothers. I went and saw the movie with my fiancee, who is also and avid stooge fan, and 30 minutes into the movie we left. Why? This series of short tributes was a travesty to say the least. I have been shot and hit by pieces of shrapnel and didn't shed a tear. This tragic farce of a film actually made me so angry that I cried knowing that the real stooges would never have written such a despicable film and that people would actually have the to allow this trash to even go to script. In closing this film is the next worst thing next to the extermination of the Jewish people during the holocaust and if Peter and Bobby  Farrelly had any sense they would erase any idea of making more of these short films. They are an insult to stooge fans everywhere."
    },
    {
      "rating": "4",
      "text": "This movie was probably one of the dumbest films I have ever seen but it wasn't super bad it just really didn't have anything to offer except for introducing little kids to the slapstick phenomenon of the 30s', 40s', and 50s' and to those who grew up watching the reruns in the 60s' and 70s'. The slapstick was really the only part that really stuck out in the film and the famous co-stars behind it. At least this film was better than any Alvin and the Chipmunks movie. I wouldn't be surprised if they came out with a sequel but I am not sure who would really see it... just more older people and their grandchildren. See it if you want to re-live the old show. For ages 4-13 or 45-80"
    },
    {
      "rating": "0",
      "text": "An abomination? Is that the word? Costumes, makeup, and the actors in general. How about the shameless marketing? This has to be someone's misguided attempt and making money off an American Icon. Shameful works too."
    },
    {
      "rating": "2",
      "text": "I never was a 3 stooges fan so i did not enjoy this movie at all. I only saw it because my friend and i were bored and the only movie available at the time was this one. Thank god i work for Regal and i get in for free because this movie was the dumbest thing i've ever wasted an hour and a half of my life on. It was the definition of stupidity. I could even tell this wasn't like the original three stooges which i rarely watched. Its just like what FDT44 said, it was more like a tribute rather than a remake. This movie was just horrible, maybe if your a big three stooges fan you MIGHT enjoy this movie, but otherwise, stay away, at all costs. 2/10"
    },
    {
      "rating": "2",
      "text": "Playing out more like a tribute than an originally-drawn twist on a classic, 'Stooges' is an imitation piece that fails to offer anything new and germane to modern times; its material, embarrassingly camp and derivative, feels too overly forced and enervating to connect audiences with humor outdated some 80-odd years. Though the \"Big-3\" (Hayes, Sasso, and Diamantopoulos) turn in first rate impersonations, carrying out the same aching eye-pokes, excruciating hair pulls, bone-crushing skull slaps, and nasty knuckle sandwiches, not to mention the familiar dissonant squabbling and airy mindlessness, they don't even bother to deviate from just that: impersonations; the characters have no intention to extend themselves beyond a 'Mad-TV'-esque imitation-comedy-skit--offering little else than ephemerally visible-but-not-felt- smiles, followed by long-lasting regret and discontent. And, adding to the feeling are cheap laughs, underdeveloped cameo appearances from modern \"characters\" ('Jersey Shore' cast members among them), cheap and flatly-shot scenes, desultorily unapt classic-rock scores, as well as reproachably classless, and dismal attempts to appeal to contemporary audiences--breast and bathroom jokes with references to drug use--all of which disceptively slide past the approbated PG-rating. Did the fillmmakers fail to realize their forbear was clean? Ultimately, the Farrelly brothers, regardless of their own inspirations, don't create anything inspiring--they create a travesty--and participate in an exercise of fully-fledged defaming. It's \"Soitenly\" despicable."
    },
    {
      "rating": "10",
      "text": "You must see this Movie! It brings memories that we had with the original trio and made me laugh of lot. Moe, Larry and Curly will be always remembered all the time with us and at the bottom of our hearts."
    },
    {
      "rating": "6",
      "text": "Bottom line, you're either a fan of the Three Stooges or you're not. This movie gets plenty of cheap laughs and that's really all that's intended. Personally, I tend to be a fan of stupid humor (Jackass anyone?). That being said, I can't honestly say that this is a \"good\" movie. It's not terrible and it's pretty funny but that's about it. If you like slapstick comedy, check it out. If not, don't waste your time."
    },
    {
      "rating": "6",
      "text": "Ok, The Three Stooges, this new version of the classic trio is good, but have a big problem, dont't are carismatics, like the old cast, some moments are funny, the rest f the cast amazing, but not better than the classic."
    },
    {
      "rating": "0",
      "text": "God awful film full of annoying characters that i dont even know, stupid plot, **** beyond terrible acting and some of the most unfunny humor i have ever seen besides that **** ass film jack and jill, Id rather hang myself then watch this **** again"
    },
    {
      "rating": "9",
      "text": "You know that movies which they try to do an adaptation and it just don't work? This ain't one of them! I laughted so much that my neighboor came to my house to check if everything was OK. YOU MUST WATCH IT!"
    },
    {
      "rating": "8",
      "text": "'The Three Stooges' is a funny comedy film, but does not fully develop into a modern souvenir of the original series. The actors did an impressive performance, and worth seeing on stage. Perhaps the slapstick emotion does not make a good combination with digital cinema, but the reincarnation moves facetiously, and could be considered an extravagance in the choreography of the slips they have. There are times that it is curious trio's encounter with technology and the modern era, and the excuse that always lived in the orphanage, away from the city, could be a great distraction from their uncertainty. Details are somewhat inconsistent in his script, but the comedy moves so that the audience laughter could distract from the small details of continuity. But I can assure you it is entertaining at many times, and may also find curious references to memorable films. The use of Jersey Shore in the film could be seen as a strange encounter between two generations as the youth group appears as a funny oopart for the old audience."
    },
    {
      "rating": "4",
      "text": "i seen this movie about   million times thats why i am giving this rating 4/10 . this movie is dangerous farelly brothers movie i seen in 2012 . lets just say the show is much more enjoyable then the  movie . i like the cast especially larry david . Grade C"
    },
    {
      "rating": "9",
      "text": "As a pre-teen in fifties, I remember a fair amount of the original Stooges on television, but I never watched much.  I found them fairly lowbrow, and unworthy of my time.Times must have changed.  I really enjoyed this movie, and found so many of the stunts to be great, the casting to be excellent, and the three actors playing the lead roles were superb.I found myself enjoying the movie more than I thought I would, for sure."
    },
    {
      "rating": "6",
      "text": "We've all seen these guys, so we know what to expect: non-stop physical slapstick. It's wall-to-wall, so you won't be disappointed. The high-energy rate keeps the gags from lagging and there are occasional funny lines to appeal to the wits. It's really not new or improved, but kids should have a lot of fun and fans won't be disappointed. NOTE: Stay thru the credits for a wacky musical number."
    },
    {
      "rating": "6",
      "text": "They have the right actors for Larry, Moe, and Curly, but the humor lags at times and the writing just isn't consistent.  Larry David was funny as a nun - I wish he would have been used even more and his character expanded further.  I laughed just enough to recommend it, but if there is a sequel they need to make it funnier.  Did we really need the lecture at the end of the movie that nobody was hurt during the film, and that the hammers and mallets were made of rubber?  I grew up on this kind of humor and I didn't go around trying to poke people in the eyes after seeing the stooges."
    },
    {
      "rating": "7",
      "text": "A good way to introduce the Stooges to a new generation (like myself), and a good nostalgic trip for people who grew up with them. It's very funny and had me laughing out loud throughout. It's also got a pretty good plot. It's a little rough in some areas but overall it's a hilarious movie that's flaws seem minor in comparison to it's many triumphs."
    },
    {
      "rating": "6",
      "text": "The movie was so silly but Not The Three Stooges silly . It was fun but not a super funny movie like it should be . All the eye pocking and Hammering was good but sometimes it wasn't funny like the original . The Three acted good but the story was horrible . All that three act was the worst episode of Three Stooges . Sofia did good among the other cast and she was actually funny but that's it . The Beach People's cameo was the worst . Compering to Dumb and Dumber (The greatest funny movie of all) this one is nothing . Acting of the Stooges were good but the story was too awful to like the whole Movie !"
    },
    {
      "rating": "7",
      "text": "The Three Stooges is a movie that impresses with slapstick comedy. The timing and delivery of the sight gags was great. But more impressive to me was that it not only had a PLOT, but it explained it well without becoming too boring. I feel like most directors would have spliced up this thing -and to be honest, I don't think it would have worked as well that way.Also, this film is pretty clean by today's standards. No cuss words that I can remember, and no bathroom humor (unlike Adam Sandler flicks, *ahem*).Some people on here have complained that the story drags a bit, but I disagree. I felt like the movie kept throwing things at me to spice it up. This movie may not be for everyone, but it was refreshing to see this style of comedy again. I'm not saying I want to watch it over and over, but I think it's definitely worth seeing once, even if you're only sort-of intrigued by the idea of The Three Stooges.I (finally) saw it today out of curiosity and because I'm a Will Sasso fan. We have a local $2 theater that picks up movies after they leave most theaters, and I'm so glad I caught this one. To hear the kids crack up at this stuff is pretty much priceless.All-around this movie seems to aim for the kids (with the physical comedy), but has enough wit, puns, and story to appeal to adults, too. As long as you don't expect any explosions, I think most adult males could enjoy this. I give this a 7.5. It's the greatest Three Stooges film that will likely ever be made. That's probably not saying much, but hey, it's good shtick."
    },
    {
      "rating": "9",
      "text": "This is the funniest movie of the year so far. A remake of the classic comedy has everything we liked in the black and white TV show with a modern twist. It is extremely funny. The Three Stooges also had it's fair share of celebrity appearances, with Jennifer Hudson, Sofia Vergara, Snooki, and more."
    },
    {
      "rating": "10",
      "text": "I thought this movie was great! It´s about as close to the real Stooges as you can get, with a lot of the typical Stooges slapstick and gags. I was shocked at how the actors looked, acted and sounded like the real Three Stooges.  Those guys must have worked really hard!! Larry David and Sophia Vergara were great as well.  And even the story line was excellent! Everything tied in together! I am so glad I saw this movie!"
    },
    {
      "rating": "3",
      "text": "Sometimes the slapstick and sight gags are enjoyable, but as a whole it is just so unbelievably irritating and completely unnecessary. A bad tribute. Ugh."
    },
    {
      "rating": "9",
      "text": "The Three Stooges, being a classic, is funny and heartwarming. While I enjoyed the original TV show, the film does lack some elements that were in the show. But it's still good. Sean Hayes does a perfect recapture of Moe and Will Sasso as Larry. Sasso and Hayes were funny and slapstick through the film. The Ferelly Brothers make a un-raunchy, sweet and slapstick film that is gloriously funny and epic. The Three Stooges is very much like a well made classic."
    },
    {
      "rating": "1",
      "text": "I was never a big three stooges fan, but after watching this movie I have more respect for the original stooges.  I hated this movie one of the worst of 2012."
    },
    {
      "rating": "8",
      "text": "Don't be fooled by the silliness and hit-and-miss jokes in this movie; Chris Diamantopoulos (Moe), Sean Hayes (Larry), and Will Sasso (Curly) live and breathe Stooge. As a huge fan of the Three Stooges, I can assure you there are laughs to be had, and the message is sappy, but heartwarming."
    },
    {
      "rating": "4",
      "text": "Even though \"The Three Stooges\" were big plenty of generations before my birth, I still managed to grow up with the show, thanks to my Dad, who was an avid fan of the show and introduced my brother and I to the iconic trio and their slapstick and other such antics (Curly's constant \"nyuk nyuk nyuk\" laughing was one of the prime ones). And I remember how excited I was at the thought of a film, and I remember falling over laughing when I saw the trailer. Then I saw the film...and it wasn't nearly as funny. While it does stay true to the show and feature some really great performances, it unfortunately stales out too quickly and proves that slapstick doesn't help a 92-minute film achieve comic greatness. Though HARDCORE fans of the show may find something to enjoy here, I really can't recommend seeing the film unless it's \"Bad Movie Night.\" You can do far worse, but you can also do WAY better than \"The Three Stooges.\""
    },
    {
      "rating": "8",
      "text": "(Owen McKenna Rio Rancho, NM)\rI rented The Three Stooges this weekend. I wasn't sure what to expect after having read the reviews.\rI liked it. The actors looked like the original Stooges like most people said. As far as the plot being poor; what were the original Three Stooges plots? They were just as silly as the plot of this movie. As I watched the movie I felt the actors were the originals.\rIf you want a good laugh and can appreciate the comedy of The Three Stooges watch this movie."
    },
    {
      "rating": "5",
      "text": "This film has some decent laughs, but ultimately falls short of being a true classic. You see, the Stooges do not mix very well with the likes of Snooki or anyone in this day and age.  The result is a sloppy plot, underdeveloped characters, and inappropriate cleavage (in a kids film?) from Sophia Vergara. An overall 5/10 for effort."
    },
    {
      "rating": "6",
      "text": "You can't make a movie like this without the real Three Stooges doing their thing. This is what happens when you try to do it. It's averagely okay, but not laughable compared to the early days of the Three Stooges."
    },
    {
      "rating": "5",
      "text": "For those who enjoyed the original series way back then, you are introduced to a treat. But for those like me who think this is way too old, then thats what you have."
    },
    {
      "rating": "7",
      "text": "I was interested in seeing this, and it wasn’t as good as I thought, but I still enjoyed it. The acting was great, and fit every character well. The story was actually pretty good. They added a lot of humor throughout the story, and I laughed a lot. The rest of the story was enjoyable but a little predictable. I reccomend it."
    },
    {
      "rating": "10",
      "text": "First of all Jim Carey’s acting was Oscar worthy. The comedy is hilarious I was laughing the whole movie. The sophisticated humour is like nothing I’ve ever seen. Will Ferrell as curly was an excellent casting choice and he played well in his role. The sound effects add to the experience and make the movie even more enjoyable. One thing bad about the movie is it didn’t have enough jokes they should have added more in as there was only a joke about every 2-3 mins."
    },
    {
      "rating": "6",
      "text": "Honestly not a bad attempt but the Jersey shore moments really ruins it shame really."
    }
  ]
}