{"id": 816, "title": "The Remaining", "starring": ["Alexa PenaVega", "Johnny Pacar"], "runtime": 88, "genre": ["Thriller", "Horror"], "description": "When a group of close-knit friends assemble for the marriage of Skylar and Dan, they have no idea they will witness The Rapture and face a series of catastrophic events turning the celebration into a life-or-death struggle.", "releaseYear": "2014", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/sjw5d110lXV4tWgqKG1hGOphchT.jpg", "categories": {"plot": 5.333333333333333, "acting": 4.666666666666667, "ending": 5.5, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 5.0, "action": 3.0}, "reviews": [{"rating": "6", "text": "This is Christian horror. It was a decent, documentary-style horror. Surprisingly decent actually, but what it is most successful at is reserving the Christian cheese-fest towards the last 10 minutes of the film. It is cringe-inducing, but at least it is a very small amount of time. Overall, I kind of enjoyed it, I hoped they showed more of the book of Revelations because their gritty/realistic take on that story was surprisingly engaging. The change in eye color was ingenious.\r In order to enjoy this, there should be a preamble to friends: this is Christian-centric and has a preachy/public service announcement ending. Will I watch it again? No."}, {"rating": "4", "text": "It's not terrible, just boring.\r I don't mind them stopping down so much to proselytize but \"The Remaining\" could use a tighter edit. Horror with a religious bent is a bit of a new thing for me so there's not much to judge this by - it's like \"Sharknado\" but with shadowy, unseen, flying, scorpion-stingered demons instead of flying sharks."}, {"rating": "0", "text": "This flick is rank, extremist, right wing, religious propaganda ****  The message: believe in Me are I'll torture and butcher you to death in a most brutal and violent way.  Oh yeah, I'm saved."}, {"rating": "6", "text": "A faith-based horror film. Based on the book of Revelations, \"The Remaining\" gives us a look at the end of the world as it is foretold in the Bible. What's remarkable about the film is how well it is executed. For starters it's a very good looking film and the cast is totally game. It still suffers from having characters you just don't care about and being too derivative of the Paranormal Activity series, but this is surprisingly not a bad movie. Boring here and there, but never bad. The melding of sermon and horror is actually well-executed. There's definitely a message here that the movie is actively trying to present to viewers, but unlike so many other religious films it doesn't feel heavy-handed or forced. It's preaching is a natural part of the movie that flows well. It's arguably the most well-written part of the film. It follows the book of Revelations pretty closely and is much more interesting than the bland love triangle or the newly-weds sappy love (this is set at a wedding BTW). Those aspects fall short because of how lame the characters are. Like the average modern horror flick that hits the big-screen these days, everyone is so vanilla and really just there to scream at whatever goes bump in the night and get killed by it. At least they aren't so obnoxious you actively hate them. You just don't care about what they're doing so much.As a horror film, The Remaining is also better than one would expect. It's not scary by any means and is yet another Paranormal Activity wannabe. It's not entirely found-footage though so that's a good thing. I actually don't think it would have been so bad if it was though. The moments where the movie is shot in the found-footage style are genuinely good. Even when the camera is shaking around I had no time following the action. These moments are clear and attractive. More than I can say about the vast majority of movies that have tried their hand at it, horror or otherwise. Still, the attempts at scares are very familiar. It's all jump scares where people are pulled off-screen by some unseen force à la Paranormal Activity.None if it very original and it falls into several modern horror movie trappings, but darn is it better than anyone would reasonably expect. I mean, a Christian horror film? That just sounds too absurd to be believed. Yet, here it is and it's not bad by any means. It's not particularly good, but certainly well-executed and better than quite a few of the horror movies I've watched in my time. With better characters and more original attempts at scares this may have even been something special. As it stands now it's an oddity, but a surprisingly solid one."}, {"rating": "3", "text": "It somehow seems appropriate that a Christian story from the Bible should be adapted into a cheesy horror flick. I gave it an extra star for some effective visuals and decent performances. By the way, I am NOT a Christian nor do I believe in the Bibles fairy tales."}, {"rating": "0", "text": "I'm pretty sure that Jesus would be like \"ya'll be crazy\". This was seriously the most ridiculous portrayal of Christian beliefs EVER. Jesus was all, love your brother umm be kind to people umm not kill folks.  So wtf...if you seriously believe that there is a dude in the sky judging you and keeping a tally of everything you do & if you f*ck up then he punishes you then you may want to re-think your beliefs...just sayin."}, {"rating": "4", "text": "The Remaining es otra película de terror filmada al estilo de \"Medio-Metraje\" o \"Found-Footage\" que nos cuenta la historia de una supuesta profecía bíblica que da paso al fin del mundo que, en este caso, es tan religioso y un tanto incoherente como satisfactorio.\r Tal vez muchas personas ya están cansadas de este género, ya que empezó de ser fascinante y original, a algo cliché y repetitivo., no obstante, no quiere decir que debido a ello nunca más van a haber buenas películas de este tipo, y han habido películas que lo comprueban (Cloverfield, [REC], Paranormal Activity...), pero por desgracia \"The Remaining\" ha caído por poco en el otro lado de la moneda. La historia empieza bien, pero después empieza a perderse en muchos mensajes religiosos que hacen de la trama algo cansino, y no solo eso, sino que por momentos también se torna algo aburrida. No obstante, hay cosas que pueden ser salvadas, como por ejemplo que nos preocupemos de todos o de algún personaje en específico (en mi caso, la rubia de pelo corto que aparece sin más ni menos en alguna parte del film) a pesar de que algunos no llegaron a tener una \"muy buena actuación\" (como, por ejemplo, el personaje por el que me preocupé). Otra cosa buena fué que por momentos (como en la mayoría de este tipo de filmes) sentí la desesperación que sentían los personajes, convirtiendo ese instante en algo entretenido, y despertando un poco el interés, pero yendo a lo último, es una película que tiene más puntos en contra que a favor, y factores como algunas incoherencias de la trama y el tema religioso que cada vez se hacía más y más repetitivo, influyeron bastante en el resultado final."}, {"rating": "3", "text": "I was hoping for a good exciting suspense movie like Cloverfield, which has the same director, but this time it was not so suspense, I give it score 3/10 . Like half of humanity died, and they talk about peanut butter ."}, {"rating": "5", "text": "Yep, this is a horror flick, a lot better one than many, many others. if the films intention as a \"Christian horror\" flick, was likely intended to scare unbelievers into rethinking their atheistic or agnostic orientation, was not likely successful in that regard. The acting was better than average, special effects on a small budget were slightly \"Hitchcock-ian\" wih demonic critters largely alluded to instead of shown. Full transparency: I AM a Christian, so if you're a hater or an intolerant type person you needn't read any further. Insofar as what the Bible says about the End of Days, this is NOT how it goes down. If this movie was intended as an evangelizing tool it completely missed the mark. The whole plot was full of tremendous eschatological error, scrambled and un-sequential events, and worst of all, it represents the Creator as a malignant force. In terms of the theological history of Christian eschatology, this particular depiction of the Last Day is a relatively new development and is unsupported by the wealth of theologians that pre-existed it. There are so many aspects of this movie that are unsupportable in scripture that I couldn't begin to address them all here. Let's just start with two of the more obvious errors: God doesn't leave anyone alive to suffer after the end of earth's history, there's just acceptance or rejection of the Lamb and then, when time and events have come to their conclusion, those that have affiliated with the Creator are transported BODILY intact, just as Jesus did. At no point was He a disembodied \"spirit\". Secondly, no one is left living to be tormented and terrorized by demons until they submit to a tyrant God, plus those two events are entirely separate from one another. The whole Last Day exists around our being created as creatures with free will and how we have used that free will. God is LOVE, but I guess THAT wouldn't make good material for a horror flick. No wonder so many are turned off to Christianity with this portrayal of a a seemingly sadistic and psychopathic Creator. \"The Remaining\" made for an effectively scary horror flick but if the intention was to move people toward God, it failed dreadfully in sharing WHY God is worthy of our worship."}, {"rating": "5", "text": "Well, this could have been a WHOLE lot worse. Let's put it that way. Pretty decent production value. And this is a christian horror film. ...but what was the message supposed to be? That we're supposed to be happy to die? How is an unbeliever supposed to respond to this? Looks all terrible for them... =("}, {"rating": "10", "text": "Awesome movie i cried at the end! Russkie est? Go v konfu smotret. Ya cool pacan."}], "recommendations": ["exorcist_the_beginning", "the_unborn", "the_girl_with_all_the_gifts", "splice", "event_horizon", "the_green_inferno", "daybreakers", "28_days_later", "the_pyramid", "the_mist", "world_war_z", "the_curse_of_la_llorona", "noah", "antebellum", "apocalypto", "the_exorcism_of_emily_rose", "scary_stories_to_tell_in_the_dark", "chernobyl_diaries", "night_of_the_living_dead", "eden_lake", "the_purge_election_year", "devil", "priest", "the_possession", "sunshine"]}