{"id": 2543, "title": "The Messengers", "starring": ["Kristen Stewart", "Dylan McDermott"], "runtime": 90, "genre": ["Mystery", "Thriller", "Horror"], "description": "When the Solomons trade in the craziness of big-city life for the quiet of a North Dakota farm, little do they expect the nightmare that follows. Soon after arriving, teenage Jess (Kristen Stewart) and her younger brother see terrifying apparitions and endure attacks from a supernatural source. Jess must warn her disbelieving family before it is too late to save them.", "releaseYear": "2007", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/kLmurNcnkmdPahLc6HKQjX3EHed.jpg", "categories": {"plot": 3.0, "acting": 1.0, "ending": 4.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 1.0, "funny": 1.6666666666666667, "action": 5.0}, "reviews": [{"rating": "0", "text": "Terrible movie. I have a hard time thinking of one that was worse. No redeeming qualities whatsoever with this \"movie\". What took me most off guard was that it was heavily advertised, so obviously it was a big budget flick. Then I saw the movie, and I almost thought I had picked up the wrong thing, seeing as how it was as B movie as you get. Don't even bother watching this one once, it sucks horribly."}, {"rating": "0", "text": "I desperately wanted to give this film a rating of 1 but in order to do that I have to be able to come up with a redeeming factor that would warrant such an award but this Amityville/Poltergeist wannabe was so devoid of anything even remotely original that it gets a big fat Greek zero from me (see what I did there John Corbett, I'm so funny)."}, {"rating": "1", "text": "Painfully slow and predictable storyline, meaning no real plot. Seen-it-before people crawling on ceilings. Some of the worst acting and directing as well. Can't believe I got suckered in by the trailer. That's what I get for not checking here first."}, {"rating": "0", "text": "This movie is **** stupid- I hated this **** It's screwed up. IT WAS STUPIDDDDDDDD!!!!!!!!!!!.You want a bad movie-see this one. It got on my top 5 of most stupid movies ever it ranks 5th"}, {"rating": "5", "text": "Lapses in logic, sure; there is one that's a howler. After being attacked by a quartet of pale molesting arms at the basement stairwell, the girl returns with a seemingly lack of fear. \"The Messengers\" is a bad film, but you've got to love the homo-eroticism between the girl's father and the farmer. It's \"Brokeback Sunflower Field\". In terms of style, however, it's nonsensical. There's nothing Hitchcockian about these filmmakers' style and yet they invoke \"The Birds\"."}, {"rating": "0", "text": "Holy crap, JoJo. Are you serious? \"Not for the faint of heart\"? Go watch some Cronenberg and tell me how you feel (I suggest starting with Videodrome). If you had a hard time stomaching this laughably tame trash, you might just throw up your guts with real horror movies."}, {"rating": "4", "text": "I found it pretty boring. The Pang brothers have a talent for building suspense and some creepy shots but overall this movie was slow and predictable. It's got a series of jump scares but nothing that is REALLY scary. A plot twist at the end was explained pretty poorly. It's not like I hate this type of movie (I liked movies such as the Pulse remake and the Japanese Grudge movies, and even the Grudge remakes were enjoyable) but this one just didn't do it for me. Kristen Stewart looked bored, and didn't make for a particularly compelling lead. Scares were OBVIOUSLY set up, often making little sense. And the setting really wasn't scary at all. (Most of the movie takes place in broad daylight.) Just, not recommended."}, {"rating": "3", "text": "Scary House? Check. Moody Teen? Check. Every other cliche' from every horror movie ever? Check. Yeah, take \"The Amityville Horror\", \"The Birds\", and \"The Grudge\", add crap, and blend them all together and then you get this movie. I only saw it cause there was nothing else to see, I didn't expect to be impressed, and I wasn't."}, {"rating": "1", "text": "One gets the sense that much of a decent script ended up on the cutting room floor; what got left in makes almost no sense, and certainly has nothing to do with the title (or even the previews)."}, {"rating": "0", "text": "Ye Gods! This was a terrible movie. Can some one tell me how I can get some of those super fast growing sunflowers? Kristen, call Jodie and see if she can get you a part in her next film."}, {"rating": "10", "text": "It was really scary. The guy (about 30) covered his eyes the entire time. Thats how horrifying this movie is. Watch it, but not on a full stomach. This is not for the faint at heart. Enjoy the movie!"}, {"rating": "2", "text": "A laughing stock. The only reason I could give this movie a 2 is because it was, at times, enjoyable to laugh at its stupidity. Even when I tried to be scared, I could not help but laugh. It is just such a dumb idea, plot and movies. How could a moving house with stupid monsters ever be scary? It looks like they never will be, thanks to this flop."}, {"rating": "1", "text": "Kind-of funny when it was not trying to be, but NEVER really achieved scares with its kiddy PG13 scares that only a immature kid might find scary. Real horror buffs who wasted there time on this movie know the truth, and that is that this movie sucks."}, {"rating": "0", "text": "It is amazing that such a high-budget horror film can achieve such cheap scares with such bad and unrealistic acting. Not only that, but this movie is easily the most predictable horror movie of the last 15 years."}, {"rating": "6", "text": "I actually enjoyed some aspects of the film. I thought that Jr. Actress Kristen Stewart and Jr. Director Oxide Pang Chun put up a good try. They both have a long way to go, as does this film, but it was mildly entertaining and managed to achieve some scares here and there. This is not to say it is anything but a failure, but from a optimistic point of view i give this a light F. 60/100."}, {"rating": "5", "text": "I highly recommend this movie if you're looking for a small-town thrill. However, I was a tad disappointed. It wasn't very original, and I saw lots of elements from Amityville movies."}, {"rating": "3", "text": "Just defeat or contempt fair ?, just what I can say about the movie \"The Messengers\" was so creepy but very boring , because a damn house is a symbol of horror movies , and the field gives me much more."}, {"rating": "4", "text": "Family with a troubled teenage daughter buy a farm and think it is a good idea to hire an unknown drifter to help around the place...it isn't."}], "recommendations": ["drag_me_to_hell", "ouija", "venom", "cabin_fever", "the_bye_bye_man", "dead_silence", "the_host", "the_curse_of_la_llorona", "annabelle", "insidious", "the_hills_have_eyes", "the_strangers", "texas_chainsaw_3d", "the_devil_inside", "countdown", "the_possession", "slender_man", "malignant", "the_eye", "friday_the_13th", "the_grudge", "unfriended", "chernobyl_diaries", "paranormal_activity_4", "hostel_part_ii"]}