{"id": 1312, "title": "The Matrix Revolutions", "starring": ["Keanu Reeves", "Laurence Fishburne"], "runtime": 129, "genre": ["Adventure", "Action", "Thriller", "Science Fiction"], "description": "The human city of Zion defends itself against the massive invasion of the machines as Neo fights to end the war at another front while also opposing the rogue Agent Smith.", "releaseYear": "2003", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/qEWiBXJGXK28jGBAm8oFKKTB0WD.jpg", "categories": {"plot": 6.866666666666666, "acting": 6.555555555555555, "ending": 7.241379310344827, "soundtrack": 8.5, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 4.0, "action": 7.363636363636363}, "reviews": [{"rating": "10", "text": "An incredible excercise in experimental, post-modern cinema. This kind of big-budget risk-taking is what classics are all about. Like 'Blade Runner' and '2001: A Space Odyssey' before it, 'The Matrix Revolutions' manages to say the things that are so difficult to say. Yes, there is action. Yes, there is spectacle. But beneath the jaw-dropping action sequences and the beautifully surreal art direction is a movie that questions the foundations of life, love and reality to a fundamental core that the more superficial first movie could never even touch. A masterwork to be rediscovered in generations to come."}, {"rating": "7", "text": "Still not as good as the original but better than Reloaded, in itself it would have held up as a good movie but given the standard set by the first movie it doesn't get any better than average. It does round the trilogy off well and closes the storyline as it should."}, {"rating": "8", "text": "Why was this finale released so soon after the second film. Nice money grab. What a shame the sequels sputtered out or this Trilogy could have been the most epic in the history of film making. Could have been our generation's STAR WARS. Woulda, Coulda, Shoulda."}, {"rating": "7", "text": "Surely cannot beat the original, but this final installment in the trilogy is a spectacular action achievement with explosive CGI and visuals. Yes, we don't have a sophisticated plot, but a trilogy has to finish off with a bang."}, {"rating": "9", "text": "Although it didn't turn out to be the film I wanted it to be it still is an epic and very spectacular movie. The Battles are visually very rich and the VFX still hold up very well for an almost 10 year old film. The Messiah story is filled with philosofical content with which you might not always agree but it does provide food for thought and the films tend to stick in your mind much more than the modern day action fodder tends to do. This makes seeing these gems on Blu-ray again as much a joy as they first times I saw them at the cinemas!"}, {"rating": "9", "text": "Alright, after being left with mixed feelings about the second movie I was hoping to have the question of how Neo managed to stop the machines answered adequately in this movie, but it was not. Also, this movie adds even more questions along the same lines: how does Neo manage to see in the real after he is physically blinded? (BTW: The same thing happened in the Dune saga which is probably not just coincidence, there's some deep philosophical meaning to these in both I'm just not entirely sure what it is). How does Neo absorb the sentinel into himself in the end? Three possible theories I have are: 1) Zion and the outside world are just another layer of reality inside the matrix created to fool the people who escape the inner layer of the Matrix that they are free. 2) Neo is actually a machine himself (or possibly the cookie the oracle gave him lets him carry a machine program somehow, after all in computer lingo a \"cookie\" is a small piece of data you give to a user visiting your website so you can track them), 3) Neo has achieved enlightenment inside the matrix but a side-effect is that he's also achieved enlightenment in the real world, in Buddhism for example it is said there are high-level monks that can bend reality melting snow with their minds and/or make thing materialize out of thin air, etc.. It's possibly Neo's enlightenment lets him do something similar in the real world. Any of these explanations work but we never really know what the creators of these movies really intended since they have stated they would rather let us figure out things for ourselves. The other confusing part of the movie is the manner in which Neo defeats Smith when he realizes he has to stop fighting Smith and just give in to win. I think it has something to do with him realizing he is only fighting himself or duality is an illusion, since a lot of spiritual paths say this. But once again we'll never really know. After watching the trilogy once or twice I suggest you view the versions where they have the audio by two philosophers watching the film over the film, you will understand the film a lot better after seeing that. Overall I love the trilogy. The one thing about this last movie is the beginning is really lame. The first and second movies had epic scenes to start them off, this one just starts up with the characters on the hover-ship having a conversation with each other, how lame is that? I docked a point from this final one for that. They should have started with the scene in \"Mobil Ave\" (ie: Limbo) that would have been more exciting to start with. But other than that a great movie, albeit still confusing the first time you see it."}, {"rating": "8", "text": "Like the second one, this was good as the first one. It's impossible to pleased everyone. Everyone is gonna have they're own taste and I have my own. Good conclusion the series."}, {"rating": "7", "text": "This movie has his strong scenes with wow effect. Consider the visual effects and the epic story that comes to an end. But it has also some weaknesses: some characters are very boring and I had the feeling some actors and characters came into the movie, because the makers are so political correct. Also some fights are too long."}, {"rating": "7", "text": "Although the film can get quite spotty and in many ways....droll, the action scenes coupled with the still top rate acting of it's major characters propels this movie to a solid an average 7. This movie could have been so much more than an action film in so many ways and at least a solid 20 minutes could have been trimmed from this film alone. The B-rate extras fudging up some of the easiest lines in Hollywood history. The Matrix Revolutions answers many questions in this final installment in better ways than many other sci-fi films  Terminator 3), but it fails to grip you the way the philosophy of the first Matrix did."}, {"rating": "7", "text": "Much of the philosophical ambiguity of the first two is absent in this film, and a number of the characters needed more development.  The dialog is even more wooden than in the first two, also.  However, the action and soundtrack are both superb.  However, much like the second installment, the action scenes have a habit of overstaying their welcome.  The third act is what saved this movie though, with a LEGENDARY final fight sequence, and some good screen time with Neo and Trinity leading up to it.  In the end, The Matrix Revolutions is a mostly unworthy but still enjoyable concluding chapter to an exceptional trilogy."}, {"rating": "7", "text": "The conclusion of the Matrix trilogy. It is excellent and also a bit of a disappointment for me at the same time. Lets start with the good things: The characters, style, special effects, fights, action scenes, set up and story (mostly) are really good. I enjoyed the movie a lot because of this. On the other hand the conclusion is a bit unsatisfying, the climax of the movie battle is also a bit underwhelming (expected more with this build up), parts of the story are weaker and some questions are not answered or better said there are teaser that there was more than meets the eye. I read that the Wachowski brothers (now sisters) had not developed much for a sequel when the first movie became far more successful and influential as they expected. This put them under pressure when a sequel must be made to use the tide of the success. So I will say they had to make some sacrifices here but it is not garbage by any reasonable standard. The story continues after the cliffhanger ending of Matrix Reloaded. The machines have found the location of the underground city of humanity and started their attack. The human resistance has neither the resources or manpower to win an open war. Sidenote: I say this is beyond stupidity to have no back up. Meanwhile Agent Smith is turning the Matrix upside down with his new powers while Neo is unconscious and maybe even in a comatose state. As set up this is amazing. The situation is at an all-time low and the next hours will be the make or break point for everyone. I truly enjoyed the set up and the heroes journey against the overwhelming odds. Some parts are weaker like for example parts of the conclusion, some side story arcs and the climax. Visuals and special effects are awesome. Again they create something that feels disturbingly realistic and believable. The action and fight scenes are well done and do not disappoint. I dislike the final confrontation a bit as it feels a bit short and underwhelming but I will admit it is still awesome too. The actors deliver again a good performance. Keanu Reeves as Neo is fully convincing and I praise his role. Sadly Laurence Fishburne as Morpheus is barely in the movie. It is just slightly more than blink and you miss him ;-). Hugo Weaving as Agent Smith is the hidden star again. He is such an enjoyable antagonist and now he is overwhelming like an unstoppable force of nature. Carrie Ann Moss can shine a bit more with showing a bit of more facets of Trinity’s character. For the side characters I will praise Jada Pinkett Smith as Niobe, Mary Alice as the oracle and Ian Bliss as Bane (I could Morpheus put also in the side character list for this movie but refused). Overall this movie hits more than it misses. It is good enough to be a satisfying conclusion but not awesome enough to get a higher rating. I say most people agree for this as mostly the first Matrix movie is brought up in movie conversations and the sequels are always seen as inferior. I would still recommend the whole trilogy but say it is not on the level of the best movie trilogies like for example the original Star Wars movies, Back to the Future or Indiana Jones. Bonus thought with a !!!Spoiler Warning!!!: After watching it I say Neo was never the chosen one. He was just the catalyst for agent Smith who is the true chosen one. This is not a joke. Think about it: Firstly: He fits all descriptions of the prophecy. Secondly: Without the thread of Agent Smith what could Neo hope to get done except slowing down the inevitable (Nothing to bargain with the machines)? Thirdly: It is already told by the creator that Neo is not that unique or the chosen one and a conversation near the end says all this was a dangerous gamble. Alternative: I could also argue that both Neo and Agent Smith are the chosen one as both were needed and one without the other could not start the chain of events that result in the outcome. This would be the two sides of a coin argument."}, {"rating": "10", "text": "Absolutely amazing trilogy, love it. Highly recommended movie. Great cast and acting, amazing special effects."}, {"rating": "7", "text": "Hey I'm the most anti woke guy there is... I was following Jones before he made it on youtube.... saw the movie... and it is not the greatest movie of all time... but can't really understand the hate is getting.... it continues the story, it explains what happened with Zion, morfeus and the the old matrix, explains what happen with the Robots that accepted the peace with the humans, explains how the humans evolved in the 60 yeas that past... it explains why this Chosen one was so special and what made him special...something that was very well explore since matrix one and his connection with trinity... introduces this cool concepts of a matrix within the matrix, AI machines factions, Smith being rebooted into a new body and being awaken by anderson, the new matrix being one of complacency and control with Social media and NPC real NPC people walking among real humans... the concept of humans being put into stress producing more energy ...right away you see that the new matrix is identical to our world...it even hat Covid ....all the catastrophes the Annalist could dreamed to create stress and produce more power out of humans....contrary to what I heard from a lot of sites this has very little trinity... why It took so long for Neo to wake up...he was 60 years on the Matrix...how trinity got her powers so fast....60 years in the matrix the moment she regain consciousness was the same as Smith...why Neo took so long...maybe it was all those blue pills he was taking.....using the slow motion and rewind against Neo himself...shows how the Matrix even adapted to people like Neo...they even retired the agents since they had the NPCs...almost like we have those raging NPC mobs ready to take orders from social media.....I don't know if it is this super divided times we are living now...but the movie does not deserve the what it is getting... like this is more true to the source material, than the new Ghostbusters movie...like come on guys yeah the Fembusters was the worst spin on a classic...right there with the last star wars trilogy...but having kids ghostbusters, it was really not that good.... I know some took it as...\" we better get behind this one or the Fembusters will win the argument\"... but it was not that good ...a 10 compare to the fembusters ...but not a jewel... and this movie is definitely not the bad movie  they are making out to be. ...I will give this one a 7/10."}, {"rating": "6", "text": "Not a patch on the first movie. They went for the bigger is better concept and failed. Fun sci-fi action flick, but nothing special. I actually stop caring about the main characters and more interested in the fate of the side characters. Like that old man drill Sargent, the kid of the loading dock and Links wife."}, {"rating": "10", "text": "What if i told you that this movie is amazing in every single point? It may not be as Phylosofical as the first one (even if this still has a lot of that, especcially in the beggining) but it´s a joy to watch unfold. Can´t wait for the fourth one."}, {"rating": "8", "text": "For a movie people hate on as much as they, this movie to me is pretty epic and basically everything I wanted from the finale.  Is it perfect no but is it entertaining yessssssss"}, {"rating": "7", "text": "Of the 3 matrix movies, this one unfortunately was the worst IMO.  I grade it a tick below the 2nd film, still acceptable and brought closure where needed but it just could have been SO much more."}, {"rating": "10", "text": "Eto shedevr, v 2019 gody viglyadit ochen svezho. Zagadka ne razgadana, zhdem prodolzheniya. Ochen nadeus cho ne isportyat. Film na veka"}, {"rating": "9", "text": "Propably the weakest Movie of the Trilogie since they focus way too much on the Machine War thing, but still Revolutions has some moments too, especially the final fight is just epic."}, {"rating": "7", "text": "Una experiencia que se queda corta en trama, en especial si se le compara con la primera película; sin embargo, es una buena película de acción."}, {"rating": "7", "text": "Out of the Matrix trilogy, Revolutions is my least favorite, but I still consider it a good movie. The reason I like it less is because the characters don't spend as much time in the Matrix, which to me is by far the most interesting part of these films.I didn't care that much about Zion, to be honest. Zion was your typical post-apocalyptic SF settlement, I've seen them before. The fighting scenes there also haven't aged very well. But the Matrix is something new and unique. I wanted more of that. Here's hoping Matrix 4 will focus heavily on the Matrix."}, {"rating": "8", "text": "As continuous journey was better than good. Science Must Get inside the brain ..."}, {"rating": "7", "text": "zdecydowanie najsłabsze ogniwo trylogii, niezbyt satysfakcjonujący sposób rozwiązuje wątki, jednak pod kątem scen akcji dalej bardzo dobrze wykonane"}, {"rating": "10", "text": "Such an Underrated gem Only They will realise This Who will understand The movie The music Is A Strong Bone of the Movie"}, {"rating": "9", "text": "ponownie neo i to jeszcze silniejszy niż w poprzedniej części... i tak to jest fajna część matrixa."}, {"rating": "10", "text": "So much better than the crappy 2nd movie and a good ending to the trilogy. Hopefully the 4th movie is as good as this."}, {"rating": "9", "text": "the best moviie ever, I love The Matrix, is my favorite trilogy ever. Incredible action."}, {"rating": "8", "text": "You can say, that The Matrix Revolutions is the weakest part from the trilogy, but you can't claim, that it's bad. It's as brilliant as the rest. Do not underestimate it. Many people find the battle in Zion and the fight between Neo and Smith uninteresting and unnecessary, but there is sense in everything. Maybe the protection of Zion took more than necessary attention, but that doesn't make the whole movie a disaster. Overall, one satisfactory finish."}, {"rating": "5", "text": "Hmm...not the worst movie ever, but still not great. (Before I do anything else with this review, I have to say the user who complained about the contradiction between the original and the sequels is wrong: the Machines were manipulating the One so that he had to reboot the system periodically to keep it running.) This movie does have its moments--Sati is cute, in particular, and the assault on Zion shows remarkably subdued mindless action--but they're counterbalanced by the mediocre and outright bad. As an example, the scene near the end where Trinity flies above the clouds and sees the sun is simply beautiful--or it would be if the craft hadn't lost power as a consequence and crashed. Not only was it sad for me to see Trinity, my personal favourite character, die, it also struck me as unnecessarily cruel and a devaluation of her character. What happened to how capable she was in the first two films? Also, the final battle between Neo and Smith did take a bit too long to end. But I did actually understand pretty much all of it."}, {"rating": "5", "text": "Disappointing film, to be honest. The special effects are spectacular as ever and the performances from the main cast remain stable, but the lack of new ideas and a much interesting plot make it more so-so than satisfying.\r Final Score: 5/10"}, {"rating": "10", "text": "No, it doesn't exactly re-create the magic that made the original such an instant classic, but it's faster and more involving than \"Reloaded\" and it rounds off the premise and themes of the trilogy in a surprisingly satisfying way."}, {"rating": "4", "text": "Very Disappointing EndingLike Game Of Thrones, The Matrix ends not with a bang, but a whimper."}, {"rating": "10", "text": "The most fun in this movie comes from people who hate it so vehemently, even despite the fact that there is a great final confrontation between the hero and the villain, whole atmosphere, the action and the ending itself. In general, after the previous one, it was hard to expect something different, but what happened in the end is quite enjoyable. I got lots of fun watching all the nonsense too. I just accept these stupid things, and I dont think they should be taken too seriously. After all, this is just an action movie, not a philosophical fantastic parable from the geniuses of our generation. Why is this so much hate on this movie? Calm down, people."}, {"rating": "3", "text": "Not good as other two, but I was satisfied with the ending. Boring, but it's still The Matrix."}, {"rating": "3", "text": "Should never have been made.The original was really fun, but all that cam after are crap... just plain crap.What else can you say.... watch The Matrix, forget the rest!"}, {"rating": "4", "text": "Revolutions felt rushed because it's been in production with Reloaded and that isn't a good thing. Maybe release this later in possibly 2005 or later would be better."}, {"rating": "8", "text": "What if I told you that this movie is just as good as the other 2 Matrix movies and that it is very underapricated when to its review. Neo kill all the hater agent smiths."}, {"rating": "6", "text": "It was okay--just okay.  The action inside the matrix sucked and went on like Obi-Wan vs Anakin.  Jada Pinkett was best part of this movie.\r Also, the fate of Trinity and Neo diminished the prior two films.  It made me feel like the prior two films were pointless.  Honestly, if you haven't seen this film, you are better off just watching the first two and creating your own story for the end."}, {"rating": "9", "text": "The Matrix Revolutions is the last or rather supposed to be the last part of the Matrix series. I don't know if there will be another episode, but I heard it's coming. Anyway back to Revolutions. Again, I don't understand the hate that this film gets when I think it's a wonderful ending, or let's say it was the end of the series again. The story is excellent again with excellent action and an excellent soundtrack. For me, this is an excellent film and I personally think you should give Revolutions a chance."}, {"rating": "10", "text": "The matrix is the best movie that I have never seen. I like a lot! The actors and the story are great!Definitely a great movie!!! I cried through the whole thing."}, {"rating": "8", "text": "The conclusion to the epic Matrix trilogy should have been the best of the three films. Everything was set up perfectly leading into a potentially exciting conclusion, and most of the film went as expected. There was terrific action and science fiction drama, some amazing special effects, and the legend of Neo continued to grow, right up until the conclusion. The end of the film went from extremely predictable to ridiculously strange and confusing. While I'm sure the ending made perfect sense to the Wachowski's, it made no sense to me, an avid science fiction fan and movie critic. This being a review, means I can't go into specifics, but the ending was absolutely horrible and puts the whole series in a different light. The most disheartening part of this whole thing is that until that point, the Matrix has been done to near perfection. The story was solid, the action was out of this world, the special effects were amazing, the casting was flawless, and just when the trilogy should have reached it's apex, it all comes crashing down. Once again the cast is terrific and the story is great, which is why I don't understand how they could give us an ending like that. I thoroughly enjoyed the Matrix trilogy and it will certainly hold it's place in cinematic history, but as a fan I was horribly disappointed by an ending that came out of nowhere and left the audience scratching it's head."}, {"rating": "6", "text": "An improvement on Reloaded at the very least, but it just carries on far too long and has a rather pathetic ending. Honestly, it should have ended after Agent Smith's defeat and left off on an epic note.  Unfortunately it goes on trying to portray Neo as a new age Messiah with a rather convenient a \"all-things-wrapped-up-in-a-neat-bow\" expositional ending. Overall: An OK movie with a bit of a let down of an ending. Some grade A fight scenes however. Anyone else think the final battle between Neo & Smith looked like it came straight out of Dragon Ball Z?"}, {"rating": "3", "text": "The Matrix Revolutions is in my opinion the most boring. Never does not manage to keep me attention to all details.    ."}, {"rating": "0", "text": "The third movie in the Matrix series has become a CGI show, a lengthy cut scene of a video game.\r Everything feels so over the top! The first Matrix movie was brilliant, the second one became bigger in size and had some great action but got lost in too much add-ons to the story and pseudo philosofical mumbo jumbo. This third Matrix movie just buries the whole franchise and I lost interest in the whole series.\r \"Can Zion be saved?\".................. who cares?"}, {"rating": "4", "text": "What really stands out in The Matrix Revolutions? The lavish and complex Zion dock fight, where a small group of human-controlled heavily armed mech suits desperately attempt to defend the last human city from a seemingly endless horde of merciless \"squiddy\" machine sentinels. That's really about it. The beginning of the film is OK, but the vast majority of it is so annoyingly mediocre, and some moments are so embarrassingly awful that Revolutions makes for a disappointing final chapter in the Wachowski's sci-fi blockbuster trilogy. All the cast's performances underwhelm, apart from Hugo Weaving whose performance as the increasingly power-mad Agent Smith becomes so gloriously camp and over-the-top that it's kind of funny to watch. He also has the only memorable line in the film - once Neo (Keanu Reeves) returns to an apocalyptic, stormy Matrix for his final showdown with his adversary, Smith asks him sardonically \"Like what I've done with the place?\". This final battle is, disappointingly a bit silly and repetitive, resembling a knockoff fight from Dragonball Z rather than the epic clash of titans the series has been building towards. About the only thing this final, underwhelming set-piece offers apart from intense tedium is some pretty slow-motion water effects. None of the film's characters really develop any further in this film, and most of the cast have very little to do apart from Reeves, who is basically playing Jesus in a big flappy coat. And don't even get me started on the clunky bit of exposition the Wachowskis crowbar in to explain why The Oracle is now played by someone else (Gloria Foster died between the second and third films). The final part of this formidable franchise is incredibly sub-par, and apart from providing the viewer with a couple of good thrills and some form of closure to the story it offers very little except disappointment."}, {"rating": "10", "text": "It's not as good as first two films (considering the depth, story, plot altogether) because it focuses more on action rather than story. In this film there are more fighting scenes, massive battles, etc. If you like bullets flying, explosions, BOOM, CRASH, TRATa Ta Ta Ta Ta.... etc. then you'll definitively like it."}, {"rating": "8", "text": "Definitely the worst of the series. But that isn't necessarily a bad thing. I've seen all of the movies several times now, and I can safely say that the ending, although it didn't answer every question, was satisfying in its own way. I've done a little bit of research, and I almost understand the way that the Matrix works. I also like to the view the three films as one big chronicle. The first one gives you a shocking concept, the second one shows you what can be done with this concept and gets you thinking even more (the Architect scene, for example), and the third one displays every technical ability that the Wachowskis and the cast members have learned, and mastered. The series as a whole is a stunning achievement."}, {"rating": "10", "text": "This movie was so incredible amazing. Doesn't matter if we're hapless within the history for long time of the movies and movies, it's the best final of a trilogy"}, {"rating": "6", "text": "By far the worst of the futuristic trilogy by the Wachowski Brothers. Matrix Revolutions focuses too much on the special-effects of the movie and in turn, results in a sloppy script, mediocre storyline and a disappointing conclusion to The Matrix Trilogy. The atrocious film detaches from the other two movies of the trilogy (The Matrix, The Matrix Reloaded) and leaves a bad taste for the viewers, expecting a decent conclusion to a series that could be made into something that will be remembered for the generations for come."}, {"rating": "6", "text": "You know what? The first hour of this movie isn't too bad. But then, it gets really really really really really stupid... That's the best way I could describe this movie. Not bad, just really stupid."}], "recommendations": ["the_matrix_reloaded", "maze_runner_the_death_cure", "maze_runner_the_scorch_trials", "battle_los_angeles", "the_hobbit_the_battle_of_the_five_armies", "300_rise_of_an_empire", "captive_state", "avengers_age_of_ultron", "avengers_infinity_war", "mortal_engines", "the_5th_wave", "star_trek_v_the_final_frontier", "the_hunger_games_mockingjay_part_2", "the_13th_warrior", "transformers_dark_of_the_moon", "final_fantasy_the_spirits_within", "equilibrium", "surrogates", "source_code", "how_to_train_your_dragon_the_hidden_world", "underworld_awakening", "jupiter_ascending", "mad_max_fury_road", "reign_of_fire", "pacific_rim"]}