{
  "id": 1146,
  "title": "The Babysitter: Killer Queen",
  "starring": [
    "Judah Lewis",
    "Samara Weaving"
  ],
  "runtime": 101,
  "genre": [
    "Comedy",
    "Horror"
  ],
  "description": "Two years after defeating a satanic cult led by his babysitter Bee, Cole's trying to forget his past and focus on surviving high school. But when old enemies unexpectedly return, Cole will once again have to outsmart the forces of evil.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yx7akzfwbPCLlxKgZ1NycThFC92.jpg",
  "categories": {
    "plot": 5.2727272727272725,
    "acting": 5.714285714285714,
    "ending": 6.714285714285714,
    "soundtrack": 3.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 4.75,
    "action": 3.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Perfect Movie to turn your brain off while watching and just enjoy. I recommend this to any fan of the original."
    },
    {
      "rating": "9",
      "text": "Don't listen to the official critics. Like it's predecessor, it's a fun and enjoyable horror comedy. Nice dark humor, good story, nice acting and film production. Grab your beers and enjoy!!"
    },
    {
      "rating": "3",
      "text": "This film is bad.  But the prequel is excellent fun.  I was shocked how much I liked the first film...Go see it...it's great ! And If you haven't seen it in a while then watch it... instead of this hot trash!Seriously it fails on every level. OMG it's sooo bad. But the sad thing is ...it didn't have to be trash or this bad.  Same actors and writer / director.  The first 30 mins is fine. It tricks you into hoping it may be good.  But once the black stereotypes begin (and never stop) the film is all downhill. So it recreates the exact same film but without the house and so without the tension and creativity.  The writing is infantile and creepy. It's really creepy... and lazy.  With tired cultural references and lame pot drug and poop jokes.  Also they take the one genuinely nice relationship which has real chemistry and...yeah they **** all over that and force a new unrealistic one on us.  It has some bad cgi too and the music from mass effect. You know a film is total trash when you're using your phone to Google the first film while watching the sequel.  Did I mention it's creepy. With older men writing for younger men who hang with younger kids and it shows.  Like your dad wrote you a movie but only because he fancies your best friend on something messed up stuff lol like ...there is a scene with a guy accidentally pissing on a girls face and she's ok with it.  And every girl in the film obsesses on her boobs.  Also the the music is all this stuff from the directors ancient past and out of place as much as the creepy jokes.I hope they don't make a sequel.  The only reason they made this garbage was becasue the director was given more money after the first one was a hit and he made this absolutely trash 80s kids spin off which flopped horribly.This film is undeserving of the babysitter title.  Avoid like the plague."
    },
    {
      "rating": "9",
      "text": "Loved it. Daft, gory, horror. Some dated references thrown in for older audiences - it's not all about the teen viewers after all! Great watch!"
    },
    {
      "rating": "10",
      "text": "This time, the movie has so many gore, silly action, n joke. The ending is the special part n super mind blowing. Make the third movie asap n bring bee back pls."
    },
    {
      "rating": "10",
      "text": "This is probably the best movie ever made, i love the humor and the action. The story is awesome too, hopefully they make anotha one."
    },
    {
      "rating": "2",
      "text": "I can understand the first one, and even though I didn't like it, it was certainly more entertaining, but this film is just a painful, an incredibly painful attempt to capitalize on the unexpected success of the first one.It wasn't funny, nor scary, and yes I know, being scary was going to be a big deal for this one, yet the humorous horror is just plain stupid.I have to give Netflix credit for how it balances its releases, because a week ago they released Charlie Kaufman's new film for more \"selective audiences\" and now they put out this crappy show for the subscribers that need more new stuff every week, but hell, it's so **** bad."
    },
    {
      "rating": "6",
      "text": "Though it maintains the camp aesthetic of the first film, McG (as he did with Charlie's Angels: Full Throttle) has incorporated too many ideas and subplots into the horror sequel. Overall not bad, but not great."
    },
    {
      "rating": "2",
      "text": "inferior to the original in just about every way possible. A charmless,gormless mess that lumbers on as a loose collection of poorly thought out setups, bad jokes and stilted acting. The edit has so much dead air around lines that it feels like a first assembly, not a finished product."
    },
    {
      "rating": "9",
      "text": "If you did not like the original there is no point in seeing this one.  While watching the first I found myself yelling, \"WTF just happened!?!\"  Well, this one had me yelling, \" WTF just happened...AGAIN!?!\"  It's hilarious, it's gory, and it's confusing.  Just sit back and wonder...WTF."
    },
    {
      "rating": "4",
      "text": "Wow, there actual made a sequel. I wasn't a fan of the first one, but I wanted to see what kind of nonsense they could cook up this time.I mean, I would watch anything for my main man, McG.The sequel is no better from the last, but I won't lie, I found some enjoyment from it. Not a good movie by any means, but a guilty pleasure for me. However, it needed more Samara Weaving as she isn’t in the movie that much."
    },
    {
      "rating": "6",
      "text": "I suppose it had it's moments of being slightly entertaining in an odd, stupid kind of way, but it was a bit better than I thought it would be. Nevertheless, it still isn't my kind of movie. Not something I'd go out of my way to see again."
    },
    {
      "rating": "7",
      "text": "Film demenziale che intrattiene facendo il suo lavoro, nulla di eccezionale, ma divertente."
    },
    {
      "rating": "4",
      "text": "I had no idea what was going on for the most time, but I know that I had fun watching this."
    },
    {
      "rating": "5",
      "text": "The sequel to The babysitter! And... well it's still ridiculous and rather dumb. The chicks are still dressed like sluts, and the kid that could have been The Rainmaker is a weak intellectual until demons show up, and they show up in a stupidly contrived manner. But it's still entertaining to watch this comedic teen adventure, even if it is much weaker than its predecessor. I give it a 5/10."
    },
    {
      "rating": "7",
      "text": "Mais insano e tão divertido quanto o primeiro filme. Temos uma continuação que não resiste o artificio de achar que mais é melhor e felizmente isso funciona aqui, pois a insanidade faz parte da narrativa. Aqui temos mais demônios, mais pessoas tentando fugir e muitas reviravoltas, tudo coberto de muito sangue e piadas. Piadas essas que funcionam menos quanto eu gostaria, mas ainda assim, somando a um timing excelente da montagem dá a um filme um ritmo ótimo pro longa que é sempre interessanteTirando um momento ou dois que ele é viajado demais até pra proposta, não tenho muito o que reclamar. Divertido e sanguinário na medida certa (muito)"
    },
    {
      "rating": "7",
      "text": "Not as good as the first movie, but still quite fun to watch. I didn't even notice the time that passed until I saw the credits roll."
    },
    {
      "rating": "8",
      "text": "Given that this is a sequel with a returning cast, little time was wasted getting to the best part of the last movie with the blood cult. The gore is just as bloody as last time.The Babysitter: Killer Queen is a more expensive version of the last movie. If you are a fan of the The Babysitter, you'll enjoy Killer Queen."
    },
    {
      "rating": "4",
      "text": "Unfortunately, the refreshing emotional nuance that was written in the first film is missing in this sequel. The gore and jump scares were a bit too forced and expected along with some the disjointed humor.The cast did a great job with the story they were given.The first story had higher stakes and more cohesion."
    },
    {
      "rating": "6",
      "text": "An unnecessary sequel if the cast is taken into account, even so, The Babysitter: Killer Queen is saved with just enough by the good mix of horror and comedy."
    },
    {
      "rating": "2",
      "text": "Cole's friend from the first one is trying to kill him with a new group of morons, the old group is back from the dead but Cole defeats them...by getting laid."
    },
    {
      "rating": "10",
      "text": "absolutely loved this movie. I loved the first movie and I was hoping they do a sequel and they did so my dream came true. I really do hope they do a third one because of how the second one ended because the director McG already has plans for the third movie, so lets hope he does a third movie.This movie is better than the first one. In this movie is has a lot of \"oh my God I can't believe that just happened\". Also has many gory scenes in, and also has a big twist at the end of the movie but I'll let you find it out of what that twist is. So if your a fan of the first movie then you will most likely enjoy the sequel."
    },
    {
      "rating": "10",
      "text": "Ignore the Critics, If you love the firstMovie then this one is full of the same level humour, Gory deaths, And old and new characters who make the movie so much better."
    },
    {
      "rating": "10",
      "text": "This movie has so many genres and it’s very interesting to watch. I love this movie so much I watched it with others and they loved and can’t stop talking about it. If there’s a part three I will be so excited. I really hope there will be a part 3."
    },
    {
      "rating": "10",
      "text": "Seen it 6 times already, I don't think I'll ever come across a better sequel. Don't get me wrong, I loved the first but this one was way better. If not twice this movie is atleast worth watching once."
    },
    {
      "rating": "10",
      "text": "I think this move was awesome i dont know why its only 22 very underrated i wish they make the third move"
    },
    {
      "rating": "1",
      "text": "For me this movie was bad. When I see trailer i was so hyped cause I like the first part but when i watch this movie I was so disapointed. That was just bad."
    },
    {
      "rating": "0",
      "text": "The Babysitter Killer Queen: This is a spoiler filled review so just a heads up if you want to watch this skip the review watch it and come back and we can all COMPLAIN ABOUT HOW ASS THIS MOVIE WAS. Alright so I’m getting to the point here why was Samara Weaving retconned into a good guy when in the first movie she was the main antagonist. For real she comes up at the end of the movie to save Cole and his new girlfriend, yeah Jena Ortega is in this movie and not to mention the movie actually says they had sex, sure I’m not going to pretend I’m a saint but earlier in the movie you hear the Cole is a freshman in high school. But I do like the chemistry between Cole and Phoebe have together but I hate the love story thing in this. The first movie had Cole being a hero and stuff and he kisses Melanie near the end but it wasn’t a love story. Speaking of her come on, she is now the main antagonist of this which I find lazy and stupid because she was the whole reason Cole finally grew a pair and “killed” Bee at the end, but now she looks more like Samara Weaving then anything. But the characters besides the School Nurse, Cole, his parents, Melanie’s dad and Phoebe just **** suck. We got Andrew Bachelor back aka King Bach and he is more annoying then anything, he twerks in the movie, that’s comedy, Bella Thorne is back complaining she shouldn’t do anything because she’s hot, I do have to give probs Robbie Amell who plays Max the guy who always has his shirt off he does a good job. We get useless backstories to how they were recruited and it’s just a slog. But the best thing is the kills OH MY GOD, as soon as the first girl gets her throat slit it goes more wild then ever, some of the blood is CGI but most of it looks practical from what I can tell. Overall this is a useless sequel just around to give us more kills if you want to watch a Babysitter movie watch the first. McG has to be someone that can make a good movie and then **** the bed. Ranking Toilet Paper."
    },
    {
      "rating": "6",
      "text": "I think that the first movie is way better than this. It's really mediocre but definietly not one of the worst movies of 2020."
    },
    {
      "rating": "7",
      "text": "This is a really great and fitting sequel. The first film had a proper ending but this continued the story in a new film and wrapped the new story up. I love films that finish properly! The pace is blistering, the acting memorable and epic, the characters (even the evil ones) charismatic and engaging. The film looks highly processed and digital giving it an unreal feel, this is not necessarily a bad thing just worth being aware of. This oozes style, comedy, action and excitement. Well worth watching, just make sure you watch The Babysitter (20117) first."
    }
  ]
}