{
  "id": 3507,
  "title": "The Post",
  "starring": [
    "Meryl Streep",
    "Tom Hanks"
  ],
  "runtime": 116,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "A cover-up that spanned four U.S. Presidents pushed the country's first female newspaper publisher and a hard-driving editor to join an unprecedented battle between journalist and government. Inspired by true events.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/h4XG3g6uMMPIBPjAoQhC2QIMdkl.jpg",
  "categories": {
    "plot": 7.634146341463414,
    "acting": 7.611111111111111,
    "ending": 8.142857142857142,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 10.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Another revenue hungry Speilberg throwaway.  The promo cover says it all.  With HANKS & STREEP in mega large font at the very top, and the actual title of the film in very small font at the bottom.  \"Look, two names we know an love!... oh, and it's called The Post\".  Pathetic tactic.  Totally unoriginal, banal and just plain boring.  The shame lies in the fact that the true story is an amazing one.  You've seen this film a million times over.  It was called 'All the Presidents Men' the first time.  Cookie cutter political big name bait at it's finest.  I advise leaving this movie for the birds and watching 'All the Presidents Men', followed by a Pentagon Papers documentary of your choice.  There are many great ones. In ten years this film will be hardly remembered, regardless of hollow accolades."
    },
    {
      "rating": "7",
      "text": "This is more of a layup for Spielberg than a slam dunk, but it's a respectable film all the same.  The cast is excellent and Spielberg does a good job of evoking the look and feel of the era.  Many will roll their eyes and sneer at the self-congratulatory nature of the proceedings, but it's still a story that's worth telling nearly 50 years later."
    },
    {
      "rating": "8",
      "text": "The plot and a lot of dialogue in this film is obvious. You can see the plot points and the message being made way ahead of time. There isn't much to surprise you.However, the film is saved by Steven Spielberg's expert direction (the film looks great) and wonderful performances by the entire cast. Credit should especially be given to Meryl Streep's nuanced performance.I can't say you should see this in theaters, but the film is definitely worth a watch."
    },
    {
      "rating": "7",
      "text": "It's always been a delight to watch a Steven Spielberg movie; no matter which style or genre he's tackling, he's a proven master craftsman who has a unique way of handling lives. This time, he has chosen to say the story of a big triumph in a small world of 'free expression'; the courage it took for Katharine Graham, the owner-publisher of the Washington Post, to divulge highly classified information on one of the biggest diplomatic lies that has ever been told-the Pentagon papers and the Vietnam War! It was no mere journalistic victory, given a bold Lady's guts it took to make an advance move; the effort put in by Ben Bradlee-the Editor in Chief, and his team in condensing the immense contents of the papers to its simplest relatable form. There's a scene in the movie where Katherine quotes her husband Phil, on the ironic immensity of the press' nature-\"News is the first rough draft of History!\". And who brings it out, definitely the Press. If there's been a big reason as to why Spielberg made 'The Post' in 2017, it's to assert the significance of free Press and censure in a Democratic setup.Meryl Streep as Mrs.Grahams and Tom Hanks as Bradlee is a dream cast for any movie on the same subject; yeah it's not a dream anymore! There's nothing more to comment on their acting or Spielberg's direction, they're proven masters of this trade. The way Streep and Hanks make their acting seem so effortless presents a true befuddlement. When it comes to the other master, there's a specific purport, dignity, intrigue and mastery in his storytelling, as always. Nowadays, only in a Spielberg movie can you spot a neatly executed Dolly zoom, trolley movements and classic close-ups. There'll definitely be Janusz Kaminsky, Michael Kahn and John Williams to his legendary squad, and so they are here. An impeccable army!Investigative journalism is one of Hollywood's widely dealt with topic; to pick some classic examples we have an 'All The President's Men', a Spotlight and a Zodiac-even the father of all well made movies 'Citizen Kane' is ultimately a movie on Press. 'The Post' begins off like a satire on 'Nam, and later takes off in a more linear direction. It's a known story, rather a page from renowned History textbooks; that's where the real challenge lies, to make an engaging movie on a story whose beginning and ends you already know, everybody knows. I believe Liz Hannah has achieved it hands down, credits to the rightful assistance meted out by Josh Singer, one of the men behind Spotlight, a rightful hire. Needless to say, the 'class' and the substance is only amped up by the hands of the big Master. From what happened in 'Nam, to what happens in the Post's unofficial Board Meetings, to what goes through the mind of a sensitive Mrs.Grahams, to what's going on in the White House and down even to Watergate, Spielberg has shown it all. We know the Vietnam War wasn't neither a big victory, nor short of a great number of casualties; it was a long kept Diplomatic Secret which left no more spaces to public negotiation; a terrible loss followed by inglorious consequences. To rationalise the ill sides of such an important event in History; to make it available to the Public is a sure buy for any seller, but an even riskier task for a journalist.Now, one may ask who really cares whether or not someone had made an age-old lie; one may ask why it needs to be discussed in the current world scenario? The world is getting torn apart by civil wars and mostly internal strifes, democracies are nearing a halt, nepotism is gaining a headway in all spheres, and totalitarianism is slowly finding its way back to immense adjacencies(even Disney bought Fox AF!). The face of the world is changing, and new currents are growingly apathetic to public expression and free press. This is where 'The Post' holds a contemporary relevance; this is an ode to unsung journalistic heroes, and a note of encouraging their good spirits. Such an important lesson to come from a classic team, 'The Post' is for times to come!!! Won't be surprised if it wins the Big Prize!????"
    },
    {
      "rating": "8",
      "text": "This true story of the battle between the 1st Amendment and a paranoid Nixon administration and the cover up of papers that admitted in classified documents that the Vietnam War was a losing battle that could never be won, but kept dragging on because every President from Kennedy to Nixon did not want to be the one holding the bag for a lost war, the first one protesters and many Americans had already decided was a pointless genocide of innocent lives of civilians and American soldiers alike.    While the New York Times was the first paper to break the story after a \"source\" had managed to make copies of the multitude of pages of the criminal extension of the war and gave them to the NYT.    A court injunction swiftly followed, and the Nixon regime was hell bent on denying the American press the freedom to publish articles that he felt were incriminating to him.    Tom Hanks and Meryl Streep play the editor and publisher/owner of the Washington Post, which thanks to a fluke of timing, had escaped the dragnet Nixon imposed on the NYT because the Times scooped the Post.    The Post eventually got copies of the documents, printed part of them and found themselves in court, too.    The fight leading up to releasing these documents is the primary focus of the movie, with both sides having good arguments for running the story and not, with freedom of the press at stake if they didn't, and the possible total failure of the Post, which had just begun publicly trading shares on the American Stock Exchange.    It was widely known that Nixon and his henchmen were very dirty players, willing to do anything to protect the President.    Streep is always in fine form, playing Katherine Graham, who must make the final decision to run the first series of articles, and Tom Hanks as the editor Ben Bradlee, who is for publishing the article in the name of press freedom and the right to exercise press' obligations to expose wrongdoing and informing the nation or city where a smaller paper may be to its readers.    The acting is top notch, the tensions palpable, and for Spielberg, a somewhat modest screenplay but effective nonetheless.    What is disturbing is the fact that this type of journalism that took guts to even practice is sadly gone today.    Rather than big corporations being subject to being covered in the major papers if they did bad things, now major market media is totally operated by big corporations who decree every last detail what will be allowed to print in any paper or most internet sites, how it's slanted, or what is covered up.    When we live in a time when the New York Times won't even call Donald Trump a racist we know the fix is in.    Some maverick remnants of real journalism exist online, but now that internet neutrality is dead, it is a matter of very little time that providers will be pressured or paid to make access to web content the corporations that own them harder or impossible.    The only way to preserve our 1st Amendment is to practice it, and see \"The Post\" to see what real journalism used to be like."
    },
    {
      "rating": "7",
      "text": "While Steven Speilberg's direction, the acting of its ensemble cast, the cinematography, and content of the film is enchanting, it is too chaotic and unevenly paced at many occasions."
    },
    {
      "rating": "5",
      "text": "This was work to get through.I mean, great performances all around, except for Tom Hanks which I will explain later. Meryl Streep, Bob Odenkirk, and Sarah Paulson were fantastic, having standout moments through out as all three carry the film on their shoulders. With Tom Hanks, not saying he was bad, just easily the weak link and failed to impress me. Nothing about his performance felt natural and came across too forced in certain scenes.\"The Post\" tackles a serious subject matter and easily sheds light on relevant topics of today, hence why it was rushed into production - too bad it's not that memorable for any future discussion, which is unfortunate .At the moment, Spielberg makes factor type films. While not a hack, but lost his prime. I will continue to watch his movies, old or new, because even Spielberg's worser movies are not poorly made, at least. Now lets see about \"Ready Player One\"."
    },
    {
      "rating": "8",
      "text": "\"The Post\" was a very good movie, another treasure of the legendary Steven Spielberg. Meryl Streep and Tom Hanks are undoubtedly one of the greatest actors on this planet, and their performances were good. Although the story was a little loose, it's exciting. It also gives us an important lesson about the freedom of the press that everyone should listen to."
    },
    {
      "rating": "7",
      "text": "The performances were well done, the cinematography is great, but the movie failed to intrigue me in its story, and after a while I felt almost a bit bored and waited it to finish. The movie might not have been made for my demographic of a teen, but I thought it could've done more to interest me. However, the scenes where they are all at Tom Hank's character's house is amazing and was a saving grace for me, and I wish the whole movie was the exciting, instead of boring and lack luster at some points."
    },
    {
      "rating": "9",
      "text": "The Post may be one of the most heavily cast films in quite a while. Almost everyone in the film is well known for one project or another, and two of the greatest actors alive are playing the two lead roles. It is obvious that this was an all out attempt to win all of the awards, but surprisingly the film doesn't appear to be a favorite for really any of the major awards. And that's surprising to me, very surprising, because I found this film riveting from start to finish. The matter at hand couldn't be more relevant today, and the way Spielberg decided to present the story takes what could be a rather slow and boring film and turns it into a highly re-watchable film. I will say that I might be a bit more interested in the subject matter at hand than most people, which may factor into my fondness of this film, but I still think most people will enjoy it. 2018 is off to a good start."
    },
    {
      "rating": "3",
      "text": "A slow-paced, marginally interesting, Hollywood propaganda project that is clearly intended to try and dissuade the public from believing much of today's news is in fact \"fake.\"p.s.  It didn't work!"
    },
    {
      "rating": "9",
      "text": "The Post tells the story of how the American press faced the dilemma of whether or not to publish the Pentagon papers, containing information about the Vietnam War that was withheld from the public. I thought this film was incredibly well acted, and as always Tom Hanks was excellent in this role. He really sold you his character, and brought a sense of realism to this amazing story. For a film where almost nothing action-happens save for the intro, the script was very well written and tied up all loose ends by the film's end. Meryl Streep played the owner of the Washington Post, and really portrayed the sense of naivety and shyness her character has at the beginning of the story (as a new businesswoman thrown into the deep end very well due to catastrophic circumstances) very well, and throughout the film you could really see her changing and adapting to the times, so by the end of the story she is an assured, sure-footed woman who knows what's best for her and her company, and this was a very satisfying arc and storyline. This film is extremely prevalent in today's society, as it explores themes of woman empowerment and the obvious political situation of 'fake news' and whatnot, and I think Spielberg struck the perfect balance between subtlety and over-doing it, as if one wanted to watch this casually as a film when bored, these serious themes wouldn't jump out at you and take your full attention. Speaking of Spielberg, he has yet again brilliantly helmed this movie, mixing longer takes with shorter ones and never keeping you bored, however I admit the second half of the movie picks up significantly and is much more involving and riveting than the first, although a film with this much backstory and context is bound to have necessary exposition and introduction. Overall, definitely see this movie, definitely for the story and then for potentially Oscar-nom worthy performances of Streep and Hanks (oh, and Bob Odenkirk was great too.)"
    },
    {
      "rating": "5",
      "text": "I found this dull, without tension. The jokey moments were odd.  The protestors were all hippies, as if they were the only people against the war.  The end with Watergate was totally unnecessary.  Instead of seeing this, re-watch All the President's Men.  It's a far superior film."
    },
    {
      "rating": "5",
      "text": "I like a historically-based drama, but they sucked all the life out of this one. It was just plain dull. I absolutely loved All the President's Men and Spotlight, two much better movies in this genre. The cast contained many famous faces, but I actually think that worked against this movie. I never could get past the famous faces to see the characters themselves...and a lot of that was due to how insipid the script was. I guess I just expected something better."
    },
    {
      "rating": "5",
      "text": "What is going on with the film critics!This was NOT a good movie.it was long and drawn out, and only came together near the end.The critics are going through a bad period at the moment , slating some movies, like The Greatest Showman who's popularity spread like wild fire, and praising others like this one."
    },
    {
      "rating": "10",
      "text": "I am not giving this film a 10 for political reasons. I lived through this era (when bone spurs were epidemic among wealthy young men), and for me it is simply an excellent re-creation of history and a superb film with a wonderful cast. I thought Meryl Streep was flawless as Katherine Graham, and Tom Hanks was excellent although not as natural and believable as Streep. I am also not a huge Spielberg fan (except for films like Minority Report), but I thought he did a great job of telling a complex story full of tension and suspense, even though many in the audience knew “how it came out.” I didn’t think this film had a chance for “Best Picture” at the Academy Awards, but now, having seen it, I am not so sure -- and not for political reasons."
    },
    {
      "rating": "10",
      "text": "Just got home after seeing The Post and feel compelled to write a raving review. This is easily one of the best movies of the year and certainly the most relevant to issues of the year:  freedom of the press and women's empowerment.  I was deeply moved, inspired and found hope and optimism from this movie. The film does a great job of portraying the complexities of our messy world  and our heroes as people making difficult choices while they work through situations.  For feminists,  Katharine Graham should be a hero as should all the news people who take risks \"to serve the governed, not the governors\"."
    },
    {
      "rating": "8",
      "text": "Given the talent assembled: Spielberg, Hanks, Streep, and many more greats, along with a story that's both historical and timely, it may seem like it has the ingredients to one great film, but to some, that may appear quite Oscar-baity at first glance. Well I can honestly say that it is a bit of both, but the Oscar-bait part hardly even matters if you ask me, because this was still a thoroughly engaging and solidly-acted and told story! Streep and Hanks are so captivating to watch together, and the rest of the ensemble cast puts in some brilliant work and moments of their own as well! Overall, yes it is a conventional and somewhat straightforward Oscar-bait film in many ways, but like I said before, Spielberg, Streep, and Hanks!? How can you possibly go wrong with a combination like that!?"
    },
    {
      "rating": "9",
      "text": "Steven Spielberg is such a fine director that he can make you sit on the edge of your seat for the answer to a question you already know. You lived through the exposure of the Pentagon Papers and the ruling of the Supreme Court—as most of the members in the audience did—yet as it comes closer and closer to the outcome you question yourself as to whether you remembered it right!“The Post” shows that our current President wants to curtail what and which news reports on him, including what reporters, just as President Nixon did when, at first, the New York Times exposed the massive report on the Vietnam War and was challenged by him and brought to the court.“The Post” tells the story of the Washington Post, whose owner Katherine Graham inherited the paper left to her husband by her father and she became the owner after the former committed suicide. The company is talking about going public and her decision to print the Pentagon Papers, started by the Secretary of Defense Robert McNamara, a good friend of hers, could bring disgrace to him for continuing the indefensible war, she and her editor played by Tom Hanks could go to prison and the new shares of the company could be worthless.There is a lot of exposition to be told but Spielberg, along with writers Liz Hannah and Josh Singer, keeps the movie going until the story takes over with the decisions Graham must make, the actual showing how a newspaper is put together from setting the type to getting the paper in bundles and delivered. There is very little time wasted in this 1 hour and 55-minute movie that doesn’t seem even that long!From Bruce Greenwood as Robert McNamara, Bob Odenkirk as the Post’s managing editor Ben Bagdikian, Matthew Rhys as Daniel Ellsberg who  leaked the Pentagon Papers to the New York Times  reporter, along with other actors like Tracy Letts, Sarah Paulson, Bradley Whitford, Alison Brie, Carrie Coon among others get their time/moments to shine.Tom Hanks, as good as he is, fights the memorable Oscar-winning performance of Jason Robards as Ben Bradlee in “All The President’s Men”. I am not particularly a fan of Meryl Streep as I always see her ‘acting’ but in this movie, she becomes Katherine Graham.“The Post”, in spite of the story, the actors and writers, is a Steven Spielberg movie from beginning to end, who at 70 seems to still have not reached his height yet!"
    },
    {
      "rating": "1",
      "text": "Tedious, ponderous, overrated, dishonest. This is all I have to say about this film."
    },
    {
      "rating": "10",
      "text": "It's one of the most entertaining movies made by Steven Spielberg and of course I have to mention the incredible work that has been done in this movie by both Meryl Streep and Tom Hanks."
    },
    {
      "rating": "8",
      "text": "The Post is Spielberg in his element, a warm up act in line for his next blockbuster, Ready Player One.  It's obviously an Oscar grab for sure, but the master has made a somewhat surprising 'thriller' on this topic, what is essentially a 'newspaper' flick.  As per usual, Hanks and Streep are great, but not their best work here.  Great film all around with a strong 'political commentary' relevant to the current situation in the US."
    },
    {
      "rating": "7",
      "text": "The Post is, in most ways (I'm not going to go into any controversies this movie may bring up) an average movie. Everything about it was just, okay.Acting: Tom Hanks was definitely not the perfect actor for the role. Ben Bradlee was a meaner, cigar-smoking guy, yet whenever Hanks appears on screen, I see Tom Hanks. He does try to fit the character more, but in the end, he's still Tom Hanks.Miscellaneous: The thing about this movie is that Spielberg obviously had to make 2 hours of talking interesting. Hence why most of the scenes in this movie involve choreography. In nearly every scene, people are circling each other or moving around in some way, to give the scenes energy that they would lack if they were just talking about newspapers. This makes it feel all the more unrealistic and even makes it feel like a play. Characters will often speak in perfect order, starting right after the last one stops. The whole movie is so Hollywood and polished that it feels completely unrealistic. I also felt it lacked complete emotional investment. Sure, seeing Meryl Streep shut down the men in charge who dislike her is great and all, but otherwise I never felt much tension, even with the intense movements.I did not love The Post, but it killed 2 hours and I don't feel they were wasted. It's worth watching just because it'll probably get a few nominations, and it is Spielberg after all. It's probably one of the most average, passable movies I've seen in a while."
    },
    {
      "rating": "8",
      "text": "Historically (and not only!) accurate & really a political thriller that depicts today's chaos. This movie speaks the truth elegantly and eloquently."
    },
    {
      "rating": "7",
      "text": "Solid movie, I enjoyed the story it told.  Tom Hanks put on a good performance, but Meryl Streep was great.  Don't think this was Spielberg's best work, there were some questionable decisions and over-the-top, obvious ways of getting a message across.  Such as Streep walking down the court steps after the hearing and walking through a line of women only, and if that wasn't obvious enough there's a spotlight on her now too.  But overall i enjoyed watching The Post, and would recommend."
    },
    {
      "rating": "10",
      "text": "It is a masterpiece. I do not see why people may not like it. It was thought out well shot by shot. The dialogue, scenery and story line is amazing."
    },
    {
      "rating": "10",
      "text": "It is a spectacular movie. Hanks and Streep's acting is at an all time high in this movie. Spielberg's direction is definitely evident."
    },
    {
      "rating": "6",
      "text": "It's a decent film, but doesn't provide any of the real juicy depth in the story.  Tom Hanks is the primary weakness in the film - his performance pales on comparison to Jason Robards' performance in All The President's Men. Bradlee was a much tougher, acerbic, dynamic figure than Hanks displays. And Sarah Paulson as Tony Bradlee is equally as weak. (As an aside, when she says she was \"sad\" looking at the picture of she, Ben, Jack, and Jackie, I wish Spielberg had gone the step further to explain WHY she was said - what happened on the boat - when Jack assaulted her, which was discussed so artfully in the recent HBO doc on Ben's life.) The other primary weakness is the Daniel Ellsberg role. Matthew Rhys is outstanding, but I wanted to know more about how and why he decided to leak the papers. (Especially given the recent actions of RealityWinner and Snowden.)  The Vietnam sequence in the beginning is wasted. Also, Bradley Whitford hams it up like he does in most roles, largely to negative effect. Meryl Streep really saves the film with an elegant, nuanced performance, though again, I would have loved just a bit more information about how a 45-year-old who never held a job in her life was able to transition in to the primary ownership role of the Washington Post."
    },
    {
      "rating": "10",
      "text": "Another Top Spielberg movie! Highly recommended. Well acted and definitely oscar worthy."
    },
    {
      "rating": "2",
      "text": "If you want a good drama. Go see Darkest Hour. You want a whitewash of how the Media sabotaged the U.S. and our South Vietnamese allies, go see this."
    },
    {
      "rating": "10",
      "text": "I watched \"The Post\" this evening, a movie based on events from our near past and about the fifth estate and its role in keeping our leaders honest. I was surprised to see that a movie with minimal violence and no romance filled every seat in the theater.To my left sat a gentlemen I estimate to be in his mid-seventies, accompanied by a middle-aged woman I assume to be his daughter. This man would have been in his late twenties at the time of the publishing of the Pentagon Papers, so he lived the history at a time when he was probably most in tune with the gestalt of that era. I was extremely interested in his reactions and paid extra attention to him throughout the film, but alas, he remained stoic and silent. The woman made plenty of commentary for the both of them.At the end of the film, as I stood up to leave, I saw the old man wipe his eyes.I wonder, in another forty years when I am that old gentleman, and when I'm watching the film about the Great Struggles of my generation, will I be proud of my convictions and where I stood? Will the lens of history judge me kindly?"
    },
    {
      "rating": "0",
      "text": "Perhaps a bit harsh in my score but the film, while clearly well produced/directed/acted, just wasn't very interesting/emotionally affecting"
    },
    {
      "rating": "7",
      "text": "Three of entertainment's biggest names unite for what's supposed to be one of journalism's greatest untold stories. But unfortunately for Hanks, Spielberg, and Streep, everything in \"The Post\" only shakes out to being just fine in the end. Sure, the acting is quite good, the subject matter is mostly interesting, and Spielberg's directorial abilities are nowhere close to being questioned. But with similar movies like \"All The President's Men,\" \"The Insider,\" and \"Spotlight\" already being in the realm of cinematic existence, you can't help but get a cold kind of \"been there, done that\" air from this film in particular."
    },
    {
      "rating": "8",
      "text": "Was hoping for a journalism story equal to All the President's Men or Spotlight, but instead got just a solid Spielberg film. It doesn't quite meet those lofty heights though the performances are all great and the second half is pretty riveting. A-"
    },
    {
      "rating": "8",
      "text": "After a painfully slow start, \"The Post\" thankfully finds its legs about 40 minutes in, at last taking off on a more engaging pace as it moves toward an inspiring, albeit predictably feel good conclusion. It's a film with a timely (though, one can't help but cynically wonder, regrettably tardy) message about the state of journalism in an America presently besieged by corporate media consolidation and heavy-handed attempts to quash free speech. Meryl Streep and Tom Hanks turn in adequate performances in their lead roles (though definitely far from their best), with the real stars shining in the supporting parts (particularly Bob Odenkirk, Bruce Greenwood and Matthew Rhys). Given the current political climate, \"The Post\" is the right film with the right message that liberal Hollywood adores and loves to lavish with honors. It's just too bad that it's not a better picture."
    },
    {
      "rating": "9",
      "text": "Saw an early screening of the movie. Not perfect but pretty darn close! It was a joy to watch. Tom Hanks and Meryl Streep were amazing and overall this was a great Steven Spielberg film. It has a brilliant premise."
    },
    {
      "rating": "0",
      "text": "A film which avoids the real truth, the truth that, much more often than not, the mass media, NYT and Washington Post included, are complicit collaborators with corporate backed politicians. The intervals where they are not only serve as last ditch counter arguments to this dilemma, ie if they protest the establishment, how could they support it? The true answer is, they are funded by, owned by, and advertise for, who they are being pictured to oppose. Period. End of the actual story."
    },
    {
      "rating": "0",
      "text": "Partisan propaganda film for democratic party acolytes. If you are partisan left you will likely love it. If you are moderate or right leaning you probably won't. I wasn't alive in the 70's but I doubt news organizations were that much less corrupt than they are now. Political parties and media corps have been in bed together since the country's inception after all. Look up Tammany Hall for an example from 1790. Also remember that we have been at war continuously for about a decade and a half now... Where was the \"heroism\" of the 2012 \"The Post\"? If that doesn't matter to you put on your horse blinders and prepare to be \"inspired\" by this Bezos funded prop piece."
    },
    {
      "rating": "5",
      "text": "Typical Spielberg. Doesn't do anything interesting with it's interesting and timely true story, and Tom Hanks and Meryl Streep sleepwalk their way through this for the most part."
    },
    {
      "rating": "1",
      "text": "Not applicable to news reporting today. Now we get biased news so didn’t Enjoy only for that reason."
    },
    {
      "rating": "8",
      "text": "Meryl Streep and Tom Hanks can just do no wrong and both powerhouse actors deliver an impressive performance. The Post tackles the story behind the Vietnam War and the need to expose the truth! It is about Freedom of Speech and how newspapers are \"the draft of history.\" The movie is slow at first but escalates rather quickly."
    },
    {
      "rating": "0",
      "text": "Don't even think of going into this movie without a basic knowledge of journalist jargon and the controversy surrounding the pentagon papers. It's like Spielberg is assuming we all have this understanding and refuses to put anything in layman's terms. Maybe even a short paragraph at the beginning to introduce the story or setting would have been nice. It was so boring that I left the cinema after half an hourand I'm a trained journalist with an interest in politics. Where's the drama? Where's the excitement? Is this what cinema has come to? Intellectual masturbation? Surely we go to the cinema to be entertained as well as informed. It's not so much the way the story is told as it probably couldn't be told any other way, its the fact that this subject has been made into a movie at all. I'm not saying I just want to see super heros pounding each other, but let's at least keep to the spirit of entertainment encapsulated within the birth of cinema."
    },
    {
      "rating": "10",
      "text": "The most important movie right now, and only the magical trio of Streep, Hanks, and Spielberg could make it what it is. Oh yeah, and Meryl Streep is definitely not overrated. The phone scene alone makes that clear as day. And thank you Ann Roth for that glorious caftan. There’s a reason why the 1st Amendment is 1st y’all."
    },
    {
      "rating": "1",
      "text": "Positioned by the Hollywood elite (anti-Trump, anti-US, Far Left Globalists) to take advantage of the long Cmas holiday break, their impotent little effort at supporting the MSM perspective was the biggest FAIL of the season! Limping to a measly $27M which won't even pay for the principal cast let alone full production. Way to go America for ignoring political hate messaging!"
    },
    {
      "rating": "10",
      "text": "I doubt this movie would have been made, or gotten people to be interested in watching it, if not for the current political climate which seems to be more than just repeating the mistakes of the past. As we watched this movie, it's incredible how the tension builds even though we know what's going to happen. I was reading the negative reviews of this movie, and it's quite obvious which side we lean on when giving a review for this movie. I wish people had honorable convictions in real life as they appear to have in this movie. Even if the people they are recreating in this movie didn't do everything the movie says they did, I wish they had. So for us, it was a wonderful movie about people's integrity and what they do about it. Our 23 year old was amazed at what life was about without cell phones, without electronic data, and how we used to publish papers. Finally, while the acting was good by all with much sincerity, Meryl Streep's role sure shows her merit as our greatest living actress since this isn't a showy role. Meryl has to convey emotions with subtle face expression and the tone of her voice. She truly gives us the feeling that she knows she's in over her head, yet hangs in there. This story has been made necessary to remind the public of how some politicians work against Americans."
    },
    {
      "rating": "10",
      "text": "“The Post” is the best kind of movie.  A thoughtful, erudite story, with a real sense of idealism and history, told in the best cinematic language.  This is Steven Spielberg’s finest work, the movie that proves him to be a real auteur.  The performances are uniformly excellent, with Meryl Streep’s remarkable rendering of Washington Post publisher Katherine Graham possibly the best work of her long and distinguished career.  Tom Hanks perfectly captures Ben Bradlee’s charismatic personality, gravelly voice and vocabulary, and the zest for journalism and for life that dominated and shaped his career.  Everything is right about this film, it is exquisitely paced, lovingly detailed, and equally moving, funny and thrilling.  That it is subtle in such wonderful ways, at a time when there is very little subtlety or care in storytelling on screen, makes “The Post” a rarity to be cherished.  It also makes it, in my opinion, the best film of the year."
    },
    {
      "rating": "8",
      "text": "“The Post” stars Meryl Streep and Tom Hanks in this bio-drama written by Liv Hannah and Josh Singer and directed by Steven Spielberg. This film is more than the story of the publishing of the infamous Pentagon Papers for it relates to the role of Kathryn Graham, the first female publisher of a major newspaper, and the culture that brought her to that position, as well as the basic issues of press freedom and whether any one person in government can be more powerful than the media and its position in our society. Ms. Streep, as Mrs. Graham, and Mr . Hanks. as Ben Bradlee, render superb performances as protectors of the public’s right to know. For anyone growing up in this era and for those who are unfamiliar with the events of the time, it is a story well told as Mr. Spielberg educates and entertains the audience. For all of those reasons. I give the film an 8.0 rating and recommend that it be viewed by as many as possible."
    },
    {
      "rating": "7",
      "text": "If you don't remember or don't know the story behind the Pentagon Papers, look it up. This movie outlines the debate by the Washington Post about printing those revelatory documents. Meryl Streep plays the paper's publisher, who must make the decision that risks the future of her business. Tom Hanks gets to be a bit gruff as the editor who fights for freedom of the press. Streep plays a subdued character, but still subtlety broadcasts every moment of doubt, as well as her discomfort with her treatment as a woman. The story is compelling and director Steven Spielberg sometimes uses swirling camerawork to create tension. On the other hand, the political debate sometimes seem repetitious and the film takes too long to get to the conclusion. Overall, this film serves as a fascinating history lesson told in a compelling manner."
    },
    {
      "rating": "3",
      "text": "Directed with a heavy hand, this is a very dull and boring political drama rescued only by Meryl Streep giving another of her signature performances in an undeserving film."
    },
    {
      "rating": "7",
      "text": "Not as good as Spotlight, but worth seeing. I realize that Hanks and Streep are great actors, but I'm afraid that they are so well known, I can't see them as characters in the movie, I just seem Hanks and Streep. If the movie had less know leads, would have bumped my score up."
    }
  ]
}