{"id": 3111, "title": "The Nut Job 2: Nutty by Nature", "starring": ["Will Arnett", "Maya Rudolph"], "runtime": 91, "genre": ["Animation", "Family", "Adventure", "Comedy"], "description": "When the evil mayor of Oakton decides to bulldoze Liberty Park and build a dangerous amusement park in its place, Surly Squirrel and his ragtag group of animal friends need to band together to save their home, defeat the mayor, and take back the park.", "releaseYear": "2017", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/xOfdQHNF9TlrdujyAjiKfUhxSXy.jpg", "categories": {"plot": 6.0, "acting": 6.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 6.0}, "reviews": [{"rating": "4", "text": "Compared to the awful original Nut Job, it's sequel, Nutty By Nature, proves to be as bad as the original with a few more redeeming qualities. On paper, a sequel to a god-awful movie doesn't work on any level but amazingly, this film had very few enjoyable moments, wouldn't recommend this one at all, just a cash grab who only 5 workers put actual effort into."}, {"rating": "2", "text": "In contrast, The Nut Job actually tries to be something that ended up being a critical failure in the first place. That's how it deserves that score it earns today. The Nut Job 2: Nutty by Nature, on the other hand, is begging itself to be better than its predecessor and also begging you to love it so that it can earn more money at the box office. If you get fooled by these things, it seems as if you're not ready to become the biggest moviegoer yet."}, {"rating": "8", "text": "I really think that it is so amazing animation movie video in the whole world and I really like it so much ✨.﻿i was cursed with this adorable face and this fuzzy little body"}, {"rating": "5", "text": "Better than the first film but still derivative and uninspired for the most part. A few jokes hit."}, {"rating": "6", "text": "Returning home and fighting back for it.Frankly, I did not think there will a sequel, but this one came out and I say I'm not fully disappointed. It is an acceptable film with a good message told with full of cliches. The story continued from where the previous one had ended. Right away a new adventure begins. Surly and his friends, after losing their stock of food, now forced to return to their natural home, the park. But the place is getting turned into an amusement park by an evil mayor. So they plan to fight back and how they succeed are the revealed in the remaining part.As I said, not bad. At least the children would enjoy it better. The new characters are good, but that did not bring more fun. The comedies were average. With this year's average result from all the animated feature that had released, this film does not look so bad at all. Only if the story had been much better, it would have achieved a better result. The production and all the voice-over work were good. I don't know there will be another sequel, but I don't wish, except if they come up with some good story to tell for all ages. It's just once watchable!6/10"}, {"rating": "4", "text": "Could’ve Been WorseWhile an improvement over it's predecessor, This sequel still isn’t good in the slightest."}, {"rating": "4", "text": "Better than the first, but still not good enough to live up to animated movie standards."}, {"rating": "1", "text": "this movie is worse than the first one! which the first one sucks! way terrible animation! why this movie got a sequel!"}, {"rating": "8", "text": "Inspiring enough,Might as well be good. I am trying to be honest to my audience."}], "recommendations": ["ghostbusters_ii", "national_treasure_book_of_secrets", "dragonball_evolution", "bright", "home_sweet_home_alone", "the_new_mutants", "percy_jackson_sea_of_monsters", "superman_ii", "space_jam_a_new_legacy", "hotel_transylvania_transformania", "night_at_the_museum_battle_of_the_smithsonian", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "terminator_genisys", "the_witches", "the_matrix_resurrections", "teenage_mutant_ninja_turtles", "incredibles_2", "saw_vi", "poltergeist", "planes", "red_dawn", "yogi_bear", "venom_let_there_be_carnage", "ice_age_collision_course", "free_birds"]}