{"id": 4811, "title": "The Head Hunter", "starring": ["Christopher Rygh", "Cora Kaufman"], "runtime": 72, "genre": ["Horror", "Fantasy"], "description": "On the outskirts of a kingdom, a quiet but fierce medieval warrior protects the realm from monsters and the occult. His gruesome collection of heads is missing only one - the monster that killed his daughter years ago. Driven by a thirst for revenge, he travels wild expanses on horseback. When his second chance arrives, it’s in a way far more horrifying than he ever imagined.", "releaseYear": "2019", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/ol0DSLOIN8Rq1BcWDTsk6NNwas6.jpg", "categories": {"plot": 5.666666666666667, "acting": 4.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 9.0, "action": 4.0}, "reviews": [{"rating": "4", "text": "As someone who grew up watching Peter Jackson's Lord of the Rings trilogy, if there's one thing I would like to see more of it's medieval fantasy movies and for just $30,000 this looks absolutely incredible. You could argue it gets by a lot on the natural beauty of the Portuguese and Norwegian countrysides where it was shot, but the amount of detail in things like the gore and the protagonist's stunning set of armor show that legitimate effort went into bringing this production to life beyond merely picking pretty locations to point the camera(s) at.Unfortunately, you can tell that the majority of the meager budget went into the visuals as the running-time largely consists of watching Christopher Rygh complete menial tasks around his cottage in-between getting called offscreen to combat monsters in battles we never get to see as they couldn't afford to create any true action sequences. As a result it goes for an atmospheric, emotional mood with a lot of nonverbal storytelling. The problem is in spite of its enticing concept there's not enough plot to carry this approach. All of the significant information is conveyed VERY early on, including the effect this type of lifestyle is having on the character, so a lot of the developmental scenes that would have been important otherwise end up getting repeated at least twice for no real reason, leading to the brief 1h 12m this plays for feeling much longer than it actually is.Jordan Downey (director/editor) and Kevin Stewart (cinematography) have crafted an impressive example of what is possible for the appearance of a picture with limited financial backing. However, the also co-writing and producing duo's ambition exceeded their ability when it came to the size of the material as they tried to stretch into feature-length an amount of content that would have been better suited for a particularly attractive short film to unexciting results. Inadvertently giving starved swords and sorcery fans another flick with an exterior that's far more interesting than what's underneath it."}, {"rating": "4", "text": "I give a ton of credit to the director, who also wrote, edited and produced the film, for creating a stunning looking movie on such a small budget. However, The story just wasn't there. The runtime of 70 minutes still felt far too long and the movie often felt very drawn out at times. I think a 50-60 minute runtime would have fit it a lot better and probably would have improved my overall opinions of it as well."}, {"rating": "9", "text": "this was really good,., realy really good for the size of the team behind it,i would be happy to see a new story every year from this world"}, {"rating": "6", "text": "Even at 70 or so minutes, this feels like too little material stretched out thin.  In the end it feels like an extended trailer, or a supercut of a series.  But there's no denying the production is lovingly made and has a lot of attention to detail.  This may not blow anyone away with originality, but fans of dark fantasy and horror won't likely forget it soon."}], "recommendations": ["blade_runner_2049", "blackhat", "close_encounters_of_the_third_kind", "mortal_engines", "fantastic_beasts_the_crimes_of_grindelwald", "europa_report", "the_green_knight", "valerian_and_the_city_of_a_thousand_planets", "oblivion", "reminiscence", "monsters", "the_matrix_reloaded", "coherence", "inception", "in_the_heart_of_the_sea", "upgrade", "2001_a_space_odyssey", "star_trek_the_motion_picture", "bad_times_at_the_el_royale", "gravity", "dune", "color_out_of_space", "dunkirk", "jupiter_ascending", "alita_battle_angel"]}