{"id": 2565, "title": "The Age of Adaline", "starring": ["Blake Lively", "Michiel Huisman"], "runtime": 112, "genre": ["Romance", "Fantasy", "Drama"], "description": "After 29-year-old Adaline recovers from a nearly lethal accident, she inexplicably stops growing older. As the years stretch on and on, Adaline keeps her secret to herself  until she meets a man who changes her life.", "releaseYear": "2015", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/MbILysGhjAbnZi1Okae9wYqLMx.jpg", "categories": {"plot": 6.3, "acting": 6.615384615384615, "ending": 6.375, "soundtrack": 5.0, "cinematography": 9.0, "familyFriendly": 6.0, "funny": 8.5, "action": 6.5}, "reviews": [{"rating": "6", "text": "It's a good, not great, romance with a dash of immortality and an excellent turn by Harrison Ford.\r The first half is a rather plodding fantasy romance. The film really picks up momentum in the second half and the end, while predictable, is fun and satisfying. It's worth your time if you enjoy romance with a fantasy twist and excellent performances."}, {"rating": "7", "text": "Blake Lively is really, really good in this role.  She's come a long way since Gossip Girl.  Harrison Ford also probably does his best work since Regarding Henry.  You have to go in with lowered expectations, but you'll probably gain some insight on life and making the most of your time."}, {"rating": "6", "text": "I honestly, really enjoyed this movie. The leads have a great chemistry together, it was really funny, and it felt like a genuine budding romance. And then it leads to one of the most **** contrived, deus ex machina feel-good endings I have seen tacked on to a good movie. Magically, through a ridiculous series of events, her body's aging process is restored so she can live old with \"the man she loves\" that she met 5 days ago. Just can't believe they ruined a very enjoyable film with such a pedestrian ending, god forbid anyone go outside the \"and they lived happily ever after\" norm."}, {"rating": "7", "text": "As you may have already perceived .... this is basically a chick flick. Storyline has been used before but has a twist of it's own. Acting was above average due to good casting but for me lacked  leaving anything to imagine. Wife enjoyed it and that's a good thing but for me I will give it a 7+ so-so"}, {"rating": "10", "text": "With a strong cast, incredible writing and an interesting concept, The Age Of Adeline is a wondrous film that respects it's merits. Adeline (played by Blake Lively) goes through an accident that changes her life, she loses her ability to age. She falls in love with a young Harrison Ford (Anthony Ingruber), and many years later, she falls in love with a young man (Micheal Huisman) who is the son of the young Harrsion Ford she loved many years ago. The movie is very smooth, and heart wrenching, Huisman and Lively knock it out of the park and Ford gives a serious role as well. The beautiful cinematography shows, and the beautiful humane scenes played by Lively deserve applause and praise. Overall, it's NOT a chick flick, so go give it a watch, it has depth, emotion, love and happiness. The Age Of Adeline is an excellent movie."}, {"rating": "5", "text": "The Age of Adaline is the classic example of a movie made by the wrong director. Blake Lively is captivating but the sheer laziness of talking about the most meaningful aspects of her life are not excusable. The narration is embarrassing and moments are missed. Change everything except the concept and Blake Lively and you will have a good movie on your hands."}, {"rating": "7", "text": "I'm not a fan of the chick flick genre, but I take my wife because she does like them, and she indulges me with my movie preferences, historical, gangster or twisted.    But every genre has its gems and its rocks, and \"The Age of Adaline\", while it may not be a diamond, is a compelling film that allows just enough of the supernatural to keep it interesting.\rBlake Lively plays Adaline, a woman whom, through a car accident in the late 1930's, somehow after being struck by lightning in the car she's submerged in and revived, discovers that she doesn't age.    This explanation of how her body stops the aging process may or may not be pliable, but that's missing the point, mainly - just what would it be like to be in that situation.\rWithout giving too much away, the focus in this movie is her loneliness, which happens because she can't tell potential suitors what's wrong with her and doesn't want to watch them age while she stays young.   As luck would have it, she meets Ellis, played by Michael Huisman, starts to fall in love, and then, upon meeting his parents for the first time, re-acquaints herself with Ellis' father, who was also a suitor of hers in the 1960's and recognizes her.\rWe'll leave the plot there for now.    Overall, the movie is touching in places, a bit sad, and does serve to remind those of us chasing our immortality that it may not be all it's cracked up to be.    Harrison Ford, after spending a large portion of his career as wooden tough guys, has shown a tremendous improvement in movies where he acts for roles his age, including Branch Ricky, the legendary baseball coach in \"1947\" and as the father/former boyfriend in \"The Age of Adaline\".    His acting is moving, emotional and perfect for this role.\rHats off also to Anthony Ingruber, who plays the young Harrison Ford character, and while physically not being a dead ringer, his voice and mannerisms are eerily close.    \"The Age of Adaline\" is a good movie, perhaps not a great movie, but will not disappoint."}, {"rating": "7", "text": "Age Of Adaline is not as focused as the character itself; it is a gimmick; might roleplay as a love story, and on the other hand, it seems like a Time-Travel/Epic Fantasy/Period Peace (which is how this film is advertised). Guess what roleplay this movie turns out to be?"}, {"rating": "9", "text": "***½  Absorbing and poignant love story with a touch of “The Curious Case of Benjamin Button,” but a better film than that. Freak accident involving lightning and ice renders beautiful young woman incapable of aging. (Wish I could catch a break like that.) The film explores two sides of the coin: Yes, it's great to be beautiful, young and biologically immortal, and thus to experience all the world has to offer, becoming rich in the process (e.g., investing in Xerox in 1950, because time's on her side). But it's also lonely running from those who would poke and prod her and others who could never be long-term lovers. Well done, Blake Lively; lively indeed."}, {"rating": "10", "text": "Beautifully crafted as it is emotionally effective. The Age of Adaline composes an exceptionally moving love story to go with its inventive concept."}, {"rating": "6", "text": "GREAT: Direction, photography, acting, cast\rBad: script\r Of all the possibilities for conflict with such a unique character, the script chose to go with a sick dog and an improbable and forced love triangle. Disappointingly unimaginative.\r The wasted potential hurts, but it's still a good and above average movie!"}, {"rating": "8", "text": "I liked this movie it was a good representation of a fictional story that was well acted and a interesting story. Not one that I would go see twice in the theater but certainly good entertainment and that is what I go the the movies for..."}, {"rating": "3", "text": "A movie that is a long PSA on distracted driving and healthy eating.\rPremise was good (girl stops aging, falls in/out of love, loves someone new, wants to be mortal again, girl starts aging again conveniently), but the execution was terrible.\rI call this pseudo-science, because while stopping the aging process probably starts with freezing someone, jump starting back to normal temperature does not happen instantly.\rI feel like Blake Lively had a part in some of the dialogue, because some of it is too outrageous to believe an actual writer wrote it - ex) \"Don't eat salt/sodium more than usual daughter\" and \"Take this street, that street please cabbie\". Ridiculous.\rHarrison Ford is probably the only bright spot here, he delivers an emotional performance.\rAll the other characters fade in and out, depending on what attachment Blake Lively has to them.\rAlso, both instances of her dying/age stopping/rebirth happen due to car crashes. You would think after the first time, she would be more careful (or even after living for so long with cars) about distracted driving, but alas, afraid not. It is used here for plot points, and nothing else.\rIn summary, wait for rental if you must see it. Not worth the ticket price in theaters."}, {"rating": "8", "text": "The Age of Adaline feels like a cliche'd cornball fairy tale, but the screenwriters:  J. Mills Goodloe, Salvador Paskowitz make the film look gorgeous and glorious as the well crafted direction by Lee Toland Krieger. Blake Lively's memorable performance is  beauteous and charming, as well as the chemistry with Michiel Huisman,Harrison Ford. The film could of been better the film looks like we have seen this before am i right? Grade B+"}, {"rating": "8", "text": "It was one of the surprise hit of this spring, a surprise? I’m not sure so sure. From the day I saw the first footage I knew that this Lee Toland Krieger directed film had the potential to be special. The cast among which Harrison Ford, Kathy Baker, Ellen Burstyn & Michiel Huisman helped in raising the bar of the level of acting to be expected. I know didn’t mention Blake Lively but if I’m honest her name did little to peak my interest in this film.\r Despite the fact that The Age of Adaline sounds like a syrupy romantic movie, it has its charms. The film is a straight up romance but it has all these interesting elements, such as the fantasy of eternal youth, the “science” behind her condition, but also the philosophical questions this movie conjures up that makes it a good cinematic experience.\r The film is so subtle and measured that the story is easy to believe and get into. Blake Lively may not have been a draw for me but she did a hell of good job in portraying the young-looking old woman that is Adaline. Ellen Burstyn & Harrison Ford were, as expected, totally convincing in their roles. I bought their relationship to Adaline in the film, I did not question it I just reveled in the beauty of their performances. Michiel Huisman is steadily coming up in this world and this another performance that will bring him on step closer to become the A-lister he could be.\r The story and the performances in the film made it a remarkable film but cinematography & the production design really helped the movie. It gave the movie a timeless aspect, as if it was made a few years back while looking fresh and brand new. It was subtle yet noticeable, in other word they did an amazing job.\r The Age of Adaline is more than your average romance, it makes you dream, question but more importantly it entertains.\r By @wornoutspines"}, {"rating": "10", "text": "One of my all time favorite Blake lively movies, she is an amazing actress."}, {"rating": "10", "text": "I have watched this movie four times given my interest in the subject matter, and it reveals itself more lavishly, cleverly and poignantly each time. This has all the hallmarks of a classic film."}, {"rating": "0", "text": "If somebody took the time to read this ludicrous script- I would not have wasted two precious hours of my life on the adult fairy tale- Age of Adaline-  without a \"Grimm\" moment. Our Benjamin Button ‘Nancy Drew’ stuck in neutral is running her whole life fearing scientists might do an ET on her while it’s aging hollywood starlets that would rip her to shreds. For the first hour we see how she’s one step ahead of everyone until a big whoopsy. I say hello and you say goodbye and good bye and goodbye is corny enough as our fable’s moral—but no-  this one is more  perverse—when two starry eyed family members are sucked into the same black hole. Nothing cures like time and love.  So i’ll be okay in a few days."}, {"rating": "3", "text": "The Age of Adaline is beautifully shot- but after being exposed to a combination of wonky pseudo-science, wooden acting, no chemistry between the leads, contrived drama, and a cliche ridden script, I found it to be an absolute chore to sit through. It is a film that does just about everything wrong."}, {"rating": "9", "text": "A simple and sweet but very beautiful movie. Cried bucket of tears.\r Watch it here for free: https://www.primewire.ag/watch-2762845-The-Age-of-Adaline-online-free"}, {"rating": "10", "text": "Blake Lively is a queen, this movie is perfect and all i want is to see her growing up in this industry, i'm so happy about this movie and i hope it gets success"}, {"rating": "0", "text": "Too emotionally stunted to have the intended effect. I felt nothing for these plastic characters. And making him rich then showing us that she's rich too was comical... where's the romance in that. The makers of this thing are clearly some mercenary cold blooded people that marry for status and no nothing of love. And a buff handsome charming computer nerd? Kim Dotcom is what the computer rich look like. And Harrison Ford as an astronomer, that just had to have also gone to med school. Where are these people's heads at that can apparently only see love in the coveting of status? What an utterly uncharming movie."}, {"rating": "6", "text": "After a freak accident, a 29-year-old woman stops aging. She lives a furtive existence for 80 years, until she meets a man (Michiel Huisman) who ignites her desire to love once again. Everything changes when she visits his parents (Harrison Ford and Kathy Baker). This is a typical frustrated romance with an interesting sci-fi angle (and a stilted, unneeded narration). The performances aren't exceptional, with the exception of Ford who has some genuinely moving moments. As predictable as it is, the film is attractively shot and effectively tells its story."}, {"rating": "7", "text": "A relaxed entertaining movie. Think of The Notebook combined with the TV show, Forever, and you get the idea. The surprise at the very very end was obvious several scenes earlier, but what can you do. And the complications that really would have occurred given the social circumstances as they were at the end of the movie are passed over in favor of a tidy conclusion. But that's Hollywood. One pleasure of this film was how well Harrison Ford looked and acted. He appeared younger than he has in some other recent movies. Sometimes he's brilliant, as in Indiana Jones. Sometimes he's very good as in Witness, and sometimes he falls totally flat as he did in What Lies Beneath or Expendables 3. Luckily here he does a great job. And the guy who portrays Ford's character as a young man was eerily spot on. The entire cast came across as comfortable with each other in a way that's rare in films. I don't know if that's due to the particular collection of actors, the director, or just really good catering, but it helped a great deal to persuade me of the credibility of the story in the face of its impossible premise."}, {"rating": "7", "text": "The man is not ready yet for the eternal life!?\r The first time when I saw the trailer, I thought it might be a female version or a close kind of 'Winter's Tale'. Though this is not a fairy tale, but a heartwarming sci-fantasy romedy. For every action in the movie they explained it very clearly, that's the indication of the involvement of the science, but mostly bogus for the present era. So that is where fantasy steps in.\r A beautiful concept with the wonderful cast. And again they did not make full use of it, lacked a deep exploration into the theme they have created for this movie. Blake Lively solely handled the movie and none others were up to the expectation, expect Harrison Ford in his about 5% of the screen presence.\r Like most of the guys, I am displeased with the ending. Till then I was enjoying the film, but later it ruined my mood. Because humans are always desiring for things which are out of his league and I'm human too. Since I'm not Adaline I was rooting her and I was disappointed once the twist at the end came. Later I accepted that, because it was a perfect conclusion regarding whatever I wanted.\r In an entertainment movie, sometime we won't care about what's good and bad, but need some good pleasure for the time we spend for it. Especially in this kind of theme, which are out of reality, we usually love a happy ending. Because families want to leave the cinema hall with a good mood as it is indeed targeted for family audiences. So I am not going to spoil you by revealing facts about the movie, but I think you should watch it if you like modern world fantasy.\r 6½/10"}, {"rating": "5", "text": "A modestly enjoyable romantic fantasy with an intriguing premise that, unfortunately, suffers from a variety of execution problems. Despite strong supporting performances and fine production values, the film falls flat with a pair of leads who are clearly not up to the demands of their roles, coupled with an underdeveloped script and excessively annoying voice-over narration. This one might work fine as a lightweight date movie or night with the girls movie, but don't expect much more than that."}, {"rating": "9", "text": "Fantastic movie - was extremely well made and with fantastic performances particularly by the lead actors who are required to portray a story that we have probably seen before, but this time it is just better."}, {"rating": "7", "text": "Beautiful Black Lively in one interesting movie, from those, that represent and envelope the whole life of one human being, which is always so satisfying.I remember how impressed I was from the red elegant dress that Lively wore, so much that I wanted this dress for my prom (I ended up with a white one somehow, but anyways). If you don't want something serious, too sensitive or straining, but calm and interesting, \"The age of Adaline\" is for you."}, {"rating": "0", "text": "a cliche over dramatized reverse benjamin button without a charming lead. the coincidences are unreal and unlikely, taking you out of the story. and like all fakey love stories they are madly in love after a few days. Unrealistic and surreal."}, {"rating": "6", "text": "The Age of Adaline is a well acted romance story with an interesting premise that doesn't quite realize all the story possibilities it could pull off. It's an entertaining film, in a light and fluffy way."}, {"rating": "6", "text": "So, it's basically Highlander without the sword fighting (that's a joke). But, the premise is basically a woman who doesn't age and the affect that it has on her relationships. The plot can be infuriating in parts, straight up dumb in others and I feel overall there was a lot of missed potential. The acting is actually quite good though, Harrison Ford especially and if you can take it for what it's worth it's pretty enjoyable with a couple of noteworthy scenes."}, {"rating": "6", "text": "I was constantly wanting to love this movie, but I never could quite get there.  Age of Adaline is a fun idea with a talented cast that's hindered only by odd narrative choices, both in story and in spoken form, that force too much scientific explanation into what's happening to her.  Without spoiling any major parts of the plot, I think the story would have been better served with a more impactful ending, instead of the more upbeat one found.  The pacing was also of some concern for me - too often I asked my friends \"how far are we into this movie?\", because it felt longer than it really was.  If you're not a stickler for film and enjoy a more drama-geared movie, Adaline is not a wasted viewing experience, but for the more critical crowd, especially those that appreciate a good pace of progression, this movie will more likely leave you feeling \"meh\"."}, {"rating": "5", "text": "Thematically this movie is a romantic tall-tale, taps into the same territory of immorality like Richard Schenkman’s inventive indie Sci-Fi THE MAN FROM EARTH  (2007, 7/10), Adaline Bowman (Lively), a woman stuck at the age of 29 forever thanks to a miracle happened when an car accident incurred on her, which an omniscient voiceover laboriously tries to explain from a scientific angle, as if today's technology has completely solved the mystery of living forever, even only superficially, we don’t buy it for a minute, instead of justifying the unjustifiable, why not just leave it open? Uncanny things happen all the time.\r keep reading my review on my blog, please google: cinema omnivore, thanks"}, {"rating": "7", "text": "Immortality and romance are no strangers to the screen. When combined, they become some of the most frequently told stories. THE AGE OF ADALINE manages to transcend these tired plots and films – with something much richer, much more satisfying. Anchored by a career changing performance, Blake Lively breathes life over and over into Adaline. It’s a ride worthy of the years Adaline lives in immortality."}, {"rating": "6", "text": "Armed with narration that makes it sound like a mystery show about a vicious murder on the Investigation Discovery channel, The Age of Adaline is a romantic fantasy film about the Curious Case of Adaline Bowman (Blake Lively). Living an average, if unextraordinary, life initially, Adaline's existence is throw into disarray one night. After the death of her husband, she is driving to meet her parents who have her daughter Fleming with them to spend the weekend. However, after a rare California snow dusting, the slick roads lead to her getting into a car accident. Nearing death, she is shocked back to life by a lightning bolt that hits the water she is submerged in and, unbeknownst to her, it changes her life forever. From that day on, she stops aging. What unfolds is a film that may not be revolutionary, but is nonetheless an interesting concept realized in a minor chick flick fashion that manages to still be interesting, but too focused on being cute to really delve too deep into its questions.Ignoring the fact that poor Adaline is an awful driver and that defibrilators/lighting do not have that kind of impact on a person, The Age of Adaline is nonetheless a compelling film. Introducing the fact that she is now set to live forever, the film smartly shows the good with the bad. Given all the time in the world, she can slowly grow her investment portfolio, accumulate knowledge about various world events, and learn many different languages. Constantly moving and getting new identities to hide from those who would want to study her, Adaline also gets the rare chance to live many different lives and to see a variety of places throughout the world, though her heart is always in San Francisco. Being able to live forever, if one is willing to accept the bad, can be an enlightening experience that has allowed Adaline to have a ringside seat to history for the entirety of her life.However, the bad is very bad. Having to disconnect from emotion in its entirety, Adaline only allows herself two things: her daughter Fleming (Ellen Burstyn) and her dog. Unfortunately, when that dog dies, she is forced to once again confront the fact that everybody else is mortal and she is cursed with immortality. Pushing away men who would fill the void in her life quite gladly, Adaline's existence may be one that is knowledge-filled, but it is empty. She has been forced to box her emotions away in order to avoid feeling hurt over-and-over again whenever somebody she loved passed away. At a certain point, watching the men and animals you love constantly die becomes depressing and opening your heart to another love becomes something to actively avoid out of fear of letting your heart get broken yet again. While the film never really goes beyond the horror of living forever being found in constantly losing those that you love (plus the inevitability of Fleming's death), it remains a compelling issue that the film smartly focuses upon. In introducing one of her old love interests, William (Harrison Ford), the added wrinkle of telling William that Adaline is dead (she was going under the alias of Jenny, claiming that Adaline was her mother) is an interesting one. With Ford turning in a very good performance, he allows us to see the pain on his face when he learns that Adaline died, both the solemn realization that he is getting old and the knowledge that what he had with her is gone forever without any hope. In a way, this is the film's method of telling the audience that avoiding heartbreak is impossible. Instead, it is a part of life whether you age or not. However, at the very least, William's aging has allowed him to find a woman he loves in place of Adaline and not be forced to watch her, or anyone else's, life from the outside looking in to avoid being hurt. It has allowed him to live, have regrets, look to the past fondly, and look to the future with equal fondness. For Adaline, however, she has regrets, but has no life out of fear of the future and out of pain dominating the past.However, through its constantly obtrusive narrator that just spits out exposition at an unrelenting pace, The Age of Adaline feels afraid to really explore its possibly complex and moving themes. Instead, it opts to sanitize it and bring it down to wide-ranging accessibility. In the process, it opts to go for quick grabs at pathos - dead dog - and not developing its supporting characters beyond the very bare minimum. As a result, the film winds up feeling rather sterilized. While director Lee Toland Krieger may have wanted to explore deeper ideas, this is not the script or the film where that as possible with the narration and general \"playing-it-safe\" nature of the film really undermining its heady themes."}, {"rating": "5", "text": "First I guess I have to mention the narration. I'll never understand why movies have unnecessary narration that is only good for killing the mood. It's hard to enjoy a film when it just spoon feeds you things. That's the one thing that really annoyed me, but beyond that it is just dull. Slow pace should try to compensate with a good plot. Age of Adaline does not have that. It just predictably drags on to an ending you could see from a mile away.\r The biggest problem is that Adaline just comes on the scene and she is perfect. We don't see her grow as a character, change through the times or have anything that makes her interesting. It might have worked in film that focused on the plot, but a character focused film can't have a main character be this boring.\r Other characters are okay but they just seem like accessories to show how amazing Adaline is."}, {"rating": "5", "text": "The casting was not the problem, on the contrary, Blake Lively was quite believable as someone who is 107 years old. The ending was what ruined, which was extremely unbelievable and the fact that out of the whole plot they could only come up with a weird love triangle and a \"love conquers all\" type of scenario. Am I the only one who is weird-ed out by the fact that the father is still in love with Adaline, so is the son....she basically had intimate relations with both but....decides to remain with the son?\rHow do you go about family dinners, eh?\rThe second half of the movie didn't deserve that treatment,....if treated right, it could have made it a good movie instead of a mediocre one."}, {"rating": "10", "text": "Go watch it for the lovely Lively. A heartwarming performance. The beauty of this movie is that it is a complete package. A picture reel containing, grace, drama, suspense, and romance."}, {"rating": "6", "text": "It wasn't charming for me, Just can say life is to short appreciate that and live in the moment."}, {"rating": "10", "text": "++++++++++++××××××++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "7", "text": "This is a decidedly cheesy, sentimental film, however I quite enjoyed it for the performances and the main plot concept is relatively intriguing. Sometimes there's nothing wrong with a little cheesy sentimentality. It's not overly excessive and as a drama it's ok, borderline gripping on ocassion and with just enough back story to keep me watching. The scientific context provided does give it a somewhat believable feel, though I still can't say it isn't a bit cheesy at times.I wouldn't say its a greatly memorable film in general but its certainly worth watching if it sounds of interest, so yes I'd recommend it on that basis I guess."}], "recommendations": ["about_time", "me_before_you", "into_the_wild", "five_feet_apart", "the_florida_project", "the_curious_case_of_benjamin_button", "blue_valentine", "endless_love", "the_glass_castle", "her", "lady_bird", "the_intern", "the_spectacular_now", "the_notebook", "a_monster_calls", "afternoon_delight", "20th_century_women", "the_fault_in_our_stars", "moonrise_kingdom", "stand_by_me_doraemon_2", "the_descendants", "stillwater", "unforgettable", "collateral_beauty", "young_adult"]}