{
  "id": 3086,
  "title": "The X Files",
  "starring": [
    "David Duchovny",
    "Gillian Anderson"
  ],
  "runtime": 121,
  "genre": [
    "Mystery",
    "Science Fiction",
    "Thriller"
  ],
  "description": "Mulder and Scully, now taken off the FBI's X Files cases, must find a way to fight the shadowy elements of the government to find out the truth about a conspiracy that might mean the alien colonization of Earth.",
  "releaseYear": "1998",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yLIw6shz2WC3W3iI0jROsF4B2ha.jpg",
  "categories": {
    "plot": 8.166666666666666,
    "acting": 9.333333333333334,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "As a huge X-Files fan, I found the movie only okay. I could name several episodes that were much more entertaining than this film. Not to say that there are some great moments, but few and far between."
    },
    {
      "rating": "10",
      "text": "If you are not a fan of the show than it is pointless to see the movie.  I was totally in love with the show, as is my wife, one of the things we had in common when we first met.  I am also a big fan of the Four Horsemen, those loveable Canucks."
    },
    {
      "rating": "10",
      "text": "Director Rob Bowman made this movie in 1998 and created from the television series... The X-Files movie made in 1998 has a good storyline, fantastic action, suspense, good scenes and excellent performances from David Duchovny and Gillian Anderson as Mulder and Scully and an excellent opening sequence and a bomb hidden in a building. Excellent film!"
    },
    {
      "rating": "10",
      "text": "Awesome X-Files movie. It was like an episode, but two hours long; I was thrilled all the time. Worth watching."
    },
    {
      "rating": "8",
      "text": "would like to have more of a continuation of the last episode of the show....what happened to the potential alien takeover, etc. Too many unanswered questions to just go back to business as usual. Disappointed that Scully STILL doesn't believe after all that happened in the last episode....that was really annoying and unrealistic. I am a diehard fan, so I would have watched it regardless, but I am disappointed that it was more like a TV CSI episode. Dana looked gaunt and depressed...eat some beef. Fox needs to eat less meat. I missed old characters...lone gunmen, cigarette man, etc. Skinner just had a cameo appearance. The other two agents were useless...and why they got a rapper musician to play an agent is beyond me....bring one of the old guys back from the show. Oh well, still I would watch it again. Hopefully they will do a third one."
    },
    {
      "rating": "8",
      "text": "This big screen adaption of the phenomenally popular T.V. series is nothing short of brilliant it has all the makings of a fantastic Sci-Fi thriller and a great conspiracy thriller all wrapped up into one sinister little package. The X-Files: Fight the Future is not an oscar worthy film but it is a great one on it's own as a stand alone it would have done fantastically but it's tie to the series' plot keeps it chained down from busting loose and showing it's true stuff. But it does good with what it's already established it brings to the Sci-Fi genre , like The Matrix did, seeing as it is The Matrix predecessor in Sci-Fi greatness. This film, in my opinion, set the benchmark for conventional Sci-Fi and turned it into what we see now. This movie I was hesitant to see at first but after watching the first three seasons I thought i should at least give it a try and boy was I blow away. It's a mystifying and malicious experience in the art of conspiracy and deceit and it moves along at a very steady and easy pace that you can easily keep up with and a story you can understand and follow as it plays out. This is the kind of film that keeps you guessing and guessing till the end it never let's up with the intrigue and the tension, it brings so much to the table and you have no choice but to eat it all up one small morsel at a time that so good you can't resist, this film also gives you a gritter side to The X-files adventure that you didn't see in the series it puts the agent's in more peril and danger then they have ever been in before and that is also another factor that contributed to this films success. But when it comes down to it there is probably nothing bad you can say in this films honor, it's just to good to put down. The X-Files: Fight the Future is great fun and it's a wild ride that you have toe experience to believe, it's sinister and diabolical, it calculating and efficient in it's execution of it's craft and style. it brings more than it should and it does well with it and gives you a good show for your money and if your forgiving this film won't displease you. All in all The X-Files: Fight the Future is a great Sci-Fi thriller that is a see and see again fun that you can't ignore. The X-Files:Fight the Future is red hot."
    },
    {
      "rating": "6",
      "text": "Not a bad movie, but it had the potential to be much more than it turned out to be"
    },
    {
      "rating": "10",
      "text": "The tv show is my favorite thing to ever be aired on tv, and this movie is just like a really long episode. it is creepy to a point, and even then I had some moments when I almost jumped clear up to the ceiling, which is rare for me. Plus I saw this before wathcing the show and I totally got it! And anyways this movie makes perfect sense to alien-obsessed me. Can't wait for the new movie!"
    },
    {
      "rating": "5",
      "text": "Less interesting than the average episode of the TV-series. Really very unbelievable and highly improbable plot. Only for those who really want to believe."
    },
    {
      "rating": "7",
      "text": "This is a fantastic movie that honestly goes beyond the bounds of what I thought the X-Files was capable of. It pushes the metaplot forward while also serving to act as a cohesive individual story as well. I don't think you can get nearly as much out of this if you're not already familiar with all the x-files stuff, but it's very rewarding all the way though if you are."
    },
    {
      "rating": "9",
      "text": "This is a great X Files movie that is what it is suppose to be nothing else. It is not about what's more entertaining that's out there this is just the X Files you like it or you don't. I find it to be written in a very intelligent way. The chemistry between David and Gillian is just so fantastic. Thanks be to Chris Carter and the team."
    },
    {
      "rating": "6",
      "text": "More of an extended episode than anything else, this film adaptation of the phenomenal television series still manages delivers on many levels despite its somewhat convoluted plot."
    },
    {
      "rating": "8",
      "text": "Don't trust the critical reviews to much. The first feature for the X Files does live up to It's reputation that fans of the series would enjoy. Sitting and watching a film that they can call acclaimed, and I believe it."
    },
    {
      "rating": "8",
      "text": "You have to watch the show to understand the story. The characters don't change, and it adds a lot to the show. If you watch the show, just know how much this great story adds."
    },
    {
      "rating": "10",
      "text": "If you’re an X-Files fan this film should be immediately appealing. No, it’s not the greatest thing ever committed to celluloid, not by a long shot. But it does expand nicely on the mythology, delivers performances that are nothing short of fan service, and an sufficient plot that both diehards like me AND newcomers alike can pick up on.I’m 31 years old. When I saw FTF, at about nine years old, it was magic. Recommended for every last X-File fan. Also a fairly good place to begin your obsession, as it squarely marks the X. Anyone uninterested should stay clear, and probably already has anyways."
    },
    {
      "rating": "7",
      "text": "Made to capitalise on the show not amazing but not terrible it's worth a watch."
    }
  ]
}