{"id": 2807, "title": "The Debt Collector", "starring": ["Scott Adkins", "Louis Mandylor"], "runtime": 96, "genre": ["Action"], "description": "A classically-trained martial artist goes to work as a debt collector for the mob. The job seems easy enough, until one “client” pulls him into a situation deeper than could ever be expected.", "releaseYear": "2018", "mpaaRating": null, "imageUrl": "https://image.tmdb.org/t/p/w500/5XyuUPoIeEf3guWLQW9lATON84v.jpg", "categories": {"plot": 7.0, "acting": 3.0, "ending": 3.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 6.5}, "reviews": [{"rating": "3", "text": "I went into this hoping for a halfway decent B movie and that isn't really what I got. The actors were all okay and we've seen them before in lower budget films. There wasn't much in the way of production values and you could tell that this was done on the cheap. I wasn't expecting a stellar script so to have it be as bad as it was didn't surprise me. I thought maybe there'd be some decent fight scenes but it was altogether pretty mild. I did not enjoy the cut-aways during the film. They were too artsy and this was not an art film. The ending was one of the worst endings I have seen in a long, long, time. I feel that I am being generous giving this film 3 stars and I do not recommend this film."}, {"rating": "7", "text": "Once I ve finished to watch the film I had the feeling as it was a mixture between Pulp Fiction and The Nice Guys.Roles and story is surely much more real than those of the above mentioned films.We get some street fights and a morale at the end...something that the poor blockbuster productions seem to have issues with.Su and the golden boy make a perfect match and their interpretation is good, good enough to let \"The Debt Collector\" stay on top.If this film did not get the success it deserves I am sure the issue is not in the film itself. We have seen a lot of garbage these years that came in front of our nose for the mere fact it was over advertised.A good \"action movie\", with good actors, trying to give a lesson."}, {"rating": "5", "text": "Fun to see Scott Adkins in a lead role. Sadly the movie falls pretty short of being perfect. Some odd directing choices, and it kinda rushes to finish. Not a great flic by any means."}, {"rating": "8", "text": "Entertaining actioner whose strongest points are the fighting sequences and the chemistry between the two leads. It is not flawless but for a low budget DTV action movie, it's about as good as it gets.The movie has good pacing and provides some humour, but changes route a bit in the last act leading to a somewhat unsatisfying ending."}], "recommendations": ["contraband", "bloodshot", "gemini_man", "sleepless", "triple_frontier", "the_marine", "the_three_musketeers", "brick_mansions", "the_guardian", "seeking_justice", "the_italian_job", "orphan_first_kill", "hercules", "hancock", "rocknrolla", "the_a_team", "abduction", "venom_let_there_be_carnage", "underworld_evolution", "avengers_age_of_ultron", "wrath_of_man", "edge_of_tomorrow", "skyscraper", "lockout", "the_tax_collector"]}