{"id": 3332, "title": "The Running Man", "starring": ["Arnold Schwarzenegger", "Richard Dawson"], "runtime": 101, "genre": ["Action", "Science Fiction", "Thriller"], "description": "By 2017, the global economy has collapsed and U.S. society has become a totalitarian police state, censoring all cultural activity. The government pacifies the populace by broadcasting a number of game shows in which convicted criminals fight for their lives, including the gladiator-style The Running Man, hosted by the ruthless Damon Killian, where “runners” attempt to evade “stalkers” and certain death for a chance to be pardoned and set free.", "releaseYear": "1987", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/GTAUOhO4BN0peJVvxGEQydJvUO.jpg", "categories": {"plot": 7.333333333333333, "acting": 7.8, "ending": 8.0, "soundtrack": 8.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.0, "action": 7.7272727272727275}, "reviews": [{"rating": "7", "text": "Was this film based on a novel or something? I don't know to be honest, maybe not or maybe but who cares... THE RUNNING MAN is a thriller sci-fi action movie made in 1987 and Arnold Schwarzenegger, Maria Conchita Alonso, Yaphet Kotto and Richard Dawson star in this movie. Damon Killian (Dawson) hosts a gameshow called The Running Man that has convicts and others play a game to fight against gladiator killers in order to stay alive. The point in this game is not entirely explained vin the movie and you don't even win anything except your freedom so it's a strange story to base a movie on and the gameshow seems very stupid and silly and utterly lacks logical thinking, intelligence. It's completely pointless as there isn't any real goal to it and usually people die playing The Running Man but Schwarzenegger kills each opponent gladiator in the game such as Buzz Saw, Dynamo, Subzero and Fireball. These action scenes aren't great and thrown in with witty humour at the deads expense, something Schwarzenegger usually does and is a trademark of his. So Maria Conchita Alonso, Schwarzenegger and a couple of old prison buddies are forced to play the game after being captured however only 2 make it out alive and take revenge on the gameshow host. Obviously Schwarzenegger makes it out alive because he's the superstar of the movie but this film has good moments and bad moments. Great action scenes toppled on terrible action scenes and some dumb characters such as fat Dynamo who's just embarrassing as a villain, clumsy and laughable and lit up like a Christmas tree. This is a good film but don't expect it all to be great however it's not the worst film ever made and Schwarzenegger has made worser movies. I guess it's entertaining at least. Rated 18 for violence."}, {"rating": "6", "text": "Other than Chuck Barris (of Family Feud fame) playing his role in a FAR too over-the-top manner, I had a lot of fun with this film.  Arnie is Arnie, of course..."}, {"rating": "9", "text": "A classic action movie nowadays. The setting in the future in a police dictatorship is perfect and it would have been better to show more of it. The action is not so ridiculous, like on some of the movies with Arnie. I like to critic on the mass medias also."}, {"rating": "8", "text": "An action movie set in a dystopian near future with lot of social criticism. It is loosely based on the novel “The Running Man” from Stephen King which is even darker, grimmer and has overall a better story. Don't worry I wont use the books are better statement as barley anyone even read or knows the book (Would not be surprised if a viewer will google this). It has Arnold Schwarzenegger as main actor who was quite popular at the time but was not even at the peak of his popularity. It was set back then in the near future of 2017 (Turned out better than anticipated ;-). After an economic collapse which had worldwide consequences the USA is a totalitarian regime where poverty, hunger, corruption and lawlessness are common. To give the people some form of spectacle to pacify them a game show exists where criminals were hunted by so called stalkers in a deadly fight for survival getting a pardon if they survive. Sidenote: This is actually an old method as the Romans called this “Panem et Cirsenses” which means bread and games (circuses). It can be compered to gladiatorial games, horse races (more dangerous than you think) or similar events in ancient Rome. Back to the review. The main character Benjamin Richards who is framed for a massacre during a food riot he actually wanted to prevent or at least did not participate ends as participant in the show. However he will not be a victim or easy target. This is the set up for the story. It is a good action movie and plays or criticize the ideas of media, society and television culture to name a few. While I like the result a lot it is neither in the realm of the better action movies, Arnold Schwarzenegger movies or social critique movies. Over the years barley anyone talks about this movie. Again it is not a failure and it was an enjoyable experience. Lets continue with the cast. The role of Ben Richards was perfectly written for Arnold Schwarzenegger and he delivers what you expect in a good way. Maria Conchita Alonso plays Amber Mendez the female lead. She gave a good performance and is more than just a damsel in distress. Then there are the hunters with Jim Brown, Erland van Lidth de Jeude, Professor Toru Tanaka (That is actually his stage name) and Gus Rethwisch. They are the antagonists and deliver but their roles are a bit limited. Richard Dawson is an excellent main antagonist and he was the host of the popular TV-show “Family Feud” which adds a bit of satire and social criticism. I love this idea. In total we got a solid good performance by genre standards. The sets and special effects look authentic. Be it the dystopian set pieces or the game show parts everything is believable. I don't remember the soundtrack which means most times that it was fitting. Overall this is an enjoyable movie. Not great enough to stand out but no failure either. I would still recommend it even if it will be fast forgotten except maybe the idea for the show."}], "recommendations": ["the_league_of_extraordinary_gentlemen", "american_assassin", "the_equalizer", "jack_ryan_shadow_recruit", "killer_elite", "iron_man", "gangster_squad", "surrogates", "angel_has_fallen", "shooter", "hitman", "lara_croft_tomb_raider", "punisher_war_zone", "demolition_man", "hitman_agent_47", "the_punisher", "london_has_fallen", "mission_impossible_rogue_nation", "resident_evil_apocalypse", "elysium", "x_men_apocalypse", "max_steel", "thor", "abraham_lincoln_vampire_hunter", "ant_man_and_the_wasp_quantumania"]}