{
  "id": 4779,
  "title": "The Peacemaker",
  "starring": [
    "George Clooney",
    "Nicole Kidman"
  ],
  "runtime": 124,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "When a train carrying atomic warheads mysteriously crashes in the former Soviet Union, a nuclear specialist discovers the accident is really part of a plot to cover up the theft of the weapons. Assigned to help her recover the missing bombs is a crack Special Forces Colonel.",
  "releaseYear": "1997",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hc3p6pvIrfO4AmrVLb6qTviOwW2.jpg",
  "categories": {
    "plot": 4.076923076923077,
    "acting": 4.142857142857143,
    "ending": 3.6666666666666665,
    "soundtrack": 5.0,
    "cinematography": 6.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 3.8636363636363638
  },
  "reviews": [
    {
      "rating": "2",
      "text": "As usual, Clooney was pathetic.  If it wasn't for him, it might have been a really good movie.  I can only assume he is able to get any work at all by virtue of his ultra-liberal politics, because he really sucks as an actor."
    },
    {
      "rating": "0",
      "text": "J’allais dire que cette grosse connerie hollymerdienne pouvait éventuellement valoir le détour ou à tout le moins un (rapide) coup d’oeil surtout et principalement pour Nicole en pleine forme ici et très belle mais… hélas, elle doit se coltiner un blaireau, à savoir le roi des blaireaux tout juste bon à faire des pubs pour du café dégueulasse !Et comme d’habitude, Georges Whatelse handicape le film, Nicole et tout ce qui vient avec : quel insupportable blaireau ! cela étant, le film n’a pas forcément besoin de lui pour couler à pic tout seul, car en termes de grosses conneries de franche inspiration clancynienne si je puis dire, on touche le fond !Je l’avais vu il y a longtemps d’un air distrait (je devais être bourré) mais là à tenter de le « revoir », c’est tellement n’importe quoi que ça en devient déjà grotesque au bout d’un quart d’heure et plus on « avance » dans ce merdier, pire c’est ! j’ai pas pu tenir tellement c’est con et pourtant tout ça se vautre dans le premier degré éhontément… à tel point qu’à plusieurs degrés bien au-dessus, on arrive même plus à en rigoler : non franchement, c’est grave ! gravos même.De toute manière, on dirait davantage un téléfilm haut de gamme avec plein de pognon qu’autre chose, car c’est souvent mollasson, bavard et incroyablement plat et déjà vu : les clichés s’empilent les uns sur les autres, du début à la fin ou du début jusqu’à ce qu’on abandonne : putain, quelle grosse merde !"
    },
    {
      "rating": "1",
      "text": "This movie was just so.... AVERAGE! It was kind of boring with some exciteing moments, but all in all it kind of sucked. I wouldn`t recommend this. George Clooney haven`t been so bad since \"Batman and Robin\".Don't see this movie!"
    },
    {
      "rating": "3",
      "text": "The big opening action set piece of \"The Peacemaker\" involves a Russian train being robbed of its cargo of nuclear arms while rattling down the track, and the entire film sustains that same feeling of being channeled at high speed down an exceedingly narrow path, with nary a pause for thought or catching one's breath.\r Deliberately sacrificing such niceties as character development and modulated storytelling for the sake of a full-speed-ahead approach, Mimi Leder’s debut feature attempts to graft the basic components of a doomsday suspenser onto the gritty realities of a ravaged former Yugoslavia and militarily neutered and insidiously corrupt Russia.\r But all the film’s stylistic pushiness and manufactured urgency can’t compensate for the lack of a compelling hook to pull the audience in and make it stay there, other than a generalized and presumed desire to see the good guys, i.e., the West, survive to fight another day.\r Pic’s first 15 minutes are devoted to two incidents in which the viewer is supplied with little orientation and no rooting interest: A member of the Bosnian parliament is assassinated, and nine nuclear weapons, destined for dismantling as part of an international disarmament plan, are stolen from the train. A 10th device explodes in a crash, causing a devastating blast that initially is said to be big enough to spread fallout over much of the former USSR and Europe but which subsequently impedes none of the action played out in the vicinity.\r Western intelligence naturally takes a quick interest in the incident, and thrust together to piece things together are scientist Dr. Julia Kelly (Kidman), acting head of the White House Nuclear Smuggling Group, and U.S. Army Special Forces Lt. Col. Thomas Devoe (Clooney), who has extensive personal contacts in the old Soviet Empire.\r Their first stop is Vienna, where their search for the identity of the vehicle now being used to transport the weapons ends in a rude awakening for Kelly, who witnesses the cutthroat brutality with which the old spy game can be played and learns what a tough, ruthless customer her companion is when he savagely beats one man, then engages three pursuing cars in a deadly game of demolition derby in the middle of a picture-postcard city square; Devoe, clearly, is a trained-to-kill, take-no-prisoners, ends-justify-the-means kind of guy.\r Satellite pictures reveal that the truck bearing the world’s most dangerous illicit merchandise is headed for the Iranian border, which occasions the film’s third major action sequence when Devoe manages to commandeer three attack helicopters and stop the truck in its tracks on a bridge in mountainous terrain.\r Unfortunately, one of the stolen bombs has already disappeared, which sends the heroes to New York City, where, their deductions tell them, an upcoming major United Nations peace conference is sure to draw many international figures, including, perhaps, those who got away with the weapon.\r The action finale, which looks as though it must have shut down half of Manhattan’s East Side to shoot, is reasonably impressive, but ends with a possibly inevitable but unavoidably hackneyed race with time to save at least part of the civilized world from a nuclear holocaust.\r Essentially, “The Peacemaker” is a pursuit story set against a grand and ever-changing international canvas, and director Leder, best known for her multiple-Emmy-winning work on “ER,” would seem to have had two principal priorities: keeping the picture barreling along in an exceedingly straight line, and capturing some vivid local atmosphere along the way. Unfortunately, this is not enough to cement much of a bond with the viewer, and result of this approach is a picture that feels as though it’s nearly all second unit, or one big, uninterrupted action sequence.\r Based on original spadework done by investigative political journalists Andrew and Leslie Cockburn, script by Michael Schiffer (“Crimson Tide”) alternates in its dialogue between information conveyance and shouted commands.\r Pic is notable for its down-and-dirty detail, and some of its images, such as a convoy of trucks trying to make its way past masses of refugees, have force; logistics look to have been staggering across the boards.\r Technically, the work here is very skilled, but in the service of a narrowly focused narrative that knows no way to move but straight ahead at full speed."
    },
    {
      "rating": "3",
      "text": "Wanted: handsome, gravel-voiced action man to save America from terrorist attack. Must be resourceful, indestructible and stupidly fearless. Reckless driving skills essential, female sidekick included. Romance optional. Bring your own wisecracks.\r Part Bond film (run, shoot, outlandish stunts), part Clancy techno-thriller (\"we've lost them, but let's see what the satellite picks up\"), The Peacemaker is a formulaic action movie from start to finish. This time, vengeful Bosnians have pinched a Russian SA-18 nuclear warhead, hiding in central Europe, hoping America's latest Special Forces action man (and his brainy, beautiful sidekick), don't track them down. The action flits from mainland America to Vienna to Bosnia, and to somewhere Russian ending in \"-aijan\". Cars explode and old friends get shot, before a tense \"Where's the bomb?\" finale in the bustling streets of New York.\r The missing nuke warhead plot is uncomfortably realistic. The Russians have recently admitted that, because of the break-up of the USSR, they haven't the faintest clue where all their bombs are now. A few could easily have slipped down the back of the sofa when they weren't looking. This is from a country where a local electricity company once cut off the power to the Navy's nuclear submarine fleet because it hadn't paid its bills on time. While meltdown threatened, the Russian army had to storm the power station to force the technicians to switch the juice back on.\r Top marks then for the Time magazine realism - but it doesn't disguise the fact that The Peacemaker is too long, shallow and utterly predictable, despite the best attempts of a Bat-free Clooney (he's the best thing about the film).\r Taken in order, The Peacemaker is not only long, but tortuous and plodding, the action sequences (good, but there are only two of them) are split apart by large chunks of international phoning, satellite watching and flitting between war-torn holiday destinations. ER's Mimi Leder directs the wham-bams and furrowed brows competently enough, but this film could have been shorter and tighter.\r Then there's shallow. The main cast numbers precisely three (Clooney, Kidman, the bad guy), but the subtleties of characterisation are abandoned after the first 30 minutes. From there on in, what you see is what you get. Clooney's Thomas Devoe is a likeable, resourceful, indestructible Bond-a-like, a gravel-voiced grunt who prefers the cold, grooved feel of a belt-fed machine gun to the warm, curvier feel of Mrs Cruise's bomb expert. Kidman is an egghead pacifist, a slave to technology who demands authorisation for everything in triplicate. Romance is always possible, but Clooney's pumped-up soldier has his mind on bombs rather than baps.\r That leaves predictable. The Peacemaker does have a couple of original moments - Clooney phones the bomber in his truck to taunt him, the baddie does have a sympathetic grievance, and there's an unbelievable stunt involving the nukes, a helicopter gunship and a bridge) - but the plot follows the action genre to the letter, right up to a ticking bomb finale. To prove it, we've compiled The Total Film Bomb Checklist (score one point for each of these fondly-remembered clichés):\r 1. Movie bombs always have big, blinking red timer displays.\r 2. Bad guys who set bombs always leave about an hour on the timer, giving the hero more than enough time to find and defuse it.\r 3. To defuse the bomb, cut the wire that links the bomb to the detonator to stop the timer. But not until only one or two seconds remain.\r 4. All bomb wires are different colours, so the hero can easily defuse the device when told to \"cut the red one.\"\r 5. If a bomb does go off, the explosion will always be filmed in slow-motion. The characters will be running away from the blast and will know when to dive (again, in slow-mo) to avoid the worst of it.\r The Peacemaker? It gets a respectable four out of five. And no, we're not telling you which one it didn't get...\r Admittedly, The Peacemaker may seem shallow and predictable, but Clooney and Kidman turn on the charm to transform a humdrum action flick into an entertaining, amusing pursuit thriller. It's James Bond meets Patriot Games in a 30/70 kinda split."
    },
    {
      "rating": "5",
      "text": "Wanted: handsome, gravel-voiced action man to save America from terrorist attack. Must be resourceful, indestructible and stupidly fearless. Reckless driving skills essential, female sidekick included. Romance optional. Bring your own wisecracks.\r Part Bond film (run, shoot, outlandish stunts), part Clancy techno-thriller (\"we've lost them, but let's see what the satellite picks up\"), The Peacemaker is a formulaic action movie from start to finish. This time, vengeful Bosnians have pinched a Russian SA-18 nuclear warhead, hiding in central Europe, hoping America's latest Special Forces action man (and his brainy, beautiful sidekick), don't track them down. The action flits from mainland America to Vienna to Bosnia, and to somewhere Russian ending in \"-aijan\". Cars explode and old friends get shot, before a tense \"Where's the bomb?\" finale in the bustling streets of New York.\r The missing nuke warhead plot is uncomfortably realistic. The Russians have recently admitted that, because of the break-up of the USSR, they haven't the faintest clue where all their bombs are now. A few could easily have slipped down the back of the sofa when they weren't looking. This is from a country where a local electricity company once cut off the power to the Navy's nuclear submarine fleet because it hadn't paid its bills on time. While meltdown threatened, the Russian army had to storm the power station to force the technicians to switch the juice back on.\r Top marks then for the Time magazine realism - but it doesn't disguise the fact that The Peacemaker is too long, shallow and utterly predictable, despite the best attempts of a Bat-free Clooney (he's the best thing about the film).\r Taken in order, The Peacemaker is not only long, but tortuous and plodding, the action sequences (good, but there are only two of them) are split apart by large chunks of international phoning, satellite watching and flitting between war-torn holiday destinations. ER's Mimi Leder directs the wham-bams and furrowed brows competently enough, but this film could have been shorter and tighter.\r Then there's shallow. The main cast numbers precisely three (Clooney, Kidman, the bad guy), but the subtleties of characterisation are abandoned after the first 30 minutes. From there on in, what you see is what you get. Clooney's Thomas Devoe is a likeable, resourceful, indestructible Bond-a-like, a gravel-voiced grunt who prefers the cold, grooved feel of a belt-fed machine gun to the warm, curvier feel of Mrs Cruise's bomb expert. Kidman is an egghead pacifist, a slave to technology who demands authorisation for everything in triplicate. Romance is always possible, but Clooney's pumped-up soldier has his mind on bombs rather than baps.\r That leaves predictable. The Peacemaker does have a couple of original moments - Clooney phones the bomber in his truck to taunt him, the baddie does have a sympathetic grievance, and there's an unbelievable stunt involving the nukes, a helicopter gunship and a bridge) - but the plot follows the action genre to the letter, right up to a ticking bomb finale. To prove it, we've compiled The Total Film Bomb Checklist (score one point for each of these fondly-remembered clichés):\r 1. Movie bombs always have big, blinking red timer displays.\r2. Bad guys who set bombs always leave about an hour on the timer, giving the hero more than enough time to find and defuse it.\r3. To defuse the bomb, cut the wire that links the bomb to the detonator to stop the timer. But not until only one or two seconds remain.\r4. All bomb wires are different colours, so the hero can easily defuse the device when told to \"cut the red one.\"\r5. If a bomb does go off, the explosion will always be filmed in slow-motion. The characters will be running away from the blast and will know when to dive (again, in slow-mo) to avoid the worst of it.\r The Peacemaker? It gets a respectable four out of five. And no, we're not telling you which one it didn't get...\r Admittedly, The Peacemaker may seem shallow and predictable, but Clooney and Kidman turn on the charm to transform a humdrum action flick into an entertaining, amusing pursuit thriller. It's James Bond meets Patriot Games in a 30/70 kinda split."
    },
    {
      "rating": "5",
      "text": "A dumb, fun, pointless, meandering, action movie that has aged horribly, I couldn't help but laugh my way through all of The Peacemaker. Nicole Kidman and George Clooney look like they had the time of their lives filming this movie, and I couldn't help but enjoy the ridiculousness their characters went through. A time waster of a movie, if nothing else."
    },
    {
      "rating": "10",
      "text": "It's rare that a movie absorbs me as completely as The Peacemaker. I have it on DVD and every time I watch it, I'm on the edge of my seat, even though I know what's going to happen next."
    },
    {
      "rating": "6",
      "text": "Pretty standard 90's action thriller fare. Great cinematography - the 4k hdr stream I just watched looked very good. Overall nothing surprised me in the plot, screenplay was average - it is a finely made average film."
    },
    {
      "rating": "5",
      "text": "This is an action/thriller film featuring themes including nuclear explosions, russia, destiny and timebombs. The first scene is a bit confusing, as it seems to show what certain people are doing but yet we've been given no real inforation as to who does what and, basically, what is going on. I tend to find this quite disorientating and obviously confusing, as is (presumably) intended. It went on for quite some time and I was sat wondering when the cliched 'good guys' would make an appearance, with only the Russians clearly appearing on screen for the first 20 minutes or so. Due to this, there's quite a lot of subtitles, which might bother some people.Cast wise, I quite liked seeing Nicole Kidman playing a woman of some significant authority, Dr. Julia Kelly. Its always nice to see women having somewhat high ranking job roles, although at times she does get a little shrieky/squealy when things become a bit overly physical, which I didn't much like. She reminded me, obviously visually speaking, of Scully from The X Files, although I didn't really watch that show as a child as I was a bit young for it then but I remember photos so I knew roughly what she looked like!. She appears very much a lady who doesn't take any nonsense and who spits things out and gets to the point. Meanwhile, George Clooney plays lt. Colonel Thomas Devoe - he is well suited, as a character, to be teamed up with Julia, as they are both quite strong willed. He is a relatively smug and arrogant person but Julia manages to cut him down to size. They both play their performances reasonably well. Other cast members include Gary Werntz, who plays Terry Hamilton, Jim Haynie, who plays General Garnett and Carlos Gomez, who plays Santiago.Some of the Russian accents sounded potentially a bit over exaggerated or stereotyped at times. There are some other countries or nationalities featured and which there was an element of cliche about, such as Austrian locals with their feathered hats and the like. It might be fair enough but I couldn't help but feel like this was another American film if but mildly pushing old stereotypes.Music wise, there isn't a great amount of music featured, although when it is its fairly cliched, such as dark (sombre and gloomy) sounding pieces during tense moments. Most of the music played made me think of other spy films. It does try to add to the tension although I'm not sure I'd agree that its a terrible tense film. I didn't take it entirely seriously but I'm not entirely sure why...perhaps the fact it stars two a list celebs in the main roles has something to do with it. Don't get me wrong, there are moments which surprised me and took me aback but I couldn't say I found myself utterly gripped by it overall. Content wise, the film features one sex reference, some mild to moderate violence (mostly via gunfire) and blood is depicted, plus there are some instances of strong language and certain scenes may frighten young viewers, in terms of the elements of threat and peril. There are also one or two explosion type scenes, which may frighten people. Due to this, the film has been given a 15 rating.The film features high speed scenes (including car chases and helicopters), which came across quite well on screen in terms of being quite watchable. I suppose it was more engrossing during those scenes but just not so much outside of those. I always appreciate a slickly filmed car chase and this film did alright on that front, so I thought I ought to mention that.The special effects are ok but not brilliant. I probably ought to point out that this film dates from 1997, thus its at least 20 years old and so it shouldn't be expected to feature the most up to date CGI but I did still find myself feeling one or two aspects of the special effects didn't really look very realistic, or believable (also, just to clarify that where I've put 'SFX' in the disdvantages, thats just an acronym meaning special effects).Don't get me wrong, this isn't an awful film but its not great or even especially good - it has some good elements and some cliches and it just didn't really grab me as either tense or (thus) engrossing and I personally felt rather 'meh' (i.e.  one big shrug of the shoulders - what can I say?) about it overall. I liked the idea of Nicole kidmans character but some aspects of her didn't really work quite how I might have liked them to but all the same, its quite an easy watch and features some good chase scenes, so it could be both better and worse.I wouldn't recommend this film specifically. This film is an ok watch but its neither especially good or poor. Its quite watchable and reasonably entertaining but its flawed via cliches and it looks a little dated via some of the less impressive special effects. You could do better or worse by looking for other related films but I wouldn't spend any real money going to see this particular title."
    }
  ]
}