{
  "id": 1102,
  "title": "The Call of the Wild",
  "starring": [
    "Harrison Ford",
    "Dan Stevens"
  ],
  "runtime": 100,
  "genre": [
    "Adventure",
    "Family",
    "Drama"
  ],
  "description": "Buck is a big-hearted dog whose blissful domestic life is turned upside down when he is suddenly uprooted from his California home and transplanted to the exotic wilds of the Yukon during the Gold Rush of the 1890s. As the newest rookie on a mail delivery dog sled team—and later its leader—Buck experiences the adventure of a lifetime, ultimately finding his true place in the world and becoming his own master.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/33VdppGbeNxICrFUtW2WpGHvfYc.jpg",
  "categories": {
    "plot": 6.4324324324324325,
    "acting": 6.393939393939394,
    "ending": 6.5,
    "soundtrack": 6.0,
    "cinematography": 7.333333333333333,
    "familyFriendly": 6.777777777777778,
    "funny": 8.0,
    "action": 6.2
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Great, just like the book. Suitable for all ages, as it is not as violent as the book. While some parts are dragged on, the rest of the movie is an incredible adventure"
    },
    {
      "rating": "9",
      "text": "Yeah, the dog is digital and there are a couple of spots where it's pretty rough, but never in a million years did I think I'd find a movie that my 13-year-old son, my 4-year-old son and myself would all enjoy together. Not only did we enjoy it,but we all loved it. It's obviously geared toward being a family film and steered away from some of the darker moments of Jack London's classic, but if you've read the book, its stays close enough that you can fill in the blanks yourself and still enjoy the movie with your kids."
    },
    {
      "rating": "9",
      "text": "A visual spectacle with beautiful CGI. In terms of look and feel, this emotional story is not inferior to Disney. It is not a perfect score because some parts of the story and characters were not completed or deepened enough, but the core of the story was very good."
    },
    {
      "rating": "4",
      "text": "Even though Harrison Ford is billed as the star, his story doesn't start until an hour into the movie. First, we watch the protagonist pooch get kidnapped and transported to Gold Rush Alaska, where he's conscripted into a sled dog team to deliver the mail. None of this matters because the script is so excessively precious and corny. Making matters SO much worse is the horribly computerized canine creation. Not only do they anthropomorphize him to an absurd degree, but they have him doing things that no dog could ever intuit, much less perform. I'd say the scenery is beautiful, but not sure how much of that is computer generated either. Children (who can be less discriminating) will probably enjoy the oversized emotions, minimal grittiness and sweet canine star, but author of the novel Jack London must be rolling over…and I mean that as a dog trick."
    },
    {
      "rating": "8",
      "text": "Maybe it's because I was warned by various critics that the animated dogs were a distraction so my expectations we lowered, but I thought the animated aspect of the film was stunning. I often found myself forgetting that they weren't real. I had heard it was a kid's movie, and yet the full theater at 4:30 on a Friday had not one kid, but instead was adults between 50-80 years old. I suspect they were there because they had read the book when they were young. Afterwards from what I overheard, the older folks really liked the film. Scenery was beautiful and time-period sets were well crafted. My only disappointment was that Harrison Ford's character didn't have much screen time until the second half of the film. My wife had a hard seeing any cruelty towards the dogs (which was minimal). Overall a great movie. Thanks to all who made it!"
    },
    {
      "rating": "8",
      "text": "It almost feels like animal abuse for The Call Of The Wild to have as low a Metascore as it has... Almost. If you can get past the CGI creatures and are in the mood to sit back and just take in some pretty vistas, this is the flick for you."
    },
    {
      "rating": "10",
      "text": "The CGI is certainly the weakest part of this production, and the anthropomorphism is off the charts frequently, but there is still an awful lot to like here.  Great source material, a meaningful message, solid performances and splendid cinematography all raise this higher than numerous po faced critics would have you believe.  This isn't Citizen Kane, and nor was it intended to be, but it's a well made, beautiful movie with a positive message for a modern audience."
    },
    {
      "rating": "0",
      "text": "This is a loathsome, pandering, mess of a movie. The CGI is too slick by half, and the anthropomorphization of the animals would have Disney animators rolling their eyes and saying, \"Really?!?\" Harrison Ford gets a wide degree of latitude from me under most circumstances, but this movie should never have been made. I'm trying to imagine if I would like this movie if I were 8 years old, or had children who were. I can't see it. Ugh. A disappointing waste of 1 hour, 39 minutes (which seemed much longer)"
    },
    {
      "rating": "6",
      "text": "As a family adventure focused on a dog the movie is fine. I know the lead creatures were CGI but I thought it was animated from a real dog or a prop but having seen some of the behind the scenes footage (props to corridor digital on YT for this one) I have to give additional props to Harrison ford for being able to keep a straight face and act as well as he does against a guy in a mocap suit pretending to be a dog! (it's ludicrous sight to see, look it up and giggle on YT)"
    },
    {
      "rating": "5",
      "text": "Perfectly fine, I have no major issues with it. It’s just randomly dark for a kids film (murder, demon wolves and blood fights), and the CGI dogs often look off-putting (this thing cost $125 million!! Who approved this?)"
    },
    {
      "rating": "6",
      "text": "Never mind the laughable CGI. Doing so would neglect the critical issue at the crux of this shockingly middling (I honestly expected it to be a whole lot worse) project. This is an attempt to turn an unflinchingly bleak and austere novel from the early twentieth century into a children's film for the year 2020. The results are astoundingly complex in quality, and not in a particularly good way. The best way I can put is thus; the first 45 minutes of this movie are obnoxious and silly beyond repair, and the last 45 minutes are much more focused and emotionally resonant. There's an honest-to-God night and day difference between the two halves. First, you're witnessing a ludicrous, barely-of-this-reality-looking canine emoting for dear life against CGI backdrop after CGI backdrop, complete with slapstick and anthropomorphisms galore. Then, we end with a plaintive, melancholy meditation on life, death and the cruel reality of nature, featuring a much less cartoonish-acting -- and, thus much more palatable-looking -- doggo at the center. It's infuriating how much better the second half of this movie is than the first. So goes yet another film to toss into the \"Tale Of Two Movies\" case file."
    },
    {
      "rating": "8",
      "text": "This is a much more successful use of digital effects than the recent version of The Lion King. It takes a couple of minutes to get used to Buck not being a real dog but after that you just roll with it. Harrison Ford gives one of his best and most charming recent performances. Omar Sy and Cara Gee are also exceptionally good. The landscapes are wonderful and it is a thrilling tale well told. Don’t believe the critics that didn’t like it. This is a great film."
    },
    {
      "rating": "10",
      "text": "A tearjerking TAIL of wonder, love, and instinct, The Call of the Wild is one of the first truly memorable films of 2020. The movie will take you on a whimsical path, leaving you laughing, crying, and wanting it to carry on endlessly. Buck and John share growth and a journey that is nothing but perfect. Is the dog CGI? Yes. Is it noticeable? Somewhat. Does it detract from the film, itself? Not at all."
    },
    {
      "rating": "5",
      "text": "It's based off a classic novel and Harrison Ford's usually pretty reliable, so I figured I'd give it a go. And unfortunately, I really don't have much to say on this one other than its story feels very loosely-structured in comparison to the novel, and I've always felt as though a film can focus strictly on animals rather than humans for only so long before becoming a bit tedious. In addition, every single dog in this film is very painfully obviously CGI, which didn't sit too well with me. The bond between Ford and the main dog was endearing at times, and there are some cool shots and scenes throughout, but none of it's really enough to make the rest of the film worthwhile."
    },
    {
      "rating": "8",
      "text": "Went it to this expecting a bit off a dud movie was pleasantly suprised. Both kids loves it (G6 and B11). Decent enough storyline, dogs reacted realistically although the CGI can look abit 'off' at time, Great actors, wonderful scenery. Definitely recommend as a way to while away a rainy sunday."
    },
    {
      "rating": "5",
      "text": "Knowing this was coming for some time but without looking into it being based on the classic novel, imagined an intense thinking man's survival adventure like \"The Revenant\" and perfect for Harrison Ford as an action swan song of sorts only a rare very few could pull off at that age.  Well, it's not that!  From the trailer it was instantly clear the dog is not real and it's a problem even if many viewers don't outright realize it, they'll sense it (it does push the envelope technically and soon you won't be able to tell).  Ford is as usual completely convincing.  As legendary a mega star and great actor as he is, somehow he's still under-rated.  This movie would rate slightly lower but for a good classical story, however unoriginal."
    },
    {
      "rating": "5",
      "text": "Guess I was expecting a little more out of the story since Harrison Ford was in it. It had your \"Old Yeller\" moments if you are old enough to remember that film. Basically a feel good story with a digital dog being the main heroic character"
    },
    {
      "rating": "8",
      "text": "I thought the movie was really great and fun. You could instantly see that the dog is digital and there are lots of CGI, but it didn't influence the movie and it turned out great."
    },
    {
      "rating": "6",
      "text": "I admit I had assumptions going into this film. I thought it was all about Ford and his dog, but it's all about the dog. Ford's a great part, but it's not like the trailers made it out to be.So, I really hated the first act. The CGI was really rough and it seemed super cheesy and bland. Then, it started to pick up and became a pretty decent movie. It was very cliche and predictable but it was fun enough as the movie moved along.7/12"
    },
    {
      "rating": "6",
      "text": "It's a movie to spend some time if you have nothing better to do. I don't understand how Disney release this in theaters and Togo in Disney+, of Togo has much better production, cinematography and performances than this home movie."
    },
    {
      "rating": "7",
      "text": "The 20th Century Studios logo, compared to Buck (in terms of VFX), is horrifying. Still hard to believe Disney wanted to chunk Fox off their logos to get \"mooarrr companyyyysss\".Well, uhh... Congrats to Chris Sanders. He may be the only director I know who successfully translated from Animation (with stuff like Lilo & Stich and The Croods) to Live-Action since...I don't know, Henry Selick? (remember Monkeybone?)Because, while it has his problems, The Call Of The Wild so much feels like it wants to become an epic while it's surrounded by the \"Kids Movie\" territory that blocks it from reaching its full potential, especially when it has moments of interchangeable pacing that feel hollow or random at times.An epic that features a CG Dog that may bother a lot of the Audience (it didn't to me), but at the same time resonate WITH the Audience, thanks to the fact that it's essentially a Dog hybrid of Forrest Gump and Cast Away...oh, and it has Harrison Ford narrating too.And it's not that Buck bothered me because it was everything else that was bothering me. Either the rest of the animals is CG, there's a colossal waste of Karen Gillian (who's in it just as much as a Stan Lee cameo in an MCU Flick) and a rather bizarre and cartoonish plot point in the 3rd Act.But again, it's all salvaged by the journey of Buck, which is fueled by a nice message about \"finding your place in the world\" and the fact that A-listers like Harrison Ford and Omar Sy are there to carry the movie \"somewhere\", since a major part of the movie is just stuff happening for no reason (despite knowing the mission of selected part).Not only that but also the fact that Dan Stevens plays more of a beast in here than the actual Beast in the Beauty And The Beast remake, playing this selfish, idiotic Circus(?) leader who hates everything but that sweet sweet gold.So yeah, I liked The Call Of The Wild, and while I'm sure you won't love it or something (the Box Office speaks for itself), at least you can't deny that it had a story and a really good one at that."
    },
    {
      "rating": "1",
      "text": "The CGI dog did a poor acting. I don't know how it is done, but it was very weird. The dog's behaviour was totally unreal. It is as if a human acted as a dog. Poorly made movie, could not even stand more than 10 minutes of it."
    },
    {
      "rating": "5",
      "text": "Harrison Ford was fine but the whole film failed to be more interesting. To be honest I enjoyed Togo a lot more."
    },
    {
      "rating": "7",
      "text": "A solid familiy movie. Keeps you entertained until the end and gives wholesome vibes!"
    },
    {
      "rating": "10",
      "text": "I gave 10/10 :)  Gets better as it goes onWhen I first started watching this movie, I didn't think I was going to enjoy it, due to some of the scenes at the start, but as the movie went on, it got more and more BRILLIANT."
    },
    {
      "rating": "6",
      "text": "The Call of the Wild is a strange film. All the pieces for a great movie are here but the studio or Director choose to be lazy instead of taking advantage of the opportunity. If you have seen any clips or trailers from this film then you know that they animated a dog instead of using a real dog. It’s not just the dog they created in CGI. They did it to every single animal. It’s incredibly lazy and distracting. It’s not that the animals look bad, it's just uncanny. It looks like a dog and acts like a dog but it doesn’t feel like a dog. At certain points within the film, the dog will make “human expressions”. It feels out of place. The movie feels like it honestly should have been animated. I would have really liked this movie if it had been animated but I wouldn’t have loved it. The film still has issues in the character and editing category. Most of the characters in the film were pretty good such as Harrison Ford and  Omar Sy but Dan Stevens' performance and character/villain was pretty awful. His performance was so over the top that it was distracting. I normally like over the top performances but this wasn’t the kind of over the top I like. His character was pretty awful too. He is supposed to be the main antagonist but he is only in the film for about 5 minutes. He feels more like a plot device than a character. While Steven’s character is pretty bad, Ford and Sy’s characters were pretty good. Both of their characters were fleshed out and were very likeable. Their performances added to this likeability. Harrison Ford did a great job. I honestly felt that this is one of his better performances in a long time. He brought a lot of depth and vulnerability to his performance and made his character relatable and interesting. Omar Sy did a pretty good job. His performance wasn’t on the same level as Ford’s but he still was enjoyable to see on screen. The plot of the film and its sequence of events was surprisingly really well done and emotional. The film is fast paced all the way through and the film is able to successfully deliver emotional punches with the human characters but not for the CGI animals. The only issue I took with the structure and sequence of events was how the second half of the film was much better than the first half. The first half of the film has good performances but the plot hasn’t fully kicked into gear yet so it’s not as interesting. The second half is when Harrison Ford comes in and the film becomes much much better. Most of the film’s technical aspects were pretty good too. The cinematography was pretty good for the most part but did have some beautiful establishing shots. The score by John Powell was great and helped add some emotion to certain scenes but the editing wasn’t that great. It wasn’t terrible but it was noticeably awkward when it transitioned to other scenes. Overall, The Call of the Wild has all the pieces to make a good film but decides to take the lazy route and animate all the animals muting some of the emotional weight."
    },
    {
      "rating": "6",
      "text": "A proposta é interessante e deveras difícil. Um certo nível de empatia é causado, mesmo se tratando de animais em CGI -, mas há furos no roteiro que simplesmente impedem que o filme seja mais que algo \"pipoca\".Desde o princípio, somos apresentados ao Buck. Um cachorro brincalhão, sem jeito, mas de bom coração, que não é muito apreciado onde vive. Era como se ele nascesse para um propósito diferente: A Natureza.O filme segue essa premissa e funciona muito bem no seu primeiro arco. Os personagens apresentados são carismáticos e fazem falta ao partirem. Não é dada muita atenção aos demais cachorros, exceto num momento onde eles são necessários para o amadurecimento do próprio Buck. Um deles, que era o lider e chamava atenção, some e nem se quer retorna ao filme, o que é um erro visto o potencial que ele tinha. Em um momento da trama, os cachorros somem, e nenhuma importância é dada a isso. Ficamos sem respostas e o roteiro demonstra se importar apenas com o cachorro de bom coração, como ele fosse o suficiente e cobrisse a lacuna de todos os personagens. Isso deixa o filme superficial demais, fazendo com que não haja nenhum apelo dramático e que tenhamos a sensação de que o roteiro é unidimensional. É frustrante, pois tudo caminhava muito bem até que o casal dos correios fosse embora. Tudo desanda a partir dali.Quanto a CGI, apesar de não conseguir passar a sensação de um animal de verdade, ao menos não no protagonista, é convincente na maioria das vezes e aqui há um bom trabalho nas expressões faciais, que eu particularmente achei mais atraente que a do Rei Leão Remake. Os cenários são absolutamente lindos, e a fotografia aproveita muito bem disso e entrega planos belíssimos de bem estruturados.Call of the Wild é um filme lindo, mas que se perde com o tempo e se contenta com o que foi apresentado e descartado, fazendo com que o desenvolvimento ficasse todo em torno do Buck, anulando qualquer aparente \"universo\" que poderia haver."
    },
    {
      "rating": "7",
      "text": "This is a sad story of bad animal welfare, with an adventure setting (as if most people aren't already familiar with the basic story!). Its very much an ok film, not especially 'stand out'-ish but not really bad by any means either. There are some nice landscape shots and the characters are ok - the casting isn't bad, not brilliant but ok. I wouldn't especially recommend it, no."
    },
    {
      "rating": "4",
      "text": "The use of CGI was noticeable to me and it surely did affect my enjoyment. Not in a good way. Those who were unaffected by this seemed to like the Movie. Sadly, liberties are also taken with this adaption of London's classic book. I'd hoped they would stick to the real story."
    },
    {
      "rating": "6",
      "text": "A story about the journey of dog who seemingly had it all but is quickly thrown into the wild to discover himself. The main protagonist of the film is Buck, a CGI canine that is funny and quirky enough as we see him grow into the leader and alpha dog he needed to be. The plot of the film is nothing new or clever but has plenty of fun interactions of more CGI dogs that is just enough to make this film passable. Harrison Ford gives a good performance for the minimal screen time he is given. The movie never really shows us why the story of Buck had to really happen it all just kind of does as well as Ford's character has some background but not enough to satisfy his arc. It's a movie safe enough to watch with the family albeit it is an adorably mediocre movie."
    },
    {
      "rating": "7",
      "text": "*Majestic wolf howls in the background* Welcome back to Stream To Big Screen! This week we were able to review the new version of the often adapted Jack London classic, The Call of the Wild. If you haven't read the book in a while or just don't remember, the book is about a dog named Buck who against all odds makes it through the roughest parts of the Yukon to find his true calling in the wild (skipping a bunch of key part and oversimplifying).Now, let's get this straight. THIS MOVIE DOES NOT FOLLOW THE BOOK! DO NOT TAKE YOUR CHILD TO SEE THIS MOVIE INSTEAD OF THEM READING THE BOOK. THEY WILL GET A \"C-\" AT BEST. THEY WILL HAVE THE GIST OF THE BOOK BUT NOT THE CORRECT DETAILS. Now let's get to the review of this movie.Twentieth Century Fox Animation and Twentieth Century Fox brought us this latest version and I must say as far as animation goes, it was the star. The film looks bright and crisp. The scenery is quite immersive. I almost know what it feels like to actually ride on a dog sled. Speaking of dog sleds, the animation with the dogs is sometimey. I'll admit most of the time the animation portrays the dog's emotions and expressions flawlessly. The other part of the time I feel like I'm watching a cartoon, a la Garfield, Scooby Doo animation. Quite frankly, it's off-putting. I wanted to forget that I was watching CGI creatures but the quality of these effects just kept on reminding me (I'm looking at you mystic wolf). Now, this same aspect I'm sure kids wouldn't even mind.Kids also won't mind that this movie is almost too light. This book has some very heavy scenes and themes but this movie approached those same concepts in the lightest way possible. The PG rating handcuffed the producers almost too much. I understand they were producing this for a younger audience, but they may have gone too light for this classic. The PG rating definitely influenced how closely this movie could come to the true spirit the literary piece of work.Long story short, The Call of the Wild is an American middle school reading classic adapted to the big screen a few times. This movie has been updated with all the dog-loving CGI you can handle. This movie will be perfect for the classroom for kids but just worth a matinee visit for the family to the theater."
    },
    {
      "rating": "6",
      "text": "Thinly written characters and an overabundance of CGI can be off-putting, but The Call of the Wild finds success as an enjoyable if predictable crowd-pleaser. Be prepared for a generic plot but ultimately rewarding adventure."
    },
    {
      "rating": "9",
      "text": "This was a wonderful adaptation of a great book. It was nice to finally have a movie actually focus on Buck. Sims of the CGI could have been better served to use practical effects, but overall this is a great family movie, and deserved better than to have theaters shut down on it."
    },
    {
      "rating": "7",
      "text": "This one will tug on your heart strings, especially if you have any affinity for dogs. I was a little worried about the CGI on the Buck dog — it wasn’t the best — but it didn’t detract from the overall experience."
    },
    {
      "rating": "10",
      "text": "It’s an awesome movie with great screenplay and direction. It touched my heart"
    },
    {
      "rating": "6",
      "text": "Overall I'm against resurrecting dead actors through CGI, but they did a semi-convincing job with Harrison Ford. Gives me hope for that new James Dean Vietnam movie."
    },
    {
      "rating": "5",
      "text": "Shallow feel good story with no real narrative. The CGI animals were among the most convincing performances."
    },
    {
      "rating": "10",
      "text": "Fiel al libro, mantiene la esencia dándole toques de humor convirtiéndola en un film agridulce con una gran enseñanza, paisajes hermosos y los personajes fieles al libro, lo único reprochable fueron algunos cambios de trama que disminuyen la crudeza de la historia, pero en general buenísima."
    },
    {
      "rating": "7",
      "text": "very very exlent good game for pc nice work for qulitycarater was very good"
    },
    {
      "rating": "8",
      "text": "Quality family movie night (6 and 8 years). Not familiar with source material. Good visuals and atmosphere. A few laughs. I guess some of the dogs' capers were a bit cheesy but I'm not sure it was supposed to be gritty realism. My only real criticism is that when it ended I felt a bit like, \"Wait, is that all?\" That is, the story was a bit minimal and lightweight."
    },
    {
      "rating": "10",
      "text": "Good film. And it’s very strange why critics gave such a low rating. They were not even able to reason properly."
    },
    {
      "rating": "7",
      "text": "It's probably a movie aimed for kids, but the story got me even as an adult."
    },
    {
      "rating": "9",
      "text": "Just felt a bit too short for how much was in it, but still very enjoyable. Great movie"
    },
    {
      "rating": "8",
      "text": "I don't have much opinions on this movie, i liked it but not much to say. Everyone is bothered by CGI dogs and animals, but I'm not. I acknowledged that they are CGI, but it did not bothered me. I never watched Togo, but i heard it is better. That is it 8/10."
    },
    {
      "rating": "6",
      "text": "I think the fake CGI dog stops this film from being good but the music and story is really sweet and fun. Harrison Ford was definitely trying here."
    }
  ]
}