{
  "id": 580,
  "title": "The Croods",
  "starring": [
    "Nicolas Cage",
    "Emma Stone"
  ],
  "runtime": 98,
  "genre": [
    "Animation",
    "Adventure",
    "Family",
    "Fantasy",
    "Comedy",
    "Action"
  ],
  "description": "The prehistoric Croods family live in a particularly dangerous moment in time. Patriarch Grug, his mate Ugga, teenage daughter Eep, son Thunk, and feisty Gran gather food by day and huddle together in a cave at night. When a more evolved caveman named Guy arrives on the scene, Grug is distrustful, but it soon becomes apparent that Guy is correct about the impending destruction of their world.",
  "releaseYear": "2013",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/p7lJkqHlK01nr0zNacunUFI5Qxy.jpg",
  "categories": {
    "plot": 6.963636363636364,
    "acting": 7.0,
    "ending": 6.916666666666667,
    "soundtrack": 9.0,
    "cinematography": 5.5,
    "familyFriendly": 7.0,
    "funny": 7.303030303030303,
    "action": 7.166666666666667
  },
  "reviews": [
    {
      "rating": "6",
      "text": "While not horribly memorable or spectacular, it is a good kids film. The animation is nice and flashy and the characters have nice little arcs throughout. The first 10 minutes were bad and the end was cheesy but the rest of the film is funny and colorful. That'll be enough to entertain your kids and to keep parents from pulling their hair out."
    },
    {
      "rating": "10",
      "text": "Believe it or not, this is the best movie I've seen this year.  Don't make the mistake thinking this is only a Kira's movie.  Wildly imaginative and creative.   I saw this with two other adults and we all loved it."
    },
    {
      "rating": "6",
      "text": "The Croods is a cheer up insightful animation, that will please die hard animation fans, family but mainly kids. It has some great messages about family and life that will please and comfort families. Despite that The Croods is a good family animation, but it has lots of flaws. First of all, it doesn't describe the origins of the family, they are just vessels to move on with the story. Secondly, it has some falling apart moments that bored the hell out of me, also that the story is ridiculous, seriously! What happens to the world ending???"
    },
    {
      "rating": "7",
      "text": "Probably greatest graphic in an animated movie this year (2013)\rN.Cage does an impressive voice acting\rIt's an enjoyable movie overall for people of different ages\rEven if some complain about the jokes it has better jokes than many of the animated movies, I would have given it a better score but still doesn't come as a comedy but as a family animation with comic sparks\rit sorts of reminds me too much of ice age 2 and unfortunately like ice age 3 it sort of trades fun for family business"
    },
    {
      "rating": "10",
      "text": "This is the best animation movie ever made also the best film of 2013 till today.With fresh theme nice humor and awesome 3D effects. Hope they make part 2 of this as soon."
    },
    {
      "rating": "7",
      "text": "Took my 2.5 yr old to see this, her first ever cinema experience so will always be special for her  a cross between Flintstones, Ice Age & Lion King, a little too many scenes featuring characters falling down but some highly original scenes and a lot of fun. The Metascore is off in this case."
    },
    {
      "rating": "9",
      "text": "Really Funny Movie....................................................................................................................................."
    },
    {
      "rating": "10",
      "text": "A perfect match for children who love movies such as Ice Age and The Lorax. The Croods is a magical movie with lots of fun and lost of laughs. Very sweet and cute with lots of positive messages about being together with family. The Croods is your ticket to a great child movie."
    },
    {
      "rating": "7",
      "text": "The Croods is a movie that offers great family filled entertainment and stunning visual 3D effects. Do not let the title fool you. You will not find any “crude” humor in it. It’s a slapstick film. Slapstick done right that is.The story is unpredictable, subtle and smart enough and the fact that it’s an animated feature gave the creators more flexibility in bringing their imaginations to the screen. Taking us with the original “first family” to “follow tomorrow and follow the light”.\r This latest feature from Dreamworks animation is about a family who was forced by nature to leave their humble abode due to the effects of an apparent looming apocalypse that destroyed their cave. They were caught in the middle of an evolving colorful world. It’s also important to note that this movie could very well be a stepping out of the Pixar shadow by Dreamworks animation. Grug the character voiced over by Nicholas Cage, is the patriarch who protected his family all his life. He is an over protective dad who only wants to make sure that members of his family are safe from the harmful elements of the world outside their cage. Emma Stone plays the voice of Eep the teenage daughter in the family trying to exercise her freedom to explore and see what is in store for her and her family in the outside world. During one of her escapades she happen to stumble upon Guy the nomadic character voiced over by Ryan Reynolds who helped guide them through the twists and turns of their road trip and starting a Tarzan and Janesque cute love story.\r The characters however did not have enough time to develop due to it’s fast paced sequences. However, I would not mind seeing a sequel.Hearing the laughs and giggles of kids while watching this movie in the theaters added to the fun and enjoyment to the whole experience.\r The tandem of former Disney animator Chris Sanders who brought us Lilo and Stitch in 2002 and How to train your dragon in 2010 and Kirk De Micco who wrote and co-produced the animated feature Racing Stripes in 2005 and wrote and directed Space Chimps in 2008. Through their screenplay they did a great job telling a story that caters to both adults and kids alike. A story that flows without any unnecessary distractions and through their directing skills they were also able to put together the right voices that brought the characters to life. The Croods is the first animation Film to be distributed by 20th Century Fox. It opened in 4,046 cinemas 3,000 of which were 3D equipped. The movie debuted at the top of the box office in the United states and internationally during it’s opening weekend last March 22nd earning an estimated $44.7 million in the United States during the first 3 day release. Dethroning the former number one film OZ. The Croods is expected to remain in the top for a couple more weeks due to it’s family oriented nature and lack of same genre competition."
    },
    {
      "rating": "7",
      "text": "It catches the attention from children, but did not achieve any interest, for the similarities from the Flintstones. except that it has good quality, magnificent pilot and a righteous end."
    },
    {
      "rating": "10",
      "text": "Hilarious movie.  I thoroughly enjoyed it, particularly, \"release the baby!\" Animation was great, characterization was great, and you can take the whole family.  Little ones might be upset by the intensity of the action but older ones (7-8) will like it.  I laughed out loud."
    },
    {
      "rating": "8",
      "text": "Very enjoyable cute movie about cavemen with a good cast and cute storyline that goes with it. Some very Cute animals and good jokes which is very entertaining for the kids and as well as the parents. Go see it or buy it on dvd blue ray itunes whatever. (8/10)"
    },
    {
      "rating": "8",
      "text": "To be honest, this was better than I expected. I thought it might just a bunch of cavemen walking around a rainforest, but it becomes a magical journey when you see it, I recommend it."
    },
    {
      "rating": "7",
      "text": "A lot funnier than i expected, guess it kinda took my by surprise. Not much to say of it. I had fun, that's that. It ain't gonna win any awards or nothing but hey, over all a great kids movie that i enjoyed more than i thought i would."
    },
    {
      "rating": "10",
      "text": "This may be not first or the second best animation i have ever seen. but the movie is very good, it maskes us laugh and happy"
    },
    {
      "rating": "3",
      "text": "The plot was incredibly predictable, the comedy was bad and the pacing was way too fast during the first three quarters. The film was not creative, the extent of the creativity being animal  other animal/plant. The characters to me were annoying and the majority were completely static, with the exception of Grugg and Eep. After the Tar pit scene, the plot becomes a lot less predictable, and the pacing is better, but I still couldn't care about them. The conflicts were born out of pure stupidity, and there were plenty of plotholes to go around. (Where are the trees? You can't simply survive on eggs you have to risk death to get. At least kill the bloody things.)"
    },
    {
      "rating": "6",
      "text": "It succeeds in everything, but just barely. It is fun but everthing else from the direction to the characters are just about average. It's a good time but instantly unmemorable."
    },
    {
      "rating": "4",
      "text": "A Poor Mans Flinstones? Somewhat....\rStill Barley Charming....."
    },
    {
      "rating": "3",
      "text": "Ok, this is Dreamworks animation trying again too hard. The animation isn't my personal favorite. Beautiful colors but again I just didn't fall in love with characters or story :0/"
    },
    {
      "rating": "8",
      "text": "Lot of 3-D films don't technically work but The Croods proved my theory wrong. It used 3-D very good (But still not enough). To say the least this movie is similar to Madagascar but still not enough to complete that franchise."
    },
    {
      "rating": "9",
      "text": "Great movie. If possible, go see the 3D version as the animators really went a long way to make it a true part of the film's look and feel. The storyline is phenomenal, voice acting superb, and there are plenty of laughs for both kids and adults. Definitely one I would gladly watch again."
    },
    {
      "rating": "10",
      "text": "If you were a fan of films such as \"The Incredibles\"  or \"Despicable Me\" go see \"The Croods\". You will laugh (frequently), you will possibly cry (if that's your thing). You will be entertained by this riveting tale of, family, friends, relationships, growth, acceptance and evolution. Highly recommended for all ages."
    },
    {
      "rating": "6",
      "text": "I think Ice Age already covered what this movie did so I'm in the been-ther-done-that crew. I think a 6 is the perfect rating for this movie. It's kinda funny."
    },
    {
      "rating": "10",
      "text": "I love this movie! The story line and the animation ticked my senses and captivated my mind. What a great movie! I like how it teaches children that no matter how much your parents don't say that they love you, they are always thinking it, no matter how much a brat they can be. I love unique movies and this one is simply that."
    },
    {
      "rating": "2",
      "text": "I had huge expectations to the movie, because my aunt's family told me that the movie is hilarious but I think it was bad."
    },
    {
      "rating": "5",
      "text": "The film looks great with its bright colors and there is some decent humor, which will entertain the kids but that’s not enough. This film is meh. Outside of the last third, which is somewhat engaging and heartfelt this movie has little to offer. The story and characters are generic containing a lot of stuff that I’ve seen before (some of which from other Dreamworks movies) and there is no good humor or hilarious side character to save this movie. This is disappointing since Chris Miller was working on this movie and he has worked on such Disney films as Mulan along with Dreamworks hits like How to Train Your Dragon. I can kind of feel his touch but not really. Maybe he wasn’t that involved in it though. I heard that originally Aardman was going to make this film but when their deal with Dreamworks ended they got to make the movie instead of Aardman, which is a shame because I would have loved to have seen what Aardman’s version would have been like because knowing them it would have had a lot more heart like Arthur Christmas (which is a great film) and/or humor like Pirates Band of Misfits. Even so this is coming from a studio that has made some pretty good movies such as the first two Shrek movies, How To Train Your Dragon, the Kung Fu Panda films, and most recently Rise of the Guardians. I am shocked that this movie is getting a sequel because this doesn’t seem like the kind of movie that would catch on. I don’t know anyone who saw it and it wasn’t getting that much buzz. However, obviously there are a bunch of little kids that saw this film and liked it and I won’t blame them because there are a lot of mediocre films I saw as I kid that only recently upon a repeated viewing am I realizing are crap (like the Ice Age films). So if you have kids show them this movie it will entertain them but if you are looking for that exceptionally good animated film this ain’t it."
    },
    {
      "rating": "7",
      "text": "\"The Croods is a HUGE achievement for Dreamworks Animation. Visually appealing with a heart-warming story that at times is emotional and very clever. Featuring a nice voice cast, a film that could have been awful, turned out to be quite the opposite.\" ..B"
    },
    {
      "rating": "9",
      "text": "Dreamworks is making some great animation, and is currently better than Pixar.  The last two Pixar films (Cars2, Brave) were duds.  The animation and 3D of The Croods is excellent.  There are imaginative looking creatures all along the way, and the pacing is frenetic and funny.  It isn't quite as good as How to Train Your Dragon (so far their masterpiece) but it's close.  I thought it would bother me that they used Nicolas Cage as the voice of the father because his voice is so distinctive that it would be distracting, but it didn't turn out that way.  All the voice actors do a fine job."
    },
    {
      "rating": "9",
      "text": "DreamWorks proves once again that they know how to create a beautifully animated, hilarious, and heartwarming family movie. The all-star voice cast really brings these characters to life, and the movie is filmed to the brim with the non-stop laughs. The story at the core of it all is sweet as well, even if it is a bit familiar. I have to give special praise to the fantastic animation work. It's hard to not believe that the environments and the animals aren't real. They are some of the most lifelike and realistic I've ever seen in an animated movie. The character models also look great, but thanks to their exaggerated features end up looking less lifelike than the environments and animals. However this is still the best looking animated movie I've ever seen, even beating out Pixar's strongest efforts.\r This is a fantastic, must-watch family comedy. It's got everything a high-quality animated movie should have, like fantastic voice acting, animation, humor, and story. So when you and your family are sitting down for a family movie night \"The Croods\" should be at the top of your list. It truly is one of the best animated movies I've ever seen."
    },
    {
      "rating": "6",
      "text": "\"The croods,\" or is like to call, \"Ice Age The Great caveman adventure,\" is a film made for children and brain dead parents who either are religious and don't seem to find this film offensive, or aren't and are just plain brain dead to begin with.  If you, like me saw the trailer for this film, you might have actually thought that this was Dreamworks making another terrible sequel to the Ice Age series of films, however I was pleasantly surprised after watching the full film from start to finish.  I thought, \"Wow, its hard to believe a bunch of morons at Dreamworks thought this garbage would actually sell with Nicholas Cage attached to it.\"  He's the worst thing in it, he's the worst character, he's the worst voice actor, and he's a detriment to the movie as a whole.  Honestly remove his character and take away the dialogue from the majority of the film?  This would've been great, but yet again its another imaginative film for children that can't even treat its audience like children.  It spells everything out, it has no mystery, it lacks any charm it COULD have provided ultimately.  My biggest issue here though, is the plot is really thin without the inclusion of \"Guys\" character.  I mean it could've just gone nowhere entirely, but thank goodness they just so HAPPEN to meet another character that just so happens to MOVE the plot along otherwise they would've all died in the cave after the first earthquake I guess.  \"Eep\" is great, voice work is solid here, but her expressions, character design and general animation are what make her a good character.  Everyone else feels kind of cookie cutter in comparison, aside from \"Guy\" of course.  Its obvious that its suggesting romance between Neanderthals and Homo sapiens, which is a cute thought, but these two species would've likely attacked and killed eachother on sight as well.  Just a little bit of scientific knowledge to thrown for good measure, since their is absolutely none of it in this film.  Turtles with wings, giant walking land whales, flying piranha birds, strange amalgamations of animals that could've never existed- you name it.  They're all over this movie.  Part of me likes to indulge that kind of imagination and I could see a child being interested in such things, but another part of me is literally shouting internally things like, \"This is completely wrong and makes no sense.\"  All in all, if you edited Nicholas Cage and his character out of the movie, fleshed out the family more and make a better motivation for why Guy and Eep even met up to begin with, it could've been a pretty stellar movie.  Like maybe an arranged marriage or peace treaty between a Neanderthal and Homo Sapien family or tribe perhaps.  Its funny that when I think about when early Homosapiens wandering the Earth that even I could write a better plot about them going on an adventure.  Dreamworks- nice try in attempting to catch lightning in a bottle twice (we know you can't by now).  Turn down the trippy ridiculous Pandora environments and maybe try writing a film that appeals to adults next time."
    },
    {
      "rating": "6",
      "text": "A Caveman animation almost entirely about family sounds like a generic idea for an animated film but The Croods surprises with its unexpected turns, stellar animation and emotional finale. The film follows a family of cavemen called The Croods who are led by father Grug (Nicholas Cage). However when Grug's daughter Eep (Emma Stone) defies him and leaves the cave and meets Guy (Ryan Reynolds) she learns the end is coming and that she must force her family to change their cave dwelling ways in order to survive, something Grug might be incapable of doing. The Croods is paint by numbers animation with the plot feeling like a rehash of Ice Age with a bit of The Flintstones thrown in for good measure. The film is generic in its plotting and it feels very much like a flash in the pan, a film for now that people won't remember that well in the future. However it does have enough for it to have been a shame to miss. That being said, this caveman saga is hobbled very early on by some lacklustre voice acting, especially by Katherine Keener who plays Grug's wife Ugga. She puts very little into her performance something that becomes very clear towards the end when she under delivers in some key scenes. The film soldiers on though and manages to be unique through its action with some of the set pieces being truly breathtaking. In fact the attention to detail in the movie is remarkable, the world they have created is one untouched by animation so far and for a film that's main colour is brown, that's impressive. The finale of the film is terrific for multiple reasons but the animation is the best aspect, there is enough action and excitement in the ending as there is in the rest of the movie and the animators managed to put enough into their shots so that it looks amazing but doesn't give you a Man of Steel headache. In fact The Croods really comes alive in its ending and differentiates itself from other animated fare with a finale that is action packed, funny and carries one hell of an emotional punch that feels quite familiar but still has the desired effect. Its a well crafted film from the director of How to Train your Dragon and a worthy but not quite as good follow up."
    },
    {
      "rating": "8",
      "text": "huge surprise of an animated movie! The critics were totally wrong about this one! It was fun to watch, with great animations! and the story was decent as well!"
    },
    {
      "rating": "7",
      "text": "This was a good movie with enjoyable characters. I found myself laughing or smiling constantly. The director made some really good movies in the past, like Lilo & Stitch and How to Train Your Dragon. This was definitely his weakest film, but still good. The one flaw with the movie is that it was very repetitive. The whole movie the family is constantly running from danger and they reused some jokes. I think all kids well like this movie."
    },
    {
      "rating": "9",
      "text": "The Croods is unique. That is a simple way to put it, but this is the best cavemen movie i've ever seen. The show has it all. Interesting characters, heartwarming moments, nonstop laughs, and beautiful animation. Sure, any computer animated film nowadays can look great, but The Croods stands out for its extremely colorful animation. YOU MUST SEE IT!"
    },
    {
      "rating": "7",
      "text": "The Croods, in a nutshell, is a pretty decent film; it offers exhilarating fast paced and comedic action scenes and slow, story based scenes (also comedic). Although the dialogue isn't particularly clever, it'll do for a simple Dreamworks feature film; it's more visual than vocal for the laughs. The film uses a simple but charming plot causing a simple family of cavemen to go on a long, crazy journey to \"Tomorrow\" by following the incredibly close sun. It's packed with mildly funny, action-packed, and emotional sequences. The film doesn't really end, as such. It kind of ends with them \"going on\" towards \"Tomorrow\". So I give this film a... 72/100!"
    },
    {
      "rating": "9",
      "text": "Again movie critica show us that their jobs are meaningless, especially high end pompeous ones who cant seem to generate an objective review if their lives depended on it. They could at least rephrase \"review\" to \"my opinion\". This movie is heartwarming and fits its TARGET AUDIENCE well. Also pretty funny!"
    },
    {
      "rating": "6",
      "text": "Despite a familiar formula from other animated features, The Croods is somehow refreshing amidst Neanderthals during Year 1. Unfortunately, marred with several unimpressive voice-acting performances from Nic Cage and Emma Stone."
    },
    {
      "rating": "8",
      "text": "“The Croods” has a simple story about old vs. new and family. The family must move when disaster strikes and learn to adapt to new ways of doing things. Resistant at first, they meet a boy named Guy, who helps them rediscover the ever changing world. The film tells us to embrace new things with open arms and enjoy all the wonders life has to offer. Not everything new is evil or makes you any less of a person than your ancestors. Family is a pretty central part of the film as we can see them bonding and doing a lot of things together.\r The film is a little light on heart and emotions, but more than makes up for it with its unique sense of humor. The punches keep rolling with slap stick, sight gags and jokes about cavemen and their primitive ways. I was literally laughing from beginning to end. The sheer amount of creativity in the film is commendable and I was constantly thinking where do they come up with some of these ideas.\r Chris Sanders and Kirk De Micco do a pretty good job of directing the film. They give a good amount of attention to the family and each individual character. I really like how certain things introduced earlier in the film serve a purpose later on. If any animated movie ever deserved to get nominated at The Oscars for Cinematography, it would be this one. The shots and angles are so unique and filled with so much energy. The sweeping shots of the landscape and the skies are beautiful to the eyes. The hunting scene early in the film is really where most of this is apparent.\r The characters are good, especially Grug. He’s funny and a really devoted father, but incredibly stubborn. Nicolas Cage brings the right amount of crazy caveman and caring father to his character. Emma Stone as Eep is also a solid character. She’s curious and her design is way better than what the trailers make it out to be. I like how she isn’t the typical perfect figured woman. She has messed up teeth, she has a full figure, and overall is not bounded by gender roles. The rest of the cast is okay as they don’t do much. The mom is kinda bland, Thunk and Gran provide some of the comic relief, and Guy is just the cool kid that has the crazy new ideas that shake up the family.\r The animation is quite gorgeous especially the hand-drawn opening sequence. The desert scenes are desolate and feel very isolated. A great juxtapose to it are the lush and vibrant forest locations. The directors do a lot visually with the film and make everything the characters see feel new to us as well. When they see stars for the first time, it really feels like you’re really seeing stars for the first time. The character designs are unique and highly creative. Every creature is completely new and never before seen. Score for this film is actually quite good. It feels very prehistoric, but with a modern flare. It gets really exciting and emotional when the film takes a slight dramatic turn.\r Overall “The Croods” is a pretty good film. It has probably the best cinematography I’ve ever seen in an animated feature. It’s highly creative, and the animation is quite beautiful. The main characters are well rounded and the side characters serve their purpose. The story is a little simple and lacks an emotional punch, well at least until the end, but it is effective. Humor is top notch and will keep you laughing all the way through. I give it 4/5, creative, hilarious, and a fun time for families of all ages."
    },
    {
      "rating": "9",
      "text": "I was actually expecting a lot less from that movie. So, it's clear that it has surprised me!\rAnd in a very good way! It was a while that I wasn't seeing a good CGI film like this. To be completely honest, both Madagascar 3 and Ice Age 4 weren't good. This one was... pure. Funny. Pretty original. Look at that, in the whole movie there weren't no farts, no bad words and no... burps? Yep. I was constantly laughing or smiling during the movie, and that made me very happy. There were some very original gags! Like the dog one... But, moving on, the characters. The characters were very well done: they were all funny, human and they had their personality. I really empathized with some of them! And that's why I was expecting at least one of them to die. I know, this doesn't sound good, but, I was really expecting it. Because, in every movie (ok, not every movie) there's at least one sad scene. And in this one... there wasn't. But, from a different point of view... I'm glad that no one died. The music was cool, but, yeah, just cool. The graphics were average. You know, in some parts, like the sea one, the graphics were amazing and near to perfection. But in other parts they were really average. I'm not saying they were bad, they were not bad at all, but, they were the graphics that you expect to see. Nothing more. Nothing less. Expect, as I said before, for some parts, where they were amazing. Why did I give it 9 and not 10? Well, for just one thing: how many endings does this movie have? Are they kidding me? Considering that I was in needing to pee, It really got me on my nerves to see like 8 endings! But, that's okay. I guess. Overall, that's a really great movie! And you all should watch it. Bye."
    },
    {
      "rating": "8",
      "text": "This beautifully designed and colourful cartoon sustains its story and pacing very well. It is full of wit, humour and funny lines and it ends on an up beat note with a very moving finale. I must admit to being very resistant to seeing it, but I must confess it's not only (along with Frozen) the best animated film of the year, it's also one of the better films of the year generally. Where most animated films run out of gas long before the end this one delivers in full. A real hoot."
    },
    {
      "rating": "8",
      "text": "The cinema room 5 where I live, is not working because the projector can not produce tapes digital theater and I could not see Silver Linings Playbook.\rYes, believe it or not, that movie was just on my land. had to get all the public to see another movie because there was reimbursement and I choose this because it was the most striking click, but that do not care so I'll go to the point.\rI must say I just surprising me but there is little to say in a more than remarkable animated film. It takes a while to pick up pace but once pluck not stop.\rThe idea of seeing a story told a thousand times but starring cavemen do not think is particularly attractive, a fact that is compounded if the character designs, one of the main problems in the Dreamworks animated film from Shrek 4 in my opinion  are not especially attractive.\r What I liked most were the good character designs and environments that run on them, they are beautiful and attractive as well Life Of Pi, of course it does not exceed it and are not comparable, but they are really good, they were very well done especially if you enjoy it in 3D you will be amazed.\r We must not deceive ourselves and say 'The Croods: A Prehistoric Adventure' is an essential film, but it is a perfect example of the commonplace and the topics are not necessarily bad, but you can still build great entertainment for all public. The only really essential is that there is someone behind with talent and desire to do things, which is precisely what happens in this case."
    },
    {
      "rating": "7",
      "text": "One of the cleanest family movies in a long time, \"The Croods\" is a fun and brilliantly animated adventure that is high on laughs and yet, low on plot.  The voice actors do a solid job, and solid messages on family and the importance of parenthood are present.  The animation is both amazing and 3D-worthy.\r The film is near-perfectly clean, with the only possible (slight) objections being some silly slapsticky violence and Eep's outfit maybe qualifying to be too short.  However, \"The Croods\" screenplay is thin in places, it has some tonal inconsistency, and the relatively rough-housing main characters aren't as memorable as the mild-mannered \"Flintstones\".  Its' still something to take the whole family to, but those looking for an original, groundbreaking film may be a bit disappointed here.\r For a more detailed review, visit www.moviestakenseriously.blogspot.com."
    },
    {
      "rating": "7",
      "text": "Like Oz the Great and Powerful, and Winnie the Pooh, The Croods succeed in being an awesome kids movie. Every character has there own lovable personality, except the mother who has none, and the message is quite endearing."
    },
    {
      "rating": "8",
      "text": "I really enjoyed this film because not only is it visually beautiful but it is very funny and emotionally gripping.  The family dinamic really worked for me and the little girl Sandy and the sloth Belt were my favorites."
    },
    {
      "rating": "7",
      "text": "Story  Average  Action  Excellent  Characters  Excellent  Fun  Excellent, Ending  Average. I totally loved it! 7/10 Very near to 8/10, but i expected (while watching) a little bit more."
    },
    {
      "rating": "8",
      "text": "This was surprisingly well made. It has a little bit of everything, humor, romance and even some suspense, but very little. It works out well not only for kids, but for adults as well, which has worked out like that since \"Toy Story 3\". Overall, it's extremely enjoyable."
    },
    {
      "rating": "9",
      "text": "I enjoyed this one more than I expected. The critics were overly harsh in their criticisms of the movie. The visuals were outstanding, and the plot while a little bit repetitive never got tired."
    },
    {
      "rating": "8",
      "text": "This a good movie overall. It shows how cavemen lived, in a funny, warmhearted way. I don't really care about the incorrect reference about how certain things were invented. The only thing I consider bad in this movie is that some of the jokes were overdone. But in the end, this is a really good movie. 8/10"
    },
    {
      "rating": "9",
      "text": "It's been a long time i haven't laugh as much. Moreover, each scene is more beautiful than the previous one. The 3d work is remarkable, nothing like the first 3d movies. just FUN"
    },
    {
      "rating": "8",
      "text": "This is a great family movie. I went with my little kid on her birthday and she loved it. On the way back she kept saying the lines over and over again. I highly recommend it for anyone looking for a family comedy without any drawbacks.\r I even hope they make croods 2 lol"
    }
  ],
  "recommendations": [
    "turbo",
    "bolt",
    "shaun_the_sheep_movie",
    "hotel_transylvania",
    "storks",
    "ice_age_the_meltdown",
    "rio_2",
    "the_lego_movie",
    "rise_of_the_guardians",
    "rango",
    "hotel_transylvania_2",
    "how_to_train_your_dragon_2",
    "rio",
    "meet_the_robinsons",
    "ice_age",
    "hotel_transylvania_3_summer_vacation",
    "the_good_dinosaur",
    "the_lego_movie_2_the_second_part",
    "paranorman",
    "cars",
    "incredibles_2",
    "ferdinand",
    "peter_rabbit",
    "my_little_pony_the_movie",
    "monster_house"
  ]
}