{
  "id": 3570,
  "title": "The Snowman",
  "starring": [
    "Michael Fassbender",
    "Rebecca Ferguson"
  ],
  "runtime": 119,
  "genre": [
    "Crime",
    "Thriller"
  ],
  "description": "Detective Harry Hole investigates the disappearance of a woman whose pink scarf is found wrapped around an ominous looking snowman.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mKsQ8KMOk0VBX26Ev0Lj6EmfGJu.jpg",
  "categories": {
    "plot": 3.7954545454545454,
    "acting": 3.68,
    "ending": 3.4444444444444446,
    "soundtrack": 1.5,
    "cinematography": 3.6,
    "familyFriendly": 2.0,
    "funny": 1.6666666666666667,
    "action": 2.5
  },
  "reviews": [
    {
      "rating": "6",
      "text": "This movie is not horrible.  It is a bit confusing though.  There are still some bits that were thrown in that didn’t seem to go anywhere or lead  anywhere.  It does get off to a slow start, I felt.  But, ultimately, it wasn’t a bad movie and certainly held my interest for the duration.  The plot may have come off better in the book (which I did not read) because it mostly seems implausible if tou put it all together."
    },
    {
      "rating": "6",
      "text": "Hollywood A-listers mixed with Sweden's finest in a dark, gritty and visually stunning thriller. A typical and predictable plot with a surprisingly minimalist Fassbender and a Ferguson that sticks out best. A slow-burner but never boring or generic. Still wastes its Hollywood potential."
    },
    {
      "rating": "5",
      "text": "I don't know if this is Michael Fassbender's first starring role or not, but one hopes he gets another crack at it because \"The Snowman\" has some flaws that haven't resulted in very many positive reviews.    First, the good news:    Fassbender is a very talented actor, and his portrayal as an alcoholic loser-detective is convincing and a departure from his usual bad guy roles.    Plus, it appears the movie was shot on location in beautiful Norway, or lots of it was, and the scenic interludes make me want to visit there, with soaring mountains, rugged fjords and beautiful cities like Oslo and Bergen.    On the other side of the coin, I am glad some reviewers pointed out some confusing plot lines because I felt like I had missed something along the way, and not being an idiot wondered if I just wasn't paying enough attention.    Plus, the mysterious \"Snowman\" killer was pretty easy to figure out.    What makes the movie come up short is the unnecessary baggage and a very vague connection for the murders, other than they are with one or two exceptions, women with kids.    There are a few details that I simply felt had little or anything to do with the overall story, or the film failed to adequately connect the dots, so to speak.    This was a missed opportunity that tried to be a chilling (no pun intended, well, yes it was) psycho thriller but just didn't quite pull it off.    Not terrible, but it could have been a masterpiece maybe in some other director's hands."
    },
    {
      "rating": "2",
      "text": "The film labours on without any tension or coherence. While the cinematography and cast are excellent, the plots and subplots lose momentum."
    },
    {
      "rating": "4",
      "text": "Tomas Alfredson directing, Michael Fassbender starring, a famous black novel was the source material, this movie was supposed to be huge, what the **** happened?"
    },
    {
      "rating": "3",
      "text": "The Snowman, despite having good cinematography and brilliant acting, is a mystery more confusing than interesting. The story, being adapted from the novel written by Jø Nesbo, is one that is good, but undermined by the film's lack of connection to the source material, and sloppy editing. The poor work done by those in charge of the writing of the script, and the putting together of the scenes renders any good portions of the movie useless."
    },
    {
      "rating": "3",
      "text": "The cinematography is fantastic, and that's about it. This movie was a slog from start to finish with merely buildup and no payoff, as well as sleazy acting throughout."
    },
    {
      "rating": "1",
      "text": "Tomas Alfredson your movie sucks, and you should feel bad having made it. Now I have seen some awful films this year from Hollywood sh*t smears the likes of Tom Cruise's The Mummy to the autobiographical nonsense of All Eyez On Me but there is a whole new level of incompetence within The Snowman. Part of me doesn't want to give this film the pleasure of calling it the worst film yet this year as I don't really want the people from this film to feel as though they achieved something by having made this shotty film.Acting in this film ranges from downright boring to borderline insanity. Now i have an ongoing theory that Michael Fassbender is playing himself in this film and not Harry Holt and the reason he got roped into this film was either as penance for Assassins's Creed or as a contractual obligation. Now Fassbender looks like crap in this film, half the time he looks like he is falling asleep and the other half of the film he is asleep from hitting the bottle or his pills. Halfway through the film I felt although I should be obligated to call a suicide hotline to make sure that Michael Fassbender is okay as the way that he moves around on screen screams 'I want it to end'. Val Kilmer also gives an unintentionally hilarious performance as a character whose name i cannot remember like 95% of the characters in this film. Nevertheless Val Kilmer I suppose preforms in this film, mabye? as a character who can barely utter a word as his teeth seem fused shut, drinks vodka out of a plastic drink bottle, and channels Billy Madison if he suffered a stroke and was clinicly depressed. It is honestly not worth mentioning any of the other performances in this film as surprisingly they only get worse.  The plot of this film is so truely special so much so it deserves it's own category, it is not quite special needs and yet is still far beyond a vegetative state. Bad acting, pacing, editing, soundtrack, and direction aside the plot of this film makes no conceivable sense and is just plain lazy, it is almost like they had part of an idea for the first and last 5 minutes of the film and then sat down and said 'f*ck it, we'll wing the rest'. For a film that is a crime thriller, there is very little going on, there is no collection of evidence or any sense of the case progressing, and for half the movie we're left following J.K. Simmons character who has no connection the killer and nothing to do with the plot in the slightest.  In summing up this movie has left me violently ill and i hope Tomas Alfredson reads this review to know that i am forwarding him the bill for my movie ticket, pain and suffering and ongoing psychiatric help. If you are mentally ill do not watch this movie, if you are not mentally ill do not watch this movie. I did not wish this film on the four other people who saw this film in a virtually empty theater and i do not wish this film on my worst enemy, In fact i personally advice not to watch this film at all."
    },
    {
      "rating": "7",
      "text": "Yes, this movie could have been better, but it is far from as bad as many critics said it was. Generally, I enjoyed the film, mainly for the excellent acting, but also for the twisty plot, and for the beautiful look of the film. True, I was forewarned by the critics and even the director, so I read a plot summary quite a few times, and also studied which actors played which roles (thank you the cast details, Metacritic!). I did not read the original book. Of course, I should not have had to do all this, but to be honest, I think it was worth it."
    },
    {
      "rating": "4",
      "text": "Hollywood strikes again and the outcome is rather disappointing. As a result, we get yet one more film with the linear-cliche concept: the \"good guy\" wins the \"bad guy\" and saves the weak and incapable characters.The movie modified even the books basic story at a maximum level for its needs, which is totally understandable to fit the needs of a film, but, this didn't go well with the movie's plot which is boring and predictable. At about 2/3 of the duration, we get a sudden speed up of the plot while since the beginning it was all about irrelevant events and persons taking screen time (Val Kilmer). Also leaving behind an extremely complex and unexplained plot. Character development is almost non existent despite strong appearances by the main actors (Fassbender,Ferguson). In most crime-detective movies, there is some way to show how the investigation progresses but here, the main character (Harry Hole) doesn't communicate with the viewer in any way nor shows the progress of his own investigation. We get long scenes of deep thought instead, that do not contribute communication. The ending is so changed that its almost another story, without any thrill or suspense, that doesn't in any way \"fill\" the viewer up as neither the \"villian\" is given enough time (for the viewer to have emotions) nor his motives are well explained. On the bright side the movie accomplishes good winter landscapes and a somewhat okay atmosphere but these traits along with the outstanding performances, can't save this mess.  4/10"
    },
    {
      "rating": "0",
      "text": "this film is basically a big mess. it's shot well, there's good performances, etc... except you never know or care what is going on. someone didn't connect the dots with this script or in the editing room. it's a shame because it looked and felt like it could have been more."
    },
    {
      "rating": "0",
      "text": "We all know those people who’ve read the book before the movie comes out. They sit there and critique every tiny little detail. “Oh the book did this and that and it was so much better, read the book everyone because the film doesn’t do it justice.” Well I’m going to turn into one of those people so brace yourselves. I’m a huge fan of Jo Nesbø, his books are in a league of their own. So naturally when I heard The Snowman was getting a movie adaptation I was delighted. Admittedly choosing the seventh book in the series to make into a film was strange but as it’s a hugely popular book I understand why they chose this one. I’ve been following it for years, looking at every set photo, poster, trailer and now on Friday October 13th 2017 it’s finally here. So Tomas Alfredson I’ve just got one question for you. Have you actually read The Snowman?I’m gutted, I wanted more than anything for this to pull itself together into a great crime/thriller but it’s worse than I could have imagined. Michael Fassbender as Detective Harry Hole, Rebecca Ferguson as Katrine Bratt, great casting, based on a terrific book so someone please tell me how The Snowman got it so wrong? Oslo’s greatest detective investigating the gruesome murders by a serial killer calling himself The Snowman. Vastly underdeveloped characters with little to no chemistry between any of them. They’re simply showing up, saying their lines and going home again. Oh but don’t worry there are lots of pretty scenic shots accompanied by some nice piano music shoved in your face every five minutes. All pieced together by an absolute sorry excuse for an editor. Was this even edited by anyone? It’s honestly hard to tell. The pacing is all over the place, any attempt at building the tension failed. The story moves at an unbearably slow pace eventually the challenge isn’t figuring out who the killer is. No it’s fighting off sleep.Who to blame for this? The writers? Director? All you had to do was follow the book, it was all there for you in black and white. Is it that hard? Seriously I want to know because it almost seems like you went out of your way to make this so bad. A poor imitation, a missed opportunity, a waste of time. A crime movie which certainly doesn’t deserve that title. No suspense, no atmosphere, nothing. I nearly fell asleep more than once so if you’re looking for something to watch over the weekend make sure to avoid The Snowman at all costs. I can’t think of a single thing I liked about it, beyond terrible so for that reason it deserves a 0/10."
    },
    {
      "rating": "4",
      "text": "Those expecting an American style stalker flick will find this art film approach lacking. Michael Fassbender plays a flawed Norwegian detective (is there any other kind these days?). He's on the case of a serial killer who builds the titular snow structures outside the homes of his victims. This is a stark Scandinavian production with subdued action and an even more restrained killer. While the cold gray cinematography is interesting and some of the landscapes are magnificent, Tomas Alfredson's reserved direction doesn't manage the disturbing vibe of his brilliant first film (\"Let the Right One In\"). Fassbinder is appropriately glum and the other performers do fine, but the monotonous pacing and muted direction result in a pretty chilly reception."
    },
    {
      "rating": "7",
      "text": "A good film.  Basically true to the book.  Difficult if not impossible to capture Nesbo's intricately layered plot in the time span of a film.  Great Norwegian scenes.  Good acting.  I liked it."
    },
    {
      "rating": "2",
      "text": "A movie that fails to receive any connection to the bestselling book that adapted this film ten years later, The Snowman hardly relates itself to the mystery genre that the bestselling book had. Newcomers would become heavily disappointed not to read the book first since this mess-holder will completely leave 100% of newcomers clueless on what the film attempts to follow."
    },
    {
      "rating": "7",
      "text": "Anyone confused by this film wasn't paying attention. The story was limited but far from incoherent. It could have been better but it's nowhere near the disaster critics would have you believe. The acting was exactly what you'd expect from the A-list cast and the cinematography was excellent."
    },
    {
      "rating": "7",
      "text": "No where near as bad as other films out right now like The Mountain Between Us which actually has a wrong title because the mountain brings the characters together....now that is bad when your title inaccurately describes the movie. This movie at least has a Snowman it in. The worst you can say is this movie is boring at times. Lovely winter scenery. Solid acting. A weird Val Kilmer sighting. Very weird. A predictable plot. Still if you like this genre then you will like this movie."
    },
    {
      "rating": "4",
      "text": "\"I know you want it, but you can't make the pieces fit\"...  Harry Hole's statement to his love-interest partner sums up the movie pretty well for me.  I love Nesbø's books, and I wanted very much to like this one, but it just didn't work.  The story is confusing, with unexplained leaps (and things that even after the end of the movie make little sense).  I think Fassbender makes (or would make) a decent Hole, and the scenery was satisfyingly bleak."
    },
    {
      "rating": "8",
      "text": "[Disclaimer: I am rating this movie without reading the book, or knowing anything about the original story. I am purely rating this for the movie and it's aspects which might be affected by me not knowing the 'original' plot] It felt like a depressive state, which is exactly the vibe the director was going for with the color pallet and the environmental feel, plus with his interesting choice of cinematography. The cast delivered great for me and really gave over the tension and emotion of the characters which can immerse the audience with this story. It has no pacing issue, on the contrary it takes things to fast for a non-familiar audience with the book. And the plot gets even more complex throughout the movie, which is good and enhances the thriller feeling of it. The non linear and non-chronological order of scenes gives every single detail almost at the right time, up until apex of the movie, after which pieces fall to it's place but most of them never do, with a bunch of plot holes that where pretty relevant but hard to notice. The visuals and even the sound effects where very realistic and gruesomely practical. It won me over with it's original story, and perhaps I will even pick up the book. Overall I consider this to be a very good movie, but solely a movie. I think that this is VERY underrated movie, and is only held back by the anticlimactic ending and lacking a proper conclusion to our protagonists life, and a few other small elements mentioned over my review. [Again, I rated the movie as it is and not compared it to the book.]"
    },
    {
      "rating": "4",
      "text": "Basically a snooze fest that is competently made and pretty well acted. The problem lies in a script that goes nowhere.  The characters seem to have little motivation and it comes across in a weak script. C-"
    },
    {
      "rating": "5",
      "text": "Unfortunately, such high-budget production did not convince me to this type of crime novels. The film is limping in many places, the story is bland and without surprising twists and turns, and the actors themselves did not show their best side, which is a pity because there was potential."
    },
    {
      "rating": "2",
      "text": "This movie stole 2 hours of my life. I hope the book is better, a lot better. Not sure if there is a single Norwegian person in this film. They should have completely re-adapted it and moved the setting to Canada. The winter sports world cup - who gives a crap. A super predicable, god-awful movie."
    },
    {
      "rating": "1",
      "text": "The Snowman could honestly be a contender for worst thriller of the year. It's dull, boring, confusingly plotted, drearily acted, lazily edited and poses more questions than it can ever be bothered to answer. Why are all the Norwegians in the film British? Why is it set in Oslo? Why does the killer use snowmen as a calling card? What is the purpose of J.K. Simmons character, other than to effectively walk on screen and pronounce, \"And I'm J.K. Simmons\"? Who are these women getting their pictures taken with a cameraphone? And finally, how could a film with such a strong ensemble cast and effective cinematography end up being such an unmitigated disaster? I know not one of the answers and, frankly, the time it took me to watch the film and write this review is about as much attention as I'm prepared to give this shoddy work. The most thrilling moment of the film was the end credits, as I could finally leave the cinema. Avoid like the plague."
    },
    {
      "rating": "3",
      "text": "ᴍɪꜱᴛᴇʀ ᴘᴏʟɪᴄᴇ. ʏᴏᴜ ᴄᴏᴜʟᴅ ʜᴀᴠᴇꜱᴀᴠᴇᴅ ʜᴇʀ. ɪ ɢᴀᴠᴇ ʏᴏᴜ ᴀʟʟᴛʜᴇ ᴄʟᴜᴇꜱ⛄️﻿\"The Snowman\" is the biggest disaster of a film in recent memory. With such a huge cast of great actors and a well experience director, who could've thought a movie would feel so incomplete and dull. The scenes where things are meant to be intense came off hilarious.When the Popcorn Song is the killers own theme tune song and he literally dances to it; are we suppose to be disturbed by this? What is up with the derpy face snowman the killer leave behind as calling cards. It looks so **** goofy and not intimidating in slightest. Who thought a drawing that a 4-year old would make would be a good for a murderer?Michael Fassbender and Rebecca Ferguson are decent, but we've seen better from them. Val Kilmer looks and sounds different, like his lines were dubbed over or something. JK Simmons literally has nothing to do with the main plot﻿. The rest are just an after thought.There's are bright spots within the snowy sh*t storm. The cinematography is gorgeous and you can see it being good movie if it was in the right hands. No bad performances from anyone.Still, Fassbender needs to get an new agent."
    },
    {
      "rating": "5",
      "text": "One of the year’s worst-reviewed big name project has arrived. It’s another Scandinavian murder thriller – to sate the demand the producers hope exists.Starring Michael Fassbender as famous but alcoholic Oslo cop – sorry, elite squad’s lead detective – out to catch an elusive serial killer.If you like the „Millennium“ series, be warned: no strong female characters here. It’s all about watching the sweet but curiously expressionless face of Fassender dragging himself through mounds of snow to try and stop the killings.The critics seem to not like the poor \"Snowman\" at all: 8/100 at Rotten Tomatoes, 23/100 at Metacritic. Users are comparably cold: 22/100 and 2.3/10, respectively. Don’t worry, the movie’s not actually that bad. It’s just not a gripping one.The story unfolding on the screen is so pedestrian and lifeless that you have to be a fan of the genre, or Fassbender, to get some joy out of this.The makers can’t hold the suspense even though there are always new murders to fall back on. Actors can make the story watchable but the result fails to ignite. I can’t even think of anything interesting to say about this.The teenagers in the cinema, or the majority of the audience, seemed to like it though. I heard them discussing the most blood-curdling scenes later. It is true that the movie offers some not-PG-friendly blood and violence.The impressive cast includes Charlotte Gainsbourg, Chloë Sevigny, Rebecca Ferguson, Jonas Karlsson, J.K. Simmons, Val Kilmer, Toby Jones, David Dencik, James D'Arcy, Jamie Clayton, Michael Yates, Ronan Vibert, Adrian Dunbar. If only they had something interesting to do … Kilmer at least looks interesting, like he escaped from botox clinic after series of unsuccessful experiments.Based on a novel by Norwegian crime-writer Jo Nesbø. It is the seventh entry in detective Harry Hole series, and the first one made into a movie.Director Tomas Alfredson has said that the production of \"The Snowman \" was rushed. He joined it late and reckons that up to 15% of the screenplay was not filmed. In addition, the location filming in Norway was shortened so that the production could move to London, which compromised story. So now we know."
    },
    {
      "rating": "3",
      "text": "I don't know what was scarier: seeing Jo Nesbo's thrilling Norwegian detective noir get shredded into an baffling incoherent mess or Val Kilmer's sagging face and his jarring ADR'd voice.I'm not a book purist in the least, but this movie takes what was overall a pretty straightforward mystery tale and changes so much to the point that the story's connective tissue was completely eliminated.It also didn't help that given the tight shooting schedule, supposedly a good 15% of the script was never shot and boy does it really show. Characters and story threads are brought up and dropped with little to no explanation.What was the whole point of the Gert Rafto, Rakel Fauke and Arve Stop plot-line? As far as the movie is concerned, I don't know?The movie couldn't even nail down the Harry Hole character. Michael Fassbender tries his best, but despite Hole supposedly being a \"great detective\", he barely does any throughout.Heck, Rakel Fauke does most of the detective work here!!So much of what happens in this movie turns out to be completely meaningless once this mess reaches it's lame, stupid, and rushed conclusion. Seriously....the move not only rushes the pay-off but it just cuts off!!There are some gorgeous snow landscape and the music by Marco Beltrami should have been in a better movie.Outside of those things however, this was just a waste of such a prestigious cast and crew."
    },
    {
      "rating": "4",
      "text": "Slow movie - attempts to build characters and plot but fails as I became so bored I closed my eyes for a few moments.  Nice twist in plot that finishes the movie as one would expect."
    },
    {
      "rating": "2",
      "text": "This film is literally unfinished. According to the director, about 15% of the screenplay was not filmed, and it shows. The editors probably tried their best to turn this into a coherent film, but they definitely did not succeed. This is one of the worst edited movies I've seen.I will say this however, this movie can be really **** funny. There were so many scenes where I was laughing my ass off.When Harry Hole (yes, that's his name) sees the shape of a snowman drawn on the car roof, the completely random uses of Popcorn Song, when the camera moves around that random snowman to reveal that it's actually a \"scary\" snowman... comedy **** gold!In that sense, I really enjoyed this terrible, awful, really not good movie."
    },
    {
      "rating": "1",
      "text": "A dire film from very early on. Why are all these Norwegians talking in posh British accents??"
    },
    {
      "rating": "3",
      "text": "Talk about a complete, choppy mess. The Snowman was a film I have always been curious about ever since its initial release, mostly due to how infamous it was and how even the director of the film commented on its incomplete nature. After giving it a watch myself, I can completely agree. This movie had lots of potential, but it is ultimately wasted by a plodding narrative, botched editing, characters and story arcs that end up amounting to nothing. The basic premise is that there’s a serial killer who goes after women, specifically women with marital issues and children, and the killer always builds a snowman near the scene of the crime acting like a calling card. Washed up detective Harry Hole (HA!) and his new partner Katrine are set to investigate these murders and catch the killer. To get at least a few positives out of the way, the casting is rather notable, and for the most part they do alright with the material given to them. There are even some moments of really great cinematography, with beautifully shot landscapes and lighting. Unfortunately, that’s where my positives end for the film, because Jesus Christ this movie is a mess. First off, the cinematography may be solid, but the editing is awful. Right from the start, the editing is incredibly choppy, with no sense of pacing. It’s an issue that is prevalent throughout much of the film, whether it be a basic passage of time or a chopped up flashback sequence. I would also like to give special mention to Val Kilmer’s inclusion in this film. He was sick around this time, and thus they had to ADR over his lines, and man does it look bad. The way the dialogue is being spoken not only doesn’t match Kilmer’s physical acting, but it also doesn’t sync well with his mouth movements. He doesn’t appear very long in the movie and just ultimately feels wasted. By far, though, the biggest problem with this film is its story and structure. It’s no secret that about 15% of the script wasn’t even filmed, and it shows.  Most of the characters get very little development, plot points that seem like they are about to go somewhere have little to no resolution, and the movie itself ends in such and anti-climactic way that you are just left feeling unfulfilled and baffled by what you just watched. What could have been doesn’t change the fact that what we were given was such a mess, and I’d almost recommend the film for that alone. If you were looking for a far more affective thriller, just go watch something like Zodiac."
    }
  ]
}