{
  "id": 4296,
  "title": "The Giver",
  "starring": [
    "Brenton Thwaites",
    "Odeya Rush"
  ],
  "runtime": 97,
  "genre": [
    "Drama",
    "Science Fiction"
  ],
  "description": "In a seemingly perfect community, without war, pain, suffering, differences or choice, a young boy is chosen to learn from an elderly man about the true pain and pleasure of the \"real\" world.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ckchcez2u40myIAgkfdVyzofX2T.jpg",
  "categories": {
    "plot": 5.529411764705882,
    "acting": 5.582089552238806,
    "ending": 5.066666666666666,
    "soundtrack": 6.0,
    "cinematography": 4.857142857142857,
    "familyFriendly": 4.857142857142857,
    "funny": 8.0,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "7",
      "text": "It's a sweet little story.\r Of course, a society that dulls its feelings with emotion dampening drugs and a government that wishes to control how we live and who we love is too far fetched to be believed.\r This is worth a watch on a lazy Sunday afternoon."
    },
    {
      "rating": "0",
      "text": "Do Yourself A Big Favor! Listen to the Audiobook Read By Ron Rifkin, Instead!\r\"A\" for effort! \"F\" for outcome! Wow! What a huge disappointment. The story I heard on audiobook was gut-wrenching and incredibly powerful. The film, on the other hand, had so many goofy plot holes you could drive a tractor trailer through them! I realize this is not an easy story to adapt to the screen; but then don't do it if ya can't do it right!\r What a waste of acting talent! Yikes! Jeff Bridges and Meryl Streep did their heroic best. But it just didn't come together! This is the kind of story that would be better done by less well known actors because I can only imagine how much pressure must have been put on the producer and director to dumb down the story to make it commercially viable. Lets face it, sometimes art and and capitalism simply don't mix!\r The philosophy behind The Giver reminds me of a famous dictum by none other than Buddha himself. To summarize: Avoid all extremes. Life is neither black or white, but an endless variety of other colors. Don't become evil - or do evil - to prevent evil. Find the middle way. The world of the Giver is about living life grossly out of balance. Something most societies in the world - including our own - are doing right now!"
    },
    {
      "rating": "7",
      "text": "A good film but a lot like the also recent science fiction movie Divergent. Hollywood ripping of Hollywood? Who would think it-that would be-just crazy. Well, for what its worth this one might be the better film but since it so derivative it can't really be called original. \"So what\" I take it is the order of the day regarding hijacking someone else's movie idea in todays filmmaking world. Not that it matters much. It would just be nice if people were a bit less relying on others work in order to make a product that puts bums on seats. A trick to get people i the theatre (the promise of something neat and original)  fails in the long run. On the good side of it the work is crisp and even a bit visionary-like the early science fiction novels of the 1950's. I didn't notice if it was based on any old science fiction but it remind me of a whole bunch of things. Anyway-its a safe movie in that the violence isn't visceral (gory) and there ain't no bad words in it. Go see it. What the hey."
    },
    {
      "rating": "5",
      "text": "The adaptation of yet another YA bestseller is set in a gray world of bland conformity and strict regulations. A young man (Brenton Thwaites) is assigned to receive history's memories, which changes his outlook on life. The whole things starts promisingly, as the time and place is created with cool visual elements. Only during the final act does it slow to a maudlin message movie. Meryl Streep and Jeff Bridges add some heft (Taylor Swift is unrecognizable in her role), but the film still lacks any tension or emotional payoff."
    },
    {
      "rating": "4",
      "text": "Hopefully the book “The Giver” by Lois Lowry, which the movie is based on, gives a lot more answers to what happened and what will happen then the screenplay by Michael Mitnick and Robert B. Weide lets you in on. The movie pulled me in and then left me hanging but not enough to want to read the book to see if the answers are there.\r The film opens in a black and white world filled with people who are injected every day with medicine to not feel anything, to be alike and whose words are devoid of feelings. We meet Jonas, played by Brenton Thwaites, and his two friends Asher, played by Cameron Monaghan, and Fiona, played by Odeya Rush, who are graduating and will be given their appointed life roles. Asher will be a drone pilot, Fiona a nurturer of babies until they are sent to the families they will be raised by and Jonas is given the role of receiver, to be given all the memories of the world’s past including negative and positive feelings.\r Jonas will be given all the knowledge that the Receiver of Memory, who is the title role played by Jeff Bridges, has of the past regarding feelings and the more memories he is given the more color enters Jonas’s world. In other major roles Meryl Streep as the community’s Chief Elder who, more or less, decides who will do what when, Alexander Skarsgard and Kate Holmes as Jonas’s parents and Emma Tremblay as his sister.\r As a film dealing with feelings/emotions and what a loss life is without them the director Phillip Noyce doesn’t bring any feelings or human emotions to the film version of “The Giver”. He delivers with the Sci-fi but not the drama."
    },
    {
      "rating": "6",
      "text": "The Giver could have been one of the best movies of the year with it's deep, emotional and unique human story, but a underdeveloped film that incorporated a rushed ending, made that story feel worthless."
    },
    {
      "rating": "4",
      "text": "Its just not good. Most people where forced to read the book in middle school, and well, most people try to forget those years. Not exactly sure who they where trying to sell this movie to. I mean, no kids will want to watch it because...well...\rSchools can't show it because its PG-13\rAnd adults just don't care.\rIts just not worth seeing. The book managed because it was interesting and had some extreme symbolism. This one just fails because its using outdated material"
    },
    {
      "rating": "7",
      "text": "This move was visually stunning, and it did a great job with retaining the plot events, dialogues, and symbols of the novel, which is much more than most film adaptations can say. Most of the reviews I have read are from those who have not read the book, who are complaining about the unanswered ending. Lois Lowry purposely made the ending ambiguous, you cannot blame the movie for that (and there shouldn't even be any blame; ambiguous endings give the readers/viewers power to interpret and analyze for themselves). There were a few minor details removed from the movie, but I believe that they were left out to be able to be appropriate for younger audiences while maintaining the more mature audience who may have read the book. An example of this is the neglect of the \"Stirrings\" that Jonas experiences, which is replaced with a brief dream of Jonas kissing Fiona. An important detail left out was the House of the Old.\rSome theatrical criticisms I have include the fact that the beginning of the movie was rushed, the unnecessary occurrences where the camera is blurred and feels like it has a low fps, and the moments of noticeably off acting on the part of... Jonas. In some instances, I felt that I was watching a generic young adult film adaptation (cough... Hunger Games, Divergent.... cough). Mostly, however, the actors did a great job considering the existential morals they had to convey.\rOverall, I do recommend this movie. If you have read the book like me, then you might have a similar opinion about the movie. If not, you'll either love it or think it's okay (because you don't understand the ending, or other details)."
    },
    {
      "rating": "10",
      "text": "This movie is very thought provoking. I never read the book but I will now. Considering all the awful things that are going on in the world at the moment, terrorists, riots, we know they are caused by feelings and passions. This movie shows how feelings and passions make our world awful, but it also shows how feelings and passions are positive and that we shouldn't repress them. If only the world can figure out the right balance to make feelings and passion work in a positive manner."
    },
    {
      "rating": "10",
      "text": "Great movie with a profound message and tremendous acting. As a viewer, you cannot help but feel how dangerously close our society today is portrayed in this film. I've not read the books, but after watching this I will be soon.."
    },
    {
      "rating": "7",
      "text": "The Giver is visually arresting, well made and acted. Yes, I've read the book by Lois Lowry. Is it same as the book? No. Director Philip Noyce directs this film about Jonas, who gets recruited for a special job, receiver of memories, where his mentor The Giver tells him secrets of the past that have been hidden all these years. Love, Color, Happiness, Hunger, Birth. Those are the things that The Community doesn't have. It's a diffrent world from ours, and yes, it's pretty sci-fi. Newcomer Brendon Thwaits does a good job of acting as Jonas, he was smart and energetic. Jeff Bridges is good as the Giver and Meyrl Streep is okay as the community elder, the woman who thinks if people choose, they will choose wrong. The story is not totally the same. Some honest changes were made. The film is slow and drags a bit at the climax. But if you don't mind a good movie that treats its subject matter well. Watch, The Giver."
    },
    {
      "rating": "10",
      "text": "I was and still am a big fan of the 1993 Lois Lowry, it was a spectacular book that had a so-so cliffhanger ending that didn't answer any questions that the reader was left with. I will start my review at the ending because it goes beyond what the book did and gives the audience hope for the future of these characters and I liked that. People are complaining that questions are still left unanswered, I hate when people complain about these things because I feel that there some things that should be left to interpretation and that the filmmakers shouldn't have to spoon feed everything to the audience. The acting is amazing especially Jeff Bridges, you could tell that he had a lot of passion behind this project. This movie also has easily some of the most amazing visuals that are a true treat for the eyes. I loved how this movie handles its dense themes and made them worth while and interesting. Quite possibly the best thing about this movie is the way it handled the source materiel, it took some liberties and removed or altered the things that didn't work and preserved the things that were excellent about the book. This is a rare score that I give this many 10's but this is the 4th 10 of the year (alongside X-Men: Days of Future Past, Under the Skin and Chef). I highly recommend checking this movie out if you can.\r Score: 10 out of 10\rRated PG-13, 100 min. The Weinstein Company"
    },
    {
      "rating": "0",
      "text": "WOW, what a terrible adaptation. If you like slow moving storylines, unanswered questions and just plain boredom, this movie is for you!\r Another poor attempt of taking a popular book and trying to interperet it into film.\r Most of the positive reviews of this film are from people who just geeked out over the book. While the book was great, this film was not.\r The young lady (teenager?) who sat next to us actually brought a copy of her book along. She was snoring 40 minutes into the film.\r Truly awful. If you have nothing better to do with your $20 bill, go see another movie."
    },
    {
      "rating": "3",
      "text": "The Giver took nearly 20 years to make! I was expecting a deep, emotional and unique human story. However, the movie is underdeveloped, rushed and dull. The performances don't make up to the one most major disappointment of the year."
    },
    {
      "rating": "7",
      "text": "I felt the movie was another one of those adaptations that did well, with a few honest cinematic elements and changes. In addition, it can provide enough entertainment to spark interest in the book. Great acting by star actors and actresses, with even a brief cameo by Taylor Swift (exceptional brief performance). However, the film's book, The Giver by Lowry would have made it difficult to come up with an intense climax as the studio's trailers made it seem. Having read the book, it was surprising how intense they were making it look. This gives the viewer a slight underwhelming feeling by the end of the movie.\r The Giver is not by any means a must-have for your collection. It is, after all, a Young Adult Novel adaptation. And the genre's history, as we've seen, has created few must-haves. It is an average film, that's certain to entertain, but you shouldn't expect mind-blowing."
    },
    {
      "rating": "8",
      "text": "It may lack some of the impact the book has, but ultimately this adaptation is stunning, beautiful, emotional, and will resonate with just about anyone. This is much deeper and meaningful than any other YA film you will ever see."
    },
    {
      "rating": "10",
      "text": "The Giver is by far one of the best films of the year.  It's visually stunning and a very interesting blend of science fiction and social drama.  Because it is so unique, it will not be to everyone liking, hence the less than glowing reviews.  It certainly skews toward a more thinking person's palate... not your typical over-the-top special effects extravaganza.  In time, this film will most definitely end up being regarded as one of the best."
    },
    {
      "rating": "1",
      "text": "The creator of the classic book for which this movie was based had one request. \"Please don't turn this into a teen romance.\"\r She  was right. The turned a provocative, interesting, albeit flawed book into a horrendous mess. It doesn't know what it wants to be, what it's trying to do, or anything else for that matter. Aweful, aweful movie."
    },
    {
      "rating": "0",
      "text": "Let me start out, Yes, I have read book, and yes I Loved the book. I think it one of the best book I've ever read. I've was excited when the movie was Announced. Then the trailer... I got nervous. Very nervous. But I was still excited. So months pasted by and I forgot about the movie until July. Then the movie came out at No.5 at the Box Office. Boys, We have a Bomb at our hands. So today, My sister decided to buy my ticket for this movie for my Birthday. After the first 10 min of this movie. I knew it was bad.\r The Story: If you read the book. You still don't know the story, According to the writers.\r The Acting: Okay... At times. Now that I think about it, it bad. Taylor Swift has 15 seconds of screen time. Even though she has 3 billing in the cast list.\r The Additional's: This category is about any of the Additions added into the movie. They forced a love triangle. The love story was so forced. It laughable how cheesy it was. I can explain it in two word: Completely Unncessary\r The Ending: They change the ending a lot. Now instead of having it end on a cliffhanger. That to complicated* for us. *=Sarcasm. Now they end with Jonas passing the Barrier of Memory. Now everyone in the \"Community's\" have memories. Nice job Phillip Noyce. You buttered the best ending to book, ever.\r Overall: I despise this movie. I hate it. 0/10"
    },
    {
      "rating": "1",
      "text": "You think, how bad can it be with Jeff Bridges and Streep? It is dumbfoundingly trite, stupid and boring, actually. I haven't read the book, but my son the college English major said that it, too, sucked.  Sounds about right, since it would have been hard to make a movie this bad from a book that had any merit. I am encouraged, however, to see that so many others who have posted here apparently disliked the film. I'd have thought the under-30 crowd that writes most of the user reviews at Metacritic would have thought 'The Giver' profound.  I won't bore you by arguing my case, since addressing the myriad flaws and weaknesses in this film would be like critiquing the paintings of Walter Keane, or Muzak. Trust me, it stinks."
    },
    {
      "rating": "10",
      "text": "My advice? Do not listen to anyone that doesn't like this movie. They probably think The Hunger games is the most brilliant movie series of all time. This film is absolutely brilliant, and takes you on a thrill ride. It's visually beautiful, and really let's you feel the emotions Brenton Thwaites character experiences the more he learns about the past world."
    },
    {
      "rating": "10",
      "text": "Beautiful and emotional movie, capturing the importance of friendship, trust, freedom, and love. It stresses the importance of having memories, having emotions, having decisions of your own."
    },
    {
      "rating": "8",
      "text": "The Giver has a touching story, amazing actors and awesome scenes, the movie is good altogether, but sometimes it starts to get boring, and there are some parts in the plot that stay empty... but despite this is a great movie."
    },
    {
      "rating": "0",
      "text": "So many bad movies so far in 2014 and this tops the worst of the worst. People who gave this movie more than a zero must have been watching a video on youtube and drunk while on crack. Sorry if I offended anyone but it is what it is. Did not care about any of the actors. I did not say I do not like any of the actors. I do like the main actors but they all sucked except  Jeff Bridges. What the hell were they thinking when they said yes to act in this movie. I know, take a guess. Main actors were hard up for money. MY RATING: -20. Yes minus 20. Trust me, do not support this movie by going to the theater. They do not need credit for taking a roll in this mess of a movie. Watch it on TV for free. It will be there very soon. This will take a toll on the main actors for taking part in this stupid flick."
    },
    {
      "rating": "5",
      "text": "The Giver is a film that for a good two-thirds showed a lot of promise being a faithful adaptation to the book by presenting scenes faithfully, good casting and good performances, and giving some nice visuals. Unfortunately, the film stumbles towards the third act. At first the film only occasionally touched on how bad the dystopia was but towards the end it hammers you over the head with it. It turns into a straight up good vs. evil story and is generic and cliché as possible. Once again Hollywood has taken a story that is unique and wonderful and skinned it into something bland and generic. As much as I love seeing awesome books made into movies I want to see it done well and not try to cater to the masses. This film based on a book about dystopian society feels very much like it was trying to capitalize on people’s love the Hunger Games, which also deals with rising up. I only hope that people are reading the books these films are based on as opposed to the mainstreamed versions we get now. Had the film just stuck closer to the story like it was doing pretty well in the first half or so this would have been a really nice film but because it turned into generic good vs. evil and fighting against dystopian society the film lost that special something that made the book so memorable and unique. Which is why I am forced to “Give” this movie a 5.5. Could’ve been a 7/10 but you just had to cater to the masses. I’m not too excited about Mockingjay: Part I but its starting to look really promising right about now."
    },
    {
      "rating": "5",
      "text": "Decent film based on a young adult book you most likely read in middle school.\rPortrayed well by main character and female friend. Bridges and Streep had small supporting roles, as did Holmes and Skargard.\rMessage here is to take risks and do the right thing - even if it's against the rules (and you knowing the right thing is not always easy or well-known).\rIn summary, if you like the book, you might like this movie. II thought it was accurate and well done. Rent if you need to see it, although most book lovers might want to buy it."
    },
    {
      "rating": "6",
      "text": "Whether or not your a person that always says, \"the book was better\", book to movie adaptations will just keep coming and coming, and most of them will probably not be truly amazing. I found The Giver to be better than the average book to movie adaptation, if not a little familiar. However, this film has some special things going for it that I just don't see very often in movies these days. While I won't spoil it here, the story of this film cleverly utilizes a black and white design on the screen (does not go on the whole film, though). What could have been highly annoying and ugly actually turned out to be very unique and refreshing. The characters in this movie are pretty darn good. Your 2 main stars here are Brenton Thwaites and Jeff Bridges. They are both awesome. Plus, Meryl Streep knocks it out of the park. Odeya Rush was suprisingly very good. Everybody else was basic. The story here is definitely nothing groundbreaking, but it still offers enjoyment. Jonas is chosen to be the one who works with the Giver, and the Giver goes on to share memories of the past world that is now behind them. Watching Jonas' journey as a character finding out all of the beautiful stuff the past world had was thoroughly entertaining. This movie also has some really great lessons behind it that left me still sitting in my seat for a few minutes after the movie was over. However, a lot of the stuff in this movie can just be average, such as the writing. Plus, I felt the story could've used a tad bit more energy in some parts. I didn't walk out the theatre amazed, but I really did appreciate the lessons behind it and Jeff Bridges, Brenton Thwaites, Odeya Rush, and Meryl Streep."
    },
    {
      "rating": "6",
      "text": "Even though the young adult dystopian adventure genre has been somewhat overworked in recent years, \"The Giver\" does a respectable job of delivering the goods. Despite its occasional tendencies to drag some things out and underexplain others, it nevertheless serves up a thought-provoking story with capable performances and inventive cinematography."
    },
    {
      "rating": "10",
      "text": "Blew me away. Was an excellent movie to watch with my wife and daughter. One of those bonding movies that reminds you to take the bad with the good, and to use both to learn and love more. I am grateful to the directors for compressing these complex ideas into such a concise and well crafted narrative."
    },
    {
      "rating": "10",
      "text": "I remember when I saw this movie. It was amazing. I had never really read the book before, but as soon as I got home from the movie, I looked for the book and started reading it. Both the book and movie are amazing. Wow. The actors did a great job, especially whoever played the Chief Elder. :D\r-Cloudstar"
    },
    {
      "rating": "8",
      "text": "I usually don't love dystopia type movies or books but this was one we had to read in school when I was younger and I enjoyed the book then and I enjoyed the movie now. I thought it was pretty well done. Nothing in the story is necessarily new or unexpected but I enjoyed it."
    },
    {
      "rating": "4",
      "text": "If you've seen any movie based off of a YA book you've basically seen this one. It's the same premise as Divergent, the same futuristic society where individuality is non-existant, and the same characters these types of films are known for. The only difference is that it's missing any sort of emotion and according to many a lot of what made the book special.\r I can't fault it for feeling like so many other movies of a similar nature. After all the book it's based off of beat so many others like Divergent, Hunger Games, and Maze Runner to the market, so technically they are the rip-offs. However what I can and do fault the movie for is just not being all that interesting.\r Outside of Bridges and Streep the characters and performances are flat. The world is uninteresting and failed to evoke any emotion from me. I have to admit watching color come to the black and white world was pretty cool, but that's the only thing I found really exciting or unique.\r Unlike the book this movie came out too late and feels like another face in the crowd of YA books turned movies. Even worse is that it's a face with nothing interesting to say about themes that so many moviegoers have already experienced lately. It feels like a cheap cash in.\r There is an audience out there who will eat this up. After all these young adult novels are still getting turned into movies (not a bad thing imo). However people should consider that there are better alternatives out there in this growing genre of movies. This one just doesn't have enough style, emotion, or creativity to make it worth a recommendation in my eyes.\r My total score for the movie is a 4.5/10."
    },
    {
      "rating": "10",
      "text": "It was the Nebula award winning novel that took the science fiction world by storm. Almost immediately after it's release, talk of turning The Giver into a feature film began, but turning a complex science fiction story into something general audiences could enjoy was a big issue. Studio, cast delays, and re-writes held the film up for more than a decade, but in 2014 it was released and it is spectacular! In the not so distant future, on top of a mountain, lays a futurist society in which pain, war, and disease has been eliminated at a huge cost. With all that society has gained, it has lost the ability to exercise individuality and free thought, this effects everyone except for one, The Giver. The Giver is the historian, who keeps the memory of what life used to be like, so that society never forgets that what it's gained far outweighs the cost. The Giver however is old and must train a replacement. At the choosing ceremony, a young teenager named Jonas (Brenton Thwaites) is chosen. Once Jonas learns the truth, he must decide to do the job of The Giver or reveal the truth, in the hopes of bringing back individuality, but at what cost? Originally producers wanted Lloyd Bridges to play the Giver, when he passed, his son took on the role, and while he doesn't fit the mold of an elder statesman, he was still amazing. Meryl Streep also partakes in this magical film, playing the settlements leader, and she is every bit as chilling and suspenseful as the character in the book. At this point, I'm really convinced that there isn't a role she can't play successfully. Even with all the star power, far an away the best performance in this film is given by Brenton Thwaites, a British actor I'd never seen before. Aside from his tremendous good looks, Thwaites portrayal of a teenager with the fate of the world on his shoulders is better than even that of Jennifer Lawrence in The Hunger Games. The passion and charisma he portrays was absolutely infectious and helped carry the film through even the slowest parts. The Bottom Line, the book is a Sci-Fi lovers dream, while the movie is a lot different in order to attract a more mainstream audience, the power and genius of the story remains, and for that The Giver joins our list of must see movies!"
    },
    {
      "rating": "3",
      "text": "One look at the trailer and I knew this movie was going to be bad. It was poorly adapted for the screen not just in the screenplay but in tone. Sub-par acting did not help. It was mostly just boring."
    },
    {
      "rating": "3",
      "text": "It seems Hollywood has this factory in which it manufactures a variety of products. From bad by-committee scripts, unholy editing mishmashes at the behest of studios when a director gets too auteur for their liking, and of course their most rewarding product line: bland 20-something actors for young adult movies. Brenton Thwaites and Odeya Rush have to be the most bland of them all with both entirely lacking any semblance of acting ability, yet they look young and the teen target audience will find them mildly attractive. Thwaites is so bland, in fact, that I did not remember I saw him in Gods of Egypt where he was practically the lead. Now that is bland. He is a cardboard cut out of a young adult actor and Rush is hardly much better. The Giver also has a rare bad performance from Meryl Streep alongside a good one from Jeff Bridges, who constantly seems shocked by how bad the movie around him is turning out to be. You can practically see Bridges trying to remember how big the paycheck was for this one and trying to ascertain whether it was worth it or not in the end.Surrounding these unfortunate actors is the plot of The Giver, which is actually quite compelling when considering just the premise. Set in a world where all emotion, feeling, memory, and color has been erased, the world is divided into communities watched over the elders, namely Chief Elder (Streep). At various stages of life, there are ceremonies. When one is given to their family, when they are nine years old, when they graduate from school and are given their job, and when they are released to elsewhere. At the graduation ceremony, Jonas (Thwaites) is skipped over and called last, as he is to become the new Receiver of Memory. He is the only one allowed to feel, have emotions, and learn about the past and what the world used to be and he must learn from The Giver (Jeff Bridges), who is the current receiver of memory. Yet, armed with his knowledge about how they \"release\" aka kill the elderly and babies, as well as his love of Fiona (Rush), Jonas wants to save the world and give everybody what the Elders had taken away many years ago.Yet, how the film approaches this is quite heavy-handed. Acting all knowing, the film shows how with hate and war, which are bad and why feeling was stamped out, also comes love. And love is worth everything. While this may be true to some degree, it simply sounds preachy and then the film further digs its grave by including obnoxious montages where it celebrates life and shows the beauty of the world. It practically plays like an advertisement for life where the film constantly preaches about the power of love and how it outweighs hate in the world. Again, maybe true, but The Giver always comes off as pretending to know everything about the world and having to teach the viewer about what it all means. While it has a compelling premise, it panders too heavily to the young adult audience in this regard with an over-the-top demonstration of love and how it can solve all things. It is too naive and romanticized to really work and not come off as pandering, ham-fisted, and coming from a place of great superiority.This same appeal to young adults is found in the \"transformational\" and \"eye opening\"  romance between two bland leads that lack chemistry or any character development whatsoever. Instead, they are just young adult romantic stock characters that have this unspoken passion for one another even when neither are actually able to feel anything. They lack any definition and instead are written to have the other complete their worlds. In many respects, they are Manic Pixie Dream Boy/Girl's for one another and act entirely selflessly to advance the other, but ironically, when two Manic Pixie Dream Boy/Girl's meet, nobody advances. These are thinly written characters to the point that they are practically invisible. Every action is for plot convenience and the acting hardly breathes life into these stock characters found in The Giver.For a film with such a compelling premise, it winds up being largely quite tame. With bad characters, a bad romance, bad acting, and a heavy handed and naive take on life and love, The Giver winds up piling up weaknesses that sinks its ship. Yet, these are mostly quite passive. None of these bad elements are absolutely abhorrent and the film never winds up battling between being bad and dreadful. Instead, it just toes the line and is entirely passively bad, going down with nary a whimper. It is a film that is content to appeal to its target demographic, present hollow and naive ideas that appear thoughtful and appeal to the minds of teenagers, and then toss out some bland young actors that also appeal to that demographic. It is a film that is defined by just how below average it is and how safe it plays everything. It is this paleness that relegates The Giver to being so average and safe that it is bad."
    },
    {
      "rating": "8",
      "text": "Illuminati movie!!!\r There is lots of  triangles symbols and the situation remember the Georgia Guidestones:\r - Maintain humanity under 500,000,000 in perpetual balance with nature.\r- Guide reproduction wisely\r- Unite humanity with a living new language.\r- Rule passion — faith — tradition — and all things with tempered reason.\r- Balance personal rights with social duties.\r- Be not a cancer on the earth — Leave room for nature — Leave room for nature.\r only equality was not which makes it seem a mix of communism with illuminati."
    },
    {
      "rating": "3",
      "text": "The problem with 'The Giver' is that despite a concept of enticing possibilities, it just never gets going to make one sufficiently interested. I would go as far as to say that the conclusion is far better than the build up which is flat and ponderous offering little to make one care about proceedings.\rTwo major stars have, for some obscure reason, decided that their film outing this year is going to be in a big dumb popcorn movie. Well, it's certainly dumb but the quality (and even the disappointing setting) is anything but big. Jeff Bridges spends the entire film with a look of angst plastered on his face, and Meryl Streep, in an unflattering wig, once again proves that she is a compelling force despite bad material.\rThe special effects have a cut price feel to them and the only real show of imagination thrown up is to have the film slowly transcend from black and white to colour as the young lead protagonist expands his knowledge. Finally, the images used to represent past memories, obviously taken from stock footage, are not only unexceptionally bad choices, but also of rather poor quality."
    },
    {
      "rating": "4",
      "text": "Turning a classic and profound novel like The Giver into a potentially commercially successful and teen-friendly film that still values artistic integrity and self-awareness is already a major challenge. It's made harder when the screenplay is limiting in its breadth of thought and poorly spaced out, resulting in a crunched and insignificant final third. It's made even harder when the directing is clumsy and the ultimate image of the film never seems definitive. Despite several glimpses of beauty and talent (and less heavy-handedness than most teen-friendly novel adaptations), The Giver never manages to fly far after its takeoff, eventually descending back down to the plane of not-so-memorable young adult movies."
    },
    {
      "rating": "6",
      "text": "I loved reading the book in high school, college and after college. However, this is not the film that this novel was meant for. I can't believe I will write this, but I wish Aaron Sorkin wrote the screenplay. This is a very philosophical, and propagandist material and Sorkin's preaching from the pulpit of high-minded idealism approach to all of his work would work wonders.\r The early parts of the film were a very close adaptation of the film, and was the peak of its engagement with its audience. The graduation ceremony was perfect; it was flashy, current and a spectacle. After that, it slowly descends into hollywood tropes and lazy retrofitting for a modern audience.\r All of the scenes with Jonas and the Giver were wonderfully adapted. Jeff Bridges was more than adequate as the Giver. Meryl Streep's character was very strange. She was created to add conflict, which is understandable. However, in the context of the film's universe, she is a paradox. She has as much knowledge as the receiver of memories and she has emotions. That's a big plot hole and a mistake. Asher, Jonas' friend lied to an elder. Another plot hole and mistake. The sameness applies to all members of the community. In trying to make the film more appealing to action-adventure crowds, it has really destroyed the character of the source material.\r I wish it were written better. Everything about this film was excellent, apart from the screenplay."
    },
    {
      "rating": "8",
      "text": "\"The Giver\" seems like \"Divergent\" meets \"The Village\". This has heavy material, philosophic, and unique picture. This is more simple and less boring than Divergent, despite both of it has thought-provoking ideas. I think I'm more enjoyed this film than Divergent."
    },
    {
      "rating": "5",
      "text": "The Giver reminds me of two other 2014 films, Transcendence and Divergent (both of which I also have reviewed on Metacritic). Why? The Giver is similar to Transcendence because both films took a while to make (of course The Giver was in the process of being made much longer by Jeff Bridges). Both also have good and respected actors---Transcendence has Rebecca Hall, Paul Bettany, Kate Mara, Cillian Murphy, and Morgan Freeman while The Giver has Jeff Bridges, Meryl Streep, Katie Holmes, and Alexander Skarsgard. The Giver is also similar to Divergent because (I don’t like to say this, but) both YA novels and their movie adaptations have implausible utopian futures and societies.\r The world featured in The Giver honestly doesn’t make much sense, if you simply base you opinion on the movie. Unlike other novel adaptations, I didn’t read The Giver book. I actually made sure I didn’t, so that I could have an unbiased opinion. A movie needs to stand on its own. If I need to read a book to understand it and like it, than exactly how good is the movie on its own? So, I just watched the movie. And the world/society that exists in The Giver doesn’t really make much sense. Who created “the community” where Jonas lives? Why are the Giver and the Receiver the only ones who have knowledge of the past? Exactly how do they even get memories of the past in the first place? If the Elders created Jonas’ community, then why don’t they have memories of the past? It would be impractical for them to rely on the Giver and the Receiver to tell them advice, because they could lie/deceive/manipulate them. Why does their need to be a Receiver if they already have the Giver? How does the government work? Are the communities entirely self-reliant (because I doubt they are)? Later, I actually read the book and most of the questions above are still not answered. The book gives more answers for sure, but we still don’t know much about the world of The Giver.\r Some scenes in the film look and feel cheaply made, with not-very-good CGI and strange camera angles. The actor playing Jonas feels too amateur; his scenes feel awkward and forced at times. This doesn’t only apply to Jonas, but almost all the actors in the film.\r I feel like all the people who rated “The Giver” favorably watched a different movie. “One of the best films of the year”; “tremendous acting”; “amazing actors and awesome scenes”? I feel this praise is unwarranted. “Worst movie of the year”? Some of the criticism for the movie is unwarranted as well.\r The movie changed a few things from the book, but I think most of these changes helped make the storytelling more fluid (if also a bit cliché). These changes were done to help the viewers experience, similar to The Maze Runner film. One example of these changes is Asher; lots of things about Asher are changed (he wasn’t a pilot, he didn’t help Jonas). Also, the romantic aspect of the movie (the relationship between Jonas and Fiona) isn’t nearly as prominent of important. Most of the memories giving sequences are just plain montages, and more time should’ve been given to them and more different memories should’ve been shown.\r Considering how long it took for The Giver too finally make it to the big screen, you would’ve thought the movie would be pretty good. But the movie feels underdeveloped and dull. Despite all The Giver has going for it, it’s not that good. I do like the book by Lois Lowry much more though; I have a small paperback copy of it.\r Score: 5.8\rIf you liked this review, please read my other ones on movies, TV shows, and videogames. I have reviewed 30 movies, including the 2014 films: The Maze Runner, The Expendables 3, Teenage Mutant Ninja Turtles, Guardians of the Galaxy, Sharknado 2, Dawn of the Planet of the Apes, Transformers: Age of Extinction, Edge of Tomorrow, X-Men Days of Future Past, Godzilla, Blended, The Amazing Spider-Man 2, Divergent, Transcendence, Jack Ryan: Shadow Recruit, Blended, The Lego Movie, and more. I also review TV shows, such as: TNT’s The Last Ship, Fox's Sleepy Hollow, ABC's Marvel's Agents of SHIELD, CW's The 100, Fox's I Wanna Marry Harry, NBC's Crisis, Fox's Gang Related, and more. I also have reviewed the mobile game Minecraft-Pocket Edition.\r %%SPOILERS%% At the end of the movie did Jonas really find a house, or did he just imagine it? Because how could a normal society possibly exist so close to the communities?"
    },
    {
      "rating": "7",
      "text": "I never read the book but this is based from a book. This movie has interesting concepts and really makes you think about things that make up today's world. It is a deep, touching, emotional and unique human story. Overall, its worth a watch."
    },
    {
      "rating": "2",
      "text": "Jeff Bridges has tried to make the novel \"The Giver\" into a film, so this is sort of a passion project for him, but the screenplay and the movie is a whole atrocity. I have read the book it was an  astonishing tale of a calm society. This film misses some of the great details that the book had, they took the main character Jonas (Brenton Thwaites) and turned him into a complete idiot in the book he did not tell anyone about his training or told what he learned such as dancing, the word 'love' or show his skills as a receiver of memory. But no! screenwriters  Michael Mitni, Robert B. Weide turned the best sci-fi of the decade into an atrocity adaptation into a best seller into film. Grade D"
    },
    {
      "rating": "9",
      "text": "The Giver es una película adaptada de un libro que resulta atractiva, intrépida y muy interesante a medida que avanza.\r Esta largometraje, que contiene una fotografía muy fascinante con sus diversas gamas de colores, te ofrece una historia inteligente e interesante llena de varias tonalidades (con eso me refiero al sentido literal) y que contiene una trama que resulta sencilla y arriesgada con fuerte poder narrativo, además de que con sus intrigas y sus aspectos la hacen ser un largometraje intenso y atrapante."
    },
    {
      "rating": "6",
      "text": "I think that 'The Giver' it's an interesting film, with interesting ideas, but no everything on 'The Giver' it's perfect. The plot behind the movie sounds really cool, but in the develop, some moments arent' brilliant, and we can add to that other moments are boring and unnecessary. The cast it's really great, Meryl Streep, Jeff Bridges, Katie Holmes, and, Brenton Thwaites, and Alexander Skarsgård, and their performances are good, but not enough, because they do what they can with their characters, which aren't developed in an excepcional way. The script it's okay, but with the plot, some situationes could be exploited better. The movie has some interesting points, the visualy aspect that initially handled it's cool, and gives an interesting perspective to the film, and the soundtrack is another positive point, \"Ordinary Human\" by OneRepublic it's amazing!\r'The Giver' is not a terrible movie, is an acceptable movie, with some cool elements, but could be better, and with some exponents of a good movie based on a young adult novel (The Maze Runner, The Hunger Games), the final result is a little loose."
    },
    {
      "rating": "9",
      "text": "I was really surprised by this movie - I know a lot of people were expecting the Hunger Games, only to get The Giver instead. If you loved the book, you'll love the movie. Surprisingly enough in the days of CGI-overload this movie is backed with a lot of thoughtful dialogue, good acting a teeny tiny bit of action. It's a different kind of dystopia, and I'm not minding it at all. Very good! Made me cry a couple times, not a lot of things do that."
    },
    {
      "rating": "4",
      "text": "I wanted to like this. There was a considerable relief watching this over watching Maze Runner. But we won't get into that. The star studded cast still couldn't make this one shine in the way it needed to. I liked what it hinted at as far as the moral boundaries and where they are crossed and not crossed. It dips into the age old questions on what is right and what is wrong. The angle is kind of different because they try to control everyone enough so that everyone does the RIGHT thing. Which seems good in thought and theory but shows up in a society just like the one you see in the movie, void of real love, affection, and feeling. Which falls the argument, if you can't feel, it means you are free from heartache, pain, betrayal, and all the bad things, so which one is really better? All that ensues and is part of the idea this movie presents, but the way it was presented was without much of anything all the entertaining...which is kind of important because that's the point this world isn't entertaining...so why go make a movie about it? The Giver himself was pretty much the only voice of reality and reason which got annoying, I mean no one else even bothered to think of other things? How does the giver have those powers anyway? Wasn't explained very well, and if they didn't want their thoughts to be opened why did they even bother having the whole giver thing made in the first place? Notable teen performances and actually a good movie for the year, not that that says much...leave this to the paper and ink boys."
    },
    {
      "rating": "8",
      "text": "he Giver is the latest novel plucked from the young-adult section of the bookshop and rushed through a studio system to result in a healthy return on investment. Recently The Hunger Games series and the standalone The Fault In Our Stars have done a tremendous job in transforming the loved novels into fitting entertainment and mountains of cash while Divergent and If I Stay have fallen flat, perceived as gimmicky and formulaic in a crowded genre.\r Starring Brenton Thwaites, an Australian Home and Away alum making waves stateside, it certainly appears to be lingering into familiar territory. A terrific supporting cast thankfully circumvent cliché.  Jeff Bridges, passionate advocate for the film’s creation, initially envisaged his father as the titular Giver before taking the role himself, repenting himself for the abhorrent R.I.P.D. Meryl Streep’s regular slamdunk performance injects the necessary seriousness to graduate from an everyday flick into more. Her presence is noteworthy. Unlike Divergent’s Kate Winslet or Guardians of the Galaxy’s Glenn Close, Streep’s character moves organically inside the story and impacts the plot. True Blood’s Alexander Skasgard and Batman Begins Katie Holmes round out the adult cast to minimal effect, wasting potential.\r The young cast are just that – young. Thwaites is a wildcard choice and handles his scenes with veteran actors formidably. The dynamic between himself and Bridges create some touching moments. His lovesick moments were also on par, luring his flame out of the widely accepted clinical and institutionalised regime. The actress behind her, Odeya Rush, did a less thrilling but still passable job. The performance bagged her a Teen Choice Award, and although the contest is wildly criticised for being rigged, it’s still a sweet notch on her belt before she costars alongside Jack Black for Goosebumps.\r Cameron Monoghan didn’t act particularly awfully however his character Asher was unmemorable, confusingly zigzagging the frenemy line to an uninspiring and anticlimactic plot moment. At times he was a best friend, a concerned neighbour, a larrikin or a military man. Days later it’s not certain whether the three formed a really terrible love triangle or not. It would have been a kinder to take a leaf out of The Fault In Our Stars and their character Kaitlyn who was an important beat of the novel but unmissed omission from the film.\rlot of these faults can be attributed to a hamfisted script.\r The plot, painstakingly determined twenty years ago and printed in black and white, is a gradual realisation of the dubious societal environment that encompasses the world around the protagonist and the slow-burning resistance and eventual outright confrontation. There are some distinctive parallels that inspire empathy and highlight two completely different but ultimately distressing issues in the world today in the mass collection of information from massive corporations such as Facebook, Google and Apple, and the new sickening ways that terrorist organisations are operating inside the film. The Giver sees the human side of things and makes it easy to empathise with both sides, before ultimately dictating that Meryl Streep and her cronies are severely misguided. The way the story moves and shifts is always deliberate and concise which is odd for a movie released in September.\r It’s the details of the script that irk me. The phrasing and language indicate the carelessness of an overnight romantic comedy or low-budget frat piece. It’s brash, abrasive and the key weakness of the film. To remedy the woeful dialogue would raise this to a movie worthy of a June release.\r On the other hand the aesthetic is phenomenal. The film begins in monotone and adds saturation and colour splashes as the protagonist becomes more educated, then cuts to black and white to depict a scene without the hero. As the film progresses the separation becomes more and more apparent, most so in the climax, where the protagonist is surrounded by elaborate panorama and the supporting cast are in abstract claustrophobic scenes reminiscent of One Flew Over the Cookoo’s Nest.\r It’s a neat trick to keep the audience engaged.\r The set pieces also look a million dollars, particularly the Giver’s home and study area. As is unfortunately not the case with so many book adaptations, the film innovated specific pieces of furniture to make it as close to a novel’s illustration. It is another of the film’s core strengths and raises it from a home release popcorn flick to something worth a journey to the theatres.\r The Giver is not your generic young-adult adaptation. It’s a faithful representation with cool styling, a solid lead in Brenton Thwaites and some top notch supporting moments from Jeff Bridges and Meryl Streep. The script is careless and detracts from the enjoyment of the entire film however the plot is solid and there are far worse things on at the local cinema."
    },
    {
      "rating": "7",
      "text": "Anybody with an intellectual mind and opinion will love this movie.\rIf you don't have either of those things you won't get the jist or understand how powerful and amazing this movie is."
    },
    {
      "rating": "3",
      "text": "The Giver is one of the Best books I have read of all time. However the movie failed to compare. Between the fake emotional stakes, the romance that seemed like it was 90% of the plot, and the fact that the best parts of the book weren't even in the movie. And I'm 14, the age that they wanted this movie to be for, and may I say. It was just crap. The only reason I didn't give it a zero was Jeff Bridges's acting."
    }
  ]
}