{"id": 647, "title": "The Predator", "starring": ["Boyd Holbrook", "Trevante Rhodes"], "runtime": 107, "genre": ["Science Fiction", "Action", "Adventure"], "description": "When a young boy accidentally triggers the universe's most lethal hunters' return to Earth, only a ragtag crew of ex-soldiers and a disgruntled scientist can prevent the end of the human race.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/wMq9kQXTeQCHUZOG4fAe5cAxyUA.jpg", "categories": {"plot": 3.075, "acting": 2.92, "ending": 3.2, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 3.0555555555555554, "action": 3.5454545454545454}, "reviews": [{"rating": "0", "text": "Story - sh#t, even worse than AvP. All Predator's movies filmed after the original the Predator (1987) is cr@p, and the Predator (2018), unfortunately is no exception."}, {"rating": "1", "text": "Under average movie, waste of money and time.Full of clichés, idiotic monologues and just bad acting.Looks like 12yo write the script. This franchise is over.To quote my good friend: RIP Alien, Terminator and now Predator."}, {"rating": "2", "text": "Hugely disappointing AND I went in with lowish expectations. There are a couple of reasonably good performances and scenes but overall its a shambolic mess and for an action movie quite boring."}, {"rating": "0", "text": "I’m almost 40, and I’m posting a movie review for the first time (that’s how bad this movie is). I left 64 minutes into the film (another personal first). ‘The Predator’ is a confused mess. It’s a terrible addition to the franchise and to “A-list” sci-fi movies in general. Expect glaring plot holes, poor CGI, army recruitment undertones, ridiculous autism speculation, and physics-defying scenes – you’ll feel like you paid to watch a video game stream in a theater.."}, {"rating": "3", "text": "Don't go see The Predator. Almost everything about it was awful. It feels like a group of interns wrote, directed and produced this lackluster catastrophe. It was so bad I almost walked out last night. From the bad acting, cringy dialogue, annoying stupid poorly written forgettable characters and their questionable decisions, CGI so bad that it looks like it's from a 2010-2013 alien video game cut scene, action scenes so boring and full of mindless explosions that it feels as if it's a bad Michael Bay film. Not to mention it's terrible pacing and a plot that's so all over the place the movie itself doesn't seem to realize what is. The jokes are so immature and unoriginal. I laughed at a few of them, but most of them seem like some 10 year old high acid said them. Hell even kids probably won't find this amusing. I found myself cheering for The Predator to kill all the characters and walk away with the boy. It would've been for the best, because his father the a dumbass.  Stop making half ass cash grab films like these for a quick buck with no effort. If you're too incompetent to do so stay out of the show business."}, {"rating": "2", "text": "The film is a parody of a 'Predator' movie, it's a spoof of the franchise and the current mindset of studio executives with their \"MCU, MCU, MCU\" envy. The film wreaks of meddling, studio and test audiences.Due to the re-shoots, there's plenty of barely finished CGI and it's hard to get too invested in some of the action sequences when the VFX look straight out of 'Star Trek Generations' and some creature CG that's borderline as bad as the VFX in 'An American Werewolf in Paris'. But, those were mid-90's movies, not a major release in 2018.It's not just the rushed CG, the re-shoots have taken their toll and crippled the film both structurally and narratively, it's an absolute cluster mess, overflowing with pacing issues, tonal imbalances, massive continuity issues and plot holes. It is one of the worst edited movies I have ever seen put out as a major release. I have never had so many - \"WTF? Who, when, how do you know that? You don't know that?! You weren't there or didn't see it so how do you know that?! No, you didn't read his file, you were there for 2 minutes!\" - moments in a film for a long time. I spent a lot of it going in my head \"oh, so they're over there now, weren't they just over there a minutes ago?\", \"hang on, where did they get all those guns? Where did they get the trucks? They were in the house, now they've got all that... what?\" and the worst moment was, \"where did they get that helicopter? How did they get that in less than two cuts?\""}, {"rating": "5", "text": "Gets a number of things right but the plot is stupid and writing inconsistent."}, {"rating": "4", "text": "I saw this movie in a plane, so I was bored. I am happy, that I didnt lose my free time for this garbage with unrealistic characters (most ridiculous: a scientist woman who fights like a male soldier xD) and weird story. Congratulations for destroying this franchise, that started perfectly."}, {"rating": "4", "text": "\"The Predator\" was a fairly weak movie, where the action was a good companion, but where the performances are not credible, where are bad visual effects and where the story is vulgar and bad, a very bad attempt to bring Predator back to the big screen to the new generations."}, {"rating": "0", "text": "What a **** movie !!! I was really hyped enough for this movie and i get only dissapointment! I really wish a predator movie with Arnolds return event thouhgt in his age!!!! Maybe he was the reason of success in the first movie cause all the others movies than the first one sucked really hard!"}, {"rating": "1", "text": "Un predator terrificante ma anche come film d'azione a se stante è inguardabile."}, {"rating": "3", "text": "This time a Predator is captured, and held at some military research lab, and of course it escapes as the scientists don’t restrain him properly.  Then the movie plays out like John Carpenter’s Halloween where they all drive around town searching for the Predator on Halloween with all the kids out trick or treating, and then they send in incompetent government agents.The script doesn’t make much sense with a lot of continuity errors, and I don’t know if it is due to a problem with poor editing, but it feels quite disjointed in places. The scientist in one scene finds out who the sniper was that had first contact with the Predator, but then she is running for her life, and meets the sniper and says she already read his file.  Like, no she didn’t.  She never even had a chance to see it.  At another point the group of misfit service members, which they refer to themselves as the loonies are in a woman’s house, and then you see them spread out in various vehicles driving around town including a police car with the sirens going.  Like, what?  Or later when they randomly show up at the perfect time with a News helicopter.  Where did they get the vehicles from? They also magically have a lot of military grade firearms including grenade launchers, assault rifles with silencers, and mp5s.  Yet they never had access to any of it.  When a Predator says he is hunting them then the groups of people that were killing each other suddenly became allies without any hesitancy whatsoever, which was ridiculous.  Oh, and the Scientist lady turned out to have special forces combat skills, which also was not believable.Some of the deductions like from the military intelligence officer who deduced what the Predators were doing was too far-fetched.  No way he could have deduced all that on the info he had, but serves as a lazy way for exposition.  The Scientist who figures out what the Predators are up to on each planet by just looking at their blood in a microscope is also crazy far-fetched.  No way she could deduce that.  Also serves as exposition, and there were other moments equally as far-fetched.  The young kid with autism who liked around 9 was also some kind of genius at being able to immediately know how to use the alien technology.  This didn’t make any sense.A VA facility would not be where they take the Predator to conduct tests, and the security would have been much better since they know they have an alien that is very deadly with a lot of strength as they make references to the Predators in previous movies.  They know what they are capable of.  It is also highly convenient that the soldier that makes first contact with the alien happens to be in the same VA facility.  Not to mention, how convenient it was that the soldier was on a secret mission to rescue hostages in the jungle where the alien’s escape pod happened to land just as he was about to engage in his mission.The movie has a lot of tonal problems too.  It seems like it is meant to be a sci-fi action horror, which makes sense, but it also tries to be a comedy at times, and the attempts at humor feels so out of place, and cringe.  I can’t tell if it is trying to be an intentional satire or not.  The group of misfit soldiers are terribly out of place with one guy with tourettes as if he is meant to be the comic relief, and their interactions with one another is just irritating with some slapstick comedy.  The scientist that joins them also seems to act out of character at times in a very disjointed way.And, the CGI was not a good idea for the Predator, and looks like they were jumping on the Marvel bandwagon.  The acting was pretty poor apart from the lead guy, and woman whom were decent and some of the action sequences were decent, but not much else."}, {"rating": "5", "text": "I think it is watchable but also the weakest in the Predator franchise. It mostly lacks the feeling of fear and dread the other movies have and the story should be a bit more ironed out. I also dislike the stuff they add to the lore which weakens the franchise in my opinion. The previous movie was actually pretty good so I was hoping this would be equally good too. The story starts with a squad of the US army on a mission in Mexico against a drug cartel when a strange flying object crashes nearby. For the sniper Quinn it is the start of a strange adventure he never would have imagined in his wildest dreams or nightmares. I am vague to avoid spoilers. The first few minutes are excellent but it did get weaker fast. It is never as intense as the previous movies. They lack the dread, fear and menace. To be fair it as its moments but the story in total is a missed opportunity. A lot is not used well and if it were on DVD I would fast forward a lot. Also the additions to the lore weaken the franchise. A lot of the appeal was that the predators were mysterious. Here they answer some questions but the answers are disappointing. There / Those are also WTF moments like the instant understanding of technology, the upgrade stuff and the Predator using verbal exposition to name those I think are harmful. I like the cast even if nothing cant top the first Predators cast. The lead role by Boyd Holbrook works but is also the weakest lead character in the franchise. His squad consisting of actors Alfie Allen, Augusto Aguilera, Thomas Jane, Trevante Rhodes and Keagan Michael Keys. They are fully to my liking and I enjoyed them a lot. Special praise to Jacob Tremblay as there are not many good child actors and I think Yvonne Strahovski and Olivia Munn are also good. We have a really good cast in my humble opinion. The special effects were fine for me. Not the gold standard but convincing. Overall I repeat that this movie is not intense and scary enough by franchise standards. It is worthwhile but not amazing. Weakest movie in the franchise and some of the new lore I will ignore. A 5/10 seems fair for me."}, {"rating": "5", "text": "The 2018 Predator is no longer as terrible as Predators, but it is not near the original dilogy. We can say that Predator 2018 is a soft restart of the franchise with many references to the original and scenes not included in the original film. But the new Predator is still an average film, ranging from a dumb linear plot and a boring action, to just a terribly similar and uninteresting main antagonist. A restart that the franchise did not need. The last 20 years, the Predator series is only tormented, it is better to leave it. And shoot something new and original."}, {"rating": "0", "text": "This movie is a real"}, {"rating": "0", "text": "Que te han hecho Depredador, antes eras chévere.... Deberían pagarte por ver está basura, malas actuaciones, sin sentido por todo lado y efectos que realmente se ven peor que la de Swatseneger de los 80. Escribo esto ahora porque la veo en cable, no hubiera pagado cine por este desproposito"}, {"rating": "5", "text": "My favorite part was when they reveal that the predators are literally weaponizing autism to further their conquests."}, {"rating": "3", "text": "How did y'all expect this to be good? It doesn't even take place around Christmas."}, {"rating": "0", "text": "For the love of god, stop letting shane black direct movies. He sucks and should have his career ended by now."}, {"rating": "0", "text": "This is the worst movie I have seen in years. The sad thing is, terrible movies can be hilarious and enjoy in that way, but not this one. It's not even good at being a terrible movie."}, {"rating": "1", "text": "The script and acting are so bad I wished the predator won. The jokes are flat, the characters, inconsistent and seem to possess intelligence well below par. If you expected a stupidly fun movie, well, one out of two ain't bad."}, {"rating": "6", "text": "Oh boy this is a hard on. When you like the first Predator movie you will thing this is a insult against every predator Fan. But when you like a stupied, fun B-Movie action film you may like it. Still the 3 act is bad but overall i was entertaint. Even if the movie has some pacing issues"}, {"rating": "4", "text": "I’m gonna start this off by saying that I’m not a huge fan of the Predator movies (I’m more into Alien) but I’ve liked all the movies I’ve seen from the series. I like the original a lot, I haven’t seen the second one, Alien vs Predator is a guilty pleasure of mine, I haven’t seen the second one, and I thought Predators was okay. As for The Predator, it was definitely a bad movie, but I actually thought it was pretty funny. A lot of the intentional Marvel-style humour fell pretty flat for me, but there’s another aspect of the film that I found pretty hilarious. One of the main characters is an autistic kid, but he’s movie autistic. He’s shy, he gets bullied and he can’t handle loud noises (except for explosions apparently?), but he’s actually a genius. Pretty stereotypical portrayal. Mary & Max and Ready Player One did it a lot better. What makes it hilarious is how they use his autism as a plot device. How can he figure out how to use the Predator technology? Autism. Why is the Predator after him? Also autism. Why? Get this. They are using humans to make super-powerful hybrid Predators and one of them wants to use the power of autism to make them even stronger. Yes, you heard that right, the Predator wants to weaponize autism. But that’s not all! There’s also an environmental message and a cute animal sidekick! I swear, I’m not making any of this up! This movie’s plot is insane! As for the rest of the movie, it was honestly nothing special at all. It’s pretty much just a generic action movie. There are some neat practical effects, but there’s also a lot of bad CGI. I didn’t care about any of the characters, but there were some good kills. This movie wasn’t a bad way to kill 100 minutes, but if you don’t like so-bad-it’s-good type movies, I’d say just stick with the original."}, {"rating": "0", "text": "Aspergers and climate change....... that's all you really need to know about this movie"}, {"rating": "5", "text": "While The Predator miserably failed to present a good sci-fi horror story, it unexpectedly managed to make me laugh a few times for its duration. I did not expect to find the movie as fun as I did and for that matter, I don't think it was that bad. It was just a terrible horror movie but succeeded in at least making the audience laugh a couple of times thanks to its comedy relief characters and moments. Truly the movie's unexpected saving grace."}, {"rating": "0", "text": "This is the worst movie, it's a huge **** ..it has a lot of mistakes in what is the story of the Predator, the characters are stupid, the special effects are rubbisha story that seems like a bad joke, a bad parody**** you Shane Black"}, {"rating": "3", "text": "There is just so little to like in 'the Predator', and everything it does well is the visuals. The Predator is a simple concept, and the audience for this kind of film just wants simple things: An alien who is an intergalactic hunter for sport or whatever. Yet, they had to throw everything that only troubled the plot, straying from the only reason anyone would ever want to watch this.Starting by the character of the boy in this movie, it's just wrong. It's just glorifing a disorder. Asperger is not a 'superpower' to make 12yo understand alientech. This felt like a wrong depiction of the condition in a bad way, was silly all the way and required some suspension of disbelief to continue. The fact that the entire plot depends on it so much makes this a bad movie. The entire plot gathers around this more and more, which makes the suspension of disbelief incleasingly harder. By the end of the movie they just added so much unnecessary content that convoluted the plot and disturbed the audience's first motivation so much, that I just preffer to think it to think this movie does not count start with. A giant predator felt so misplaced. It would be so much more more interesting if it was another regular predator. There could much more intense and remarkable scenes between two predator fighting then seeing a giant predator destroy the regular one, effotlessly. It felt lazy and lame. A predator puppy.It even has the bangs. How can anyone not get out of immersion when there is a predator puppy? With predator bangs for good reason?And of plain and simple enviromental alarmism out of nowhere (it's defenitely alarmism when you say the world ends in two generations).Now, Balancing the nice looking predator with these awful aspects, there's almost nothing to keep one's interest. Add to it the all so exausting \"last second\" cliche taken to exaustion. It breaks the movie for me, really.Making a predator story is not so hard, you just have to keep it simple, small, localized and broad enough to turn it into a connected universe. It shouldn't make too much out of it in a single installment, it's just predator hunting for prey."}, {"rating": "0", "text": "Es un asco esta pelicula 1 porque un niño peude en tender el idioma predator asi como sinada actuaciones de mierda dios arrinaro la saga asta alien covenan es mejor"}, {"rating": "5", "text": "Schwarzenegger just doesn't lose the film anywhere and without him. The film also makes the same mistake that Alien made: Covenant, and that is that they serve us the main emzák under the nose and can be seen quite often, which is not exactly the best idea, because then it loses in the atmosphere and when we are at the atmosphere, so it is completely zero. At Alien and Predator, the atmosphere was the main thing, and unfortunately it is not here, at least for me. For me, an above-average film that I do not recommend."}, {"rating": "0", "text": "My review has to be 75 characters long. So I just had dinner. It was nice. This film is **** ****"}, {"rating": "0", "text": "They made the kid with a mental illness have “super powers”. This was simply the worst predator movie"}, {"rating": "3", "text": "this movie is like the MCU merged with R Rated content, you have been warned"}, {"rating": "0", "text": "This film is nothing more but a spit in the face of all Predator fans. There is absolutely no respect towards the Yautja lore, as if Shane Black did not take even a minute in looking for material to make the film. I've spent a while thinking about ways the plot could've been changed to make it work (all of them without the Assassin Predator, of course), but dude, I give up, there is absolutely no way of justifying that this movie was even a concept to be started. It looks more as a Fan-Parody than an actual Hollywood movie."}, {"rating": "6", "text": "Why Shane, why? It might be so good, but it's not. Actually first 15 min feels like ok, but than you lost this feeling like forever. Part of film looks like AVP2, imo worst movie in whole franchise universe. I'm not a hater and i love Predator 2 with mr. Glover. But here film packed with low grade humor, bunch of cliche and no suspense at all. While watching movie I could not leave a thought that proper final cut where 30-40 min goes to garbage bin still can save it.Maybe next time, Predator, maybe next time."}, {"rating": "5", "text": "This is a movie that is very enjoyable and silly to watch.There is a lack of coherence and the film is aware of this witch makes it better but still not okay. The predator is made for people how love dry jokes and exaggerated action scenes."}, {"rating": "1", "text": "Cardboard characters, Awful comedy, ruins the lore, badly shot... the predator has come to Earth to steal.... autism... yes someone actually thought that was a good plot."}, {"rating": "4", "text": "In all honesty this is a 2/10 movie but they somehow made it fairly self aware, almost spoofish. Therefore I find it hard to fully knock it as it does not take itself serious - at all.The movie is a comedy really, full of silly silly silly scenes where characters just quip at each other and make silly jokes. Nobody is really too bothered about aliens or dying - death is almost glorified here. The main guy seems to care very little for his life, the fact there is an 11 foot alien or his sons life. He just wants to make badass one liners and shoot guns.The Predator (super) is full CGI and is honestly some of the worst CGI I have ever ever seen... this is meant to be a multimillion dollar project made in 2018!? Dont get me started on the Predator dogs.The end scene is probably the best and would make for an interesting sequel - but this is unlikely as I suspect it will bomb at the box office."}, {"rating": "4", "text": "Thoroughly disappointing if you are a Shane Black fan. EVEN MORE DISAPPOINTING if you are a Predator fan.Having grown up a huge fan of the original, I was excited to hear that Shane Black, an original cast member had been brought onboard to breathe fresh life into a promising franchise that has been squandered by subpar sequels and horrendously awful crossovers. I didn't set my expectations very high and wasn't expecting this to eclipse the brilliance and effectiveness of the original film, but it is a crying shame that this film could not even claw its way over the low bar of expectations I had set for it.The movie surprisingly started out interestingly enough and I found myself enjoying it throughout the first two acts - but it is when the \"Upgrade Predator\" arrives on scene where the movie quickly devolves into a sloppy and incoherent mess with gaping potholes larger than a crater left by a downed predator ship.Overall I find this movie to be the unfortunate victim of too much test screening, too many changes and re-shoots, and an overabundance of bad creative decisions by the writers. The film relies on too many (inexplicably incompetent) nameless commandos as cannon-fodder to notch up a large body count, the CGI kills look cheap and shoddy,and the stakes feel way too low when the emotional weight during key scenes is sacrificed in favor of cheap laughs. If that wasn't bad enough, the ending will have you rolling your eyes and groaning in your seat as you realize you have been suckered into another money-grabbing Marvel movie masquerading beneath a predator mask.Avoid this movie unless you are a true predator fan desperate for another fix of Yautja-related chaos - and even then prepare to be left unsatisfied."}, {"rating": "4", "text": "This one had the potential to be fantastic, but ends up as average. Sooo much potential wasted on tons of dumb comedy, dull story and bad cgi..."}, {"rating": "4", "text": "Not as bad as I thought it would be. The movie is quite good until the first Predator gets killed (20 minutes to half an hour in) but then it becomes something else entirely. Some things don't make any sense especially when it comes to the scientist, they must have gotten money to make that lady scientist look like some über powerful superhuman or something. There are some good action moments in there and if you're not averse to over the top action this movie is actually quite enjoyable at times. Not great or even at least somewhat intelligent but fun if you're going in without a thinking hat on. Start thinking about all the things that were said and you'll see it's just a gigantic mess. If they had carried on in the spirit of the first 20 minutes it could have been really good. Alas, could have been."}, {"rating": "3", "text": "Hughly dissapointing movie!!! Shane Black done piss poor job storywise in this one! There's no oldschool Predator left. Remember Dread in Billy & Dutch's eyes looking for \"something in those trees\". Predator use to be Real menace back in the day. Here we have bunch of yahoo's cracking jockes around, jumping & shooting just like those Marvel superherous. One level with them some chick from university, which outsmart any scientist around, jumping/shoothing in her portfolio also.  I've been highly invested in bits with predators lore, but it's 5% of the movie. The rest 95% containing human interactions just painful to watch! I'm really pessimistic for the future of the franchise. They should hire Nolan for the good story in the next one, but I doubt that very much..."}, {"rating": "0", "text": "What exactly was this eye cancer? A bad comedy with a super predator and an iron man suit? Mutants predadogs? You guys destroyed everything that made the movie a master piece, and turn it into disaster piece."}, {"rating": "3", "text": "Not what I was expecting. Like most I watched the original a hunderd times when I was a kid and I has hoping for a serious sci-fi action movie of that calibre..maybe a little on the horror side and a little 80's nostalgia ....but instead I find a modern bland movie about a bunch of misfists, a kid and a biologist-who-know-to-fight-like-Rambo showing off how cool is to be underdogs while figthing the \"bad military secret x-files division\". Oh, there is a Predator here and there but the rare occasions where It's part of the story he beahave like a generic supervillan in a superhero movie....rather than the alien hunter menace that I remember it by.I didn't like it very much, cosidering that jokes, action sequences, sci-fi part, antagonists and protagonist, plot twists are forgettable"}, {"rating": "2", "text": "Bad story, bad acting, bad casting and definitely worst Predator movie.This is officially ending the Predator series. One was great and two was good, can't understand what Hollywood is doing anymore."}, {"rating": "3", "text": "No.Just.No. Creators of this movie took a massive dump on \"Predator\" lore. It's more like R-rated action comedy with goofy characters and \"your mom\" jokes. Plot is all over the place with unnecessery sub-plots and dumb premise for the whole story. Characters are numerous, forgetable and sometimes really annoying. CGI is ok(ish). Some scenes with violence and gore is one of the few things done right. And that ending....Holy nipple twisting sh..t. Predator franchise went full retard, \"Transformers-style\"."}, {"rating": "4", "text": "Hearing Shane Black (who was in the original Predator) was going to direct a Predator movie I was excited to get back to the original world of the Predator franchise and then Shane Black turned into Roland Emmerich. This film is a mess with a series of fun moments sprinkled throughout. The cast are all solid but give me a break with that story. Then the finale happens which really shuts the door on this film and please no sequels. Overall a disappointing middle to high 4 a C-."}, {"rating": "1", "text": "Really poorly paced film. Everything happens so fast you don't have the time to generate any emotions about any of the events in the film. I was very disappointed. The comedy was sometimes funny but always out of place. The CGI for the new giant predator looked cheesy and turned the film into a cartoon. The script was ok but had many cringe worthy moments. The end of the film has zero emotional impact and is completely forgettable."}, {"rating": "6", "text": "I'm giving it a 60 rating. Only because I luv Sci-Fi. This might be the worst installment in the series. And its about time to put it to rest If nobody can come up with better plots. Hell, God knows Hollywood has milked Predator to death! This one has to many smart-A.. Soldiers cursing and trying to make to many jokes. I should have given it a 5. But..I'm a sucker for Sci_Fi. If you have not seen it yet, Wait for it on Redbox."}, {"rating": "4", "text": "As a big predator fan I was extremely looking forward to this new predator film, when I think of a perfect summer action movie, I think the predator, that film is perfect to me in every way.  And unfortunately I have not enjoyed a single predator sequel or spin off since then.  Now before I went to see this movie I really tried to go into the film open minded and tried not to get my hopes to high.  However I still don't think this is a good film, whether you want to view this as a dumb action movie or not I found myself medley entertained at some points.  For starts I loved the cast, I'm a particular fan of Boyd Holbrook as an actor and I would love to see him more often in other films.  The look of the predator is really good, the costume and production design is really good and this film had some really cool bloody predator kills. Besides that, I didn't find much else entertainment.  This film has an extremely messy story and lots of events happen more based on coincidence.  There also isn't any emotion put into any of the characters, people kill for the first time and almost don't seem to care, there isn't ever a sense of tension or fear.  In that first film, there were very tense moments, there were quips and jokes but they weren't depended on, this film relies a lot on jokes and quips and doesn't offer any tension or actual stakes.  So overall I'm very disappointed and hope that some better sequels come along."}, {"rating": "1", "text": "So the terrifying interstellar hunters have been replaced with \"super\" aliens, that come to earth to abduct autistic kids???  and the only way to stop them is with the interstellar hunter equivalent of an iron man suit?? This movie is insulting to its predecessors, lore, and fans.They shoot a space dog in the head and it becomes their best friend! The awesome OG predator get 5mins of screen time (in which it get owned twice) and is then replaced with a stupid looking cg \"super\" predator. The upgrade predator is more of a generic monster than a cunning, intelligent, and honorable advisory. The movies ultimate quest is to dismantle everything that made the predator one of the most legendary figures in all of syfy.these aren't interstellar tribal hunters anymore. Now they travel through the cosmos to genetical modify themselves with alien DNA,  and in order to improve there genetic make up they need to add the human gene for autism. and  they gave us an ironman suit...the plot is terrible. the characters are average, the acting is average, the writing is bad, the cg is bad, the action is average. I love predator, I'm a total fan boy, and i want them to keep making predator movies till the end of time. but fox needs to hit the reset button on this franchise and let someone who is smart, passionate, and a fan take the wheel and get the hell out of the way. there is so much creative freedom to be had in the alien and predator universe, its shameful that this is what they come up with."}], "recommendations": ["alien_resurrection", "transformers_age_of_extinction", "jurassic_world_fallen_kingdom", "predators", "war_of_the_worlds", "skyline", "the_darkest_hour", "battleship", "geostorm", "the_tomorrow_war", "jurassic_world_dominion", "transformers_the_last_knight", "legion", "army_of_the_dead", "teenage_mutant_ninja_turtles", "riddick", "independence_day_resurgence", "shadow_in_the_cloud", "transformers_revenge_of_the_fallen", "doomsday", "jurassic_world", "the_meg", "pacific_rim_uprising", "underworld_blood_wars", "district_9"]}