{"id": 1121, "title": "The Hunger Games: Catching Fire", "starring": ["Jennifer Lawrence", "Josh Hutcherson"], "runtime": 146, "genre": ["Adventure", "Action", "Science Fiction"], "description": "Katniss Everdeen has returned home safe after winning the 74th Annual Hunger Games along with fellow tribute Peeta Mellark. Winning means that they must turn around and leave their family and close friends, embarking on a \"Victor's Tour\" of the districts. Along the way Katniss senses that a rebellion is simmering, but the Capitol is still very much in control as President Snow prepares the 75th Annual Hunger Games (The Quarter Quell) - a competition that could change Panem forever.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/vrQHDXjVmbYzadOXQ0UaObunoy2.jpg", "categories": {"plot": 7.14, "acting": 7.4, "ending": 8.4, "soundtrack": 10.0, "cinematography": 8.0, "familyFriendly": 6.0, "funny": 8.0, "action": 6.55}, "reviews": [{"rating": "10", "text": "I really liked The Hunger Games, it was truly different, original and overall very entertaining and touching. Catching fire is a really big improvement on the first Hunger Games, no shaky cameras first of all. Not always that we get good sequels, this middle installment of a great upcoming trilogy is fun, although gripping and violent, entertaining for everyone looking for a good time."}, {"rating": "3", "text": "The first hour or so of this movie is wonderful. It really fleshes out the setting of the sci-fi dystopia seen only very briefly in the first movie. The second half is a train wreck of improbable circumstances and impossible to follow action scenes. People just seem to... DO THINGS for no explainable reason. I've never seen a movie go from pretty good to horrible beyond saving so quickly. If you look closely you can spot where it happens. It's right around where the actual \"Hunger Games\" part begins."}, {"rating": "8", "text": "For me, this was on about the same level as the first movie. However, it also manages to exceed several qualities of its predecessor. For one, it felt more dark and mature in how it handled all of the characters. It also felt much more intense and gripping, especially during the games. Once again, the cast gave exceptional performances. Jennifer Lawrence's performance was definitely a step up from the first film, as her portrayal of Katniss felt more detailed and compelling to watch. Josh Hutcherson and Liam Hemsworth also return as Peeta and Gale respectively. There were also some great new additions to the cast. Sam Claflin gave a slick performance as Finnick. Phillip Seymour Hoffman was great as always too! I was also happy to see the very underrated Jena Malone playing Johanna. Overall, it followed the book pretty well. Really, my only issue with this movie was that in some spots, it focused a little too much on the rather cheesy and cliche side plot of the love triangle between Katniss, Gale, and Peeta. Other than that, this was a fun and compelling sequel to the already great first installment!"}, {"rating": "10", "text": "It's just like the book, far better than the previous movie filled with drama and action! A must have and must see! It's easy to follow, emotional and brilliant!"}, {"rating": "10", "text": "It's living up to the name of the book in every details. So Hunger games : Catching Fire is good in all aspects. It's artificial but truthful when it talk about the world we are around. The scenario will not possible at all when thinking with today. But it is possible when all things concerned. It's truthful when comes to the human nature. So a perfect 10 is reasonable when the genre, the adaptation, story and the core message concerned."}, {"rating": "0", "text": "what the hell is this the plot makes absolutely no logical sense they all speck like the editor speed there voices up extremely high oh and wait for this **** when there are fun survival fights they put it in **** pitch black!!!!!! why  so i had no idea what was going on all i knew that there was two people trying to fight these beasts from clearly something that is from matrix from where they change things in the arena and why the hell dogs what the **** so wait wait wait you can make anything like a t-rex or a **** mecha but you make dogs what the **** and all the people in the arena are clearly rip offs of characters from one of the best games in the world tomb raider the main boy and girl are clearly laura croft and peter the other geologist  and its appoling and the president is the profit from bioshcok infinity and well everyone else is a dochue thus movie is terrible how could anyone **** up a such a good plot like this"}, {"rating": "7", "text": "A development upon the first film in many ways, Catching Fire does require a little more subtlety in the delivery of its overall message, but still combines glamour with violence and fleshes out a universe that has proved to be captivating and enthralling enough to maintain enough interest for the final installments."}, {"rating": "7", "text": "Usually when I watch a film adaptation of a book I find it hard to enjoy it. I’ve read the source material and am often comparing it to the book. Maybe it’s the fact that the book isn’t as fresh in my mind as with other film adaptations of books, maybe it’s the fact that the filmmakers actually cared about making a good movie, or maybe its both but this is one of those rare moments where I really enjoyed the adaptation. Often in Hollywood the adaptation is either an massively trimmed down version of the story (ex. the later Harry Potter films and Ender’s Game) or excessive padding (ex. The Hobbit films) so it is nice to see a film that does it right. Not only is Catching Fire a really good adaptation of a pretty solid book and in doing so creates a far superior sequel that serves as The Empire Strikes Back of the franchise (although Empire Strikes Back is in a whole different ball game). Even though by the time I’ve written this review the film has been out for almost a year this is a must watch for Hunger Games fans (both of the book and the film). Fans will be delighted to see a faithful adaptation of the book that hits most of the key points and for the most part is the book they remember (with some exceptions but nothing too distracting or annoying). The story covers most of the key moments and doesn’t gloss over too much, the characters are given time to breath and are well acted, and the direction is far superior to its predecessor. Catching Fire is one of those rare sequels that is better than its predecessor and one of those rare film adaptations of books that does its job well. With the franchise having two good films under its belt I worry about Mockingjay. With the third book being my least favorite this could be to Hunger Games what Spider-Man 3, X-Men 3: The Last Stand, and Pirates of the Caribbean: At World’s End where to their franchise the threequel that ruined everything. It doesn’t help that is being split into two films. For now lets enjoy the middle installment, which will probably be remembered as the best of the franchise and good film in its own right. If you love the book and are worried this film will ruin it don’t this franchise is in good hands shame I can’t say the same for the Hobbit films."}, {"rating": "10", "text": "I loved the first Hunger Games film, but I realized after watching it a second time it was merely a nice setup for something potentially greater. Catching Fire is excellent entertainment but it's the deeper plot and societal references that will grab you and keep you long after the action has faded.  I didn't read any of the books, and as much as I'd like to after seeing the first two movies I almost want to hold off to maximize the impact of the movies. Maybe a \"10\" isn't a balanced score, but I am hard pressed to think of a movie in recent memory that had me so wired and on the edge of my seat.  Jennifer Lawrence is fantastic and the cast surrounding her all turn in great performances as well.  This Hunger Games is more visceral - I didn't want it to end, ever. We'll get Mockingjay to close out the trilogy and I was thrilled to hear that it will be a two-part movie.  It's just sad to think that there can only be one more complete chapter in what has quickly become the coolest franchise since Harry Potter, especially as The Hobbit has turned out to be nothing special.  To Danny Strong (screenwriter) I say: do us proud - Suzanne Collins' oversight will do wonders to keep the movies faithful, but it's your transition from literary fiction to silver-screen entertainment that needs to land the most.  So excited."}, {"rating": "7", "text": "After Katniss (Jennifer Lawrence) and Peeta (Josh Hutcherson) win the 74th games, they embark on a Victor's Tour. After that unpleasant expedition, they get dragged back into the 75th game. The first half of the film sets up the political and personal drama, while the jungle adventure is full of weird environmental challenges (as opposed to personal combat). Lawrence is grim and serious. So is everybody else for that matter. The effects are fine, but the only visual fun comes from Elizabeth Banks' fabulous fashions. The action is adequate without being especially exciting or remotely inventive. This sequel is a lot more about drama and relationships and much less about action and sci-fi dazzle. Probably more popular with fans of the books, since it serves to set up the coming conflict."}, {"rating": "7", "text": "A very slow start for me....but the events before and during the ending was absolutely amazing. A great movie overall...."}, {"rating": "2", "text": "I don't get it. I just do not get it. The first Hunger Games was an unoriginal, monotonous mess. This film (while there are marginal improvements) is essentially a re-hash of the same thing. The first hour is almost a scene for scene re-enactment of the previous film just with a bit more of the bad guys doing bad guy things. Then finally the actual hunger games starts about 80 minutes in and 90% of it happens off screen while we're shown a bunch of exciting shots of our protagonists walking, sitting, climbing trees or struggling with their forced love triangle. It's a thrill ride.\rA big TV in the sky tells us that a bunch of disposable background characters died off screen which I guess we're supposed to care about but I can't help thinking it would've been way more involving if the main characters had come into some kind of conflict with them at any point rather than facing off against CGI smoke and monkies.\rSpeaking of the main characters, there is no development on them from the first film. Katniss remains a sullen, brooding misery while Peeta continues to play the role of damsel in distress (much like the first film, almost every scene he is involved in features him moaning about something or needing to be rescued). The supporting characters like Finnick and Johanna are way more entertaining to watch since they actually have some semblance of a personality. Then there's Elizabeth Banks' horrific attempt at an English accent which is almost physically painful to the ear.\rSo while I have to admit that this is an improvement on the first film, that really isn't saying much. It is beyond me why this is so popular. The story has been done before, the characters are completely unrelatable and the visuals and writing aren't exactly exceptional."}, {"rating": "8", "text": "Crafty direction, good casting and prominent acting on its belt, The Hunger Games: Catching Fire is an illustrious sequel with solid aspects throughout. Screenplay moves in tight pace, and to its credit, manages to fuse together complex social and political issues with the raw battle royal action sequences. This adds more tension and depth to the macabre rather than simple mindless killing game of its peers, slowly drawing audience to invest more on the characters' and their predicaments. It's a more polished, better structured and choreographed movie than the first, odds are fans and audience in general will favor this second installment.\r Fire of rebellion has been lit after the last Hunger Games. To ensure it won't spread any further President Snow (Donald Sutherland) makes Katniss (Jennifer Lawrence) and Peeta (Josh Hutcherson), winners of the last Hunger Games, into glorified celebrities. They are tasked to pacify the crowd with faux romance, however things soon go awry and the hunt for lives begins anew. In almost mocking manner, it portrays contemporary and relatable issue with this other world analog. The overabundance of Capitol and constant oppression of lower districts are shown remarkably. It takes its time to convey the motivation of the characters and in the long run gives more profoundness to the ensuing Hunger Games.\r Jennifer Lawrence does a good job as the leading protagonist, it's not often a woman has the role of the strong main character without blowing it out of proportion or resorting into promiscuous shots. She looks capable and also captivating yet possesses a restrained charm. The wardrobe does help tremendously in creating her persona, but she plays the role with good forte. .\r Other more veteran actors, such as Philip Seymour Hoffman, Woody Harrelson or Donald Sutherland provide solid performances. Each of them plays their role with distinguished air. Younger newcomers provide exuberance and spunk, I personally like Johanna character as with her unbridled profanities. It’d be better to showcase more of the participants of the Games, but considering they need to trim the length into palatable time, it’s fairly understandable.\r Setting for the movie is quite excellent, dyeing most of its vistas with greyish tone, in exception of several more outlandish settings which is sprayed with near excessive colors. It doesn’t forget to bring ridiculous make up, hairdo and costumes for the opulence display, perhaps to insinuate more of the social commentary. Wardrobe has seen relatively stranger clothing than most movies, they're just slightly more futuristic but still believable as casual wear. It doesn't use much grandiose effect which is fine since the human aspects are more apparent. Things would be less engaging if it goes into exaggerated futuristic theme.\r Actions sequences are steadily performed smoother than the first title, there are no crazy stunts to be had nor does it use overwhelming amount of CG. Battle royal theme can be ironically redundant if the movie used unnecessary complex action. Catching Fire cleverly opts for more consistency in choreography and better pacing. Its theme song is quiet catchy, although somewhat repetitive. Overall ambiance of the movie is delivered in solemn hymn, which might not stand out too much on its own but fits pretty well.\r The Hunger Games: Catching Fire offers superior quality on all its elements; everything works well and even better together. Furthermore, it doesn't try to be anything it is not, only improving from what it already has. Not a lot of sequels, or adventure movie as a whole, can achieve that."}, {"rating": "7", "text": "A superb follow-up to the the first of the series, Catching Fire proves the trilogy's worth amidst Harry Potter and the Lord of the Rings. By Catching Fire, Jennifer Lawrence is well on her way to become America's finest young actress--ever present here."}, {"rating": "9", "text": "With the sequel being more matured than its first movie as it explores deeper on the theme of the whole franchise and also providing more thrilling edge of your seat action, The Hunger Games: Catching Fire will lead both fans and viewers wanting more."}, {"rating": "8", "text": "I love the story and the special effects are good. The only bad side to this movie is that sadly we've been here before with the first film. I think I sort of went in knowing what this film was going to be like. I wouldn't be surprised if the last two movies are scored lower than the first two. I think the first one is the best. Whenever a new movie comes out you don't know what to expect, will it be good, or will it be bad? No one knows until someone sees it. The one thing I've seen over the years is in all genres especially in action and horror films the special effects have gotten way better. Catching Fire is an awesome sequel, but if there's one Hunger Game film to watch over and over again, it's without a doubt, the first film will always be the best."}, {"rating": "8", "text": "A thought provoking, visually impressive, and very engaging movie.  Now, I'm not some fanboy who's going to say it was the best movie ever, because it's not, but it's still a noticeable improvement on the first film, which was good to begin with.  The thing I can't quite get past is the lingering youth novel adaptation feel to the movie which it can't completely shake off, even though you can tell that it badly wants to.  It's somewhat hard to explain, but you can still tell that it's aimed at older teens and not adults.  That's not to say that the movie is immature.  In fact its narrative deals with some very mature issues such as fascism, human worth, and rebellion.  It delves more deeply into the themes than the first movie did and shows more brutality at the hands of the tyrannical government regime.  Jennifer Lawrence was good in Silver Linings Playbook, and all of her other films for that matter, but she's even better here.  She shows\rextreme emotion more naturally than she has in the past and proves a great anchor for the franchise.  The new director, Francis Lawrence, who's not related to Jennifer, directs everything a lot more smoothly than Gary Ross, especially the action.  The larger budget also helps.  Instead of merely being passable, the visual effects are now up there with the best of them.  Overall the movie is very engaging and possesses some moments which are truly emotionally stirring, but it still lacks the rapturous grandeur and pure awe of films like Inception and Avatar, and the screenplay, which is good, lacks the precision of films like Zero Dark Thirty, or No Country for Old Men.  But, it's still worth going out to see, and even worth buying once it hits DVD and Blue-Ray.  I think it deserves Oscars, but that prospect is wildly unlikely.  It might have a slight chance in the technical categories, but according to the current buzz, there's way too much competition this year for that to be probable either.  We'll have to wait and see."}, {"rating": "3", "text": "My first guess is Jennifer Lawrence is regretting having signed the contract for these films now, as we've seen her in much better characters in Silver Linings and American Hustle, where she really had an opportunity to show how much she's good.\r The film wants you to be concerned with Panem's troubles, but you just can't get involved. The advantage of the first one was that the Games themselves were crude and you didn't know what to expect, but in this one you know how it all will go already and you fail to be transported in the tributes' shoes. As for the ending, it was a crystal clear sign that this is just a transition film, a lot like The Two Towers was. My suggestion to filmmakers is to stop splitting films and make a very long one, be it 7 hours.\r Just poor, not worth the money or the time, not interesting, not involving."}, {"rating": "7", "text": "Catching Fire is a great improvement of it's predecessor. It deliver's good action, is quite eventful, evokes strong emotions, and is of course entertaining. For those on the fence about this film it is a good watch.\r Immediately upon commencement I could tell the budget was bigger. It really shows because the Capital is shown in greater detail than previously, enabling us to see the contrast between it and District 12. Special effects are more interesting, and costumes are poignant and beautiful. Nothing looks cheap or bad.\r The depiction of Panem being an unhappy to live in, except those in the capital, isn't featured as much in this movie. Instead we see people rising up again the 'peacekeepers' who come down like a hammer. I was definitely convinced these guys don't mess around and brutally suppress resistance. That said you certainly feel for these people and understand their plight.\r Though this is an eventful movie I perceived it's story to be too rushed. I haven't read the book but as a film it jumps from scene to scene where one minute Katniss and Peeta are on a train, then addressing a village, then on a train again, then suddenly back in District 12. It's too disjointed which prevents complete immersion into it's world. I understand this is representative of their experience but it doesn't change my perception of this rushed story.\r One the better films in 2013 with some stand out moments which will leave you somewhat excited for part 3."}, {"rating": "9", "text": "Great improvement from the first Hunger Games, story in much more complex and interesting, more creative action scenes and truly breathtaking ending makes Catching Fire one of the best book adaptations!"}, {"rating": "8", "text": "It is a good movie ssccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccccc"}, {"rating": "9", "text": "A lot of hype was set for this movie and for a great cause. The movie is a big improvement from the first movie, so if your worried for any shaky cams. don't worry you won't be seeing any of those in this movie. The acting of Jennifer Lawrence is again superb in this new installment of the trilogy, the supporting cast also does a terrific job at their roles. It does take some time until the games start because the hunger games is not the main focus of the movie, its the revolution that Katniss has started from the first movie. I like that about this movie but the movie got a bit dragging when it was in the middle of the games, because there were parts of the movie that should have been removed, the revolution was really cool but the hunger games part, was a bit dragged out. I still enjoyed the movie and I'm really excited for the next installment. The Hunger Games: Catching Fire gets a 9/10"}, {"rating": "9", "text": "Being an avid reader and both a movie lover, watching The Hunger Games: Catching Fire, was truly a satisfying experience. One of the pros to the film are that the actors display a wide range of emotion, especially Jennifer Lawrence. Usual actors will do their part, but Catching Fire's notable characters display deep and emotional realistic presence. The issue between Katniss and Peeta's growth remains a question, as like many movies these days, lack the ability to develop a relationship believably. Perhaps its the fact that the book is in first person, while the movie cannot delve into Katniss' feelings orally. Despite this minor flaw, Catching Fire provides a long, but durable and enjoyable experience with action, emotion, and convincingly acted scenes."}, {"rating": "10", "text": "people have to score these kind of things on its own way, i mean don't say the book was better than the movie blah blah each thing have to be different bc it'd make no sense seeing  the same thing. so.. incredible movie."}, {"rating": "8", "text": "The best dystopian fiction holds a mirror up to our own society, extrapolating current trends to extreme endpoints. Here, in a grim future America, the gaudy citizens of the Capital lead lives of leisure amid the glittering spires of their neo-classical metropolis while the Appalachian miners of District 12 carve a meagre living straight out of the Great Depression. Every year, they are forced to participate in their oppressors’ sadistic version reality TV (with brilliantly over the top X-factor style commentary): the titular Hunger Games, an annual gladiatorial combat between children, in which the sole survivor emerges as victor.\r The face of the revolution is the teenage Katniss (Oscar winner Jennifer Lawrence) whose strong performance drives a film which is otherwise far from subtle. Yet there’s no doubt that this film is thoroughly exciting and engaging. For a start, the young actors here are miles better than the cast of the cheesy ‘80s slasher flicks I’ve been watching lately.\r The visuals are fantastic and the cast is rounded out with both old and new blood, including Wood Harrelson as Katniss’ grizzled mentor, and Patrick Seymour Hoffman as the smooth talking new games master. Donald Sutherland returns as the villainous President Snow, his soft spoken exterior belying the brutal stranglehold he maintains on the populace.\r One year after Katniss and her fellow ‘tribute’ Peeta (Josh Hutcherson) won the last Hunger Games, the president decrees that this year’s competitors will be drawn from the existing pool of victors (who believed they had earned their freedom); as if to deny that the games are anything more than a ritual execution.\r So Katniss and Peeta must head back into the arena for a second round, facing twenty five years worth of combatants who’ve murdered their way out once already. While more time is devoted to the Games social impact and the brewing rebellion, there is a feeling that Catching Fire treads familiar ground. Much of the thematic material held true for the first film, and this instalment is little more than a continuation of the narrative. The biggest difference is that the battle is between veterans and not children.\r Gary Ross hands the directorial reigns to Francis Lawrence, whose back catalogue, including Constantine (2005) and I am Legend (2007) suggests a darker sequel, though Lawrence inherits much of the design and atmosphere directly from his predecessor. This is ultimately delivered, yet we are treated to the inevitably unsatisfying cliff hanger as the narrative heads towards its presumably epic conclusion in next year’s Mockingjay.\r The weakest part of the story is the attempted love triangle between Katniss, Peeta and Gale which started in the last film. It pales in comparison to the wider struggle of the story and is perhaps wisely downplayed. Gale (Liam Hemsworth, who somehow has third billing) is a childhood friend of Katniss, but feels like a redundant character, appearing in very few scenes to give the TV a jealous glance whenever he sees Peeta, who has infinitely more screen time, but says and does less than he did in the last film.\r The new police uniforms, a departure from the more standard half-visors seen in the first film, are a little too much like Star Wars storm troopers crossed with The Stig, and look downright bizarre when worn without a helmet. This undermines some of the intensity of the new police chief of District 12, who is otherwise brutal and intimidating.\r As far as run time is concerned, so many of these epic fantasy novel adaptations are a little on the long side. At 146 minutes, Catching Fire is only quarter of an hour shorter than the somewhat bloated The Hobbit: The Desolation of Smaug, the other film I saw this week. How much of a problem this becomes depends on your investment in the source material. I’ve not read any of the novels, so as a casual viewer, this felt a lot longer than The Hobbit, but I can imagine a lot of people feeling the opposite. That’s fine, but it can alienate those on the periphery of the fan base.\r Alternatively, while I felt that some of the Harry Potter films had the potential to flash past in a series of semi-confusing vignettes for anyone unfamiliar with the books, I never felt lost in the narrative of this film, or the one that preceded it."}, {"rating": "7", "text": "Overall it was a good movie...BUT, the ending was disappointing. I feel like it ended the movie while it still had some way to go. It's like you're talking in a conversation, and you end your conversation in the middle of it. It's just another moneymaker."}, {"rating": "10", "text": "To put it simply this film is amazing. It's thrilling, captivating and unexpected at every turn. Despite it's impressive length as I sensed the ending coming I wished it wouldn't, and that's some of the highest praise I can give a movie. Whether it be the stunning visuals the perfectly suiting soundtrack or the fantastic story there's something here for everyone. The story is as touching and heartfelt as it is exciting and brutally true to the world it's set in. Jennifer Lawrence and Josh Hutcherson have great chemistry, elevating the story immeasurable lengths and the rest of the cast have outstanding performances Elizabeth Banks and Woody Harrelson to name but a few. A must see for everyone"}, {"rating": "9", "text": "The first movie was entertaining, but not a movie I'd want to see a second time. Some of the stuff, like Prim's name getting chosen was something we'd heard a thousand times. This movie is head and shoulders better; so many more surprises, better special effects, and at the ending, I couldn't stop smiling. (Not the ending right before the credits.) The point is, Catching Fire is an awesome film."}, {"rating": "8", "text": "This movie actually exceeded my expectations, in the sense that it was well thought out, and debatably better than its predecessor.  The effects were enhancing, and the storyline was easy to follow, yet the movie kept viewers engaged.  I vicariously felt the pain characters had experienced with all of the obstacles thrust above them.  This adaptation of the beloved teenage novel is a cut above the rest."}, {"rating": "7", "text": "Catching Fire takes what was wrong with the first film, and learns from it. This is the first true Hunger Games adaptation that captures the chaos of the games in full effect. Catching Fire's film direction and devotion to staying true in story, makes me wish the first film was redone in this manner. Jennifer Lawrence and cast improve on their performances, and I am pleased to inform everyone that the camera-shake monster isn't in Catching Fire. Thank freaking God!"}, {"rating": "7", "text": "If the ultimate goal was to entertain then catching fire accomplished then and the proceeded to exceed expectations. However In doing so I feel as a fan my intelligence was insulted. The cliffhanger  if you want to call it that, I call it more of a ball buster) was the equivalence of driving a Ferrari on a race track and slamming on the breaks due to a squirrel crossing on the track. Great movie and because of that I'm planning on watching the 3rd one. I don't enjoy having my face slammed against the windshield when I was going to stop the car anyways."}, {"rating": "8", "text": "Much better than its predecessor, The Hunger Games: Catching Fire kept me involved throughout. As a fan of the books, there were no omissions or additions to the movie that I couldn't ignore or overlook. I found Josh Hutcherson particularly  charming and believable as Peeta with Tucci, and Kravitz capturing Flickerman and Cinna perfectly, but Lawrence and Hemsworth both failed to convince me that they were anyone except themselves. Lawrence didn't even really seem to be trying or want to be on set most of the time."}, {"rating": "8", "text": "Surprisingly great, 'Catching Fire' was much darker and appeals to a wider crowd than its previous, preteen formatted prequel. It offers much more than what disappointed viewers of the 'Hunger Games' might expect. I could rank it among the best films of 2013."}, {"rating": "10", "text": "Seen the movie twice already. I loved it so much mainly because it lives up to the book a lot. I also enjoyed that it was three hours long, expected it to be much shorter. Anyways, the movie was AMAZING, totally worth watching!"}, {"rating": "10", "text": "Really great movie, quite faithful to the book. (which, might I add, we don't get very often). Keeping in mind, that not everything written can be shown. I really enjoyed it. The movie had some really emotional scenes, but I'm not going to spoil it for you. Great acting, stunning SFX and overall a great movie. I now anxiously await the next part  Mockingjay.I recommend this movie to everyone."}, {"rating": "10", "text": "JUST FOR BRAZILIANS:\r \"Em Chamas\" consegue ser uma ótima adaptação cinematográfica, sendo bem fiel a obra escrita por Suzanne Collins e superando longa-metragens de outras sagas, tais como Harry Potter e Percy Jackson e os Olimpianos."}, {"rating": "9", "text": "Con un final que te deja con ganas de más \"Juegos del hambre en llamas\" logra superar a su predecesora, lo único que se siente flojo o un poco forzado es la relación entre Peeta y Katniss. No he leído el libro pero la narrativa de la película logra atraparte durante todo el film. Recomendable."}, {"rating": "10", "text": "This was another great movie in the hunger Games Series.  This second installment stayed true to the book and ended at a time the audience was like, \"What?  Don't end it now!\".  I do wish they went a little further since they still have so much material to work with for the third book.  I will be adding this DVD to my collection when it comes out.  Well done acting, costumes and script.  It would be difficult to step it up from the last movie, but everyone did!  You must see!"}, {"rating": "9", "text": "The first installment of this series was just kind of on par. Catching Fire takes that same premise of the first film and vastly improves it. It really was the first movie with a stronger plot. Jennifer Lawrence does a good job as usual, but Josh Hutcherson really drives it home. A very surprising performance enhancement by Elizabeth Banks, her character actually had emotions this time around and they got to me, Their was one scene with birds, you will know what I'm talking about, that genuinely terrified me when no mainstream horror movie can.\rIn conclusion: if you liked the first one, Catching Fire is that but better. If you didn't like the first one, wait for the sequel to come out on DVD/Blu-Ray and give it a try."}, {"rating": "8", "text": "I haven't read the books, or much abut the entire storyline. The film was enjoyable and the story was slightly predicable. But it has the enjoyment factor and I am looking forward to the next one!"}, {"rating": "9", "text": "This was an amazing movie. period. The end will make you want to punch the person beside you because of frustration but overall its an amazing experience, its as if just as you get into it. it ends."}, {"rating": "8", "text": "I love the Hunger Games books, so when the first film came out, I was very sceptical about it. I thought it was going to be trash and untrue to the books. And while it still lacked some core elements, it was still amazing and this film is no exception. At the heart of it is Jennifer Laurence's preformance as Catniss which is refined from the first film, therefore being more believable and more realistic. In fact every actor in the film shows just how talented they really are. Sometimes it's hard to notice dew to Laurence's top notch acting. The directing is also on par with this. The camera takes shots from very unique and interesting angles, which also makes the action feel more brutal and organic. The story is complex, and touches on problems with real life politics. There's one HUGE problem with the film... Throughout the film I asked myself  Am I watching the Hunger Games one?\" My ticket said Hunger Games Catching Fire. So why did I think this? Because they took the story of the original and copy and pasted it onto this! The fundamental point of a sequel is to improve not to copy! Despite this I still love the film and I recommend to everyone."}, {"rating": "9", "text": "This movie had some serious action, plot twists but an anticlimactic closing which has left me excited for the next installment of the series. Let the true fun...begin!"}, {"rating": "8", "text": "Much better than its predecessor, The Hunger Games: Catching Fire kept me involved throughout. As a fan of the books, there were no omissions or additions to the movie that I couldn't ignore or overlook. I found Josh Hutcherson particularly charming and believable as Peeta with Tucci, and Kravitz capturing Flickerman and Cinna perfectly, but Lawrence and Hemsworth both failed to convince me that they were anyone except themselves. Lawrence didn't even really seem to be trying or want to be on set most of the time."}, {"rating": "8", "text": "The movie was not as good as the trailer and it isnt better than the first one. I highly recommend it to the people who have read the books, they´ll enjoy it and will be eager to watch the next one. As for those who have not i think they´ll be highly entertained but will find it awkward in the end."}, {"rating": "8", "text": "Catching Fire is a perfect follow up to the original, and offers great creative direction and depth in themes that keeps it going. Definitely worth the watch."}, {"rating": "8", "text": "Brilliant movie, a great sequel even better than the first Hunger Games, very entertaining and with solid acting across the board. If you liked the first movie you will love this."}, {"rating": "8", "text": "The movie leaves gaps of the book out in places. That being said, the construct of the film does much more to move the plot forward and give legs to the central plot of being under the government's boot than the first in the series. The film is less sluggish than the first, but without Jennifer Lawrence and Woody Harrelson offers little in the way of acting."}, {"rating": "10", "text": "Amazing! Best movie I have seen all year, from the first 10 minutes of the movie I was already holding my seat and knew it was going to be a good movie. I didn't really enjoy the first Hunger games but this was better than anything i could have expected! If you haven't't seen it I cant recommend it enough!"}, {"rating": "10", "text": "This movie just awesome. The cast so natural,the animation and the setting so stunning,the plot is exactly like the book. This is the best movie of the year. The story is like really happen in the past... Awesome. Jennifer is a talented cast. Congrats for all the catching fire team"}], "recommendations": ["fantastic_beasts_the_crimes_of_grindelwald", "the_hunger_games", "avengers_age_of_ultron", "alita_battle_angel", "the_hunger_games_mockingjay_part_2", "inception", "harry_potter_and_the_chamber_of_secrets", "harry_potter_and_the_goblet_of_fire", "inferno", "looper", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "the_hobbit_an_unexpected_journey", "maze_runner_the_scorch_trials", "the_13th_warrior", "odd_thomas", "eternals", "glass", "maze_runner_the_death_cure", "ready_player_one", "the_prestige", "doctor_strange", "tomorrowland", "tenet", "black_widow", "creed_ii"]}