{
  "id": 57,
  "title": "The Unholy",
  "starring": [
    "Jeffrey Dean Morgan",
    "Cricket Brown"
  ],
  "runtime": 99,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "Alice is young hearing-impaired girl who, after a supposed visitation from the Virgin Mary, is inexplicably able to hear, speak and heal the sick. As word spreads and people from near and far flock to witness her miracles, a disgraced journalist hoping to revive his career visits the small New England town to investigate. When terrifying events begin to happen all around, he starts to question if these phenomena are the works of the Virgin Mary or something much more sinister.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bShgiEQoPnWdw4LBrYT5u18JF34.jpg",
  "categories": {
    "plot": 2.6,
    "acting": 3.4444444444444446,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "The Unholy is an awkward film that ultimately tries to leave the viewer with a positive message but not even a positive message can make this a good film. The horror film is centered exclusively around jump scares and with that exception has zero horror. The writing holds the viewer's hand in an already simple plot. A lot of the rules established in the film are broken even minutes after being created. Despite how fast-paced the movie seems, it still feels like it's dragging on at times. In the end, you are left with two messages: one about truth and one about faith. Both messages feel unearned and almost slapped together. The real shame is that the film does seem like it could be saved. In fact, without any reshoots and just some simple editing choices, I feel this movie could've been a lot better (and even saved some money on some horrid CGI). If you are a horror fan aching for some new horror - I would skip. If you are a film fan I would definitely skip it. Finally, there are some visuals in this film (early and in the very end) that make absolutely zero sense and almost like they were purposely there for a trailer."
    },
    {
      "rating": "3",
      "text": "If you've seen a healthy amount of horror movies, you've already been here many times before."
    },
    {
      "rating": "0",
      "text": "Nothing new here, I don't like that........................................."
    },
    {
      "rating": "4",
      "text": "Quizás el tráiler revela demasiado, así que recomiendo que no lo veáis, a pesar de llevar un gran spoiler encima, todo por el tráiler, que te fastidia un poco el desarrollo del argumento, es verdad que como se va construyendo lentamente la trama, los personajes y la esencia de la película, se te puede olvidar, pero cuando da el girito la película, te vuelve a la mente y no te sorprenda.La premisa, y el tema en general, es poco original, por muy bien construido que esté, atrae poco, pero lo resuelven bien, eso es verdad, aunque quizás todo está demasiado apurado e impreciso.Es una peli normalilla, la verdad, no te va a cambiar nada, y quizás las cosas malas que tiene restan más que suman las buenas, no dice mucho, tiene algún sustillo medianamente bueno, alguna que es malísimo e innecesario, y sobre todo la parte del final va decayendo mucho toda la construcción, sin duda es lo peor, aún así, creo que logra una buena narrativa y construye bien a algunos personajes.Quizás peca un poco de eso, de exagerada y de típica."
    },
    {
      "rating": "2",
      "text": "Menuda estupidez es esta película, los primeros 45 minutos son tan aburridos como predecibles y clichés, los pocos sustos se limitan a los típicos jumpscares de siempre y la historia tiene un pésimo desarrollo, actuaciones regulares y los efectos especiales dan vergüenza."
    },
    {
      "rating": "9",
      "text": "The unholy is an entertaining film that provides a gloomy and gloomy atmosphere for the viewer, it has a good cast and an acceptable script"
    },
    {
      "rating": "2",
      "text": "it's a bad movie, it has a poor screenplay, mediocre visual effects, weird paced, and it is so predictable, i wanted to leave while i was watching it on the theatres."
    },
    {
      "rating": "9",
      "text": "Movie is fast paced, the actors played the characters very well and while the script had me rolling my eyes a couple times it’s still less cringy than any other new spiritual movie in the last couple of years. I would definitely rewatch this"
    },
    {
      "rating": "10",
      "text": "Good and very entertaining movie, some nice jumpscares, and I would deffinetly recommend it."
    },
    {
      "rating": "7",
      "text": "I enjoy these kind of movies, though it is not adding anything substantially new."
    },
    {
      "rating": "5",
      "text": "Boring, predictable horror film, with twists and turns that you can literally see a mile away.  The only redeeming factor is Jeffrey Dean Morgan, whose swagger elevate this average horror film. Too bad, I was really looking forward to this. A disappointment."
    },
    {
      "rating": "5",
      "text": "While there were some good aspects in the movie and it wasn't like it was boring, I did feel that it was pretty average in the end and without much to it."
    },
    {
      "rating": "7",
      "text": "The Unholy was a really creepy and scary movie, one of my favorite movies of the year. The performances from Jeffrey Dean Morgan, Cricket Brown, Marina Mazepa, William Sadler, and Katie Aselton were excellent. The visual effects were awesome, so cool and creepy. The makeup and hairstyling was outstanding especially the Mary Elnor makeup on Marina Mazepa. Overall a pretty enjoyable movie."
    },
    {
      "rating": "1",
      "text": "If you are even considering seeing the Unholy, whether you are using Amazon, YouTube or even an illegal stream, all I can say is save your time.  This movie is the most disappointing horror movie in recent memory, given how good the trailers looked.  I don't know how, but Screen Gems managed to take a decent concept, good actors and a pre-existing amount of hype and make that into 99 agonizing minutes of boring, suspenseless \"horror\".  Let's start off with what this movie does well: The concept and the setting.  The idea of a demon pretending to be the Virgin Mary, and using that as a way into a young girl is great, and the creepy setting of a small New England town suits the film well.  Unfortunately, that is where the list of positives ends.  The characters range from unlikeable to borderline cartoon villains (William Sadler's \"Father Hagan\"), and the atmosphere of the movie is far more boring than creepy, featuring the usual run of overused scenes like the characters being in a creepy church basement or a rural farm house.  Overall, the unlikable, poorly written and developed characters, and absolute butchering of the concept makes the Unholy an overall regrettable experience.  The trailer reveals way too much.  Going into the movies, there is the feeling that there is supposed to be a sense of mystery, but all along it is blatantly that it is a demon, not Mary, and that all the people with Alice Saves t-shirts coming to her for help are both in trouble and hailing a demon.  The demon itself looks awful, putting all former CGI demons to shame.  Ultimately, the best way I could describe the demon is looking like Vigil from Rainbow Six Siege.  With no suspense, no real scares beyond the occasional jump scares, and characters that you find hard to root for or care about, The Unholy is a disappointing experience that doesn't leave me wanting more, it leaves me wanting my time and $4.99 back."
    },
    {
      "rating": "6",
      "text": "Interesante película para pasar el rato, al principio parece un bolazo pero transcurrido los minutos va tomando forma la misma."
    },
    {
      "rating": "7",
      "text": "Deaf/mute girl is now speaking and healing the sick on behalf of the virgin Mary but, is actually doing the work of a witch executed years ago who was trapped in some sort of crop doll."
    },
    {
      "rating": "1",
      "text": "Bad Script, performance unconvincing, poor character development. I want my time back."
    },
    {
      "rating": "7",
      "text": "La verdad no me la Vi. Estoy viendo cómo piratear eso. Algún gringo por aquí que me dijo como monda hago eso?"
    },
    {
      "rating": "1",
      "text": "It's just not very good, simply putIf I had to summarize: It feels like every other dry, awkward horror movie.. It's just not worth your time. If you want a good film I'd recommend Hereditary"
    }
  ],
  "recommendations": [
    "dark_skies",
    "antlers",
    "annabelle",
    "the_possession",
    "insidious_chapter_2",
    "insidious_chapter_3",
    "the_woman_in_black",
    "the_conjuring_the_devil_made_me_do_it",
    "you_should_have_left",
    "the_ritual",
    "ouija_origin_of_evil",
    "the_possession_of_hannah_grace",
    "the_curse_of_la_llorona",
    "the_eye",
    "sinister_2",
    "dead_silence",
    "mama",
    "house_at_the_end_of_the_street",
    "chernobyl_diaries",
    "annabelle_comes_home",
    "it",
    "the_haunting_in_connecticut_2_ghosts_of_georgia",
    "shut_in",
    "the_boy",
    "it_follows"
  ]
}