{
  "id": 3859,
  "title": "The Three Musketeers",
  "starring": [
    "Logan Lerman",
    "Milla Jovovich"
  ],
  "runtime": 110,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "The hot-headed young D'Artagnan along with three former legendary but now down on their luck Musketeers must unite and defeat a beautiful double agent and her villainous employer from seizing the French throne and engulfing Europe in war.",
  "releaseYear": "2011",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/woCADkkDIIKrOMEokbFOEsAYtUa.jpg",
  "categories": {
    "plot": 5.555555555555555,
    "acting": 5.970588235294118,
    "ending": 6.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.666666666666667,
    "funny": 7.2,
    "action": 5.5
  },
  "reviews": [
    {
      "rating": "7",
      "text": "It's really not as bad as some are concluding. It's actually quite fun if you suspend association with the Dumas classic and imagine dipping into Terry Gilliam territory, with its exotic airships and a crazy ride loaded with swashbuckling action, including a terrific final duel on top of a Parisian cathedral."
    },
    {
      "rating": "7",
      "text": "It's entertaining but not that great and also it has references to modern songs like \"boys will be boys\" and not very realistic historical references"
    },
    {
      "rating": "8",
      "text": "A very enjoyable, if somewhat flawed action movie from director Paul W.S. Anderson of the Resident Evil series. Much like the Resident Evil series the action is bombastic and fun. The plot is interesting and the characters are likable. I really wasn't expecting much from this movie but it really surprised me. Just like some of my favorite action movies it also includes healthy doses of comedy mixed in. All in all I was very impressed with The Three Musketeers and don't have much to complain about except for its slow start."
    },
    {
      "rating": "8",
      "text": "Ah, come now all you reviewers who low scored this movie.  M. Dumas would only have recognized the skeleton of his story but there was a lot to like, and even admire.  Christoph Waltz was wonderful as Richelieu, Orlando Bloom surprisingly grown up, Ray Stevenson horribly underused, Matthew McFayden  almost did a great job and the special effects were superb.  The horse was lovely and the derring-do prettily done.  The only really sour notes were the casting of some callow American kid as D'Artagnan ( please!) and this introduction of a bumbling manservant who's 'funnies' were just out of place."
    },
    {
      "rating": "7",
      "text": "This was a fairly decent action movie, the cast was pretty ok and the overall story holds together. Granted some of the action scenes were pretty ridiculous and there were some plot holes. All in all it was an ok movie to see on a DVD however I am glad I didn't go to the cinema to see that one. Just to recap, as an action movie it's not that bad, go rent it if you enjoy simple action and a lot of combat in your movies."
    },
    {
      "rating": "8",
      "text": "im nust seeing this moviea couple week agoo..i think this movie much funny and amusing..but need more action scene..the character on thos movie are unique..each character has a different background.."
    },
    {
      "rating": "8",
      "text": "The movie is ok. Of course it's not for aesthetes who enjoy the smell of their own farts. But it's fun. Not 10 fun, may be, but definitely 8. Don't believe anything bad about this movie."
    },
    {
      "rating": "10",
      "text": "I was really dissapointed that this got a bad response :( I thought it was great!! The actors were awesome, and Porthos had a great scrips :) it was well funny with a bit of non traditional humour. The effects and ideas were brill, and i enjoy seeing another groups take on one of the classic tales. It really annoys me when all those people go to all that work for years sometimes, and get nothing but bad critisism for their hard work.Therefor, i applaude you. Thanks for a great film!"
    },
    {
      "rating": "8",
      "text": "This movie is great. The sword fighting is entertaining.I love the air ships,and for heavens sake.What the heck is everyone complaining about This is a great movie not a bad. Seriously what do people hate about this movie."
    },
    {
      "rating": "9",
      "text": "If you want over-the-top entertainment that doesn't respect the laws of physics, you can't do much better than this.\r Watch this movie here for free http://www.watchfree.to/watch-25b1b3-The-Three-Musketeers-movie-online-free-putlocker.html"
    },
    {
      "rating": "10",
      "text": "I can not understand how this movie can get negative or moderate reviews. This is one of the best movies ever made. The movie has everything that you expect from a 1A movie and more, world class actors who create deep characters with spirit, storyline, action, humour, heroism, charisma and much more... Alone the acting of the French king speaks for itself. I have never seen that in a different movie. The ratings and critics for this movie are the best example of an underrated outstanding movie."
    },
    {
      "rating": "10",
      "text": "I dont know why this movie has such low ratings. I liked it, if you are expecting something from this movie like following the classical Three Musketeers then you shouldnt watch this. But if you want some entertainment you should watch this movie."
    },
    {
      "rating": "3",
      "text": "It's a movie you want to skip.The story is shallow and plain boring. They succeed in making the characters unique though, but none stands out, some are even ridiculous. Plot-changes are present, but never realy shock you. Avoid if possible, unless your dvd-player broke and you've seen all other movies in the cinema."
    },
    {
      "rating": "2",
      "text": "Skip-it - At first I was wondering if the marketers at Summit Entertainment were purposely not mentioning Orlando Bloom, Milla Jovovich, and Christoph Waltz's names in the trailer because they were no longer box office attracting names (which was shocking to me), but now I presume those three stars did everything they could to disassociate themselves from this god-awful re-telling of Alexandre Dumas' classic action-adventure tale."
    },
    {
      "rating": "10",
      "text": "Although the film was very negatively received by many critics, I'd definitely have to disagree. It was action-packed, fast-paced, kept you on the edge of your seat, and thrilling. I think the real reason that it isn't getting great box office numbers, is the lack of marketing, not the lack of storylines or acting abilities. Orlando Bloom and Milla Jovich delivered a solid performance, as expected, but the real star for me was Logan Lerman. AMAZING. I am a fan of his of course, but still, he blew me away with his portrayal of d'Artagan. Overall, great movie definitely worth seeing!"
    },
    {
      "rating": "10",
      "text": "The Three Musketeers 3D: Fantastic, funny, entertaining, new ideas, really cool looking fights, great cast, and great 3D for all the palace interiors. You do not have to go there to visit the palace; you are there back in time. Again, good idea for the entire film to be in 3D. I am waiting for a Sequel. If you do not like it go and see a horror movie with your kidsâ"
    },
    {
      "rating": "10",
      "text": "i think this movie's rather interesting, 'cause it didn't use the old-fashioned ideas. this movie's full with creativity and imagination. i love it."
    },
    {
      "rating": "4",
      "text": "Non serious adaptation of the classic three musketeers tale as if the only goal of the movie is to fully exploit 3D effects. Acting  is just to cash, over-exagerated personal fight power and intelligence  of the three musketeers, under-estimation of the enemies as if they are dummies. Characters are drawn as if it is a satiric or kiddy movie. Anyhow, perfect 3D, that 's the only entertainment, and it is worth it."
    },
    {
      "rating": "1",
      "text": "Decepcionante pelicula, todo es demasiado rocambolesco y poco creible. Las actuaciones pobres asi como su guion en general. Una pelicula mala muy mala sin ningun tipo de arte. ESTO NO ES CINE1/10"
    },
    {
      "rating": "0",
      "text": "This film stinks worse than the Three Musketeers bar I dropped in my toilet this morning!  They should have titled it â"
    },
    {
      "rating": "5",
      "text": "The famous, familiar saying of â"
    },
    {
      "rating": "6",
      "text": "The Three Musketeers is slightly above average. I saw the 2-D version and figure that the 3-D version would have been worth it for the fights and some of the creative shots. The special effects and the few \"big name\" actors were really what helped this movie pass. The execution of the plot was fairly mechanical, and whatever love story there was really felt just kind of tacked on for standard stakes raising purposes. That said, this movie has one of the most spectacular (though not too dramatic) impaling scenes I've seen yet. And what happened after the false ending is pretty reminiscent of what happened after Paul and Mila's 3-D adventure from last year. Just wait for rental if all you care to see is the 2-D version."
    },
    {
      "rating": "8",
      "text": "Ok so the storyline of this movie was very mediocre the writer sucked,but if you dont look at the whole picture more toward the action and the actors it becomes pretty awesome. Logan Lermans lover on the movie had no personality whatsoever  but besides that its an enjoyable night out!"
    },
    {
      "rating": "5",
      "text": "The actors are all into their characters and they do a fine job throughout.  The production values, the sets, locations, costumes are all great.  Unfortunately, the script was sub par.  I wish the story would have held my attention more.  Disappointing."
    },
    {
      "rating": "5",
      "text": "'' The Three Musketeers '' is like a weird combination of '' Pirates of the Caribbean '' and '' Sherlock Holmes '' (2009). It has that same kind of style. Everything was rubbish. The actors looked ridiculous. Logan Lerman (as D'Artagnan) doesn't looked good with long hair. I wish that Orlando Bloom was given more screen time. Yet, I didn't really cared about his character. At one point, I completely forgotten about him, until he showed up again. Milla Jovovich's character (Milady de Winter) was annoying. This is a very average movie in my opinion, because there are a lot of bad and good elements. There's almost no boring parts whatsoever. None-stop action, epic sword fights, great escapes. I though that the boats in the air were cool. But the dialogue is mediocre, the characters were disappointing, the story is cliche. I don't feel giving this movie a higher rating just because of the action. In general, it's actually an enjoyable movie, if you ignore the bad aspects that I mentioned. It depends how you visualise the film."
    },
    {
      "rating": "2",
      "text": "Another Three Musketeers movie.  The producers were having a brainstorming session one day and one of them jokingly said, â"
    },
    {
      "rating": "0",
      "text": "This Movie was so bad, that now, while i'm trying to write a review for it, I cannot for the life of me, remember one single moment of the movie, it's plot or it's action sequences. Was it a comedy? was it an action movie? was there even drama? Fail...."
    },
    {
      "rating": "6",
      "text": "Some of the visual  effects are very pretty, but everything about this movie is otherwise a little \"meh-\".  Actors and acting just a bit off,dialogue a little tedious, story treatment a bit lame. This is a classic example of a movie that could have been great, but chose a gentleman's C."
    },
    {
      "rating": "3",
      "text": "Oh dear how could they ruin the classic story like this... Airships with multi-cannons? seriously? this film could have been pretty decent but they filled it with too much frills and steam-punk nonsense that the story just evaporated to nothing. This is exactly how I'd expect a chav to view a classic book."
    },
    {
      "rating": "3",
      "text": "What do you get when you get decent actors and an awful script, along with a mediocre director who doesn't even need to direct these kind of movies?This flop."
    },
    {
      "rating": "5",
      "text": "Paul W. S. Anderson's adaption of The Three Musketeers may amuse u with the Views of France and Effects but with a worst script it will wast ur time as well. Anderson's Direction was good in those fight scenes but there was so many things he could have done. The story didn't have  much Musketeers going on and it was covered with some ridiculous characters  and theirs silly behaviors .. Matthew Macfadyen. Ray Stevenson and Luke Evans was good but Matthew seemed a bit of . Logan Lerman did better then i thought as D'Artagnan but there were more actors who could be a lot better. Milla Jovovich was not best for her role but she did good & as well as Bloom. The king & Queen part was the wost . overall The Three Musketeers is a very weak movie with some great views and Sword Fighting .[Started with a score of 70% ,Midway was 50 and ended with a score of 15 [in the scale of 100]"
    },
    {
      "rating": "6",
      "text": "The Three Musketeers is a good movie that brings a good story to see the simple fact of bringing good actors and actors who are beginning to be recognized now that is Logan Lerman. The only bad detail are some action scenes that are bad planned"
    },
    {
      "rating": "2",
      "text": "It is Sherlock Holmes meets Pirates of the Caribbean, just worse. Honestly there is very little to recommend about this film. multiple times during the film I found myself wishing it was actually either of the films it emulates so poorly. Even the star power present in the villains isn't allowed to show through, falling flat and dull time and time again. It goes without saying that your money would be better spend elsewhere."
    },
    {
      "rating": "1",
      "text": "A horrible plot that you have to watch half the movie before it even starts. The dialog is is close to awkward with short \"trying to be cool\" lines. The acting is from bad to average and you see way to little off the only good actor Mads Mikkelsen.I sat trough the whole movie just begging for it to end.DON'T waist your money to go see it!"
    },
    {
      "rating": "4",
      "text": "Disappointment to fans of the original Musketeers movie. Not the least bit enthralling. Indubitably a TV movie. Lost meaning of 'One for all and all for one'."
    },
    {
      "rating": "1",
      "text": "There are plenty of GOOD family films out there. Toy Story, Toy Story 2 and 3 are perfect examples of how movies appeal to both kids and adults. How this film was made I have no clue. You may say \"It's for kids!\" Well, the only ones who might enjoy it are babies, who don't even know what it's about anyways. For the kids who like it, great, but the kids I was babysitting  for (ages 5, 9) hated it. If you go to see it, bring a book and a flash light and hide in the corner so you can read, or bring a blanket and sleep. Or don't go see it at all. D-"
    },
    {
      "rating": "0",
      "text": "There are very few movies I have considered walking out on, this was one of them. If you muted the movie it would be a huge improvement. In fact you could probably play the sound from the previous 3 Musketeers movie and it would work out even better. I'm pretty sure the \"writers\" made this movies purely by copy pastng lines from other movies... what a beating, orlando bloom needs to stick to his pointy ears."
    },
    {
      "rating": "10",
      "text": "This film is just terrible. Jesus why they made this................................."
    },
    {
      "rating": "2",
      "text": "With a main protagonist that is as irritating to watch as the main \"story\" in the movie makes this a movie that will irritate you in to a blistering headache. Its 1 hour 40 minutes of eyecandy with lots of \"kung-fu\" stunts, exploding, shooting and no context. Even if i did enjoy the characters of the Three musketeers in this movie and i thought the costume design and enviornments were outstanding, that does not help this movie from beeing a total trainwreck. Made for an american audience or prepubesant teenagers that are easily distracted by veluptous women and loud explosions."
    },
    {
      "rating": "0",
      "text": "This film stinks.  Typical Hollywood lack of imagination, lack of grasp on the wonderful English language, waste of talent and stupid, childish ideas and effects.  I wouldn't wipe my bum with it."
    },
    {
      "rating": "5",
      "text": "I was looking forward to this movie however I thought it was a mediocre version of the 1993 version. I was mildly entertained. It lacked humor.  The action was ok the visuals were very good although a little to computerized for my taste."
    },
    {
      "rating": "1",
      "text": "That's food to pig ! With a poor and totally unhistorical story, a bad actors game and a lot of dumb stuff like \"balloons fighting in the sky\" or failings special effects. Don't loose your time in watching it."
    },
    {
      "rating": "5",
      "text": "Given that there are multiple prior versions to this film, on the plus side I can say that the set design, wardrobe, special effects and choreography are all fair improvements. The casting was excellent as well except for the lead playing D'Artagnan whose bravado fell short of the target alongside his acting chops, or lack thereof. On the down side - stealing lines from several other films that include The Princess Bride as well as Disney's version (with Chris O'Donnell) of The Three Musketeers doesn't help the poorly scripted dialogue. Fortunately for the writers, the remaining strong cast of actors/actresses manage to make up for the lack of creativity and eloquence. Another negative is the lack of artistic liberty taken from the original story as well as the acceptable, but boring and antiquated soundtrack. Never the less I feel that this movie definitely deserves a look for those who enjoy films with swordplay and/or quasi-fictional period pieces."
    },
    {
      "rating": "2",
      "text": "This movie? Well, let's say there was only ONE scene I liked the most. The rest was bunch of stories, characters, plots, flying ships and sword fighting that really, REALLY gets you dizzy and makes you skip the movie to its crappy end. I really went with too much expectations for this movie, and that's an error I did. This movie truly sucks."
    },
    {
      "rating": "5",
      "text": "I had high hopes from it. Apart from a few funny scenes, the movie fell apart. The plot was extremely ridiculous. Very disappointing. They chose to go for cheap gimmickry instead of real substance. The CGI alone couldn't hold the movie together."
    },
    {
      "rating": "6",
      "text": "The Three Musketeers was a good bit of fun. I thought the movie had plenty of moments in which we can be thrilled by the action scenes and it had some very good uses of 3D. It is unusual and despite following the original story, it had a unique sense to it (With the plot changes etc.) Some moments felt quite rushed and unrealistic and it didn't deliver as well as the classic Musketeers movie, but nevertheless it is quite enjoyable."
    },
    {
      "rating": "5",
      "text": "\"The Three Musketeers\" are one of the fiction books most adapted to cinema. This is another adaptation to add to the extensive list, and it is not one of the best. As the script is known, I will not stop to analyze it. I will, however, make a word of advice that is necessary: this film is not even close to being historically credible. It is an almost complete anachronism and portrays the Musketeers and, especially, Milady, as if they were the 17th century's \"James Bond\", full of tactics and inventive gadgets for all occasions.The film is an adventure that begins in Venice, it involves a flying machine supposedly invented by Da Vinci, many creative weapons, choreographed fights, acrobatics and even climbing and gymnastics routines by women in corsets. A mixture so incredible and absurd that I was expecting to see automobiles too, and that shows how far a writer's creative freedom can reach if they don't get their feet on the ground. However, it is a fun movie and entertains the audience quite well.The cast is one of the strong points of this film. I highlight, on a positive note, the performance of Christoph Waltz, who transformed Richelieu into a skilled and manipulative politician under the garb of a pious clergyman. Milla Jovovich is also quite good as Milady, a double agent with a vast arsenal always up his sleeve. Mads Mikkelsen is very effective as a villain and looks like a fearsome opponent. The musketeers (Luke Evans, Ray Stevenson, Matthew Macfadyen) are good enough, given the rewriting of the characters in this film, but they are almost relegated to supporting characters in their own film, a mistake that is quite common in the movies adaptations of this story. Juno Temple and Freddie Fox are funny as a couple but don't have much to do. On the negative side, I didn't like Logan Lerman, I think he was a weak protagonist despite looking young and elegant, and I think Orlando Bloom, for who he is, simply received too much visibility and relevance in a story where it wasn't necessary, resulting in a tiring presence.Technically, the film is quite spectacular. Cinematography is magnificent, with excellent colors and sharpness, and the film was very well edited and handled in post-production. The CGI is impressive and if more proof was needed that there is a lot of money invested in the film it would be enough to see the choice of filming locations: it is an authentic tour through some of the most beautiful palaces in Bavaria, such as Würzburg, Marienberg, Herrenchiemsee, Schleißheim and Pommersfelden. If the beauty of these palaces is undeniable, the film was able to emphasize it. I only regret that, at times, the film seems more baroque than it should be, as if the story were being set fifty years later, in the first decades of the 18th century. The same can be said of the costumes, which nevertheless seem impressive and detailed. However, I already said that historical rigor was run over and killed in this film. The soundtrack is not surprising, assuming an appropriately epic tone without being histrionic."
    },
    {
      "rating": "10",
      "text": "Quite a lot of fun.  Excellent plot, excellent acting, excellent action, and excellent special effects.  Best Three Musketeers adaption I've seen."
    },
    {
      "rating": "8",
      "text": "The movie itself most closely resembles the original translated works by Alexandre Dumas. I liked the movie for the quirky characters french play-like acting and vibrant colored costume design. It's a great movie for teens."
    }
  ],
  "recommendations": [
    "hercules",
    "aquaman",
    "clash_of_the_titans",
    "bloodshot",
    "oz_the_great_and_powerful",
    "the_last_witch_hunter",
    "gemini_man",
    "valerian_and_the_city_of_a_thousand_planets",
    "fantastic_four",
    "avengers_age_of_ultron",
    "guardians_of_the_galaxy",
    "poseidon",
    "thor_the_dark_world",
    "pan",
    "blade_of_the_47_ronin",
    "the_suicide_squad",
    "ben_hur",
    "shazam_fury_of_the_gods",
    "gods_of_egypt",
    "jupiter_ascending",
    "the_scorpion_king",
    "the_a_team",
    "triple_frontier",
    "pacific_rim_uprising",
    "tron_legacy"
  ]
}