{
  "id": 3269,
  "title": "The Prodigy",
  "starring": [
    "Taylor Schilling",
    "Jackson Robert Scott"
  ],
  "runtime": 92,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A mother concerned about her young son's disturbing behavior thinks something supernatural may be affecting him.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yyejodyk3lWncVjVhhrEkPctY9o.jpg",
  "categories": {
    "plot": 4.428571428571429,
    "acting": 4.714285714285714,
    "ending": 3.3333333333333335,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Horror films have a unique way of having the ability to be wonderfully entertaining while tackling some very important and often sensitive topics that come to surface on a regular basis in our society. Take Jordan Peele’s Get Out as an example; the critically acclaimed and perfectly balanced cocktail of suspense, humor and social commentary about a very absurd yet very real perception in modern day America. The film drew heavily on society and the racial trials and tribulations that many ethnic groups face on a daily basis, camouflaging the blunt nature of said beast with talented filmmaking. With The Prodigy, a new horror film directed by Nicolas McCarthy, sets its aim chiefly on childhood, parenting, marriage and the idea of mental health while hitting all its targets like a blunt hammer. The film opens with credits to its distributor Orion Pictures, a nostalgic logo flashes across the screen bringing back memories of The Terminator or Wolfen from 1981, two classics that were distributed by the company; setting the tone for a film with McCarthy successfully taking classic horror film devices and applying them in a modern setting.Nicholas McCarthy’s filmography is no stranger to the supernatural, in fact all three of the feature films in his repertoire deal with supernatural material. With his career peaking and a very minimalist approach to undertaking projects and simplistic horror style, its hard to draw comparison within the world McCarthy captures on film. One thing that is for certain is that the world in his newest film The Prodigy is quite spine tingling.The Prodigy revolves around Miles (Jackson Robert Scott), a child who at first, seems to be somewhat of a mad-genius. As Miles’ behaviour begins to become more alarming, his parents Sarah and John (Taylor Schilling and Peter Mooney) begin seeking answers, going as far to believing that Miles may be a reincarnation of a soul who has unfinished business, according to the unconventional advise of Dr. Arthur Jacobson (Colm Feore). McCarthy begins turning the film from a story of a young new family into something more reminiscent of The Omen, a Richard Donner classic, a film dedicated to the idea of youthful deviance. The 1976 film is clearly a loved homage by McCarthy and most likely used as a visual example to Jackson Robert Scott during shooting of the film. While The Prodigy doesn’t stop with just The Omen as a clear homage, McCarthy’s film also pays heavy tribute to William Friedkin’s undeniable and most certainly unforgettable horror masterpiece The Exorcist. Using the year 1973 as its reference point, a valiant year in horror cinema, producing cult classics like The Wicker Man, Don’t Look Now and The Vault of Horror, the film’s title makes it quite clear just exactly what it wants to be and how much these films mean to the filmmakers involved.As cinema and the horror genre begins to evolve in 2019, one of its more interesting and affable characteristics is how it blends plaguing real-world issues into a fun, sometimes spooky yet always entertaining and devilish good time. While many horror films have had sadistic and possessed children, one of my favourite parts of The Prodigy is how it begins with the questions of mental health, learning disabilities (or extreme learning abilities in this instance), and how parents or people would deal with these things. One of the scariest aspects of The Prodigy is imagining this happening to you as a parent? How would you react? What would you do? It is no surprise that many test audiences were so scared and disturbed during the test screenings that the studio had to dilute many of the interactions between Miles and his mother, especially the sequence of scenes where a suspecting Sarah allows Miles to sleep in her bed. As she tenses up and allows her son to climb into bed with her, Miles’ hand behind slithering over her shoulder as he whines the words, “Mommy, will you always love me? No matter what I do?” I mean, come on, creepy stuff!Conclusively, The Prodigy can stand up in the supernatural, more specifically child supernatural horror movies genre with great pride and valour. A quirky sub-genre that has few bodies of work yet many of the film seem to have certainly left their mark on cinema and horror genre specifically, The Prodigy is a worthy addition to the bunch. Showing immense love to other classic films, The Prodigy uses past techniques in a modern minimalistic setting with superb effectiveness, making the film a familiar but altogether fresh and chilling choice for a film to watch at the multiplexes."
    },
    {
      "rating": "1",
      "text": "Terrible in almost every aspect. Not worth my time to explain how bad it it. Don't watch it. Shameful."
    },
    {
      "rating": "8",
      "text": "I was expecting an off-season piece of schlock, but I was pleasantly surprised. As a horror fan, I appreciated that this pretty traditional film had some interesting twists and new ideas. It was also very well acted and directed – and it was never boring, even though I have seen innumerable horror films and can easily tell the throwaways from the well-made. The cast was excellent (rising stars have to start somewhere), and the direction was very good. This film is an entertaining way to spend a few hours in the dead of winter."
    },
    {
      "rating": "2",
      "text": "Everything about this movie is awful. I can't believe I wasted my time watching this horrendous thing."
    },
    {
      "rating": "8",
      "text": "Buena película, la historia no me convenció mucho pero estuvo bien para mi y obtuve unos buenos sustos."
    },
    {
      "rating": "4",
      "text": "The Prodigy gave me some of the most hilarious unintentionally comical moments of the year thus far, and I kinda love it for that. Probably wouldn't really recommend it, though. Like, there are some genuinely fun out-there ideas here, which thankfully it embraces, I'm just not sure how self-aware the film is about its dumbness."
    },
    {
      "rating": "4",
      "text": "The movie could have been much better if there were any twists or surprises to the direction of the plot. Instead, the plot concept we are fed in the first 5 minutes of the film (think Child’s Play) is precisely what we get all the way to the end. Newborn gets possessed by serial killer’s soul, turns 8 years old and starts being a bad boy. Why this particular child is “chosen” is not explained. From early reviews and interviews with the main cast I was expecting a huge twist by the third act that made this movie stand out from others like it. Nope. Nada. Every act is painfully predictable and the story never deviates from it. Kid is possessed by serial killer and kid starts acting violent, serial killer soul eventually takes over kids mind completely, mother tries to save kid by doing dumb **** serial killer wins in the end.THERE ARE NO SURPRISES IN THE PLOT. And what we are left with is something we’ve all seen before."
    },
    {
      "rating": "4",
      "text": "While this movie does have some graphic and/or scary scenes the use of unnecessary jump-scares and sound effects ruins the fear-factor of this movie. Even though child actors are known for being sub-par, this one was actually quite good. The only problem was some of the lines that were written for him, some of the lines he had to say weren't scary coming from a kid and in fact they made me laugh."
    },
    {
      "rating": "6",
      "text": "A fine horror film that hits on just enough marks to give a mild recommendation. Overall a low 6 a B-."
    },
    {
      "rating": "8",
      "text": "A friend and I went to see this movie and we thought it was very good.  We see pretty much every scary movie that comes out, and we have seen some bad ones,  This one was a good one.  Not looking at it as a movie critic, but just as an audience member wanting to be entertained, it did just that.  We thought we had a few things predicted, but we were wrong.  If you are a fan of scary/creepy movies, you should enjoy this one."
    },
    {
      "rating": "2",
      "text": "Trope after trope after tropeDog dies, of course. Immediate boring turnoff when this happens. Another cheap copy paste"
    },
    {
      "rating": "4",
      "text": "Well made yes, but what is the point when is so hollow and boring? This one was a missed opportunity."
    },
    {
      "rating": "4",
      "text": "It's the standard, average, evil child movie, with nothing special to help it stand out unless you count the surprisingly good performance of the young actor here. However one okay performance cannot save a forgettable, and basic horror film that does nothing new or original with its worn out concept. It's an idea that has been done to death and one done much better in other movies, here though it just brings nothing new to the table."
    },
    {
      "rating": "5",
      "text": "The Prodigy is your average horror movie... Fans of the genre will love it, while others might not be as fond or captivated by the twists and sequence of events that unfold. The film more so embraces a psychological dimension rather than going down the jump scare route. What unravels from this is weird, yet entertainingly unsettling - also familiar, yet done quite admirably aside from its main, youngest star not having quite the acting chops to pull most of it off in a believable manner, hence its biggest weakness."
    },
    {
      "rating": "3",
      "text": "Predictable and sillyThe Prodigy is predictable as all Hell, over-acted and filled with jump scares. The sound was nice and loud though, just what you want in a horror film. The plot is dumb and laughable so if you're looking to laugh and make fun of a movie with some friends it's good for that."
    },
    {
      "rating": "7",
      "text": "Το «The Prodigy» παρά την πεζή εικόνα του λέει αυτό που θέλει να πει χωρίς φλυαρίες και ανούσιες σάλτσες ακόμα κι αν μερικές φορές γίνεται αφελές. Τρομάζει, σοκάρει και σε κρατάει καθηλωμένο στη μεγαλύτερη διάρκειά του. Λίγο gore παραπάνω να είχε και θα το νιώθαμε ακόμα περισσότερο. Μην περιμένετε λοιπόν κάποιο αριστούργημα αλλά μια καλή ταινία τρόμου για ποικίλα γούστα..."
    },
    {
      "rating": "3",
      "text": "This film promises the premise of a story that is somewhat different from other horror films but unfortunately ... it doesn't feel horror with a jump scare interlude that doesn't make the audience jump. And it ends with an anti-climax cliche ending that cannot satisfy the audience.In terms of acting, scoring and technical problems are not at all."
    },
    {
      "rating": "8",
      "text": "I actually enjoyed this. I thought it was a compelling story that didn't rely too much on the supernatural, cheep jump scares, or CGI. The actor who played the son was fantastic. Truly creepy and menacing."
    },
    {
      "rating": "7",
      "text": "The Prodigy is basically Child's Play but with a kid doing all the horrific actions instead of a doll. It replaces all the comedy of those movies with the horror of parents having to deal with their little possessed monster."
    },
    {
      "rating": "3",
      "text": "Ever worst than The Omen IV The Awakening. Anything is boring as hell. Acting sucks, story is ineffective, directing is pretentious, Joseph Bishara's score is another lazy Insidious entry, definitely nothing new or good here."
    },
    {
      "rating": "5",
      "text": "Hungarian farm serial killer dies before killing his last victim, so gets reincarnated as a young boy so that he can finish the job, which he does with the help of his mother driving him around."
    }
  ],
  "recommendations": [
    "ouija_origin_of_evil",
    "the_conjuring_2",
    "sinister_2",
    "scary_stories_to_tell_in_the_dark",
    "insidious_chapter_3",
    "the_babadook",
    "case_39",
    "it_follows",
    "us",
    "the_conjuring_the_devil_made_me_do_it",
    "lights_out",
    "the_conjuring",
    "the_boy",
    "annabelle_comes_home",
    "dark_skies",
    "the_ring",
    "annabelle_creation",
    "insidious_chapter_2",
    "insidious_the_last_key",
    "the_possession",
    "the_witch",
    "oculus",
    "the_curse_of_la_llorona",
    "the_collector",
    "it"
  ]
}