{
  "id": 1047,
  "title": "The Great Wall",
  "starring": [
    "Matt Damon",
    "Jing Tian"
  ],
  "runtime": 103,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "European mercenaries searching for black powder become embroiled in the defense of the Great Wall of China against a horde of monstrous creatures.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/p70dq1YxabemdZDm5K6Q8G10wSn.jpg",
  "categories": {
    "plot": 6.023809523809524,
    "acting": 5.870967741935484,
    "ending": 6.4,
    "soundtrack": 6.0,
    "cinematography": 6.285714285714286,
    "familyFriendly": 4.555555555555555,
    "funny": 6.666666666666667,
    "action": 7.166666666666667
  },
  "reviews": [
    {
      "rating": "4",
      "text": "The Great Wall may be the most beautiful piece of hokum I've ever seen. Yimou Zhnag, best known for Jet Li's Hero, nails the cinematography, costume and set design. All are excellent. But they threw 150 million and a lot of talented tech people to basically tell a \"under siege with monsters\" movie. Remember Feast (or numbers 2 or 3?)? This is the 150 million dollar ancient Chinese version. The two travelling leads banter like an eighties buddy cop movie, even though it's the year 1200 or something. Even Willem Defoe is wasted. Given the location (the Chinese scenery is again, beautiful), and time frame, think one word, monster?.....dragons? Nope. Some lizardy-dog type creatures that fail to look convincing. The \"predator-dogs\" in Predators looked better. At least it was fairly short."
    },
    {
      "rating": "3",
      "text": "If it weren't for the very good 3D Action scenes this would be a 1/2 star film. I got goosebumps of how bad the rest was. I also watched this in D-Box seats, fun at the beginning but annoying later on, definitely not worth it"
    },
    {
      "rating": "4",
      "text": "There is absolutely nothing in this film that differentiates it from any other typical action movie out there. With the cringe-worthy dialogue, awfully written story and completely bland and uninteresting characters it surprises me that it hasn't gotten a lot more hate. So despite Matt Damon's decent performance and good cinematography and special effects \"The Great Wall\" is just another stereotypical action movie snore fest."
    },
    {
      "rating": "6",
      "text": "I was surprised, I was definitely surprised.I wouldn't call The Great Wall a \"great movie\". It is a niche genre piece mixing a big of Hong Kong fighting with some fantasy type action. I was really hesitant about the movie though. A Chinese movie, set in a \"vaguely\" historical China with what I was worried would be the \"Great White Hope\". However it wasn't like that at all. In fact there was a subtle (or not so subtle) reversal of that.Instead of him saving everyone, he is saved by them. The movie portrays the greed of capitalism as bad, and the rich elite as just useless. Instead it is those who serve selflessly who are revered in the movie. Definitely Chinese politics are involved in the movie, but maybe I am not so different with my outlook that I found it an overall good message.Matt Damon is pretty good in the movie as the angry, greedy white boy from the crusades, with Pedro Pascal as his sidekick (you may know him as Oberyn Martell from Game of Thrones) who is even more greedy. They are met by one other white person, William Defoe as a very back stabbing kind of capitalist merchant as well. Matt Damon changed over the course of the movie, Pedro changed maybe a little, and Dafoe did not (and suffered for it).While those actors were as good as to be expected I absolutely loved Jing Tian (she is also starring this year in Kong: Skull Island, and Pacific Rim 2). True she didn't speak a lick of English, but she still portrayed a real badass, and had an intensity. Since I am seeing both of her other movies, I am excited to see her in those.Overall though the movie was pretty good. People complained about the CGI, but I didn't notice too much. People said it was really colorful, such as the uniforms, sadly my colorblindness means I missed that part, but I still liked it.However, all that said, it was an ok movie. Not super great, but definitely not as bad as people had said it would be.The good: action sequences were good, Ms Tian was good, and it was entertaining.The bad: It is popcorn material, you will forget about it within a few weeks (or sooner) and the political message was a little ham handed."
    },
    {
      "rating": "4",
      "text": "The special effects and imagery were fantastic (esp. in 3D)but the movie went way overboard with the premise and the almost superhuman abilities of its \"heroes\" in being victorious....add in dopey dialogue (with some attempts at humor turning out humorless) and Matt Damon apparently going for some kind of foreign affect to his speech (only winding up in him sounding clueless anytime he opened his mouth) and it turns out a very mediocre movie with too many \"oh, c'mon\" moments.  4 out of 10"
    },
    {
      "rating": "3",
      "text": "I thought that if Matt Damon was in this movie it may not be too bad.    That's what I get for thinking.    The movie has its moments, particularly in the settings, including some beautiful badlands that really do exist there, and the pageantry of the armies in the wall fortifications was impressive.    But sooner or later we have to get to the plot.    Ewwwww.    Ultra bad lizard beings try to breach the wall and kill and eat everything and everybody.    So much for the spoiler, because that's basically it, and Damon's role as a mercenary turned good guy to help the Chinese beat these greenies.    The dialogue couldn't be more lame, and even the presence of a very pretty commander doesn't help.    I really don't understand Hollywood.    How they can turn out brilliant work one minute and then take a movie that could have been better if it had more than a video game plot and make us groan is a mystery.    Damon can and has done so much better - this is one of his low points in his career.    This turkey will be hitting the pay cable channels and DVD's fairly quickly like other Hollywood bombs do.    I wouldn't even wait to see it then."
    },
    {
      "rating": "3",
      "text": "I believe this director is known for making beautifully shot action-romance films, but you wouldn't be able to tell as the film fails to deliver on all aspects. I think the director just thought, this would look cool with CGI. Typical conventional trashy hollywood film."
    },
    {
      "rating": "3",
      "text": "The special effects were good,the musics and costumes were great but...It was really boring, Matt Damon wasnt really that good here and why him ??? Only the first battle made me enjoy but after this ...i was really dissapointed."
    },
    {
      "rating": "4",
      "text": "Overrated movie, unfortunately. The plot is too simple and the characters aren't impressive at all. The visual effects are good but everything around it is weak."
    },
    {
      "rating": "4",
      "text": "Despite the non-stop action and great visuals thanks to the remarkable talent on and off the screen, The Great Wall is disappointingly empty in terms of plot, character development and drama."
    },
    {
      "rating": "6",
      "text": "Matt Damon and Pedro Pascal play 2 mercenaries looking for gun powder in historical China. When they're caught and imprisoned in the titular structure, they end up in assault by a horde of vicious mythical beasts. This film was directed by noted Chinese director Yimou Zhang and he's put his eccentric style all over the film. The battles are over the top (pun intended) with dizzying action and video game visuals. The plot is somewhat silly, while the human interaction is mundane. If you appreciate fantastic imagery, hyped up fights and spectacular scenery, this somewhat stylized adventure will not disappoint."
    },
    {
      "rating": "0",
      "text": "Unoriginal story, Terrible over acting, and awful looking visuals. If Matt Damon's name wasn't attached to this, No one would have even bothered seeing it. It's absolutely trash. I honestly don't know why they bothered making this film."
    },
    {
      "rating": "2",
      "text": "I thought that this was an Awful movie that tried way to hard to make the movie serious. I thought that because they had a couple good actors in there that it might be okay, but No it was horrible."
    },
    {
      "rating": "5",
      "text": "Matt Damon's new star vehicle \"The Great Wall\" left very little of an impression on me. The writing, the acting, and even the cgi effects leave much to be desired."
    },
    {
      "rating": "10",
      "text": "\"Professional\" critics are worthless, this was everything I wanted in a fantasy action movie. The visuals were absolutely stunning and highly original, the action was intense and dramatic, and the character work was simple and effective. While Hollywood always seems to need at least 140 minutes to get through a basic plot, this one trips along with fleet, efficient editing and comes roaring to the finish in a tight 100 minutes. Kept me fully engaged and invested for practically the whole runtime, and definitely feels like something I'll go back and revisit someday too.I will admit I was worried going in that the CGI monsters would look cheesy, but they were actually fantastic and the movie does a great job of building them up to be legitimately terrifying enemies. The contrast between the graceful athleticism of the defenders and the bestial savagery of the monsters had me flashing back to the battle of Helm's Deep in The Two Towers.The Great Wall is an excellent, groundbreaking action movie, and a welcome arrival for people who are tired of everything being either a superhero movie, a 6th sequel, or both."
    },
    {
      "rating": "10",
      "text": "When I give this movie a straight 10/10, I'm rating it based on the visual effects, action, music, and aesthetic. Visually, this movie is one of the most gorgeous I've seen in years, on the same level as Mad Max: Fury Road. No, I'm not kidding. It's a shame many critics won't give this film credit where credit is due, because this is a fantastic monster film. Many were expecting an American Hollywood production, when really, it's more of a Chinese war film with just a big budget. Yimou's astounding direction mixed with the action and Djawadi's score makes for an epic experience made for movie theaters. See it on the big screen while you have the chance."
    },
    {
      "rating": "10",
      "text": "In my opinion this was an amazing movie. It's exactly what I wanted to see when I first heard of this movie and saw the previews. The casting was great.I am not sure why so many are having issue with the fantasy portion of the movie. If you read the description is literally says fantasy. An alternate scenario of why the Great Wall was built. The movie explains a story as to why monsters came about \"lore\" why Matt Damon characters showed up. Etc. Plot explained well. If you actually watched and paid attention to the movie you wouldn't be so confused as many are in most these comments. In my opinion most the bad reviews are based off reading the other bad reviews and trying to go with the crowd. I think the \"professional\" critics read the tabloids about Matt Damon's role being such an issue due to the remarks of the movie having a \"white savior\"  and based there opinion biasedly off of that and not the actual film. The movie showed great detail on how I would assume Chinas military ran back then. Strict, focused, precise. The detail they put into making China, it's army, it's people, it's honor and the Great Wall look great,  its really enjoyable to watch. I do not feel that Matt Damon's role washed any of that out. For many who say that this movie has a \"white savior\" if you watch the ending you can clearly see that it wasn't Matt Damon's character that saved them. (I won't spoil and say who) it was a team effort. I hope many more go this movie and enjoy it as much as I have. And I hope that this movie can get better scores like it deserves. It is beautiful work from such a great director and the casting was done very well. I am even happy that they added humour to such a action packed and thrilling movie. Really go watch this movie with an open mind. :)"
    },
    {
      "rating": "8",
      "text": "Its better than people are giving it credit for. Granted story may not seem original, its action alone is worth atleast a viewing. Yes Matt damon stands out in this movie full of chinese locals, but if you can look past it and try to have a good time, this is not bad. Its actually good action."
    },
    {
      "rating": "4",
      "text": "Middle Ages or something. European mercenaries (Matt Damon, Pedro Pascal) searching for black powder become embroiled in the defense of the Great Wall of China against a horde of monstrous creatures. Also starring: Tian Jing, Willem Dafoe. Directed by Yimou Zhang.China is an attractive movie market for Hollywood and they are also eager to spend money on making international hit movies, so uniting forces to produce some epics is an emerging trend. The American production values plus a leading star or two, combined with Chinese money, actors and locations – what could go wrong?Well, in the case of „The Great Wall“, almost everything. It’s 103 minutes of almost non-stop action so it may appeal to some, especially it (s)he hasn’t had enough of Tolkien-flavored epics populating the screens for the last 15+ years. But for others, it’s lazily written, acted and put together B-movie which has high aspirations but is too dumb and derivative to achieve that. There’s almost no story, or interesting characters. Even the massive action scenes don’t save much, more often than not the result just looks cheap. Even surprisingly cheap, considering the hefty budget of 135-150 million US dollars. This is the most expensive film ever made with (mostly) Chinese money.The only impressive thing is how orchestrated the defending side looks, all those color-coded legions, weapons, the whole shebang. It’s probably done with a lot of CGI but still… not bad.I also think the whole „monsters raiding Chinese Wall“ aspect is woefully underdeveloped and, in a bad way, videogame-ish. They don’t have much personality design-wise and making them so strong raises more important questions than the story bothers to answer. In short, the work here is weak.Matt Damon has the only noteworthy role in the whole movie, all others are filler. And even he can not make a character so shallow especially convincing. Damon is one of those top class stars who appears in lots of movies but, as a rule, avoids derivative crap. „The Great Wall“ is probably the worst big project he has ever done. The sooner it’s forgotten, the better for everybody.If you are interested in „The Great Wall“, maybe just watch the trailer and save 100 minutes of your life. The movie sucks. You will feel tired after twenty minutes or so. Watched it in 2D, so maybe 3D version sucks even more."
    },
    {
      "rating": "7",
      "text": "A review for this film is a pretty simple task. The film is dumb as rocks but it kept me entertained for the duration. In short I enjoyed it, decent acting, ludicrous but fun story, cool armour and good cgi. Enjoy dont think and dont take it too seriously."
    },
    {
      "rating": "6",
      "text": "Good performances by Matt Damon, Pedro Pascal & Jing Tian, good action, good visuals and good soundtrack sadly aren't enough to make this movie \"good\". Full of predictability and cliches, uncompelling characters and bland faceless villains, \"The Great Wall\" isn't a fun, exciting adventure as one would hope, but it will likely entertain the least demanding moviegoers."
    },
    {
      "rating": "10",
      "text": "As a constant film goer I was really impressed with this film. It was entertaining. The story worked well. The acting was great. And the effects were really impressive. I watched it on a big screen in iMAX and enjoyed the experience. The sound was equally impressive. I just can't understand why the really negative reviews abound. Some are cursing it for having foreign actors. Others about the political situation etc. And the poor director is even getting a caning. The story is about a legend. And it was wonderful to just sit back and let someone tell a story. I nearly didn't go because of all the bad reviews but I am glad I went and made up my own mind.Go and see it now!"
    },
    {
      "rating": "9",
      "text": "Great visuals, fantastic action sequences with some lowkey humor. Acting is decent and the plot is simple but this is a popcorn movie so you don't really need complex plot. The only problem with this movie is the length of the movie, it's way too short. Need an extra 20 mins or so for more action and character development.Matt Damon wasn't a full-blown \"white savior\" so that's good~"
    },
    {
      "rating": "1",
      "text": "An American came to china search for the cure of Mexicans. What a racist reflection!The characters are hollowno developmentweird frame60 years of preparation"
    },
    {
      "rating": "5",
      "text": "China, look amazed because your \"Great Wall\" has a feature film of its own. If the people in China would actually look at this film more and more, they'd recognize that this Great Wall film is just a plain boring \"kill the monster before it takes over our land\" cliché. Hey, at least they tried and that's a great thing to see."
    },
    {
      "rating": "3",
      "text": "It was boring. Absolutely boring. Why did Hollywood wanted to choose Matt Damon with this cheese-fest? The thing is, I felt that The Great Wall should've been the next Last Samurai of greatness, but it's now turned it into Gods Of Egypt 2.0: How to whitewashed an actor's character. It made no sense at all. The characters are annoying, wasted CGI, the story is a jumbled turd, and way too many cringeworthy plot holes. Yeah, this should probably be the worst movie of 2017. Skip it."
    },
    {
      "rating": "9",
      "text": "Another under-rated genre classic.  Do you like Matt Damon sci-fi movies?  Do you like Chinese fairy tale movies with over-the-top action?  This amalgamation is as good as you are gonna get.  Great Wall is NOT trying \"to marry its Eastern and Western sensibilities.\"  It's clearly trying to make money with a Chinese-USA crossover epic.  Fortunately we have Tony Gilroy (Bourne series, Rogue One script and by some accounts much of the direction); and, Ed Zwick of Glory, Defiance, Last Samurai and scores of other intelligent fare, one of my heroes.  The result is everything moving along much better than your average bloated fantasy epic.  It doesn't sag and everything looks amazing.  If you liked any of the Lord of the Rings/Hobbit movies, you'll like this.  Granted, unlike the best LOTR movies, no character here has any arc; nobody learns anything meaningful.  But, same with Rogue One.  If we must have movies which are better as video game scripts than as thoughtful, Progressive dramas, then Rogue One and Great Wall are two model successes of videogame movie genre, one Western, one Chinese."
    },
    {
      "rating": "6",
      "text": "It's an alright movie. If you don't go in expecting anything more than campy action, you'll do fine enough. It's definitely not one you should rush out to the theaters to see, but you'd do well catching this on Netflix or TV while doing something else. I've definitely seen worse this movie season."
    },
    {
      "rating": "5",
      "text": "Trying (and failing) at creating an \"epic\", Yimou Zhang's The Great Wall has far too many unintentionally laughable moments, and settles for limited spectacle and poorly conceived characters."
    },
    {
      "rating": "8",
      "text": "Its better than people are giving it credit for. Granted story may not seem original, its action alone is worth atleast a viewing. Yes Matt damon stands out in this movie full of chinese locals, but if you can look past it and try to have a good time, this is not bad. Its actually good action."
    },
    {
      "rating": "5",
      "text": "Visual do filme em certos momentos e bom e em muitos momento são toscos , da pra perceber em muitos momentos que e tela verde , os proprios 'Bixos' parecem uma animação mal feita  / roteiro não se perde tanto / 3D não e muito utilizado / na minha opinião uma historia fraca  Emfim Filme blockbuster ( na minha opiniao )mais vale a pena assisti !"
    },
    {
      "rating": "7",
      "text": "Saw The Great Wall yesterday (the movie, not a day trip to China). As action fantasy goes it was pretty damned good. The money was certainly on the screen. Except...how bad is Matt Damon? At no point did he rise above bland, and scattered randomly among a 90% American accent he decided to pitch in some cheesy regionally-wandering Oirish accent. Painful to listen to."
    },
    {
      "rating": "7",
      "text": "This film went a little overboard with Matt Damon being in it. I still enjoyed the movie, because of the action. The plot line went a tad unbelievable. I also think that the film had very good special effects, and very entertaining at some points."
    },
    {
      "rating": "9",
      "text": "I went in expecting the worse because of poor reviews and saw it in imax 3d. Really glad i did because this is a tremendous sweeping action film .The first battle scene on the wall is worth the admission all by itself with the imaginative defense methods and chilling drums pounding throughout.The acting is very good for an action film and the chemistry is there between leads.The monsters are excellently done .I suspect this got poorer reviews because it is a foreign production because it is  superior to other more well received recent American films ."
    },
    {
      "rating": "5",
      "text": "The Great Wall has style, great sets, great choreography and elaborate costumes but unfortunately no originality and a basic plot line. Tie this in with subpar acting and you've got a film that could have been great, but wasn't."
    },
    {
      "rating": "7",
      "text": "A film about how the Chinese built the Great Wall to keep out a legion of monsters known as Tao Tei, one could easily expect this film to be easily disposable and outright stupid. Yet, under the sure-hand of director Zhang Yimou, this possibly stupid film takes a unique turn into being a stellar realization of old legend (is it really a legend?) that can be mocked for being so clearly untrue, but still contains excellent themes, great action scenes, and a great imagination that always manages to get the film out of problems that could derail other film of the type. Sure, the Chinese may have not built the wall or flown on primitive hot-air balloons, but as a historical science fiction film, The Great Wall is a tight, well-acted, and thoroughly entertaining piece of blockbuster cinema.In many ways, The Great Wall hearkens back to the days of the old-school blockbuster. Back in the 1980s and 1990s, things did not need to be plausible. Kurt Russell could kick ass in any number of science fiction scenarios or a boy could meet an alien or some moron could recreate dinosaurs in a theme park. Yet, nowadays, films with such inventive and imaginative plots as The Great Wall are mocked and chastised for how dumb they sound before they are even released. It is a shame that, as a result, we get more-and-more blockbuster films that just try and show real events - my God, Marvel making us watch United Nations meetings and terrorist bombings when we could just watch Tao Tei monsters eat people instead is a travesty - and, as a result, these films just feel as though they are lacking that extra punch. The extra punch is that of creativity and The Great Wall's unique plot and setting is there to deliver in a mostly successful blockbuster that features the imagination and insanity lacking in today's blockbusters. Though flawed nonetheless with some bad writing, conveniences, and dumb characters, Zhang Yimou finds a way to make blockbuster cinema exciting once more in The Great Wall.He does this by relying upon scope and awe. With shots highlighting the absurd size of the wall to shots of those aforementioned hot-air balloons descending upon the capital of China, the film is obviously gorgeously shot and designed, but is more-so a visual spectacle. Though the film comes in at a very tight 90 minutes, Zhang Yimou infuses a sense of awe and sheer enormity with the film's expansive visuals that are designed to try and communicate the incredible scope and ambition of the film. This is a blockbuster with a sense of style and size that is largely lacking in the more contained and focused blockbusters of today. Here, Yimou constantly reminds the viewer of the vast size of everything involved with audacious battle sequences of the Tao Tei climbing the Great Wall or climbing palace towers. While the former comes in a gorgeously designed action scene where everything is obscured in smoke to increase the fear factor of the moment, both that scene and the latter one in the palace are akin to World War Z's scene of zombies climbing a wall. Similarly to that, the scene is awe-inspiring in its grandiose nature and a visual feast.However, as with any film by Zhang Yimou, this film is hardly just audacious action set pieces. Instead, at its heart, this film can be seen as a wuxia film. Perhaps Yimou's best film, Hero, is a wuxia film and many of the action scenes here show that very same style. As Commander Lin (Jing Tian) battles with some Tao Tei in the capital, she uses her sword in incredible fashions as she literally flies and dances her way through the battlefield. Using William Garin (Matt Damon) as further back-up, Lin is a high-flying spectacle of the highest order throughout this film and is the main connecting thread to Yimou's aforementioned peak as a director. As with Hero, the scenes where he is able to go full wuxia are gorgeously constructed and choreographed with it no longer resembling a battle. Instead, it becomes a dance to the death with one of them wielding a sword used for ballet-esque destruction.Similar to Hero or even classic Japanese cinema such as Akira Kurosawa's Ran, the film's reliance upon color is always purposeful and gorgeous in equal measure. The comparison to Ran is all the more apt due to the fashion in which Yimou utilizes the coloring of the armor worn by the Chinese soldiers to denote key themes or ideas about the person's role in the army. In Ran, Kurosawa took a very similar path with each son wearing a color - blue, red, or yellow - that denoted their defining characteristic. Here, soldiers are assigned either purple, yellow, blue, or red gear. General Shao (Zhang Hanyu) as the leader is assigned black as is Peter Yong (Lu Han). For the former, black is seen as a color of power and, as General, Shao has considerable power. For Peter, black is the color given to young men expected to follow in the path of their ancestors. Given his youth and strong morals, he is one who can follow i"
    },
    {
      "rating": "5",
      "text": "This is a movie that pairs spectacular visuals and well done choreography with a weak story and shallow characters. But let's not go into that, but instead let's have a look at what sixty years of preparation for the eventful onslaught has given the defenders. For the Chinese defenders know that every sixty years these monsters make an attack and once that succeeds the whole world is at their feet.. eh claws.Your enemy is a reptilian dog hybrid that is the size of a draft horse. It comes with claws, teeth and a thick hide, can stand an amazing amount of punishment and is suicidally loyal to their queen. One such monster can easily take out a group of well-trained and armed humans.  The creatures have however a few severe weaknesses: killing their queen will stop them from functioning, confronting them with magnets will make them docile and hitting their eyes is an instant kill. And the defenders have one big advantage: they have gunpowder at their disposal.So armed with knowledge about a weakness for magnets the Chinese defenders neglect to send out people all over the world to find magnets or even use the one magnet that stopped the monsters in a previous assault. Instead they use ineffectual methods until saved by this one random traveler who is carrying around a massive magnetic stone that serves no purpose to him and is there only to be delivered into the hands of the Chinese as a lapis ex Machina. And even when the Chinese are aware of the stone's effect on the monsters no messengers are send out to the far corners of the empire to collect whatever stones can be found. To add insult to injury, they even take away the one stone from the wall to show it to the emperor. And what happened to that stone that saved the day sixty years before? And why was it not examined back then?The queen is the Achilles heel and the defenders only make a half hearted attempt to take her out. She is protected by a group of special monsters that can create a kind of shield to protect her from attacks, which is put up exactly the few times the defenders make an attempt to kill her.She gets bombarded once and then when that defensive shield is put up they give up. Conveniently at the end of the movie the shield is put down to give Matt Damon a window of opportunity even when the queen knows someone is firing at her. And this several times over. Yes, these monsters have become smarter, as the movie has it, but only by a margin as compared to humans.And this shows again the sheer stupidity of the defenders. They have had sixty years to prepare for the onslaught and could have created a massive supply of gunpowder weapons aimed to take out the queen.  -And note that even a few arrows with gunpowder are apparently very effective against the monsters -. Couple this with oil canisters and naphtha flame throwers they could have killed her by blowing her up or burning her to death. But instead they rely on arrows, swords and spears. It isn't that the monsters have become smarter, the humans have become dumber.But even if they did not possess gunpowder and magnets then it is baffling what preparations they made in sixty years. For instance the monsters are apparently able to scale the wall. So why put up a flat wall that can easily be scaled instead of equipping the wall with defensive measures against scaling such as barbs that point downwards? Why is the wall not equipped with extensions as to rain down boiling water or fire? Why are the ballistae put on top of the wall but not on level with the monsters so as to have them fire in a level trajectory optimizing the chance of hitting something? Why is the foreground of the wall not used to create obstacles, pits, stakes, traps and a moat instead of allowing the monsters free range of that area? Even putting up beams spaced out to allow room for humans but to narrow for these hulking brutes would have broken up their attack and allow the defenders protection.Perhaps it is because the wall, as cool as it looks, was not made to defend against these monsters but against the tribes? But most baffling of all. Why did the monsters bother with attacking the Chinese when they could just as easily move to any other part of the world that lack this defensive construction?The movie would have made a lot more sense if the Chinese had not known about these monsters. Then the lack of proper countermeasures would have made a lot more sense. The wall was made to keep out the steppe people, not massive deadly beasts. Yes, I know.. The movie has to be spectacular. But couldn't they not have put some effort into it to make it also more logical? Now it feels like the Chinese are just stupid and require a foreigner to save the day. Oh yeah, an American foreigner."
    },
    {
      "rating": "7",
      "text": "A Great Wall Is Obstructed By Digital SpectacularityIt's paradoxical to take a look at the cosmopolitan daily newspapers these days and contemplate that while the planet is setting up for a truthful confrontation between China and the U.S. for the sake of its interests in South China Sea's disputed waters, this two cinematographic titans' economic relations are cooking at the box-office of the spear constituted by Legendary East, China Film Group and other film production companies both oriental and occidental. So, setting out the scene from an absolute perspective, are the Americans and the Chinese exchanging peace for dough? And although are unlike matters, is the money and not understanding which stirs up that two of the most powerful nations in the world join in function to perpetuate the collapse of our capitalist universe?Let's focus on the field that concerns us. It has officially commenced the struggle for preponderance in movie theaters around the negotiations between the States of the East and the West, thanks to movies from one side were a triumph in the other country and vice versa. We could see this coming for a long time; starting with the purchase of Lions Gate Entertainment, following American success of films as \"The Mermaid\" or Jackie Chan's and Jet Li's vain comedies or the partial recovery of capital investment from English-speaking feature films such as \"Warcraft\" or \"XXX: Return of Xander Cage\" which don't even managed to get off the ground in its mother country and concluding with the ineluctable kick start of co-productions, a trend that with respect to cinema, in the light of the issue, doesn't bode well at all.\"The Great Wall\" is the key, a 150-million key which opens the door of victory, at least economic. Equality and inclusion have even touched this mega-production script since six screenwriters/writers are who engrave their names to the rough but eye-catching legend. It's evident how each writer instills the details of their previous works either in exegesis, creative, artistic or visual section. The story carries us to xeric European deserts, where two mercenary globetrotters, William (Damon) and Tovar (Pedro Pascal), are caught by The Nameless Order after they murder a mystifying glaucous quadruped. That frightening creature, which stands for greed, is one of the thousands of \"Taoties\" that ravage the Chinese army every sixty years, looking for revenge due to their ancestors' avarice.Doesn't it sound compelling? Sentinels wearing polychromatic attires —  \"Power Rangers\" style — divided according to their warlike skills. They defeat their enemies using of pulleys, catapults, bullet time arrows, hot air balloons, sharp weapons, bravery and too much CGI. Director Yimou Zhang decides, in a terrible way, to give more prominence to strenuous exquisite pictures as he neglects and subordinates the story, which increasingly becomes into a buddy comedy film. Yeah, they're wonderful and it's not simple to conceive and execute-correctly-fight choreographies with such agreement and style levels with a macro-budget, however, with that risk in mind, they sign up a filmmaker who stands out for his visual landscapes full of courtliness and accordance, deplorably, they didn't expect that in his first and greatest opportunity to continue in highly expensive movies, he relegate a vital aspect: narrative development.From the initial sequence, it reveals the lack of on-screen chemistry between the leading duo, forcefulness in push-lines is what is needed and the leitmotiv wanders due to weak acting tandem. William Defoe is a hollow and unjustified incorporation, a mere tool for attracting more spectators to cinemas. To a larger extent, they applied a similar strategy to Damon, who is an immediate commercial attractant; A pretty face saving hundreds of lives from a horde of demons, are they intelligent, aren't they? On the other hand, the Eastern actors, highlighting the inclusion of a fantastic warrior lady (Tian Jing), feel more comfortable, in interesting visuals that radiate artistic and traditionalist oriental sensibility.\"The Great Wall\" is another horizontal graphic direct-entertainment blockbuster, however, marks the beginning for the agreements between the English-speaking country and the Chinese titan, while providing an unusual look of the Great Wall and female introduction in a feature film of such monetary magnitude. The film is inversely proportional to its pretensions and it's comforting to witness that it doesn't focus on its emboldened main character, but focuses its efforts on the battle army, their relationships, troubles, and ambitions. Nondescript characters, powerful characters, repetitive God's eye views, a crushing mise-en-scène; the motion picture is a raffle of pros and cons that set off on the wrong foot the negotiations, however, this lacking timing and thrilling epic adventure is pleasant, is the kind of movie a 13-year-old boy can't wait to see."
    },
    {
      "rating": "5",
      "text": "\"The Great Wall\" was a regular movie, the story was regular, the special effects were good but exceeded, cinematography was fairly regular, and I did not care that Matt Damon is a samurai of pure autonomy. But his very good role, also the roles of Pedro Pascal and Jiang Ting, the revelation of China in Hoillywood."
    },
    {
      "rating": "6",
      "text": "Lo primero decir que, la gran muralla es una mala película, pero que como pelicula de entretenimiento, cumple.Para nada aburre. Hay mucha acción, humor y un toque aventurero.El desarrollo de personajes es malo, aún así el personaje de Matt Damon está bien desarrollado, no se puede decir lo mismo del personaje de Pedro Pascal al cual parece que solo le han contratado para hacer chistes. Aún así esta pareja funciona. El personaje de William Dafoe, un desperdicio.Los diálogos son ridiculos hasta decir basta, un guión flojo y una efectos visuales bien, sin más.En definitiva, buena película para evadirse una hora y cuarenta y cinco minutos."
    },
    {
      "rating": "2",
      "text": "The Great Wall is entirely unnecessary. With terrible acting (especially Matt Damon), tedious action, and awful SFX, it creates yet another Hollywood bore."
    },
    {
      "rating": "8",
      "text": "An easy 8 for three reasons: A. The Great Wall itself. Wondrous and eye-catching, rises proudly above the CGI clouds. A masterpiece of modern Cinematography! B. Zhang Yimou's magic wand. He is a magician of the 7th Fine Art. Period. C. The HUGE potential, in general. Now, why not a 9 or a straight 10? I could name more than a few reasons (as a good-conscious-movie-watcher) but I will down-narrow it to only one: NO ROMANCE! I mean, no romance at all! And having a good potential here, thanks to the fiery central characters... well, it is really a pity! There were several moments that I caught myself praying for a CGI or even a non-CGI miracle, which would bring Christian Bale on Matt Damon's shoes. I mean, there would be a whole new twist on the love side of the story... If not with the General-girl, at least with the Tao Tei Queen..."
    },
    {
      "rating": "10",
      "text": "I wasn't sure what to expect at first, but I was very surprised in a good way. Definitely a unique movie. The action begins relatively quickly, without compromising a decent storyline. Definitely recommend watching!PS: I'm sure people would truly enjoy this movie if they didn't think so much about the acting or the story. Just go with it. And if anyone complains about the CGI quality, they must be drunk. It looks brilliant to me!"
    },
    {
      "rating": "6",
      "text": "Irgendwann um die Erfindung des Schießpulvers: Auf der Suche nach Ruhm und Reichtum stranden zwei Söldner und Tagediebe in der Chinesischen Mauer. Deren Existenz ist noch geheim – und damit das auch so bleibt, werden die beiden unfreiwillig Dauermieter. Langweilig wird es jedoch nicht, denn der vierbeinige Urfeind des ansässigen Kriegerordens attackiert in Scharen das mächtige Bollwerk. Selbstredend erkämpft man sich schnell den Respekt seiner Gastgeber – und die Zuneigung des schnuckeligen Commanders Lin Mai. Doch macht das die Isolation auf Lebenszeit wett? Schon Tom Cruise mimte in The Last Samurai erfolgreich und unterhaltsam den Weißasiaten, in der Fantasy-Action The Great Wall übernimmt jetzt Matt Damon den Job. Das ist zwar in allen Belangen stumpfer, macht aber durch ordentlich Tempo und eine gute Prise Culture Clash und Buddycomedy immer noch Spaß – auch wenn der Martial-Arts-Part trotz Hero– und House of Flying Daggers-Regisseur Zhang Yimou eher klein ist."
    },
    {
      "rating": "7",
      "text": "Here's the thing with The Great Wall.  Is it so bad that it's good?  For me, yes.  First of all, I saw this on my 4K TV, and it's one of the greatest looking films I've seen so far in that format.  Gorgeous cinematography all the way around.  The sound is equally superb, and when the soldiers are pounding the big bass drums it will put your subwoofer to the test and get your blood pumping.  Many of the scenes obviously had 3D in mind while filming, and I'm sure the film looks great in that format as well, although I didn't see it in 3D.  Some of the scenes are laughably ridiculous, such as the bungee jumpers that try to kill the beasts one at a time.  It's very easy for the monsters to pick them off.  Some of the acting is a little wooden, although the bad dialogue is to blame more than the actors.  The obvious question while watching the movie is why don't the monsters simply climb up the wall where there are no soldiers and weapons to confront?.  But then there would be no movie as the soldiers would get killed.  This could have been a classic movie if more time was spent on character development, but it looks like they decided on concentrating on the visual and aural senses, and they certainly succeeded on that.  I was never bored watching the film.  Another movie made in the same vain was \"Mad Max Fury Road\", but Mad Max was a much better film because they did concentrate on the characters and didn't make it only a visual and aural movie.  Still, if you want to show off your whole system this is a great choice."
    },
    {
      "rating": "5",
      "text": "Mildly enjoyable but mostly quite dodgy. Mainly in the megadumb department."
    },
    {
      "rating": "5",
      "text": "Spectacular visuals and some great choreography in a weak story which makes litte to no sense with shallow cliche characters and monsters. See this for the eye candy. Overlook the wole form over function thing and don't think about it much, just enjoy the ride for what it's worth."
    },
    {
      "rating": "3",
      "text": "Decent visuals, but has no fresh vision.I always thought what they call the great wall of China is the symbol of the Chinese scary-ism against the mighty Mongolians in the ancient time. So when I first saw this trailer, I shocked and then I said: what the heck. You can't just hide the truth and recreate whatever new thing you want. But That's how the China and Chinese evolved for thousands of years. Like it could be martial arts, rice, noodles or the dragon, all of them came from outside. Then when I saw the film, the first scene itself cleared my doubt. It states the film was based on the legend. I thought it was a good start after the misleading promos.So this is China's effort to make a product at home par with Hollywood. They had hired top technicians from the west, that's including Matt Damon. With this kind of attempt, they should have triumphed. Yeah, the graphics were good and then if you check it out the end credits, it was actually not a pure Chinese made product as what we see on the screen, which was 99 per cent Chinese cast. 'Kung Fu Yoga' is a fine example, what the made in China looks like.The director is known for traditional films, like mixing art, martial arts and culture, particularly the middle age. I like his films of the 00s, but this one was utterly commercial crap. When it comes to the ideas for the scenes, every segment and every frame reminded me some Hollywood's greatest graphic film from the recent decade. Particularly the monsters as the zombies from 'World War Z' and the Chinese soldiers totally replicates the Elves of Woodland Realm. That proves, the Chinese are masters of copying/duplicating. IT HAS A DECENT VISUAL, BUT NOT FRESH VISION. They should have handed it over entirely, except producing it for the better outcome.It is the early 11th century, at one of the sections of northern China wall, where a couple of white men caught by the Chinese army after they were chased by a group of bandits. They have come with an agenda, but there's something big is going on. First, they have to win the Chinese trust and so they succeed on that, but things changes as the weather of the place has changed. Besides, they have no choice than to cooperate with them, but then the differences divide the two men. Who takes what path and their fates are decided at the film's climax.❝They have trained all their lives for this war.❞Many western actors, filmmakers had tried their luck in Chinese filmdom, but not all were succeeded. Tapping Chinese market is not that simple. There are too many complications like restriction in thematic and using content in the story. If that complies, then they must use Chinese cast and crew for some percentage. From all, the greatest surprise was, like Jimmy Kimmel said, why would Damon had given up the Oscar award winning role from his own production for this cheap flick from the east.I always appreciate the good films, no matter where it had come from. It all depends on the quality and the contents, but sometimes there is exemption if the production was under a limited, small cost. There's no such excuse for this film. Besides my issue was not the graphics, except borrowing the ideas from others, but it was the poor screenplay. You can clearly say that I'm not happy with this one. This is just another film that looks like a computer game as similar to the 'Resident Evil' film series.The west had given up on digital 3D, but China has a special obsession with that, and so am I. That is the reason those failed films, bet against the Dollars, which were strongly influenced by that technology, such as 'Age of Extinction', 'Warcraft' et cetera survived by earning Yuan. Like I mentioned, the director is not this kind of cheap filmmaker. But it clearly understandable that he wanted to give what the domestic audience wanted, a good digital 3D film. For that, it has to be full scale action-adventure, not filled with drama kind he's famous for.This film lacks character developments, as well as the story. You might enjoy it if you like actions. Even though, many of them are silly like acrobat women jumping down to just kill one-two monsters. On the other hand, they are the baits without followup strategic offense. Hence well planned suicide. Like that, they just wanted to give some actions without any logic behind. The common man like Chinese people (Common means Communism; definition) might be fooled, not the rest of the world. So this film is not everybody's suitable. It is a watchable film, but why? No worth at all.3/10"
    },
    {
      "rating": "5",
      "text": "Correctly done but totally forgettable. Nothing is wrong (except William dafoe character) but nothing is memorable."
    },
    {
      "rating": "5",
      "text": "Ridiculously cheesy dialogue, over the top action sequences, and quite frankly a boring story; all combine to make this film a mess. The most impressive aspect of the movie is its ability to transform quality actors into shockingly dull characters."
    }
  ]
}