{
  "id": 1384,
  "title": "The Matrix Reloaded",
  "starring": [
    "Keanu Reeves",
    "Laurence Fishburne"
  ],
  "runtime": 138,
  "genre": [
    "Adventure",
    "Action",
    "Thriller",
    "Science Fiction"
  ],
  "description": "Six months after the events depicted in The Matrix, Neo has proved to be a good omen for the free humans, as more and more humans are being freed from the matrix and brought to Zion, the one and only stronghold of the Resistance.  Neo himself has discovered his superpowers including super speed, ability to see the codes of the things inside the matrix and a certain degree of pre-cognition. But a nasty piece of news hits the human resistance: 250,000 machine sentinels are digging to Zion and would reach them in 72 hours. As Zion prepares for the ultimate war, Neo, Morpheus and Trinity are advised by the Oracle to find the Keymaker who would help them reach the Source.  Meanwhile Neo's recurrent dreams depicting Trinity's death have got him worried and as if it was not enough, Agent Smith has somehow escaped deletion, has become more powerful than before and has fixed Neo as his next target.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9TGHDvWrqKBzwDxDodHYXEmOE6J.jpg",
  "categories": {
    "plot": 5.791666666666667,
    "acting": 4.833333333333333,
    "ending": 7.181818181818182,
    "soundtrack": 9.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 6.630434782608695
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Not as good compared to the first. Still, this sequel remains sophisticated, intense and    complex."
    },
    {
      "rating": "7",
      "text": "The Wachoskis build off their landmark sci-fi film with near stride in \"The Matrix Reloaded,\" churning out invigorating set pieces and striking imagery to offset a narrative that could certainly benefit from the KISS principle."
    },
    {
      "rating": "7",
      "text": "A sequel doesn't get much bigger, more populated or digitally enhanced than the second outing of the much publicised \"Matrix\" franchise, filmed back to back with a third instalment that was released later in the year of 2003, the second one is the beginning of a larger arc which finished in the third. We see Neo (Keanu Reeves) now taking full advantage of his \"One\" status, he has a new wardrobe, a more relaxed attitude and he can fly. He is joined again by the increasingly philosophical Morpheus Laurence Fishburne) and the lovely Trinity (Carrie-Anne Moss), the woman Neo falls for in the first film. This time around we have a glimpse of Zion, the last human city in the real world, a place mentioned several times in the original. The city is on the bring of an attack from the machines that many believe Neo can prevent. But there to get in his way is the rebooted and rejuvenated Smith, played with an undoubtedly charismatic and comedic undertone by Hugo Weaving. He is stronger, faster and can multiply in vast numbers, something Neo meets head on in one of the films most spectacular fight sequences, where Neo is facing countless amounts of Smiths at the one time, this fast, choreographed piece is one of the defining points of the film.\rSo the big question remains, is it any good? Well much like that question, there are various moments in the film where questions are asked, perhaps rhetorical or not, but many times these questions are unanswered, or answered with another question, it's quite a circle and one that we must get used to, there are plenty of psychological puzzles and open-ended dialogue to keep people guessing for years what exactly was meant by this or that. In terms of explanations, we get a much deeper understanding of The Matrix, it's creation and its purpose, but this can often feel forced and too explanatory, computer program this, computer program that. The first film, we barely got an explanation, we were left in awe at the scope of the film and the subject matter, but a bigger budget for 'Reloaded' means a more action-oriented film, we still get some brain teasers, but a more human element and certainly pre bells and whistles take away that unique spark that's de the first so damn enjoyable. Mentioning the set pieces again, there are certainly some eye-catching and spectacular moments, a moving truck where we see Morpheus fighting an Agent was particularly enjoyable, with plenty of time spared for this breathtaking scene.\rBut in light of these impressive feats, they seem to act as a distraction to a disengaging story, one that takes a more Hollywood approach as a bigger budget was available. These folks are now entering superhero territory which lacks the originality that was introduced in the original.\rAlso making an appearance in the sequel is a vast amount of new characters, mostly from other ships headed to Zion, but they sort of get lost in the midst of everything that is going on in the bigger picture, left with little to do except stick on some cool sunglasses and an say a few witty lines.\rIt certainly wasn't the sequel I was hoping for, it made everything too explainable and fluid, but while there is a few questions still to be answered, the cliffhanger ending was a little off the mark, not matching it's predecessor in unique storytelling or thrill, but definitely an action film worth watching."
    },
    {
      "rating": "7",
      "text": "The special effects surpass those of the previous episode, as well as the fight sequences, the chase sequence on the freeway is vertigo. But? The problem is that the plot feels full of holes and the explanation of what the Matrix is is not satisfactory or convincing. At least she deserves a chance on a weekend."
    },
    {
      "rating": "7",
      "text": "Action scenes are amazing including car-chasing scene, and it's very interesting to see Neo grown. Not good as the last one, but this can be also considered as a thrilling action film."
    },
    {
      "rating": "6",
      "text": "Crazy cool action but this is a big step down from the stellar first film, just not as clever or coherent."
    },
    {
      "rating": "7",
      "text": "The film is not as good as the first one. The story continues, but no longer has the same mystery as if it had first.    ."
    },
    {
      "rating": "7",
      "text": "The Matrix Reloaded is an enjoyable movie that builds decently upon the original and continues to have good action and performances. While it was entertaining overall, it does not reach the same level of quality as the original. The plot and new characters aren't as intriguing, and the special effects this time around seem a bit too cartoonish and over the top."
    },
    {
      "rating": "7",
      "text": "In my opinion this is thw weakest one in the franchise, but still i really enjoyed watching it."
    },
    {
      "rating": "7",
      "text": "The Matrix Reloaded is a film that gets more hate than it deserves. While the film has a story that isn't as great as the first and this film also has Neo essentially be a god with no weaknesses, it still has great action sequences, albeit a bit cartoonish. Overall, I really enjoyed this film, its action, and acting perfomances and my rating would be 7.8/10"
    },
    {
      "rating": "7",
      "text": "The Matrix is a masterpiece. Thought provoking and entertaining. Reloaded feels like it went from using the matrix as a metaphor towards building an actual fantasy (sci fi) world where the system more often has a literal meaning. It is filled with confusing software jibber jabber that leads viewer from one grand action sequence to another. It's no longer a thought provoking film but rather a product of pop culture in its true form. A real blockbuster and that is disappointing considering how impactful the first movie was with its themes and atmosphere.However, it is an entertaining badass action film."
    },
    {
      "rating": "7",
      "text": "It's still a pretty good movie, but it's not \"The Matrix\". Perhaps it's a little too much to beat its fantastic predecessor."
    },
    {
      "rating": "7",
      "text": "7,5. I still really like this movie even though is not as good as the first one, but considering how the first one impacted the pop-culture so much, being equal to it was a hard task to accomplish, I just wish it focused less in the fights and more on the plot itself."
    },
    {
      "rating": "4",
      "text": "What a load of clap trap. if you're the kind of person who gets off on special effects, then this will be right up your street. But if you're the kind of person who likes a good story line, with some logic and believability and less smack, bottle and balls then give this a miss. There is no comparison with the first picture, which was unique, cohesive, and almost believable. This picture suffered immeasurably by being caught up in it's own self indulgence. Give it a wide birth."
    },
    {
      "rating": "7",
      "text": "The Matrix Reloaded is the sequel to a movie that marked a change, and a time. Therefore, this second film had a very complicated task ahead.Matching the first impossible, holding the level sufficiently was possible.While this second installment does not become as specifically metaphysical as the first, the philosophical basis remains important."
    },
    {
      "rating": "7",
      "text": "A downgrade from the first one, the story and characters are worse than the first one, I also wonder if Matrix was always supposed to be a trilogy, since they basically played all their cards with the first movie, and had almost nothing left for the sequels, while the action is still very good, it isn't as good or surprising as the first movie, there is also a couple of stinkers, like the Neo vs. the army of Smiths, that fight had an uninteresting geographical location,(basically a symmetrical square) and went on for way too long, but don't get me wrong, it was still an enjoyable movie"
    },
    {
      "rating": "7",
      "text": "A sequel doesn't get much bigger, more populated or digitally enhanced than the second outing of the much publicised \"Matrix\" franchise, filmed back to back with a third instalment that was released later in the year of 2003, the second one is the beginning of a larger arc which finished in the third. We see Neo (Keanu Reeves) now taking full advantage of his \"One\" status, he has a new wardrobe, a more relaxed attitude and he can fly. He is joined again by the increasingly philosophical Morpheus  Laurence Fishburne) and the lovely Trinity (Carrie-Anne Moss), the woman Neo falls for in the first film. This time around we have a glimpse of Zion, the last human city in the real world, a place mentioned several times in the original. The city is on the bring of an attack from the machines that many believe Neo can prevent. But there to get in his way is the rebooted and rejuvenated Smith, played with an undoubtedly charismatic and comedic undertone by Hugo Weaving. He is stronger, faster and can multiply in vast numbers, something Neo meets head on in one of the films most spectacular fight sequences, where Neo is facing countless amounts of Smiths at the one time, this fast, choreographed piece is one of the defining points of the film.\rSo the big question remains, is it any good? Well much like that question, there are various moments in the film where questions are asked, perhaps rhetorical or not, but many times these questions are unanswered, or answered with another question, it's quite a circle and one that we must get used to, there are plenty of psychological puzzles and open-ended dialogue to keep people guessing for years what exactly was meant by this or that. In terms of explanations, we get a much deeper understanding of The Matrix, it's creation and its purpose, but this can often feel forced and too explanatory, computer program this, computer program that. The first film, we barely got an explanation, we were left in awe at the scope of the film and the subject matter, but a bigger budget for 'Reloaded' means a more action-oriented film, we still get some brain teasers, but a more human element and certainly pre bells and whistles take away that unique spark that's de the first so damn enjoyable. Mentioning the set pieces again, there are certainly some eye-catching and spectacular moments, a moving truck where we see Morpheus fighting an Agent was particularly enjoyable, with plenty of time spared for this breathtaking scene.\rBut in light of these impressive feats, they seem to act as a distraction to a disengaging story, one that takes a more Hollywood approach as a bigger budget was available. These folks are now entering superhero territory which lacks the originality that was introduced in the original.\rAlso making an appearance in the sequel is a vast amount of new characters, mostly from other ships headed to Zion, but they sort of get lost in the midst of everything that is going on in the bigger picture, left with little to do except stick on some cool sunglasses and an say a few witty lines.\rIt certainly wasn't the sequel I was hoping for, it made everything too explainable and fluid, but while there is a few questions still to be answered, the cliffhanger ending was a little off the mark, not  matching it's predecessor in unique storytelling or thrill, but definitely an action film worth watching."
    },
    {
      "rating": "9",
      "text": "Almost as good as the first part. Really don't understand the expectation of most people for the same excitement and effect from the second and so on parts like the impact, that the first part has given them. So underrated and underestimated trilogy."
    },
    {
      "rating": "8",
      "text": "A more action centric movie than the original, which in many ways pays off with some of the most memorable film scenes ever. However some of the character from the original was definitely lost and for the most part this doesn't matter it's still an amazing movie and a worthy sequel. The cliffhanger at the end is a b**** though."
    },
    {
      "rating": "6",
      "text": "They didn't need to make this. The Matrix was just perfect as it was. But to add two sequels to it, two sequels that weren't as genius as the first, just makes the trilogy look really bad. Despite that, though, The Matrix Reloaded was somewhat confusing if you see this after the first back-to-back, but otherwise, it was pretty good."
    },
    {
      "rating": "6",
      "text": "WHile the action sequences are ramped up to a very exciting extent, it lacks the intelligent story arc that made the original stand out, and occasionally slips into self-parody."
    },
    {
      "rating": "6",
      "text": "The Matrix Reloaded is much bigger and brasher than its predecessor. It has a very good first act, which is engaging and develops the concepts of the first film in style. Reloaded becomes far less focused and borders on being incoherent as the film progresses. One of the main plot points is the return of Agent Smith (Hugo Weaving) and his newfound ability to clone himself since Neo \"freed\" him. As a plot device, this is as stupid as they come, but Weaving has fun with the concept by valiantly attempting a comic back-and-forth with himself. The rest of the returning cast again turn in good performances, though the development of the romantic relationship between Neo and Trininty (Keanu Reeves and Carrie-Anne Moss) is unconvincing and surprisingly immature. The action sequences are even more stunning than in the first film, particularly the hugely destructive extended freeway chase that will go down in history as one of the best film set-pieces purely in terms of gloss, complexity and scale. Though this massive visual extravaganza is impressive, my favourite scene in the film is far more understated - early on in the story, upon his arrival to the final surviving human city, Neo and Councillor Hamann (Anthony Zerbe) debate purpose, destiny and free will as the rest of the city sleeps, a simple scene, but an immensely human and emotionally grounded one. An increased reliance on not-so-subtle religious symbolism becomes a little annoying, especially in the film's final act, which in addition to being a bit pretentious is also lazy and dull. The Matrix Reloaded is decent in part, offering thrills and visual amazement, and the odd decent character moment, but an over-long, sometimes boring and often confusing plot, in addition to a lack of effective character development makes this sequel pale in comparison to the first film. It offers just enough new ideas to stand out from the crowd, and is certainly more entertaining and of higher quality than the vast majority of film sequels, but the Matrix Reloaded is certainly not as profound and clever as it thinks it is. It's a good blockbuster then, but not much more, and it unfortunately lead to the shudder-inducing final instalment of the series six months later..."
    },
    {
      "rating": "10",
      "text": "The second act in a film series is always a tough spot for film-makers and audience alike thanks to expectation. I remember the first time I saw reloaded being somewhat taken aback by the fact that neo wasnt quite as powerful as I was led to believe by the initial Matrix one prophecy. And yet, in the many times I have watched this film since 2003 my puny human mind has absorbed more of the little details that make up reloaded, animatrix, enter the matrix and revolutions and I now feel Reloaded really gives you that 'high' that the human rebellion are in force and ready to take on the agents for a change. A fantastic second act for the trilogy. The incredible freeway sequence alone is worth the original ticket price! Seminal action photography elevates what could otherwise have been a far more mediocre outing."
    },
    {
      "rating": "9",
      "text": "Eu amei!Não acho que ele tenha sido tão bom quanto o primeiro, na qual eu considero uma obra mais completa, porém, mesmo assim o filme me prendeu até o final. As cenas de luta são de tirar o folego. Eu me importava com os personagens, e vê-los lutar - junto a otima coreografia de luta e ost, fazem das cenas ainda melhor. Ainda não vi a continuação, mas me sinto triste por ter pensado que Matrix era só o primeiro..."
    },
    {
      "rating": "6",
      "text": "The Matrix deserved a better sequel. It’s not a bad film, but it wasn’t as memorable as the first film. Action was good and the effects were fine, but it’s just not the sequel that I wanted."
    },
    {
      "rating": "6",
      "text": "a ok sequel that didnt really capture what the first one was . there was some great action especially the highway sceane . but the film starts gettin really preachy with the whole choices thing . i felt like i was getting beatin over the head with it in this film as to where it was perfectly just lightly touched in the first film . also the rave sceane shoulda been cut it felt stupid and just didnt belong."
    },
    {
      "rating": "10",
      "text": "What a fantastic, epic, AWEsome sequel. I love the first, but man, I love this more. It's just so, addictive. The effects are beautiful, with captivating new characters, awesome fighting scenes and a great climax. In my opinion, The best of the trilogy."
    },
    {
      "rating": "6",
      "text": "Not highlander 2 in terms of a crappy sequel, but it’s close. Sad and disappointing..."
    },
    {
      "rating": "6",
      "text": "It was ok but not near as good as the first one. It was kind of boring at moments, but the action scenes were awesome. The biggest problem was that it took 45 minutes for it to get started."
    },
    {
      "rating": "10",
      "text": "This movie is outstanding. Its the perfect link between the first and second. It had a good amount of fight scenes and it teaches the viewer alot about the meaning behind the matrix and the plot. Unlike the last one, its about [spoiler]    Neo just realising what he is doing in the matrix, which was clear from the start. To much time talking in metaphors and not enough actually fighting (except for the last bit) [END SPOILER]Whilst in the first one, it was average as you werent sure if it had a cliffhanger ending or not. It didnt answer enough questions to finish it off as a series, but it asked alot of questions which kept it going.Considering it was made in the late 90's and had roughly a 4 or 5 year gap between the 2."
    },
    {
      "rating": "6",
      "text": "Unfortunately this movie doesn't live up to the expectations following on from the first movie but this was always going to be likely to happen. Looking beyond that it does keep the trilogy moving towards it's conclusion introducing and developing new characters and giving some insight into the inner workings of the Matrix itself."
    },
    {
      "rating": "10",
      "text": "I'm eager to see it!"
    },
    {
      "rating": "4",
      "text": "It was okay... The first matrix film is best."
    },
    {
      "rating": "2",
      "text": "....Ahhh....where do I even BEGIN with this one.... I looked forward to this movie (as did most Matrix fans) for sooo long, only to be soooooo disappointed. I was such a HUGE fan of the FIRST Matrix that I bought the DVD and probably watched it a dozen times. I read some reviews in the papers of Reloaded, and all of them seemed to give it high marks, so lets just say I was very excited to go see it Friday night. What a catastrophic let down. This movie should have been re-EDITTED, and re-WRITTEN before it hit the streets. HOW on EARTH could they have released it in its current form ?!!! This movie was long....waaayyyyy too long. Many scenes could have been trimmed or better yet, removed. The movie's beginning third was so long and boring that my friend and I kept looking at each other in amazement that the movie had been on for so long and STILL seemed to not have even started yet ! The dance/orgy scene and the quasi-sex scene was just plain out of place. It reminded me of those old 10 Commandments \"style\" movies where they tried to depict the sodom and gommorah sinners ....ahh.....who cares, you get it (I hope). I mean come on...Zion looked like crap...who would even WANT to live if they had to live there ?!!! That whole thing should have been just removed. At some point in the film you start to think that the movie is just one long fight scene, in a perpetual loop that you cannot escape from. All the fighting is redundant and brings life to the \"been there, done that\" statement. Don't get me wrong, the special effects and fighting were pretty cool, but don't keep repeating the same stuff all the way throughout the movie !!! Also, as one reviewer here has pointed out, at the end of the FIRST film, Neo was actually RE-WRITING the matrix. Now, to ME that means he can do whatever he wants, re-write the code for EVERYTHING and be basically invinceable, RIGHT ??!!! Nope, not according to this crappy sequel. If you were so powerful now, and could do anything at all, why would you even waste time \"punching and kicking\" computer enemies when you could just kill them in an instant ?!!! What was even more funny was when Neo was fighting all of that french guy's henchmen on the staircase....he gets cut by a weapon ! Now, how is it that Neo can defeat an AGENT, but has trouble with the \"normal-guy\" matrix bad guys ?!! Ohhhhh, man I am on a rant here, but its just sooo stupid. How anyone can give this movie a high score is beyond me. Maybe the simple minded among us are easily amused I guess. Well, its much too late to stop Reloaded now that it has entered the theatres...its out there, sucking badly, and will no doubt still make money from those who are just curious about the hype, or true fans of the first film who have to see it just because they are a fan....horrible sequel or not. My opinion upon leaving the theatre was that they could have (probably) done a LOT of editting to shorten this film, and then ADDED the 3rd part to it, to make ONE half-decent sequel. Unfortunately we will have to wait until the 3rd installment to see if number 3 can make up for the failings of (approppriately numbered) \"number TWO\". And, as I mentioned earlier...I OWN the DVD of the first Matrix, but I can guarantee you that I will NOT waste my money on the second. The creators of Reloaded should be ashamed of themselves. Period."
    },
    {
      "rating": "2",
      "text": "Sorry if I let all of you down everyone, but I didn't like it like I liked the first one. I know this is the middle of the trilogy, and middles of trilogies tend to be a bit weak, but how is that supposed to make you like it? Yes, there was much meaningful philosophy, but it didn't seem to make me look at the world differently. The plot is well-written, but it seemed many of the situations abused it and made the film look weaker. The dead acting wasn't there for a reason. The all-powerful characters were cool, but not ones I cared about. Neo is basically like Superman; he can fly and do supernatural things, but also like Superman, there's really nothing that can kill him (unless in Revolutions if we find out there is one thing that CAN kill him, and I'd like to see that). But really, liking or hating Reloaded is really a matter of opinion. You can't force someone into liking or hating it, that's dumb and abusive. And I'm not one of those super-idiots who says \"It's for geeks only\", because that's not true, and I myself am a geek. But there were so many things I didn't like about Reloaded (the corny dance and sex scenes, the action scenes that had no purpose [I'm not talking about the car chase scene or the Neo vs. the 100 Smiths scene], dead acting from the heroes of the movie, too many cold settings, and other things) that no one here in Metacritic really had a good explanation for, that I just didn't enjoy it. OK, throw your insults at me. (Dan. B, if you respect opinions so much then leave the ones who didn't enjoy this movie alone! Most of the reasons were given out by opinion, which has nothing to do with how smart you are. For crying out loud, this isn't Lord of the Rings!)"
    },
    {
      "rating": "10",
      "text": "The Matrix trilogy is awesome, there's no movie like this before."
    },
    {
      "rating": "0",
      "text": "Why?"
    },
    {
      "rating": "10",
      "text": "I really enjoyed this movie because it has got a very interesting story. Furthermore, it's got great fight scenes, amazing special effects, very good, convincing acting, It's a bloody good movie. You'll definitively enjoy it."
    },
    {
      "rating": "4",
      "text": "The first one was alright, but this has got to be one of the worst sequels ever. Zion is one of the ugliest settings ever, and is it me, or did the Architect speak in gibberish?"
    },
    {
      "rating": "0",
      "text": "The matrix is the best movie that I have never seen. I like a lot! The actors and the story are great!Definitely a great movie!!! I cried through the whole thing."
    },
    {
      "rating": "9",
      "text": "Lacks the shock value of the first film, but builds on its ideas. The stunts are spectacular, and the special effects are, for the most part, great. The most powerful scene is definitely the Architect scene. It creates a few questions: 1. How old is the Matrix REALLY? 2. How real is the real world? 3. What the hell does vis-a-vis mean???"
    },
    {
      "rating": "3",
      "text": "Sorry for the cut and paste--I\"m lazy, but still honest (this is my Matrix Revolutions review--somehow it holds true)Should never have been made.The original was really fun, but all that came after are crap... just plain crap.What else can you say.... watch The Matrix, forget the rest!"
    },
    {
      "rating": "6",
      "text": "My least favorite of the three movies. What a shame the sequels sputtered out or this Trilogy could have been the most epic in the history of film making. Could have been our generation's STAR WARS. Woulda, Coulda, Shoulda."
    },
    {
      "rating": "5",
      "text": "Not very good, sorry. The first one was unbelievable, but with this one it almost betrays the first one. Neo is way overpowered making it less fun, the settings are creative but hideous, and the action is so cheesy it's not even like the first one, though some parts definitely are. It at least provides a good enough time to be worth renting, maybe not to own."
    },
    {
      "rating": "9",
      "text": "Contrary to everything we know about trilogies, the sequel to the Matrix is considered to be the best of the three films. The reason is simple, as this is where we get into the heart of the story. The first film was equivalent to the pilot episode of a TV show, where we are introduced to the characters, terms, and locations. In the second installment of the Matrix we are introduced to the real struggle and get a look inside the legendary underground city of Zion. The humans there have learned of a plan by the machines to tunnel through into the city and want to come up with a way to stop them. While Morpheus (Laurence Fishburne) believes that Neo (Keanu Reeves) is the key to stopping the whole thing, most of the other are skeptical. In Reloaded, Agent Smith doesn't play as large a role as in the first film, for that matter, neither does the Matrix itself, which makes it almost like a stand alone rather than a sequel. Reloaded isn't just a great Sci-Fi story as it features one of the best action sequences and chase scenes I have ever seen, following the groups interaction with the Merovingian. While the film was great and does top the original, the Directors once again tried to use never before seen special effects. While it worked well in the first film, it doesn't help the second. Many of the fight scenes with the agents become so computerized, that at points they actually seem to be animated, and those scenes hurt the film. Other than that minor inconvenience, I can't find anything wrong with this film. It is Science Fiction at it's best, featuring an perfectly cast group of actors, some edge of your seat intensity, and of course a very unique story. All that makes the Matrix Reloaded one of our must see movies!"
    },
    {
      "rating": "9",
      "text": "It's not the perfect film that The Matrix was, but it did hold the most promise and for me it was probably one of my most anticipated movies of all time. As my expectations were unrealistically high they were only partially met. Most people probably switched off during 'the Architect speech' but that philosofical **** was the best part of the film and raised allot of questions and food for thought concerning the closing chapter. This was the only film I ever saw twice in the cinemas :)"
    },
    {
      "rating": "5",
      "text": "For an action movie The Matrix Reloaded is pretty boring. With much less time spent in the Matrix in comparison to the previous film and long dragging sections that are devoted to boring romance sequences. The largest problem is that where The Matrix managed to get you invested in the characters all The Matrix Reloaded does is make you annoyed with them."
    },
    {
      "rating": "9",
      "text": "Alright, I admit after seeing this in the theater the first time I walked out of the theater at the end with mixed opinions. I basically told everyone I wasn't sure if I liked it I'd have to see how they end it in the third movie. But after seeing the final part and then watching the entire movie trinity in order a second time later this and the last one have grown on me. The entire trinity is imo pure genius and has a profound philosophical/spiritual message but it is not obvious what this is. The second and the third movie are especially difficult to understand. Let me just speculate, if we look at Hindu cosmology (from which Buddhism also later arose) then possibly The Architect, Merovingian Frenchman and The Oracle represent the Hindu God Trinity: The Architect = Brahman the Creator, The Merovingian = Vishnu the Preserver (since he likes to preserve things from former Incarnation of the Matrix and The Oracle is Shiva the Destroyer (because she wants to destroy the old ways and bring about the new way of peace and she's also constantly smoking cigarettes which is a self-destructive habit). But that's just my opinion, feel free to interpret the trilogy however you want. This movie basically breaks down many assumptions we have about the matrix we gained in the first movie. The part where Neo is able to stop the machines in the real world is really confusing to the viewers too. How he does this is never clearly answered even in the third movie. Three possible theories I have are: 1) Zion and the outside world are just another layer of reality inside the matrix created to fool the people who escape the inner layer of the Matrix that they are free. 2) Neo is actually a machine himself (or possibly the cookie the oracle gave him lets him carry a machine program somehow, after all in computer lingo a \"cookie\" is a small piece of data you give to a user visiting your website so you can track them), 3) Neo has achieved enlightenment inside the matrix but a side-effect is that he's also achieved enlightenment in the real world, in Buddhism for example it is said there are high-level monks that can bend reality melting snow with their minds and/or make thing materialize out of thin air, etc.. It's possibly Neo's enlightenment lets him do something similar in the real world. Any of these explanations work but we never really know what the creators of these movies really intended since they have stated they would rather let us figure out things for ourselves. Other than being confusing for the viewer one other part I didn't like was the love-making scene between Neo and Trinity, the reason is the way it broke out into the cheesy Rave/techno style music. This should have been some Enya/Tantric spiritual style music imo, the rave music just made it really cheesy. The fight scene with Neo and the multiple Smiths went on way too long too. But overall this was a great movie. I give the entire trinity 10/10 but this movie I give a 9/10."
    },
    {
      "rating": "8",
      "text": "I don't get why people hate this. This is good as the first one. Good action and good philosophy. Good entertainment value this has."
    },
    {
      "rating": "3",
      "text": "It's just awful! A horrible, and needless, sequel to a cult classic. The story makes little sense and is trying its hardest to be clever, yet all it manages to really do is undermine everything set in the first movie. There are some decent action sequences and the FX are OK, but it is not enough to save this obvious cash-in. Overall: For shame!!!!!"
    }
  ],
  "recommendations": [
    "the_matrix_revolutions",
    "maze_runner_the_death_cure",
    "300_rise_of_an_empire",
    "maze_runner_the_scorch_trials",
    "mortal_engines",
    "the_hobbit_the_battle_of_the_five_armies",
    "avengers_age_of_ultron",
    "battle_los_angeles",
    "captive_state",
    "mad_max_fury_road",
    "hardcore_henry",
    "the_purge_election_year",
    "infinite",
    "transformers_the_last_knight",
    "jupiter_ascending",
    "inception",
    "pacific_rim",
    "blade_runner_2049",
    "equilibrium",
    "jurassic_world_fallen_kingdom",
    "source_code",
    "the_5th_wave",
    "they_live",
    "sicario_day_of_the_soldado",
    "sunshine"
  ]
}