{
  "id": 2799,
  "title": "The Irishman",
  "starring": [
    "Robert De Niro",
    "Al Pacino"
  ],
  "runtime": 209,
  "genre": [
    "Crime",
    "Drama",
    "History"
  ],
  "description": "Pennsylvania, 1956. Frank Sheeran, a war veteran of Irish origin who works as a truck driver, accidentally meets mobster Russell Bufalino. Once Frank becomes his trusted man, Bufalino sends him to Chicago with the task of helping Jimmy Hoffa, a powerful union leader related to organized crime, with whom Frank will maintain a close friendship for nearly twenty years.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mbm8k3GFhXS0ROd9AD1gqYbIFbM.jpg",
  "categories": {
    "plot": 7.264705882352941,
    "acting": 6.657894736842105,
    "ending": 6.166666666666667,
    "soundtrack": 9.0,
    "cinematography": 6.333333333333333,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "What an incredible film - an epic. The performances, across the board, are tremendous. So amazing to see Jonathan Morris back in his vestments, by the way. He provides a subtle but important frame to the film - nice uroboros. Joe Pesci is just phenomenal - I truly hope he picks up at least a supporting actor nom for his performance, if not a win. The dialogue is pitch-perfect.  Just an amazing job by Scorsese."
    },
    {
      "rating": "1",
      "text": "A huge (and lengthy) swing and a miss from Scorsese, De Niro, and Netflix. The plot was meandering and directionless, the writing stale and regurgitated. There were several scenes involving dialogue between two characters in which they argued about minor inconsequential details, repeating those details back to one another through numerous camera changes, and the viewer is left wondering, \"Did I just sit through 30 seconds of another meaningless conversation about whether the mob ‘really means it this time'\"? I would need to watch those scenes again to be sure (I won't) but it didn't seem like those scenes had any higher purpose other than showcasing the editor's boredom with the subject matter (or maybe Netflix's budgetary desire to limit the best directors and actors of our generation to one take).Aside from complaints about De Niro's believability as Irish, his acting was wooden. Pacino occasionally shone as Jimmy Hoffa despite some difficult dialogue, Joe Pesci was solid in an understated performance, and Stephen Graham turned in a typically excellent, nuanced portrayal of simmering anger beneath an outwardly gregarious exterior. There are a couple superior moments, one involving a vodka-spiked watermelon, and another with some great dialogue between Louis Cancelmi and the perpetually confused Jesse Plemons regarding the provenance of a nonexistent fish. Ray Romano was largely forgettable—although that may have been the point—but appearances by Anna Paquin, Harvey Keitel, and Bobby Canivale were entirely wasted. At three hours and thirty minutes long, I kept hoping there was enough time for a clear throughline to emerge, but as the movie shifted in the last half hour to bludgeoning the viewer over the head with scenes of a man contemplating his death and haggling over caskets, I realized that like De Niro's Irishman, there would be no redemption for this movie. Instead, it is simply Scorsese's meandering, aimless final run with some of his mobster-portraying pals.Unfortunately The Irishman is not even close to being in the same league as his other work. If you'll excuse me, I need to go watch Goodfellas, Gangs of New York, and The Departed on repeat for the next several days to erase the memory of this dud. It'll be a much better use of my (and anyone else's) time."
    },
    {
      "rating": "8",
      "text": "Maybe not Scorsese's best film but brilliantly-made nonetheless, with all Scorsese's trademarks and great acting."
    },
    {
      "rating": "9",
      "text": "Stunningly! Great acting, shooting and editing.  This is the case when time flies by, both for the heroes of the film and for the audience, despite the very long timing..."
    },
    {
      "rating": "10",
      "text": "This sprawling mob epic/ intimate character examination/ eulogy to a lost film era, is a gift. Through all three and a half hours of The Irishman, I was awash in a kind of deep gratitude. I had the surreal sensation of witnessing an all-time classic reveal itself before my eyes. It was like discovering The Godfather in 1972 or Goodfellas in 1990."
    },
    {
      "rating": "8",
      "text": "This has to be the last hurrah for the great De Niro and Pesci, doing another Scorsese flick together.  Here they are not always believably playing young(ish) men some of the time.  If this was just a gangster flick, it would not be a great one, but it is memorable because it is more than that.  This is a tale about morality and loyalty.  It presents the life story of a decent, loyal guy, a devoted family man and trustworthy buddy - who is also a crook and a cold-blooded killer, a Mafia operative and hit man, a guy who would shoot a friend in the face or the back if it was called for.  The long ending and slow start recall the films of an earlier era, as does the prolonged presentation of the Jimmy Hoffa story."
    },
    {
      "rating": "8",
      "text": "A beautiful story that's been well written and beautifully portraited by a talented cast.The production design, specially the cinematography and costume design, is brilliant.The actors had put their best effort to show us something new; although at some points their age is distracting both them and the audience.Despite the well resulted partnership of Scorsese and Schoonmaker, some parts of the movie suffers from bad editing."
    },
    {
      "rating": "10",
      "text": "The Irishman. A painter who didn't paint the walls with paint. Very high cinema, if I may say so. A bit similar to Goodfellas, but this film is one level higher. The protagonist as Robert De Niro is great. You worry about him, you understand him."
    },
    {
      "rating": "10",
      "text": "A fascinating watch - totally worth the 209 minute run time.There's so much to like about 'The Irishman'. From the top class performances, the ace cinematography, the excellent music and, most importantly, the captivating plot. I enjoyed this more than (the great) 'Goodfellas', which is my only previous experience of a Martin Scorsese film.Robert De Niro is always a fantastic watch and here he is no different, I absolutely loved every scene of him as Frank. Al Pacino (Jimmy) and Joe Pesci (Russell) are also superb, Pacino particularly. Away from those three, you also have Ray Romano, Bobby Cannavale, Stephen Graham and Harvey Keitel involved. Awesome cast.No idea how true to life it is, all I care is if it delivers a fantastic film - and it undoubtedly does. I felt entertained for every second. The de-aging effects are cool to see, also. I understand why some may fault this. Me? Loved it!"
    },
    {
      "rating": "9",
      "text": "There's not much to say: a masterpiece with a terrific cast and one of the best (if not THE best) De Niro acting performances. Anyway, I suggest watching it at home in 2-3 sessions, like a mini-series, because it's simply too long and not paced enough to be enjoyable in a single session."
    },
    {
      "rating": "8",
      "text": "I have not seen nearly enough Scorsese films, but this one clearly relates to his past works and reflects on them from a matured point of view. The music was purposeful and the performances were extremely believable. Not much more Io say about it than that."
    },
    {
      "rating": "10",
      "text": "It's an incredible film. The story, actors, soundtrack ... everything is well done. One of the best mafia movies I've ever seen."
    },
    {
      "rating": "10",
      "text": "Movie for real adults. Had a big pleasure to watch it. Fabulous!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "I haven't seen many Italian mob films, but I feel like I might have hit the upper echelon of mob films with this one. The characters were phenomenal and very well played out, the choice of actors and actresses were on point for the characters too. I really liked that it felt as though I was in Frank's mind as he was telling the story, it really pulled me in. All in all it's a fantastic film and I would recommend it if you've got three hours to spare."
    },
    {
      "rating": "9",
      "text": "Long film, please be ready for a long night!The story is very good, it's layered well and has a good pace throughout which is hard for a film this long, amazing cast boosts this to a 9. If it was maybe 45 mins shorter it could of been a 10."
    },
    {
      "rating": "10",
      "text": "My favorite film, Scorsese know how to make a ganster movie and use his characters."
    },
    {
      "rating": "10",
      "text": "A very good epic movie with great cinematography and great actors (Pacino, Peski and De Niro). Recommended if you're like crime movies."
    },
    {
      "rating": "8",
      "text": "i can say irishman in one of the best scorseses movie especially alpacino played very well in jimmy hoffa role The Irishman may have been weaker than other Scorsese films, but in biographical and crime genre was relatively good."
    },
    {
      "rating": "10",
      "text": "Well made, character-driven drama with extraordinary performances by all. The world building and attention to detail really invests you in the story. It manages to balance realism and no frills grit with entertainment value very well.One of The best movies of The year, Maybe even of decade."
    },
    {
      "rating": "10",
      "text": "One of  best, and the relationship between Pacino and Deniro may be the real heart of the film, Joe Pesce's brilliant performance grounds the whole story. Great )"
    },
    {
      "rating": "9",
      "text": "You could feel the characters. The plot was real-ish and it kept your interest from beginning to end."
    },
    {
      "rating": "10",
      "text": "From the opening shot to the final shot, Scorsese manages to captivate the audience. A team effort indeed with De Niro in the center of it all. Scorsese could have sacrificed an hour because three and a half hours is just under the runtime of Taxi Driver and Mean Streets put together. However, the ensemble cast and the music saves the movie. Another great collaboration from De Niro and Scorsese."
    },
    {
      "rating": "10",
      "text": "An entertaining gangster epic that is profoundly powerful, has many layers and a haunting ending."
    },
    {
      "rating": "8",
      "text": "While The Irishman is indeed another beautifully directed film by Scorsese, the film is a really perplexing film. Let me elaborate.Firstly, I really enjoyed it. It might even crack my Top 5 Scorsese films, however, as great as the story is - the movie is just way too long.With being 3hrs long, you’d have to say something could be cut, but the strange thing is - I couldn’t tell you what to cut... It’s seamless. Each scene flows, for the most part, and sure some of it drags, but it all leads up to one hell of an ending. Each component is necessary for understanding the characters - so... if you have 3 hours to spend on watching a film. Go for it. Scorsese doesn’t disappoint."
    },
    {
      "rating": "10",
      "text": ", click expand to view"
    },
    {
      "rating": "7",
      "text": "The Irishman is a satisfactory movie, but no more than that. It shines through in some aspects due to it's strong cast and interesting story...but for me, the duration and the quantity of stories happening at the same time, while we go back and forth in the timeline, made me get a little lost and misunderstand some points in the narrative. Talking about the timeline, another downside is that the story is too flat, meaning that, in the duration of the movie, all the stories told are very simmilar with no action or drama to make them outstand.In summary, even though, in the beggining the plot called my attention (so did the cast), the movie is not a big deal, but if you are free for a couple of hours, it can - maybe - distract you."
    },
    {
      "rating": "10",
      "text": "The last great american gangster movie. It's just great, those great actors back for one last movie. I rewatched it 3 or 4 times and I just keep  observing new things."
    },
    {
      "rating": "10",
      "text": "What to say ? This movie is very beautiful, unique characterizations and one of the best movies I have seen.One of the best Martin Scorsese moviesWith Al Pacino, Joseph Pesci, Robert de Niro, what else do you want from this film?This movie is uniqueFor God see this Movie."
    },
    {
      "rating": "9",
      "text": "long, but good. The scenes with CGI were kind of trash imho. The movie should have been done in two parts probably. Cool story. My friend Austin loves it."
    },
    {
      "rating": "8",
      "text": "Of course, Scorsese delivers a stunning, gangster flick but The Irishman is so much more, a melancholy eulogy for growing old and losing your humanity. Savour every one of its 209 minutes, you won’t regret it."
    },
    {
      "rating": "5",
      "text": "The Irishman was alright, but just alright, capice. After you've seen all the mob movies, and especially the ones from Scorsese, you've seen this before, done better.  This time you get taken out of the narrative by \"de-aging\" CGI that makes everyone's face look like plastic monsters with glowing blue eyes.  I don't know what's going on anymore when the professional critics are giving this mediocre piece of work a 94.  I give it a Meh.  The most dishonest part of this movie is the main character acting as if he's an \"omerta\" guy far after everybody else is dead, but then again, we wouldn't have had this movie if Sheeran hadn't started telling anybody who would listen, his and every body else's story which was published in the book \"I Heard You Paint Houses\"."
    },
    {
      "rating": "6",
      "text": "Sure, a good movie...but only when streamed to a home screen. A breakless 3 hrs 30 min in a cinema is too long for a dubious yarn based on the geriatric memory of an American mobster.  Scorsese's earlier Casino & Goodfellas were shorter & more densely packed"
    },
    {
      "rating": "5",
      "text": "The plodding and elegiac parts may put some to sleep but now that it can be streamed, you can always stop the action for relief. Not necessary to see on the big screen if you have Netflix. Good performances are worth watching. Why didn't Peggy (Anna Paquin) have more say or were her facial expressions enough for the film's moments of conscience?"
    },
    {
      "rating": "10",
      "text": "Irishman is not just a movie, it's a piece of Art. Art of directing, acting, writing, editing & ...And its gonna be happen: Al Pacino's second Oscar. let me clarify this; De Niro & Pesci are great but if I just wanna tell you frankly, this picture belongs to AL PACINO."
    },
    {
      "rating": "10",
      "text": "Easily one of the greatest movies of all time, a true instant classic and exposes how poor cinema has become in recent years. Its a must watch."
    },
    {
      "rating": "4",
      "text": "3.5 hrs of Boredom, this movie drags. The characters are uninteresting and is outright bland"
    },
    {
      "rating": "4",
      "text": "In which a geriatric unironically refers to another geriatric as \"kid\". Also, Pacino reprises his role from \"Jack and Jill\"."
    },
    {
      "rating": "10",
      "text": "A Master Class in Film-making This film will doubtless go down as \"The Godfather\" of its generation, with Pacino and De Niro both on hand to assure continuity. Neither of them has done anything remotely as brilliant as this in decades, and the great revelation of the film, Joe Pesci, hasn't done anything at all. It has taken Scorsese's alchemy, back at its peak, to bring the three of them together in ways that surpass the sum of their considerable parts"
    },
    {
      "rating": "6",
      "text": "Al Pacino is having the time of his life here, but this just leads me to reinforce my opinion that Scorsese is at his best when he's *not* telling stories about navel-gazing crooks."
    },
    {
      "rating": "6",
      "text": "Ultimately this film is a tad on the boring side, and utterly self indulgent. I enjoyed the last hour or so, but the first hour in particular was a real slog to get through and I actually watched the film in 3 sittings, not due to time restraints, purely as I became too bored to continue twice. The casting of Combo from This Is England (I forget his name, some scouser) was dreadful, his attempt at the accent - I think it was New Jersey or similar, is absolutely dreadful and really stands out, easily the worst part of the film for me and he ruined every scene he was in. The real travesty in the film was the anti-aging used, it simply doesn't work. It's OK making De Niro look 50 again, but when he moves like an old man it's unintentionally hilarious, a scene where he beats someone up had me in stitches, you could blatantly tell it was an old man doing it, with some silly Toy Story style cgi making his face look younger. Of course you get the standard Rolling Stones song thrown in as per usual as well, I'm not sure if the director is unaware it's a parody now how he crowbars the same damn tune into every film he makes or he's in on the joke. I've given it a 6/10 as like I said, I enjoyed the last hour, and Joe Pesci is fantastic in it, it's really a shame he doesn't act anymore and I've really missed him the past two decades. Pacino however, well he's the same old hammy, shouty, over-acting self and it's clear why Scorsese hadn't worked with him previously - the guy can't act, and De Niro is De Niro, the man has one style no matter what role he's taking and his constant sniffing and breathing in only gets worse now he's ancient. All in all though, it's clearly a vanity project by Scorsese, and a last chance for him to get all his doddery old fart friends together before they all start dying. I'm baffled how this film is being lauded so highly, it's very mundane and in parts will make you almost fall asleep, De Niros performance is phoned in, Pacino is as awful as ever, the CGI is immersion breaking, when Gimme Shelter comes on AGAIN in a MS film you'll either laugh or roll your eyes, the Scouser playing an American stands out like a sore thumb and it's at least an hour too long. The only redeeming feature is the excellent Joe Pesci. If not for him appearing, and a decent last hour then I don't think I'd rate it any higher than a 4. It's clear to see why this ended up on Netflix, it's simply not good enough for a theatre release and people would have either walked out through sheer boredom, or fallen asleep. It'll be a real shame if this ends up being the last Scorsese film, or the last time you see Pesci and De Niro together as quite frankly, the film is dogsh**."
    },
    {
      "rating": "4",
      "text": "Very sad to see Scorsese, De Niro and Pacino go under in this meandering, bloated, repetitive mess of a film. At least Pesci is touching as one knows this is the end of his (not his character).And that is the point: We watch these 3.5 hrs out of nostalgia. We are not watching a film, but some old friends reminding us of what they were, and which will disappear soon. It has a very wretched depressing Quixotic feel..."
    },
    {
      "rating": "6",
      "text": "Just saw this last night on the big screen and the experience was inherently contradictory.  I didn't care one whit about anyone on screen or anything that was happening... yet somehow, despite the length, I remained engaged.  I'm hard pressed to think of a film with so much talent, made with such a high level of craft and artistry, made about people I had no investment in.  It was odd.  The only reason I cared at all wasn't b/c I had a relationship with the characters, but with the actors, the filmmaker and the genre.  The film is intrinsically bound to its pedigree and that makes it interesting to anyone who has watched these careers unfold over lifetimes... But it doesn't make it inherently a good movie."
    },
    {
      "rating": "9",
      "text": "The Irishman is a reflective, meditative, beautiful film from the master, Martin Scorsese. This is one of the most profound movies I have seen all year. The story is a sprawling gangster epic that truly leaves no stone un-turned. The brilliance of the story is that it does not romanticize the gangster lifestyle, but truly shows the curse of a man punished with longevity for his actions.The acting is incredible all across the board. Robert De Niro gives a virtuoso performance. Al Pacino chews the scenery in a way that is both magnificent and desperately heartbreaking. Joe Pesci makes a triumphant return to the big screen, and he is arguably the best part of the film. The ensemble supporting cast of mobsters and political figures are all so charming and serve to fill up this world to its brim.The de-aging technology used on De Niro, Pesci, and Pacino was expertly implemented. I actually didn't mind it at all, and it was used in such a way so that it actually served the story rather than distract from it. It's absolutely remarkable to see.The movie is not perfect, however. It is 3 and a half hours long, and I felt every minute of that run time. I actually started to get anxious over sitting in one place for so long. Also, I felt that the way the story was told, through the characters playing telephone, got very repetitive and it sometimes sucked the life out of the movie. All in all, this is a masterpiece from a master of the craft. Definitely do not miss it!"
    },
    {
      "rating": "2",
      "text": "Simply put, this movie is not for me. A movie that is 210 minutes long, with actors WELL past their prime. The CGI makes the actors look fake. Simply do what they have been doing for decades, have someone else play the actors in their younger years. I love football, but I don't want to see a 63 year old Joe Montana take the field. Where are all the up and coming directors and actors? Retro is cool as retro. But when you try to make it a part of today, it folds like a cheap chair. This movie is a one time watch for me."
    },
    {
      "rating": "8",
      "text": "Everyone will talk about De Niro and Pacino, and rightfully so, but it’s Joe Pesci that stole the show and broke my heart."
    },
    {
      "rating": "5",
      "text": "Great performances, but best movie of the year? Not even in the top 5, imo, amongst what I've seen. Very little drama, suspense, or emotion. And the women in the film speak about 5 lines. I was supremely disappointed."
    },
    {
      "rating": "8",
      "text": "Yes, it is TOO LONG. I didn't feel like the movie needed to be three and a half hours long to tell the story it wanted to tell. I feel like the main theme and the point of the movie could've fit perfectly in a two and a half hour long movie. At points it seemed like the movie dragged too much. There were a lot of scenes that were just boring because of the uninteresting situation, but those scenes were saved by wonderful performances. That is a point I will not deny: The performances are just fantastic. Probably one of the best acted films I've seen all year. This is a movie in which I don't know how to feel, because, like I said, at points it lost my interest, but at other points I thought it was the best film of the year. Its good moments are fantastic and to me, the ending saves the movie completely.Besides the overly long runtime, I noticed some editing and sound issues. I don't know but at points I noticed that the ADR was poorly edited. At some points I saw a character move his lips and there was no audio or it was delayed. There was one point in the movie where there was an editing mistake that felt so amateur: There was a shot and then abruptly cut to another shot, like if the editor messed up. Also there is a scene where the characters are at like a party and, while it's not a crowded and loud place, the scene sounded as if the characters were in a quiet room with a radio playing music in the background, so distracting.Other than that, I feel like this movie was great. I know this might not be a movie for everyone. It has tons of complicated dialogue and the movie relies heavily in dialogue and narration. There's little to no visual storytelling or music (specifically, original score). This movie is tedious but I don't think it's bad or boring."
    },
    {
      "rating": "5",
      "text": "What is going on with all those 10/10? Are people blindly praising this movie just because it's Scorsese? It's a 6 at best. 3 and a half hours of mediocre plot, cliche characters, some good acting (Pacino) and weird-looking de aging. And as hard as they tried you can't hide the fact that our favorite actors are old. You can cover their faces with CGI but you can't de age their movement and body language. They look tired, except Pacino, that man will scream himself to the grave. I like to rewatch other Scorsese movies from time to time, because those are great films. I don't really want to rewatch \"The Irishman\" again. What a shame."
    },
    {
      "rating": "6",
      "text": "Aside from the awful CGI de-aging effects, which don't work at all except to constantly remind the audience they're watching a famous old actor pretending to be younger, this movie is just off somehow.  It doesn't have the greatest of introductions, and it suffers from bad pacing throughout.  As it is, it's a challenge to remain invested in the story despite good characters and subject matter.  Scorsese seems distracted here, and his usual energy is missing.  Worth a watch, but given its length it will feel like a slog at times."
    },
    {
      "rating": "10",
      "text": "Una película de mafiosos más basada en la amistad que en el poder en sí, aunque este tema se mantiene fuerte en toda la película. Es larga, y por momentos te perdés, pero la fuerza de la historia y el final, la hacen una película merecedora de una alta nota"
    }
  ]
}