{
  "id": 4149,
  "title": "The Happytime Murders",
  "starring": [
    "Melissa McCarthy",
    "Bill Barretta"
  ],
  "runtime": 91,
  "genre": [
    "Action",
    "Comedy",
    "Crime"
  ],
  "description": "In a world where human beings and puppets live together, when the members of the cast of a children's television show aired during the 1990s begin to get murdered one by one, puppet Phil Philips, a former LAPD detective who fell in disgrace and turned into a private eye, takes on the case at the request of his old boss in order to assist detective Edwards, who was his partner in the past.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rWxkur51srfVnMn2QOFjE7mbq6h.jpg",
  "categories": {
    "plot": 4.9523809523809526,
    "acting": 3.6666666666666665,
    "ending": 2.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.055555555555555,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "It really is a funny movie. It's not the best comedy in the world and it wasn't perfect, but it's silly stupid humor at its best and me and the wife really enjoyed it. It doesn't deserve the >30% rating. If you like the trailer, give it a shot."
    },
    {
      "rating": "3",
      "text": "I really didn't know what to expect from The Happytime Murders, and that's why I went to see it. I wasn't sure if I'd be getting Team America or Roger Rabbit, maybe even a combination of the two. Despite the tagline, that the film wasn't suitable for children, I did expect some level of juvenile humor, but I thought if it has a edge to it and if the mystery is somewhat compelling, maybe it would surprise me, it didn't. Much in the same way that Roger Rabbit had humans and toons living together, with an extreme bias against toons, this world has humans and puppets living together, with a bias against puppets. Phil Phillips (Ryan Tran) claim to fame was as the first puppet to be a police officer, but now he's washed up, and it's brother's fame and his TV show, The Happytime Family, that overshadows him. Phil doesn't care about anything anymore until someone starts killing off the Happytime gang, including his brother, that's when he wants back in, even if his human partner, Connie Edwards (Melissa McCarthy) wants nothing to do with him anymore. The tagline said this film was not intended for kids, but I disagree, because that's exactly who this film is intended for. The comedy is nothing but sex and jokes aimed at a very young crowd. There is no way that adults are going to find most of the comedy in this film even remotely funny. As for the \"dramatic\" side of the story, the mystery isn't such a mystery, it's so simplistic that you'll know before the first murder even happens. But what about the star of the film, Melissa McCarthy? Well, she plays the same role in just about every film doesn't she? Sometimes it works and sometimes it doesn't, here she just adds to the futility of everything. The bottom line on The Happytime murders is that the story is too basic, the backstory is a complete rip off of Roger Rabbit, and the jokes are so low-brow, that I think even Trey Parker and Matt Stone would pass on using them in a similar film. The true joke here is that this film was ever made."
    },
    {
      "rating": "1",
      "text": "You know why Team America was a comedy hit? Quality and dedication to the actual puppetry; Convincing and developed story-line and characters; It was actually funny to the point where lie-actors could have done the lines (the puppetry was there to make it even funnier). 'Happytime Murders' misses on all three levels. You get generic and completely amateur-time puppets both in look and delivery. A carbon-copy of the Roger Rabbit movie, and just brief setups for quick and stand-alone jokes or situations which kinda miss or get tiring halfway through the movie. If you only see the first 20 minutes you'd walk-away somewhat entertained."
    },
    {
      "rating": "7",
      "text": "With no subtlety, the film lives up to what was expected of us. Surprisingly, for those who like this comedy style, the film becomes unique, with its vulgar humor always making appearances. The way in which production conveys information to the public and performances by puppets and humans is also noteworthy. Just its simplicity in the storyline that leads to the inconvenience, especially in its conclusion. 7.0/10"
    },
    {
      "rating": "3",
      "text": "What is this monstrosity of a film. Its dumb the humor is horrible and the script is awful this was a waste of time and money its not worth the ticket the only good thing about this movie is when it ends well thats all the good in this monstrosity."
    },
    {
      "rating": "5",
      "text": "I thought these trailers looked truly awful, so maybe that low bar made me not totally hate my experience. It’s low-brow and one note, but watchable. Take that for what it’s worth."
    },
    {
      "rating": "3",
      "text": "Even though this is NOT a Muppets movie (and lost a suit by the makers of \"Sesame Street\"), the director is Jim Henson's son Brian. It takes place in a world where puppets and humans coexist, but the stuffed creatures are largely scorned. When the cast of a popular TV show starts being killed, a washed-up puppet detective and his old partner (Melissa McCarthy) team up to solve the case. The selling point (and potential source of much raunchy humor) is the streetwise, foul-mouthed, even X-rated approach to puppets. Notice I said \"potential.\" Even though the energy keeps it from being boring, it's never funny. When will writers learn that F-bombs don't make a line hilarious, especially when it's used in almost every sentence."
    },
    {
      "rating": "5",
      "text": "This low brow comedy has a few crude laughs. There's even a story to follow and a not too subtle message about tolerance. If you have a disdain for \"serious\" movies, you might even find it worth your time. This is particularly true if your air conditioning is on the fritz on a hot summer night. Just be sure to keep you expectations in check. Everyone else is best to keep away. There's no need to stay for the long closing credits which pad the film's 91 minute running time."
    },
    {
      "rating": "3",
      "text": "This film reminded me of ''Sausage Party'' and not because they're similar but because they both use vulgarity, absurdity and coarseness as their pretext for comedy, forgetting about real humor and actual jokes and the result it's very self-evident: It failed miserably.Maybe the best news about this film is that it's failing at the box office, so Melissa McCarthy may disappear for a while."
    },
    {
      "rating": "3",
      "text": "After films like Team America and Sausage Party show different types of films that decide to go raunchy and vulgar, you really need to step up and hit on your material and unfortunately The Happytime Murders is a swing and a miss. Vulgar puppets from the world of Jim Henson has its chance to be funny but 90% of the jokes fall flat and you're left with a 2nd rate murder mystery. When you decide to make a gimmick film you better deliver this one doesn't. Overall high 3 D+"
    },
    {
      "rating": "0",
      "text": "This is what happens when a creative genius' son shows the world what a pervert he is. Should have kept it a secret."
    },
    {
      "rating": "9",
      "text": "Yes, The Happytime Murders isn't the first raunchy puppet movie (Meet the Feebles) or even the first story to treat puppets as second-class citizens (the short-lived show Greg the Bunny). But it is hilarious, I laughed a lot.The film has a lot creatively insane jokes. Yet, despite the craziness, the film does have a decent plot to it. Though, admittedly it does have a lot of detective/noir cliches to it.The human cast is surprisingly good in this considering that they have to act with puppets most of the time. Melissa McCarthy, Elizabeth Banks, and Maya Rudolph all put in some of their better performances. In fact, I think this is the best I've seen Maya, who plays a goofy secretary. Credit should be given to veteran Muppet performer Bill Barretta (Pepe the Prawn) as the main character. He pulls off the unenviable job of making the main puppet character Phil come off as tough and gritty, albeit in a humorous way. Only downside to the acting in this is that the puppets' voices are performed by veteran puppeteers rather than cast outside voices and there are a couple of times where the puppeteers' voices weren't strong enough to fit the tone.Lastly, I really have to admire the technical effort put into this. A lot of effort is made to populate this world with multiple puppets, even if they're just in the background. It really sells the idea of a world populated with them. I haven't seen a puppet film that has had this many full-torso shots. If you don't like comedy that pushes the edge or is weird, this isn't for you. But I really recommend this if you like this sort of thing but aren't completely sold."
    },
    {
      "rating": "1",
      "text": "This movie would be a 10/10...    if you had the mentality of a 10 year old. For anyone with half a brain, avoid this inane garbage like the plague."
    },
    {
      "rating": "0",
      "text": "I was going to give it a zero, but Maya Rudolph... Muppets telling lame jokes is fun, muppets being foull and violent is not. Don't get me wrong, I love found language and violence, eat 'em for breakfast, but not funny. Not a good crime movie, not a good comedy, and thee are no truly sympathetic characters. The onty thing you root for is the closing credits, which, come to think of it, are the best part of the movie."
    },
    {
      "rating": "10",
      "text": "Greatest sex scene in the history of cinema!! The film is worth watching for that alone!! And then the homage to \"Fatal Attraction\" is absolutely incredible!!!  The Carpet doesn't match the Drapes!!! Have they ever?!?! Will they ever?!?! Not likely!!!"
    },
    {
      "rating": "10",
      "text": "One of the best comedies I've seen in years. Will be seeing again for sure! The Movie was set up with the expectation that it was not for children and would be a semi-raunchy movie, not sure why it's getting such bad reviews."
    },
    {
      "rating": "2",
      "text": "When I heard that Brain Henson was making an R-rated puppet film I was so excited unfortunately this movie doesn't live up to expectations. The story is your basic murder mystery with out any real surprises. It relies on shock humor to get laughs but after a while it gets old and lame. It tries be adult by using crude jokes and sexual imagery but unfortunately it comes off as childish. The characters are are boring and uninteresting. The protagonist is a complete ass while the supporting characters are all idiots who's sole purpose is to make the protagonist look smarter. The only one who is at all interesting is Bubbles played by Maya Rudolph. She is the protagonist's secretary and has more personalty than all the other characters combined. In conclusion unless you have nothing better to do stay away from this film."
    },
    {
      "rating": "3",
      "text": "I don’t think I liked this. There was a couple of times where I thought something was funny or there was some cool idea, but those quickly died by something crude or un-original. I don’t mind crude humor. I enjoyed sausage party to a degree. South Park has its time and place. This is just a different beast though. Three or four scenes I can think of specifically that are almost scarring. I hate to make it seem like this, but it does seem like you respect it for the puppeteering part or this stuff cracks you up. It does not do the latter for me. I get that some of the puppeteering is cool, I know that there is more than one person working on the puppet and that takes some of the fun away for me."
    },
    {
      "rating": "8",
      "text": "I believe if you went into this movie wanting to hate it you will find plenty to hate.  But if you came to laugh, have a fun light detective story and wanted to see where Jim Hanson's son would take this concept it's a good time.  I could never give a movie a low score if I was smiling through out and laughed at loud at several scenes, many of which where not in any trailer.  So in summary, don't go to this movie if you think you will get something on the caliber of Who Framed Roger Rabbit, because you won't but if you enjoyed Sausage Party I don't see why you couldn't enjoy this too.  I for one had a great time and so did my Sister (who I took to the movie since she was visiting in town)"
    },
    {
      "rating": "2",
      "text": "This is what happens when you get a star with no taste who attaches themselves to a lazy, lowest common denominator premise and writers too hacky, uncreative and just plain untalented to find a way to raise the material above it."
    },
    {
      "rating": "10",
      "text": "Funny, irreverent. Totally worth seeing. Look at who the critics work for that gave this movie a zero."
    },
    {
      "rating": "10",
      "text": "I think the reason critics are destorying this movie is because they're bringing the weight of their experience with children's televisions version of puppets to the film.  It's not jiving with their ingrained belief for what a puppet is and can do, thusly they outright reject it.  It's the not the best movie of the year, but damn, it's funny and it's fun.  If you want to have a good time at the movies, this is the movie to see.  The artistry on display and technical skill is astounding, Melissa McCarthy is enjoyable, and Maya Rudolph knocks it out of the park.  Go see this movie."
    },
    {
      "rating": "0",
      "text": "Make a movie.Include a lengthy exceedingly graphic sex scene.Stir in every dark sexual reference.Add 100 f-bombs, every crude word known to man, 20 misuses of \"God\" and 20 misuses of \"Jesus\" (the name above every name).Include graphic violence, drug use and gambling.FINALLY add lots of cute muppet characters to ENSURE that every innocent kid on the planet will be drawn to watch this filth.\"Whoever receives one little child like this in My name receives Me. But whoever causes one of these little ones who believe in Me to sin, it would be better for him if a millstone were hung around his neck, and he were drowned in the depth of the sea. Woe to the world because of offenses! For offenses must come, but woe to that man by whom the offense comes!\" Matthew 18:5-7"
    },
    {
      "rating": "2",
      "text": "Really silly movie, very short in length (didn't mind though since it wasn't good).  Waste of time.  I wouldn't even recommend it for a dollar theater price.  One good scene involving silly string and a nod to Basic Instinct.  But those were the only 2 memorable moments in this garbage flick."
    },
    {
      "rating": "0",
      "text": "I thought that Melissa McCarthy could not do any worse after Ghostbuster. I was so wrong. She has a certain talent, but making funny movies is not one of them. Quite the contrary. Whatever movie she stars in becomes dramatically LESS funny and likeable. Maybe that could be exploited for the production of something incredibly sober and dry. If she'd play a character that the audience is supposed to hate, she could really excel."
    },
    {
      "rating": "10",
      "text": "I loved this film and I rarely comment on this site but I felt the need to, as I think the film has been unfairly reviewed. To me I haven’t laughed for alongtime at many new films most of the way through in the last 5-10 years, it’s very subtle, twisted and beyond the obvious humour is very poignant. With its adult stars(it maybe twisted but is not porn) I usually cannot stand Melissa McCarthy and her other SNL alumni (was not a fan of Bridemaids and so forth) but she suited this down to the ground juxtapose to the other 2D characters. Maya Rudolph’s character Bubbles was fun and represented the muppets in a human form of being kind, happy go lucky which was so different to her boss Phil Phillips who I saw as equally dejected, depressed, depraved, dark and twisted in humour too but with pride. It is lazy to compare it to Ted or Team America-they are totally different and in some cases too extreme Sauage Party went wayward and which can be an issue with South Park and Family Guy episodes and to be honest Ted 2 sucked and should not have been made (not Seth Mcfarlane’s finest hour, though The Orville series amended that).  Happytime Murders toes the line correctly and I congratulate Brian Henson on this as he must struggle being in his Dads shadow and perhaps he has wanted to do a film like this for a long time but been advised against it. After the film I would like this to be a great tv series or a similar idea for Netflix which I would happily watch.  Now sorry to bust the moaning critics bubble but I grew up with the muppets during the 80s and seen all the films including the known ones in the 90s but the newer ones in the last few years were lame and the last series was trying to be like the office which was boring.  This film is an adult film quite clearly that uses Muppet like characters-similar to the humour in Avenue Q and is not for kids and it could be seen as a less raucous Ralph Bakshi film in parts.   The film develops well and you can see it being obvious in places but that’s part of the joke, it’s tongue in cheek, irony and get this it’s a comedy not a deep film and for an hour and half it will are you smile. I think in the U.K. it will fare better as British people have a darker sense of humour and get the nuances of noir. If you want something deep then go watch a French arty film about a painter/ballerina or some socio-political film you can analyse with your yuppie/artsy friends.  However if you are intrigued to go see this, please do and escape the mundane existence of most movies which are so CGI heavy or lacking in plot."
    },
    {
      "rating": "7",
      "text": "A one-joke comedy centered around the concept of watching puppets be vulgar and raunchy. The far less clever Ted did the same thing just with teddy bears, yet it was somehow given a pass. Meanwhile this movie has an actual plot.The whole thing is also meant to be an allegory for racism, but fails at being effective social commentary. This is because it's never clearly defined how the racism in its world works. You'll see things like a depiction of a more subtle, quiet bigotry and a mutual sense of disdain or mistrust that's been formed by years of prior abuse that closely mirrors today's social climate, only to then witness segregated hospitals and characters making blatantly racist remarks that no one calls them out for like we're back in the late 1800s, early 1900s or something. Essentially, it struggles to pick between two different time periods it wants to critique, one of which is wildly outdated, and therefore fails to offer anything on the topic other than a generic \"mmmm, racism bad 'kay?\" message. I hate to say it, but I think even Bright did much better job on this front.For all of its faults though which relate to things like the simplistic story and some aspects that just flat out don't work, I was surprised by just how much this made me laugh. It's all a bunch of nasty sex and potty shock humor, but there's something about that which actually kind of works under the whole \"Muppets for adults\" conceit because of how effectively it catches you off guard with how far it's willing to go at times. Plus, there are some genuinely amusing flourishes that come from just how well realized these puppets are not just as characters, but anatomically as well. So as stupid and gross as it may be I still walked away entertained and wouldn't mind seeing another project along the same lines."
    },
    {
      "rating": "2",
      "text": "If you wanna watch a very good movie about pupppets and some unadulterated raunchy humor, I recommend either 2 Ted movies or Team America World Police. Because I’m sick and tired of Melissa McCarthy’s schtick over the years after the very underrated Ghostbusters reboot. I could honestly say that The Happytime Murders could be a shoe-in for Worst Movie of 2018. At least Life Of The Party was decent but pretty forgettable."
    },
    {
      "rating": "8",
      "text": "I had a lot of fun watching this. Not a giant fan of McCarthy, but the world was fun to ride in for a while. I’d love to see something else that takes place in this same world. Dumb funny gross and still enjoyable."
    },
    {
      "rating": "8",
      "text": "My first movie review. Perhaps because I read sooooo many bad reviews, I was surprised when I enjoyed this film. Like another reviewer, I'm generally NOT a fan of McCarthy.  I do like puns, dad humor, but actually prefer dramas. But I was convinced to see it with a friend and got plenty of laughs, so boom here my favorable review.Relax and enjoy some really raunchy humor."
    },
    {
      "rating": "5",
      "text": "I suppose this is the R-rated muppet movie that had to be made at some point. And it's got it all, exceedingly foul language, muppet-violence, muppet-sex, muppet-human relationships. And there's rampant muppet-racism. I think they checked all the boxes of offensivity so there'd be no need for another attempt at this. The overall plot itself was an uninspiring police procedural so all the stereotypes make their appearance. The guy who played \"Stanley\" in the \"The Office\" series has a minor role here, so that was mildly interesting, but mostly it was a chore to watch this since it was so formulaic, even given all the muppet sex/violence. Watch through the credits and you'll see some of the techniques used to film this, so that's of some interest."
    },
    {
      "rating": "10",
      "text": "The Happytime Murders is a pretty decent little film, I enjoyed it from start to finish. It's not the best comedy in the world and it isn't perfect, but so few movies are these days. It's a silly, stupid movie at best, but I really enjoyed it and so did my friends and family.The puppetry is pretty good, the jokes are good enough to stand on their own and the violence? Oh god, while it's true a majorty of the violence is against puppets, it's so brutal that it even made me cringe a few times. Some folks might complain that the humor is juvenile or that the plot is basic. I say to them that they are bitter, crappy adults who have somehow managed to lose their inner child."
    },
    {
      "rating": "8",
      "text": "I had heard bad things and generally dislike McCarthy other than her minor role in Gilmore Girls but have to say this was genuinely surprising to me for being funny and a well put together mystery story. Very pleasantly surprised, don't expect Citizen Kane over here but still, just get some popcorn and go in with an open mind you'll likely enjoy this, very few other movies like it."
    },
    {
      "rating": "4",
      "text": "In a manner similar to another recent film, \"Sausage Party,\" \"The Happytime Murders\" spends most of its running time resting solely on the promise of its premise alone. \"Hey, look! Puppets cussing and ejaculating! That's funny, right?\" Not by itself, no. And make no mistake, that premise is basically \"by itself\" for the entirety of the movie. Sure, there are a few frustratingly entertaining jokes here and there (frustrating in that there are some faint glimmers of actual humor in an otherwise woefully tone-deaf comedic effort) but that's about it. The cop/noir elements aren't well-thought-out or ground-breaking in any way. Even the puppeteering work wasn't everything it should've been in terms of comedy. Just an unfortunate, sad effort on almost all fronts, and yet another recent demerit on the track record of the Melissa McCarthy craze."
    },
    {
      "rating": "1",
      "text": "One of the best murder mysteries in recent memory.From start till finish I was hooked, and the ending was totally not lame at all. I'm struggling to gasp why this was so poorly received. Maybe it's too smart for them? Or maybe the critics are being paid from Marvel to trash the movie, because that has to be the reason, right?Anywhere, Melissa McCarthy is absolutely amazing in this movie. A comedic genius with hidden details in her character. My only issue with McCarthy performance, which is a small **** nitpick by the way, but I wished she fell over more to add an extra laugh in my miserable life. Of course that's one complain that unfortunately stops it from being a 6/5, but it still stands at a 5/5, so yeah.Everything else on a technical stand point is flawless. I love how the movie looks with it being overly light and no way dose it look like a cheap TV movie on Netflix. Detective Phil Philips is so relatable as a character and more down to earth than any human. He might be my new favorite character of all time, right behind Dylan from 'Fateful Findings'.Brian Henson, well done - I'm proud of you.EDIT: April fools!"
    },
    {
      "rating": "5",
      "text": "Sadly, MediocreThe Happytime Murders should’ve been hilarious, But it only sticks half the time unfortunately."
    },
    {
      "rating": "5",
      "text": "There were some moments where it was genuinely funny and other times where it felt like the jokes should've been better.  The script wasn't that great, but it was fun enough and it's good to see Melissa McCarthy not overacting....  she and her puppet partner carried the movie well enough for it to be enjoyable to where I'm glad I saw it.  I honestly wasn't going to see it at all until I heard Brian Henson directed it, so I figured there'd be some good laughs in it... and there pretty much were some moments.... but some bits just didn't work and the script was kind of lacking.  Still, there are better ways to spend an evening.... and it was definitely much better than the last movie I saw, The Spy Who Dumped Me or whatever that movie was."
    },
    {
      "rating": "5",
      "text": "The movie is OK if you really, really suspend belief not in the fact that puppet are real or they are crude but I could not for the life of me figure out if the puppets were real through magic or they had a work vascular system and organs. One minute they are full of stuffing the next minute the main character is getting a liver for one of the puppets. Again I digress the movie was OK but too many things were just to hard to suspend belief in to fully enjoy the movie as it was intended I guess."
    },
    {
      "rating": "5",
      "text": "Es mala, pero pasas el rato, los muppets haciendo porquerías esta más o menos original."
    },
    {
      "rating": "2",
      "text": "I am starting to think any movies with Melisa McCarthy just are not funny and utterly depressing and desperate, I think I am going to avoid films with Melisa, The film was OK to watch, I was enjoying it until Melisa came in and did her usual slander match with anything that breaths and farts, which is the one dimension she plays. The movie it self was boring and didn't really make me laugh so I was disappointed."
    },
    {
      "rating": "0",
      "text": "Not only is this film insulting (to Muppet fans and to anyone with the sense of humor beyond a five year old), disgusting, and just boring, it's also the biggest disappointment out of any film that has come out in the past decade. This movie could've been amazing, or at least half way decent if the people tried hard enough; but despite them taking 10+ years to shove this garbage out they clearly did not give a **** It's not just because of the terrible performance of Ghostbusters (2016)'s Melissa McCarthy, the constant non stop sex jokes, mediocre puppet performance (with even worse line delivery), The obvious mystery that completely wastes the film's time if the sex jokes didn't do that enough, or even the god awful pacing; It's the fact that this could've and should've been the best thing to come out in years. But unfortunately, it's just another pile of **** to put on the list of terrible movies."
    },
    {
      "rating": "7",
      "text": "Hilarious movie. Seeing the trailer, I wasn't expecting much but it was very funny to me"
    },
    {
      "rating": "2",
      "text": "The last time I was so thoroughly disappointed by a movie it was seeing Adam Sandler's \"Pixels\" in theaters, an event I'm not sure my closest friends ever truly forgave me for. That film could at least hold the title of \"so bad it's good\", this one couldn't even reach that status. The moment I saw Melissa McCarthy come onscreen I knew I had made a fatal error but I was committed to see it through, a decision that will haunt me until the day I die. I gave it a 2/10 to represent the amount of chuckles I was able to get out of its 1.5 hour runtime."
    },
    {
      "rating": "0",
      "text": "worst movie ever form 2018 along with teen titans go to the movies! a big disgrace to the muppets!"
    },
    {
      "rating": "1",
      "text": "I detest this movie because this movie is a rip off of The Muppets. This includes the characters."
    }
  ]
}