{
  "id": 4758,
  "title": "The Amityville Horror",
  "starring": [
    "Ryan Reynolds",
    "Melissa George"
  ],
  "runtime": 90,
  "genre": [
    "Horror"
  ],
  "description": "This hair-raising remake of the 1979 horror hit depicts the ordeal of the Lutz clan, whose new home has a gory past and a legacy of demons. Before long, the family patriarch is plagued by nightmares and his daughter is seeing phantoms.",
  "releaseYear": "2005",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4D246dpe7yy2GvHI2IbpeqkUXry.jpg",
  "categories": {
    "plot": 3.727272727272727,
    "acting": 3.7142857142857144,
    "ending": 2.75,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 2.25,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "I have not seen the original. This movie, it wasn't really that scary. It relied on jump scares, and creepy images, its just overflowing with cliches. But it had some potential going for it, then, it botched at the end. Honestly, i know it was based on true events, but it could've been executed much, much, better."
    },
    {
      "rating": "4",
      "text": "A very dated, cliche, spoopy movie. It relies way too much on jumpscares that aren't even scary. It ends up being incredibly boring and forgettable. It comes across very heavy-handedly, and the only saving grace is the DVD bonus feature documentary about the \"true\" Amityville Horror."
    },
    {
      "rating": "2",
      "text": "Pretty good but not as good as Garfield 2: Tale of Two Kitties. 000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000/10"
    },
    {
      "rating": "1",
      "text": "Just shocks after shocks.\rIt's not scary, no it really isn't.\rEvery 5 minutes you'll get a heartattack. The story is dumb.\rNot an example for a good horror movie!"
    },
    {
      "rating": "10",
      "text": "This movie was bomb! it scared the hell outta me! PROPS!"
    },
    {
      "rating": "5",
      "text": "Better than the first film but still forgettable. The acting and drama is pretty dull. There are some really good scary moments when things jump out at you but nothing lasting. There were some interesting ideas and violence. This film is just lacking compared to Poltergeist (1982) and other haunted house movies. It updated the original but still an outdated haunted house fable."
    },
    {
      "rating": "4",
      "text": "The DVD extra documentary is more interesting than this overproduced, cliche snorefest. Some parts stay accurate to the actual events, but some are obvious implants to add scare to the movie. Part of what makes this story so creepy, is that it isn't really clear what actually happened. Strange events following the original deaths are what make this story scary. Stay away and read the book if you want a scare."
    },
    {
      "rating": "3",
      "text": "The acting was somewhat good but the book is where the entertainment is. I was unimpressed with the scare factor of the movie but the book was one of the scariest I have ever read. Also, to some people who didn't get the events that happened in the movie (such as flies coming out of the vent) read the book and it will make much more sense. The film was decent and some of the facts appeared to be somewhat accurate but it was nearly 100% commercialized and nothing more."
    },
    {
      "rating": "6",
      "text": "Amityville has its scary moments, and they all made me jump when they came. However, the film tries to be subtly creepy, but is unsuccesfull at doing so, therefore it never gets under your skin. The only parts that are scary, is when the scares are in your face, and not quiet, which unfortunately, there arent many of those kind of scenes. Reynolds performance came off a bit humorous to me, Melissa George is good though. Simply put, it is a mediocre horror remake, but it still rises above other entires of the genre this year. See it for some scares and a fun time, but dont expect any lasting effect, or emotional value."
    },
    {
      "rating": "10",
      "text": "BRILLIANT."
    },
    {
      "rating": "10",
      "text": "A fantastic remake of the original movie. I did'nt leave my seat cause i was afraid that i'd miss somthing."
    },
    {
      "rating": "7",
      "text": "Not the best take on the story but it was watchable. slightly slow to start but once u get into it it realli isen't that bad. I have read the novel by Jay Anson"
    },
    {
      "rating": "2",
      "text": "There are many questions that needed to be asked when you finish watching this movie. Like why is their dog named Hairy? They could've named it Lassie, except it wouldn't have made a big deal, seeing how the dog did absolutely nothing in the entire movie. How come a whole swarm flies just fly out of the vent in the movie, when it has absolutely nothing to do with the plot what so ever? Why is Ryan Reynolds such a bad actor in this movie? Why is the lead actress sooo hot, and is the only one that puts out an outstanding performance in this movie? It's really puzzling to me, why I wasted just over an hour watching this movie."
    },
    {
      "rating": "8",
      "text": "The movie was pretty good. I enjoyed it. Wasn't as scary as I was expecting. Still good."
    },
    {
      "rating": "3",
      "text": "Movie haunted mansion coolest I've ever seen, even that could be used a little more home to more herror, but it's still a movie that puts fear. I wouldn't put my feet in this house."
    },
    {
      "rating": "5",
      "text": "If you are looking for an ok movie to watch this could settle. The problem is that there is nothing original about this horror story. Everything that a horror movie has come to represent is presented in this movie."
    },
    {
      "rating": "2",
      "text": "Oh wow. After watching the original right before this being left thinking it was an alright film, this 2005 remake made the original look like the best film of all-time. Obviously as a remake, it is unoriginal. Yet, it decided to take everything that worked in the original: the pacing, the menacing scares, and the mystery, and just remove it. Everything good in the original is gone. In its place is a formulaic modern day horror movie with Ryan Reynolds' abs, Melissa George's side boob, and Rachel Nichols as the sluttiest babysitter of all-time. Clearly, far more attention was paid to attracting teenagers (both girls and boys), rather than making this film at all scary.\r With jump scares coming fast and furious, The Amityville Horror refuses to try and be original, though its major strength is expanding on the history of the house. The original had good elements, but I did like that this one took it further. It also had other nice touches like the doll, which was certainly scary. That said, every other addition was poor at best. The additions largely are just gore effects, the aforementioned jump scares, and showing you what the original kept hidden. The best trick a horror film can pull is to try and convince the viewer that the scary elements are not there. That it is just a noise. Once it does this, it can truly shock you and leave you shaking. This film, however, is convinced you must see dead bodies with weirdo jump cuts in order to get the point. Director Andrew Douglas clearly does not understand what works about horror movies. There was a lot to improve upon from the original, but yet, Douglas found a way to infuse it with modern horror elements that leave you scratching your head and trying to watch the original instead.\r The Amityville Horror is a film that takes no time at all to jump right into the \"scary elements\". Rather, it decides from the very beginning that it is best to try and make the audience jump. Yet, horror films must earn their scares through atmosphere. Douglas apparently feels the need to try and shorthand this atmosphere by just showing you creepy looking dead girls and a scene with a Ryan Reynolds lookalike (i.e. Ryan Reynolds) killing his whole family. These moments, though jarringly dumb, do not scare. Even worse, they do not create an atmosphere. As if realizing this, Douglas thinks adding some more CGI demons and scenes of child abuse will assist the film in becoming creepy. Strike two. Next up, Douglas decided the ending of the original was fine, but just needed some alterations. Here, we could definitely add a weirdly placed dream sequence with Reynolds slinging an axe into Melissa George's abdomen only to instead have her almost kill him. But yay, she cannot pull the trigger and Reynolds is saved from the house! Woohoo! If only Melissa George could have pointed the gun at my head and pulled the trigger. It would have been far more rewarding.\r The Amityville Horror is schlock horror at its very finest. It is devoid of scares or atmosphere. If you want to watch Ryan Reynolds's abs act in a supporting role (he is actually shirtless for maybe, like, 50 minutes of this movie), then this is the movie for you. If you want to be entertained and scared, then maybe try a different horror movie."
    },
    {
      "rating": "6",
      "text": "An okay remake of the original, but the problem is Reynolds. He portrays the character too stiffly, without a sense of possession. He's more cardboard than killer."
    },
    {
      "rating": "1",
      "text": "Oh my god this film was awful. With acting that is painful to watch, a totally miscast Ryan Reynolds and literally almost not interesting or effective scares this film dies almost from the very start. I sat laughing my ass off for the majority of this movie as it was so awful (in direction, acting, dialogue and scares) that i couldn't wait till the end, which by the way absolutely sucks! One of the worst horror movies i've ever watched. Should put it on as a comedy to watch with your girlfriend, at least then you'll get a few laughs out of it! Other than that, do not waste your time on this trash!"
    },
    {
      "rating": "5",
      "text": "Decent remake of the original, Ryan Reynolds does really well as does the rest of the cast but when somethings been done as much as Amityville has, this does little to stand out other than being decent"
    },
    {
      "rating": "7",
      "text": "While the movie was predictable and not particularly realistic, it was still entertaining and fun to watch. The highlight of the movie was definitely Ryan Reynolds. He was great and he gave a very entertaining performance.The movie itself wasn't particularly scary and the CGI wasn't very good, but it was still worth watching. A lot of people complain that this remake is inferior to the original, but honestly, I liked it better."
    },
    {
      "rating": "3",
      "text": "As far as remakes go, this is one of the rare ones that rivals its predecessor in quality. In this case, they're both about as mediocre and moronic, but this one is even worse. The one or two scenes in the original that scared me where completely ruined by predictable jump scares, which the film relies on a lot, as well as bad special effects. The remake significantly toned-down the priest character, and that's both a good thing and a bad thing. A good thing because I hated his character in the original, but a bad thing because he's even more unnecessary since he only appears in two scenes. Even if you enjoyed the original, I don't recommend this one at all."
    },
    {
      "rating": "1",
      "text": "It just seem like I have been watching a lots of promising low budget horror movies lately and this one ended up being a bust...The acting was terrible, editing and story line is average at best. I haven't jumped or getting scared once during the entire movie, the ending is so predictable. Overall there is nothing great to say about this movie, just another waste of time."
    },
    {
      "rating": "3",
      "text": "Completely UnnecessaryLike most horror remakes of the 2000’s, The Amnityville Horror is a remake that doesn’t earn its existence with a poorly written script and sloppy scares."
    },
    {
      "rating": "4",
      "text": "This movie is a remake of a 1979 horror classic, which most people no longer know. Despite this, almost all lovers of supernatural stories have heard of the crimes of Amityville and the death of the DeFeo family. The crime was true, as was the Lutz family's stay in that house for about a month. But the so-called \"true story\" on which this film is based ends here. The idea that the Lutz were also plagued by the supposed ghosts of this infamous house is apparently a complete invention, that the cinema has merely exploited and inflamed.Comparing this movie with its 1979 predecessor is inglorious. If the original has long been forgotten, the new film deserves to be forgotten. It's a bad movie, it never really fears the public, it fails by being absolutely predictable. It brings nothing new, interesting or appealing, limiting itself to making use of a famous story of presumed haunting to make some money. It has an uninteresting script and the special, visual and sound effects are not remarkable, using the most rehearsed recipes of horror movies. Actors' interpretation is boring, with the praiseworthy exception of Ryan Reynolds, who plays George Lutz. This actor wasn't brilliant, but managed to meet the minimums that were required of him."
    },
    {
      "rating": "3",
      "text": "Gone is the subtly of the 1979 classic, Now we have a film that attempts to be nightmare fuel with nothing but excessive jump scares. Quite possibly one of the worst remakes/reboots of all time."
    }
  ],
  "recommendations": [
    "annabelle",
    "the_grudge_2",
    "poltergeist",
    "insidious_chapter_2",
    "sinister_2",
    "the_grudge",
    "insidious",
    "dead_silence",
    "ouija",
    "the_possession",
    "the_curse_of_la_llorona",
    "the_texas_chainsaw_massacre",
    "malignant",
    "dark_skies",
    "the_eye",
    "countdown",
    "the_last_house_on_the_left",
    "the_haunting_in_connecticut_2_ghosts_of_georgia",
    "halloween_ii",
    "halloween_iii_season_of_the_witch",
    "scream_4",
    "blair_witch",
    "insidious_chapter_3",
    "the_ring",
    "the_conjuring"
  ]
}