{
  "id": 2123,
  "title": "The Boy",
  "starring": [
    "Lauren Cohan",
    "Rupert Evans"
  ],
  "runtime": 97,
  "genre": [
    "Horror",
    "Thriller",
    "Mystery"
  ],
  "description": "An American nanny is shocked that her new English family's boy is actually a life-sized doll. After she violates a list of strict rules, disturbing events make her believe that the doll is really alive.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/W4cdvWRHX1cKpod2KeK8WuHAHG.jpg",
  "categories": {
    "plot": 5.151515151515151,
    "acting": 5.384615384615385,
    "ending": 5.17948717948718,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 4.8,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I`m usually not a big fan of horror films, but \"The Boy\" was worth all the scary parts. I wasn`t actually expecting much from this film as I`d seen the trailer earlier, but as soon as I saw it, I took my words back. It is a gripping film, which has a thought-provoking plot. The plot is in my point of view very interesting. There`s a nanny Greta who has to take care of a life-sized doll, she also has a strict schedule. The doll starts to move himself and Greta believes he`s alive. The film has an unexpected ending. I liked that there wasn`t used almost any stunts, special effects and overall it wasn`t very violent. The script is clever and moving, too. Altough this film is a bit similar to many other scary movies,  it`s still a convincing story. I`m not interested in light-hearted films, such as most of the romantic comedys etc. Overall, \"The Boy\" is in my opinion powerful and gripping. I recommend it wholeheartedly to everyone."
    },
    {
      "rating": "8",
      "text": "A fun Horror flick with a good amount of suspense and a twist ending that I certainly didn't see coming."
    },
    {
      "rating": "6",
      "text": "When a nanny meets a boy who is a weird toy.\r So this is the other 'The Boy'. The last year film was a thriller-drama, but this is a horror-mystery. It feels like watching a classic horror film, especially because of the English atmosphere and the house where it was shot. A young American woman named Greta, takes up a nanny job in England to escape from the troubled relationship with her boyfriend. She discovers the boy she has to look out is a doll and later she observes a series of strange events that leads her to find out the truth. The dark secret comes out and that's the film.\r A limited cast film. The suspense was the key to the story narrating successfully. So I expected a big twist at the end, but it was a decent one and the overall film was just above average. The atmosphere was creepy, and then it weakened as the development was decelerated going to the second and the final act. Until the twist, it was good and after that a bit disappointing. Not because of the bad conclusion, but comparing it with the rest, especially after the anticipation it created in us, that end part looked so small and simple. Good film to watch for once, but like the most of the horror films, it's fallen short to get my thumbs up.\r 6/10"
    },
    {
      "rating": "7",
      "text": "Good movie, i was never bored watching it, very interesting story with a very unsuspecting ending, didn't see that one coming. I enjoyed it more than 90 percent of the rest of the suspenseful horror trash out there."
    },
    {
      "rating": "7",
      "text": "\"The Boy\" benefits from atmospheric visual, hissing audio and twisting narrative to make it more alive\r There's an appeal on how the movie creates an expectation to what kind of horror it may present, then turns it around with playful change in direction. It might not be all too shocking or innovative, yet the clever shift coupled with nice backdrop of quaint village setting serve as a nice foray into mystery thriller. It does however, possesses occasional conflicting tones that might undermine the tension from its enigmatic theme.\r Greta (Lauren Cohen) is offered a job on rural English and it comes as a surprise to her that the job entailed is much stranger than she previously thought. While this might seem like a deal-breaker, the money is good enough to make her stick around. After a short moment there she finds strange occurrences happening to her, some of which are alarmingly eerie.\r The movie is at its best when it provides a mysterious vibe. It makes audience wonder whether this is a supernatural haunting, a psychological breakdown or sinister curse. The visual for \"The Boy\" itself is ominously creepy while the audio plays a good role in creating the suspense. It's often the visual and audio clues that create a lingering sense of curiosity, perhaps even more effective than some of its actual scares.\r Its flaws reside on the tired occurrences of \"Is it a dream?\" gimmick, which accompanied by a couple of lackluster jump scares. This is also a movie with a small cast, while the actors perform appropriately for most parts, there are some moments where the change of tone seems too jarring and might even ruin the immersion.\r A few hiccups from the jolting pace aside, \"The Boy\" has assortments of amusing tricks and mysteriously creepy production to play with delightful horror."
    },
    {
      "rating": "3",
      "text": "I had to leave my review for this movie last because it's not a movie I would claim first for the reviewer's seat. Rather than making anything creative, we instead got the same old cliché we normally get from horror movies."
    },
    {
      "rating": "1",
      "text": "This film is one of the dumbest, if not the dumbest horror movie(s) I've ever seen. It takes an interesting, if slightly well worn premise and robs it of all possible drama and suspense. For approximately three-quarters of its run-time watching The Boy is the cinematic equivalent of watching paint dry. Moments that should be suspenseful are either dull, or worse, hilarious.\r Then there's \"the twist.\" I put it in quotes because a twist is supposed to have its roots in the story. When you re-watch the film, you should be able to sense the foreshadowing and see the breadcrumbs leading up to the reveal. The \"twist\" in The Boy is less of a twist and more of a non-sequitur. It makes no sense in the context of the narrative, creating a ton of plot holes, and worse, it's lazy. Throw Scooby-Doo, Clue: The Movie, and Annabelle together in a blender and you have this joke of a horror film. The only reason it's getting a 1 from me and not a 0 is that the chemistry between the two main leads is pretty nice. But it's still not a good enough reason to see this trash. Seriously, save your money."
    },
    {
      "rating": "6",
      "text": "Not since last year's generic exorcism flick The Vatican Tapes have I had such low expectations for a movie. Its January release date, unflattering trailer, and awful director (William Brent Bell, director of The Devil Inside and Stay Alive) seemed to be a recipe for disaster. Maybe it's because my expectations were so low, but The Boy is actually a halfway-decent January thriller. The Boy is about an American woman, Greta, who becomes a nanny for a boy named Brahms whose parents will be away for a few months. What Greta comes to find out is that Brahms is actually a life-sized porcelain doll that is used to replace the real Brahms who died in a fire when he was 8. A list of rules is created for Greta to follow, and increasingly disturbing events start happening when she does not follow those rules. The enormous manor that she resides in calls to mind the mansion from The Innocents, creating an interesting setting for the film. As the film progresses, Greta does begin following the rules and treats the doll like a real boy, and it is pretty creepy seeing how the doll can mentally control her in that way. The plot itself is rather thing, specifically during the second act. There is an abusive husband sub-plot thrown into the film like last year's disappointing Sinister 2, but instead of being ridiculously over-the-top like that movie, the side plot actually does serve some relevance in The Boy and is believable enough. It provides a reason for why Greta becomes so attached to Brahms. The big twist at the end will divide viewers, but I thought it served the rest of the movie well. It is revealed that Brahms actually survived the fire and has been living in the walls ever since the incident, and the parents committed suicide and left Greta for Brahms. The fact that he's always in the walls listening and watching everything creates a creepy atmosphere. The Boy certainly won't blow anyone's minds, but it is a decent thriller that should give you an excuse to go out to the cinema in January."
    },
    {
      "rating": "8",
      "text": "To escape an abusive relationship, Greta (Lauren Cohan) moves from America to rural England, finding a position as a caregiver for a wealthy couple's child.  Only after she is at their large manor do they reveal the quote-unquote child, Brahms, is in fact a life-sized porcelain doll, a representation of the troubled son they lost in a fire 20 years ago.  Greta, left alone when the husband and wife go on holiday, is instructed to adhere to a strict routine, including feeding, playing music for, and reading stories to her charge, whom she slowly begins to suspect may be more than just a pacifying toy for her elderly and grieving employers.  This is a small, but creepy, entertaining, and well-told mystery with extremely handsome production design and a sympathetic lead performance by Cohan.  William Brent Bell is a poorly regarded director due to the mediocre video-game slasher Stay Alive and the godawful found-footage film The Devil Inside, but in a surprise twist, he proves rather adept at emulating the this-old-house atmosphere and slowly burning suspense of a film such as The Changeling."
    },
    {
      "rating": "1",
      "text": "User score of 7? Come on guys, get with the program. This was the most ridiculous piece of trash I've seen in ages. The plot so unbelievable and daft, plots threads were left dangling and unfinished and the big twist at the end wrecked what little atmosphere had been created. I gave it a 1 because it had the hot girl from Walking Dead in it and she stopped me from switching it off but this was terrible. If you gave this film a 10 you need to take a long, hard look at what makes a film great, watch a few real horror like It Follows or the Babadook. Shame on you"
    },
    {
      "rating": "2",
      "text": "Not much of a movie, incredibly boring and slow moving, it was hard for me to stay awake. If I could go back, I wouldn't have even paid the ticket price, I would have just flushed my money down the potty."
    },
    {
      "rating": "6",
      "text": "Effectively creepy and greatly acted, \"The Boy\" is not as clichéd nor as bad as I expected. I found myself really invested in the story and being genuinely spooked by most of the scares. The twist, while surprising, does not make complete sense, and it drags a bit, but I found it to be a pretty solid horror film."
    },
    {
      "rating": "4",
      "text": "Have you longed to see a movie about a possessed doll? Has nothing filled the void since Chucky? Well then you're in luck and your prayers have been answered. Meet Brahms, the doll, oh sorry boy, and his babysitter, Greta. Some of you may recognise her from The Walking Dead and others will recognise her from nowhere else. You get what you pay for with this movie, some scenes that won't scare you because you've seen them in the trailer, some jump scares and the last half hour of what the hell am I watching? Not the worst horror movie I've seen this month, I'd give it a lukewarm recommendation."
    },
    {
      "rating": "0",
      "text": "The Boy is awful in every way. From start to finish, the film tries so hard to scare, but it's funnier than it is scary. The plot twist has to be one of the stupidest plot twists ever, and overall, the whole film is just a bore."
    },
    {
      "rating": "5",
      "text": "\"The Boy\" lies before a striking premise.\r \"The Boy\" is composed of a doll for nothing frightening, a house scary old and an unbalanced performance by Lauren Cohan (Maggie, \"The Walking Dead\"). Director William Brent Bell offers few moments of horror to satisfy fans of the genre, but the majority of the tension of the film is based on jump-scares and frights common in the world of horror, making us question Could not have been better with a development more coherent?\r Lauren Cohan is \"Greta\" a young American teenager who escapes from a tortuous relationship and takes a baby-sitting job in a village far away from society and looking gloomy, as soon as she accepts the job, should already know that Brahms should receive a kiss goodnight  and must take care not to break or a single rule.\r After the explanations and others. Greta attempts to understand parents, and with the exception of Malcolm (Rupert Evans), she starts a single transition with the strange doll, where at the end unusually understands and follows the game in a natural and comprehensive way.\r This installment, is apparently a prospect of lean mixture between the so scary \"Annabelle\" (in matters of the doll) and the 2006 film \"When a Stranger Calls\" (in matters of work babysitting), we often see references of not only these two tapes, also from his previous project \"The Devil Inside\".\r From there, the film takes a couple of unnecessary turns and for fans of the horror the end despite breaking schemes of the genre, it is stupid and irrational, wasting the few merits as until then had managed to raise.\r But considering its classification PG -13 and what it could offer us, we all knew that this was not going to make the best horror film of the year but could reach the label \" The Best and Original Horror Film of 2016 , to the date\".  Cohan performance is uneven, the first hour is tortuous and tense and fails her fully know what happens , unfortunately like all horror movies today , the real excitement starts in the last half hour where the film takes a turn I look that even innovative and irreproachable, also feels like a disappointment."
    },
    {
      "rating": "10",
      "text": "A fantastic thriller in every way. It starts off very interesting and only gets more and more interesting along the way. Lauren Cohen is fantastic and gives a wonderful performance. It keeps it's creepy fill throughout and doesn't rely on cheap jump scares to carry the film. The plot twist is genius and truly creeps up on you. You do not see it coming. I had high hopes for this movie and was not disappointed."
    },
    {
      "rating": "9",
      "text": "With an exceptional twist (that seems nonsense at first, but as you think about it the more you buy and appreciate it) and an incredible lead (Laura Cohen), The Boy takes on both grounds, one that questions whether the doll is alive, or is there a more rational explanation? In which, the movie's premise never fails to entice the viewer, plus the lead's reasonable motives makes the movie more of \"I would have done the same\" type of horror film rather than \"your average January horror film. So with Barely any jump scares, the movie is more creepy, mysterious and a puzzle rather than just flat out scary."
    },
    {
      "rating": "4",
      "text": "It's got some interesting ideas floating around, but fails to capitalize on any of them with scares. It's one of those boring horror flicks where you're actually waiting around for something to happen. While you're left waiting around it toys around with themes of abuse and gives us overly long shots staring at a doll that's appearance lost it's unsettling nature early on.\r Despite being one of the more unique and weird mainstream horror movies to come out in a long time, it ultimately still feels overly familiar. Plenty of it's scare tactics are borrowed so that when it finally does get around to trying to freak you out it has no effect. There's a pretty great twist near the end that also ends up being borrowed from another movie. I can't tell you what movie that is though, because it would spoil things. That twist is one of the few things the movie has going for it.\r There's just not much happening here. They tried to go for a more personal, dramatic side of things and as a result left out the scares. It also doesn't help that they never manage to actually say anything on the topic of abusive relationships. They really needed to focus on the actual horror.\r However just how scary would a haunted/possessed doll actually be? Perhaps a campier route would have made for a better movie. At least then we could have gotten some laughs from the material. Of course you may still get those anyway. The person I watched it with found it very funny. However they also found the thing more watchable than I did.\r It is actually very watchable. The question is, why would you? While the genre isn't exactly brimming with haunted doll movies, and The Boy does manage to tower over Annabelle as far as quality goes (Annabelle might have actually been scarier), this just isn't a good horror flick.\r It touches on some interesting themes, has a nice twist, and didn't cut out the (totally PG) shower scene like The Forest did, but none of that makes it worth watching. It's downright boring for the majority of it's running time. There are plenty of worse options out there, but you are still better off skipping this babysitting misadventure.\r 4.8/10"
    },
    {
      "rating": "10",
      "text": "Fresh plot and awesome twist in the genre. This movie is so beautiful and scary. On my top 10 horror movies of all time. The cast is great and Laura Cohen did good beyond The Walking Dead."
    },
    {
      "rating": "4",
      "text": "The Boy has promise and is tense but doesn't fulfill it with less scares, average characters, and a poor final twist that relies more on action than horror."
    },
    {
      "rating": "10",
      "text": "Exceptional and well-acted, The Boy is intense, terrifying and surprisingly sad. It might not be the scary movie you'd want it to be but it is all worth the wait for the twist."
    },
    {
      "rating": "6",
      "text": "decent thriller with elements of horror.\r This movie was very good towards the beginning and creepy, however as the plot edged on the movie began to get over exaggerated and almost weird. I would only recommend for true thriller fans."
    },
    {
      "rating": "4",
      "text": "Okay, I have a little to say about this movie since I don't see too much about it. I saw it at night and to me, I found it interesting to see a movie about a doll and let me tell you, the movie is..... As cliche as it can be. It's basically Anabelle but Boy edition. I didn't find anything scary, but I did find it hilarious for some reason. Guys if you're looking for a good horror film, skip this and movie on because 'The Boy' doesn't try much and it's kind of stupid."
    },
    {
      "rating": "1",
      "text": "Probably one of the worst horror/thriller movie i've seen. The concept was good and thats probably it. It was 1% horror and 99% stupid. It was actually a waste of my time! Do not recommend it at all!"
    },
    {
      "rating": "7",
      "text": "Es una película bastante buena, la trama está bien estructurada y desarrollada, sin ser perfecta logra ser entretenida, los sustos en su mayoría se limitan a los típicos jumpscares pero en este caso están bien logrados, lo mejor es que no es la típica película de muñecos malvados, de alguna forma se las arregla para ser diferente del resto."
    },
    {
      "rating": "7",
      "text": "For a horror movie this was not that bad. After what we have seen for the past decade I would rate this somewhere in the top ten. Although \"The Boy\" is more focused on atmosphere and plot for the scares. It gives you a pretty decent vibe of the \"ooky spookies\" but does not make you want to cover your eyes in fear of a small seemingly haunted doll. There are a few jump scares but you can almost certainly  tell when they are coming. I won't lie one of them got me. I would invite you to watch this film. Plus the ending is not what you expect. It will make you think at the end."
    },
    {
      "rating": "5",
      "text": "I like horror movies, I really do. And I tried so,so hard to like this movie. But I just couldn't. I can congratulate it on having nearly no gore (a completely boring and irrelevant character gets stabbed in the neck by a piece of ceramic, and that is it, no joke), and trying to focus on the psychological aspect of horror, one of the reasons I enjoyed 'The Babadook' so much, however it didn't do it nearly as well as 'The Babadook'. There were a couple of FNAF level jumpscares and, I will admit, some very shady scenes, notably the ones in which Brahms head suddenly turns as Greta tries to move him, and when his parents drown themselves. Now, if the rest of the film had done that, I probably would have enjoyed it A LOT more, but it didn't . So my score is a 5: 5 for interesting ideas (I thought the plot twist was actually fairly good), but I can't give it any more than that because of how laughably it was performed.\r The entire horror genre is so saturated now that it's kinda hard to come up with something original. But you tried William, you tried.\r So, William Brent Bell's other AAA film (or at least an attempt on Triple A), 'The Devil Inside' (I haven't seen it) is rated worse than this piece of crap on ImDB. So at least he improved... by 1.2 stars.\r In short, forget about this movie and everything I said and go watch Child's Play."
    },
    {
      "rating": "0",
      "text": "C quoi ça??? C une arnaque totale !!!! Un des pires films d’horreur de tout les temps ????"
    },
    {
      "rating": "5",
      "text": "Night Of the Living Dummy: The Movie - Rebooted For NostalgistsSolid enough premise though surprisingly lacks creepiness. It eschews jump scares (outside of two terrible dream sequences) and follows its own humdrum rhythm. I want to commend it for that but it never delivers much more and the story never makes much sense.The ending avoids the typical expectations here, and while there are mentions of a ripoff of Housebound in some reviews, this isn't really valid here. If this had gone the supernatural route it would have been just like a zillion other films. Damned if you do, damned if you don't; everything has been done. Plus that reveal was a lone bright spot."
    },
    {
      "rating": "5",
      "text": "I appreciated the way the film looked and the tone of the film even if some of the twists don't pay off.  Solid effort in a genre that has a history of many flops.  C+"
    },
    {
      "rating": "4",
      "text": "*Minor Spoiler*  This was a rather interesting movie with some pretty strong creepy (but not scary) scenes.  It lost me when they decided to go with a check-the-box twist that I have seen plenty of times now.  It really ruined the movie for me."
    },
    {
      "rating": "3",
      "text": "There were some genuine scares here but it falters in a lot of areas. Lot to be desired. I had some type of enjoyment in the first half but it fell apart in the second. And that ending. UGH!"
    },
    {
      "rating": "6",
      "text": "-The Boy (previously known as The Inhabitant) is a 2016 American-Canadian psychological horror film directed by William Brent Bell and written by Stacey Delay. The film stars Lauren Cohan and Rupert Evans. Filming began on March 10, 2015, in Victoria, British Columbia. The film was released by STX Entertainment on January 22, 2016.\r --Filming:\r -On March 10, 2015, principal photography on The Boy officially begun in Victoria, British Columbia, at Craigdarroch Castle, announced by the studios.\r --Critical reception:\r -On Rotten Tomatoes, the film has a rating of 28%, based on 46 reviews, with an average rating of 4.3/10. Metacritic gives the film a score of 42 out of 100, based on 10 critics, indicating \"mixed or average reviews\". Audiences polled by CinemaScore gave the film an average grade of \"B–\" on an A+ to F scale. Joe Leydon criticised the average story line in Variety.com and commented that \"Despite game efforts by the cast, this tepid horror opus is never scary enough to overcome its silly premise.\" A reviewer for RogerEbert.com wrote that a \"moody atmosphere and committed performances can’t conceal the fact that this is one dumb flick.\"\r -Film where some elements from other films recognizable slightly forward and that leave you specific more or less in the tenterhooks about its outcome."
    },
    {
      "rating": "3",
      "text": "I really loved Lauren Cohan in this, she was engaging and pretty damn beautiful. The movie is just a joke. It's lazy and dull, and it has the dumbest plot twist maybe ever."
    },
    {
      "rating": "3",
      "text": "The Boy\r The Boy is not as scary as it proved to be (although it works as a festival of jumps and scares in an hour and a half) and the film ends up not realizing their ideas. In addition, the film relies heavily on dreams to give scares, showing that the script does not have to go."
    },
    {
      "rating": "7",
      "text": "The Boy competes well with other recent films in the genre. There is definitely a creepy atmosphere through-out the film and the actual doll is very unnerving. Many reviews I read before watching attacked the 'poor twist', but I actually enjoyed it and thought it was a really interesting perspective. I enjoyed watching the entire film and didn't feel there were any moments I was bored. It isn't a masterpiece but it's a strong horror in it's own right and definitely worth the watch. Green rating deserved."
    },
    {
      "rating": "10",
      "text": "Excellent movie and thriller from beginning to end.  I tend to rely on critics ratings and they dropped the ball on this one underrating it and I don't appreciate that.   Glad I didn't miss this movie."
    },
    {
      "rating": "6",
      "text": "It's a movie with a good idea, but a very \"meh\" execution.\rIt's not much of a horror movie, as the scary parts are very scarce, but the drama and ambiance makes the movie more of an atmospheric experience. You can really feel the loneliness and isolation of the main character, and the way she changes her behavior trough the movie is rather interesting and nice to watch.\rThe ending is good, but the plot twist is quite predictable, and might have been better to just keep the original plot.\rWatch it if you are looking for a movie that will most likely not make you scared before bed, but might make you look twice at creepy dolls."
    },
    {
      "rating": "5",
      "text": "The boy is a horror movie that was supposed to scare viewers instead it gave me laughs expect lazy scenes  and no real horrors  up until the end  during the movie it has just the boy moving his head and laughing but near the end he moves if you want to watch a horror movie with little scares to start off your day? This is the movie"
    },
    {
      "rating": "6",
      "text": "The Boy is certainly not bad, is well made, the acting is decent and it can give you few scares here and there. Sadly for me all went down very quickly after excellent first half of the movie when the main character assumed that the \"Boy\" doll is alive and just like that went on with her daily activities - oh you not here to kill me, you just want a actual babysitter. OK!The plot twist at the end is also something that one could spot right at the first half of the movie. It might not be as jarring for you so I still recommend the movie, its surely better than average terribleness that we get from the horror genre these days."
    },
    {
      "rating": "6",
      "text": "Völlig stumm, regungslos und ein glasiger Blick: Der kalkweiße Brahms ist schon ein gruseliges Kerlchen. Aber kein Grund zur Sorge – schließlich ist Brahms eine Puppe. Die hübsche Nanny Greta staunt also nicht schlecht, als die abreisenden Eltern eine vollwertige Betreuung plus Gutenachtkuss fordern. Erst verstört, spielt sie schließlich mit – denn die Bezahlung ist überirdisch und der Grocery Boy Malcolm einfach süß. Doch schnell knirscht, knarzt und kichert es im unheimlichen Herrenhaus, während Gretas Kleider spurlos verschwinden und es unheilvoll aus dem Telefon krächzt. Flackert da etwa doch Leben hinter den Glasaugen? Seit dem Monster-Murks Wer hat Regisseur William Brent Bell dazugelernt – denn The Boy ist ein zu großen Teilen ziemlich spannender Subtilgrusel, der den aufflackernden Puppenhorror-Trend um Annabelle ins stilvoll inszenierte Haunted House verlegt. Die etwas klischeehaften Schocks sitzen auch – und so wird The Boy trotz Logikfehlern und einem übertrieben-überraschenden Finale zum kleinen Grusel-Glücksgriff."
    },
    {
      "rating": "6",
      "text": "To get ready for it's superior sequel I rewatched this overly mediocre but ultimately disappointing genre entry that liberally borrows from other films including the much better under watched gem \"housebound\". The film centers on a young woman leaving an abusive relationship who ends up accepting a position in the Englush countryside as a nanny. Soon after arriving she discovers that she'll be watching a doll named Brahms. At first she thinks it's humorous but than feels like she's taking advantage of them. But strange things begin to happen leaving her wondering if the doll is alive. The movie is well shot with some amusing nightmare sequences. William Brent Bell of the dumb but fun Stay Alive builds a mildly effective atmosphere but because it's so misleading the end result is disappointing and only marginally entertaining. The main characters soap opera back story feels for ed as well. It all culminates in a fun but disappointing finale. The end result is another forgettable but somewhat entertaining horror flick."
    },
    {
      "rating": "10",
      "text": "One of the best horror movies I've seen. It's one of a few movies where everything will make sense in the end and will keep you satisfied."
    },
    {
      "rating": "2",
      "text": "This is a dumb and uneventful horror movie. The premise is nonsensical, and the movie is cumbersome and pointless. The acting is not great, the movie looks really bland, and the score is also cliche. There is nothing special about this movie. In fact, it is so unspecial that I fell asleep at the 40 min mark, woke up 20 mins later and did not feel like I had missed anything. Skip this one, just watch some other doll horror movie."
    },
    {
      "rating": "8",
      "text": "Cast members actually used the doll (\"Brahms\") to prank each other on the set. On one occasion, one of the cast members propped the doll up outside of the other actor's bathroom in their trailer to scare them. Upon seeing this, they hurled the doll outside of their trailer and the crew had to repair it and make a replacement doll."
    },
    {
      "rating": "7",
      "text": "The movie had some things interesting----I recommend this movie I did not wait some things in this movie but this give points positive."
    },
    {
      "rating": "4",
      "text": "Old British couple with dead son, hire American nanny to look after a doll that looks like their son, commit suicide and then it turns out they want to give the nanny to their song and their son isn't dead but living in the walls."
    },
    {
      "rating": "7",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************"
    }
  ],
  "recommendations": [
    "dark_skies",
    "the_forest",
    "insidious_chapter_2",
    "insidious",
    "dead_silence",
    "case_39",
    "sinister_2",
    "the_woman_in_black",
    "annabelle_creation",
    "the_ritual",
    "the_ring",
    "the_haunting_in_connecticut",
    "you_should_have_left",
    "the_uninvited",
    "vacancy",
    "brahms_the_boy_ii",
    "mama",
    "annabelle",
    "devil",
    "oculus",
    "insidious_chapter_3",
    "summer_of_84",
    "the_conjuring",
    "the_possession",
    "chernobyl_diaries"
  ]
}