{
  "id": 2397,
  "title": "The Pacifier",
  "starring": [
    "Vin Diesel",
    "Lauren Graham"
  ],
  "runtime": 95,
  "genre": [
    "Comedy",
    "Family",
    "Action"
  ],
  "description": "Navy SEAL Shane Wolfe is handed a new assignment: Protect the five Plummer kids from enemies of their recently deceased father -- a government scientist whose top-secret experiment remains hidden in the kids' house.",
  "releaseYear": "2005",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/brkyQKNcaVNWGsCBCW5bKy9zVeW.jpg",
  "categories": {
    "plot": 5.857142857142857,
    "acting": 5.166666666666667,
    "ending": 2.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 2.0,
    "funny": 4.5,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Thanks for a great time, watching someone \"learn\" how to have a great time with kids."
    },
    {
      "rating": "10",
      "text": "Apparently everyone on this site is an idiot!!! One of the greatest family movies I've ever seen!"
    },
    {
      "rating": "9",
      "text": "Although the plot in this movie is cheesy, I thought this movie was hilarious and surprisingly charming, one you and your family will enjoy, just don't expect a deep plot backing it up."
    },
    {
      "rating": "7",
      "text": "A very funny movie. The acting wasn't the best sadly, but some were good. I thought the plot was good, but unlikely to happen in real, but that isn't the point! Overall, it was good."
    },
    {
      "rating": "6",
      "text": "It was a decent movie. It has moments, touching moments, it gives u chuckles and even a few laughs. It isnt trying to win awards or stun the audience with special effects. You sit down, watch it, laugh a little, think about how cute the kids are, then go on with rest of your day. Alot of action stars have taken a turn at comedy to soften their image, Stallone and Arnold S. to name a matinee viewing. The kids are charmers, Vin Diesel doesnt seem to mind being the but of jokes, and most of the acting is good. And ladies, he spends most of the movie in tight t-shirts. Guys u have to settle for Lauren Graham's sweet smile."
    },
    {
      "rating": "3",
      "text": "The Pacifier left me needing morphine.\rIt has moments of good, but is overwhelmingly bad to anyone over the age of about six, who can see what a ludicrous plot surrounds it."
    },
    {
      "rating": "2",
      "text": "This excuse for a cute family movie is your classic piece-of-junk movie unfitting of...Vin Diesel??? I'M basically a kid and I found this movie atrocious"
    },
    {
      "rating": "5",
      "text": "Great family movie, but not one that I enjoyed otherwise. I do like Vin Diesel but I kept wondering what he was thinking when he read this script and agreed to do this movie. If you can get over the childish jokes and bland acting you realize that there are worse option than The Pacifier, but their are far better options as well."
    },
    {
      "rating": "4",
      "text": "An immature comedy that tries to keep us watching with a few different approaches entertainment-wise. They all fail, and Diesel is poorly cast in his role."
    },
    {
      "rating": "2",
      "text": "I used to always hate this movie, but now there are pros and cons. There are more cons than pros. I still don't like this movie but i like that they play Good Charlotte \"The Anthem\" in the song. That is the only pro. But i hated this movie originally because the girl scouts got back at the boy scouts. But now i just dont like it because of the humor. Vin Diesel is a great actor though, he was in XXX."
    },
    {
      "rating": "5",
      "text": "The actors were bad,the story stupid.The movie was not even a little bit funny.The only reason i gave a score that high is of Vin Diesel.If you have something else to watch then watch it because you are going to loose the time you have with this movie."
    },
    {
      "rating": "3",
      "text": "OMG!!! Vin Diesel was a babysitter? What the f***?.\rSure one secret becomes nanny people , but will be in error , and I will have another excuse for dirty that this idea does not give more."
    },
    {
      "rating": "0",
      "text": "The director mustn't be allowed to direct another movie after this sh*t and pointless piece of cr*ap, all the \"jokes\" if they can be called like that, are inexistent and unfunny AF"
    },
    {
      "rating": "9",
      "text": "I thought this was a cool movie. It was very funny. Can't think of anything else. But it was good."
    },
    {
      "rating": "6",
      "text": "It was just another family drama but vin diesel had given a boost to the film."
    },
    {
      "rating": "2",
      "text": "5 hours after sitting through this entire film I am still asking myself what compelled me to actually watch it. Vin Diesel stars in this not so funny comedy about a Navy SEAL assigned to protect a family. From a plot that could have the smallest bit of potential to be an all around entertaining film to watch with the family was anything but entertaining or funny for that matter. Many scenes that were intended to make audiences laugh by director Adam Shankman did anything but that. Despite this film being nothing but cheesy and dull I was proud to see Vin Diesel break his typecast 'tough guy' role that he plays in almost every film he has done. Although he does play a Navy SEAL in the movie, Diesel has moments where he drops the tough guy act and transforms into a loving father figure for the children he is watching over. By the end he actually decides to quit everything he has worked for in his life as a Navy SEAL and decides to become a teacher at the school the kids attend which would have been cute if the movie wasn't as terrible as it is . So congratulations to Vin Diesel for showing the slightest bit of diversity. It is unfortunate that he saved it for this abomination of a comedy."
    },
    {
      "rating": "7",
      "text": "Se você está procurando um filme pra se divertir com sua família/namorada, vai se satisfazer com esse aqui.Os personagens são um tanto quanto caricatos/estereotipados; a história é bem fácil de se entender e o carisma do protagonista carrega bem a história. Esse é o filme que assistindo esperando algo. A realidade é que não queremos ser tão surpreendidos assim, nesse caso, particularmente. Sendo assim, super recomendado."
    },
    {
      "rating": "5",
      "text": "The Plot Is Not Interesting, The Music Is Bad. There Is No Good Actors In This Movie. Even Vin Diesel Acting Sucks.The Editing Is So Bad.The Only Good Thing About This Movie Is The Fight Scenes.The Plot Is Rushed."
    }
  ],
  "recommendations": [
    "my_spy",
    "couples_retreat",
    "30_minutes_or_less",
    "night_at_the_museum",
    "the_green_hornet",
    "thunder_force",
    "pitch_perfect_2",
    "this_means_war",
    "little_fockers",
    "kangaroo_jack",
    "alvin_and_the_chipmunks_the_squeakquel",
    "hubie_halloween",
    "bad_teacher",
    "second_act",
    "the_watch",
    "ride_along",
    "the_game_plan",
    "17_again",
    "the_war_with_grandpa",
    "baywatch",
    "identity_thief",
    "bedtime_stories",
    "megamind",
    "horrible_bosses_2",
    "night_at_the_museum_battle_of_the_smithsonian"
  ]
}