{
  "id": 802,
  "title": "The Kissing Booth 2",
  "starring": [
    "Joey King",
    "Jacob Elordi"
  ],
  "runtime": 132,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "With college decisions looming, Elle juggles her long-distance romance with Noah, changing relationship with bestie Lee and feelings for a new classmate.",
  "releaseYear": "2020",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/mb7wQv0adK3kjOUr9n93mANHhPJ.jpg",
  "categories": {
    "plot": 2.0,
    "acting": 3.8,
    "ending": 2.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 0.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Otra basura de Netflix para variar con historias ridículas dirigidas a un público que se conforma con cualquier cagada que le pongan en frente, si la primera parte fue mala, ésta es deliberadamente pésima, pero si eso impulsa la terrible carrera de actriz de Joey King, pues adelante."
    },
    {
      "rating": "10",
      "text": "Definitely Worth a watchWell, To be honest both the parts are nice. But, The second part will give you a emotional rollercoaster ride (be ready to take the ride while watching the movie :) ). It's way better in all perspectives. You'll definitely love the movie. Expecting for third part soon!"
    },
    {
      "rating": "10",
      "text": "Seems like a lot of the reviews from critics are quite negative... Have they forgotten what life is like as a teen?! Elle’s rollercoaster ride that is her senior year is even more action packed and emotional than her first adventure. A highly enjoyable feel good movie with plenty of surprise twists and turns.. Up to the very last second! I would highly recommend to any rom com connoisseurs."
    },
    {
      "rating": "3",
      "text": "I found this film to be pretty long, excessively convoluted, and drawn out."
    },
    {
      "rating": "5",
      "text": "Só serviu pra mostrar o desenvolvimento dos personagens, mantendo o drama adolescente. O final sugere um possível terceiro filme?? Bom para passar o tempo."
    },
    {
      "rating": "0",
      "text": "How this Joe king became from the act and making some teenager films that even teenagers don't like"
    },
    {
      "rating": "3",
      "text": "I really don't know why we got a sequel of this story.I mean I know it was successful and that in films always translate into sequels, but was another story with these characters really necessary?The answer is no.But here we are, in The Kissing Both 2. From the get go it's clear that the little development allowed was more than obvious considering that it's a sequel, however all the characters are so poorly written that their story is as shalliwd as might be expected.Only Joey King shows pedigree in terms of performance. The rest of the young cast leaves no impression and more than anything that's because none makes this feel fluid or normal. Overacting is the order of the day.If the key audience is still within the age range of the characters, they will obviously find it more appealing. But if you have passed that time and your tastes are looking for something more meaty, well, needless to say, you won't find it here.And can someone explain to me why the hell is it so long? That only made it more tedious.The editor should have known better where to cut.Another success for Netflix in terms of streaming numbers but cinema doesn't gain anything with this poor quality."
    },
    {
      "rating": "2",
      "text": "Using the same recipe doesn't mean it will be okay ... Outdated, predictable, the love stories don't work at all."
    },
    {
      "rating": "0",
      "text": "TL;DR - Heard about the first part of this film, was absolutely confounded to see a sequel to this. The characters are fun but they are just dragged all the way to the trash bin with horrendously stupid story writing and gag inducing dialogue writing.This movie was dumb even from a teenager in high-school/freshman year standpoint. Honestly I was not sure what to expect from the writers one who is a 48 year old man, I expected more interesting stuff over early 90's sitcom writing just stretched out over 2 hours. The only difference from a 90's sitcom and this movie is the sexual innuendos and male and female teen hormones splashed on the screen, arguably sexual tensions and sexual innuendos are better done in 90's sitcoms.Please consult young people or at least people who are good at writing to write stories about teenagers, I mean where are movies like Mean Girls or 10 Things I hate about you. God Damn 50 year old idiots writing trash and seeing it gobbled up by the current youth is inexplicable, a third movie already in works. Thankfully my curiosity for this now to be trilogy is dead and rotting at the end of the second part."
    },
    {
      "rating": "0",
      "text": "Its crap    is just boring, another not worthy movie from Netflix...is just...meh, that says everything"
    },
    {
      "rating": "0",
      "text": "This movie is garbage like the first one the story doesn't make sense and it's more than two hours of cringe PLEASE DON'T WATCH THIS. AND I DONT KNOW HOW THERE'S GONNA BE A THIRD **** ONE AND I BET IS GOING TO BE EVEN WORSE"
    },
    {
      "rating": "0",
      "text": "Pathetic movie. Only 11 year olds will watch this movie. It's those typical teenage netflix movies. Don't waste your time."
    },
    {
      "rating": "0",
      "text": "I always thought the friends should hook up. Also the boyfriend is a sociopath."
    },
    {
      "rating": "0",
      "text": "why did i waste 2 hours of my life on this. what an awful film. not  anything against the caste and that because its really not their fault. but damn......"
    },
    {
      "rating": "0",
      "text": "first movie was bad enough but no they had to come and ruin it with an even worse movie. just wasted an hour of my life."
    },
    {
      "rating": "0",
      "text": "Disgusting.The acting is mediocre at best and just when I thought it couldn't get any worse, they Made fun of someone fighting Lyme and Barr, that's revolting. I'm disappointed with the movie writers, the actor who said it and the production who allowed that."
    },
    {
      "rating": "0",
      "text": "it was a horrible movie, expected better. wasted my time. especially when they made fun of someones looks, that person has a disease. disliked this movie. couldnt finish it."
    },
    {
      "rating": "2",
      "text": "The movie is ****Bro I want Marco bAcKNoah is a piece of garbageAnd I hate the FREAKING endingBroerrrr stop itI really hate the plotWATCH IT for people that like espanõl boys Marco is hotXoxoxoxoxoxo"
    },
    {
      "rating": "0",
      "text": "is just boring, another not worthy movie from Netflix...is just...meh, that says everything"
    },
    {
      "rating": "0",
      "text": "terrible movie, 2 hours of boredom and predictable moments. I really don't know why this movie got a sequel"
    },
    {
      "rating": "0",
      "text": "It's has disrespectful offensive line generalizing and making fun of depression"
    },
    {
      "rating": "5",
      "text": "Great movie!! Great teenager movie. I love how new characters were brought into the movie to make things more intense. Great cliffhanger. Need to see more"
    },
    {
      "rating": "0",
      "text": "They really thought making fun of JB's Lyme disease and mono side effects (depression, hair loss, onset acne) is funny....."
    },
    {
      "rating": "2",
      "text": "I got bored after watching it for only 30 minutes and had to suffer through another 1:30 of a low budget Netflix original. Honestly feels like I’m watching kissing booth 2 with just a new hot guy at the school."
    },
    {
      "rating": "0",
      "text": "It is a really bad movie with bad role models and even worse messages. Do not recommend at all."
    },
    {
      "rating": "0",
      "text": "This film doesn't add anything to your life, His plot really really seems something a 13 year old teenager wrote on Wattpad.And if Netflix told you that the movie has more than 80% relevance with what you watch, DO NOT HEAR NETFLIX."
    },
    {
      "rating": "2",
      "text": "Only good the performance of Joey King, the more than two unjustified hours of duration of The Kissing Booth 2 do not make it something recommended for the section of films for teenagers."
    },
    {
      "rating": "6",
      "text": "Very cheesy and stupid but it's enjoyable if you know that this is what you came to see and not expecting more from this movie."
    }
  ],
  "recommendations": [
    "the_twilight_saga_breaking_dawn_part_1",
    "the_babysitter_killer_queen",
    "alvin_and_the_chipmunks_the_squeakquel",
    "alvin_and_the_chipmunks_chipwrecked",
    "the_twilight_saga_new_moon",
    "the_bye_bye_man",
    "the_twilight_saga_eclipse",
    "the_mummy_tomb_of_the_dragon_emperor",
    "the_happening",
    "old",
    "confessions_of_a_shopaholic",
    "sex_and_the_city",
    "grown_ups_2",
    "the_smurfs",
    "the_emoji_movie",
    "i_am_number_four",
    "meet_the_spartans",
    "herbie_fully_loaded",
    "pixels",
    "boyhood",
    "the_croods_a_new_age",
    "night_at_the_museum_battle_of_the_smithsonian",
    "doctor_strange_in_the_multiverse_of_madness",
    "twilight",
    "uglydolls"
  ]
}