{"id": 3769, "title": "The Black Phone", "starring": ["Mason Thames", "Ethan Hawke"], "runtime": 103, "genre": ["Horror", "Thriller"], "description": "Finney Blake, a shy but clever 13-year-old boy, is abducted by a sadistic killer and trapped in a soundproof basement where screaming is of little use. When a disconnected phone on the wall begins to ring, Finney discovers that he can hear the voices of the killer’s previous victims. And they are dead set on making sure that what happened to them doesn’t happen to Finney.", "releaseYear": "2022", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/lr11mCT85T1JanlgjMuhs9nMht4.jpg", "categories": {"plot": 8.25, "acting": 8.666666666666666, "ending": 8.125, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 3.0, "funny": 10.0, "action": 9.0}, "reviews": [{"rating": "9", "text": "An interesting movie nowadays that actually leaves you wanting more of each character and storyline. This is a must see movie for fans of horror and true crime"}, {"rating": "10", "text": "An excellent suspense film with a first-rate cast and an original, surprisingly believable plot. How could I tell the audience paid attention? No one checked their phones during the entire film. I know. I was sitting in the last row as usual."}, {"rating": "10", "text": "I really loved this movie. Extremely suspenseful, original, and chilling. I have not enjoyed a horror movie like this for a long time. Must watch for sure."}, {"rating": "7", "text": "Decent movie, abduction/escape plot with some supernatural elements thrown in. Good acting across the board, especially from the child actors. Somewhat creepy and suspenseful. Won't see it again. But don't regret seeing it."}, {"rating": "8", "text": "Solid movie. Nothing that really wow'd me but it was a cool concept that was well executed. Also one of the few movies that didn't mess up what happens to the villain."}, {"rating": "10", "text": "Wow, this was fantastic. I feel like we get less “real movies” these days and this was a gem amongst a bunch of soulless green screen garbage. Ethan Hawke was fantastic in this, and legitimately creeped me out. The children in this movie all were great actors as well. The acting, directing, and cinematography were all done incredibly well and made for an effective film. I felt like I was transported to the 70s completely. No internet, no cell phones, just you and your neighborhood. What happens to you… that’s all you knew then. This film works as a horror, psychological thriller, and even a period piece. 10/10."}, {"rating": "10", "text": "It is a little slow to start at first, but as it builds up the movie gets surprising and good. It's a tale that gives you the creeps because of how realistic it is and how mindblowing the storylines cross over to deliver a gripping paranormal suspense that is comparable to the Sixth Sense."}, {"rating": "10", "text": "Great performances, likable characters... funny in just the right spots, tense and scary.  Loved it!"}, {"rating": "10", "text": "Another masterpiece by Scott Derrickson combined with a beyond brilliant acting performance of Ethan Hawke, they absolutely KILLED it this time after their last work together in Sinister. The movie's pace accelerated from the beginning until the end with many unexpected plot twists and the climax was so satisfying. Fantastic script and excellent acting performances of both Mason and Madeleine. Gory, sweaty, bloody but still incredible cinematic - this deserves to be the horror movie of the year!"}, {"rating": "10", "text": "One is the best horror movie you would ever see and experience it’s just so refreshing seeing this now a days with everything just throwing jumó scare your way"}, {"rating": "7", "text": "Stephen King looms all over 'The Black Phone' — Joe Hill, the writer of the short story the movie is based on, is one of his sons —, but the danger of turning it into a derivative film is never fully materialized. It's great when horror films have something to say about our nature or a social problem, and this is one of those. Violence only generates more violence, and Scott Derrickson's screenplay frames this premise with concepts like bullying and living in an abusive environment. Ethan Hawke — who should accept more villain roles now — and the child actors are amazing, especially the little girl, who is very likable and funny. But there's a character in there who seems out of place. You'll know who when you see him.'The Black Phone' doesn't break any new ground, and the ending may feel a little underwhelming and predictable, but the way Derrickson delivers tension, very calculated jump scares, and an intimate but socially relevant story is what distances this one from other generic mainstream horror films."}, {"rating": "7", "text": "It holds your attention.  It definitely feels like you're watching someone play  a video game.  Masks and overall creepiness was pretty good."}, {"rating": "8", "text": "\"The Black Phone\" finds director/co-writer Scott Derrickson at his most streamlined and elemental, taking the dynamite idea at the center of the source material and bringing it to the silver screen in a deeply imaginative and satisfying way. Riding high on some terrific turns from its younger performers, some truly inspired visual flourishes and an overarching tone that really makes the most of its terrifying premise, \"The Black Phone\" honestly is at its best when it's more of a thriller than a horror movie. Those supernatural elements, however, are just too tantalizing to pass up, and every time we're given a taste of the creative ideas at hand, it's just a real cinematic treat. I do feel that certain things could've been tightened up (with more attention to detail being devoted towards the protagonist's arc, in particular) but, again, this was a real surprise. Not just in that it was an entertaining horror film, but a really brilliant one to boot."}, {"rating": "7", "text": "Very solid flick. My expectations weren't high but by the end I was pleasantly surprised and thoroughly entertained. The stand out for me was the little sister who gives a tremendous performance in one particularly scene. Definitely a talent to watch out for in the future."}, {"rating": "8", "text": "Um suspense muito bom, você fica tenso quase o filme todo, mas faltou explica a motivação do sequestrador, mas vale o ingresso com certeza"}, {"rating": "8", "text": "Scott Derrickson é o nome por trás de dois filmes de terror que não saem da minha mente até hoje, \"The Exorcism of Emily Rose\" e \"Sinister\". Com \"The Black Phone\" ele já garantiu um lugar por aqui novamente. Há pequenos pontos nos quais eu mudaria. Por exemplo, não teria inserido 'aparições' que rolam em determinadas cenas. Mas ainda é um trabalho muito bem amarrado e fora da curva entre os filmes do gênero.Ah, se eu não ver a extraordinária Madeleine McGraw em mais filmes hollywood terá sérios problemas comigo."}, {"rating": "8", "text": "Didn't expect to like it this much. Damn good movie, proving Blumhouse can produce a movie with an interesting script. Ethan Hawke is also amazing in those masks. Guess you don't need to show your face to leave an impression(I'm looking at YOU Mando and Master Chief)."}, {"rating": "7", "text": "The Black Phone is a tribute to the best of Stephen Kings characters, and a nice tribute to Halloween. The brother/sister play off each other really well. This movie doesn't try to shock you, or get too graphic with the blood and violence. But it has a lot of heart to it. It was nice to see Ethan Hawke play \"The Grabber\" without chewing the scenery like he was going for an Oscar. A deeply distubured and quietly menacing tribute to Stephen King's \"It\" clown.The ending was cathartic, and well edited.  It all worked for me, and I'm not a big horror movie fan."}, {"rating": "8", "text": "A good thriller that actually had a clever story and good acting. Ticked all the boxes, definitely worth a watch."}, {"rating": "7", "text": "This is a solid movie. I never felt that this movie dragged at any point so its passing is pretty good. I did however find that it ended a little early, leaving me wanting more which is probably a good sign.The overall plot isn't too complicated. Its a kidnapping plot with a little twist to it and after the story is told it leads to a very satisfying ending. I would have liked a bit more of a thriller aspect to this but it went more towards the supernatural route. Has a few jump scares and some great characters but is missing a bit of complexity I would have liked. SEVEN 7/10"}, {"rating": "8", "text": "Bir beyzbol referansinin korku filmini sekillendirecegi hic aklima gelmezdi. Artik strikeoutlari daha dikkatli sekilde izleyecegim. Scott Derrickson'un son filmi son 20 dakikasina kadar \"iyi\" notla giderken son 20 dakika içinde bir-iki basamak birden üst seviyeye çıkıyor. Bu filme birçok insan The Grabber rolündeki Ethan Hawke için gidecek ama filmden çıktıklarında Mason Thames ve Madeleine McGraw'ın performanslarının ne kadar harika olduklarından bahsedecekler. Ikisinin de performansi tek kelimeyle sahaneydi. Eskil Vogt'un The Innocents filminde de oldukca basarili cocuk oyuncularin performansini gormustuk ve bu trend The Black Phone ile de devam ediyor gibi gorunuyor. Ethan Hawke'i, yani The Grabber'i daha fazla sahnede gormeyi isterdim ama filmin ana temasi siyah telefon oldugu icin bunu anlayabiliyorum. Korku filmi benim en sevdigim film turleri arasinda degil ama The Black Phone'u gercekten begendim. Mason Thames ilerleyen yillarda adindan cok daha fazla soz ettirecek gibi duruyor. Sonu harika oldugu icin filme puanim 7 olacakken 8 oldu."}, {"rating": "8", "text": "Finally! A good horror movie. I can see this considered as a classic in the near future."}, {"rating": "10", "text": "Awesome movie from start to finish!! Loved the story telling and learning about the characters. Just the right amount of creepy & scary thrown in with an ending that was the perfect payoff!!!"}, {"rating": "9", "text": "Absolutely brilliant, style, tone, setting, tension, brilliant, slightly slow first act but the next two acts make up for this in brilliantly tense fashion. An astounding race against time thriller/horror"}, {"rating": "10", "text": "\"The Black Phone\" finds director/co-writer Scott Derrickson, at his most streamlined and rudimentary, taking the dynamite idea at the center of the original material and bringing it to the silver screen in a profoundly imaginative and satisfying way. Riding high on some terrific turns from its younger performers, some truly inspired visual flourishes, and an overarching tone that makes the most of its scary premise, \"The Black Phone\" is at its best when it is more of a thriller than a horror movie. Those supernatural elements, however, are just too irresistible to pass up, and every time we are given a taste of the creative ideas at hand, it is just a real cinematic treat. I do feel that certain things could have been tensed up (with more attention to detail being devoted towards the protagonist's arc, in particular), but, again, this was a real surprise. Not just in that it was an entertaining horror film, but a brilliant one to boot."}, {"rating": "8", "text": "Black phone is a decent horror movie . It isn't scary at all but it has a great atmospher , and performances are really good especially ethan hawke . His character gives you the creepy and mystrious vibe . But i don't think it worth watching more than 1 time"}, {"rating": "8", "text": "The Black Phone is a horror/thriller with supernatural elements about a teenager who is abducted by a serial child abductor nicknamed the \"Grabber.\" It starts off introducing us to two teen siblings, Finney and Gwen Blake, who live with their abusive alcoholic father. Gwen has dreams which are disturbing and turn out to be reality where she has premonitions of friends and her brother being captured by a serial killer. Finney is the victim of bullies but is protected by his friend, Robin, who is tough and fends off the bullies. Robin is later abducted and killed by the Grabber serial killer. Eventually Finney is abducted by the Grabber and he is thrown in a basement with a phone. Finney contacts ghosts of previous victims through the phone which is a supernatural element of the movie. They give him advice on how to get out of his imprisonment.  The movie was creepy and the Grabber character was terrifying. The movie got tense at various points though it did suffer from some plot holes."}, {"rating": "7", "text": "This supernatural horror movie will remind you of similar movies (in particular Silence of the Lambs and Saw) but it is so well acted and directed that you should definitely check it out"}, {"rating": "9", "text": "Really well done. Concise script and great acting by the young actors. Kept you on the edge of your seat the whole time. It was a puzzle solving adventure of sorts that made the protagonist rely on his wits to combat the monster. The movie actually reminded me a bit of the old M. Night classic \"Signs\"."}, {"rating": "9", "text": "I'm just saying that it was time to see one of horror that does justice to the genre. What draws attention is Ethan Hawke -with his eternal adolescent face- playing an inconceivable villain who causes concern even to the most apathetic. If you watch this movie at night, it is at your own risk."}, {"rating": "10", "text": "The Black Phone is one of the best horror movies I've ever seen. The writing was excellent but some of the jump scares did feel forced. The atmosphere was outstanding, so creepy and intense. The performances from Ethan Hawke, Madeleine McGraw, and Mason Thames were exceptional. The makeup was superb especially on all the murder victims. The score was great and it really helped with the intensity of the movie. An A+ movie for me."}, {"rating": "7", "text": "Wow, wow, wow! This movie was amazing! This gave me huge sinister vibes, which makes sense because Scott Derrickson wrote and directed Sinister as well as this. I absolutely enjoyed Sinister so makes sense why I would enjoy this. I loved the vibes of this movie, even the colours. Loved Ethan’s performance. Mason and Madeleine as well! Loved how it had some Karate Kid vibes. I’m not very scared of horror movies, but this made me jump a couple times. I was on the edge. I didn’t like the Max character, some things didn’t make sense and I wish they explained the actual black phone, but other than that it was very good. I would have enjoyed it even more if this film was even a little bit longer tbh. I feel like it could have had a tad bit more character development. But I will certainly be watching this more than once."}, {"rating": "7", "text": "Was interested in seeing this film for the intriguing premise that was marketed. After watching The Black Phone, I can safely say my interest was justified. However, the film suffers from some oddities - plot holes, unnecessary story points, etc. But, even with these flaws it is still an enjoyable horror movie that tries something new and I appreciate that."}, {"rating": "9", "text": "An exciting thriller that solves the mystery in a unique way. The cast and the different story arcs are good and the tension can be felt from start to finish without showing any exaggerated horror elements. A well balanced movie!"}, {"rating": "10", "text": "Great thriller! Well thought out and planned with a very satisfying ending."}, {"rating": "9", "text": "One of the best movies this year! Makes you feel like you are living the struggles! Can’t recommend this movie enough. Not a fair rating for its quality."}, {"rating": "8", "text": "While it does have plot holes in the fact that the brother somehow didn't figure out the person he lived with had kidnapped 6 children in quick succession and some cheap jumpscares that are really not needed in the film. It's also a breath of fresh air set in the 70s with creative story telling, creepy atmosphere, and an interesting villain and main character. Great movie."}, {"rating": "7", "text": "Quizás tenía las expectativas muy altas. La película me ha gustado bastante pero la pintaron como una cinta cruda y una actuación gloriosa de Ethan Hawke, pero la película tiene 3 momentos contados de terror (que son buenos) y Ethan sale muy poco y no se deja ver con la máscara. Me imaginaba que iba a ser tipo Anthony Hopkins en el silencio de los corderos que te imponía y te cargabas con el. Luego, el final me pareció muy rápido, parecía que no les quedaba más tiempo y lo hicieron apresurado. Aún así, la película es buena y Ethan Hawke lo hace bien. El La recomiendo."}, {"rating": "9", "text": "The movie isn't that scary and it has some scenes that will make people uncomfortable, but I absolutely loved the story and setting of the Movie and think it was handled really well"}, {"rating": "10", "text": "The Black Phone is easily the best thriller that came out this year so far and it's also one of the best films of the year, the movie fills with magnificent performance not only by Ethan Hawke but everybody in this movie was just fantastic, it is a clever yet terrifying, intense, and scary films that's been well directed by Scott Derrickson who was famously known for directing Doctor Strange movie and for me if you wanna compare it based on the director The Black Phone is a better movie than Doctor Strange, so overall The Black Phone is an incredibly well done thriller that are entertaining to watch and it's gonna make you terrified also, it's great, it's really good, i love it, thumbs way up."}, {"rating": "8", "text": "A neat little indie horror movie that's tense, thrilling, and fantastically acted and directed. Man these kid actors are seriously amazing. Definitely worth a watch!"}, {"rating": "9", "text": "This movie was pretty crazy! Horror/Thriller. Great acting by everyone! Couple of scenes did not make sense but is typical in this genre. 100% recommend."}, {"rating": "7", "text": "It's pretty good. There were some pretty good scenes towards the end. I don't see how anyone to hate it."}, {"rating": "8", "text": "This Movie Is Honestly Great. It achieves what it set out to do. With an amazing performance from Ethan Hawke (The Grabber) and Mason Thames (Finney), It adds to the tension built up throughout the movie. Of course, some cheap jump scares take away from the incredible acting but that doesn't detriment the rest of the movie. You really want Finney to escape. One thing that I think this movie really needed was more exploration of character. Like as an example, The Grabber has a lot of things about him that should have been explored, such as why the grabber was so afraid to show his face. I think if there was more exploration into some characters like The Grabber it would have made the movie better than it already is. Honestly, I recommend you watch The Black Phone just for the acting alone. Still, looking at it as a whole, it is still a great entertaining thriller."}, {"rating": "4", "text": "What a boring and underwhelming film. Who knew a film about child kidnap could be so boring, unscary and cringeworthy at times. I would not recommend this film, save your money cus it sucks. I'm baffled thay anyone can enjoy this lazy, nonsensical film"}, {"rating": "10", "text": "I find it hard to pay attention to movies I watch because of the expected plot or boring narrative, but this thriller/horror movie made a simplistic plot intriguing and memorable. I think about this movie a lot, just like I do with other favorites, because of the incredible acting. Gwen/Gwenny, the sister of Finney in the movie, was an incredible actress. She really emphasized her emotions and portrayed exactly how it feels to be physically and emotionally abused. One of my favorite scenes was when Robin, as a ghost, was on the phone with Finney teaching him how to attack and kill the grabber. Excellent movie, and will watch it again soon!"}, {"rating": "10", "text": "really enjoyed this movie, there was alot of jump scare moments, it was chilling.overall i would definitely watch this movie again"}, {"rating": "10", "text": "Literally one of the most touching emotional horror movies the cast is amazing"}, {"rating": "10", "text": "A suburban Colorado town is being haunted by a string of recent child abductions by someone known only as “The Grabber”. The police are no closer to catching anyone when 13-year-old Finney (Mason Thames) is abducted by the absolutely mental Ethan Hawke in his most psycho role yet. Finney awakens in a soundproof basement with no hope of escape. He then starts receiving calls from a disconnected phone by the serial killer’s previous victims. Cue the scary music.This is everything a horror movie should be. It’s highly tense the whole way through and the entire cast are phenomenal. This is not surprising when you cast Ethan Hawke because the man just cannot put in a bad performance. He is monstrous, terrifying and will make your skin crawl. The creepy masks only add another layer, giving him an almost animalistic characteristic. Getting child actors for a story like this will either make or break the movie and the performances of brother and sister, Finney and Gwen, played by Mason Thames and Madeleine McGraw are brilliant. Their talent shines through, they had believable chemistry with each other and they’re the reason the audience will become so invested in the story.As a big horror fan I absolutely loved The Black Phone. It’s everything I want in a great horror movie, expertly blending real-world horror with supernatural elements without becoming silly. It will have you on the edge of your seat, and the interactions between Thames and Hawke are genuinely frightening. It also got me good with a jump scare so extra points for that. Many horrors can particularly suffer with a messy third act but The Black Phone is strong all the way through. You can see the inspiration from other movies in there, with some scenes very much reminiscent of Stephen King, which makes sense considering it’s based on a short story by Joe Hill. Director Scott Derrickson knows how to make an effective horror movie, and The Black Phone is one people will definitely remember.The Black Phone is atmospheric, stressful and the sadistic performance from Hawke will be sure to scare the sh!te out of everyone. It’s not just a great horror movie, it’s also an entertaining thriller you won’t want to miss. Highly recommended for all the horror fans."}, {"rating": "7", "text": "You know how these kids movies are there full of unnecessary swearing and give off cringe vibes, this movie isn’t gonna win any awards but is solid also I can’t remember a single characters name besides Finnie who is the main character."}], "recommendations": ["the_others", "insidious_chapter_3", "the_woman_in_black", "the_babadook", "the_conjuring_2", "ouija_origin_of_evil", "lights_out", "it", "candyman", "the_conjuring_the_devil_made_me_do_it", "the_conjuring", "vacancy", "the_invisible_man", "the_sixth_sense", "a_walk_among_the_tombstones", "it_follows", "scary_stories_to_tell_in_the_dark", "sinister_2", "orphan", "the_ring", "insidious_chapter_2", "ready_or_not", "the_fly", "the_prodigy", "run"]}