{
  "id": 2145,
  "title": "The Founder",
  "starring": [
    "Michael Keaton",
    "Nick Offerman"
  ],
  "runtime": 115,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "The true story of how Ray Kroc, a salesman from Illinois, met Mac and Dick McDonald, who were running a burger operation in 1950s Southern California. Kroc was impressed by the brothers’ speedy system of making the food and saw franchise potential. He maneuvered himself into a position to be able to pull the company from the brothers and create a billion-dollar empire.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8gLIksu5ggdfBL1UbeTeonHquxl.jpg",
  "categories": {
    "plot": 7.482142857142857,
    "acting": 7.45945945945946,
    "ending": 8.142857142857142,
    "soundtrack": 7.0,
    "cinematography": 7.75,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The Founder, directed by John Lee Hancock and starring Michael Keaton, brings to life the story of Ray Kroc--the self-proclaimed founder of McDonald's.Keaton plays the part of Kroc with a manic sense of urgency, knowing he has gold on his hands and desperately wanting to make that gold-- specifically the golden arches--his own.  Casting directors often refer to an “It” factor when it comes to actors, and whatever “It” is, Michael Keaton has it.  He’s as fascinating to watch in this film as ever.The direction of this film is well done but surprisingly it’s the editing that stands out.  There are a number of times that the story needs to jump back and forth between the past and present or show the processes involved with running a busy restaurant and the editing is done both seamlessly and effectively.Unfortunately, it’s mostly the writing that drags this picture out of any serious awards consideration, despite the Weinstein’s doing everything in their power to position it so.  There’s an adage in writing that says, \"show, don’t tell.”  There’s also a ten-cent word for this called \"exposition,\" and The Founder is guilty of often explaining straightforward plot points instead of allowing audience members to figure it out on their own.In the end, Keaton’s performance and the real-life story of Ray Kroc embody the spirit of American ambition, each driven by one of the most essential traits in business: persistence."
    },
    {
      "rating": "8",
      "text": "While there may be a feeling of a film trying to play it safe, similar to John Lee Hancock's last film Saving Mr. Banks it hits because of its performances.  Everyone is great here especially Michael Keaton.  A-"
    },
    {
      "rating": "8",
      "text": "Keaton shines here as the perfect villain Ray Kroc. It's a film that shows the greed and backstabbing behind the american dream"
    },
    {
      "rating": "7",
      "text": "There's two types of people about McDonald's. One is the lover and the other one's the hater. McDonald's lovers will find a big meal to find in its forsaken history, but haters will have to find their way to yuck things out while actually enjoying how great this film is thanks to the crew and of course Michael Keaton."
    },
    {
      "rating": "9",
      "text": "Have you ever wondered why McDonald's was owned by a guy named Ray Kroc and not by a guy named McDonald? Well this excellent film tells the fascinating story. The McDonald brothers just wanted to be successful and do right by their customers - Kroc had \"bigger\" ideas. Check out this film to learn the rest of the story. Fantastic performance, as usual, by Michael Keaton. Also great are Nick Offerman and John Carroll Lynch as the McDonald brothers."
    },
    {
      "rating": "7",
      "text": "I enjoyed it, but it wasn't perfect. The acting was great, and they picked the best people for the role. The story was good, but left out to many important details. The story was told well at the parts they included, which is great. It was worth a watch."
    },
    {
      "rating": "8",
      "text": "Ever wondered where McDonald started and how they become so famous. Watch this fun filled entertainer which answers the questions in a fun way."
    },
    {
      "rating": "8",
      "text": "Michael Keaton's character (so well played by Keaton!) is both inspiring and mildly despicable. Inspiring because the film makers give you a glimpse into his turbo-charged \"how can I turn this into a huge opportunity\" mind, but also despicable because he goes for what he wants (a restaurant or someone's wife) with no regard to who gets hurt. In my opinion, the genius that quickly gets overlooked is the McDonald brother that developed the original fast burger system. He could have been the Walt Disney of fast food who's potential gets wasted by managing the original restaurant. Overall, well-crafted entertaining film!"
    },
    {
      "rating": "5",
      "text": "As much as I commend Michael Keaton for his performance, and take interest in the history of McDonald's, I find it personally too much of an attack on Ray Kroc and the idea of the ambitious and determined businessman. It's always true that a bio is not meant to be one hundred percent factual, but I didn't feel like it needed to demonize Ray Kroc any further than he may have done himself. I know what Hollywood feels about businessmen and all, but I find it formulaic and pushing an agenda I don't want to see almost all the time. And I mean those last three words. ALL. THE. TIME."
    },
    {
      "rating": "10",
      "text": "What is so fascinating about this story is the interesting twist it brings about success. And how elusive and strange the goddess of fortune really is.Ray Kroc may listen all he wants about \"persist-ency and determination\" but in the end it's all luck, more luck and a lot of unethical behavior.A must see for all those \"experts\" in the science of success. And the countless books they write on the subject."
    },
    {
      "rating": "4",
      "text": "honestly i forgot i even watched this movie. its fine. the acting is fine. the plot is fine. the cinematography is fine. the characters are fine. its a very fine movie with no substance to it."
    },
    {
      "rating": "7",
      "text": "\"The Founder\" stars Michael Keaton and Laura Dern. Directed by John Lee Hancock (“The Blind Side”, “Saving Mr. Banks”) and written by Robert D. Siegel (“The Wrestler), the film tells the story of the beginning and evolution of the giant franchise operation known worldwide as “McDonalds”. More to the point, it tells the story of a down on his luck salesman named Ray Kroc who by chance comes upon the hamburger and shakes stand owned and operated by the McDonald brothers (the real founders) and how he ultimately took their small enterprise and made it into one of the most well known and successful international food serving entities in history (and which, by estimate, is now serving approximately 1% of the world’s population). Alas for poor Mr Keaton who always seems to be so much better than the movies in which he appears. This film falls into that category except for the fact that this is, after all,  the story of McDonalds and how one man was able to create this huge enterprise and make it the most powerful force in the franchise food industry. Add to that the always dependable quality performance of Mr. Keaton and the film’s historical significance and it becomes a vehicle well worth viewing. I give the film a 7.5 rating with a reminder that if it wasn't telling the story of McDonalds, the film would  be more like a Big Mac with only the bun."
    },
    {
      "rating": "8",
      "text": "Michael Keaton plays Ray Kroc, a struggling salesman who discovers an innovative fast food concept created by Mac and Dick McDonald. While challenging the brothers' control, his determination and drive expanded the chain. The rest is restaurant history. Keaton's complex performance is twitchy and manic, not exactly a sympathetic character, but an admirable one. The story manages to convey the fascinating developments with a lively pace. In addition to teaching the details of this impressive success story, the film centers around Keaton's dynamic creation."
    },
    {
      "rating": "10",
      "text": "Very, very interesting and entertaining, with a tremendous Oscar-worthy performance from Michael Keaton, one of the finest actors of our generation. Excellent performances from the entire supporting cast as well, especially John Carroll Lynch and Nick Offerman as the McDonald brothers. Illuminating, thought-provoking and plenty of fun as well. Highly recommended."
    },
    {
      "rating": "6",
      "text": "It's always interesting to see a character who goes after a dream and to be reminded that true success faces constant obstacles despite mythic tales that stars are born not made. However, aside from business dealings and accidental friendships, The Founder is short on personal details. It hints that his love life is important but vaguely describes their dramatic directions. Also, if you read between the lines, it appears that Kroc is quite uncaring and an unforgiving business man but instead exalts his tenacity."
    },
    {
      "rating": "9",
      "text": "Had very few expectations for this movie, and enjoyed it thoroughly. Keaton is outstanding, and the whole cast is generally very strong, in a well-told story that touches on various themes lightly but very adeptly in my view. Strong impact."
    },
    {
      "rating": "7",
      "text": "A moviegoer enters a theatre with expectations whether it is seeing the star(s) or they have heard of the story line and, in some cases, who directed it. I walked in expecting a good performance by Michael Keaton and some of the more familiar names in the cast like Laura Dern and Patrick Wilson and not expecting much else. To my surprise, and delight, “The Founder” was a much better film than I had anticipated.Based on a true story “The Founder” is about Ray Kroc (Michael Keaton) who got control, many say stole, McDonald’s from two brothers, Dick and Mac McDonald, (John Carroll and Nick Offerman). They started the change of American restaurants by introducing ‘fast food’ using fresh items in San Bernadino, California. The brothers had things down to a science, even in some cases inventing equipment, treated their employees like family and took pride in all aspects of the business.While the story focuses on the interaction between the two brothers and Kroc it is mainly about the latter. Did the brothers have a family life? You won’t find out. We do meet Kroc’s wife who spent most of her life supporting his schemes that never worked out and his secretary June (Kate Kneeland) who seemed to live in the office 24/7, along with some bankers, lawyers and investors.There is no doubting that Michael Keaton has a load of charm and gives an excellent performance but even he can’t dispel the fact that Kroc didn’t care for people caring only for ‘the art of the deal’. Yes, there are many resemblances between the two men even though this movie was made long before Trump even started running for business. Are all very successful, money making men, as ruthless to threaten business partners that they will sue them until they will lose financially or be buried in paperwork so high that they won’t be able to take care of their business? Do these men not care about people and their families? As good as Keaton is he doesn’t make you overcome the fact that Kroc was not a nice guy, a 'good guy'.All the actors mentioned plus Linda Cardellini as Patrick Wilson’s wife, B.J. Novak as a financial adviser and assorted McDonald’s employees all do what they can as the screenwriter, Robert Siegel, doesn’t give them much time on screen. The brothers, as played by Nick Offerman and John Carroll Lynch, are as interesting as Keaton and more affable than the latter ever seemed to be. Is there room in the world today for people like the McDonald brothers?Using the new idiom of the day Kroc was known for ‘alternate facts’ regarding his life and as good as Keaton is he doesn’t make you overcome the fact that Kroc was not a nice guy, a good guy.“The Founder” is more than you expect it to be, not only from the actors, but little things like except for popular song sung in a restaurant I had to look up if there was even music in the movie! Director John Lee Hancock gives us a sunny USA pictorially even in the very down sequences where Kroc is being very much the ‘businessman’ and not like he is dealing with human beings.While it is a good movie and I would recommend it “The Founder” is not a must see movie."
    },
    {
      "rating": "7",
      "text": "A mesmerizing horror film, The Founder is the clearest depiction of modern day America ever put to film. While a clunky work, director John Lee Hancock's depiction of Ray Kroc (Michael Keaton) swooping in, stealing McDonald's from its rightful owners, passing it off as his own, screwing those brothers over, and then really sticking it to them to squash them entirely, The Founder plays out like a modern day depiction of capitalism. With the little guy getting screwed over in the name of corporate's bottom line, America has been plagued with this rapidly decreasing middle class while the rich only get richer. In this film, Hancock puts this on full display in a terrifying depiction of smart business practices at the expense of human kindness and empathy. Instead, it is win at all costs and allow the losers to bathe in a tub of their own blood.In an excellent performance, Keaton plays the hard working and hard-nosed shark that was Ray Kroc brilliantly. He is a dreamer who will stop at nothing to have everything he could ever hope to think about. From creating a multi-billion dollar corporation out of merely seeing the name \"McDonald's\" to leaving his wife after one glance of a new woman who captures his eye, nothing happens quickly for Kroc but it always happens. No matter what he does, he is always thinking twenty steps ahead and is clearly a brilliant businessman. While many of his ideas are handed to him, he builds them up and is able to capitalize on the ideas given to him. Sometimes, in life, it is not originality that reaps rewards. Rather, it is being willing and able to execute an idea, whether it is yours or not. Here, Kroc does exactly that and takes every idea over the goal line with brilliant precision and persistence. Unfortunately, in doing so, he tramples over everybody who gets in his way or he perceives as getting in his way even if they are just innocent bystanders.It is this negativity that creates the central conflict of The Founder. Ray Kroc may be a brilliant businessman, but he is a horrible husband and person to be in business with. He is cut throat and not afraid to let his eyes wander to new possibilities. Dick McDonald (Nick Offerman) realizes this quickly, but sticks with the deal because of the urging of Mac McDonald (John Carroll Lynch). Unfortunately, Kroc is a carnivore. He feeds on fresh meat and seeks to sink his teeth into whatever competition he can find. Turning on everybody in his life throughout the course of the film, The Founder is greatly negative towards its subject and is unafraid to extensively highlight the flaws in his character. No matter how smart he was and how much of a visionary he could be, it is impossible to ignore the fact that Ray Kroc was a mostly bad man who was unnecessarily cruel to everybody who did him wrong in his eyes.The part that does hold back The Founder, however, is a problem inherent in many biopics. Director John Lee Hancock is simply unable to blend his subject's professional life with his personal life. While showing many of the same traits in his personal life, especially with how he just dumps Ethel (Laura Dern) for a new wife when she offers him more in that moment, the film always seems to come to a halt. Compared to personal indulgences in films such as There Will Be Blood or The Social Network, both cited as influences on the work, The Founder is never able to make it gel. Thematically, they work, but for the film's pacing and plot it always feels like stomping on the breaks in favor of taking an undesirable detour. There is no flow or cohesion as a result of these scenes that just distract from the story of McDonald's being stolen from the brothers. Instead, it turns into too much backstory about Ray Kroc and not enough about the film's true victims. The scenes, especially Dern's Ethel, feel like filler and Hancock just checking off a box from the biopic formula checklist, instead of being a section of the film he is interested in at all. Had he been interested in exploring Ethel and Kroc's personal life, their divorce would have been more important and he would not have just jumped to him having married Joan (Linda Cardellini), who was actually his third wife, not his second. The film never actually embraces exploring Kroc's at home life to the point, which is a shame since it is in the film. Featuring an excellent performance from Michael Keaton in the central role, The Founder may not be 2016's The Social Network, but it is a terrifying exploration of the death of the middle class and rise to power of individuals with questionable morals. It indulges into Ray Kroc's personal life far too much to be sure, but its unflinching damnation of its central character and lack of fear in showing his negative qualities, makes the film a rarity in the biopic genre. A chilling, entertaining, compelling, and entirely revealing look behind the true story behind McDonald's, John Lee Hancock's The Founder is a very strong work."
    },
    {
      "rating": "7",
      "text": "Veni, vidi, vici!I anticipated another inspiring biopic about a man who built an empire. That's partially true, because this was inspired by the right kind of wrong thing. I mean it was not actually about the McDonalds' story, the McDonald brothers, but the fast food chain McDonald, how the franchise got rapidly spread across the globe and the person behind it. With the film having both good and bad side, it stayed mostly neutral. But due to the main character, you would see too much lean on what seems the reason behind the McDonald's today's popularity.So it's like another typical American founders' story like Apple, Facebook. I mean not the one who found the company with all the hard works, but the one who dived in and took all the credit. Ray Kroc was a traveling salesman and he's not doing any good. But one day he meets the brothers who had started a modernised kitchen and its fast food service. He shows lots of interest in it and so he joins hands with them. With his new ideas, how he makes a fortune out of it and the future of the company, all revealed in the later part.An enjoyable film. Particularly for Michael Keaton. Well directed film as well. Film wise it was a good one, but the story wise not morally right. It was about the flaws in our society, our system. Some men can do anything like pulling others leg to climb the success ladder. It's not them to blame completely, because they had struggled enough to understand their future path. So definitely for some people, this film would inspire. If you are a regular McDonalds' customer, you should watch it. Otherwise, just to learn the truth, it is worth a watch.7/10"
    },
    {
      "rating": "6",
      "text": "An at times interesting and well-acted, albeit pedestrian look at Ray Croc and how he managed to steal the McDonald's name from the two founding brothers. The always reliable Michael Keaton turns in a committed worthwhile performance and like I said, the story is interesting enough most of the time, however, as mentioned before, it was also a bit too pedestrian for my liking and the film ends things off on a note that left a disagreeable and somewhat sour taste in my mouth. Overall, it's worth checking out if you really like Keaton and are interesting in learning more about the background of McDonald's. However, be cautioned that most will likely walk out of this film with a pissed off feeling and sour taste much like I did."
    },
    {
      "rating": "8",
      "text": "\"The Founder\" unveils the capitalistic underbelly propelling McDonald's success today entertainingly. The script is smart and witty, the attention to detail is mesmerising, and Michael Keaton's performance as Ray Kroc is splendid."
    },
    {
      "rating": "8",
      "text": "Having lived most of my life in Southern California, I had heard that McDonald's was started in San Bernardino by someone named McDonald.  But I had never heard the full story of Ray Kroc.  Michael Keaton was criminally overlooked in the Oscar nominations as the leading character.  He starts out sympathetic, a travelling salesman in his 50's who never quite made it, but hears that a restaurant named McDonald's ordered several milk shake making machines (which he sells) and decides to take a look at the restaurant himself.  The McDonald brothers are the inventors, who have tried to franchise their restaurant but were unsuccessful.  Kroc figures out how to do this, but along the way his determination turns to ambition and greed.  This is an interesting look at why the marketers, not the inventors, frequently succeed in our economy.  The McDonald brothers are the most sympathetic characters, but McDonald's would never have become what it is today without Kroc.This is also an interesting look at the young Joan Kroc, Ray's second wife, who is known to many San Diegans as the former owner of the Padres, patron of the arts, and philanthropist."
    },
    {
      "rating": "7",
      "text": "A surprisingly good January release (why was this put out now?) featuring an excellent (but likely to be overlooked) performance by Michael Keaton portraying a character who is simultaneously admirable for his persistent drive and distasteful for his ruthlessness and relentless hucksterism. Despite some noticeable narrative gaps that hurt the flow of the story, on balance, this well-made biopic serves up some tasty morsels about the back story behind the growth of this multinational food service behemoth. Some of the critical observations that have been leveled against this release are noteworthy and insightful, but others lack credibility by complaining that the picture hasn't made grander, overarching statements about the nature of contemporary American business, objectives that it was clearly not designed nor intended to do. Don't expect a gourmet meal from this one, but do enjoy the satisfying snack it provides."
    },
    {
      "rating": "8",
      "text": "It's another severely underrated film of 2017. Unlike the mega-conglomerate it's based on(maybe it would have been more successful if it was called McDonald's)this movie got little in terms of money. Might be the best movie until the March hitters roll out"
    },
    {
      "rating": "6",
      "text": "The Founder is as solid film, nothing much to criticize. I actually liked Blow Job Novak in here. Keaton is fine, the side characters are acceptable too"
    },
    {
      "rating": "8",
      "text": "One of the best movies I have seen in last few months. What is really good here is the cast and acting from everyone and the story is genuinely interesting even though at some points it feels like it might be advertising McDonalds as this really good thing too much. But yeah it showed how Ray Croc turns into this big corporative **** but at the same time takes McDonalds to the international level in which they wouldn't get to without him"
    },
    {
      "rating": "7",
      "text": "The Founder is an entertaining representation of the inception of the world's biggest fast food industry. Michael Keaton serves up a great performance as the creator of McDonald's."
    },
    {
      "rating": "5",
      "text": "If you thought a movie about the “founder” of McDonald’s would be as bland as the food then congratulations you’d be right. You could skip this movie and it wouldn’t make an ounce of difference. To be fair Michael Keaton gives a great performance but with a film whose central character is so ruthless and unlikeable it’s hard to find any entertainment value at all.Franchise, franchise, franchise, food, food, food, contracts, contracts, end. Not that I was expecting much to begin with but I drifted off one too many times. Not recommended."
    },
    {
      "rating": "9",
      "text": "Great movie! Way more efficient as an entertainment piece AND as tale from the business world than any of the Steve Jobs or most other attempts on the \"genre\" of business stories (not sure this is a genre per se). Light, well-dosed drama and comedy, doesn't looses its focus, and definitely an interesting story!"
    },
    {
      "rating": "7",
      "text": "Shows the background as to how McDonalds became a world wide phenom. Excellent acting by Michael Keaton in role as Ray Kroc. A born salesman , Kroc is less than a success before he trips over the McDonald brothers. To his credit, he foresees a future with McDonalds becoming a staple in every American city and town.  His burning ambition brings success but that success destroys everything from when he started. His marriage and his relationship with the brothers . He screws the brothers legally and the rest is history . Sort of a rags to riches morality play and by the end of the film, you wind up disliking Kroc. Overall a good story"
    },
    {
      "rating": "8",
      "text": "Very good.It's the story of how a notorious fast food franchise came to be.Story progress well, Keaton works very well, splendid costumes and scenography"
    },
    {
      "rating": "10",
      "text": "So, I caught this on Netflix last weekend. I had been wanting to watch this for some time and finally I had the chance. This was such a good movie and on every level. Excellent story, excellent acting and fantastic directing. This was the \"pick-me-up\" I needed to reignite my faith in movies after watching the disappointing and expensive Valerian at the theater a few weeks back. Thank you Weinsteins for this terrific movie."
    },
    {
      "rating": "8",
      "text": "Una muy buena película biográfica, bien producida y excelentemente actuada por Keaton."
    },
    {
      "rating": "8",
      "text": "What starts out as a story of a down on his luck salesman that we emphasise with soon turns into a story about a man who sees an opportunity to succeed on a massive scale at the behest of partners and the sign of dollar signs. This movie entertained me thoroughly as it is also based on the true story of the golden Arches founders."
    },
    {
      "rating": "9",
      "text": "Outstanding Michael Keaton in the untold origin of Mc Donalds. The plot is absorbing since the early minutes without triumphalist tones. You´ll never taste the same a Big Mac. One of shall to see."
    },
    {
      "rating": "9",
      "text": "This is a Based on a True Story, so You Can't Insult the Plot. But You Can Blame the Acting, But I Can't. Micheal Keaton was Good. But You Think They Would Make the Divorce More Significant, But's It's Just There and It Focused on the Business Aspect of the Story, Which They At Least Did a Good Job with It."
    },
    {
      "rating": "8",
      "text": "What’s it about? A down-on-his-luck milkshake machine salesman (Michael Keaton) comes across a hamburger joint that’s revolutionized fast food and has an idea on how to get involved in the business in a big way. aka: The story of how an **** came to claim he was the founder of McDonald's.What did I think?I always thought Ray Kroc was the founder of good ole Mickey D's, but it turns out I was wrong… and sort of right. Ray “won” the right to call himself founder through a lot of clever ****ry and fast talking that has to be seen to be believed. Here’s hoping the “Oscar buzz” for Keaton turns out to be true, as this is a fine performance to follow his turns in other nominated films Spotlight and Birdman. For a thoroughly fascinating movie on the origins of McDonald's, the story sure left a bad taste in my mouth. So much so that I’m boycotting them… at least, until I smell someone eating a delicious cheeseburger."
    },
    {
      "rating": "10",
      "text": "This is a good movie if you ever wondered if all psychopaths look like Hannibal Lector.  The definition of a psychopath is someone who acts in their own self interest 100% of the time. Michael Keaton absolutely owns this role, he plays it with a charm and energy that captures a character no one else could play.  He is essentially correct that there is something magical about McDonalds, whether you like their food or not.  Realistically there is nothing to like about their food, but they do feed 1% of the planet on any given day, at the cost of the environment and the planet itself.  It is worth considering what in their image is so appealing that people line up all day every day for their garbage, and the genesis of the idea is captured here very well in the twinkle in Michael Keaton's eye."
    },
    {
      "rating": "8",
      "text": "Una película con una envoltura aparentemente sencilla, pero que le permite a Michael Keaton dar una actuación buenísima acerca de la ambición y los caminos que se eligen para satisfacerla."
    },
    {
      "rating": "7",
      "text": "The Founder is nothing really special, bar a great performance by Keaton, but for the majority is just above serviceable. Could've been a lot better though"
    },
    {
      "rating": "8",
      "text": "Wow. This movie is way better than it should be. Michael Keaton is at his best in this movie, playing an energetic, ruthless, do-whatever-it-takes salesperson. His character is smooth, hate-able, and extremely interesting in this movie, and really ties the film together. The other actors are all pretty good. The plot is interesting, and some of the shots are pretty good and memorable. \"The Founder\" is a really entertaining docu-drama that I highly recommend to anyone."
    },
    {
      "rating": "6",
      "text": "A good summary of the story of the McDonald's restaurants. In the end this movie ended up not being very impactful."
    },
    {
      "rating": "2",
      "text": "Bland biopic with nothing interesting to say or any interesting direction. Even Keaton can't save this one. Yawn."
    },
    {
      "rating": "7",
      "text": "A solid biopic on how Ray Kroc got the McDonald's empire up and running. The script could of been tighter and more focused, particularly around the takeover, but entertaining none the less."
    },
    {
      "rating": "9",
      "text": "The Founder (2016) is an exquisite biographical drama film based on the true story of the American businessperson- Ray Kroc, the one who started the world's most renowned fast food chain: McDonald's. With a flawless screenplay crafted by Robert Siegel and under the powerful creative director- John Lee Hancock, this movie stands out as one of its kind. The film premiered at ArcLight Hollywood earning well deserved critical acclaim that also heavily lauded Michael Keaton's authentic performance as Ray Kroc.The story wonderfully depicts the events that occur in his life that shape the course of his career ahead as he rises from a door-to-door salesman to become the owner of McDonald's. Thrown into complex situational dilemmas, Ray is compelled to take decisions that have heavy long lasting impacts both on his job and in his personal life. Unable to suppress his extraordinary ambition and passion for the business, he tirelessly chases his dream of expanding McDonald's from a small neighborhood restaurant in San Bernardino into a nation wide franchise.His dedication starts to pay-off when he is credited with enormous fame in the Mid-West and expands horizons to the East Coast. The ever growing business not only profits in millions of dollars, but also multiplies job opportunities for people manifold. Overnight, his success takes America by storm and the whole country starts to look up to him as an inspirational icon.However this hungry pursuit of his goal, takes a gradual heavy toll on his ethical self. It heartlessly tears down his relationship with his own wife and his trusting friendship with the original founder brothers of McDonald's. The new paths he voluntarily charters to expand his restaurant business even directly contradict the core humane values on which McDonald's was originally built. But none of this casts a genuine impact on his life, which has now come to be solely defined by his financial ambitions. Ray refuses to stop at anything until he fulfills his life-long dream.As the film plays to a close, Ray's sheer persistence pushes his company through several tough and uncertain years, ultimately successfully establishing itself as the world's largest food chain. This mannerism of his proved to be an asset for his huge company, but it also came at the cost of completely devastating the lives of a few others. On the outside, this easily spells out as a bright success story of hard work and persistence over fear. But it also revolves around a much darker internal theme, that we don't fully realize until the bitter-sweet ending when Ray reflects back on his life to prepare for a press interview.The amazing cinematography adopted creates a deeper effect in our minds by making us feel the revealing story beats along with the characters themselves. Also the intentional use of brighter color tones of certain scenes is done to synchronize with the iconic vibrant colors of McDonald's. Laura Dern, Nick Offerman, John Lynch, Linda Cardellini and the rest of the talented cast play out their supporting roles perfectly.This film accurately establishes Ray both as a triumphant human being and as a selfish business tycoon, leaving the rest to the audience's judgement. A definite parallelism between the lives of Ray Kroc and Mark Zuckerberg (in 2010 film Social Network) goes unnoticed. And as the end credits roll over, we are left to ponder on the price of extraordinary success and its worth."
    },
    {
      "rating": "9",
      "text": "You should absolutely check it out; after seeing it, I was tempted to go have a McDonald's. And it may be on its way as you read this review so just know your missing out."
    }
  ]
}