{
  "id": 2546,
  "title": "The Unforgivable",
  "starring": [
    "Sandra Bullock",
    "Viola Davis"
  ],
  "runtime": 112,
  "genre": [
    "Drama",
    "Crime"
  ],
  "description": "A woman is released from prison after serving a sentence for a violent crime and re-enters a society that refuses to forgive her past.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1b3dNFDuE7i05TJlXrIC571yR01.jpg",
  "categories": {
    "plot": 5.666666666666667,
    "acting": 5.8,
    "ending": 5.0625,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "It's dark. Very dark. But also touching. And it tears at your seams, wanting you to decide whether to root for one over the other, when there simply is no good answer.A couple of scenes are overacted a bit. Mostly due to the dialog / script. Other than that, it all works pretty well."
    },
    {
      "rating": "8",
      "text": "Another excellent performance by Bullock who seems to be really maturing as an actor, all the while keeping her zany comedy chops intact in installments like the upcoming Lost City. No one is saying we should forget the criminal past of others, but sometimes in rare instances, judging people without knowing all the facts make you look like a fool. This movie is a shining example of a sister’s love, to the point of incredible, unimaginable sacrifice. What she did to give her sister a clean break and fresh start in life is really humbling. I am confident Bullock has many more outstanding roles ahead of her, and I look forward to seeing her on-screen."
    },
    {
      "rating": "8",
      "text": "A very moving and sad film.  Excellent acting.  This is one of Sandra Bullock's best efforts.  You would want to be in a frame of mind to handle a story of life in its worst way to be able to appreciate this movie."
    },
    {
      "rating": "7",
      "text": "Solid Movie with Solid performance from all cast. Sandra Bullock brings a nice touch to the movie for those who remember watching her growing up. She presents herself as a strong character woman and plays the part well. Overall solid story, very entraining for a movie. 7.2/10PS Sandra looks good for her age!"
    },
    {
      "rating": "10",
      "text": "Beautiful....amazing....kept me in tears.....movies like this should be made allot...."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)The unforgivable is not as problematic as the irreparable, but right from the title the film makes the less demanding choice and limits itself to placing a few strong twists. PS: a Radiohead song usable for a piano recital, really?"
    },
    {
      "rating": "5",
      "text": "This movie is too slow. The first hour of the movie could've been told in 15 minutes."
    },
    {
      "rating": "5",
      "text": "It wasn't a very good movie, but I cried at the end 5/10 wouldn't recommend"
    },
    {
      "rating": "3",
      "text": "After watching it, I was very surprised that in several professional reviews I had already read, they said that the film was bad, but Sandra Bullock's performance was good. But they were lying. Both are actually bad.Sandra Bullock spends almost 95% of the film with the same face you can see on the poster, and she doesn't do anything else.The Unforgivable is a rather banal drama that wastes its cast and your time."
    },
    {
      "rating": "6",
      "text": "I didn't hate this. The twist was respectable and believable. I think the biggest beef I have is that they tried to pack too much in. It's a story about sacrifice, which is the main plot. It's a story about redemption, which is kind of hamstrung by some bad writing (I think to push the action, third plot). It's an revenge/crime drama as well, which is pretty weak (and has its own subplot between the brothers for reasons). Finally, it's this hamhanded felon love story, which never really takes off. Too much! If they'd stuck to the whole sacrifice/redemption story, it'd be thin, but much more doable. This could have been a solid 90 minute movie on that plot line alone, with some extras added for good measure. Lose the revenge plot. Lose the romance (or lighten it up to just friends with potential). Stick with the sacrifice/redemption main story and let the lawyers and adopted parents play a bigger role. Big plot hole; the sister is like 25 if Sandra spent 20 years in prison. Wouldn't the no contact order have some limitations? Like ending when she turned 18 and could make those decisions for herself? Surely, Sandra's character could reach out to her and let her decide? And what kind of parents hide this traumatic backstory from their daughter?Oh, Sandra looks terrible with the plastic surgery. It's distracting. I can't believe other actors are able to look at someone who's had that much surgery to where it's obvious (cat face) and not be distracted."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "6",
      "text": "This is the 2nd Netflix release starring Sandra Bullock and it gives her a chance to go deep into drama territory (sans makeup). When the film starts, she’s being released from a 20-year prison sentence for murder of a cop. The trauma that caused the calamity resulted in her being separated from her much younger sister. She determinedly sets out to reconnect, while the sons of the slain police officer are out for revenge. Since this is a star vehicle, Bullock successfully brings out her best sullen-but-strong character. Her character's quest is wrought with setbacks, but the all-around excellent performances and sensitive direction help make this an effective, but somewhat predictable drama about a woman's quest for redemption and love. [usr =3.5]"
    },
    {
      "rating": "2",
      "text": "Sitting here watching the movie. It's kinda lame. Really over the top on the melodrama, the contrivances and just stretching belief too far... A lot. A girl is present at a murder at the age of 5 and appears to have had little to no therapy as a result. It just pushes belief a little too far over and over. And the supporting character roles... A little too on the nose tropes again and again.And again."
    },
    {
      "rating": "7",
      "text": "Don't expect to crack a smile at any point in this movie. Even the lightest moments where Ruth (Bullock) and Blake (Bernthal) are starting to hit it off aren't really light enough to lift the dark pall from the proceedings. It's mostly a dark, intense, depressing ride. I had planned on watching only about 30 minutes of the film because it was late and I was planning to go to bed soon, but I was sucked into the story. That said, there were some subplots that seemed superfluous, particularly Ruth's relationship with Blake. It didn't serve to move the story forward in any meaningful way. Likewise, the subplot with Steve, Keith, and Steve's wife seemed unnecessary, though it hinted at a deeper story with those characters; it felt like a subplot that would've been fleshed out in a book.There are some implausible aspects of the story which detracted from its believability. The most glaring came after the big reveal -- which I won't spoil -- but the choice Ruth made after the Sheriff's death 20 years ago really doesn't make sense to me, and the film exists solely because of that choice. When you see the reveal, think about how the legal system works, and think about what would've been a much more reasonable choice on Ruth's part. It just wasn't necessary for her life to turn out like it did.I was distracted by Ruth's age -- or, rather, the fact that Bullock played her. Ruth says she spent half her life (20 years) in prison, so she's supposed to be 40-ish. Well, Bullock looks great for 57, but she looks *botox* great -- she does *not* look 40. The casting (or the age of her character) didn't make sense there.The acting and production values are mostly excellent. Bullock does a great job of playing someone hardened by 20 years of jail time, though her portrayal occasionally feels too constrained in certain scenes. Bernthal, who has a tendency to overact in everything he does, felt more natural in this than in most things I've seen him in. Viola Davis was superb as the lawyer's wife, but her role was disappointingly small.Despite the film's flaws (and its trite though emotional ending), it works as a mostly absorbing drama."
    },
    {
      "rating": "6",
      "text": "This movie was decent. It is a little boring and predictable until the twist. It mostly kept me entertained."
    },
    {
      "rating": "5",
      "text": "If you don't mind slow monotonous and sometimes lecturing take on redemption with many great cast members and a Sandra Bullock who looks like she just recently shaved her mustache after 48 years for the first time, you'll like this film.Sandra Bullock does her best to appear unattractive and dour for nearly 2 hours in this dark film.  And, surprisingly, it works.The film, itself, however, is a mixed bag with a powerful final reveal that nearly wipes away all the imperfections of the film with its emotional punch, despite its implausibility.  This is both a compliment and a criticism since this film is not as tight as something like The Sixth Sense, whose ending twist is legendary (and somewhat of a cliche now after numerous repetitions).  However, the script then ruins the great reveal with ANOTHER huge and poorly conceived final encounter that truly makes no sense and needed a serious rewrite.  It is obvious that the writer was trying to bring the story full circle to complete a powerful arc reminiscent of the great film Levity, but it just didn't earn it as that film does.  This is made all the more obvious by the fact that we come to the final scene, and then tack on a needless race to another location for no good literary or logical reason that completely ruins the pacing.  Why not just have her go there to begin with?  The audience already knows what is going on...To its credit, it seems as though the filmmakers tried desperately to check off an endless array of obligatory woke checkboxes without intentionally beating the audience over the head with them.  Alas, there are so many mandatory checkboxes now that such a task is impossible so the artistry and film definitely do suffer.  Unearned and transparent political jabs at the American judicial and prison and police system as well as pandering casting choices try to be subtle but are so numerous that they do break the spell of the story.  However, it isn't necessarily bad enough to ruin the movie.The movie itself has several new faces in it who perform admirably as well as several solid performances from great actors who are always dependable.  However, few of them are allowed to shine as they should if given better dialogue or purpose.  One scene near the end of the film includes a supporting character cheating with his sibling's girlfriend but gives no context for this or purpose.  It is just thrown in like an afterthought just to give the two dull characters something to do, and then never hinted at or mentioned before or afterward. This is frustrating because both actors had done a fine job portraying these two characters until this point.What was the point of throwing that in?Viola Davis, who is usually always good, has what should be a powerful epiphenal moment seemingly out of nowhere near the end of the film, though no normal person would have been able to glean what she did from the vague dialogue being given to her to induce this moment of clarity and understanding.Like I said earlier though, the reveal at the end of the film (prior to the poorly conceived final conflict) which I will not spoil is admittedly powerful and does redeem the film somewhat, even if it may seem implausible.Also, Hans Zimmer is strangely attached to this film, though very likely in name only to kick-start one of his Remote Control composers as a solo artist with a mostly bland atmospheric empty score.  This is only exemplified more by a concert pianist at a conservatory performing an inexplicable 'rendition' of Radiohead for her extremely important recital.Who writes that crap?  Is the writer or director so insecure about their art that they felt they needed to choose such a hamfisted and wholly out-of-place choice to get their message across?  Gross.  I truly felt embarrassed watching that.Anyway, if you don't mind slow monotonous and sometimes lecturing take on redemption and sacrifice with many great cast members and a Sandra Bullock who looks like she just recently shaved her mustache after 48 years, you'll like this film."
    },
    {
      "rating": "5",
      "text": "Well, it was somewhat emotional. I guess that's in some way positive, because for the most part it wasn't overdone.But I really didn't like the sister plot twist. Killed it for me. All this decently written build up of a woman who faces the hard life during the rehabilitation process after a long prison sentence and then they throw it all out of the window with this nonsense. All the subplots tied to this jump out straight behind and are canceled immediately.So now I am supposed to acknowledge it was her five-year-old sister all along who picked up the super heavy gun and shot the police officer who probably was even a friend of the family? Go away! That's unrealism galore and implemented just for the shocks and the sake of plot twist. They probably also wanted the foam at the mouth anti cop killer part of the audience to fully sympathize with Ms. \"Waxface\" Botox before the finish line by granting her some cheap purity award. Her getting betrayed and beaten up by the other fish workers and the happy action ending felt forced af too. Gave me the impression that they had been included just to get more in line with your average ever-repeating hollywood formula which the majority of people seems to prefer over thoughtful explorations of society for whatever reason.It must be one of the stupidest decisions in cinematic history to abandon your little sister like this. Instead she is now traumatized by not knowing what happened and losing her only remaining trusted person at a very young age. Without anybody telling her, she might be tortured by nightmares for her whole lifetime. Furthermore, there was quite a big risk of her ending up in a mistreating foster family.I would have liked the movie so much more if they would have sticked to the rehabilitation plot and really showed the depressing ostracization of people with a prison background. I am so tired of these forced last minute happy ends which ostensibly relativate and wave away most of what happened before. I need a filter on netflix to sift out all this dull stuff. If anything, then I get from this movie that keeping loaded guns around children is a really bad idea."
    },
    {
      "rating": "7",
      "text": "Definitely we waited long before we saw Sandra in one of those movies which requires solid acting and lots of emotions ... The movie moved me and yes put me into tears .... But still some of the scenes seem long and boring . Still it is a good movie to watch"
    },
    {
      "rating": "2",
      "text": "Complete waste of 2 hours to watch this movie where you waited for it to pick up just to be let down. Sandra Bullock is a good actress, this movie was unfortunately a dud for her."
    },
    {
      "rating": "4",
      "text": "Great Cast, Weak Plot.It's summed up pretty easily in one sentence. Sandra Bullock delivers quite a believable performance in a role that is quite unique for her. The supporting cast is also fantastic. However, the story tries to create thought provoking scenarios centered around the natural instinct to protect family at all costs, but falls quite short in that attempt. Most of the movie is just a slow grind about what life is like outside of prison after serving a sentence for a violent crime. She meets some people along the way, and a handful of them are quite lovely, others are terrible to her. Then, they just disappear from the movie, even after what seems like they'll play an important role. The subplots just kind of end...After about 1.5 hours of literally just living her new life, we get to the climax. Now, the ending is exciting, which is a nice change from the grueling, somber mood throughout. However, the big reveal comes in the form of a fairly unrealistic--or at least unreasonable--twist. We find out, that Ruth (Sandra Bullock) never committed the murder of the sheriff; in fact it was her 5 YEAR OLD SISTER!!! For some reason, Ruth decides to lie, and tell the police that Ruth killed him herself, to protect her preschool sister.  That led her to serving a 20 year prison sentence, when telling the truth probably gets her some kind of negligence charge. While her intentions were loving, it's hard to imagine how that didn't do more harm than good. Let's face it: we don't send 5 year old girls to prison...Anyways, great performances through an absolute grind for about 12 mins of excitement. Definitely not a big deal to miss this one!"
    },
    {
      "rating": "10",
      "text": "A fantastic movie directed brilliantly with innovative style and techniques.  The acting of course is SB at her best. You will discover the movie with the actors a truly unique space don't perfectly all round."
    }
  ],
  "recommendations": [
    "gone_baby_gone",
    "stillwater",
    "prisoners",
    "before_i_go_to_sleep",
    "those_who_wish_me_dead",
    "gone_girl",
    "flightplan",
    "split",
    "widows",
    "the_accountant",
    "the_little_things",
    "the_next_three_days",
    "the_curious_case_of_benjamin_button",
    "contagion",
    "uncut_gems",
    "the_loft",
    "promising_young_woman",
    "man_on_a_ledge",
    "a_history_of_violence",
    "no_escape",
    "law_abiding_citizen",
    "the_woman_in_the_window",
    "the_place_beyond_the_pines",
    "the_descendants",
    "the_voyeurs"
  ]
}