{
  "id": 44,
  "title": "The Forever Purge",
  "starring": [
    "Ana de la Reguera",
    "Tenoch Huerta Mejía"
  ],
  "runtime": 103,
  "genre": [
    "Horror",
    "Action",
    "Thriller"
  ],
  "description": "All the rules are broken as a sect of lawless marauders decides that the annual Purge does not stop at daybreak and instead should never end as they chase a group of immigrants who they want to punish because of their harsh historical past.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lB068qa6bQ0QKYKyC2xnYGvYjl7.jpg",
  "categories": {
    "plot": 4.785714285714286,
    "acting": 3.5,
    "ending": 4.125,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 0.0,
    "action": 2.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "It's like the whole movie was made to make America look racist and evil. Just a poorly made movie that's constantly painting America to be something it isn't."
    },
    {
      "rating": "0",
      "text": "I have seen all the Purge films and part of the tv series.  The magic that made the franchise intriguing left the building about 3 movies ago.  This movie is so woke that it makes stupid \"Orange Man Bad\" jokes 6 or 7 months after the man got booted from office.  Kinda makes me laugh because your adding real elements into a fictional universe when the only people who are \"purging\" right now are the far left.  This film is recommended for those who think that Lovecraft Country or the HBO Watchmen series are good continuations of the works of the original authors HP Lovecraft or Alan Moore.  It is also recommended for woketards and for communists who are so preoccupied with labeling people with acronyms that they've used atleast a 3rd of the alphabet to come up with a grievance group. (example: lgbtqia+abcdefg)"
    },
    {
      "rating": "1",
      "text": "Wow, there's actually 5 movies of this horse ****  the first one was dumb enough in suggesting this could actually happen, but 5 of these now?  I'm not sure if these are making us dumber, or the dumber we get the more we want these but it saddens me that theirs an audience for this."
    },
    {
      "rating": "0",
      "text": "More left wing BS. Sorry I spent the money to fund his kind of crap. Enough already. Theater was empty, now I know why."
    },
    {
      "rating": "0",
      "text": "Just terrible, filled to the absolute brim if you don't include the pool underneath with political bs and nothing even remotely scary of intense happening the whole movie. Just when you set in and start to think something good might happen it snaps you back to reality with some random bs. I don't even know why I bothered going back to the theater. Let Hollywood burn to the ground after drowning in their own woke garbage."
    },
    {
      "rating": "3",
      "text": "If you tolerated the other Purge films then I’m sure you’ll enjoy this one. But for those of us who prefer films to have well-shot action, coherent plots, decent acting and non-preachy narratives, this is a pass."
    },
    {
      "rating": "7",
      "text": "The film is overall average in terms of the storyline and characters. It is weighed down with some noticeable problems, mainly when it comes to cinematography and tone. But The Forever Purge is entertaining enough, and sets up its interesting premise well enough, for these problems not to bog down the film to much. It should be stated though, this film is very, very political. If you lean more to the right, you may not like The Forever Purge as much. I'd give it a watch if you have some cash to burn and want to be entertained for 90 minutes. General audiences will most likely enjoy it."
    },
    {
      "rating": "0",
      "text": "Did you wonder what bumbling Joe Biden did in his basement during the election? He wrote this movie. Did you want to watch a movie that tells you you're a racist if you love your country and refuse to allow millions of immigrants across the border unchecked? This is the one for you. On top of that it has all the woke check marks. Girls doing it for themselves, Anti-Americanism. Socialism. And real life Nazis with swastika face tattoos!! Do not watch this movie if you have an IQ over 20. All of this is on CNN."
    },
    {
      "rating": "0",
      "text": "When the woman puts the flag up to the window it sealed my score. All Logic in this movie is out the window. It has interesting themes but the film itself sucks"
    },
    {
      "rating": "5",
      "text": "The new installation in The Purge series ventures outside an urban setting and beyond a 24-hour window of violent mayhem. For those who don’t know, The Purge is one evening when all acts of violence are legal, supposedly to allow our nation to vent its frustrations. In this version, a group of Texas vigilantes determined to rid the US of all immigrants, decides to continue the bloodshed after the deadline. The plot follows an American family and some Mexican immigrants who must band together to stay alive. The expected scenes of brutality are sprinkled throughout, but lack much originality or shock. There’s too much time making statements about immigration and our nation’s periolous politics, which dilutes the movie’s impact."
    },
    {
      "rating": "4",
      "text": "La peor de la saga sin duda alguna, las otras entregas aunque con fallas y un concepto desaprovechado, eran entretenidas como mínimo, esta da pena ajena de lo mala que es, no viene al caso enumerar las falencias ya que tan solo el trailer le puso la soga en el cuello, pésima forma de concluir una franquicia."
    },
    {
      "rating": "10",
      "text": "Great fun, one of the best purge movies yet. Interesting way to talk about the political environment without going over the top too. Fun"
    },
    {
      "rating": "0",
      "text": "Hollywoods still cashing in on woke culture. All the whites are wealthy horrible human beings. The non-whites are humble amazing people. Movie just reeks of political commentary. If that’s your thing enjoy. If you’re tired of it, skip this."
    },
    {
      "rating": "2",
      "text": "When it isn't beating you over the head with its preachy and reductive politics it's underwhelming you with its lack of action or horror. Go watch the much better 2006 The Hills Have Eyes instead - 2 stars"
    },
    {
      "rating": "7",
      "text": "Forever Purge was a great movie spoke a lot on topics that are happening in our nation. The story was great, The kills were trash ;The purge has a play book and it’s all Gun shoots. A night where people can legally kill people you know someone is gonna pull some Jigsaw Trap nonsense. The movie compared to the other Purge’s this is a 10/10. The movie was well shot and the ending was great, showing that the Purge and NFFA destroyed themselves by not listening to their people and country. I sincerely hope that they don’t make another purge as this is the perfect ending for the Purge Series. The Country caused its own down fall. Simple and Poetic. Spoke alot on Poor and Rich classes which was Interesting to see how the Classes are effected during a night of Legalized Crime. Also, nice to see how Racist spend the night of the purge and then seeing said Racist get their Brain Splattered. The Forever Purge needs to be the Final Purge. They need to work on making More interesting kills for this Series. Give the Audience a sense of true Crime and how horrible Humans can be Movie gets a 7/10 Out of all the Purge Moive’s it’s a 10/10"
    },
    {
      "rating": "8",
      "text": "For my surprise, I enjoyed this movie. For me, all the parts of Purge was average but not this one. The story wasn't new, the concept was copied from The Purge series: Season 2 but execution was in the way thay you will enjoy it.Was the movie perfect? No. It had its problems but it didn't deserved so much negativity. Only giving negative reviews because movie was almost same story and policies is wrong. This franchise is meant for fun and they did bring something new.Overall, I would recommend anyone to watch this movie, especially to those who love or have watched this franchise's other movies."
    },
    {
      "rating": "6",
      "text": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection."
    },
    {
      "rating": "10",
      "text": "If you tolerated the other Purge films then I’m sure you’ll enjoy this one."
    },
    {
      "rating": "10",
      "text": "I can guess the ethnicity of those who gave this movie a low rating"
    },
    {
      "rating": "0",
      "text": "Watched it to the end to confirm.... And, yep, woke garbage. White people bad, white supremacy, blah blah blah. Disgusting woke propoganda. Guess what people? White people don't hate anyone. They want everyone to prosper cause when one prospers we all prosper.  Don't let Hollywood convince you the world is anything like this."
    },
    {
      "rating": "0",
      "text": "The worst film of the franchise. Once again taking on a commentary about social issues (this time it is immigration) without making an actual statement about them, same as they did with The First Purge, this one feels like it is trying to be too PC and it can be irritating at times, especially when the characters are so generic and stereotypical.I hated this movie and I would not recommend it at all."
    },
    {
      "rating": "5",
      "text": "This filth (and potentially) final entry into The Purge Franchise works best when it explores its racist patriotic themes that fit so well with the franchises outlandish set-up. The results here are timely and somewhat darkly accurate. \u2028Where The Forever Purge fails is when it falls back into its own strain of genre tropes, taking us through yet another round of in-cohesive monotonous carnage."
    },
    {
      "rating": "6",
      "text": "It was like the usual Purge series movies. I do enjoy them even though the premise is very silly, but also I do feel like they are just rehashing the old ideas and not bringing much new to it"
    },
    {
      "rating": "0",
      "text": "Woke garbage.90% of the white people are horrible while every minority in the movie is an amazing person.  Those horrible people trying to cleanse America are very obviously made out to be Trump supporters.  It was disgusting.I watched it to the end because I agreed to watch a movie at someone else's house and didn't want to walk out, but if I had it to do over again that is exactly what I would have done."
    },
    {
      "rating": "7",
      "text": "THE FOREVER PURGE is as exploitative as it gets and far from subtle, yet nevetheless an entertaining, violent mess. It's a step up from The First Purge, and while that isn't saying much, the writing is sharp enough to not come across as just plain offensive. The political/race/classism themes the franchise has going are dialed up to 20 here, and while there are a few viscerally eerie scenes, they still don't hit the mark perfectly. A good, not great Purge film that ranks somewhere behind the first two."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)Behind the idea of the New Founding Fathers for an annual purge of US bellicosity there would be the Second Amendment to the Constitution ratified in 1791 during the first presidency, that of Washington, when the project of the Pilgrim Fathers was still in its infancy and the defense of the private property could not be delegated to public law enforcement agencies but to individual citizens. The saga invented by DeMonaco barely touches on such historical legacy and consequently its political criticism is nothing short of feeble. The same should be remarked of the shift from the \"home invasion\" to the xenophobic isolationism of this 5th chapter, useful just to show the stereotypes and the skill of make-up artists and stuntmen."
    },
    {
      "rating": "0",
      "text": "This movie is racist the entire movie does not have a black female the entire move has one black male saving a Mexican female and goes off to die! Racist Mexican and white movie"
    },
    {
      "rating": "2",
      "text": "Absolutely pointless, lackluster plot, if any. Actors are ok, but basically, this movie consists only of stupid shooting scenes.  Since the subject is a philosophical one, the producers could have made the movie a lot more interesting."
    },
    {
      "rating": "5",
      "text": "What me really went crazy was the verdict, that if a country could get this **** crazy in real life is in fact america. People got the weapons at their houses and the average IQ seems from an european view pretty low. Well as the 4th movie in this 'series' the time came where it can't progress in quality and its more or less the same as you have already seen 3 times. This time there was a try to focus on racism."
    },
    {
      "rating": "3",
      "text": "The Forever Purge is the most boring of the series, even a little worse than 1 and 4, only enthusiastic fans will enjoy it. None of the movies (including this one) I liked or seemed good to me. At least it's over."
    },
    {
      "rating": "4",
      "text": "People be purging after the purge is finish but now, it seems that all the purging is aimed at Mexican immigrants for some reason."
    },
    {
      "rating": "0",
      "text": "worst movie everrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr"
    },
    {
      "rating": "0",
      "text": "ew grosssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssssss"
    },
    {
      "rating": "9",
      "text": "This movie is a must watch, it has all of the things that a purge movie needs, blood, violence, and a few new ways of killing people. Great movie"
    },
    {
      "rating": "6",
      "text": "In line with the other films in the saga. the political sub-text is more developed even if sometimes in a superficial way while the characters are kinda anonymous. Clear directing, not exceptional but in some places tries to be engaging even succeeding. The story is more of the same with some new ideas to make it interesting and in the end is not repetitive."
    },
    {
      "rating": "4",
      "text": "Boring. That sums up pretty much the whole movie. The first three movies were so cool and well explained, you could see that they put real effort into them. Now, since THE FIRST PURGE, it's basically the same boring experience. The only nice thing about this was the purge being extended after the twelve hours. Still, wasn't able to carry the movie into a great spot -  most characters were expressionles. Sad to see a great horror franchise going donwhill, especially on the last movie."
    },
    {
      "rating": "4",
      "text": "The Forever Purge: Spoilers ahead even though honestly your not missing much. What a disappointment. Ok before I go negative crazy I do want to say there are positives to the movie like the actors they did a good job, I thought the movie was well shot and some action scenes looked good. Now I just have to say that this movie didn’t really need to exist, Election Year left off on a great note the cancellation of the Purge but from the very start they Purge is suddenly back, first off where did Leo Barns go. This is a sequel to Election Year where it ended with Charlie Roan won the presidential election and she ended the Purge so what happened to her, never explained. But that’s besides the point I just don’t really like it, one big reason is the lack of violence, there is no blood at all. Well barely the others for as much CG blood they use it’s still blood, this movie barely has any except for a few moments. Speaking of shotty CGI the explosions look straight out of a PS2 game. One in particular looked AWFUL, but the ending is so bad I don’t know what to feel because the last 45 minutes have the main characters have to cross the Mexico border to escape the US but at the end it says “Everyday Americans are picking up guns and killing the Purgers” WHY. Overall this movie has some highs but has very low lows. Ranking. Ok. Yes that the rank it’s like the first Resident Evil movie if nothing else is on sure I’ll watch it."
    },
    {
      "rating": "0",
      "text": "This movie really sucked… So much in fact that I just had to write a review. I watched it for free and I still feel ripped off! It’s just race baiting propaganda… and a really bad story too."
    }
  ]
}