{
  "id": 4260,
  "title": "The Last House on the Left",
  "starring": [
    "Sara Paxton",
    "Tony Goldwyn"
  ],
  "runtime": 110,
  "genre": [
    "Crime",
    "Thriller",
    "Horror",
    "Drama"
  ],
  "description": "A group of teenage girls heading into the city hook up with a gang of drug-addled ne'er-do-wells and are brutally murdered. The killers find their way to the home of one of their victim's parents, where both father and mother exact a horrible revenge.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2Y35XCUS8U8vC8vs0HDEVkPu1BM.jpg",
  "categories": {
    "plot": 5.894736842105263,
    "acting": 5.875,
    "ending": 5.714285714285714,
    "soundtrack": 5.0,
    "cinematography": 8.0,
    "familyFriendly": 3.0,
    "funny": 3.0,
    "action": 9.2
  },
  "reviews": [
    {
      "rating": "8",
      "text": "It was a very interesting movie with awesome acting and a great plot. Though lacking a little atmosphere and suspense, i'd say it's a good movie overall."
    },
    {
      "rating": "1",
      "text": "This was one of those movies that just plain didn't deliver. You know, the type where the characters are just plain irritating. Build up build up and then nothing. The stupidity of the girls that got them into trouble in the first place and the seemingly helplessness of the parents when dealing with the rapists crew. The whole damn movie was a waste of time. Right up there with Ishtar in my book. Best part of the movie was the revenge dished out at the end, pardon the pun."
    },
    {
      "rating": "0",
      "text": "An unworthy piece of garbage, what happened to the 1970s' and 1980s' type of horror films. Sure today's technology is better, that's great, but we don't need to go overboard with it. I hope everyone can see where I'm coming from here. This film is very bad and terrible in everyway possible. It's crap compared to Wes Craven's original horror film made back in (1972). If I was on the MPAA ratings board I would've  rated them opposite of each other. The 1972 film gets an R rating and the 2009 remake gets an NC-17. I see no reason why the 1972 film should be given an X rating. I think it definitely deserves an R, but not an X rating, I think the ratings board had bad judgment there. I think now that the film's on DVD and Blu-ray they should re-submit it to the MPAA so they can have another look at it. They should re-release it either in theaters one more time or straight to DVD, so the public and movie-goers can see why they got the rating for this film wrong in the first place. This film has terrible acting, bad scripted dialogue and the special effects are way overboard. I think this film plus the Saw films and the Hostel films should all be given an NC-17 rating. I'm on the fence with Halloween (2007) though. I think that one should stay rated: R. But I do think that the (2009) sequel should be slapped with an NC-17. The violence is more brutal and bloody than the remake. All in all The remake of The Last House On The Left is just pure torture and predictable, everyone should avoid buying this movie at all costs, and someone should contact the MPAA and get this movie re-rated."
    },
    {
      "rating": "9",
      "text": "I was on the edge of my seat with this one. I loved it!"
    },
    {
      "rating": "0",
      "text": "This was the worst movie i have ever seen. it was nasty and disgusting, anyone who would buy this movie is seriously sick in the head. and anyone who is sick enough to write and direct something like this should be put in a mental home. it was horrible. if i could i would give it a negative million."
    },
    {
      "rating": "3",
      "text": "Why cant we just have great horror movies anymore without complicating everything. I get it was more of a thriller, but Craven at least had me wondering!"
    },
    {
      "rating": "10",
      "text": "I don't understand why this score is so low. I thought LHOTL was a great movie, superior to all modern horror flicks. It was the most intense movie, and it was beautifully shot. See it!!!"
    },
    {
      "rating": "8",
      "text": "I liked it. The shock horror genre gets a bad rep from stupid sequels like Saw 2-5 and Hostel 2. It still ranks way higher than crap like G.I. Hoe and the Gayformers. Remakes of awsome classics can only get better with modern camera quality and the looser restrictions on gore and violence. Not only that but what guy doesn't like a good boob shot every couple of minutes?"
    },
    {
      "rating": "9",
      "text": "This movie was pretty good. But it also was pretty messed up. If your queezy I would not recommend This movie for you. Little kids should defenitly not watch it either!"
    },
    {
      "rating": "3",
      "text": "There's no virgin spring, but this remake of a remake has a virgin swimming pool, and a virgin lake. [***SPOILER***] This teenaged swimmer must have one hell of a regimen to survive what she survived. Mari(Sara Paxton) is raped, shot at, and crawls home in the rain with a bullet lodged in her body. For all intents and purposes, Mari needs to stay dead, in lieu of what happens to Mari's attackers. What Mari's parents do to the rapist and his colleagues violates the spirit of the maxim \"an eye for an eye, a tooth for a tooth\". By keeping Mari alive, the parents' vengeance is robbed of its righteousness and purpose; by keeping Mari alive, the parents end up looking like sadists. Since \"The Last House on the Left\" lacks the good sense to keep the logic of the Wes Craven original intact, why not break the mold irreparably and let Mari be more pro-active; why not let the girl go after her own attackers? Not only because she was brutally raped, but also because she has to share her victimhood with a guy. Competing for the audience's sympathy, this reboot has a hireling, the rapist's son, whose suffering is concentrated over a longer period of time than Mari, so therefore becomes the real subject of the film. When will the cowering son face finally up to his intemperate father? \"The Last House on the Left\" wants to have it both ways: to be an exploitation movie with a happy ending like some studio flick. Within the film's outward appearance of graphic violence, drug use, and sexual deviancy, beats a tame PG-13 heart."
    },
    {
      "rating": "1",
      "text": "Mostly reprehensible, although you have to give some credit for the object lesson to young females"
    },
    {
      "rating": "10",
      "text": "Not as good as the original but still effective."
    },
    {
      "rating": "0",
      "text": "For being a horror movie this movie has no suspense, fright, terror, or climax. Just graphic rape scene and over the top violence. Human mutilation is not scary."
    },
    {
      "rating": "6",
      "text": "Far more graphic than was necessary, but it's a compelling story and the acting is better than average. The pacing is relentlessly quick. Very suspenseful, good score. It is unlikely to bore the viewer."
    },
    {
      "rating": "7",
      "text": "I was rather pleased after seeing this remake for the first time; it was a decent movie with some great performances from a believable cast, a great soundtrack from John Murphy (who also wrote the score for one of my favourite films, 28 Days Later), and it stayed pretty accurate to the source material. Everybody should already be familiar with the plot of The Last House on the Left. The original is a horror classic, and a must-see, although its sheer explicit nature means it didn't become available uncut in the UK until last year. The remake is nowhere near as explicit in either the violence or the rape sequence; the latter was extraordinarily disgusting, but I admire the filmmakers for making it so. Too often do we see some pretty dumb girl raped in the woods and somebody in the cinema will shout \"dumb bitch had it coming!\" Nothing like this happened with The Last House on the Left. Like I said, a very believable cast managed to make the audience connect with the characters in a sympathetic way. As for the plot, yes, some things have changed (apart from the names, I mean.) Some characters that live died in the original, and vice versa. Give the new director some creative license, people! This is HIS movie, not Wes Craven's. Give the director a chance to experiment with what is his to make. Additionally, a comment to Golder, who walked out of the cinema once the rape scene commenced: if you were so excited to see this because it was \"Wes Cracen producing (or shadowing) what was his original creation back in the 1970's\", then you should have already been aware that Wes Craven's original 1972 Last House on the Left contained an even more explicit rape scene, and that the classification information for the film warns that there is a scene of rape. If it's something that offends you so much, look it up first. A decent film, strong acting, good direction... I give it a 7."
    },
    {
      "rating": "2",
      "text": "This movie is just sickening. The acting overall is pretty strong but the whole thing is juss like torture porn minus the scares. I would suggest skipping this."
    },
    {
      "rating": "5",
      "text": "I think the story line was great. But, the way they went about the whole thing was wrong. It started off slow and the rape scene was just horrible. Couldn't they have made it obvious she was being raped without being so graphic about it. I do have to say I got more into it after Mari showed up on the porch though."
    },
    {
      "rating": "10",
      "text": "This movie is absolutely the most intense and brutal thing Ive ever seen. At the same time it is entirely believable. Its not really a horror movie but a really intense drama. The acting was prefect, every actor just displayed crazy depth of emotion. Although if you cant tolerate serious rape/death scenes then this isn't the movie for you."
    },
    {
      "rating": "1",
      "text": "Biggest disservice to humanity... wow, what has happened to film making? outrageous. Movie shows how callous we have become as a species. I am deeply ashamed to be to be part of the human race. Violence and sex and descpicable hatred towards women is not my idea of a good film. Only the most utter idiot with a negative IQ, and personality disorder of a sociopath would actually enjoy this."
    },
    {
      "rating": "10",
      "text": "I found the remake to be within the same principle to the original cult classic. The acting was great, the direction was superior, the cinematography was on point and the score complemented the tension and eerieness of the whole film."
    },
    {
      "rating": "3",
      "text": "Anyone who saw the 1972 original will be utterly disappointed with this streamlined and unimaginative remake. The acting was much better and the editing smooth but the changes to the storyline, the new methods of disposing of the rapists and the \"perfect ending\" took away from what made the original so thought provoking and haunting. Gone are the elements of torture and rape that made the first Wes Craven effort so jarring. Also gone is the documentary style filming that made the original seem even more real. I was greatly disappointed considering the quality of actors, the budget and the experience Wes Craven has gained in 37 years. A total waste of time and money!"
    },
    {
      "rating": "0",
      "text": "For human flies - like those critics and movie magazine journalists who enthusiastically remember \"highlights\" of John Waters movies."
    },
    {
      "rating": "2",
      "text": "As a pre-warning, this review is a little shorter than it really should be, for reasons you'll come to understand, typically, shortly. When I saw this being advertised I was hoping to find a well managed movie due to Wes Cracen producing (or shadowing) what was his original creation back in the 1970's. The film begins alright as much films usually do, introducing the basis of the film and it's main characters in timely fashion. The music isn't bad, it seems to suit the film very well even though it appears to be more melodramatic than needs to be at the start, we can let that slip though. The acting seems pretty natural, I was surprised at how the younger actors didn't over emphasise every panicked line with arms flailing all over the place. They seemed cold, frightened and eerily still, frozen to the spot. I havn't got much more to compliment this film on, as I said before, due to the fact that I stopped watching the film soon after sitting myself in the cinema. If i'd know there was going to be a rape scene in the movie I'd never have gone to see it. I think that fact should be highlighted, in text, during theatrical trailors for films that contain such filth. I had to get out of my chair when this started to unfold and ask for my money back, which I got. Needles to say I think I'll be double checking next time I see a horror movie. A 2 for the efforts that I saw until the let down."
    },
    {
      "rating": "5",
      "text": "I guess this film was supposed to be shocking. It wasn't. It was another uninspired Hollywood remake of an old horror movie. It's so maddeningly bland, so predictable, that watching it was almost a chore."
    },
    {
      "rating": "0",
      "text": "I feel sick, I suppose Wes Craven would say mission accomplished. How can someone create such a horribly graphic rape scene, very twisted."
    },
    {
      "rating": "8",
      "text": "Good Movie, great actors. very intense, not too scary more of an action packed suspense. HOWEVER I watched this last night, and still feel sick about the rape scene. Very detailed, and WAY too long, My fiance and I watched this, and we both felt the same regarding that scene. If you get past that, it is a great movie."
    },
    {
      "rating": "6",
      "text": "This movie was kind of out of left field to me. As somebody who never saw the original I was excepting this to be like \"The Strangers\" with Liv Tyler. This movie was nothing like that though. This movie is very in your face with a lot of horrible imagery. Everything from a girl being stabbed in the stomach to an outright rape. The movie does a great job of building the characters and the acting is solid with the exception of Paige (Martha McIsaac) and Sadie (Riki Lindhome). The thing that actually bothered me the most was the very last scene. The move had a very solid ending and it fades to black only to come back on a microwave and the villain. I'm not here to spoil it to you but it was one of the only useless moments that was only in the movie to pad running time and add gore. Overall this movie is pretty solid and well worth a watch."
    },
    {
      "rating": "8",
      "text": "I really liked this movie. I know that the original is a cult classic, but I could never sit through the first half hour. For those that cannot stomach the original, this is a good alternate. Casting, plot, and set are well done."
    },
    {
      "rating": "5",
      "text": "This film surprised me in the fact that I wasn't bored by it. Still it wasn't the best thriller/horror remake I have ever seen but it is no where near the bottom either. The tension built through the film really well."
    },
    {
      "rating": "6",
      "text": "Una película con una trama interesante sobre 2 chicas que son secuestradas en el bosque y deberán pedir ayuda a sus parientes más cercanos donde cobrarán venganza.La actuación es muy buena, tanto de la protagonista como de los padres. Las escenas de acción están muy bien logradas (como la parte de secuestro y violación en el bosque, mismo con la venganza). El guión está bien y nos mantendrá enganchado durante toda la película.Calificación: 6. Aprobado."
    },
    {
      "rating": "7",
      "text": "I haven't seen the original one but The last house on the left was not such a bad film. It had a good plot and the actors were good. It had suspense and violence. It was not like a good classic thriller but it was much better than other horror films these days."
    },
    {
      "rating": "7",
      "text": "An effective home invasion film which in my opinion is better than the first. However the content is brutal, sadistic, and at times difficult to watch. Iliadis really does create a heart pounding thriller worthy of being watched."
    },
    {
      "rating": "8",
      "text": "The movie was actually pretty good.The acting was okay,the movie was entertaining and there was some blood.The movie was probably censored because the rape scene was not really believable and the deaths were kind of lame except for the first bad guy.The atmosphere was not good enough to really affect the movie.And the way the movie is made, you won't like any characters so you won't really care who dies at the end. Overall a pretty good movie but it could've been so much better."
    },
    {
      "rating": "5",
      "text": "Last House on the Left: 5 out of 10: Close but no cigar. Honestly anyone who remembers 1972’s shocking version of the Virgin Spring had to know this remake would pull back the reigns. It would be like a remake of “I Spit on your Grave”... just not likely in these conservative and commercial times. Well at least they did not make it PG-13.\r They screw up they remake early with two changes. The bad guys are bad guys from the start. There is no connection with the audience. No sense that they are travelling down a path as well; they do not connect with the audience as the hippies of the first film did. There is no sense that they are exploring there boundaries or challenging themselves. They start fully formed as black hats.\r The second mistake is moving the story out of a regular middle class neighborhood and into a millionaires’ nature retreat. There is something shocking about violence among the shag carpeting and wood paneling of suburbia (The original movie was from 1972 after all) that is lost with the large Architectural Digest house perfectly clean and decorated. (Though with the filmiest wooden furniture this side of a thirties Western).\r The rape is much less graphic than the original and the sense of sadism and intimacy of the first film is lost. On the plus side, Tony Goldwyn and Monica Potter give great performances as the parents and the revenge scenes are not completely without a sense of fun.\r If this film was called something else, I might have gone easier on it. As a Last House on the Left film, it is a glossy shadow of its predecessor."
    },
    {
      "rating": "6",
      "text": "After a failed attempt at sitting through the original version - due to boredom, abysmal acting and overwhelming 70s camp - I approached this one with fairly low hopes. And for the first half, it seemed to confirm my fears. The script seemed shoddy and pointless, and the characters were so unrealistic it began to annoy me. But just as I was about to turn this one off too, Mari shows up at the house. And things take an eventful and scary turn. The second half of the film is well paced, well acted and very tense. On the whole, I'm glad I watched it - it's certainly a better class of horror remake. The cinematography is atmospheric, John Murphy's soundtrack is very good and only occasionally intrusive, and it knocks the original film out of the water. But with all that said, Aaron Paul's promising career may stand more of a chance if he quietly leaves this one off his showreel."
    },
    {
      "rating": "7",
      "text": "I watched this film without watching the original film. Just another remake based on a 1970's classic. I'd watch the first one before watching this adaptation."
    },
    {
      "rating": "8",
      "text": "I haven't seen this in a couple years, so my memory of it was a little fuzzy. Now I know that it was far better than I expected. A huge improvement to the original was a consistently dark atmosphere. In Wes Craven's version, it felt silly at times, namely the scenes with the cops and the whole \"Willow\" stuff. This remake was also a lot more intense and suspenseful, and the danger felt a lot more real. The ending may somewhat blunt the movie's overall effect, but, hey, how often do you get that sort of ending in a horror movie? The rape scene was very difficult to sit through because it was so long and realistic, which is my only real complaint. If you had to choose to watch the original or the remake, I would go with the remake because it's a lot more thrilling, and it's far superior to Wes Craven's version overall."
    },
    {
      "rating": "6",
      "text": "This movie is a remake of another movie, older and forgotten. The story revolves around three sadistic criminals who kill mercilessly and who decide to hide in a quiet middle-aged couple's vacation home, hours after they raped and tried to kill their daughter. The story is really good and the environment is tense from start to finish. The rape scene is one of the hardest to watch I've ever seen. However, from the middle, the film loses some interest because it becomes predictable and similar to other horror films like \"You're Next\", for example. What saves the film, at that moment, is the sympathy that we have already felt for the couple and their daughter. This connection allows the public's attention not to be scattered because we still want to see the bad guys punished. Garret Dillahunt is incredible in the role of the gang boss, managing to make his character an unbearably disgusting presence. Riki Lindhome and Aaron Paul were more restrained but no less competent. Sara Paxton was reasonable, but her role gradually becomes secondary, giving way to Tony Goldwyn and Monica Potter, a good duo who really did a great job. In the end, what we have is a good remake that, while not surprising, is able to entertain and cause some shivers."
    },
    {
      "rating": "6",
      "text": "The Last House on the Left (2009) remake is better than original. The execution better than rhe original and the plot was also improved. Movie was 25 minutes longer than the original and they used this time to show the story which wasn't shown in original. I think they took correct decision to include these scenes but 25 minutes could have been shortened to 10 minutes. Also, the torture scenes felt rushed.The performances by the girls was not upto the mark but the roles of villains were performed better. I also loved that they changed the ending instead of nonsense ending original had.Overall, this remake was improvement over original but don't think this one was excellent. It was average movie which you should watch instead of the original one."
    },
    {
      "rating": "10",
      "text": "Better than the original in my opinion. Brutal, suspenseful and graphic. Worth watching"
    }
  ],
  "recommendations": [
    "hostel_part_ii",
    "the_hills_have_eyes",
    "insidious_chapter_2",
    "the_grudge_2",
    "annabelle",
    "the_possession",
    "malignant",
    "dark_skies",
    "saw",
    "saw_iii",
    "vacancy",
    "the_strangers_prey_at_night",
    "sinister_2",
    "the_grudge",
    "the_amityville_horror",
    "poltergeist",
    "chernobyl_diaries",
    "the_curse_of_la_llorona",
    "the_eye",
    "final_destination_2",
    "the_ring",
    "shut_in",
    "house_at_the_end_of_the_street",
    "insidious",
    "final_destination"
  ]
}