{
  "id": 3838,
  "title": "The Spy Who Loved Me",
  "starring": [
    "Roger Moore",
    "Barbara Bach"
  ],
  "runtime": 125,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "Russian and British submarines with nuclear missiles on board both vanish from sight without a trace. England and Russia both blame each other as James Bond tries to solve the riddle of the disappearing ships. But the KGB also has an agent on the case.",
  "releaseYear": "1977",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3ZxHKFxMYvAko680DsRgAZKWcLi.jpg",
  "categories": {
    "plot": 7.111111111111111,
    "acting": 6.071428571428571,
    "ending": 7.5,
    "soundtrack": 8.333333333333334,
    "cinematography": 5.5,
    "familyFriendly": 6.0,
    "funny": 6.0,
    "action": 7.2
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Let's turn down the mushy-gushy romance a notch, it is a marathon of Moore era where this is the only piece of chocolate you are going to get addicted to.The Spy Who Loved MeGilbert is back, after a while now. And with a promising premise and a polished version, he recreates the spark and puts the franchise back on the map with a hope that the magic isn't vanished yet and they still have few impressive tricks under the sleeve. And even though the structure of the script and the concept itself seems derivative, the tiny moments that it thrives upon gives little wins to us and to those characters that keeps us engaged in this familiar exotic vacation. Cornered in vigorously by the previous chapters, Lewis Gilbert, the director, has decided to embrace all the ingredients that made these characters so magnetic.Hence, a quick tour in Q's lab, that makes the audience gasp and the fan boys to drool over something. This is more of a repaired version of the previous ones. And simplifying this formula made it so entertaining, all they had to do was not repeat the same mistakes they have been doing and the result is well, not satisfying but at least qualifying. The Bond girl gets a chunk of role to portray or should I say Roger Moore, the Bond, gets to support the lead actress.Walking parallel-y with the Moore, Barbara Bach isn't completely social with the audience but has surely pulled off a remarkable persona on screen that dares trick, James Bond himself- that's going to catch up! Speaking of whom, with a more convincing dialogue delivery, Moore's humor is palpable and smooth compared to the previous installments. He still lacks the- if I may- sexiness that the character demands, but I would presume that's what the gadgets are for and not-so-likeable antagonist to contrast out the color and infuse an incredible love track between him and Bond, that is much more romantic than girl who reminisces, \"The Spy Who Loved Me\" gazing into the abyss."
    },
    {
      "rating": "7",
      "text": "All in all, this is an excellent example of a Bond film and could easily be considered one of the top in the series. As with any of the Bond films there is a certain suspension of disbelief required but this one makes it pretty easy to do. http://latetothegame.blog/2019/03/07/key-movies-of-my-life-james-bond-edition-the-spy-who-loved-me-1977"
    },
    {
      "rating": "0",
      "text": "The movie focuses more on romance than telling a compelling plot. The villain is instantly forgettable and the third act drags on terribly slow, which seems to be a common issue in a few Bond films, especially with Moore. I honestly can not recommend this one at all, It simply isn't worth watching."
    },
    {
      "rating": "6",
      "text": "The Spy Who Loved Me was the third James Bond flick starring Roger Moore as the iconic MI6 spy 007 and is named after Ian Fleming's 1962 novel.  The storyline involves a reclusive megalomaniac named Karl Stromberg, who plans to destroy the world with nuclear missiles and create a new civilization under the sea (which is sort of similar to Lex Luthor's plot in the original 1978 Superman). Bond teams up with a Soviet agent, Anya Amasova, or XXX, to stop the plans, all while being hunted by Stromberg’s powerful henchman, Jaws who is about 7 feet tall and possesses metallic teeth that can cut through steel. The movie has its fair share of action and chase scenes and some explosions, but also is stymied by tedious scenes that don't do much to move the plot along and some cheesy one-liners and gimmicks. There were also some cringeworthy dated politically incorrect aspects of the movie regarding Bond's interactions with the opposite sex which shouldn't be surprising. Overall it was decent, but not the greatest Bond film. It does feature one of my favorite Bond adversaries, Jaws, though."
    },
    {
      "rating": "8",
      "text": "Somehow this one is better then the last 2 James Bond with Roger Moore. Technically it is much better, but also the story and the plot are a bit better. Only the villain was not interesting, because many things were not explained."
    },
    {
      "rating": "5",
      "text": "Having watched 25 Bonds from Dr.No to Skyfall, I place this one at 15/25.It's the first movie in the franchise that I consider to actually be worth watching, which is not saying much. I'll be honest and say that The Spy Who Loved Me is extremely on the edge of my personal cutoff point between \"rather good\" and \"rather bad\".In a one sentence review, it's an entirely mediocre movie with few to no real good elements and few real weaknesses, particularly its main villain and its main romance plot point.In length, Moore started off on a terrible foot. Playing a prancing, smiling, ever-cheeky aristocrat that didn't at all felt like an agent in danger, his first outing was one of the worst films in the series. In its sequel, Man with the Golden Gun, EON tried to reverse the awful results of the first one by making it one of the darkest and most vicious movies, forcing him into a much more serious Bond.The Spy Who Loved Me is the first Moore where his footing was neither his old role, neither a fabrication. It's the first time where the shoes of Connery have been replaced, fully, by Moore's new shoes. The first \"proper\" Moore Bond, with its brand of comedy, lightheartedness, and somewhat cheap wit.Beyond even the last 2 movies, Bond had been more or less in crisis since 10 years. The last \"proper\" movie with an actor that did the part harkens back to You Only Live Twice, a decade prior. Amateur actors, unwanted jobs by Connery (Diamonds are Forever) and a very ill-fitting Moore were all we had from 1967 to 1977.In this regard, Spy is an important movie in the history of James Bond, as it finally completes an extremely long and painful transition of styles, actors, and eras.However, that is the most important, and only thing that is purely positive to say.The Spy Who Loved Me is an utterly mediocre movie. Its villain has a plan that is just as nonsensical, thoughtless, and pointless, as it is ridiculous. Bond always had those grandiose villains with absurd beliefs, but here it's not absurd in grandiose, it's just absurd in how empty it is. Sadly, the actor had real presence, but his lines and actions sound so false, his character falls apart entirely. His death is also absolutely ridiculous and poorly filmed.Besides having a foe with the impact of a paper plane, this movie relies on a romance between Bond and a Soviet agent. The problems with that are everywhere:- Chemistry is completely absent, they just do not have any kind of credibility- Personality is also absent, they just smile to each other a lot, it feels like a bad romance crammed in a terribly written action movie, it's Star Wars 2 tier- The plot of the romance is shooting itself in the foot with a rocket:At the intro sequence, Bond kills someone. We later learn that man to be the lover of the Soviet agent. Bond and Soviet girl meet, and start their very fake romance. Sometime during the movie, she learns that he was her boyfriend's killer, and we get to see poor Moore try to act like a murderer that only does it for duty (about as credible as a teletubby teaching a seduction class). She swears that when the mission is done, she'll kill him in revenge.At the end of the mission, Bond goes to save Soviet girl from the villain, without a real reason, since the villain's ploy has been foiled, so he's literally saving the enemy that swore to kill him, but I guess he's being noble.After he saves her, she pulls a gun on him. He then...offers champagne with a typical (bad) Bond witticism. She kisses him and murdering her lover is all forgiven I guess.Now if the romance wasn't so poorly portrayed, or written, or anything, maybe this could have been an interesting plot.But starting off with a giant revenge, and with two actors that couldn't make a credible romance, bad lines, bad wits, and a generally very weak story and chemistry...it's an outright disaster. The Spy Who Loved Me relies on this romance for about 40% of its plot and story, and it is really, really poor.The movie gets a pass for being a typical Moore, with the amusing addition of Richard Kiel as the memorable Jaws, who returned in Moonraker and had a better job there. It's a generally fun and alright Moore movie, but it is in my opinion the first and weakest of his good ones."
    },
    {
      "rating": "10",
      "text": "The tenth James Bond movie and many say it is the best of the Roger Moore era. While I do not agree completely it has a lot of great moments atop of an enjoyable story and one of my favorite villains with jaws. Most remarkable is that there is a female character who is not a damsel in distress, clumsy or plot device like so many characters in the franchise. After one of the most rememberable intros in the franchise that ends with one of the best James Bond moments the actual story starts. A British and a Soviet submarine vanish without traces and the USA and Soviets are suspicious of each other. A harsh conflict seems unavoidable if nothing is done. James Bond is send to investigate these incidents together with top Soviet spy Anya Amasova after both agency's negotiate a truce. The story is interesting and well written for the franchise standards. I see why many say it is the best script of the era and I will not disagree. It has the action, mystery and a great climax. Then there are the actors. Roger Moore delivers as he has become the James Bond version we like and cherish (I will again not participate in the Sean Connery or Roger Moore topic). With Barbara Bach as Anya Amasova (code name Triple X) we got a competent, dangerous and intelligent female spy. The portrait of women was not praiseworthy in the early franchise so I was impressed and thought it was a good decision. Then we get to the antagonist. I am in the minority here that likes Curt Jurgens as Karl Stromberg. He is not in my top villains list but I think he delivers. Jaws however is one of my favorite characters in the franchise and even outside of it. Richard Kiel was just amazing as his character becomes a fan favorite and I even think a spin off would have worked. He is intimidating, a force to be recognized as has an engaging smile;-). Also this is maybe the James Bond movie with the most gadgets and Q is just marvelous as are the bad guys manufactures. The sets look also pretty good for this time and there is a rumor that Stanley Kubrick was involved. The soundtrack is however a bit weak. Nobody does it better is my least favorite title song of the franchise. Overall this is an enjoyable Roger Moore James Bond movie. It has all you expect and want and I recommended it for fans. I give a bonus point for Jaws to get a 10/10 rating."
    },
    {
      "rating": "8",
      "text": "The spy who loved me. That's right, this is the bond film that I really wanted to watch a million times but I can,t because [sighs] It's just so corny. When I first listen to the theme song ''Nobody does it better'' I was just thinking that Pierce Brosnan would do the role as James Bond, but it's not, It,s Roger Moore. But when watch it all the way through, I still finding those scenes that are not suppose to be a comedy because I'm just finding it sooo cheesy. Well, I guess this is the only bond film that I was going to get. I still liked it you know, so I guess this is the only movie people enjoyed. I liked the theme song by Carly Simon and I liked the movie, I just think it's a classic."
    },
    {
      "rating": "8",
      "text": "After two mediocre debut entries (Live and Let Die, The Man With The Golden Gun), TSWLM is where the Moore 007 tenure finally found it’s footing.Features the iconic Lotus Esprit that changes into a submarine, the fantastic pre-title sequence in which Bond skies off a cliff (done for real) and arguably Bond’s most famous 7’2” henchman with metal teeth…Jaws.The movie also benefits from great set designs (Ex. Stromberg’s supertanker) provided by Ken Adams, whose work on the Connery and Moore films defined the 007 aesthetic.I also would argue that the theme song \"Nobody Does It Better\" performed by Carly Simon is the absolute best of the franchise. TSWLM remains not only the best of the Moore Bond films but one of the best in the franchise in general."
    },
    {
      "rating": "7",
      "text": "Directed by Lewis Gilbert, and produced by Albert Broccoli (Harry Saltzman left the franchise after the collapse of their personal finances), has script Richard Maibaum and Christopher Wood and is the tenth film in the franchise.In this film, James Bond investigates the disappearance of American and Soviet submarines, a situation that is generating a great discomfort in the already strained relations between the two nuclear powers. In Egypt, after several setbacks, the secret services of both sides decide to join forces and Bond ends up collaborating without trust with Amasova Anya, the Soviet agent Triple X. The tracks drag the unlikely duo to Sardinia in order to investigate Stromberg, an industrial mysterious, passionate about the sea, living in a kind of underwater station in the middle of the Mediterranean Sea.Regarded by many as one of the best achieved movies during the Roger Moore as 007, he received a script that is completely different from the original book Fleming and gives the film so many similarities to \"You Only Live Twice\" and \"Thunderball\" that comes to be confused with them. Again, this film back to pick up the American and Soviet rivalry, still very current and already quite focused on previous films in the franchise. However, this time, and the style of \"détente\", both countries are aware that something is happening and want to avoid open war. And it's funny to see the distrustful relationship that arises between Bond and Amasova in which both seek to be one step ahead of rivals. One of the iconic scenes of the film is the sequence filmed in Luxor, where both seek to steal a microfilm and defeat Jaws for then if they steal and fight each other for the prize. Machines and inventions are also part of this film, with an amazing amphibious car and a hollow tanker, capable of containing inside an authentic naval base. A positive note also for the opening credits, with the song \"Nobody Does It Better\" sung by Carly Simon.In this film, apart from central casting inherited from the previous films, Barbara Bach gave life to the bond-girl Anya Amasova, Caroline Munro played Naomi, Curd Jürgens was the villain, Stromberg, Walter Gotell played the Russian General Gogol and Richard Kiel gave soul the ruthless killer Jaws."
    },
    {
      "rating": "9",
      "text": "The best James Bond while Roger Moore donned the role. Jaws is probably one of the creepiest villains out there. The quips are on point and there are some really cool shots, especially with the Lotus and the helicopter in Sardinia."
    },
    {
      "rating": "10",
      "text": "A fantastic addition to the series! A serious improvement over the abysmal The Man With The Golden Gun. Great action scenes, a memorable henchman, a larger than life villain, great locations, a time period soundtrack that generally works, Roger Moore finslly found his stride in the role. There’s something for everyone here."
    },
    {
      "rating": "5",
      "text": "Spy (1977) is undoubtedly the best 007 film from Moore. Featuring the first of two franchise appearances by the late Richard Kiel (7' 2\") as the villainous killer Jaws. Nominated for a franchise-best three Oscars"
    },
    {
      "rating": "5",
      "text": "Usually I agree with the critics on Bond (80% on Rotten Tomatoes) but I just can't seem to understand why The Spy Who Loved Me is praised so much. Sure the performances are good and there are some good sequences but the music is bad, the plot is just You Only Live Twice on a bigger scale. Overall it's just an overrated film. Nobody Does It Better is one of the best Bond songs though"
    },
    {
      "rating": "7",
      "text": "Roger Moore just matures like wine here.  The newer the movie with it, the better.  The man with the golden weapon was good, and the spy who loved me is even better.  The story is good again.  The bad guy is perfect, but especially the locations ... These were some of the best I've seen in Bondovky.  For me, a good film that I can recommend."
    },
    {
      "rating": "10",
      "text": "Spy (1977) is undoubtedly the best 007 film from Moore. Featuring the first of two franchise appearances by the late Richard Kiel (7' 2\") as the villainous killer Jaws. Nominated for a franchise-best three OscarsJames Bond investigates the hijacking of British and Russian submarines carrying nuclear warheads with the help of a KGB agent whose lover he killed."
    },
    {
      "rating": "8",
      "text": "Easily Moore's best film as 007. The intro ski chase itself was very well done and memorable. By now, Moore is comfortable in the role and is firing on all cylinders. The cinematography and locations are beautiful, and so are the action scenes like the helicopter and Lotus chase, as well as the explosive finale on the boat. The only downside is the villain, Stromberg, who has a very cliche plan of destroying the world with no characterization whatsoever. Overall, it's a really exceptional spy thriller."
    },
    {
      "rating": "7",
      "text": "This is a sillier Bond adventure with its dated 1970's tendencies, but it's also a fun Bond adventure with one of the most memorable villains in the franchise, the overly powerful Jaws. The result is good popcorn action, humour, and ridiculousness."
    },
    {
      "rating": "7",
      "text": "Moore finally gets a chance to unequivocally shine in a gloriously over-the-top 007 adventure."
    },
    {
      "rating": "6",
      "text": "Jaws, who makes his movie debut in this one, is absolutely something. He is the epitome of a Bond villain; a freak of nature and human invention, his fangs are truly terrifying.Anyhow, without Jaws, this movie would have been very dull, wouldn't it?"
    }
  ],
  "recommendations": [
    "octopussy",
    "the_world_is_not_enough",
    "goldeneye",
    "tomorrow_never_dies",
    "the_man_with_the_golden_gun",
    "diamonds_are_forever",
    "from_russia_with_love",
    "for_your_eyes_only",
    "you_only_live_twice",
    "die_another_day",
    "casino_royale",
    "spectre",
    "thunderball",
    "no_time_to_die",
    "captain_america_the_winter_soldier",
    "the_league_of_extraordinary_gentlemen",
    "mission_impossible_rogue_nation",
    "the_legend_of_zorro",
    "skyfall",
    "true_lies",
    "mad_max_beyond_thunderdome",
    "iron_man",
    "quantum_of_solace",
    "indiana_jones_and_the_last_crusade",
    "patriot_games"
  ]
}