{"id": 4143, "title": "The Lobster", "starring": ["Colin Farrell", "Rachel Weisz"], "runtime": 118, "genre": ["Comedy", "Drama", "Romance"], "description": "In a dystopian near future, single people, according to the laws of The City, are taken to The Hotel, where they are obliged to find a romantic partner in forty-five days or are transformed into animals and sent off into The Woods.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/7Y9ILV1unpW9mLpGcqyGQU72LUy.jpg", "categories": {"plot": 3.1052631578947367, "acting": 3.6842105263157894, "ending": 3.4285714285714284, "soundtrack": 1.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 4.230769230769231, "action": 4.0}, "reviews": [{"rating": "0", "text": "Easily one of the worst movies I've ever seen. The whole thing is a pretentious dung heap for pseudo-intellectuals. If anything could be said in its favor it is that the initial plot is interesting as a concept. However it quickly exhausts itself as an intellectual property by focusing on petty vulgarity and injecting a violence angle. Lost in a sea of its own decadence it then sloppily ends with a completely unlikely turn of events as established by the rest of the film that was allegedly \"intelligent.\" It doesn't leave you with a feeling of something profound, it leaves you wondering how a film that pretended to be intelligent for so long could actually be as stupid as it really is by the end. Don't waste your time on it."}, {"rating": "3", "text": "Its story is a horrible mess and this is damaged further by the terrible pacing. Characters just come and go and you won't feel anything. Story has a good ring to it but the execution is so bad that it was wasted. It was rushed."}, {"rating": "4", "text": "The idea per se is very intriguing. The realization, though, is quite poor, especially in the second half of the movie."}, {"rating": "9", "text": "Don't look too deep into it. I see people giving poor reviews because they thought it was trying to hard to be \"deep\" with some of its more abstract themes, but I didn't get that vibe at all.\r Honestly, it was just a fun movie to watch. Everyone I was with enjoyed it, and we didn't have any idea what we were getting in to.\r Very good movie. Excellent directing, great acting, very unique and enjoyable storytelling. Highly recommend you watch it one evening. It won't change your life, but it's quite good."}, {"rating": "0", "text": "A disgusting, violent, and despicable movie.  A waste of acting talent.  Don’t waste your time."}, {"rating": "0", "text": "Original, surréaliste... ? ou plus simplement super nul à chier ? une sous-sous-sous... merde du dernier sous-sol qui tente d'attirer l'attention et elle y réussit à ce qu'il semble. En tant que comédie, c'est raté et pas drôle... y compris comme satire grinçante, car tout tombe à l'eau là-dedans et son absurdité pontifiante avec.Comme drame, psycho, psycondrame peut-être, du genre nouvelle vague de mes deux qui se croit très intelligent sans doute mais s'enlise dans son infinie prétention. C'est sans queue ni tête en tout cas et à dormir debout du début à la fin. Un abominable étron."}, {"rating": "4", "text": "One of the strangest films of the year, perhaps of all time. The Lobster is a highly sylized sci-fi subversion of sexuality, relationships, and the concept of the nuclear family that is at its best when it weilds its bizarre surrealism and absurdist humor but it loses steam in the second act."}, {"rating": "6", "text": "Yorgos Lanthimos' The Lobster opens spectacularly, inviting your imagination to explore the grand dystopian future it presents. It proceeds to dole out sharp commentary on society's pressure to find and maintain a relationship at any cost, even by introducing a child to the dysfunction. However, all this goes to waste as The Lobster overstays its welcome. Without much more to say, the film drags along, promising a grand revelation in its finale. Alas, the final scene was telegraphed long ago to anyone paying attention, and lingers in the air like rotting shellfish."}, {"rating": "0", "text": "All I want to say about this movie is: what a piece of crap! I was left with the feeling that it was going to get better next scene, but it didn't. It's just flat."}, {"rating": "0", "text": "Just saw it This movie may have a humorous premise but in my view the movies is about cruelty Who will remember a funny line from a movie filled with  misery and gratuitous savagery.  All the Comedy Central standups couldn't jovialize  a scene where a nice pet dog's body is found lying  a  in pool of blood and guts. But, in all fairness, the nearly robotic (think  dog on dog) sex scenes may be remembered simply because they are sex scenes,\r The cruelty is not novel to the plot. Cold, viscous, amoral  characters are a dime a dozen in the movies.  Come to think of it, a live lobster being boiled to death is a decent metaphor for this movie."}, {"rating": "0", "text": "Terribly AWFUL!\rIts possibly the all time worst 'serious' / 'quality' film I have ever seen in my life!\rHas really pessimistic miserable atmosphere that only makes you feel utterly depressed.\rSo messed up plot. I really can't understand WHY this terrible movie has so high grade\r& such exceptional reviews from the critics!!\rEven all these great actors could not save it!\rI was only dragged to rent the dvd of this film only because of the great reviews it got from the critics!\rOf course afterwards I regretted big time renting this **** movie!!\rThis talent-LESS director makes pretty bad hella overrated films!\r(Including his other trashy movie ''Dogtooth'' as well that was even nominated\rfor an oscar award for best language film!! I rest my case on that!)\rI just don't get at all why he receives all this NON worthy high praise for his horrendous ''films''!"}, {"rating": "10", "text": "This film is very bizarre, satirically funny, brutal and intensely thought provoking. The premise is that if someone becomes single they are sent to a resort for 45 days and if they do not find a partner they are turned into an animal of their choosing. They are also given extra days at the resort for shooting someone from the loner community (people who have escaped from the resort) . In this dystopian society, both the resort and the loner society are highly regimented and violent if rules are not followed... The film is mainly a satire on relationships and although we so desire to connect we often fail because we often cannot empathize with the one we have chosen. .Also, In order to connect  we sometimes attempt to make ourselves into copies of the other person, a tactic that often fails. The film portrayed how difficult it is to  empathize with a partner unless we share some characteristic, and because that often is impossible the relationship is doomed.. The film makes big statements and smaller ones and all of them are profound, sometimes funny and sometimes very sad. It satirizes the current dating scene by portraying its superficiality, but also satirizes and makes a grim statement about relationships in general, and society which offers us opportunities to conform or rebel, neither of which is effective. Most people exiting the theatre expressed dissatisfaction. I think that those that go on to think about it will find that it will deeply impact their thoughts and beliefs."}, {"rating": "0", "text": "I stayed until the end of the film and agree with Urbanmagic: dreadful.  Also disturbing.  I don't mind being disturbed if there is a worthwhile point made and one can get invested in the characters (eg. Frank).  But not here where the dialogue and characters are stylized and wooden.  If the intent was to say that people are sheep and look for superficial similarities to establish a relationship, that was accomplished in the first 25 minutes.  There is no need to see this film.  She Her instead, if you haven't.  It has much more to say about people and relationships."}, {"rating": "0", "text": "The Lobster. I am writing this review as a public service, for all those that do not need or want to spend their  10 dollars and 2 hours of their time being totally depressed by a meaningless piece of trash.\rThere are spoilers in this review, so be aware. The idea that a pair of people, who, due to a dystopian world and a sadistic, \"leader\" end up having to become blind to find \"true love\"  is just utterly ridiculous. This dystopia,  where being single is illegal,  going into relationship \"rehab\" places you in a joyless relationship, with your only other two options being made into a mutant animal, (ala the islnd of Dr Moreau), or living in the woods with a manipulative, sickening, cowardly, murderous woman, who could not evenn do battle with a woman she blinded, is just beyond depressing. Its sadistic and indescribable, at least to me. It was long, boring, depressing, with no redemptive features, whatsoever. If, perhaps, the couple had things to atone for, in their previous relationships, then, at least, their would be a story here.\rI felt that there was probably an alternate ending, or endings filmed, in which you would see Farrell's character, walking away from Weisz's character, in the restaurant background, might have been interesting, but even more depressing. I will say , that the filmmaker did a great job of even making a beautiful area of either scotland or Ireland look depressing, was ann accomplishment(LOL).\rJust pitiful, pitiful, pitiful."}, {"rating": "0", "text": "I have never been so hoodwinked by critics before, and hope to never see dreck like this again.  Anybody who says there is a single laugh, smile, or even twitch of emotional response from an intelligent viewer is lying."}, {"rating": "1", "text": "Film opens with a close-up of a woman driving . . . and driving . . . and driving some more.  After a long minute or so, she pulls over, walks to a nearby paddock where donkeys are grazing, pulls out a pistol and shoots one of them twice, then leaves.  Like much else in this film, this may or may not be funny, depending on your perspective.  But that is as good as it gets.  The story involves a newly single man who is enrolled in a . . . let’s call it a matchmaking program, at a secluded hotel with other singles; those who fail to find a match are transformed into an animal of their choosing (our hero picks a lobster, thus the title).  There is a lot of set-up, some adventure, occasional cruelty, a little romance, and a few laughs – although there is a black-comic undercurrent to the whole thing, as if Lanthimos was trying for a Jim Jarmusch mood.  Recommended only for the serious cineaste or the aficionado of the offbeat.  Major trigger warning for animal lovers (and the donkey isn’t the worst of it).  Me, I checked my watch, something I rarely do in the theater.  There were 20 minutes left."}, {"rating": "0", "text": "Rarely is there a film so devoid of any meaningful content that it rates a zero.  This film is one of them.  There is nothing but nonsense.  Some of the newspaper critics may think it's trendy to give it a 100, but I don't understand how anyone can see this film and see anything entertaining.  Save your popcorn for another film."}, {"rating": "0", "text": "Man, this movie is AWFUL. Both my wife and I, without telling each other, checked the running time of this movie in the middle of it. I was *this* close to walking out. People laughed when the movie was over. The theater's disappointment was palpable.\r We went to see it based on the reviews here, and afterwards, I felt compelled to come back here and take another look at them. I was thinking that maybe I'd missed something? Nope, nothing about this movie makes sense. The whole movie seemed so pointless. There's no denying that it's \"artsy\" and \"risky\", but the risks don't pay off. Avoid this movie unless you're trying to punish yourself."}, {"rating": "0", "text": "This is one of those awful movies that is beloved by critics for its trendiness, stylishness, and shock value, despite its relative meaningless and worthlessness as a story. At its center is the notion that modern society's pressure to pair off and mate is SO STRONG that it is basically equivalent to a hotel where you are forced to pair off or be turned into an animal. Also you're forced to hunt lonely people with tranquilizer guns, because why not! The entire premise strikes me as melodramatic and self-sorry (think film school loner that can't get a girlfriend), and relies on cheap shocks that arrive with predictable regularity. It basically has the plot of a bad anime mixed with the effete and somber filmography of Beyonce's Lemonade. So at the very least, it's pretty. But after 20 minutes of this schlock you realize that it's all form, no substance."}, {"rating": "4", "text": "Colin Farrell gained 40 pounds to make him dowdy for his character, a single man checking into a special hotel. He has 45 days to find a new mate or he'll be turned into the animal of his choosing (guess what he chose?). Yes, this is an alternate world (think Charlie Kaufman) with strict rules and weird procedures. The quiet wit and peculiar circumstances start with compelling imagination. By the 2nd hour, the narrative deteriorates into a slow-moving romance with more meanness and less humor. The actors speak with stilted stiffness and minimal emotion. While the absurdist setup is interesting and the payoff is equally weird, the film loses creative momentum. This must have been interesting for Farrell, but I hope he can lose that gut."}, {"rating": "3", "text": "I just knew that the official critics instead the casual folk will give great scores for this - just because it's an art piece or whatever, while if you are an average movie watcher, then the movie is a bit too weird. Of course, that's the way mindf**k movies work and this is definitely something like it. It wasn't that bad at the beginning ,the idea of the movie is original - and somewhat reflects the actual society and everyone pushing us to find our significant other etc. Here they take it over the top a bit and show what would happen. But there were so many dumb things, especially towards the end, which did not make much sense. I mean if you like those artsy type movies you will enjoy this one, but I don't so I actually even wonder how I made it and watched the whole movie here."}, {"rating": "0", "text": "A movie with an interesting idea for a plot. What if people were forced to choose between a life of being cold and alone or a life of being joined to another person and altered beyond recognition? After 2+ hours, you'll be saying in response, who cares? A stupid movie with heavy handed allegories that drive the plot, plot that drives the characters, and characters that drive the inevitable migrations you'll get from watching this crap. I caught on to almost all of the allegory in this film from one viewing. As for the aforementioned characters? They might as well not exist. They all do feats of such incongruous nonsense just to keep that allegory hammer aloft for the entirety of the film that its a miracle they even stay in the film at all. Why did the \"leader\", yes that is a character's name, get their sidekick killed on purpose? Who knows. And, again, who cares?"}, {"rating": "1", "text": "I am all for being challenged and taken to new places by independent cinema but this is just pretentious twaddle with no substance."}, {"rating": "0", "text": "I went out to see this movie with my roommate and her boyfriend. Their friends had highly suggested the movie, so we made an outing of it. I’m not especially fond of R rated movies, and the plot seemed thin, but perhaps humorous, and I convinced myself to have an open mind, and try something new.\rWe all regretted watching this movie and afterwards agreed: if we had been watching this at home we would have stopped after twenty minutes. I knew very little about this movie coming in, but if it was meant to be science-fiction, I saw no science; if romantic, these themes were lost in its bizarre mood similar to how pungent, rancid flavors destroy delicate ones – and if comedic, then only to those who can purge themselves of compassion and empathy.\rThis movie is at best a bitter, twisted satire. I pity the people who saw marriage in such a dystopian light that they could conceive such a story. While I agree that there are many things amiss with today’s standards for marriage and relationships, this movie went too far. For example, in this movie:\r•\tEven in their desperation, people relied on insignificant, superficial similarities to find ‘mates’:\rA limp, frequent nosebleeds, perfect hair, emotions or lack thereof, shortsightedness, and finally blindness – criteria that lead to the pursuit of hollow, shallow, and altogether meaningless relationships, save one near the end; but even that one was plagued by this practice.\r•\tSingle people where adamantly reminded of their ‘misery’ and given lessons in the ‘importance,’ or rather, the ‘benefits’ of being in a relationship while at the hotel, which also made it its business to encourage and engage its occupant in sexual habits that they deemed beneficial and prohibit and punish those they considered damaging to ‘relationships’.\r•\tBrutality, however, is apparently under standard trade laws and thus monopolies are prohibited. The Loners, the alternative to society, make many allowances that the hotel and society at large prohibit whilst they live in exile. In stark contrast to the rest of the society, Loners are expected to be alone permanently: you can talk, you can come, you can go, but any sign of sexuality, of attachment, even something as fleeting as flirting, will be severely and mercilessly punished, and their leader is the typical sadistic, manipulating, power hungry psychopath that these types of movies seem to breed.\rAre we superficial? Yes, we are. Do we feel pressure to be in a relationship? To have a ‘significant other’? All the time. Is the world cruel? It goes without saying. Are we all flawed? Of course we are. Do we really need a movie to tell us this in some bizarre, twisted fashion? The fact that these types of movies are on the rise is itself a satire against society. But does exacerbating the issue like this do anything? Would a doctor ever suggest rubbing filth and excrement into a wound as part of a treatment? – it would only make matters worse, and satires like this have the same effect.\rIf you want to help society, if you want to see it healed, you have to teach people what it means to be good, not chastise and mock them for what they didn’t know was wrong. And to do that you need to show them what it means to be good, to be wholly loved. As Antione de Saint-Exupery said, if you want to build a ship, don’t drum up people to collect wood and assign them tasks and work; teach them to long for the endless immensity of the sea. Likewise, we need to teach people to long for a love that is kind, a love that is patient, loyal, humble, noble, and most of all forgiving. A love that protects, hopes, and always perseveres, not one that pretends, harms and falters."}, {"rating": "0", "text": "Sometimes funny, mostly not. Sometimes brutal, mostly boring above all else. Another \"artsy\" film where critics pretend they like it because it's an alternative film and everyone wants to \"get it.\". There isn't anything deep about this film - it's silly and shallow and random, and way too long."}, {"rating": "0", "text": "One of the worst movies I've seen in this century. They took a great premise and drove it into the ground with crappy acting (although the script ensured that) and an intrusively bad score.  One reviewer commented that this is a Best Picture contender, but I'm not sure on which planet those awards will be given out."}, {"rating": "0", "text": "This movie is only for those who like absurd, sadistically disturbing humor. It kind of reminded me of a skit written by troubled 8th graders. Okay, maybe this movie makes some valid points about absurd societal norms, but I did not find it to be particularly entertaining or clever. I find it disturbing that for some people \"disturbing\" is all it takes to impress."}, {"rating": "1", "text": "Spare yourself - In my opinion this film is a complete waste of time and money. Crude, strange, dystopian fantasy.  Some scenes were so repellent that I had to avert my gaze."}, {"rating": "1", "text": "At least 2-3 times a year I get suckered into seeing a movie from seeing a trailer or hearing that it got 5 star reviews, it has an Oscar nominated director, a solid cast lead by an A list actor, sounds and/or looks different or for many various reasons. For some, if not all the reasons listed, I went, with Allen and Philippe to see \"The Lobster\".\r Walking out of the movie the best part was overhearing the audience making comments and reading the cremarks they left on The Gateway Theatre audience comment board. Oh yes, and listening to what Philippe and Allen had to say. One of them hit it on the head when they said \"It was weird!\" Allen was trying to make it more or less a time of the world in the very far future but that didn't fit in with cars and trucks of today among other things.\r The premise is that being coupled is better and safer than being single. A person who is single for any various reasons has 45 days to find a partner or be turned into an animal of their choice. After that you are on your own folks!\r Should you be intolerant of animal cruelity stay away from this movie though human beings aren't spared either and most in the audience kept their eyes closed in the last scene.\r (I'm blaming Allen for putting us through this 1 hour and 58 minutes movie as all he had to say was that we should see something else!)"}, {"rating": "9", "text": "There is nothing shallow about this movie like some people seem to believe. The parallelisms on relationships made in this movie make for an emotional and existential roller coaster that will have you thinking one minute and tearing up the next. The one thing all the reviewers can seem to agree on is that it is ragingly depressing."}, {"rating": "6", "text": "I give it a six for originallity. It changes from the rest of the movies and the actors were very good. But the story was too weird for me it was even disturbing and towards the end I got a little bored."}, {"rating": "0", "text": "Until now \"Sid and Nancy\" was the worst, most depressing movie I had ever seen. Not anymore! This movie is horrible. Based on the reviews I toughed it out the first hour. Then I had to see how it ended. It ended with me wanting my $15 and 2 hours of my life back."}, {"rating": "1", "text": "Wow!  What a big big big big disappointment this was at my Utah film society today, after literally waiting weeks for it to come out, and looking at the rave critic scores.  After reading the synopsis and watching part of the trailer, I thought it would be a relevant commentary on the newly repressed category of SINGLE folks in America, along with other minority and oppressed demographic groups that are having trouble at the voting polls these days, but discriminated against in other areas of life as well (thus the new portion of the identifier QIA or QUILTBAG, to the LGBT we've known for years now).\r And for the original and classical piano soundtrack and about only 2 belly laughs that were antithetical to the total and miserable dreariness and snail's pace for the rest of the time, I'll give it only one point.\r And, I'll say here pointedly to the producers and actors involved:  WOW! What an incredibly missed opportunity here, with some new and incredible subject matter in today's world to build upon. But what happened instead was a devolving and true mess, trying to make several points about all sectors of society, and missing the main point  about single vs. married stereotypes and thus some really great humor and irony, entirely.  IN THE FUTURE, QUIT TRYING TO MARKET TO SO MANY GROUPS AT ONCE, AND FOCUSING ON EVERYTHING, and THUS LOSING THE FOCUS !!!  JEEEZZZ!!  This was an extraordinary mess, plus waste of money, plus waste of time traveling hours on the bus to see it.  And if you want me to see future independent films in theaters anymore, you'll finally quit it with this careless schlock and make real films again along with the money which will follow great art, which this wasn't by any stretch whatsoever. LATER!!"}, {"rating": "9", "text": "Incredibly imaginative dystopian setting that truly is best described as absurdist. What bothers me about the mixed and unfavorable reviews is the literal reactions of \"disturbing\" scenes and 'weirdness\". Somehow they are not in on the whole absurd joke, and are instead simply put off by the appearance of blood. I imagine these individuals prefer their violence in neat clean packages delivered by automatic weapons and zombies."}, {"rating": "0", "text": "Imagine a blind teenage boy, exceptionally blood thirsty and ignorant.  Pump him full of drug...  then give him pen and paper and ask him write a cinematic masterpiece.  This is what would come out of it.  The Lobster's attempts at literature is as immature as they are moronic.  The only way to like this movie is if you smoke a pound of weed before, during and after it."}, {"rating": "9", "text": "Quirky and brilliant, and once again a terrific job by the vastly underrated Colin Farrell. So original, and completely enjoyable on both literal and metaphorical levels, whichever you happen to prefer."}, {"rating": "9", "text": "As a dark comedy fan, this film more than satisfied my itch for absurdity. From beginning to end, I had absolutely no idea as to where the plot will take me. I'm sorry for anyone expecting a fun romp of a documentary about coruscations. That isn't to say that the title does not lend yet another branch of ambiguity.\r Typically when it comes to this genre of film, the directors take a lot of creative liberty to the point that they're knocking you over the head with their idealism. This isn't the case for Yorgos Lanthimos, who has immense respect for the audience to come to their own conclusions on multiple aspects of the plot.\r Yorgos also is brilliant at dropping you into this world with little explanation. I still have many questions as to how this world functions and why it is the way it is, but I think that way of thinking is pertinent when it comes to getting something out of a film (Sorry Michael Bay fans).\r Colin Ferrell or as I called him \"Fat Collin\" is somber and soft spoken for the entirety of the film. The rest of the cast is delightfully quirky and intriguing. I got more out of the narrator than any other character in the film. This is an obvious nudge to the fact that this absurd world is the main character and the way its inhabitants interact with the circumstances is what defines its personality (if that makes any sense).\r Although I won't suggest this film to most people, I highly implore giving it a watch if you enjoy confused belly laughs and absurd social commentary."}, {"rating": "9", "text": "Strange, wonderful, and brutal, with sprinklings of dark humor. The Lobster speaks to the absurdities of human relationships and the molds that society drives them into. Much like The Road or Requiem for a Dream, this is a film you won't need to see twice, nor would you want to."}, {"rating": "8", "text": "I liked this movie alot, thought it was going to be some way out there eurotrash but ended up feeling that it was great.  Best movie I'd seen Colin Farrell in since In Bruges & Rachel Weisz and Olivia Coleman are always the best."}, {"rating": "9", "text": "\"The Lobster\" is wonderfully quirky and very funny. It has a ton of emotion and lots of style. It has a lot to say about the way society looks at relationships as well. A fantastic movie and one of the best films of the year."}, {"rating": "0", "text": "Total Zero...this quirky film only got worse as it went along.  I wish I were drunk or on drugs...so that maybe I could relate to it better.  I'm glad I had sex with my girlfriend prior to the movie, because she was so pissed after that we didn't walk out. We unfortunately stayed to the end.  So bad, you'll want to poke your damn eyes out too."}, {"rating": "1", "text": "The film is smug and deliberately off putting. The sadomasochistic violence is all in fun, but it is very difficult to tell that this is satire. A very unpleasant experience."}, {"rating": "0", "text": "This film is dreadful! Ponderous and pretentious beyond measure. The exodus from the screening I attended began at around 30 minutes in. If we'd been wise, we'd have left then. As it is, we stayed another torturous 30 minutes until it was utterly clear just how insufferable this poor excuse for a movie was. I can only assume that the critics all got together and smoked a huge quantity of crack before they saw this thing and wrote a good review of it. Nothing else can explain their confusing film student shocks as profundity. This rates as one of the worst films I have ever seen. I urge you to not even enter a theatre where it's playing."}, {"rating": "9", "text": "The movie has so many deep messages, about society and relationships.\rAll put in a strange way, but in a brilliant way too.\r I'm not surprised a lot of people will not get these messages. But this movie is something else, much bigger than what meets the eye."}, {"rating": "9", "text": "A film that tells the story of the importance of finding someone in your life in the most unique way I've seen.  You really must experience this film at least once in your life.  A totally original film a must see.  A"}, {"rating": "8", "text": "One of the most unusual -- and thought-provoking -- films to come along in quite a while. Its decidedly offbeat humor and wry symbolism work wonders in skewering everything from the current superficial state of courting rituals and relationship matters to the pressures of social conformity, regardless of which end of the polarized ideological spectrum one resides. The film admittedly becomes a little bogged down in the second hour, going off on tangents that could have easily been deleted, but, on balance, \"The Lobster\" represents a thoughtful, satirical look at where we stand as a society -- and, one hopes, where we'll resist the temptation to go."}, {"rating": "9", "text": "Several reviews I have seen speak negatively of the brutality of this film. Others argue that the stilted dialogue and emotionally distant (or emotionless) characters subtract from its quality. Quite to the contrary, I would argue these factors, along with a shockingly dark and dry sense of humor, a unique score, and brilliant cinematography, combine to make The Lobster a satisfying and beautifully satirical dark comedy. Perhaps at times it is too much of a thinker or too hard-to-watch to be \"enjoyable,\" and I don't think I would necessarily care to rewatch it, but I do believe it is a highly successful work of art."}, {"rating": "4", "text": "I read this was a very funny satire. It’s about as funny as the old 1984 film with John Hurt, except Hurt was not as lethargic as Colin Farrell’s David. Had anyone been laughing, I would have heard them. Not even a chuckle. But I am rating this film low for one reason – it was much too long. Lanthimos is also not a very interesting director visually, which is probably why no one asks him to direct action films. Too many of the forest scenes, especially, were very “in your face,” although maybe it was so we could see the rabbits, who were all probably former humans, and which would then mean this was a joke about fecundity. Are you laughing? The performances were very good, and I guess we all got the point. After the screening, the theater invites you to leave a note about the film with a letter grade and a short comment. The funniest thing I saw all day was one of these notes, which read “Can’t wait for Lobster II.” Oh, God, no!"}, {"rating": "1", "text": "Another hippie movie from Yorgos Lanthimos. Don't understand point, and i want to never understand it. Grotesque."}, {"rating": "9", "text": "Ok Ok, as all the bad reviews will tell you, this movie can be disturbing at times. That's not a reason to hate it. Alcoholic drinks taste bad to children. The Lobster is a wonderfully unique script that is also thrilling, funny, romantic, and best of all thoughtful and thought-provoking. Person above me writes \"maybe it makes some valid points about absurd societal norms...\" Why, yes. Yes it does. And if you let the movie take you, you'd see it was quite profound. This is a movie for the advanced viewer and it hits the bullseye in everything that has been missing from mainstream film for years."}], "recommendations": ["the_wolf_of_wall_street", "children_of_men", "babel", "antebellum", "vivarium", "crash", "mother", "the_butterfly_effect", "downsizing", "chappie", "lost_in_translation", "apocalypto", "colossal", "midsommar", "swiss_army_man", "v_for_vendetta", "fifty_shades_darker", "the_shape_of_water", "the_counselor", "boyhood", "nerve", "slumdog_millionaire", "donnie_darko", "the_darkest_minds", "lucy"]}