{
  "id": 1274,
  "title": "The SpongeBob Movie: Sponge Out of Water",
  "starring": [
    "Tom Kenny",
    "Bill Fagerbakke"
  ],
  "runtime": 93,
  "genre": [
    "Family",
    "Adventure",
    "Comedy",
    "Fantasy",
    "Animation"
  ],
  "description": "Burger Beard is a pirate who is in search of the final page of a magical book that makes any evil plan he writes in it come true, which happens to be the Krabby Patty secret formula. When the entire city of Bikini Bottom is put in danger, SpongeBob, Patrick, Mr. Krabs, Squidward, Sandy, and Plankton need to go on a quest that takes them to the surface. In order to get back the recipe and save their city, the gang must retrieve the book and transform themselves into superheroes.",
  "releaseYear": "2015",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2WDmjUlSAPlA27i2OwEC7sRTFw3.jpg",
  "categories": {
    "plot": 6.037037037037037,
    "acting": 6.0,
    "ending": 7.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.636363636363637,
    "funny": 7.12,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I loved this movie. It was great! Had so many hilarious moments, great action, and I loved how they brought them out of water. That new scenery was great! I greatly recommend seeing this movie.\rOnce upon a time there was a fat stupid pink idiot. The end.\r That had me cracking! You gotta see this movie."
    },
    {
      "rating": "10",
      "text": "This movie was great, well done, great story line.  VERY funny for both kids and adults.  We saw this on opening night and the movie was sold out, not a spare seat in house, but were first in line!  We saw the 3D version and that was extra cool and amazing, even though it cost a bit more to see it in 3D, it was worth it.  Great message for the kids about team work.  Some special guest stars were a nice surprise too.  Run to see this movie...even if you don't have kids!"
    },
    {
      "rating": "7",
      "text": "Summary: This movie was a **** mess... but I liked it anyway. 70/100 [B-]\r Even though it's not even close to the awesomeness of the first movie, still a good movie. The animation was great and the jokes were funny enough. The whole audience was dying of laughter! There were a lot of strange and **** up moments in the movie, there was also a reference to \"The Shining\" and I was like: What the hell am I seeing? Anyway, this movie is anything but boring. I couldn't take my eyes of the screen, I was so entertained the whole running time. The first SpongeBob movie was already surreal and weird, this one... *sigh* has crossed the line.\r The 3D was incredible, well done and eye-popping. There's a great action sequence near the end of the movie with the pirate involved (performed by Antonio Banderas), and it was so damn funny and fast-paced. On the downside, some repetitive jokes become tiresome as the running time goes, the above-water stuff was way too short and well... actually the whole movie was very short to me, I don't know why, this movie should be longer! Again, the whole above-water stuff that you can see in the trailer was actually 20% of the movie, seriously WTF, I wanted more.\r I left the theater a bit unsatisfied. I felt like I just watched a movie that's 50 minutes long. Also, another of my issues was the ending, the songs in the ending were unnecessary and a little bit annoying. In addition, another issue was the villain. Antonio Banderas was great, but his character is not very well developed, he was a quite uninteresting villain. Leaving aside its flaws, I noticed one thing, the editing is really well done and even though it has some messed up moments the movie is never confusing because its premise is so short and easy to follow.\r The editing makes the whole film more dynamic and easy to understand. So, in conclusion this SpongeBob movie is not even close to the 2004 film, but it has enough visuals and clever gags to satisfy the audience in general. The above-water sequences are so damn enjoyable, the 3D looks fantastic and there are a lot of moments in the movie that are so damn surreal and messed up! Think of an animated version of Interstellar. Also, I don't want to spoil it, but I'm just gonna say that first scene with the dolphin was so strange.\r I'm pretty sure that a lot of people will dislike this film, mainly because of the ending, some annoying songs, the **** up moments and the shortness of the film. But to me, it is not a bad movie at all. I highly recommend it, especially if you're fan of the TV show. If you're going to see it, you must see it in 3D and on a huge screen. It is a pretty good spectacle. It is great that the movie took advantage of its 3D format, it looked great. Also, do not forget to see Squidward's dancing in the end credits, it will remind you to the old times. [B-]"
    },
    {
      "rating": "7",
      "text": "It doesn't quite reach the quality of the original SpongeBob film, but SpongeBob SquarePants: Sponge out of Water is still silly, weird fun with some genuine laughs."
    },
    {
      "rating": "7",
      "text": "I was quite disappointed by this.  As an adult the tv show is loaded with intelligent satire, unique and quirky humor.  The combination of high and low brow humor, slapstick and innuendo is enough to keep many adults happy and entertained.\r This movie however is basically devoid of most of these things.  Aside from 2 or 3 scenes and jokes, this movie feels like it wasn't written by the same people who write for the show, or perhaps when confronted by a longer running time they choked?  Still other made for TV feature length Sponge Bob movies were funnier and more in tune with the show.\r The premise of the movie allows for some \"What if\" scenarios to unfold... but the writers seem asleep at the wheel.\r Numerous chances for the typical quirky humor of sponge bob are missed, and sponge bob is essentially little more than an exaggerated Pollyanna, which is only a small part of what makes him funny on the TV show.\r Probably the only part I truly laughed about and felt was true to the spirit of spongebob, was a sequence inside his mind...  As well as one or two gags that happened along the way.\r It felt almost like this was a bit of false advertising as the commercials showed a life action style predominantly, and most of the movie is basically the same as the cartoon.\r Overall I think this will appeal more to the younger Spongebob fanbase, and less to the parents of the show, or the kids who grew up watching it and are now adults themselves who appreciated it for it's adult friendly satire, innuendo and quirky/awkward punchlines.\r Several characters in particular feel written differently as if they have been written not by people who know and love the characters, but by people who watched a few episodes and copied down jokes and gags they saw.\r Bottom line, this isn't the first full feature length show spongebob has made, but it feels as if it is.  It is terribly derivative, bland and as if it's been cleansed of any adult humor... Maybe Nickelodeon didn't want to risk offending the parents who don't normally watch the show?\r Anyway this movie would be fine for the ten and under crowd, my 12 year old hated it (and he loves spongebob), and adults taking their kids to see this, should refrain from eating any rich meals that cause the ITIS before hand or they will end up falling asleep in their seats like I did.\r I kind of feel sorry for Antonio Banderas, because he had a fine performance, but I felt like I was watching a man who was once at the top of the game, now resorting to doing kids cartoons to pay the bills... But he certainly didn't cop out or put out a bad performance.  But this won't be another Puss N Boots for him...\r Final Verdict - Kids ten and under?  Sure, go see it with them.  Age 10+ wait till it's on Netflix or something."
    },
    {
      "rating": "9",
      "text": "This movie was a lot better than I expected. It was really funny for kids and adults alike. I loved the ending where they were referencing Epic Rap Battles of History. The special effects were fantastic, even with the 2D style and the 3D style. This is arguably the best Spongebob movie I've seen and one of the best animated movies I've seen in a long time!"
    },
    {
      "rating": "7",
      "text": "Most of the jokes were flat just like the T. V. Series but that's okay. The movie was still pretty entertaining especially the CGI part. This is pretty much just the expanded version of an episode of the Spongebob shows so watch this if you like the episodes."
    },
    {
      "rating": "7",
      "text": "I'm a fan of the SpongeBob TV show.  I enjoyed the film, although it wasn't as funny as some of the TV episodes.  The TV show where SpongeBob sells chocolate door to door make me laugh so hard my stomach hurt.  Nothing in this film is quite as funny but it still was humorous and held my attention throughout.  The animation itself was fun to look at.  It really held the attention of the kids in the theater as there weren't any squirming talking kids while it was on.  I do wish Squidward was featured more as I like his cynical personality.  The 3D effects were good as well.  It will be a Blu-ray purchase when it comes out."
    },
    {
      "rating": "7",
      "text": "A lot of people thought this movie wouldn't be very good because of the changed writers throughout the show's history, but this movie was way, way better than expected. It may not be the funniest or best animated movie out there, but it still holds up very well. I'll even go as far to say some elements in the film surpass the first movie. Paul Tibbitt, if you're reading this, you did a good job."
    },
    {
      "rating": "10",
      "text": "This is classic Spongebob. Ridiculous humour, outrageous plot, complete with talking dolphins and singing seagulls.  Like watching child-friendly Monty Python. Excellent all around!"
    },
    {
      "rating": "6",
      "text": "I'd have to say that I was entertained but not as impressed as I was with the first movie. Mostly, the climax of the first film was far better; the supposed tear-jerking moment wasn't as strong on this one.\r The animation is probably the film's best shining point. It is a tremendous improvement yet also a nostalgic reflection of the first movie. About 4/5ths of it was 2D while the last fifth was CGI, which surprisingly enough was quite good for the art style.\r As for the humor, it's been a long time since I've laughed at a post-season 4 joke. The writers decided to drop on the toilet humor this time, and I'm glad. Having watched Spongebob since season 2, I also appreciated the references they made to earlier episodes, including the reef blower and Squidward's interpretive dancing.\rThough the rap battle was a little superfluous in my opinion, Pharell Williams's song \"Squeeze Me\" was surprisingly catchy. I'm glad I stayed during the credits to hear it.\r So, yeah. Bottom line: good animation, good beginning storyline, good jokes, but bad ending. Nonetheless, it was a creative effort, and I have to commend the studio for the improved animation, and I hope there's gonna be a third movie as well."
    },
    {
      "rating": "7",
      "text": "It has a slight inability to make jokes that work all the time, that and a little more context, but when this movie does crack the good ones it cracks them right. Not nearly as good as the first film, but a decent sequel with shimmering glimpses of the quirks our lovable characters had back in the first seasons of the show....*sigh*..."
    },
    {
      "rating": "7",
      "text": "If you like the show you'll like the movie.  I never really watch the show, but knowing the characters and their motivations I was for the most part entertained.  B"
    },
    {
      "rating": "8",
      "text": "This is the unthinkable spongebob movie! seriously it is! even though the humor has some issues, but Jonathan Aibel and Glenn Berger's script has made a laugh out loud fun time at the movies. Director Paul Tibbitt, has made this movie a blast with  fun characters a unique story also an incredbile movie. Grade A-"
    },
    {
      "rating": "9",
      "text": "The superhero and CGI parts are easily the weakest in the movie, thankfully they don't make up most of it. It's an absolute joy to watch the whole way through."
    },
    {
      "rating": "7",
      "text": "It stays true to it's SpongeBob style and comedy, making it a very satisfying film to watch. The plot to the film though seemed to be somewhat overdone with many incredibly strange and unnecessary scenes that will leave you thinking \"What was that?\" Although the film's plot was all over the place, it still holds itself together as a great animated film. It may not win the hearts of non-SpongeBob fans, but if you are a SpongeBob fan or you just love animated films a lot, then this is a must-watch."
    },
    {
      "rating": "7",
      "text": "If you're a fan of Spongebob, then you'll with out a doubt enjoy this movie, the humor hasn't changed and there's lots of funny moments. I'm glad the movie sticks mostly to it's standard 2D animation, with only about 20% of the movie being 3D animation. However I don't think it holds up much against the first movie, it lacked the bang and creativity it had."
    },
    {
      "rating": "6",
      "text": "The new SpongeBob movie will probably sit close to many peoples hearts, expectantly those who remember the first movie a few years ago witch was received extremely well by fans and movie goers. This new SpongeBob movie is just like the TV show and keeps lots of the same humor that sneaks in those more adult themed jokes well still keeping it Family oriented. Obviously the story won't be anything special but the humor of how they get from point A to B is what makes this film enjoyable. For those of you who saw the trailer of all the main characters on land in Full CGI and got all excited to see a who movie like that will be sadly disappointed because that is only the last act of the film, It's a good last act but it leaves you wanting more. The animation for the Cartoon and the CGI segments of the film are done extremely well, will little minute details all over. Fans of the old TV or Movie should give this one a chance and I'm sure it's even more enjoyable with some buds and beer."
    },
    {
      "rating": "7",
      "text": "4/5★ If you are a fan of The SpongeBob, as I am, this film will tickle your fancy. Zippy, crazy and meta to the max, the mix of animation styles meshed with live action will please the pop culture enthusiast and the kids alike.\rIt did feel like there were two movies, one focused on the Bikini Bottom crew, and the other is Antonio Banderas doing his Jack Sparrow impression.\rVerdict: For fans of the show and kids."
    },
    {
      "rating": "9",
      "text": "(Before you read the review I did watch this when it came out in the advanced screening but never made a review back then so...... yeah)\r This movie is just so hilarious....... the jokes are funny. This is just an awesome film to watch and have a laugh. The first was great and all but this one just takes what was in the first film, put it in this one and expand it to THE MAX!\r This is a great film to watch with anybody  who likes sponge bob or just needs a good laugh.\rRecommended so much you have to watch this film."
    },
    {
      "rating": "7",
      "text": "Thankfully, The SpongeBob Movie: Sponge Out of Water is a really fun time. It captures the original spirit of the show and maybe in the could end up being a cult classic, especially for stoners. Smartly written and filled with multiple gut busting one liners, this is a movie that can be enjoyed by kids and adults alike."
    },
    {
      "rating": "7",
      "text": "Spongebob: Sponge Out of Water is a decent film, but I wish the filmmakers hadn't gone so far out of their way to reach the stoner audience. I found this Movie mildly enjoyable as it's well animated, and funny, but the story is very unfocused, and it makes a bunch of turns and has scenes that don't really further the story very well. If you watch this movie with a kid you'll have a little fun, but you may be slightly confused."
    },
    {
      "rating": "7",
      "text": "Although I wanted more from a SpongeBob movie and while the story was whacked up and crazy, the frantic  movie itself, the humor, the impressive cast and soundtrack, and the great use of 3D really made up for the movie's painful shortcomings. If you're a SpongeBob fan, this is a real treat for you.\r Score: 6.9/10\rGrade: B- Decent"
    },
    {
      "rating": "8",
      "text": "The movie was far beyond enjoyable, the time travelling sequences made it worth seeing in 2d and 3d, the jokes were solid (i would expect nothing less) and the adventure was grand enouh to feel this was truky a successor to the original spongebob movie. Going into the movie i was hoping for a nice chunk of traditional animation and i was definitely pleased, However i dont know if they spent enough time out if the water to really warrant the title \"sponge out of water\".The cgi was downright impressive, the animation was solid, the characters were well voiced and the movie was not what one would call predictable. The rap at the ending though, was downright atrocious.it was clearly done by the creator of \"epic rap battles of history\" and as such reeks of his \"im better than you\" \"no im better than you\"lyrical content and his copy and paste delivery style, it had nothing to do with the film we had just watched and it cuts off the closest thing you get to a play through of the spongebob theme,it smelled so badly that it costed the film a point ."
    },
    {
      "rating": "8",
      "text": "Sponge Out of Water is a pretty good movie! I went to see it and I loved it! It is a little confusing at first, but is good. The only thing I don't like is how SpongeBob, Patrick, Mr. Krabs, Sandy, Squidward and Plankton are only on land for about thirty minutes! Overall, it is a good movie!"
    },
    {
      "rating": "8",
      "text": "Well, I liked it a lot, but the movie advertises a lot the CGI, but the movie only has like a 30% of CGI, the rest of the movie is traditional animation, But the movie itself is great, it doesn't fall in the bad written and rushed sequels, it doesn't make me laugh a lot, a kids movie with adult jokes.\rIt's a good movie, but isn't better than the first one"
    },
    {
      "rating": "7",
      "text": "It sure is not as good as the first one but this movie does not fail to entertain me. Every scene is enjoyable and i'm sure if you're not a spongebob fan you will at least laugh just a little no matter what. In the end SpongeBob: Sponge Out of Water is definitely on my top best."
    },
    {
      "rating": "10",
      "text": "The SpongeBob Movie Sponge Out of Water Is Great Film I Love SpongeBob Also Love 1st Movie Animation Is Good Live Action Is Awesome Characters Is Awesome"
    },
    {
      "rating": "7",
      "text": "SpongeBob's back in his 2nd movie in theaters! He's only going out of water for just a few minutes of movie time (similar to how Godzilla (2014) done it). Despite that, SpongeBob has made his adventures look like he's ready for his next greatest adventure coming soon in theaters."
    },
    {
      "rating": "9",
      "text": "The Spongebob Movie: Sponge Out of Water is a funny and enjoyable continuation of our favourite undersea sponge. I was a bit disappointed by how little out of water screen time there was, but otherwise it has a lot of charm and wit."
    },
    {
      "rating": "10",
      "text": "The movie is hilarious and has great action, also the plot is great and the end is funny."
    },
    {
      "rating": "5",
      "text": "The last SpongeBob SquarePants film in 2004 was one of the greatest animated films based on a cartoon. However, The SpongeBob Movie: Sponge Out of Water is not that great with the marketing being completely mislead. While the animation looks great, the story was painfully average, the humor was not as funny, and the characters are not at their best. The biggest flaw has to be the misleading marketing because the trailers will make you think that this film is mostly out of the water, but it turns out that they do not come out of the water until the last 20 minutes of the film. Unfortunately, the live action sequences are not quite as memorable as the 2004 film with SpongeBob and all the other characters being superheroes for most of their screen time outside of the water. Also, the story in the water is not good either and goes nowhere for the characters. Honestly, I could recommend this film to SpongeBob fans, but the previous film from 2004 was much better. This was a very average film that does not hold up well to the last SpongeBob film."
    },
    {
      "rating": "10",
      "text": "Spongebob is funny again and also Burger Beard    ."
    },
    {
      "rating": "10",
      "text": "A great movie, and a hilarious one. It has a great story line, and a LOT of humor, and there are even multiple things in the movie that are from older Spongebob episodes. I recommend seeing this right away - you will not regret it."
    },
    {
      "rating": "10",
      "text": "Zany, and the most quirky fun you will have at any movie. Sponge Out Of Water is a huge improvement over the first one. Sponegbob is Nickelodeon's king, it is the only reason Nick went out and made a movie for this. And believe me, it was satisfying. This movie looks and feels like it's for kids, but the humor is very adulty, and it seems like Nick wanted this to be like the first, older seasons of SpongeBob, quirky and fun. All the voices return from the show, but Antonio Bandreas played, really well, a pirate. This movie feels like a stoner drug trip, the effects are turned up so high, that the scenes move at a jarring pace. Sponge Out Of Water, kept me entertained and laughing during it's runtime. It is a a movie not only that kids can enjoy, but adults as well."
    },
    {
      "rating": "10",
      "text": "Want to know how funny this movie is? Some of the funniest jokes in the trailer aren't even in the movie! True, Instead of ALL the funny jokes from a movie going into the trailer.\r That pretty  much sums it up. go see this movie."
    },
    {
      "rating": "8",
      "text": "This movie is great! It's great to see spongebob back to his old self (the nostalgia is real.) This is really entertaining if your an new or old spongebob fan. In my opinion this doesn't really feel like an 1 hour 32 min movie, not saying this in a bad way, but it really feels like a 1 hour 50 min movie. One problem I have is that the superhero scenes are not as long as you think, it's at least 30-35 mins of it\r Pros-\rEntertaining\rStays true to the show\r Cons-\rSuperhero scenes are not as long"
    },
    {
      "rating": "10",
      "text": "It is Great and funny i love it do more movies of  SpongeBob Movies.!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "Engraçado e criativo. As metalinguagens que usaram no filmes foram muito inteligentes. O 3D foi muito bem aplicado e muito bem feito e de forma alguma atrapalhou os fãs do bob 2D. Outro ponto muito interessante são as referências e homenagens que o filme faz, como a dos golfinhos."
    },
    {
      "rating": "0",
      "text": "This is the WORST movie of 2015! EVERY joke falls completely flat. (Example: \"Aw, nuts! I'm out of nuts!\") The characters are wooden, the animation is ugly, and the script is an abomination. Any third grader could have written a better story than this. I loved The SpongeBob SquarePants Movie (2004). I love the television show. I cannot believe that The SpongeBob Movie: Sponge Out of Water was made by the same people! Whose idea was it to include the seagulls??? How the hell did the seagulls get approved by the writers, the director, the producers, or the studio executives??? Watching the scenes with the seagulls was akin to torture. My I.Q. dropped several points as a result of seeing this monstrosity of a movie. I tried to sleep, but the movie was so loud and obnoxious that I could not even get in a little nap! EVERYONE involved with this piece of detritus ought to be ASHAMED of themselves for cashing their paychecks. And what the HELL was Antonio Banderas doing in this movie??? This is where his career is at? Wow. And then, at the end, they throw in some half-assed rap songs with an island twist? Since when has rap EVER been associated with SpongeBob Squarepants??? JeeeeZuuuus! NOOOOOOO!!! See this movie at your own peril! Shame on you, Steven Hillenburg, Paul Tibbitt, Jonathan Aibel and Glenn Berger, shame on you! Give me back my 92 minutes."
    },
    {
      "rating": "0",
      "text": "This would be without a doubt the worst movie I have ever taken my kids to. Even they were bored and wanted to leave half way through. I dozed through it and my wife fell asleep 15 min into it. Given the calibre of movies coming out, Im stunned this is even being screened. Plenty of other flicks to spend your hard earned money on. Give this one a wide berth"
    },
    {
      "rating": "4",
      "text": "The animated gang faces a crisis when the recipe for Crabby Cakes goes missing. Their frantic search leads them on land to chase a human pirate (Antonio Bandares). As on the TV show, the cheerful pace never slows, but many of these jokes fall flat. I was hoping to find sly references or double entendres for my grownup sense of humor, but that didn't happen. The kids at the show only laffed out loud 2 or 3 times. While it's upbeat and frantic, not much was original or genuinely funny."
    },
    {
      "rating": "1",
      "text": "If you are an adult, bring the kids to watch this movie, but leave your brain at home.   I went to watch it because MetaCritic gave it a 63.  I left half way during tbe movie, because the \"Stupid Level\" reached it's peak, and I couldn't sit there anymore."
    },
    {
      "rating": "0",
      "text": "First of all, why in the name of satan would any critic like this movie? What are you critics on, marijuana? The story made absotivily no sense what so ever! You have a dolphin that came from a pink floyd triangle, Spongebob and Plankton made a time machine and they had the cgi for a little while and I was wanting to have that more in the movie. I have to admit the underwater animation was ok but seriously it hurt my eyes. I didn't even laugh except for the \"MY LEG!\" part. I didn't understand why adults liked it either and most of them hate spongebob and they were laughing at everything in the movie. Good GRIEF! OH and you people think that Strange Magic was weird. That movie was F***ing awesome. Way better than Spongeboob. Come on critics you guys make me sick. One more thing, my brother almost died of boredom. YES BOREDOM! And my grandma almost died to from the stupididty."
    },
    {
      "rating": "3",
      "text": "When I was a kid, I loved the episodes before the first movie, & the first movie was really good too. I still love those. But after the movie, the show started to lose its hilariousness & now the current season just makes me so mad. The Spongebob franchise is like Adam Sandler, its glory days were wonderful, but now I just can't stand it. So I heard this movie has the producers from the first three seasons, the only ones that ever, EVER happened, so is this movie good? Not like I wanted it to be. I saw it in 2D, but I could easilly tell when they went \"Hey! Look at our cool 3D! We're hip!\". It's not 2009 anymore, nobody gives a s*$&t! Plus,?most of the humor was comparable to Batman & Robin. Yes, I went there. The pirate was annoying & he had seagull buddies which were like Jar Jar Binks, & It wasn't any better than the current season of spongebob. I will admit the last third act was actually better than the first two & I thought the third act was going to be the crappiest part. Other than that, a few chuckles, Tom Kenny, Rob Paulsen, Kevin Michael Richardson, & a cameo by one of my favorite YouTubers were this film's saving grace. Since my rating can't be used for the score, I'll put my rating here & my score above. I give \"Sponge Out of Water\" 1.8 out of 5 stars."
    },
    {
      "rating": "4",
      "text": "Is it stupid, yes. Is it childish and annoying, absolutely. Does it at times kill your brain cells, of course. But SpongeBob believe it or not as some funny moments that make you believe for a few minutes that this pretty bad film isn't all that bad."
    },
    {
      "rating": "3",
      "text": "To start off i like spongebob cartoon. I gave it a 3 because my 5 year old liked it and it's not a the worst movie but def. not good one. A lot of bland and dumb jokes some of them fart jokes. The seagulls were a bad idea. Love antonio banderas but kinda corny in this one cuz of script. Really dumb story seemed written by a really young kid. Expected to see much more of the 3-d spongebob  because of trailers but was maybe last 20 minutes. I was actually starting to fall asleep btw part way through. Seems like the theater crowd was forcing laughs. And most importantly just missing some of the elements that makes the cartoon loveable and the ones that were there, were bland and forced. Don't recommend it."
    },
    {
      "rating": "6",
      "text": "Dis keik is a lai\rjal lai zri confirmed\riluminati qonfirmet\rBIBA BEJETA SIETE SIETE SIETEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE"
    },
    {
      "rating": "5",
      "text": "\"Would you hurry up? You're making the movie too long!\" This Overlong Movie made a lot of changes as they did in the trailer. I don't think kids could understand if the movie is too long. Then you'll child would say. \"it's not long, it's an 93 min Movie.\" Yeah, right. But good things about it it's Positive, some gags are funny, and Perfect 3D Effects."
    },
    {
      "rating": "5",
      "text": "This film is alright. The jokes are sometimes funny the story is okay and the 1 song is amazing.\rPros: good jokes, 1 good song, story, fight scene at the end.\rcons: spongebob and plankton are tortured in the film, most jokes arn't funny, bubbles sucks, super heroes only come in in the last 11 minutes and one of patricks worst apprences to date overall 5/10"
    }
  ],
  "recommendations": [
    "the_lego_movie",
    "chicken_little",
    "monsters_vs_aliens",
    "minions",
    "teen_titans_go_to_the_movies",
    "alvin_and_the_chipmunks",
    "the_three_stooges",
    "free_birds",
    "ice_age_dawn_of_the_dinosaurs",
    "peter_rabbit",
    "the_spongebob_squarepants_movie",
    "zombieland_double_tap",
    "night_at_the_museum_battle_of_the_smithsonian",
    "cloudy_with_a_chance_of_meatballs",
    "megamind",
    "alvin_and_the_chipmunks_chipwrecked",
    "the_croods_a_new_age",
    "ted_2",
    "barnyard",
    "hotel_transylvania",
    "jackass_presents_bad_grandpa",
    "captain_underpants_the_first_epic_movie",
    "hotel_transylvania_2",
    "sonic_the_hedgehog_2",
    "deadpool_2"
  ]
}