{
  "id": 568,
  "title": "The Shack",
  "starring": [
    "Sam Worthington",
    "Octavia Spencer"
  ],
  "runtime": 132,
  "genre": [
    "Drama",
    "Fantasy"
  ],
  "description": "After suffering a family tragedy, Mack Phillips spirals into a deep depression causing him to question his innermost beliefs. Facing a crisis of faith, he receives a mysterious letter urging him to an abandoned shack deep in the Oregon wilderness. Despite his doubts, Mack journeys to the shack and encounters an enigmatic trio of strangers led by a woman named Papa. Through this meeting, Mack finds important truths that will transform his understanding of his tragedy and change his life forever.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/doAzav9kfdtsoSdw1MDFvjKq3J4.jpg",
  "categories": {
    "plot": 4.846153846153846,
    "acting": 5.6923076923076925,
    "ending": 7.5,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 1.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Not sure what all the big issues are about.  The movie is a fiction representation of an encounter with God that aims to heal some deep seated pain and issues.  Nothing more....not trying to replace your God or your Bible....The book sold over 24 million copies...see the movie and decide for yourself but certainly don't miss it if you are broken, have issues and need healing !! For heavens sake....don't listen to the moronic movie critics....most wouldn't know a good movie or good content if it slapped them in the face."
    },
    {
      "rating": "10",
      "text": "I must say, I have a family and this movie touched my heart in a way that I haven't felt while watching a movie in a long time. Every man, woman and child on this Earth will suffer at some point , it's inevitable.  The message this movie promotes is belief that no matter what,  God's plan is greater than our comprehension... and God IS good.   No doubt,  due to the Christian nature of this movie,  the critics are extraordinarily critical on it (forgive the pun).  It's a great film experience and lends itself to those that are,  or have been,  broken."
    },
    {
      "rating": "7",
      "text": "The Shack is a refreshing Christian film that presents a lot of really cool ideas and interpretations of theology. The film boils down to two positive lessons: 1) Don't judge others and 2) Forgive others, especially when it is hard. The appearance of The Angel of Wisdom and the portrayal of God as a loving parent as opposed to an all-mighty judge was a really unique way to present The Lord on film, and I loved it. The Shack is very uplifting if a little kitschy at moments, but overall the cast handles the subject matter incredibly well, and there are some beautiful shots. If you're looking for a pick-me-up then The Shack is definitely for you."
    },
    {
      "rating": "5",
      "text": "Has a couple of profound moments but is mostly quite confused and lacking in discernment. Worthington is goodish."
    },
    {
      "rating": "10",
      "text": "If you do not believe in evil - ask yourself how almost 100% of movies with a Christian theme/message get rating destroyed by 1) The \"Professional\" Critics & 2) People who log in just to slam it (it makes one question why they would go see it in the first place - if they even did).My opinion; The Cast - all seasoned actors and did a very good jobMost importantly there were two messages to take away from the whole movie;1) That people should not judge2) To forgive the unforgivableYet the slammers - slam - perhaps they should see it again and try to get the message.The movie is worth seeing and the information projected is quite complex if you have the aptitude to want to understand it.I am rating it a 10 to counter the unfair attack the movie gets from people that seem to have a cause against God..."
    },
    {
      "rating": "0",
      "text": "Weak movie. I did not believe a single character of the film, although very good actors take part in the film, but in a talentless scenario, the actor's talent is completely helpless."
    },
    {
      "rating": "2",
      "text": "If you want to make your Friday more interesting, how about you go see either a different movie or just do whatever you do in common because The Shack isn't worth seeing or even worth sending a little penny. I'm like serious, The Shack never attempts to shine in any sort of way and the actors were killing themselves during production of this film."
    },
    {
      "rating": "0",
      "text": "all about christology and how to get in forcing you to believe they are the right path... Deplorable how they use fanciful method to deceive people, appealing to family tragedy sounds even more decadent"
    },
    {
      "rating": "1",
      "text": "terrible cheap exploitation of so called Christian values. bad bad badcheap predictable hate how they tried to exploit certain themes oh but tried to remain \"political correct\" God is black woman and you thought that this would make it fly better?"
    },
    {
      "rating": "1",
      "text": "A masterpiece of cringe-induction. Another one of \"christian movies\" made for a closed circle of happy believers to empower their ideology, while making it looking ever more ridiculous for anyone else."
    },
    {
      "rating": "2",
      "text": "Truly horrible save for a decent cast. I suppose the sequel will explain why the Christian god is the right one, and how its pivotal event 2000 years ago on this tiny planet reconciles with a 15 billion year old, 2 trillion galaxy universe."
    },
    {
      "rating": "10",
      "text": "Best movie ever. Only downvoted because it has a high religious meaning, and people often feel attacked when they encounter religion, since they are anti-religion"
    },
    {
      "rating": "3",
      "text": "Bom , esse e um filme que tem uma historia boa e tinha uma grande chance de dar certo so que na minha opiniao fi um fracasso / Bom o filme tem um visual legal ( em algumas partes chega a ser horrivel ) / Eu achei a atuações ruims ( menos da Octavia Spencer ) / Um filme que teoricamente era pra fazer todo mundo chorar e acabou nao acontecendo isso na minha sala quase ninguém chorou só umas 5 pessoas  / Emfim filme religioso não faz meu gênero , eu acho que esse filme foi mais focado para as pessoas mais velhas ou que leram o livro e gostam de religião  / Mais no aspecto Cinematográfico o filme e um fracasso"
    },
    {
      "rating": "3",
      "text": "If forgiving is that easily convincible, then welcome to the crime world!A novel based film. A religious themed film. It has a message, BUT could be a bad message for today's world. Because how the event was dealt with the story only encourages the crime, in reality. Wise people can say philosophically, morally, but not means every words practically applicable. The common people would get affected more. Other than that, I have no grudge on anything. If it has been just a fantasy and an entertaining film, excluding that Christian thing, I would have liked it better.It was more like another 'What Dreams May Come', but less visual spectacular. On the other hand, there was an uneasiness in the development of what happened in the early stage of the story. They did not go for the detail, from the crime perspective, hence that mysterious event holds the key which we don't know exactly what happened to judge anything out of the film. So that part reminds 'The Lovely Bones'.The story of a father whose little girl mysteriously disappeared on a camping trip. Now the struggling father to cope with the incident gets an invitation to meet the creators. His journey to the other side of the world, where he goes through a series of unexpected tests, and at the end, how his character changes are told in those remaining parts.Worthington, Spencer, everybody was good. But the story is what I did not like. Like it was aimed for Christians only. But I believe not every Christian would agree with this story. I felt it was an unnecessary film. If it was fun like 'Bruce Almighty', the whole world would have enjoyed it. Too serious and very not acceptable message led this film to fall. No, it is not worth a watch for people with the open mind, unless this is what you were looking for.3/10"
    },
    {
      "rating": "4",
      "text": "This is such a bizarre movie, and not because of the religious/spiritual elements. The acting is actually pretty good and the plot isn't terrible, but just about everything else in the movie is. I think the editing was the ultimate downfall of this film. Just a strange film, that had potential and didn't at the same time. Hard to put my finger on it."
    },
    {
      "rating": "8",
      "text": "The Shack. Father, Son and Holy Spirit. The first experience of watching a drama with a Christian bias, and despite the negative reviews from critics and viewers, I really liked the film. The film is quite good at trying to convey the general essence of the Bible and God's attitude to everything that happens in the world. All the main characters do an excellent job with their roles and show all the pain and suffering from the loss of someone important in their lives. It is also a very beautiful movie in places, and all the landscapes look like they are alive. Of course, The Shack doesn't try to explain the entire Bible, but it does answer some questions. But there was only one question left by the end of the movie, where is Skillet's song \"Stars (The Shack version)\"?"
    },
    {
      "rating": "8",
      "text": "The film that explains the essentials about God, from the point of view of most Christians.All films have their target audience. There are no films designed to please everyone, even the most generalist. This film is, in essence, Christian. Therefore, it will not please atheists or the vast majority of non-Christians, and it does not seem to me to have been designed to convert atheists or other people to a belief or religion. It is a Christian film, yes, but aimed at those who, at least, believe in God and Jesus as His Son. And this is how I think this film should be analyzed, if we are to be fair and rigorous. Of course, I'm a Christian (I'm actually a Roman Catholic) and I go to Mass on Sundays. My view of this film will not be the same as that of a Christian who does not practice his faith collectively, or of a Jew, or of a person who believes in God but has a more Gnostic view, or a more abstract view of Him. Therefore, I will speak only from my perspective.The script is quite good: Mack was responsible for the death of his violent and alcoholic father; then, already married and father of children, he has his youngest daughter kidnapped, apparently raped and killed by a child molester. Nor was the body found. For all this, Mack blames God, accusing Him, and sinks into his own pain. A while later, he receives a mysterious note, signed by \"papa\" (as he called God), asking him to meet him at the house where everything happened.To begin with, the film makes an excellent use of the text and the symbols present in the Bible without, however, sticking too much to the sacred text. One thing I noticed when watching this movie with my girlfriend was that God is truly explained and the film answers a lot of questions and doubts about God and the way He acts. Another thing that is explained is that God is not the cause of evil. People choose evil, and God respects the choices they make. God does not present himself in one form, he can assume the face he wants and he reveals himself in the form of his three distinct people: the Father, Jesus and the Holy Spirit, incarnated in people of both sexes and different ethnicities, symbolizing how universal it is God: God is God of everything and everyone, and loves even those who do not believe in Him. What happens in this film is a whole process in which God acts visibly in a person's life ... it's what we call a miracle.I confess that I enjoyed seeing Sam Worthington in this film more than in others he did, like the \"Titans\" films he starred in. I think that here he had more space to show talent, since most of the film is based on dialogues between his character and other characters. Octavia Spencer and Graham Greene embodied God the Father in a masterful way. Israeli Avraham Aviv Alush and Japanese Sumire were equally good at bringing the two other people in the Trinity to life. As I said above, the choice of men and women of different ethnicities to give body to God was intentional and probably shows that God embraces everyone ... I don't think it was a choice based on the politically correct as I have read elsewhere. Anyway, the film is not a dramatic interpretation show, but it has its moments and a committed cast.I am not a fan of Christian or spiritualist films, but I must recognize that this film has quality. At no time did I feel that I was listening to a Sunday sermon or the film was trying to preach anything. It is not a film made to convert nor was it made for unbelievers, but it is also subject to being loved or hated, rather than understood. But that is the price to pay for taking up such a delicate topic."
    },
    {
      "rating": "10",
      "text": "This film is the most important film ever to have been released. It has the potential to change the attitudes and beliefs of ordinary people worldwide and for generations to come. We are currently living in a world which has very little time for God. Instead we spend our entire time judging other people and imposing on them our own man-made moral standards and definitions of what is right and wrong. Unfortunately the religious establishment has largely colluded in this process. Through its doctrines of dogmatic biblical literalism, loving families are being torn apart as people grieve because they believe their loved ones died unsaved and are forever in hell. This film confronts this cruel philosophy head-on by portraying God as the truly loving and forgiving God that we know through Jesus. It speaks directly to our hearts in a beautifully creative and quite original way and has the potential thereby to change millions of people's lives for ever. And that is something that no film has ever succeeded in doing."
    },
    {
      "rating": "7",
      "text": "I think it probably helps to be open minded if your likely to take much away from this film - its one that requires you to suspend disbelief somewhat. On the plus side, it features some quite pretty scenery, with brightly coloured plants/foliage and some beautiful starry skyscapes.There must have been a fair bit of money spent on CGI surely - you can tell what isn't real but the effects are pretty decent regardless.It is potentially quite thought provoking but I imagine it is hard for some people to take seriously given the plot. Its obviously intended for a Christian/religious audience, which will likely put off other audiences. There is a definite cheesiness present but yet I felt like by the end of the film, I really wanted the best for the main character and I was somewhat emotionally attached to the characters and I liked some of the sentiments. Do I fully believe every sentiment 100%? maybe not but I felt the film is still, at its heart, a good film. I imagine it has got, or will get, a lot of criticism but I liked something about it - I suppose a well (well enough?) meaning film about trying to see the bigger picture, dealing/coping with the aftermath of sad things, accidents, tragedies.This is a film that won't be for everyone by any means but for what it is, its relatively good."
    },
    {
      "rating": "8",
      "text": "Now I'm not religious and I went into movie having listened to the book in audio book form when I was 14.Overall it's an enjoyable film with good acting, actors/actresses, good scenory/locations and overall it's a very good adaption of the book which takes a very interesting approach to God.But what stops this film from being a 10 for me is the ending, it's cut short from where the book ends. In the book they find Misy's body in real life showing what Mack saw has merit, it was such a let down after a really good movie that made me cry.Anyways the people here saying it forces Christianity down your throat is a wee bit too dramatic, it's about Christianity but the lessons it tries to teach you can be applied to real life whether you're religious or not, forgiving is not forgetting, we shouldn't judge others."
    }
  ]
}