{"id": 4044, "title": "The Pink Panther", "starring": ["Steve Martin", "Jean Reno"], "runtime": 93, "genre": ["Comedy", "Mystery", "Crime", "Adventure", "Family"], "description": "When the coach of the France soccer team is killed by a poisoned dart in the stadium in the end of a game, and his expensive and huge ring with the diamond Pink Panther disappears, the ambitious Chief Inspector Dreyfus assigns the worst police inspector Jacques Clouseau to the case.", "releaseYear": "2006", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/57ViRkdsddHLK32W8Nf3ZPLSAu4.jpg", "categories": {"plot": 4.333333333333333, "acting": 3.9375, "ending": 2.0, "soundtrack": 2.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 6.972972972972973, "action": 5.0}, "reviews": [{"rating": "6", "text": "Parts of the slapstick comedy were laugh out loud funny...Martin was good recreating Sellers' role. Some scenes were too long(i.e. learning to say hamburger, confrontation at airport security). Jean Reno & Kevin Kline were good in supporting roles. Nice form of escapism."}, {"rating": "1", "text": "Being a big Steve Martin fan, I was predisposed to like this movie despite the weak reviews. What a disappointment! Where can I start? Steve Martin's accent and lip pursing were SO wrong. And at the very least, he should have dyed his hair black to match the mustache.....or made the mustache white to match his hair. He seemed \"fake\" from the start because of this simple problem. Sad to see him this way. Kevin Kline, too. Why do great actors take such roles? I agree with some reviewer who said that Kline might have made the better Clousseau; but he seemed pretty wooden in this role. Yes, there are a lot of laughs to be had from the physical comedy, but the dialogue and the acting were almost painul. I had been looking forward to this movie ever since I heard Steve Martin was making it. Again, what a disappointment."}, {"rating": "1", "text": "It's not funny. Peter Sellers does it 100 times better than Steve Martin. The movie is a shame for the Pink Panther series."}, {"rating": "2", "text": "Steve Martin has finally hit bottom. I guess he can only go up from here, right? I'm not so sure. If you had seen any of the Sellers Panthers your only reaction could be to cry, not laugh."}, {"rating": "0", "text": "ONE OF THE WORST MOVIE I'VE EVER SEEN! Not even close to the original. Steve did a bad job. Kevin Kline would have been a much better choice to play Closeau."}, {"rating": "9", "text": "I went into this movie expecting not much based on disapproval from critics. But I was highly entertained from the very start. Hilarious right through. Despite low numbers, the cinema still erupted with laughter like a live comedy show. Steve Martin certainly lives up to Peter Seller's Clueso and is one of his best performances to date. Pink Panther is meant to be silly, humerous and fun... This movie does it very well, don't get too tied up comparing the old with the new and enjoy yourself. Two thumbs up .. BEST comedy so far of 2006."}, {"rating": "0", "text": "What an insult to the master Peter Sellers. He must be turning in his grave, absolute drival."}, {"rating": "0", "text": "This is the worst movie i have ever seen, and is milking the title that Peter Shelers built from the ground up. Only to have Stevey tear the name down!"}, {"rating": "1", "text": "Utter disappointment. The only way to be a successful Clouseau is to imitate Peter Sellers. Mike Meyers would have been ideal as Clouseau--besides, he's a great fan of the original series; Jason Alexander would have made a good Dreyfus (Herbert Lom, in the original movies, didn't need a strong French accent--it's the temper that made Dreyfus who he was); Jackie Chan could have portrayed Cato (who was just as inept as Clouseau--is supposed to attack Clouseau, not the other way around). Moreover, we don't need to resort to jokes with innuendos and flatulence to make Clouseau funny."}, {"rating": "10", "text": "A great movie for me. Wonderful. Great. I loved it."}, {"rating": "10", "text": "This was an entertaining movie and deserves a 100 I think steve Martin did a captivating job, playing Clouseau.This a movie people will remember for ages!"}, {"rating": "9", "text": "Very few movies have me laughing as much as this one did, one of Steve Martin's best, my only complaint with this movie is the topic of sex being brought up, which may make some parents not want to show there younger kids this movie, but for older audiences (teens to adults) it's a HILARIOUS movie I recommend."}, {"rating": "6", "text": "Doesn't deserve all the bad press it got.  Sure, it's a dumb comedy with a ridiculous plot (what soccer trainer tries to kill a pop star because she went out with two other guys?), but many of its jokes are very funny, and at the very least it's not a worthless waste of two hours like its sequel."}, {"rating": "2", "text": "Absolutely awful If Steve Martin thinks his movie is any good then should play a different character in a different story other than Inspector Clouseau and the Pink Panther movies with Peter Sellers. I say this because those not familiar with his predecessor think this movie might be good, they ought to watch this as a standalone movie about a different character unrelated to the PINK PANTHER movies !!! what a shame for Peter Sellers a lost opportunity to follow on from his films."}, {"rating": "8", "text": "I know it wasn't Sellers, and I knew it going in, Martin and Kline pull off a good movie if you leave the preconcieved notions of what Sellers did. Martin is his own talent and pulls off a good movie."}, {"rating": "5", "text": "Let's be honest, Peter Sellers will always be \"The\" pink panther. Still, if anyone could pull off a refreshing visit with this long lost friend it would be Steve Martin. This movie doesn't dispel the judgment that Martin remains among the funniest people in the business; however, it does reveal that he should start picking his scripts more carefully. This screen-play did not tap into bumbling character personified in Sellers. It is little more than slap-stick comedy with few novel gags. Like many \"comedies\"? this film tries to make us laugh with sophmoric, toilet humor. Martin doesn't need it to be funny. Consequently, the Pink Panther remains where he should be: laid to rest as one of the great comic characters of the 70s. Steve Martin remains where he has been for some time: looking for that script that resurrects his comic genius."}, {"rating": "8", "text": "Look... this movie isn;t going to win any awards... that's for sure! But, it does have its moments. Steve Martin pulls off this cahracter as good as anyone could have. I would have like to see somebody other than Beyonce play her part. I think her character was extremely dull and almost out of place. If you want a good comedy that's as good as anything you've seen before... then this is it!"}, {"rating": "9", "text": "Oh, give me a break! This movie was not that bad. It had a lot of really, really funny gags. Granted, some relied on gross-out humor. However, if I were to select someone to fill the great Peter Sellers' shoes, Steve Martin is exactly the guy I'd pick. My only real complaint is that they didn't give Kristen Chenoweth's character enough screen time. Otherwise, a fall-down funny film."}, {"rating": "7", "text": "Okay, Steve Martin is not Peter Sellers, but this film is an enjoyable way to pass the time. Jean Reno and Kevin Kline are great and Martin is pretty good if you're not spending all your time making unfair comparisons. Go with low expectations and you'll be very pleasantly surprised."}, {"rating": "1", "text": "The only enjoyment I got out of this movie came from the contributions by Clive Owen and Jason Statham. Oh and Beyonce was hauntingly beautiful as always. For these reasons alone I give this a 1. This should be avoided by all."}, {"rating": "10", "text": "This movie is great! It isnt handled as well as the old Pink Pathers but is still very good. The two worst parts were at the beginning which i think accounts for most of the peoples dislike of the film with an over exagerated parellel parking scene and a very poor scene with martain the Inspecter passing gass. Other then that it was one of the best commedies I have seen in years."}, {"rating": "6", "text": "Of course it wasn't peter sellers, but if you gave me a choice of seeing this or king kong again- it'd be simple, this was more interesting, less obnoxiously loud, and shorter!"}, {"rating": "10", "text": "That was the best comedy show I ever saw in years! I almost died of laughing!The oringinal one sucks!"}, {"rating": "10", "text": "I really enjoyed the film. At first, my friends agreed to come watch it with me only because I did them a favour, they were not exited at all. I must say, even my friends, who are really difficult to please sometimes, they absolutely loved it! I'm with them, and I would 100% rate it 10. I can't wait till it comes out in the Czech Republic, I will get it straight away at any price. Really top class movie, must say."}, {"rating": "10", "text": "The Pink Panther once was a TV Show, hilarious series of films, and classics too. And now Steve Martin, who probably is the only perfect Inspector Closeau you can possibly find nowadays. Steve Martin, also screenwriter of this motion capture brings us a silly rally of fun, quirky humor, set of events, and attitudes. Coleau couldn't be any stupider than this but I never knew he could actually solve a case. Some might say it is disappointing how he solves the case, but I think it just brightens up script. The case, which is easy enough for a 5 year-old to uncover, is simply magnifying, intelligent, and smart, and its reliance of quirky fashions to juice things up. It retains to its style, and its characters. The plot is short, and has cheesy moments, but it succeeds. At Steve Martin's finest work, Shawn Levy (also a film critic) directs like nothing he has ever done before. It may be something you probably only enjoy once watching, but literally, it ain't crap. It s actually a lot of fun."}, {"rating": "6", "text": "This movie was surprisingly funny, although i thought the storyline was bad. But what moved it from a 10 to a 6 was Steve Martin's accent. That got so dam annoying and was pathectic. Heres an impression. \"Ahh woo lie toooo baii a derberger!\""}, {"rating": "8", "text": "Steve Martin did a good job of taking the subtle, quieter humor of Sellers' Pink Panther, and making it a bit more zany and slapstick for today's audience. Am I happy this had to be done? No, but if you're going to do it, do it right, and I think they did."}, {"rating": "9", "text": "I don't know whats up with the reviews. I mean, it was HILARIOUS! His accent cracked me up throughout the whole movie, and the Hamburger scene was priceless. I loved it. Me and my friend both laughed our asses off."}, {"rating": "9", "text": "Comedies these days have become far too predictable with gross outs and other modern techniques, but Steve Martin with vast years of experience and talent, really knows the genre of comedy. From slapstick, melodrama, parody, satire to the most subtle of facial cues , Steve can do it all. A comedy that can appeal to a wide range of age groups and people needs a good mix of comedy types, and Steve delivers on all  levels. A great film for sheer talent. A tribute to Sellers."}, {"rating": "4", "text": "The Pink Panther has its really funny moments, and i mean really funny but besides those scenes everything was unimaginative, stupid and terrible acting. beyonce was a disgrace."}, {"rating": "7", "text": "To say I wasn't entertained by this movie would be a lie. It was funny, and I don't care how over the top ridiculous at times it got, it still managed to make me laugh and enjoy myself."}, {"rating": "0", "text": "When you see how Steve Martin completely messes up his interpretation of Clouseau, you start to realise how incredible gifted Peter Sellers (the one and only Clouseau) was."}, {"rating": "2", "text": "\"Always look on the bright side of life,\" sang Monty Python during the crucifixion in Life of Brian. And so, in keeping with those musical words of wisdom and applying them to Steve Martin's virtually laugh-free remake of the popular Inspector Clouseau slapstick farces of the 1960s and 70s, I will now endeavor to catalog a few rays of sunshine peeking out of this almost total eclipse: 1.) Its release gives MGM a promotional excuse to release a box set of Pink Panther cartoons, which with the dismantling of Warner Bros.' and MGM's theatrical cartoon wings and the slowing down of Disney's, provided almost the only new animated character to do a series of big-screen adventures in the 60s, some of which are little masterpieces of dry wit and stylish graphic design. 2.) Since Sony/ MGM chickened out of its original plans to release this movie last summer, it didn't have to compete with The Longest Yard and Bad News Bears for the title of Crappiest Non-Horror Remake of the Year, and it's got the field very nicely sewn up for 2006! 3.) It's great to hear Henry Mancini's seminal theme music played in the big screen again (even if the accompanying opening credits animation, featuring a Martinized Clouseau, is just as substandard as the rest of the movie). 4.) Emily Mortimer (Match Point) almost singlehandedly rises above the muck, adorably playing a Gallic Miss Moneypenney with beguiling bemusement--and, unlike Martin, doing a comic French accent that works. 5.) Clive Owen, in an unbilled cameo as Agent 006, proves ONCE AGAIN that he's the rightful, unjustly robbed heir to 007. 6.) Even though Blake Edwards, the creator and director of the original Pink Panther movie series, has always struck me as an overrated comic talent whose humor is too often rather smug and mean-spirited (his best film was by far his most uncharacteristic one: the harrowing 1962 alcoholism drama Days of Wine and Roses), the total ineptitude of Shawn Levy's take on the material gave me a new appreciation of everything Edwards did RIGHT. Edwards' slapstick-and-destruction sequences were always carefully and meticulously structured and made perfect sense in their own farcical universe; Levy's comic effects either come out of no logical place or, worse, are painfully predictable. The original Edwards' Panther comedies (which many people feel peaked with A Shot in the Dark in 1965) worked surpisingly well as mysteries, too: you could logically deduce whodunit from the clues given you if you weren't being too distracted by Clouseau's antics, while the solution to Levy's puzzle is maddeningly arbitrary. Worst of all is the character of Clouseau himself as written, directed and acted here; he's a total betrayal of everything Edwards designed him as being. Originally a brain-dead bumbler who either stumbled onto the culprit totally by accident or had someone else solve the case while he tripped over something, as played here he's required to leap approximately 78 I.Q. points in the final stretch, solve everything, and become the hero even though in 75% of the movie he's clearly shown as tragically unable to plumb the hidden mysteries of a can opener. And Peter Sellers' genius at becoming completely invisible within his characterizations (illustrated in the HBO TV-movie The Life and Death of Peter Sellers, starring Geoffrey Rush, it's a talent that served Sellers even better in Dr. Strangelove and Being There) worked beautifully in the role of Clouseau; Martin indulges his old stand-up comic's tendency to stand outside the role and loudly comment on it. The result, besides being thoroughly obnoxious, is a complete besmirchment of a character and performance he's allegedly paying tribute to. (As though to compensate, Kevin Kline and Jean Reno, normally sterling comic talents, underplay to the point of flatlining.) 7.) Going back to the bright side, I DID, owing to a coupon I got in the aforementioned cartoon box set I bought, get into this movie for free, but you know what? I STILL think I was overcharged!"}, {"rating": "4", "text": "You know i dont want to be cruel but this movie was the funniest movie of the year so far but comedy can only go so far in my reviews."}, {"rating": "8", "text": "I have no idea why the critic score of this movie is so low. It's not amazing at all, but it's still a funny movie. It does what it was made to do, entertain you. Personally, I've never seen anything of the Pink Panther series, but looking at this movie as a newcomer it was fairly good."}, {"rating": "4", "text": "It's only slightly amusing with average performances and a forgettable plot."}, {"rating": "7", "text": "The Pink Panther is a rather incompetent remake, relying on toilet humor and Steve Martin's horrible French accent to win audiences over. But as much as you hate to admit it, it is quite funny at some parts."}, {"rating": "10", "text": "Love the humor in this movie! It's sure different from the poor slapstick crude vulgar humor that is all too common now. For once a comedy without the use of swearing or sexual scenes."}, {"rating": "7", "text": "It is very simplistic form of slaptisck comedy that does a comic genius in the form of Steve Martin portraying Jacques Closeau. Jean Reno is by far the dark horse in terms of his supporting act and Emily Mortimer as Nicole is the perfect French secretary who leaves a fading memory of wanting something so much without never realizing it till its too late. Put your level-headed logic under the pillow of your bed and enjoy the hell out of it because that's how it works."}, {"rating": "8", "text": "The movie is a hilarious comedy for the whole family. Even thought the comedy is mainly derived from the main character, Inspector Clouseau being a idiot."}, {"rating": "1", "text": "This movie sucks I was hoping for a movie with the pink panther but not some mystery with a diamond i would probably enjoy it more if pink panther was trying to solve the mystery with him but no they didn’t do that and I don’t know how people like this movie"}, {"rating": "8", "text": "The pink panther = 8/10............................................................"}], "recommendations": ["ace_ventura_pet_detective", "ace_ventura_when_nature_calls", "get_smart", "role_models", "dodgeball_a_true_underdog_story", "zack_and_miri_make_a_porno", "the_wedding_ringer", "spy", "the_longest_yard", "tropic_thunder", "grudge_match", "forgetting_sarah_marshall", "due_date", "horrible_bosses", "johnny_english", "date_night", "zoolander", "scary_movie_3", "mortdecai", "get_hard", "austin_powers_in_goldmember", "tower_heist", "murder_mystery", "horrible_bosses_2", "bean"]}