{
  "id": 4842,
  "title": "The Lovers",
  "starring": [
    "Josh Hartnett",
    "Simone Kessell"
  ],
  "runtime": 109,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction",
    "Romance"
  ],
  "description": "The Lovers is an epic romance time travel adventure film. Helmed by Roland Joffé from a story by Ajey Jhankar, the film is a sweeping tale of an impossible love set against the backdrop of the first Anglo-Maratha war across two time periods and continents and centred around four characters — a British officer in 18th century colonial India, the Indian woman he falls deeply in love with, an American present-day marine biologist and his wife.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6esL8UH2sXXqbfbaV6bFEUBCDOr.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 3.857142857142857,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "For such cosmetically grand movie, The Lovers is unbearably bland. In a way the movie reminds me of Jackie Chan's The Myth. Both follow the story of a researcher in a quest to find ancient artifact. Along the way his consciousness is mysteriously and magically transported across space and time. Thus, he relives the past life in awkward parallel perspective. It has all sorts of epic romance fantasy elements, all of them are merely skin deep, and most importantly it lacks any charm on the characters.\r The main problem is the movie tries so hard to pack beautiful scenery, it sporadically shift sequences without establishing the character in any meaningful manner. First act alone sees myriad of subplots, it immediately enters a conspiracy, political and love banters. Note that it opens with two different timelines and stories, so when the movie introduces predicament so suddenly, it barely gives any sense of familiarity for the characters and audience probably wouldn’t care much for them.\r Writing is similar to astrology reading, fortune telling, or straight up fortune cookie gibberish. It wants to be a romantic lore, yet it sounds very pretentious with its \"love conquers all\" cliché. This ultimately ruins the characters as even though the cast is good, the material barely give them any depth or recognizable trait other than fantasy wannabes. The drive for relationship is simply absent.\r It doesn't create momentum, and the drab pace continues, or even worsens towards the end. It's as though the vistas are the actual star and these people are the background. There are some good views here, it's clearly an above average production with costumes, intricate sets and occasional action scattered between. However, without amiable personalities, it becomes a boring escapade with cheap plastic romance.\r Flair for aesthetic won't help much if the core human drama is overwhelmingly barren."
    },
    {
      "rating": "3",
      "text": "There was a good movie buried somewhere deep in there, but it never came out. The post-production process must have been a mess, as everything was jumbled and largely nonsensical. A shame."
    },
    {
      "rating": "5",
      "text": "Two women's efforts from two different timelines to save their loved one.\r It was in the pre-production for over a decade, before reshuffle and recasting happened with the existing one. It was supposed to be an Indo-Aussie joint production, but later the Belgium production company joined the project. After the several hurdles it managed to get completed. It was an Anglo-Indian historical romance-drama, during the British raj in India about betrayal, coup, revenge and a journey movie. Also simultaneously set in the modern world focusing an archaeological couple who discovers a lost ancient Indian jewel in a shipwreck. From there the story gets a perfect beginning, later moves back to India.\r I don't understand what's with the Chinese music where the actual story take place in the 18th century India. It was so good and blends well, but that does define India or Indian culture while narrating its story. If you are not familiar with both Chinese and Indian musics, then it's not an issue at all. But that does not it, the names are Hindu and Indian soldiers with the Persian costumes, swords and other gadgets.\r How the name 'Dragon's Throat' came to Indian geographical area and surname for the Indian characters in a wrong princely state. Like that, many stuffs make no sense, especially if you are from that part of the Earth. I think the research was very poor for making this movie. They should have hired an Indian musician and costume designer with an historian.\r \"Love has many faces,\rand one of them is jealousy.\"\r The quality was top notch, the cast and their performances were excellent. But I could not stand for Bipasha Basu's facial expressions. She was always been in a sad face look, so depressing. That is the way her character was developed, so nothing wrong in her display. It was her international debut flick as well, and the launch was so disappointing. Because the story was very weak, maybe very silly. I have never seen the narration set in the ancient India other than in the Indian films. Quite amazing locations, and convinced with the visuals that how the 1700s' subcontinent would have looked like.\r The major problem with this flick is that people can't get ending. How the time barrier was broken to pass through another timeline was never explained. The Hindu priest/saint/sadhu who blabbers about the space and time was a ridiculous than intellectual briefing. So this film owes lots of explanation to the viewers than entertaining them. I want to favour it, but I also want to be honest. The film was not like I was hoping for, very excited for the merge of historical subject with sci-fi, but did not stand tall. Thankfully, either it was not a bad movie of the year, I've seen even worse that I felt not to review. I won't recommend it, but there's a slim chance that you might like it, so choose it carefully.\r 5/10"
    }
  ],
  "recommendations": [
    "the_33",
    "dances_with_wolves",
    "the_eagle",
    "centurion",
    "alpha",
    "agora",
    "mortal_engines",
    "upside_down",
    "hostiles",
    "samson",
    "the_lost_city_of_z",
    "high_life",
    "nomadland",
    "frantz",
    "avatar",
    "the_last_duel",
    "20th_century_women",
    "the_aftermath",
    "stargate",
    "seven_years_in_tibet",
    "dawn_of_the_planet_of_the_apes",
    "the_nutcracker_and_the_four_realms",
    "free_state_of_jones",
    "master_and_commander_the_far_side_of_the_world",
    "tulip_fever"
  ]
}