{
  "id": 83,
  "title": "The SpongeBob Movie: Sponge on the Run",
  "starring": [
    "Tom Kenny",
    "Bill Fagerbakke"
  ],
  "runtime": 95,
  "genre": [
    "Family",
    "Animation",
    "Fantasy",
    "Adventure",
    "Comedy"
  ],
  "description": "When his best friend Gary is suddenly snatched away, SpongeBob takes Patrick on a madcap mission far beyond Bikini Bottom to save their pink-shelled pal.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jlJ8nDhMhCYJuzOw3f52CP1W8MW.jpg",
  "categories": {
    "plot": 6.3125,
    "acting": 7.8,
    "ending": 6.2,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 8.0,
    "funny": 7.75,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "pretty bland story (it’s a rehash of the first film), but it has amazing animation and Keanu starring as a wise tumbleweed. your kids will eat it up."
    },
    {
      "rating": "8",
      "text": "um filme muito...esperava um pouco mais ,ele não é nem um pouco ruim, e a animação é simplesmente linda ,mas me lembra mais um episodio normal só que com uma hora ,mas mesmo esperando mais, é muito bom e divertido"
    },
    {
      "rating": "4",
      "text": "It seems more like an episode of 90 minutes of spongebob more than a movie because is bored even the cameos of Keanu Reeves and Akwafina can save this movie."
    },
    {
      "rating": "7",
      "text": "Pleasantly surprised. I was a bit worried going in because it’s 3D animation instead of the traditional flat, but the story and humor (mostly) stay true to the heart and soul of the franchise."
    },
    {
      "rating": "10",
      "text": "Absolutely nonsensical, tons of good fun, silly as can be, and exactly what I'd expect and hope for going into a spongebob movie. The animation is gorgeous, to boot. Overall, very pleasing to watch, and quite enjoyable for the whole family. Very true to what Spongebob should be and always has been. Can't say much for the plot, but it definitely had me giggling and grinning the whole time."
    },
    {
      "rating": "10",
      "text": "GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD"
    },
    {
      "rating": "10",
      "text": "GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD GOOD good"
    },
    {
      "rating": "10",
      "text": "Sponge On the Run Is A Cute Little Kids Movies But This Movie Might Aimed Too Much For Kids Which Is Not Bad"
    },
    {
      "rating": "8",
      "text": "Great songs, plenty of humour for adults. Keanu and Snoop. What more can you want for your kids? Lovely story too. Great film."
    },
    {
      "rating": "7",
      "text": "душевная история, которая раскрывается только в конце фильмасначала - я даже не хотел смотреть этот фильм а теперь, а готов поставить ему твердую 7ку"
    },
    {
      "rating": "8",
      "text": "E-Value: 8Acting: 8Plot: 6Due to the COVID-19 pandemic which forced the theatres to close down until further notice, the third SpongeBob theatrical movie was released digitally on Netflix outside of the USA while Canada have a theatrical release three months ago.It is a fine and normal day in Bikini Bottom until Mr. Krabs’ archnemesis and business rival, Plankton, tries to steal the Krabby Patty formula once again. However, his plan keep getting indirectly ruined by SpongeBob SquarePants (Kenny), who is totally unaware of what is going on. While trying to find a way to get rid of SpongeBob, Plankton come across a royal decree from King Poseidon (Berry).According to the decree, King Poseidon demand a snail for his own use. Taking advantage of this, Plankton abduct Gary and deliver him to the king knowing that SpongeBob would look for him. As expected, SpongeBob soon discovers Gary’s disappearance and leaves Bikini Bottom without telling anyone.With the help from his best friend, Patrick Star, they go on an adventure to rescue Gary from King Poseidon, who resides in the Atlantic City. Along the way, they receive some guidance from Sage (played by Keanu Reeves) to help them in their journey.Some people say a third movie is always the worst chapter in a trilogy. In this case, The SpongeBob Movie: Sponge on the Run is not one of them.  This movie still retains the same charms from the first two movies and the TV series. The movie is filled with humours and heartwarming moments along with some character developments. Despite the movie transition from traditional 2D animation to CGI animation, it does not ruin the experience of watching this movie. That said, the animation is great and well done.As for the cast, everyone has done a great voice acting performance and it’s really great to have everyone from the TV series to reprise their role for the movie unlike Scoob! which was released few months ago. It is also great to see some celebrities making humourous cameos in the movie. Keanu Reeves once again stole the show by proving to everyone that he can play a comedic role just like his voice role in 2019’s Toy Story 4.Although this is the third movie, you don’t actually need to watch the first two movies to understand this one. The plot is completely standalone and have nothing to do with previous two movies. However, the plot of this movie is not exactly new or original because this movie rehash a similar plot of the first movie. Two characters go on a journey to another city retrieve a McGuffin that triggers the event of the movie. Nevertheless, the movie is still fun to watch and I definitely recommend this movie especially if you are a fan of SpongeBob."
    },
    {
      "rating": "10",
      "text": "Last year I used my mobile phone to click on the iQiyi APP and watched this movie, when Bikini Bottom became a Sea Snail Refuge!"
    },
    {
      "rating": "7",
      "text": "Really fun. The plot is kinda generic, but the real draw is the 3D animation. It really brought depth and color (hard to imagine more color) to well-tread ground and I loved seeing all my favorite parts of BB and it's denizens. I generally don't care for this move (exceptions being this, Peanuts, and Lupin), but it was a homer here.Drawbacks were Camp Coral and the guest stars. Hard to believe they felt the need to nerf a kids show, but I did not like the idea of the kids portrayed as these nobler then though characters who, I guess, turn into the goofy doors we know and love. I know it's a plug for the new show, but the original appealed to all ages, CC is for 5 and under. The guest stars just impeded the plot more than helped it. It was a distraction and added nothing."
    },
    {
      "rating": "5",
      "text": "Between inconsistencies, disrespect for the original work and a lot of scriptwriting facilities. The 2020 film struggles to find an identity, thus bathing in the fan service between Snoop Dogg or Keanu Reeves. On the other hand, one can almost blame a successful artistic side. Stepping out of his comfort zone, Spongebob tries the 3D, and, while keeping his bases, he succeeds in offering us a ameliorative spectacle for the eyes, despite the scenario that does not break three legs to a snail."
    },
    {
      "rating": "10",
      "text": "Aside from so many continuity errors, this somewhat not-so-good film still brings joy."
    },
    {
      "rating": "9",
      "text": "This is a underrated movie, i don't get why people rate this movie better. I found it to feel like a real episode of the show it is so good. One problem i found was this is just was a longer version of Can You Find This Snail. So if you watch the episode, you are fine."
    },
    {
      "rating": "5",
      "text": "Not a very high level film and in my opinion, compared to the previous two cinematic animations of SpongeBob SquarePants, this film is going backwards! The repetitive and not so surprising story provides the background for these setbacks!"
    },
    {
      "rating": "4",
      "text": "Just A Another Spongebob Movie But This one is The Least Funniest Out of all the SpongeBob movies Sure has a good puns But Not compelling as much And The Story Is Boring"
    },
    {
      "rating": "10",
      "text": "The SpongeBob movie sponge on the run is the best and final SpongeBob movie in the SpongeBob movie trilogy and the end of the SpongeBob TV series"
    },
    {
      "rating": "4",
      "text": "The new change of animation is refreshing for the long running series as it manages to retain the original spirit of the gags without feeling nostalgic. Sadly, this is nothing more than a television script plot (and one where the series told this same story in just 30 mins) being stretched out to fill the runtime. It's ultimately another pointless exercise in trying to justify the existence of \"Spongebob Squarepants\" in 2021."
    },
    {
      "rating": "10",
      "text": "The SpongeBob Movie Sponge on the Run: I have been watching SpongeBob for 15 years and this is one of the best animated movies ever. I’m not talking about the obvious first I want to start with the bad things first, the over use of celebs like Snoop Dogg is here for one scene, I like Danny Trejo but why is he here, Tiffany Haddish is in for like 6 seconds so then she’s gone. The other thing is King Poseidon’s voice, not to hate on Matt Berry but he was the voice of Bubbles in the last movie like kinda lazy. But the celeb cameo I love obviously Keanu Reeves I don’t care if it’s stupid or not I love it. Of course the cast comes back and do great no complaints. Now the animation IS GORGEOUS OH MY GOD GRAVEY. There is so much detail you can see each hair on Sandy even the scratches on her helmet, SpongeBob’s chair you can see it’s inflatable, then when they get to the Lost City of Atlantic City the animation goes to 50 it’s so pretty. Oh and Spongebob says crap. Overall it’s the best SpongeBob movie, beautiful animation and Keanu Reeves. Ranking Amazing."
    },
    {
      "rating": "8",
      "text": "Despite its stupidly perfect animation, The SpongeBob Movie: Sponge on the Run won't be too memorable, though it is entertaining and magical."
    },
    {
      "rating": "7",
      "text": "If this would be the last adventure of Sponge Bob, it would be the best ending ever for this character."
    },
    {
      "rating": "7",
      "text": "Esta bien la película pero le falto un poco mas de originalidad y cosas no vistas en la serie"
    },
    {
      "rating": "2",
      "text": "NO WAY THIS HAS 65 THIS MOVIE SUCKS, sure there are some enjoyable parts but compared to the other SpongeBob movies this is trash. First of all they ruined the timeline, the end sucks and, the story barely made any sense. And the ending was just promoting the kamp koral show."
    },
    {
      "rating": "3",
      "text": "I love me a good SpongeBob movie, but Sponge on The Run is way longer than it needs to be. And it's not like because of the movie as a whole is a drag, the entire issue specifically revolves around 2 scenes which could've easily been fixed. If you saw the movie, you know which ones I mean because holy **** they drag on forever. The first one should just be cut entirely, its **** pointless. And the second one should've been SIGNIFICANTLY reduced. The rest of the movie is ok. The story is very basic. I liked the songs and music, even the ones in the pointless senses, and the animation is easily the best part of the movie. Sad that this is the worst of the 3 movies."
    }
  ]
}