{"id": 3550, "title": "The Haunting in Connecticut 2: Ghosts of Georgia", "starring": ["Chad Michael Murray", "Katee Sackhoff"], "runtime": 101, "genre": ["Horror", "Drama", "Thriller"], "description": "A young family moves into a historic home in Georgia, only to learn they are not the house's only inhabitants. Soon they find themselves in the presence of a secret rising from underground and threatening to bring down anyone in its path.", "releaseYear": "2013", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/af6YNKYQsX76RSNHh3X4k2OcoQC.jpg", "categories": {"plot": 4.3076923076923075, "acting": 3.0, "ending": 4.428571428571429, "soundtrack": 5.0, "cinematography": 2.0, "familyFriendly": 3.0, "funny": 5.0, "action": 6.0}, "reviews": [{"rating": "2", "text": "AWFUL AWFUL AWFUL. Any good comments on here must be paid for as this movie has no good points at all.\r You know them really bad horror movies where characters go for midnight walks? do the clothes washing at night outside? move out there house at midnight? yeah this is one of those.\r Avoid at all costs.Nothing good to see here at all."}, {"rating": "3", "text": "Ghosts of Georgia has some new ideas, but overall, it is filled with cliches and outdated ideas, old creaky stuff just to generate some scares that we pray for to work, at the end of the day, no shocks. Predictable and cheesy. At some points of the movie, I regret watching it and think that it would have been better to feel bored than watching this. I have some questions for the writers. Why should anyone sane, knows that some crazy stuff happening around him, move from his house at midnight rather than morning? And I don't think that anyone doing nothing, won't wait till morning, to do laundry! The acting is maybe good for a horror movie, I might give credit for that. The story is somehow interesting, and there is a little bit of ideas that are somehow new. So 3 out of 10 and I regret it."}, {"rating": "4", "text": "The Haunting in Connecticut 2:  Ghosts of Georgia is not a horrible film.  Almost.  But not quite.\r The good:\rChad Michael Murray as the father.  He comes across very naturally.  This guy needs better roles than this.  Give him the right script and he'll give a star performance.  Katee Sackhoff.  Again, a very natural, genuine, varied performance.\r The movie has some good suspense, some good atmosphere.  It has some original ideas.\r The bad:\rThe script.  It's not finished.  Come on, guys!  This is a rough draft at best.  It needed more polish.  What it needed to be was a ghost story.  We did NOT need an evil demonic character stalking the woods.  The scenes at the end are cliche.  \"Based on a true story\" or not, the last third of the movie needed serious rewriting and the middle third needed to be tightened, and about half of the first third could have been cut.\r There are obviously things in this movie that were not part of anybody's true story."}, {"rating": "8", "text": "Its a nice watchable movie,with unpredictable story.Not awesome  as first one ,but decent movie.Well acted and dramatic ending as well.Its worth watching."}, {"rating": "4", "text": "The most baffling thing about this movie is the title. Why even have Connecticut in the name? The movie has nothing to do with the original and it doesn't take place in Connecticut. Why not just call it \"The Haunting in Georgia\"? The only thing that was redeeming in this movie was the little girl who played Heidi and the support hot redhead that played Joyce. Other than that, this is a terrible movie."}, {"rating": "3", "text": "This movie is only trying to scare but it lacks story, and it lacks the way to capture its audience. I would recommend to skip this one. The movie is very dull and very confusing on to what the meaning of the movie is. The movie is way better to be left unwatched. Lions gate didn't make such a good movie this time. Not  worth the watch.  The story could've been written and directed better."}, {"rating": "1", "text": "When I didn't think a movie could be worse than The Haunting in Connecticut, this movie was made. At least in the first one, there was some unintentional comedy... and stuff actually happened. This was just a compilation of shadows moving across the camera, and flickering lights. If Lifetime made a horror movie, this would be it. This is one of the most boring and cliched horror movies I've ever seen."}, {"rating": "6", "text": "I wasn’t expecting much going into this film mostly due to the ridiculous title of the picture but I actually enjoyed the film. There was the basic elements here to be far more scarier but where held back by standard effects tricks that now plague paranormal movies almost to the point of making them boring. Yet at moments I felt actual suspense and eerie tension as more dramatic scenes unfolded into real chilling events. The setting and story was creepy and the film version held a far more haunting presence than what I originally imagined from the actual story. The film veered from the true paranormal case with a more morbid, dark representation of the evil spirit haunting the land as well as the family.\r The action sequences were produced well creating a relief from the mediocre dramatic moments that tended to case me to drift off. I found “Ghosts Of Georgia” to be a far better ghost flick it’s predecessor and think the film could have gained a better reception from audiences had they not gone with the title. This film had a great set up, acceptable acting, plus all the expected moments of creepy chilling paranormal activity. It isn’t going to be a movie that really scares the hell out of anyone over the age of ten but it is a great movie about hauntings. The only downside was the very end after the amped up climax that felt way to hallmark-y, coming off completely cheesy and made for TV. I would tell people to see it and expect a better movie than “The Haunting In Connecticut” or “The Apparition”"}, {"rating": "2", "text": "I was very impressed when I saw \"Haunting in Connecticut\". I confess that I was expecting something worse and this film was a positive surprise. What I didn't expect was to find this strange film. Its not the first time that I find what I use to call \"false sequels\", that is, films that are advertised and sold as sequels to successful films, but that have no relation with them. It's like that Peter Carpenter (I'm inventing in order to illustrate my concept ok?) who says he's the cousin of the director John Carpenter with the clear awareness that he's not. Only then can we explain that this film has such a strange title, to the point of referring to two distinct and unrelated American states. Almost symbolic, isn't it? So, let's put \"Haunting in Connecticut\" aside because I'm going to concentrate on this film and forget about the miserable advertising maneuvers of greedy cinema studios.The film is sold as being based on real facts, but I don't know to what extent the people involved in these \"real facts\" (and who even appear in photo in the final credits) will be satisfied with this film, because it subverts everything and builds a new story over their names. Anyway, the story starts well and with good premises, which quickly wear out as the film proves to be predictable until the last consequences and loaded with the usual clichés in the genre. The ending is rather weak and boring, attesting to the mediocrity of screenwriter, David Coggeshall.Tom Elkins has had the proof that being a competent editor and having some experience in terror is not enough to be a good director. In the cast, we have to point out the average efforts of Abigail Spencer and Katee Sackhoff. Emily Anlyn Lind does what she has to do but has no material or experience to surprise. The rest is weak, just showing up and saying the lines they have to say. Its a deeply dark film, with dark cinematography that makes us sleepy. The scares are limited to the usual jumps, since the film is not able to create an atmosphere of consistent tension and, in the rare moments when it does, it wastes the opportunity. There are many sound and visual effects, which sometimes work quite well, but which generally seem to be within what we are expecting to find. CGI is weak and looks fake, as well as those ghosts, which inexplicably become clearer as the film evolves.In addition to being sold under absolute and shamefully misleading advertising, this film turned out to be so weak and predictable that it was difficult for me to see the redeeming elements that prevented me from rating it even worse."}, {"rating": "10", "text": "I personally like the movie some people rather listen to a lie than the truth. Especially when it comes to history of people of color.  And it still continues to this day"}], "recommendations": ["insidious_chapter_2", "annabelle", "sinister_2", "dark_skies", "the_conjuring_the_devil_made_me_do_it", "the_grudge_2", "chernobyl_diaries", "insidious_the_last_key", "the_conjuring", "antlers", "the_mist", "devil", "the_possession", "insidious_chapter_3", "the_eye", "the_haunting_in_connecticut", "insidious", "poltergeist", "the_conjuring_2", "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_", "the_amityville_horror", "ouija_origin_of_evil", "signs", "malignant", "the_curse_of_la_llorona"]}