{"id": 3354, "title": "The Walk", "starring": ["Justin Chatwin", "Terrence Howard"], "runtime": 105, "genre": ["Drama"], "description": "In 1974, a Boston Irish cop confronts fierce social pressure after being assigned to protect black high school students as they are bused into all-white South Boston High.", "releaseYear": "2022", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/tg1dJHA60iuLxAHtUYD01LL7P10.jpg", "categories": {"plot": 7.833333333333333, "acting": 7.511111111111111, "ending": 7.5625, "soundtrack": 7.0, "cinematography": 8.571428571428571, "familyFriendly": 3.0, "funny": 8.0, "action": 8.2}, "reviews": [{"rating": "8", "text": "Though The Walk is not Robert Zemeckis at his best when it comes to storytelling, the finale will leave you breathless.  As much as I was in awe watching the walk itself the love letter to the twin towers had me weeping.  A-"}, {"rating": "9", "text": "Movie give you goosebumps every now and then . Even though you are watching its feel like you are actually there experiencing everything. I suggest it everyone who love watching biography."}, {"rating": "8", "text": "As someone who is terrified of heights and found it nerve-wracking to even be visit the Twin Towers themselves (let alone the void between them), I have to say, seeing this movie in full IMAX 3D is a disconcerting experience. I regularly gripped my chair tightly, looked away from the screen, and wanted out. But that's kind of the point, isn't it? To sell exactly how insane this stunt really was. I'm not a huge Robert Zemickis fan, but I have to say, this was pretty convincing.\r Additionally, Joseph Gordon-Levitt is equally convincing as the man himself, selling a French accent and a distinctive attitude. You believe the guy would do what he's doing. His wire-walking, while obviously not as audacious as the original's since it's in a studio, is nonetheless a product of some real-life effort that is quite impressive.\r There are a few eye-rolling Hollywood moments, but on the whole, this is a rare film that holds great suspense even though you probably know what's going to happen. See it if you dare."}, {"rating": "7", "text": "Although the Walk takes a while to get into the actual WALK, and the drama doesn't always work, it is still a fun and enjoyable movie, especially if you are interested in Philipe Petit."}, {"rating": "8", "text": "\"The Walk\" has incredible visuals, a great lead performance from Joseph Gordon-Levitt, wonderful directing by Robert Zemeckis, and an intense climactic end."}, {"rating": "8", "text": "If there was ever a worthy utilization of 3D on that prodigious silver screen, it’s The Walk. The appearance of another studio film trying to capitalize on an incredible true story–one that was already satisfyingly revealed, no less, in the awe-inspiring 2008 documentary: Man on Wire—was certainly working against this production, only baiting the cynics in their preparation to deride the typical inaccuracies and manipulations.  Surprisingly though, The Walk is truly laudable due to its utter respect for this legendary wire-walker named Philippe Petit—a man that gave us the show of a lifetime by daring to walk a tight wire from one of the twin towers to the other; actually, scratch that, maybe even two or three lifetimes.\r Joseph Gordon-Levitt inhabits this eccentric character with the utmost dedication and methodology, livening every element of the individual with a remarkable magnitude of authenticity whether it’s the perfection of a thick French accent, or even his pronunciations  when he’s actually speaking the language for extended periods of time.  He’s clearly working with such a burden here, and at the same time, he’s also infusing the maximum dose of charisma into this character.  Pleasantly observe the totally natural French-like mannerisms he subtly permeates into his confrontational arguments with those around him–friends who’re incessantly vexing him with their distrust in this insane stunt he’s so eager to pull.  Thanks to the support of an exceptional cast—including the lovable James Badge Dale; the great Ben Kingsley; an unfamiliar, refreshing actress in Charlotte Le Bon; as well as all the other cohorts and their comic relief next to them—strengthens Levitt’s energy on the screen that much strongly.\r It’s a gripping portrait of artistic obsession—that inability to admit defeat even in the face of impossible odds.  Perhaps, sometimes,the more incensed and impatient side of this otherwise  amiable guy might be exposed, but once he finally reaches the roof of the southern twin tower with mounds and mounds of imperative (daredevil) equipment, you want this for him almost as much as he does.   Thus, it becomes an undeniably fun caper with a mischievous score that recalls the audacity of Ocean’s crew. Subsequently, a beautiful, soaring score greets us as the vastness of the city  and the romantic posture of the horizon comes into view on the roof; if Phillip falls, it would surely be a glorious death.  Inevitably but understandably, some doubt the necessity of a documentary remake.  In this case, what was frankly unclear throughout those interviews was lucidly visualized here.  Vague descriptions and mappings could only take your imagination so far, which is why veteran director Robert Zemeckis prioritizes absolute audience involvement by implementing suspenseful excitement into sequences that see this group break in past security, maintaining feverish pacing in the process.\r But, of course, what we’re really here for is the sheer potential of incredible thrills from the famous wire-walking.  As I’ve hinted at previously, this is an absolute must-see in IMAX 3D just like Avatar and Gravity were.  The beauty of Paris and New York City are greatly enhanced in all their lavish detail, and the depth in those daunting shots that look down from lofty heights makes the experience drastically more immersive.  As the camera glides from the top of a tower down to the very streets of New York, you could almost feel that rush.  The Walk finds every possible technical maneuver in amping up the audience’s anxiety during these scenes–close-ups of Phillip’s sweat or carefully-placed feet balancing on a slightly vibrating rope, followed by the camera’s panning and circling around Petit’s various tricks on the wire which only increase in difficulty.\r Essentially, this film has achieved an astonishing feat in wholly justifying a cinematic retelling of the true story. With that being said, there are details that’re over-dramatized as can be expected from a Hollywood production in order to build superficial tension, or even those that’re fictionally inserted to give a scene the fullest dramatic effect.  Occasional moments remind us we’re only watching a movie after all, whether it’s some  inspirational dialogue or the predictable action beats like someone tipping over at the worst time.  Overall, its rare (live-action) PG rating allows the whole family to attend and enjoy the classic thrills, the frequent humor, and the ravishing vistas—what a charming feast!"}, {"rating": "9", "text": "This biographical drama about high-wire artist Philippe Petit is presented in a  surprising and classical narration from the beginning till the end which turns out very successful thanks to its well balanced visual effects and fact adaptations. The plot is layered into several structures perfectly, its progression from dream, plannings, challenges, actions, consequences until memories are developed in an acceptable pace. Main actor Joseph-Gordon Levitt's efforts in practicing high-wire experience and learning French are fruitful which his charming performance and immersion in portraying Philippe  manages to attract the audiences to fall in love and to follow the fierce determination to achieve a \"suicidal ambition\". Director Zemeckis' ingenious camera work, CGI, SFX as well as the beautiful scores have brought this chilling and insane lifetime experience to a feeling like walking on the wire in real life. Most importantly, despite keeping the audiences on the edge of their seats and terrifying height, it delivers the messages of not giving up your own dream even the others might see it as an insane imagination."}, {"rating": "7", "text": "Robert Zemeckis came back, in the tight rope . This original film  shows us the exploits in the life of young Philippe Petit to comply his dream: to walk the immense void between the World Trade Center towers. \"The Walk\" was developed in a manner to which the public is not accustomed (Joseph Gordon-Levitt  narrates his story). The brightest of the film is its history,The cast is very accurate for this movie, Joseph G., Charlotte Le Bon and Ben Kingsley give us intimate characters. \"The Walk\" is not a simple movie of adventure, It's a movie about friendship, love, passion and the dreams.The mixture of languages is fantastic and sophisticated. The soundtrack is acceptable, its theatrical release in IMAX and 3D is wonderful, the vertigo never stops. The special effects  are executed perfectly giving a classy touch. \"The Walk\" is entertaining, interesting , daring , shocking , it is beautiful but something is missing to be a memorable film."}, {"rating": "8", "text": "A surprisingly spectacular and enjoyable film. Undoubtedly one of the best movies of the year.\r Pros:\rAccurate representation of the original happenings\rAmazing special effects\rInteresting characters\rGood humour\r Cons:\rSome cheesy shots\rMild pacing issues"}, {"rating": "7", "text": "Unfortunately, I was unable to see the movie in IMAX. But still, it was a pretty good movie. The first act was whimsical and enjoyable, the second act was interesting and sometimes intense and the third act was both gripping and visually astonishing. Joseph-Gordon Levitt was very good and portrayed his character as a kind of French Charlie Chaplin (and he really nailed the accent). Ben Kingsley was also very good-no surprise there. One of the things I liked was that the scenes in France are mostly in French with subtitles and when the characters do speak English, it's simply because they want to practise for when they go to America, instead of just randomly having them speak English like most film makers would. All in all, it's a very good movie that I would definitely recommend unless you have vertigo. 7/10."}, {"rating": "3", "text": "I've already seen Man on Wire, a documentary about the events in The Walk, and, according to metacritic, a MUCH better movie. Why would I want to see a fictionalized, dramatized version? If Philippe Petit's story interests you, watch Man on Wire instead. Bonus: you won't have to pay $15 to watch it."}, {"rating": "7", "text": "The Walk is a fun if at points over dramatic interpretation of the story of Philippe Petit. The sense of triumph the movie exudes is very well done, and Robert Zemeckis has some great directing chops on display in this picture. This is a fun Netflix movie night watch with a great performance from Joseph Gordon Levitt."}, {"rating": "10", "text": "This drama about the incredible story of Philippe Petit had me at the edge, trembling out of fear and clapping at the end of the movie. Genius work from Mr. Zemeckis."}, {"rating": "5", "text": "Def. see Man on Wire first - then consider this optional. This was interesting, but it got very sentimental + overly patriotic in a pandering way. Entertaining, but gets a to bit a much especially toward the end.\rExcellent cinematography/visuals up high."}, {"rating": "1", "text": "Holy crap this movie is horrific. Unbelievably awful in every way. The acting is so bad especially by Levitt who gives the worst performance of his career. The CGI is terrible, the wire doesn't even look real. The 3D gave me a migraine. I didn't once feel awe or feel vertigo, I was just bored. Robert Zemeckis is not a good filmmaker and this proves it."}, {"rating": "8", "text": "Great balance of facts, thrills and visuals. Really catches its stride during the final hour and the titular walk does not disappoint. Seeing in IMAX 3D makes you feel as though you are walking right beside Petit. Bravo Mr. Zemeckis."}, {"rating": "9", "text": "An incredible true story told in a way that is beautiful, gripping, hilarious, emotional, and intense. Even if you know how the story plays out, it's hard to not be left sitting on the edge of your seat. If you don't know what happened then this is a darn wonderful way to find out. Either way, you're getting to watch an excellent movie.\r Joseph Gordon-Levitt gives yet another phenomenal performance. Fully invested in his role, he's truly able to sell himself as Philippe Petit. The man's motives, dreams, and French accent are masterfully recaptured by the actor. It's truly something to behold and allows you to invest more in the story as a result. We truly do begin to care about everyone involved in the \"coup\" early on. It makes the tale all the more compelling.\r Just the way the whole thing is brought to life with wonderful bits of humor and heart is awesome. The human soul that made this event so incredible in real life makes the movie that much more compelling. Robert Zemeckis is fully able to make viewers feel apart of the plot, as if we are watching it unfold in real life right in front of our eyes. The visuals are stunning.\r Simply put, it's an excellent telling of an incredible true story. One that hits just about everything you could want from a movie. However the greatest strength of it all is that it feel so very human and real. A great thing for a movie that is about an event that very much was/is very human and real. If you don't know the story then this is a fantastic way to learn about it. Even if you have it's still worth watching. Robert Zemeckis has crafted something amazing here. A true story turned into a true must watch.\r 9.4/10"}, {"rating": "7", "text": "For those of us who are afraid of heights this movie is a difficult watch. Even sitting in a chair I had a constant sensation that I was about to fall, had to look away several times and wondered at least twice why I was even watching it. Being stupid I had already watched the documentary of this ridiculous performance, so at least I knew the ending this time around. But it was still horrible and I will probably have trouble falling asleep for a few nights because of the visions of the Void the movie leaves behind. Perhaps it's therapy.\r And even if it isn't the movie is very well made, both as a period piece (Man I miss the 70s...) and as a visual representation of lunacy channeled into art. I could have done without the narration though. If there's one thing I hate it's fourth wall-violating narrations. It's so...Disney. I think this movie, like all other movies that are narrated, would have been much better without the...uhm...narration. Then again this director did the same thing with Forrest Gump too, so I guess he likes it."}, {"rating": "8", "text": "Joseph Gordon-Levitt struts with style and aspiration every step of the way.\r From the first scene Joseph Gordon-Levitt dons the all black persona and talks about his passion, I'm hooked. This monologue heavy delivery requires that caliber of performance from the lead, also reminds me of Ewan McGregor on Big Fish. It takes the audience on a bizarre yet fascinating adventure and makes us feel like a part of the character's larger-than-life endeavor.\r This is the story of Philippe Petit, a performer with the idea of wire-walking across the World Trade Center towers. While it may sound simple, the journey there is a captivating one. The presentation is almost magical with circus act and flamboyant atmosphere, although there are plenty of realistic details and intricate planning involved, at times it almost feels like a funny heist movie.\r Visual is breathtaking, the cinematography takes full advantages of the vistas, let it be small village or big city. The way the scenes are shot gives the movie a much more surreal ambiance. It's an enhanced realism, and although it's not as refined, there's a spirit of Hugo lingering here. It makes great use of 3D with timely panoramic shots and even stuff-thrown-at-your-face antic, but for this movie I wouldn't mind.\r The same goes with its jazz influenced soundtracks, occasional slow ballad or alternate take on popular songs. The production value just oozes gorgeousness. All the technical aspects aside, the best attraction is definitely Joseph Gordon-Levitt. He is utterly remarkable, youthful and charming. This is the kind of acting prowess that can captivate audience with sheer passion, it’s a true homage to the real life counterpart.\r The Walk is nothing short of a breathtaking tale. Its charismatic protagonist and masterful visual invite the audience to not only walk alongside, but in a sense glide freely through such an inspiring story."}, {"rating": "6", "text": "Very well made, big production of underdog personal triumph true story.  There is nobody better at making a movie more cinematic than Zemeckis, and Bob delivers fairly well on the 3D though not far enough as far as I'm concerned.\rIt can be a strange thing when a Hollywood movie treats a known true story such as this.  With say \"Captain Phillips\" I was absolutely riveted despite knowing the ending (a 10 rating from me), but with this I was somewhat bored despite its charms.  I prefer the doc \"Man on Wire\" with the actual walk footage."}, {"rating": "6", "text": "This isn’t the first time you may have encountered Philippe Petit and his death-defying career, 2008’s Oscar-winning documentary ‘Man on Wire’ did a sterling job of illuminating this extraordinary event with the people actually involved and real footage. So, if you want to make this well know story explode out of the screen even further, you’ll need a visionary filmmaker, cinematic technician and accomplished storyteller. Enter Mr. Robert “Bob” Zemeckis in only his 2nd non-animated film in 15 years.\r Joseph Gordon-Levitt stars as Petit and so we address the 1st major stumbling block, his “French” accent. Impressive when he actually speaks French but unintentionally comical throughout the majority of the film when he’s speaking English, we’re talking “Inspector Clouseau” level farcical.\r If you can get past that then ‘The Walk’ is a mix of stylistically sentimental biography and a carefully planned caper with a generous sprinkling of performance art, all orchestrated with Zemeckis’ years of technical storytelling expertise . It’s also an attempt to eulogize the artistry of those who defy death, and a not-so-subtle tribute to the memory of the “Twin Towers” and New York City.\r Needless to say ‘The Walk’ is a considerable visual achievement and an enthralling cinematic experience, challenging if you suffer from vertigo, or have a perfectly rational fear of extreme heights. The final scene is basically a stunning piece of cinematic performance art, but that alone does not make a great film.\r The narrative plays out with a flamboyant and almost magical quality that’s rather misplaced and ultimately takes away from any real tension and jeopardy in a film where you know the endgame from the start. Despite the glorious final scene, the story and performances don’t delve deep enough into the unique psyche of a person who would attempt such a thing, ultimately ‘The Walk’ is an entertaining adventure that doesn’t do justice to the actual man and his feat the way that ‘Man on Wire’ does.\r The Bottom Line…\r‘The Walk’ goes heavy on style and visual presentation but light on substance and character, a stunning piece of performance art that’s never quite matched by the narrative or performances, and a good example of reality proving more compelling than Hollywood drama."}, {"rating": "9", "text": "I was highly impressed with this movie. Even though I knew what would happen, I was still on the edge of my seat for the whole movie. If there is an IMAX theatre within distance, it needs to be seen in IMAX, or at least 3D. Awesome movie!"}, {"rating": "0", "text": "this is a very stupid movie i saw it in the cinema in 3d with my friend she liked but i didn't the wire walker is very selfish and only cares about walking on the wire and he and his friends and to go on a stupid mission and not let the police know and it is ilegal to walk on wires in this movie that doesnt make any sense and the wire walker should do something with his future but not prepairing to walk on a wire like getting a job he doesnt achieve by walking on the wire and it doesnt count as succeeding"}, {"rating": "8", "text": "The Walk is well paced film that blends drama with humor as well story into a perfect mix.Add to the cast great performances led by Joseph Gordon-Levitt  who brings to life the character in a good fashion, In end, The Walk accomplishes what it sets up to do; bringing a heart pounding feel good movie to life."}, {"rating": "7", "text": "If you saw the doc \"Man On Wire\" you already know almost everything that happens here. As a matter of fact, this almost feels like another doc. Highwire walker Philippe Petit (appealing portrayed by Joseph Gordon-Levitt) narrates his story on camera with flashbacks that recreate his effort to walk on a wire between the World Trade Center towers. His tenacious resolve is recounted with considerable detail, but without much dramatic involvement. However, once he starts his incredible feat, the movie becomes riveting. You know it's all CGI, but the spectacular vistas and numerous dizzy angles create a distressingly tense experience."}, {"rating": "6", "text": "Reasonably impressive film about high-wire walker but the climax is milked a bit much."}, {"rating": "5", "text": "Despite many technical flourishes, \"The Walk\" has a script so painfully bad that it's very hard to believe that Robert Zemeckis, an experienced filmmaker, wrote it."}, {"rating": "8", "text": "The Walk is a thrilling, heartwarming, funny, and inspiring movie. Robert Zemeckis did a really great job directing this movie. Meanwhile, the writing is not the strongest element of this movie but the actors did a really good job to live up those characters, especially Joseph Gordon-Levitt. The cinematography is amazing and it is surprisingly able to make perfect use of 3D even in \"non walking\" scene.\rThe second half of The Walk is definitely one of the best cinematic experience you could get in 2015. For me, the first half is as important because it shows Phillippe Petit's character development very well. Throughout the movie we get to know every layers of his personality , we can also get into his mind and even get us inspired to be passionate about our dreams. I really love how this movie ends with a beautiful narration and sort of a heartfelt tribute to the twin tower itself."}, {"rating": "7", "text": "Well after being greatly disappointed with the movie Everest a couple weeks ago during its exclusive IMAX run its first week, seeing that this film was being released the same way and that it looked pretty interesting, I was really hoping that this would turn out better, and fortunately it did. Joseph Gordon-Levitt fulfilled the role of Philippe Petit rather nicely and brought great spirit to his character, although I will say that I thought his French accent got a little hammed up at times. The film's strongest aspects were easily the daring visuals and cinematography, of course especially during the walk in the film's last half hour. All of this combined with Gordon-Levitt's tight-roping skills completely captivated me during that film's portion. As for the story and film itself, I really enjoyed watching this incredible true story come to life onscreen. Even though the titular walk of the film doesn't occur until approximately the last half hour, the rest of the film before it and the events that build up to it were interesting to watch and made it well worth it. Also, unlike Everest, the 3D in this film was actually put to good use. It worked very well and never felt pointless at all. So overall, not only was it a simple, yet fun and enjoyable film to watch, but it's also another worthy addition from Robert Zemeckis."}, {"rating": "8", "text": "The Walk is a film that gradually improves as it progresses, starting as a predictable underdog tale and ending on a dizzying, visually spectacular walk."}, {"rating": "7", "text": "The Walk was a good film. The story kind of dragged on and the acting wasn't great, but the visuals were magnificent, which makes me think it was more about the effects than the story (the possible reason why most people liked Gravity)."}, {"rating": "7", "text": "An entertaining re-creation of a remarkable, envelope-pushing event with fine special effects and a solid lead performance by Joseph Gordon-Levitt. The film is admittedly a little thin on character development (especially among the supporting players), and some of the setup to the main event seems padded to fill out the runtime. But, those drawbacks aside, the picture is otherwise a genuine crowd pleaser, especially in its gripping closing sequence."}, {"rating": "10", "text": "This is the dramatisation of the planning Philippe Petit put in, in life and on the wire-walk in the film, to make the attempt possible. The is also documentary of the attempt called Man on Wire, which I have not seen.\r The film solves the problem of in films that have a lot of narration and exposition, by having the actor (Joseph Gorden-Levitt)  break the fourth wall and tell his life story in a very enthusiastic and engaging manner. It succeeded in this and a tense caper covers Philippe Petit and his \"accomplices\" attempt to get all the gear required to do the wire-walk across the Twin Towers and then do the walk. Who knows there were so many gear necessary! It's engaging and tense, and even though I already know of the outcome, I was still interested in it.\r I didn't watch it in IMAX, but I heard it would be amazing to do so.\r Who would think the film is great? People of all ages\rWho would think the film is only so-so? No one?\rWho would think the film is lousy? No one.\r Score: 5/5 (no half scores). Watch it in the cinema and then buy the DVD."}, {"rating": "8", "text": "The Walk is another landmark in a long list of films from now legendary director Robert Zemeckis. The Walk tells the story of one of the most unbelievable feats in history. Philippe Petit is one of the bravest and craziest men to ever live and Joseph Gordon-Levitt offers a great portrayal of Petit. It doesn't seem to matter how crazy Petit's dream is because Levitt always makes it feel believable. Unfortunately other than another good by limited performance The film is shot so beautifully and I feel extremely disadvantaged for not getting the IMAX experience because I'm sure that it's the true way to watch it. The scene of the Walk is so unnerving that you almost feel like you are up there. Finally the film also serves as a tribute to the Twin Towers, and New York City without directly mentioning 9/11."}, {"rating": "10", "text": "Robert Zemeckis' signature visual style and proclivity for bio-pics seemed perfect for a movie like The Walk, a film that manages to boast an interesting and entertaining story and dizzying cinematography. The Walk is based on the story of the real-life high wire artist Philippe Petit in 1974. Inspired by a circus he saw at a young age, Philippe begins planning an incredibly ambitious -- and highly illegal -- show in which he hangs a wire across the Twin Towers and walks across them. A majority of the story is dedicated to Petit gathering accomplices to help with the coup, practicing for the extreme conditions and planning how they will rig the wire. The clever writing allows you to connect with every character and understand why they're trying to attempt this impossible dream. The last 45 minutes or so is where \"the walk\" actually happens. The scenes of Petit and co rigging the wire are just as tense as the wire-walking scenes, which are accented by some of the best cinematography of the year. The cinematography is really the star of the movie here. The shots panning down towards the ground make the towers almost look endless, and it adds so much tension to the walking scenes. The Walk is a stylish and entertaining look at one of the biggest artistic feats of the last century, and you need to watch it in IMAX 3D."}, {"rating": "8", "text": "The Walk definitely comes highly recommended by me, I absolutely loved this film and I think it’s definitely up there with some of Robert Zemeckis’s best work.  It had an excellent performance from Joseph Gordon-Levitt, some absolutely brilliant effects and is one of the few films that is actually improved by 3D.  This film is not all style over substance and anyone worried about that should lose their worries immediately, they are purely there to effectively tell an incredible true story.  You could read the biography this film is based on before going to see this or the good documentary Man On The Wire, but like most true stories, I would actually recommend that you go into it almost blind and then find out the facts after the film.  This is one I am definitely not going to forget for a while and neither will you if you go and see it."}, {"rating": "7", "text": "The only really bad thing that comes to mind when thinking about The Walk is the narration. It's overdone to say the least. Rather than showing and letting us feel the events the movie tries to hold the audiences hand by over-describing everything. As if the makers were scared we wouldn't get it and it takes away from the magic of the film.\r Joseph Gordon-Levitt's accent was silly and over the top. I don't understand why they just didn't get a French guy if they wanted things to be authentic. However it doesn't take from the movie much and somewhat fits with the mood of the film.\r Other than those things The Walk was very enjoyable and fun. What immediately struck me was how vivid and colourful it is. In an era of the grim and gritty it's a welcome difference.\r The Walk is a funny film and at times seems like a straight up comedy. So much that you sometimes begin to question is this really based on true events, though that's not really saying anything bad about it. It works for what it is.\r At times The Walk is almost like a heist film and the setup for the whole thing is very engaging. It is definitely a film that left me with positive emotions and I highly recommend it."}, {"rating": "8", "text": "The Walk is a visually gorgeous, terrifically acted, biopic that is bail-bitingly good. Joseph Gordon-Levitt plays Philippe Petit, a real life man who walked a hang wire between the two towers, extremely well. Often times when an actor has to fake an accent, it comes off as corny, but Gordon-Levitt pulls off the French accent. The entire cast was good, but the movie is a chance for Gordon-Levitt to shine. The film uses a lot of visual effects, and most of them are nearly seamless. It's always great to see New York from far above, but this may be one time it's not as much fun. Zemeckis, and Gordon-Levitt succeed in making you care about this character, so that in the end when he's standing 110 stories up, all you can feel is fear. Granted if you've seen Man on Wire then you already know the story, and the film doesn't offer many surprises, because it's loyal to the truth, but if you haven't you may find yourself biting your nails, and rooting for this guy."}, {"rating": "9", "text": "I watched this a while back and forgot to give it my review. Well The Walk starts off fresh and decent. There are scenes where I didn't find interest in and you know as long as the movie delivers what I came to see. It gets so much better once you get to the real action which is, him getting ready to walk on the wire and also the things he went through to make this happen. As soon as I saw that I said, \"Damn, this movie is amazing\". By the way, if you want the best experience. Try it in 3D because it feels intense with realism and good quality."}, {"rating": "8", "text": "Philippe Petit: \"People always ask me \"why do you risk death\"? For me, this is life\".\r The Walk is based on a true story of Philippe Petit, a French high-wire artist, and his group of friends, who staged an unauthorized attempt to cross the World Trade Center Twin Towers in 1974.\r Robert Zemeckis is very well known now for using groundbreaking technology as a style of film making. It make's every scene in he's films look absolutely jaw dropping and visually stunning. That's why Robert Zeneckis always wanted to make this movie so badly, so he can take that stunning visual style that he has and put it to the big screen. Zemeckis has said in an interview that \"His Entire Career Has Been Preparation for The Walk\", so that right there shows Zeneckis strong interest on the story and how he can easily adapted a story like this into a film. We already know he can do it, I mean this is the same director who made Forrest Gump for crying out loud, so him failing seems impossible at this point. But I needed to see the film myself to judge and while knowing the film has positive reviews, I need to judge myself.\r After seeing \"The Walk\", I can safely say that Zemeckis nailed it once again as this movie was great.\r Joseph Gordon-Levitt did a solid job playing Philippe Petit. Gordon-Levitt really got into his character, because he actually learned wire walking and how to do it correctly by Philippe Petit himself. I know a lot of people have been talking about Joseph Gordon-Levitt french accent in the movie and how out of place it can be, and yes I do admit it did take me off guard a bit, but I got use to it after awhile. But here's the thing; Philippe Petit doesn't have an normal french accent and I think Gordon-Levitt did a great job emulating that. I think Joseph Gordon-Levitt did the best performance he could have done and I got to give him credit for that and I'm standing by that.\r Robert Zemeckis directed this movie and as I said before; Zemeckis knows how to push the boundaries of CGI technology with the movie he made such as: Back to the Future, Who framed Roger Rabbit and Forrest Gump. And Zemeckis once again did an excellent job telling an interesting story and the use of CGI bleeding in perfectly with the environment that the movie is set in. Robert Zemeckis is the man for the job when it comes to film making like this and he did such an amazing job directing this movie. Nicely done Zemeckis.\r The second act of the movie where he starts to walk across the wire between the twin towers was absolutely amazing and also terrifying, because I have this thing with heights and I can go vertigo easily. I sawed the movie in IMAX 3D and my god the 3D in this movie worked so incredibly well that I literally felt like I was up there with Gordon-Levitt. My hands were sweating, my heart was pumping and the sequence itself was truly spectacular.\r The visual effect's in this movie are so perfectly executed and so beautiful to look at. I would go this far and call it flawless CGI as it's truly stunning.\r Now for the problems: The first half of the movie felt a little underwhelming and a bit slow for me. It felt a bit dragged out with some of the scenes and it made the pasting seem a little slow.\r Overall The Walk may have a slow first half, but the second act of the film is so perfectly executed and it's absolutely worth seeing in IMAX. The acting is great, the directing is fantastic, the visual effect's are stunning and the 3D is worth the price of a ticket."}, {"rating": "8", "text": "The Walk is directed by Robert Zemeckis and stars Joseph Gordon-Levitt in the main role as Philippe Petit a wire man whose dream is to hang a wire in between the Two Towers in New York and walk on it.\rThis movie is based on a true story,which I knew nothing about and honestly that made the experience much better considering that I did not know how it played out.The acting is magnificent,Joseph Gordon-Levitt has proven over and over again that he is an amazing actor.His accent in the movie I thought it would bother me when I heard it in the trailer but it actually did not.I got used to it very soon and by the end I even forgot that he was doing an accent at all.\rThe movie does take its time to start though,as its very slow buildup in the beginning but the second half its astonishing and a wonderful achievement with stunning visual effects that make you feel as if you're actually there,and considering that I am afraid of heights it truly struck me and I loved it.It is also intense,interesting and above all inspiring.Seeing this guy do the impossible and make his dream come true that truly inspires me and everyone else who's seen it to go for our dream and try to do the impossible.\rI really enjoyed the movie,despite a very slow start and quiet honestly also a somewhat forced romance.Still this is a very well done movie with very good acting,great visuals and a very intense final act that will stay with you even after you see the movie."}, {"rating": "9", "text": "A really good, interesting movie based on real life events. At first I thought it might be boring for most part, but movie actually was really interesting from the start to the end, loved the performances and enjoyed the narrative style too. Plus the whole surroundings and everything felt so real and breathtaking - one of the best movies I have seen lately."}, {"rating": "8", "text": "The Walk has been a shocking and funny film , the fun part in some scenes, so shocking to walk on a rope from the extinct twin towers. Good plot , great acting of Joseph Gordon- Levitt, and good work of Robert Zemeckis , a unique and memorable experience in the heights ."}, {"rating": "8", "text": "This movie will inspire you to do the impossible, shaking from being so nervous to see the end. The actors do a great job creating tension. You will feel emotional not just for the story but for the Towers themselves."}, {"rating": "7", "text": "The Twin Towers of the World Trade Centre have been brought back to life. Robert Zemeckis directs another gorgeous looking film with special effects that completely immerses the audience into a uniquely historic and meaningful event. Joseph Gordon-Levitt delivers an incredibly convincing performance along with the rest of the cast. However the film is quite slow at the beginning with unnecessary narration during the final walk that distracts the audience and makes the moment feel less real."}, {"rating": "10", "text": "The film is a miracle, Zemeckis has once again created an incredible adventure. I am delighted with this picture, I really liked it well despite the fact that at first I saw this movie in a theater with a recording of Ukrainians. It will be exciting. Well done."}, {"rating": "6", "text": "Witness the epic story of Philippe Petit, the man who dared to walk across a wire suspended between the twin towers. The amazing event portrayed on the big screen, in 3D no less. Definitely worth a watch, the catch however, you'll have to sit through at least an hour of pure fluff, Philippe's early life in Paris as told through one of the most cringe inducing narrations in film history, made all the worse by Joseph Gordon-Levitt's attempt at a French accent. Points for effort as the rest of his performance redeems itself. Honestly there's only one scene in this film that makes it worth the time, everything else is just padding, and there is absolutely no excuse for CGI juggling, none.\rRecommended yet the documentary that stars the real life Philippe Petit is a much better watch."}, {"rating": "7", "text": "I vaguely remember this happening and seeing it on the nightly news back when I was in college.  Had no idea of the rigging involved, the challenge or \"artistry\" as Phillipe called it, or how much planning went into sneaking all of the equipment up there.  To see Phillipe's background and training with Papa Rudy was a nice touch.  But best of all was to see the Twin Towers again.  I remember looking down from the observation deck window and YIKES! it was scary even though I was inside the glass."}, {"rating": "8", "text": "The Walk excites us and gets us dizzy with its deep-impressing story and the lovable reminder of the two World Trade Centers captured us just right there and here."}, {"rating": "8", "text": "Joseph Gordon-Levitt is at his best here in a film that for the last 20 minutes will either have you or on the edge of your seat, or if you are like me, a little nauseous. Levitt narrates the tale in a jovial and at times, quite amusing way that makes it very easy to watch and gets you rooting for Philippe very quickly. It quickly becomes apparent that the walk is becoming an obsession for him and you end up just wanting for him to do it to keep himself sane and his relationship with his girlfriend Annie. The actual walk is brilliantly shot and acted and leaves you with a sense of relief and happiness at the end. Being the twin towers it's also a rather poignant story. They were considered ugly concrete blocks, but the daring and inspiration of Philippe's walk gave them a soul and helped New Yorkers fall in love with them. A thoroughly excellent film and you'll finish it feeling a mixture of emotions, but for me it was quite euphoric."}], "recommendations": ["you_were_never_really_here", "the_rover", "hugo", "127_hours", "nocturnal_animals", "the_master", "in_the_heart_of_the_sea", "youth", "first_man", "the_place_beyond_the_pines", "magnolia", "the_great_gatsby", "last_night_in_soho", "the_perfect_storm", "the_assassination_of_jesse_james_by_the_coward_robert_ford", "everest", "21_grams", "ex_machina", "bringing_out_the_dead", "roma", "the_finest_hours", "good_time", "unbreakable", "inception", "black_swan"]}