{
  "id": 2323,
  "title": "The Witcher: Nightmare of the Wolf",
  "starring": [
    "Theo James",
    "Mary McDonnell"
  ],
  "runtime": 83,
  "genre": [
    "Animation",
    "Action",
    "Fantasy"
  ],
  "description": "Escaping from poverty to become a witcher, Vesemir slays monsters for coin and glory, but when a new menace rises, he must face the demons of his past.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3sLz2yv6vBDWqBbd8rdnNeoJ2kJ.jpg",
  "categories": {
    "plot": 5.777777777777778,
    "acting": 5.1,
    "ending": 4.25,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 2.0,
    "action": 5.7
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Ce long-métrage d’animation est nettement mieux que la série, laquelle n’était qu’un nid d’impostures et un flot de conneries ininterrompues qui faisaient injure à la franchise si renommée (des jeux de CDPR et des livres de Sapkowski).Ce ‘Cauchemar du Loup’ s’intéresse ici à l’histoire de Vesemir, le fameux mentor de Géralt, ainsi qu’à la chute de Kaer Mohren, le haut-lieu des Sorceleurs… Le personnage de Vesemir est dans l’ensemble assez bien développé, notamment son cynisme, ses contradictions et ses regrets, de même que celles de la sorcière antagoniste…Le rythme ne faiblit pas et l’on ne voit pas le temps passer… cependant, si le récit est dense, il s’avère également un brin fouillis, pour ne pas dire désordonné : la narration reste trop souvent confuse, à force de s’éparpiller en rebondissements plus ou moins improbables. La violence et une certaine cruauté propres à cet univers sont en tout cas respectées, ce qui rassure sensiblement…Mais à l’instar de la série, on déplore la ‘woke attitude’ de notre (triste) époque appliquée à un monde totalement incompatible ! notamment, ce côté SJW à la petite semaine et cette justice inclusive socialo-progressiste à deux dollars que l’on retrouve si fréquemment dans les productions Netflix : l’un des sorceleurs est une tante et de nombreux gens de couleur officient comme si de rien n’était dans le folklore d’héroic fantasy slave si riche du Sorceleur ! (c’est une saga d’origine polonaise au cas où vous ne le sauriez pas…).Du côté de l’animation (sous-traitée en Corée du Sud), ce n’est pas si mal pour de la simple 2D (hélas !) sauf vers la fin où l’animation proprement dite marque sévèrement le pas : elle est tout-à-coup salopée dans ce grand final et par ailleurs, le montage devient également beaucoup trop hâché (menu). Finalement, le bilan reste très mitigé entre une impression générale de confusion, une fidélité à l’univers un peu tiède et des enjeux mal expliqués et/ou un peu trop escamotés."
    },
    {
      "rating": "5",
      "text": "Well, in fact, it turned out to be another Castelvania, according to the plot, according to the drawing. It won't change anything if you replace the witchers with Alucard and his gang.There's nothing of the witcher in this story, but that's half the problem. There is no LOGIC in this story. Spoilers. A test in the swamp, when the witchers throw the recruits to certain death. Indigenous Afro-Kadwen people. Full-fledged magic is used by witchers instead of the signs aard and igni. At the same time, there is no hint of Quen, Irden and Axii. The sorceress, paired with a mutant elf, directs the monsters to storm Kaer-Morhen, the peasants storm the same Kaer-Morhen side by side with the monsters. What does all this mean? Lambert is the same age as Eskel and Geralt. Witchers who breed monsters so that they have someone to kill. The fact that after a long time, when Vesemir has time to grow old, the monsters will still not be destroyed, although no witchers will breed them anymore, does not bother anyone.Not a hint of the Conjugation of the Spheres, as if it did not exist. That story with the priest, because of which everything started spinning, is also a brain drain. Vesemir bribed the cook to poison the priest, so that the priest thought that he had been defiled, and hired a witcher to kill the sorceress... The damn plan is simple. Reliable as a Swiss watch, if I understood everything correctly."
    },
    {
      "rating": "2",
      "text": "We didn’t need this. The movie has some good elements, like the drawing and an ok ending. However, the plot is extremely shallow and the overall story just feels like bad fanfiction that just doesn’t fit the style of anything Witcher before it."
    },
    {
      "rating": "2",
      "text": "You can forget everything that was in the books, now the witcher would use signs without drawing them figuratively in the air, nonsense, this anime completely kills the canon, especially kaef when even here the witcher could not make cat's eyes..... I, who read all the books, passed from 1 witcher to 3, I renounce what netflix does, Oh, yes, Witchers cannot show ardent emotions, for example, cry because of mutations, but apparently netflix decided differently) Oh, yes, I don't see Berengar either, well, I put 1 point for a more or less plot and 1 more point for a beautiful drawing)"
    },
    {
      "rating": "3",
      "text": "The movie is good on its own, but in the context of the witcher universe it adds only contradictions"
    },
    {
      "rating": "5",
      "text": "good anime. but nothing related to Witcher Universe unfortunately(looks more as another season for Castlevania)for those who read books and played games it will be really dissapointing."
    },
    {
      "rating": "0",
      "text": "This steaming mess has nothing in common with the books. Soulless cashgrab, same as TV series."
    },
    {
      "rating": "5",
      "text": "I Can say I'm not a huge fan of witcher. personally i just recently have gotten into it. since Ive played witcher 3,and watched the Netflix show. But I can even see that they are trying to cash in on the castlevania series. With the over the top fighting, and with a weak story I found myself wanting to turn it off half way threw. even in vesemirs flashbacks, talks about swindling people from their money, but then hes shocked that they create monsters to continue there life style??????? If anything vesemir would most likely be ok with it. Here you have a man who's driven by coin and then all of sudden he grows a heart. I mean what did he think was gonna happen if all the monsters were killed? it would have made more sense to have had the witch be the one truly making the monsters, and pin it on the witchers. in the end i did enjoy some of the story, the animation was good, and monsters were interesting. But not good enough to get a second look over."
    },
    {
      "rating": "1",
      "text": "Zero Slavic, Norse culture, **** characters, tottaly change monsters. This is abbomination not Witcher."
    },
    {
      "rating": "4",
      "text": "I'll be honest as a fan of the book, games and tv show this was quite a let down. Fight are too extreme and spectacularized, the story is average and uninspired, i was expecting to see Vesemir tackling a Bloody Baron questlike or something like the striga quest. Too much action not much story, the exact opposite of what the witcher should be."
    },
    {
      "rating": "4",
      "text": "The witcher es un mundo de fantasía con un toque de realidad. Las personas sangran, mueren y resisten lo que una persona normal resistiría. Hay brujos y magos, todos estos alterándose y sacrificando algo de ellos mismos para poder ser un poco más fuertes.Los brujos no pegan saltos de 20 metros mientras pelean, tampoco hacen nukes con sus manos, si un brujo le arrancan o le hacen daño, lo sufre como una persona normal (puede aguantar más, gracias a sus mutaciones o pociones) pero al fin y al cabo pueden caerse de un 3 piso y hacerse daño o incluso matarse.Que esa es la gracia del mundo de The Witcher, que Geralt en combate podía ser un maestro, pero si un bicho simplemente le envenenaba lo iba a pasar putas o incluso morir si no lo remediaba a tiempo.No me esperaba nada bueno, pero ufff.... tiene un 4 porque entre muchas comillas el lore es correcto."
    },
    {
      "rating": "1",
      "text": "Despite the gorgeous animation and occasional well-written dialogue, Nightmare of the Wolf is poorly structured, unfaithful to the Witcher lore, and worst of all - abysmally boring."
    },
    {
      "rating": "3",
      "text": "this was extremely disappointing to watch maybe because i held such high expectations for it.it's unbelievable how lore-unfriendly the whole portrayal of the world is, it added nothing of value to the witcher world, this movie felt more like a castlevania ripoff than an authentic take on the witcher lore. Lauren schmidt hissrich you could've just told us it was fanfiction from the beginning lol, black kaedweni aristocrats and gay witchers? give me a break please. i don't take this show seriously as an extension to the witcher, i was just watching for the flashy fight scenes and animation really.the storytelling was shallowly rushed, maybe 90 mins weren't enough for the events to unfold in a proper pacing or maybe it's just terrible writing.as for the characters, they were underwhelming at best. no interaction was that memorable. it felt like the script writers were so self-conscious about their work that some dialogues were too perfectly eloquent to be real. to say it in short, no character felt relatable even papa vesemir and this is coming from a die hard witcher fan. i wasn't attached to anyone and really didn't care about their fates, i was just waiting for the story to end. not to mention the irrational arguments and actions that were made by that sorceress, probably the worst character in the show.and to finish the last bit of the rant on the thing that bothered me the most, and that is the voice acting. the voice acting my dear sirs and madams was pure trash. like seriously what's the point of a human recording his/her voice to represent a fictional character other than displaying emotions or to react in a proper human way to a certain event to bring the character to life? my man vesemir and the others were just reading the script for us. deglan's voice-actor was better than all but the same goes for him.now besides these things i enjoyed the animation and the last fight scene, the final 25 minutes were entertaining and included some interesting moments, but they couldn't compensate the total mess that took place before.the concept had potential to be better but the execution was bad. extremely bad to me personally at least.oh and the honey cake looked delicious."
    },
    {
      "rating": "5",
      "text": "Although visually stunning, the technical brilliance of Kwang Il Han and his team cannot quite make up for the lack of character in this bland Americanization of the beloved source material.Lauren Schmidt Hissrich and Beau DeMayo work to strip away all traces of the Polish and Slavic folklore and mythology that were so brilliantly researched and intricately brought to life to captivate the minds and hearts of the millions who fell in love with the Witcher books and video games.What is left are characters that are 2 dimensional in more than just their artistic style, goodies and baddies with haughty RP accents and generic poorly thought out backstories in a seemingly random somehow multi cultural medieval setting displaying none of the well thought out world building that lays the groundwork for the immersive stories of the books and the games.The \"Story\" itself also goes to several lengths to both ignore the lore of the Witcher universe and in several cases outright break it, delivering a cheap deus ex machina to provide a bad guy antagonist, followed by a rallying of all the good people to fight for a good cause just like the ill received ending of Star Wars The last Jedi.A good feat of animation this is, however Vessimir this is not, and The Witcher this is not, just an animated Marvel film about a generic monster hunter with some shameless stabs at further milking the IP of The Witcher."
    },
    {
      "rating": "4",
      "text": "Netflix ruining again the Witcher franchise… Story and charachter writing is very bad."
    },
    {
      "rating": "2",
      "text": "If you give this trash more than a 5/10 you objectively have no taste and are obviously content slurping inclusivity SJW **** rather than enjoying a legitimate story. lmao.I give it a 2 for being well animated. The story was terrible and the sequence of events were highly inorganic and didn't make sense. The black Kaedwinians, gay witchers, and humans fighting alongside monsters (whom i was led to believe they hated?) to kill Witchers, as well as the bizarre take on the Trial of the Grasses just shows a complete disregard for the canon of the universe. Show was obviously made by people who never read the books or didn't even play the games."
    },
    {
      "rating": "0",
      "text": "Lmao they changed the world rules to favour the storyline. Tetra is a trash character. Feels too anime with the cliches. Who the hell dances to cast spell."
    },
    {
      "rating": "0",
      "text": "Zero Slavic, Norse culture, **** characters, tottaly change monsters. This is abbomination not Witcher."
    },
    {
      "rating": "9",
      "text": "Amazing action, great voice performances, a great story in general even though I wish the runtime would have delved further into the story of a certain mutant illusionist and spent a bit more time on Vesemir's training.Small gripes though, it is overall a really great piece."
    },
    {
      "rating": "2",
      "text": "The Witcher books and TV show take place in a world in a state of change. The world before it had more magic, more beasts, less science and simpler politics. With the problems of the past solved, the current world has become entrenched in petty squabbles. This new Witcher entry replaces that mythical before-time with a dumb place where Witchers were douchey jocks and politics were even stuffier and stupid than ever. Instead of rigorous study and training, 10 year old witcher initates are thrown into a swamp where only the lucky survive. Whoever stumbles out randomly gets superpowers.The combat is full of cringey quips and the dialogue is boring throughout."
    },
    {
      "rating": "2",
      "text": "Normal anime, but nothing related to Witcher. Despite the gorgeous animation, Nightmare of the Wolf is poorly structured, unfaithful to the Witcher lore."
    },
    {
      "rating": "2",
      "text": "This movie is garbage. The main character Vesemir, who is a beloved character in the witcher 3 has been reduced to a clone of Trevor Belmont from Castlevania. His cocky and underwhelming personality makes you dislike him, he is overpowered and watching him single handedly wipe out monsters isnt satisfying. This movie is lazy, every corner that could be cut has been, the characters are easy and generic, the time jumps are hard to place, the main love interest has an american accent despite growing up around everyone with english accents. More effort seems to be put on the woke checklist than the quality of the movie. I didnt give it a 1 because the monster design is pretty true to the game."
    },
    {
      "rating": "10",
      "text": "Great way to know why there are so few witchers left. Few things not perfectly accurate with the books but in summary i rly enjoy it"
    },
    {
      "rating": "9",
      "text": "As a fan of the books I didn´t quite like the first season of the tv show for its unnecessary changes as the doppler, so I didn´t have much of an expectation for this movie as I thought they would try to make a dull copy of Geralt in Vesemir. However I was gladly surprised by it, they created a good original plot, giving background to all the witchers and had overall great animations."
    },
    {
      "rating": "3",
      "text": "I bet 3/10. Pros: Nice drawing style, good combat animation, a reference to Geralt of Rivia. Cons: Weak plot, lack of canon for the books and games of the \"The Witcher\" series. Firstly, the witchers do not cry because of mutations, they are deprived of such an ability, and secondly, the plot is disturbed and the dates are confused with the events of the original witcher. Sometimes a lot of questions arise when viewing. Lots of confusing points. As for the drama, it is very weak. I didn't expect more from Netflix."
    },
    {
      "rating": "10",
      "text": "That was amazing!!!!! I kinda get the haters hating on it due to original lore problems. Haters gonna gate tho. But holy crap that was a good movie."
    },
    {
      "rating": "10",
      "text": "It's a very good movie . You can compare it to the webseries or the game . It is really fun to watch."
    },
    {
      "rating": "9",
      "text": "Definitely worth a view. And for a witcher fan who is open to the possibilities, it's a must watch"
    },
    {
      "rating": "10",
      "text": "Unexpectedly great “Anime”. Had small expectations, but gladly this one really surprised with its action, gore, animation and story. The last one was particularly interesting. We never saw the actual Witcher trials on screen, so there is something fresh for the Witcher lore here. Also, Vesemir is portrayed... differently than we are used to, but it feels natural as the story progresses. Must watch for Witcher fans!"
    },
    {
      "rating": "10",
      "text": "well animated and a nice extra backstory for the Witcher Universe. fight scenes were pretty cool too"
    },
    {
      "rating": "10",
      "text": "Vesemir is badass. Great art, great action, good story.  Some may say that it is not fleshed out enough, but I think it works very well as a good origin story for a much beloved character.And for those whining about it “not being canon enough”, pleaaase shut tf up. Just because you read and imagined something in one way, doesn’t mean it’s the correct way. There is no correct way. Not everything has to be book accurate, content can be added and interpreted in different ways. The Witcher universe has always been open to changes and deviation from the source material."
    },
    {
      "rating": "10",
      "text": "Really good movie. Prequel just before S2 of the series. Hope the movie gets a sequel"
    },
    {
      "rating": "10",
      "text": "That was amazing. Anyone who said this was not the right story of the Witcher was terribly wrong. This movie has a lot to do with books. As a fan of games and books, I know what I'm talking about. Sure, there's a lot of action, but it just work with Vesemir (he's a fencing teacher after all)"
    },
    {
      "rating": "10",
      "text": "This has been a spectacular Witcher experience. Do yourself a favor and enjoy it !"
    },
    {
      "rating": "9",
      "text": "Here you can see what it's like when the franchise gets into other hands. This is an animated masterpiece where you say to yourself: Yeah, this is Canon. It perfectly fills the contents of the Witcher and perfectly fills the subsequent attack on Kaer Morhen, which has been a gap for quite some time. And yet at first time, I was afraid that Vesemir would be completely different character, worries were after the first 20 minutes were cleared. Music was fantastic too. The best The Witcher content on TV ever, quite possibly the last on Netflix. Sure, I could swear at things here like he doesn't do finger games or a few other things when using the sign, but why would I do that. Story is really good and lore-friendly. Better than Witcher's first series ... 9/10."
    },
    {
      "rating": "10",
      "text": "Absolutely amazing glimpse into the past, the animation is superb, the acting is on another level. We all needed this, papa Vesemir."
    },
    {
      "rating": "9",
      "text": "me surpreendeu positivamente , adorei a animação e as senas de ação toda violencia somada a historia cria uma ótima atimosfera"
    },
    {
      "rating": "9",
      "text": "It has all the witcher stuff that we (I) love the most. The non-black-and-white world that boasts imperfect characters - the \"good\" guys who don't always do the best things and who also screw up. The \"bad\" guys who want to do good and believe they do. The various issues troubling the society, both masses and minorities. A beautiful love story. Amazing combat - anime style, not faithful to the books (but it's fine). A fair, fair portion of lore in it's own adaptation. It's a really great (shonen, I believe?) anime and holding true to that, it changes some things up in the source material. It's definitely to be taken with a grain of salt. But it has managed to pack a lot of good stuff in the short 1.5 hours that it lasts.I suggest keeping an open mind and taking the movie for what it is - a Witcher inspired anime that offers great story, characters, additional backstory and some stunning visuals. I'm also not stating that what was shown that doesn't contradict the books is now to be considered canon, just like other Netflix and CDPR productions it has it's own story and it's up to each of us to treat it as we like. But it was cool and interesting nevertheless.I give the movie a really strong 9/10. After the books and then games, it's my 3rd favourite installment in The Witcher universe."
    },
    {
      "rating": "10",
      "text": "Really good movie just another nice addition to some Witcher we need more Witcher !!"
    },
    {
      "rating": "10",
      "text": "On par with the Castlevania anime, which was also amazing. The musical score was fantastic as well, reminding me of the games and the live-action show."
    },
    {
      "rating": "10",
      "text": "Git film bardzo mi się podobał ładna animacja nie nudna historia i rozwija uniwersum wiedźmińskie"
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "10",
      "text": "This is great, looked in one breath.  Music, characters, monsters, everything is beautifully performed.  The plot is very interesting, this is the best thing that I have watched in the last year."
    },
    {
      "rating": "9",
      "text": "Nightmare of the Wolves is an adaptation made for the fans who where first introduced to the series through the video game franchise. Subtle nods and references are a great touch. The movie is complimented with outstanding voice acting performances and beautiful animation. A big drawback the film has is its goofy use of CGI although it does work in some moments. The story is nothing deep and follows typical fantasy story beats, although a lot of the dark subject matter tackled here is done very well. I highly recommend this movie to any fan of the Witcher series and to anyone looking for an action packed movie once they’re done binge watching castlevania"
    },
    {
      "rating": "6",
      "text": "so ill keep my thoughts brief, this movie is honestly pretty average, held up mainly by the amazing animation and cool actions scenes that hit the right amount of boom to keep you watching, and its not afraid to show gore which is exclent.however good animation and such cannot hold a movie up completlely and with everything else the movie sadly falls, lets take for instance the charcters if your a major fan youd probaly know everyone (i think) but if your a guess lesser fan like myself youd only realy know vessimir and without knowing the other charcters they have realy no weight and the movie doesnt do enough to make you give a **** if it was a series then maybe we could have dedicated time to learning those so newer people could enjoy but as a movie their wasnt enough.honestly can sum this up as \"if you want to watch a movie/series about monster hunters slaying the terrors of the night go watch castelvania\" which yeah is true and i understand some might go \"o you just wanna **** on it you castlevania fanboy\" or whatever but no i did enjoy the movie and honestly if it was maybe an extra hour or even 30mins i might forgive more cause wed have seen more, but as it is it just doesnt hold up sad to say, i do hope we will see more cause like the castlevania series it deserves more and to see more of the wonder, and i truly hope the people who made this realise this and use this as a building block for morethank you for reading it all i just thought it was worth talking about."
    },
    {
      "rating": "10",
      "text": "Absolutely amazing. What a beautifully told story. I was absolutely blown away."
    },
    {
      "rating": "7",
      "text": "The Witcher: Nightmare of the Wolf is a fine movie, it would've been better if they didn't specify this as being a prequel movie about Vesemir's past and just used an original Witcher of their own creation as there are some inconsistencies between this Vesemir and the ones from the books. (For example, the name of his mentor figure)Art & animation 9/10What I'm here for. The style, animation and character and monster designs all look fantastic and are definitely the high point of the movie. My one complaint would be that some of the fights are a bit *too* over the top, making the Witchers look more like demi-Gods than simply mutants whereas the books and games to a lesser extent definitely made it believable that they were still at least somewhat human and somewhat vulnerable.Audio 7/10Music is good and gives off some of the same vibes as certain scores heard in the game, though the song at the start was god-awful (though I assume that was the intent). Voice acting was...good to decent for important characters, less so for everyone else. The voices of any child characters was especially awful, though. At least in my book.Story 6/10The story feels fairly fractured, trying to focus on both Vesemir's backstory and the eventual attack on Kaer Morhen that would eventually lead to the downfall to the School of the Wolf. I would have preferred if they focused on one or the other as both stories are certainly interesting but neither seem to get quite the attention it deserves to truly shine.Overall verdict 7/10The Witcher: Nightmare of the Wolf looks very impressive, but otherwise isn't terribly memorable and doesn't quite *feel* like a Witcher property. Focusing too much on the big action and fight scenes and too little on the characters and the atmosphere. What scenes that do certainly stand out, however, and as mentioned before the artists and animators deserve a lot of the credit for making this movie what it is.Hopefully any future animated Witcher content will also try to go the extra mile when it comes to writing and voice acting."
    },
    {
      "rating": "9",
      "text": "Totally awesome, we had to miss Witcher stories for some time but now we can enjoy one again. This story is not totally canon but d*mn, it really shows how far you can pull the Witcher universe in anime. Really good drawing and voice acting. If you are a Witcher fan this is a must watch."
    },
    {
      "rating": "8",
      "text": "Good movie, but treat him like a fan fiction movie when you watch him.Realy don't get the hate..."
    },
    {
      "rating": "10",
      "text": "Just really good. Thanks that's it you just need to watch this movie. I think that it is a Great addition to the witcher franchise and a  great look at Vesimir In his youth."
    }
  ]
}