{"id": 1619, "title": "The Autopsy of Jane Doe", "starring": ["Emile Hirsch", "Brian Cox"], "runtime": 86, "genre": ["Horror", "Mystery"], "description": "Father and son coroners receive a mysterious unidentified corpse with no apparent cause of death. As they attempt to examine the \"Jane Doe,\" they discover increasingly bizarre clues that hold the key to her terrifying secrets.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/6K0wjP8kPCiPYy9PtXBGuypyt5I.jpg", "categories": {"plot": 6.703703703703703, "acting": 6.75, "ending": 6.470588235294118, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 3.0, "funny": 8.0, "action": 8.0}, "reviews": [{"rating": "7", "text": "The one corpse no coroner want to mess with!And this is something different. Actually, no films are different these days, but it has succeeded to shape differently with an already known platform. Except the small parts of the opening and the ending, the rest of the story takes place in a postmortem room and its building. It is a one night story and revolves around two characters, a coroner father and his assistant son. After receiving an unidentified body to examine, the son decides to stay back with his dad by dropping out the plan to go a date with his girlfriend. As the procedure begins, the night goes on. But at the half way through, they begin to experience the strange events. And once it goes beyond their hands, they try to survive the threads that come their way which pretty much the rest of the film.A short and sweet horror. I mean no sweet, but very effective theme. There are lots of things you won't understand, even the film does not explain them for us. But if you sit back and think about them after you have watched it, you would get many perspectives, like about the corpse, and what happened at the end. I could have revealed mine in here, but it would only spoil your watch if you are yet to see it. Overall, there's nothing serious you are going to miss any details. Except one question that nobody sure about is who is/was Jane Doe, I mean her background story that linked to this film event. Only a prequel would explain that. So I hope they make one quickly. Meantime, don't miss it if you're looking for a decent horror film. Because it's much better that any recent horrors.7/10"}, {"rating": "8", "text": "Effective horror movie in minimalist and claustrophobic atmosphere. The minimal of cast -and the writer- does the best effort for cause the chills, altough in the climax the plot stumbles with own feet. No popcorn, please."}, {"rating": "1", "text": "I don't know what to say after watching this. So ridiculously, and so pointless."}, {"rating": "9", "text": "Stephen King said that this film made him as tense as the original Alien did. I'm inclined to agree with him -- one of the best horror movies I've seen in a long time. Watch this movie at night by yourself."}, {"rating": "6", "text": "This first half of this movie is mostly a father and son talking as they go about conducting an autopsy on a 20-something young woman. So what you get are two actors and an attractive woman lying naked on a table - with no attempts made at all to hide it; so the movie is full of the most unusual nudity you can think of- in the most unsexy circumstances possible. In most stories the characters engage in a lot of physical activity and move from one setting to another. It's a risk for a movie to limit itself to one setting and use only a couple of characters as this one does. There are more actors but their time in the movie is very limited. It's almost exclusively these two guys. If you think you can't deal with such a movie, don't watch this. But when I saw the trailer I was hooked. The young woman was found in a home where all the residents had been murdered. But she wasn't a resident. And she was found naked half buried in dirt in the basement; she was not killed while going about her business doing something normal in the house like the residents of the house were. As they do the autopsy they start to find weird stuff in her body, and the situation gets weirder from there. I would have given it more stars if not for a few big errors. Something very terrible happens, after which the father starts talking about the mistakes he made regarding his wife and how the son suffered due to that. This is fine to give the story some emotional depth, but it's the wrong moment. It doesn't work. What has just happened was too terrible. The father wouldn't have chosen that moment to say these things. They should have found a way to work it in before the terrible event. In fact, the way the two characters carry on after this event - within 10 minutes they're having conversation as if this event didn't happen - is totally unrealistic. Of course, the events of the movie are crazy due to the genre - but the way people react should be realistic. The ending is kind of cool but there's no reason it couldn't have happened earlier, much earlier, right at the start, in fact. And what the son does near the end - is also unbelievable. Also, one more problem, is that something that seemed to be happening, which seemed to be the ultimate point, did not happen; the ending would have been much better if it had. So I give the movie points for originality, but a couple of major missteps that could have been avoided if they'd just worked on the script some more, take it down to a 6.But be warned, really scary."}, {"rating": "8", "text": "No spoilers here, this came completely from left field. If you are a horror/suspense fan, you owe yourself this. For better viewing, skip the trailers and reviews and just get it. It works best when you're devoid of the premise."}, {"rating": "8", "text": "A truly chilling, sometimes uncomfortable, thriller for the year.The Autopsy of Jane Doe does it all. It makes you feel uncomfortable, it will send chills down your spine, it had me peeking through my fingers and saying oh my God. Andre Ovredal knew exactly what he was doing with this one, and he manages to get the job done in just under an hour and thirty minutes.The film centers around Tommy and Austin Tilden, portrayed by Brian Cox and Emile Hirsch respectively, a father-son coroner duo. Now, if I was going to pick a profession to have with my child, I don’t think I would choose to work in the morgue, but hey, you do you Tilden’s. First of all, let’s be real, any type of situation where a movie takes place in a dark basement morgue is gonna be a little creepy even if you don’t get scared easily. The bond you can see between the two characters is apparent from the very beginning of the movie. The characters are close, all each other has for the most part.The beginning of the movie also shows us police discovering the body of a female buried in a basement of a home they were doing a raid on. She appears to have no signs of any kind of struggle on her body, nothing to indicate cause of death. The home doesn’t show signs of forced entry. So who is this woman, and what happened to her? We have our Jane Doe people.We meet Austin’s girlfriend Emma, who seems like a real peach to be around. She tries to convince Austin to leave with her since they had plans, but he says he cannot leave his father until the job is done. He asks for a little bit of time and then he will meet her. You should have left Austin, you should have left. The police bring in ‘Jane Doe’ from the basement, and the two must figure out a cause of death. This will prove to be more difficult than either of them imagined.You get to see all the gory details of an autopsy, and if you have a weak stomach you might want to cover your eyes. It’s bloody, disgusting, gory, and totally awesome. You know when you’re watching a thriller/horror film and a happy song starts playing on the radio or it starts storming it’s going to be bad, right? What about when both of those happen? Chaos is bound to follow. Now, I’m not going to give away any more details because I think you need to be one hundred percent invested in this movie while knowing the least amount as possible about it.I haven’t watched a horror film that I enjoyed as much as this one in a while. There’s a little bit of a twist, lots of gore, and a few subtle, but well played scares. It’s worth the time and your undivided attention. It will make you never want to enter a morgue, I don’t know why you would EVER want to anyway, but if you ever had that feeling it will be gone after this. Olwen Catherine Kelly plays the part of Jane Doe, and while she doesn’t have to do much the entire film, her performance is the most chilling. Her face will be etched into your brain for the rest of the night. I already want to see what she’ll be doing next.And, hopefully, on your drive home you don’t hear any bells."}, {"rating": "6", "text": "A real head-scratcher as to what I shall award this. Whilst I enjoyed the gore, the middle of the film sucks (becomes a silly generic horror with retarded jump scares), but the beginning and ending are top-notch. So I'd say, a solid 6. Yes. A 6/10."}, {"rating": "7", "text": "Day 24: Morgue fest continues, this time with one that comes somewhat touted and recommended.Emile Hirsch and Brian Cox make up the cast and they're both good dependable co-leads. This film begins with a nearly suffocating claustrophobic atmosphere, one in which the outside world can't possibly exist and there's only the starkly lit mildewy wooden paneled interior of an old family morgue. The mystery mounts and the two leads examine an inexplicable body, one in which they can't find a cause of death. The body is untouched and yet her insides show unbelievable trauma.The mounting atmosphere and tension of the first half is unfortunately mishandled in the second half. The film becomes a rather bare-bones spooky jump scare exercise that leads to a shocking revelation that really does deliver (it's genuinely intriguing and so much more could have been done with it) on the first half's tension. There's no follow through.There are great ideas here but a lack of focus in the middle, or maybe a fear that if jumps in the night didn't start happening soon the audience would get bored. It's the complete opposite."}, {"rating": "10", "text": "The Autopsy of Jane Doe (2016)Sinopsis:Dos forenses, padre e hijo, investigan la muerte de una hermosa joven sobre la que nadie sabe nada. A medida que descubren más información, más se adentran en una telaraña de indicios y hechos extraños y desconcertantes.Opinión:No tenía idea de esta película hasta que me la topé en un video top 10 de YouTube y fue una muy grata sorpresa, a simple vista da la impresión de ser una película al estilo Cadáver del 2019 pero lo único que comparten en común es que ambas se desarrollan en una morgue, aquí todo se basa en una autopsia que se por si empieza muy fuera de lo común al ver las anomalías de la mujer muerta con cara de maniquí, hasta que de a poco el thriller empieza a hacer acto de presencia solo para que al final corra el dicho de que la explicación mas simple casi siempre es la correcta, pero eso no lo veía venir claro está.La trama es buena, pero su desarrollo y planteamiento es aún mejor por mas sencillo que parezca, las actuaciones son sólidas y creíbles, contiene uno que otro jumpscare, pero esta película es mas suspenso que terror, la verdad esperaba algo genérico y predecible, pero pese a la premisa sencilla, me atrapó desde el primer momento, muy buena"}, {"rating": "8", "text": "An extremely eerie and truly foreboding mystery/horror film with fantastic premise and camerawork and great acting by Hirsch and Cox. It's highly unpredictable and very creative with some intriguing little points throughout. Definitely one of the more under the radar horror genre films that should be watched."}, {"rating": "7", "text": "I wouldn't really say it's a horror movie but it certainly was intriguing and kept my interest until the very end. I do think that the final act is where the movie kind of falls apart and the ending wasn't as good as it could have been. Still, That didn't stop me from enjoying it and I'd certainly recommend it."}, {"rating": "2", "text": "Good acting, effects, cinematography, sound and use of light. Imagine getting all that things right, and getting a score of 2 out of 10. Proof that you can achieve a really professional looking picture, but if the script and premise sucks, your movie is going to suck."}, {"rating": "6", "text": "Norwegian director Andre Ovredal of Trollhunter fame is back and ready with another chilling horror flick. Unfortunately, The Autopsy of Jane Doe gets half way to the end and then decides to just put it on autopilot with an asinine twist that ruins the film. Up to that point though, I was terrified. Ovredal set the perfect atmosphere, shot everything gorgeously with creepy lighting, and turned an autopsy into one of the most riveting cinematic horror experiences I have had. But then, like something out of late-2000s M. Night Shyamalan, he decides to add in a twist that makes you want to lay on the floor and cry out, \"WHY?\" Honestly, Shyamalan may have turned down the twist and said, \"No thanks, that sounds stupid.\" This is a shame because the first half is tremendous.Adorned with gorgeous production design and creepy lighting, what better place for a horror chiller than a morgue? Andre Ovredal knows this and makes his old morgue setting feel fresh and new. It is a setting that is begging to be explored. How do you make it even better? Mystery. Not only is this place creepy, but Tommy Tilden (Brian Cox) and his son Austin (Emile Hirsch) are tasked with performing an autopsy on a Jane Doe. Found buried under a family's basement, the entire family was found dead and this woman was not related to any of them. Since she was buried under the basement, the sheriff feels the clock ticking to figure out who she is and how she died to satisfy the press. So, he dumps her body off with the most trusted coroners in the county to get an answer before morning. But, what they find baffles them and leaves them running for the exits.Touching on elements possibly regarding the occult, these two coroners put their minds together to try and figure out how this girl died, but it keeps leading them to one to one conclusion: she very well may be alive? But how? She has been gutted and cut open. Her wrists and ankles are broken. Well, you will have to watch to figure out, but do not get your hopes up. It is a film that has all of the atmosphere in the world when it starts up, strong writing, good acting, and a killer location. The odd part with the ending is that is not even derivative. The final act is like something I have not seen before in a horror film. Despite its faults, it is most certainly original. Unfortunately, everything original is not necessarily good. The Autopsy of Jane Doe is very much an example of this. Its final act does contain derivative elements, but its reasoning is incredibly original and dumb. The cliches and derivative portions of the final act are bad, but not nearly as bad as the reason they are all happening. This reason truly breaks the atmosphere and leaves the audience wondering how it could have all gone wrong so quickly. It is an original idea left on the cutting room floor of dozens of prior movies.That said, the aesthetic of this morgue is unparalled. The opening is tense, creepy, and truly sets the tone for a great horror film. I was all set to highly recommend this one, but not it is just a mild recommend to see something go off the rails. Had the ending not been so tremendous, this one would have a majorly disappointing follow up to Trollhunter from a talented and very promising director. As it stands, it was a good effort that shows why he is so highly thought of, but he needs better material."}, {"rating": "7", "text": "When I heard that André Øvredal, the writer/director of the Norwegian romp \"Troll Hunter\" was going for a true horror movie in his follow-up, I was excited. \"Troll Hunter\" was a great ride. The first half is absolutely excellent - a captivating mystery unfolds as layers are peeled back exposing tantalizing clues to \"Jane Doe's\" fate. Unfortunately, the last half moves into familiar genre territory with jump scares and typical horror tropes. But that first half more than makes up for the mediocre second part making it an overall enjoyable experience."}, {"rating": "5", "text": "It had potential to be really good, but the first 30/40 minutes happen nothing really happened. other than the dad character there were bland . 2nd half picked up then it became very predicable towards the end. dont listen to the hype for it wasnt good . story wasnt interesting for me to care"}, {"rating": "6", "text": "Though this film did have a lot of promise and originality it didn't speak to me as much as some viewers. The autopsy itself, the film was really not that interesting and became quite predictable towards the end. I was hoping for more given the critical hype."}, {"rating": "8", "text": "GREAT GREAT GREAT!!! From Kubrick's Shining i didn't watch something so amazing and really SCARY!!! Great movie with few money, few effects, much much thrilling and a real growing plot with a sensational end!!! :-D8... little movie, great \"sensation\"... suggested to ALL HORRORS FUN!!! Horror genre has finally re-born :-D"}, {"rating": "9", "text": "It is arguably one of the best horror movie of the year. The acting was really good, the movie was suspenseful, the practical effects were really well made, the story was interesting and the movie was entertaining. What more could you ask for?"}, {"rating": "5", "text": "The Autopsy of Jane DoeA great movie is always unique. A standard movie has a good plot, screenplay, characters and direction as well as cinematography.I believe this movie had the potential to be in the list of standard movies but why did it dissatisfy me? A movie dissatisfies you when you're able to predict the outcome, especially for a horror movie.I liked how the evil possessed the father, and made it sacrifice for her own preservation. I liked how the film devolved and was getting interesting grabbing all our attention. But where was it leading to? It's constrained itself to the idea of autopsy. It could not get out of it and performed more!What has it achieved that we haven't seen in low grade films? The way our characters die, same old delusional tactic. The way most of such horror violent movies end, killing them all. And we usually don't have much of clue what happens!The evil prevails, innocent characters die. Don't tell me to interpret or think about the story of jane doe. That's not my job, but the director's, producer's or screenwriter's. Has they talked about any sequels? Take \"it follows\" for example, what the director left for interpretation, is irrelevant and unnecessary to the main plot. It is a great movie because it achieved its purpose and became more than a movie. It is an art and an inspiration for cinematographers and directors. But what has The Autopsy of Jane Doe achieved? Did it scare us? Was the plot completely unique and original? The lights flickering, doors closing, abnormal noise in radios, the dead body walking, are they new to us anymore? The characters, from a little effort because they always get a clue accidentally and sometimes with no effort as if the director was pushing so hard to reveal us, apprehended that this girl is a witch from the seventieth century and was tortured like all those innocent girls of those times and she'd continously revenge whoever tortures her living dead body. I think this's an idea of a scene without a story, it is an experiment that failed leaving us a feeling of disappointment."}, {"rating": "8", "text": "A Disruptive Serendipity In The Horror GenreIs there anything better than a feature film of your predilection to catch you unprepared? Personally, I don't think so. Such awe has been experienced by a considerable portion of fussy cinephiles who attended the screening of a contemporary gem that came out of the Sitges Film Festival. Winner of the Special Jury Award at the last edition of the festival, \"The Autopsy of Jane Doe\" is the brand-new ambrosia of the filmmaker who gained universal distinction seven years ago with an improvement of the currently infected mockumentary.The story takes us to the basement-morgue of the Tilden family: an old man and his son, two coroners who spend days inquiring into the justification of the death of thousands and thousands of lackadaisical and whitish organisms. While Tommy is looking for the right way to inform his father about his desires, the sheriff unexpectedly bursts into with an unscathed female corpse found at the scene of a crime in Virginia. Father and son initiate a detective journey to know the cause of her death, stumbling upon endless unnatural inconsistencies that trigger in a manic game of cat and mouse, only here cat is dead (literally).I miss the time when an interesting story, an exceptionally gifted and a perceptive director was enough to make a horror film with possibilities of becoming a classic. And that's how many of the film summits are forged, movies whose exclusive pretense is to portray the malignancy while simultaneously elevating with formidable simplicity our cortisol levels, in other slang, spend a creepy pleasant time. Now, that vintage horror hasn't disappeared today, at least in form, since there are millions of remakes and reboots. However, in treatment and essence, only an indie directors clan and a negligible number of commercial filmmakers manage to retake these old-time techniques by giving them an intelligent and equally terrifying stamp. So André Øvredal joins this restricted list with a necropsy to evil.The film handles a progression of radically impracticable features in the field at present. It's a formidable elaborated horror experiment that benefits from Brian Cox's and Emile Hirsch's compatible performances as Sherlock and his fellow, a relationship with fascinating affability the thread narrative, promoting that the characters get along with audiences in the almost excellent first half of the story.This is a sample that a solid tale, narrated in a successful way, doesn't presuppose pompous visual effects. It's a new trend provided by the overwhelming indie movies. Classified as \"art cinema\", Øvredal's work was truly electrifying to me, not as indie one, it had the facade of a work at the hands of a low-budget film studio, with properly American twists and conclusions but with developments, strangeness and stimulating resolutions capable of generating stupor.It's a first rate mise-en-scène, benefiting from the oppressive dismal sets, plus incidental musicality, atmospheric shots of the lacquered wooden corridors, the metallic edges of the morgue or the outdated and gloomy elevator. Space manipulation deserves its own section, no doubt, one of the best-achieved aspects of the whole film, using mirrors, shines, visual distortions, blind spots and above all opacity in order to make assistant's hair stand on end, unprepared people with the conception that they would witness pig's breakfast. What a surprise!Unfortunately, it's not entirely perfect and in the ending, we feel a certain hesitation, symbolizing the confusing narrative conclusion, a double-edged sword, in addition, it doesn't detach from clichés and unjustifiable scares in the genre, however, they're bearable but frustrating. Just imagine you're embedded in the remotest darkness, but, you're not the only one in the place, you have the pleasure of having as companions to six corpses that are no longer within their corresponding cold rooms, you glimpse in the black mess that everything is upside down and in the middle of the scene lies a woman as pale as snow, unleashing unimaginable horrors, but suddenly, you spin around and a face with a mouth sewn shut catches you by surprise. Just disappointing. How you can have so much, and then nothing.\"The Autopsy of Jane Doe\" cleverly uses as McGuffin the lady who gives name to the film, meanwhile, Øvredal performs us a satisfactory autopsy on the most frightening fears that are on our minds as parasites, which can be synthesized with two succinct words: the unknown. We know absolutely nothing, the only thing we know for sure is that, at any moment, this pendulum of situations can break down. A story with an uncertain ending, but it executes an author film worthy of dithyramb, a work annexed to the best of the last years in terms of horror, a grand guignol proposal as electrifying as unexpected with an exciting 80's aroma that leaves no one indifferent."}, {"rating": "8", "text": "Ein sehr intensiver Horrorfilm, den ich aufjedenfall weiterempfehlen kann. Man spürt dauerhaft eine Anspannung beim schauen."}, {"rating": "1", "text": "Petit film horrifique mais plus bizarre et désordonné, plus surnaturel et tordu que vraiment horrifique... Evidemment, ça se passe entièrement dans une morgue avec des macabés qui jouent des clochettes et dont l'une (une très jolie fille, la dite \"Jane Doe\", le nom que l'on donne aux inconnues) fait de la résistance paranormale à son autopsie.Ce bon vieux Brian et le jeune Emile sont très bien mais n'arrivent pas à sortir le film de son marasme d'incohérences superstitieuses, lesquelles se noient à la fin dans un dénouement totalement nul à chier, quel que soit le bout par lequel on daignerait les prendre, y compris avec les pincettes de l'extrême indulgence.Grosse déception donc, car la mise en scène est tout-à-fait présentable mais avec un scénario aussi indigent, aussi bâclé, on ne pouvait s'attendre à autre chose. Comme disait mon trisaieul (un sage parmi les sages), \"avec de la merde, on ne peut faire que de la merde\"."}, {"rating": "6", "text": "By the halfway point nearly all credibility has escaped through the basement hatch, but The Autopsy of Jane Doe remains a claustrophobic little fright."}, {"rating": "6", "text": "Fails to explain, but doesn't fail on making an impact...Paranormal, intimating and leaving the idea of a possible sequel (altough these would kill the emotion of the first)...That close shots of her face always kept me cringing"}, {"rating": "8", "text": "It's a decent horror movie. Much better than The Possession Of Hannah Grace."}, {"rating": "7", "text": "While the story itself is less than airtight, this is a tightly-directed, effective little creepfest!"}, {"rating": "1", "text": "THIS Movie IS BORING AND ALSO THE STORY IS NOT EASY TO BE UNDERSTOOD. DON'T WATCH THIS MOVIE, IT WASTED YOUR TIME"}, {"rating": "2", "text": "I am at a loss to understand why this movie has received good reviews. Yes, it was suspenseful in parts, but it really strained credulity. And may I just say that it was ruined for me by its TOTAL lack of historical awareness. Women in Salem in 1693 did NOT WEAR CORSETS, for heaven's sake."}, {"rating": "7", "text": "Puede que no se trate de una obra maestra, pero su propuesta es original y su desarrollo bastante solvente, con un terror que se sostiene más en un suspense inquietante que en los sustos enlatados."}], "recommendations": ["oculus", "annabelle_creation", "a_cure_for_wellness", "the_forest", "the_invisible_man", "the_lodge", "the_skeleton_key", "1408", "the_rental", "lights_out", "winchester", "the_ritual", "ouija_origin_of_evil", "the_woman_in_black_2_angel_of_death", "the_mothman_prophecies", "annabelle_comes_home", "the_night_house", "mirrors", "identity", "the_boy", "us", "a_quiet_place", "paranormal_activity_the_ghost_dimension", "scary_stories_to_tell_in_the_dark", "insidious_chapter_3"]}