{"id": 1069, "title": "The Godfather", "starring": ["Marlon Brando", "Al Pacino"], "runtime": 175, "genre": ["Drama", "Crime"], "description": "Spanning the years 1945 to 1955, a chronicle of the fictional Italian-American Corleone crime family. When organized crime family patriarch, Vito Corleone barely survives an attempt on his life, his youngest son, Michael steps in to take care of the would-be killers, launching a campaign of bloody revenge.", "releaseYear": "1972", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/3bhkrj58Vtu7enYsRolD1fZdja1.jpg", "categories": {"plot": 9.35, "acting": 9.484848484848484, "ending": 10.0, "soundtrack": 9.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 10.0}, "reviews": [{"rating": "10", "text": "Like Babe Ruth is to baseball, like John Steinbeck is to writing, their is no doubt about it, The Godfather is the greatest film of all time. Never before have we seen performances so stellar, by Marlon Brando, Al Pacino, James Caan, Robert Duvall, and everyone else! The Godfather has little life lessons everywhere. Along with an engaging plot, that just completes the most critically acclaimed film of all time. The Godfather is Francis Ford Coppola's masterpiece."}, {"rating": "10", "text": "I dare Hollywood not to remake one of the most important movies that still can be talked for a generation. The Godfather, the Citizen Kane of Gangster movies, and of course, the J.R. Ewing of American cinema."}, {"rating": "10", "text": "Perfect in all the departments 'The Godfather' is a masterpiece by Cappola. Fulfills, in fact sets, a new definition for an all time classic. If you are a true movie lover, you'll adore 'The Godfather'."}, {"rating": "10", "text": "The critic score says it all. It is either you love this movie, or you didn't understand it.    see this"}, {"rating": "10", "text": "This is a punchy, brutal and gripping tale of family values and business that offers an unrivaled insight into the world of the mafia. All the talk of honour sends a shiver down your spine, at the seriousness  and intimacy of the bond between a man and his godfather. Armed with a great cast, and beautifully written script you cant go wrong with a film like this. A true classic"}, {"rating": "10", "text": "I forget The Godfather  is in my list of masterpiece Taxi Driver (1976). Carrie (1976). The Silence of the Lambs (1991) . 12 Angry Men (1957). To Kill a Mockingbird (1962) . Scarface (1983). Seven (1995) ."}, {"rating": "10", "text": "Best movies I've seen in this year is Looper and batman the dark knight rises  ,my all time favorite movie's are  The Godfather (1972) .Taxi Driver (1976).  Carrie (1976). Scarface (1983). GoodFellas (1990) . Raging Bull (1980) .Casino (1995) there masterpiece movies, what i don't like are the silly remakes why a new carrie movie ? this is the 4th movie carrie the made it's just stupid ,Sissy Spacek and Piper Laurie are absolutely perfect ,they both got Oscar nominations out of it, for God sake!"}, {"rating": "10", "text": "The best film I have ever seen. May get a fair amount of criticism nowadays but to think that this film was made 40 years ago, that's pretty incredible!"}, {"rating": "9", "text": "Excellent movie! The Godfather is the perfection. Excellent plot and everything else. A must-watch masterpiece. That's the only 9 which I gave (games included)."}, {"rating": "10", "text": "A ceaselessly compelling and undeniably perfect film with unforgettable iconography and legendary performances everywhere. Classic."}, {"rating": "10", "text": "One of the best ever, strong at every level whether its from directing to any pinch of make-up it suceeds."}, {"rating": "10", "text": "The Godfather requires a level of maturity to completely understand the story. It's not for everyone but once you realize it's to your taste you will get pulled in the story and 3 hours will go by unnoticed. Having said that, it's not an action film, it's a drama. So if you disliked it because it didn't excite you, you clearly went to the wrong movie. A masterpiece, deserves it's 10/10 score for producing a brilliant, memorable mob drama!"}, {"rating": "8", "text": "Everybody knows how good The Godfather is meant to be, and while the 100% may not be fully justified it is definitely a work of surpassing excellence. Francis Ford Coppola perfectly chronicles the late life of Don Vito Corleone also known as The Godfather. Simply witnessing all of the hugely famous scenes and impeccably written lines is an enjoyable experience. Yes it goes on for 3 hours but sitting through the whole thing is undeniably worth it. Some scenes are much more gripping than others, basically Marlon Brando's screen time is the best thing about it. However every second is interesting and almost deserves the 100%, I found it to be masterfully acted and with some brilliant direction, but the most impressive aspect of The Godfather is undoubtedly how engaging every second is despite going on for 180 minutes. I would say it's worth watching but it's cult status ensures you were going to anyway."}, {"rating": "10", "text": "This is the closest thing one can get to achieving perfection. This movie showed that you don't need consistent foul language or gruesome violence to make a movie. While there is some violence in it, this movie was nothing like some other mob movies out there (Scarface comes to mind). This movie presented a shadier side of the American world in a classy, interesting way. I could go on for an hour about why this movie is so perfect but I think it can speak for itself. If you haven't seen this movie yet, I would highly recommend doing so."}, {"rating": "10", "text": "Um filme tão denso que você pode passar anos e anos assistindo e ainda se surpreender com as camadas da história. Muito mais que uma aula de cinema: Uma verdadeira lição de Vida."}, {"rating": "10", "text": "The Godfather is a masterpiece. With superb storytelling and incredible acting, this film is not only the greatest crime film ever created but possibly the greatest film ever!!!"}, {"rating": "8", "text": "If you ask me: \"what is the best movie of all time?\".  I will say: \"It is NOT The Godfather\". Yes, a lot of people around us say it is the best movie they have ever seen. But most of them literally know that they know and undersand few about this movie and they are repeating what others say!!!"}, {"rating": "10", "text": "The perfect film. There's not a better overall film out there. Not Citizen Kane, not 2001, not Casablanca and not Raging Bull. This film is a work of art and it's sequel is the greatest sequel of all-time(sorry Empire Strikes Back). The Godfather is a masterpiece."}, {"rating": "10", "text": "Simply the best movie of all time, I know it sounds cliche, sorry to disappoint   but the harsh truth  Movie more closer to perfection  doesn't exist."}, {"rating": "10", "text": "There are movies that I cannot judge with no bias as to its popularity. This is one of them. Consistently said to be one of the greatest movies of all time, what I found very fascinating about it are Marlon Brando, and the movie's authenticity. I read the book after having watched the movie. So, each and every page I went through, I couldn't help getting Brando's image on my mind over and again. I mean, I am so absorbed in his acting that I started living alongside him for the few days in which I went past the book. And the authenticity, yes, it sure enough has enough to make viewer feel it's been made amid 1950s Newyork. And there were this one-liners  Offer you cant refuse and all. Add to the terrific things, Tom Hagen  yes, I still recall Duvall as Hagen  and Al pacino. Pacino in particular takes acting to a new level. Things only he can do with absolute coldness. It is a well made movie with one of the all time great cast giving out brilliant performances. I also would like to add, I still prefer the part 2 over this one, partly because of the fact that I am floored by De niro and Pacino in it and owing to some personal affection."}, {"rating": "10", "text": "Greatest movie of all time enough said... about 5 of the best actors of our life time all give oscar performances.. best acted film of all time and not to mention the best screenplay of all time.. love pacino in this but brando, caan, and duvall also give us oscar perfor.. does not get any better than this.. at least i havent seen it yet"}, {"rating": "10", "text": "The Godfather is one of the greatest films ever made. Marlon Brando, Al Pacino, James Caan, Robert Duvall, Robert De Niro  it can not get any better than that."}, {"rating": "10", "text": "Seems impossible anyone can make any movie better than The Godfather especially in the drama genre,\rIt is by now thoroughly integrated into American life, and the film had the largest impact.\rSome characters will remain ever and ever in the cinema."}, {"rating": "9", "text": "Review Date: July 24, 2014. Movie Review #1: The Godfather\r If I ever get a job offer to write Movie Reviews and get paid for it, it is an offer I can't refuse. This movie is often quotable to those that have seen it and it is no surprise that this film affected pop culture to a certain degree. There was a time where it got a lot of dough and was a hit which in turn became the highest grossing motion picture at a time back in the 1970's when The Godfather succeeded in the box office. Times have changed and this film is no longer the highest grossing motion picture but still to this day, it still remains as a remarkable film. Is there anything that has not been said about The Godfather? Probably not, but that is not going to stop me from sharing my thoughts regarding Francis Ford Coppola's masterpiece.\r The Godfather is a tale of a New York Mafia family and their struggle to protect their empire from rival families as the leadership switches from the father to his youngest son which carries a heavy weight.\r This film often gets praised for its acting and that's no surprise there. Even though The Godfather ended up as a trilogy, Most of the cast may have left a huge impression in the second Godfather film but the first movie still has terrific acting throughout the entire film. Marlon Brando's performance as Don Corelone is very likely and arguably his best role in his film career. Even though the late Marlon Brando was a well-respected actor before and since The Godfather, He was not the only reason that The Godfather is a great film. The casting is a rather interesting one since it contains actors that either have been around for a number of years or actors that are quite new but had a couple roles. James Caan plays a hot-tempered Sonny, Robert Duvall has a great voice of reason in playing Tom Hagen, Diane Keaton plays her supporting role quite fittingly as Kay Adams, and Al Pacino's performance really makes Michael Corleone an intriguing character in the film and that carries on in the later films. The entire performance of every cast member feels natural even if there were a number of takes shot in the movie. Some may say that this movie has some of the greatest acting in the history of cinema, but I think that would be a bit of a stretch to make that claim. The entire cast makes all the characters believable and realistic in their portrayal. The Godfather might not be the most realistic portrayal of the Mafia, but it is certainly the most romanticized Mafia movie. However there are some realistic moments which is the brutality that The Godfather portrays, and Khartoum was the first example of this film's brutality. I also don't think that the brutality is a way of glorifying violence in the film, it is first and foremost a cinematic portrait of the Mafia, and it also serves as a thought provoking character study which carries on in the later films. It may be a romanticized portrait of the Mafia, and it may be a bit realistic in its brutal moments, but it doesn't feel out of place. Considering the film is set in the 1940's with the notion that it is a romaticized portrayal of the Mafia, there's a theme of moral ambiguity that allows the viewer to think and question about the character inside the movie, I find it strange that outside of the movie, it is possible that a viewer (and myself if I may add) finds the moral ambiguity fascinating in The Godfather. It carries on in the story that is told in the film.\r One of the fitting touches is the music by Nino Rota and it's a bit predictable that it has that Italian sound but it is extremely fitting to the film. Like the film itself, Nino Rota's Film score to The Godfather is highly regarded as one of the greatest film scores in cinema, I can say it's hard not to like. It definitely has the Italian feeling and it compliments the movie perfectly. I should add an interesting additional note that Carmine Coppola (the father of Francis Ford Coppola) did compose some of the additional music I find this kind of interesting considering that the Father and Son relationship between Michael and Vito was intriguely written. If that isn't interesting enough, Francis Ford Coppola put his daughter Sofia in the movie too with a cameo appearance as a baby boy. Some members of the family may have been involved in this movie and even the later Godfather films, but family also plays a theme in The Godfather. Another nice element that gives the film its elegance is Gordon Willis' cinematography. The film is shot well, the movie looks like it is in the 1940's. The cars you will see in the movie were cars made in the 1940's and this movie was only made in 1972 so it wasn't too difficult to find vehicles like that. The design is fitting for this film because of its setting. Overall, The entire movie is shot extremely well. Even though this is an adaptation of Mario Puzo's novel of the same name published in 1969. Mario Puzo and Francis Ford Coppola did write the screenplay, and regardless if the movie faithfully follows the book from the first page to the last, Francis Ford Coppola and Mario Puzo are contempt with the changes that are there from Book to Movie. Even though The Godfather is a considered one of the greatest movies ever made. I was very close in rating this film a 10 out of 10, but I noticed a couple hiccups in the film, even though they are small errors they are not influencing me to change my mind that I find The Godfather to be a terrific film, those who saw the movie at face value can unanimously agree that The Godfather is a great film. My philosophy of \"The 10 rating\" is that it is as great as it is ever going to get. They are not perfect because of a rating like that. There could be some mistakes, and some miniscule flaws that can be found but are excused. Even if that were the case, they don't ruin the movie whatsoever. There really is no such thing as a perfect movie. Francis Ford Coppola pulled the strings with the terrific acting, excellent cinematography, fitting music, believable characters, and an intriguing plot. It is not only one of Francis Ford Coppola's masterpieces, it is one of the masterpieces in cinema\r This film gets my Thumbs Up, it's a 5-star film.\r My overall rating of The Godfather is a 9.9 out of 10, it is an excellent film."}, {"rating": "9", "text": "I do not believe this is the greatest movie ever made. I do believe it is the greatest drama ever created. The Godfather is beautiful. The characters give believable and moving performances, and the story itself is gripping. It's hard to say a movie, such as the Godfather, is better than Quentin Tarantino's masterpiece, Pulp Fiction, simply because they are worlds apart, but for what this movie aspires to be, it delivers on every level."}, {"rating": "10", "text": "The best Mafia movie of all time. Perfect actors, top story with many details about the mafia life."}, {"rating": "10", "text": "La pelicula tiene muchas capas  como una cebolla. Tiene la particularidad que uno la ve varias veces en su vida, y al margen que siempre se disfruta, va cambiando la percepcion de la misma"}, {"rating": "10", "text": "En su época esta película fue muy reveladora con el tema de pelis de Gangster, gran escenografia en retratando esos años 40, unas interpretaciones soberbias, la banda sonora, una historia muy cruda y a la vez maravillosa. Imprescindible."}, {"rating": "10", "text": "Artful, visually and historically realistic, Francis Ford Coppola makes his mark as his epic saga depicts in clear detail the dramatic story of a mafia family and it's struggles with the conflicts of other families in the heart of crime-filled New York City"}, {"rating": "10", "text": "One of the best movies of all time, perhaps the best. Such a emotional history, such a killer cast, an epic movie start to end"}, {"rating": "10", "text": "(I apologize for not reviewing this trilogy sooner, but I wanted to wait until I have seen all of them)\r \"Leave the gun; take the cannolis.\" The first of The Godfather trilogy is one of the best mafia movies of all time. In fact, it is so accurate in its portrayal of mob families that actual mafia people confirmed it. The acting, especially between Marlon Brando and Al Pacino is electrifying. Almost everything in the movie is believable, and the screenplay is close to flawless. The Godfather definitely deserves all the praise it gets, and is in no way overrated."}, {"rating": "10", "text": "The movie was good. It was a good movie. #swaghestepikyololkejoidwajiojfaeliæjaflæwjfpoijkawfiopkwpodfkapåfwifpoawjfopawkfpowakfpåkawfpåwakfpåkwapokjfwpkfwa"}, {"rating": "10", "text": "Before there was Goodfellas, Donnie Brasco, The Departed, and Once Upon a Time in America  there was the Godfather  the \"godfather\" of all gangster movies, the \"godfather\" of the 70s, and the \"godfather\" of Francis Ford Coppola's career. It always hit the right notes, and doesn't miss any of them. It has not only reached its expectations, but also made numerous benchmarks for American cinema. Handled by Francis Ford Coppola's direction and screenplay (co-written with Mario Puzo, the movie was based on his novel), amazing performances by Marlon Brando, Al Pacino, James Caan, Robert Duvall, etc., superb editing, cinematography, and Nino Rota's amazing score  it is such a \"masterpiece\", that I wish to watch it again, over and over. The Godfather is everything you expected, when it comes to gangster movies.\r\"A wedding. A horse's head. A gun in a restaurant toilet. Sicily. Another wedding. A car bomb. A toll-booth. A orange peel. A baptism. A closed door.\""}, {"rating": "10", "text": "this is absolutely one of the best movies i've ever saw in my hole life,it have brilliant actings and an outstanding script,it deserves more oscars than just 3 prizes."}, {"rating": "10", "text": "Often considered one of the best movies ever made, this movie wouldn't be too long if it was 24 hours long. It shows you it's world, you enter it, and sadly after \"just\" three hours it ends. Perfectly directed, brilliant screenplay, flawless performances, timeless."}, {"rating": "10", "text": "A Legend.From here on the genre Gangster was born,no movie could ever match The Godfather.\rIt is not one of the best,it in fact is the best .You just cannot ask for anything more in a movie!!"}, {"rating": "9", "text": "A prime example of realism at its finest. The aesthetics of the film are quite possibly the greatest, and most accurate, in cinematic history. A brilliant film with a superb, all-star lineup."}, {"rating": "10", "text": "The Godfather is not only one the greatest film of all movies, It became a landmark achievement in the history of movie cinema, It's so riveting & powerful -Jonathan32042talks\r(First Review)"}, {"rating": "10", "text": "I'm going to throw him an offer he cant refuse The greatest film of all time words simply cannot give what marlon brando and coppola did for this movie is just showing you that nothing is impossible"}, {"rating": "10", "text": "What can be said? 'The Godfather' is one of the masterpieces of cinema, where every element is perfected and congeals to create something that is a work of art - the score, aesthetics, characterisation, directing, script and acting. It catapulted Francis Ford Coppola to the forefront of the New Hollywood wave, was the breakthrough for such stars as Al Pacino, James Caan, Robert Duvall, Talia Shire, Diane Keaton etc. and cemented Marlon Brando's status in the pantheon of cinematic legends, though his work as Vito Corleone here is more supporting than leading. There is dissent over whether this is rightly considered to be one of the greatest movies of all time. For me, it is not the greatest movie but is among them and the length is certainly felt - when first watched, 'The Godfather' is a draining experience. But it ages well with repeat viewings. It meets the definition of classic and then some. It is memorable and masterful. If Part II overshadows it, it is only because Part I was so damn great nobody thought it could be topped."}, {"rating": "10", "text": "One masterpiece  i dunno any cons for this movie\rEpic movie which shows you the America of 30's and the sins of the american dream\rOne of the best mafia movies ever seen and the best from the trilogy"}, {"rating": "10", "text": "one of the greatest movies ever made... and also the best gangster film ever .. strong performance from the cast and good crew.   excellent direction from ff coppala."}, {"rating": "10", "text": "One of the best movies of all-time. You need to watch this before you exit this earth. Every character on this film is a fit. A good balance of drama and thriller. It keeps you on the edge of your seat. A true classic."}, {"rating": "8", "text": "This film was amazing. With great and true honesty it was, however I do believe it might be overrated just a bit. I liked it. From start to finish the story line was enough to keep someone watching. Without  a doubt one of the greatest films I've seen. But In my opinion overrated."}, {"rating": "10", "text": "The best three hours of one of the best masterpiece movies of all time. Best performances on one of the best gang movies you could never forget. Even though it's somewhat slow paced, it's just too good you forget the length. A true cinematic masterpiece."}, {"rating": "10", "text": "The Godfather is the Coppola´s masterpiece, for many the best movie ever made. In my opinion the best movie ever made. The book writen by Mario Puzo is it self a masterpiece and the adapted screenplay is GREAT."}, {"rating": "10", "text": "Masterfully done, and I am not just saying that. I watched the whole thing, and I couldn't take my eyes off the screen until the credits rolled. Summary, BEST MOVIE EVER."}, {"rating": "10", "text": "The Godfather is unarguably the greatest film of all time. It dominates all its predecessors and its successors. Great acting performances also contribute to its magnificence."}, {"rating": "10", "text": "The Godfather is a really really good movie. Through the 175 minutes of The Godfather, there is never a part that is boring or doesn't make any sense."}, {"rating": "10", "text": "I love this movie over 5 years now. I've seen a lot of movies since that time and none of it will ever compare to this masterpiece. Al Pacino is the best gangster ever! It did changed my ideology. Just a few movies could do that and that is one of them!"}], "recommendations": ["goodfellas", "the_shawshank_redemption", "once_upon_a_time_in_america", "cinderella_man", "gladiator", "braveheart", "the_last_of_the_mohicans", "raging_bull", "chinatown", "the_godfather_part_ii", "tombstone", "my_name_is_khan", "casablanca", "lincoln", "django_unchained", "bohemian_rhapsody", "forrest_gump", "scarface", "amores_perros", "the_assassination_of_jesse_james_by_the_coward_robert_ford", "joker", "the_green_mile", "rush", "amadeus", "a_beautiful_mind"]}