{
  "id": 2764,
  "title": "The Bourne Ultimatum",
  "starring": [
    "Matt Damon",
    "Julia Stiles"
  ],
  "runtime": 115,
  "genre": [
    "Action",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "description": "Bourne is brought out of hiding once again by reporter Simon Ross who is trying to unveil Operation Blackbriar, an upgrade to Project Treadstone, in a series of newspaper columns. Information from the reporter stirs a new set of memories, and Bourne must finally uncover his dark past while dodging The Company's best efforts to eradicate him.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/15rMz5MRXFp7CP4VxhjYw4y0FUn.jpg",
  "categories": {
    "plot": 8.25,
    "acting": 7.75,
    "ending": 8.764705882352942,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "The Bourne Ultimatum concludes the Bourne trilogy in style, with sharper camerawork, interesting characters, great action sequences, and Paul Greengrass at his finest."
    },
    {
      "rating": "8",
      "text": "Quite good, but it lost me a bit when Bourne went from a very smart, skilled human being to a near superhuman in the final car chase sequence. Much of the appeal of Bourne is the way he's bound by the normal rules of human existence: he's very strong, fast, and smart, but he's not superhuman. That was stretched a bit here - how many high-speed crashes can he walk away from without a scratch? The movie was at its best when Damon and Stiles shared quieter moments - reminiscent of Damon and his love interest in the first movie. I wanted more of that in between the undeniably impressive action scenes. Still, while not quite as good as 1 or 2, it remains a great action film for thinking people, far superior to most in the genre."
    },
    {
      "rating": "10",
      "text": "Rarely in a trilogy does each movie improve on it's predacessor however in this case its a case of saving the best until last! The Bourne Identity and Supremacy where amazing but Ultimatum blows them out them water. It raises the bar and set's the standards for all spy, espionage, federal agent franchises - whatever you want to call them the likes of Bond, Bauer and McClane all have some serious work to do. This film picks up from the previous outing with Bourne escaping the authorities and on the run however he inadvertently becomes the target of Operation Blackbriar - a Treadstone upgrade whilst working with a London based journalist. Information from the reporter brings back new sets of memories for Bourne as he finally intends upon finding out about his dark past and who he truely is whilst evading a new ruthless breed of assassin leading to a phenominal finale in the final installment of a tremednous trilogy!  This film has everything action from start to finish, superb suspense and a real thriller once more showcasing just how good a recipe it is with Paul Greengrass directing and Matt Damon in awesome form as Jason Bourne."
    },
    {
      "rating": "8",
      "text": "I think that Bourne really is the new Bond. The Bourne Ultimatum was as action as action can get. The story was good, The cast was good, everything was good about this film."
    },
    {
      "rating": "7",
      "text": "Before I saw \"The Bourne Ultimatum\" I thought the Bourne Series was slowly changing something like the Bond Franchise. I guess not. The film offers the same thing, but this time with a trimmed script and pulverizing action sequences. I could see that this movie begs to differ, and I believe it."
    },
    {
      "rating": "3",
      "text": "Continuous action without a soul. Nothing there."
    },
    {
      "rating": "5",
      "text": "This movie is made by its technical excellence. Action sequences are well choreographed and acting is great. What I'm getting sick of is the propagandizing of these films. I've been watching action thrillers since before Warren Beatty's \"Paralax View\" and Redfords \"Three days of the Condor\". In every thriller movie it's the U.S. government which is the bad guy and all other third world terrorists are simply victims. I get the message Hollywood is selling. The problem is that it's a message written and produced by people who are on the fringes of paranoia. People still looking for the shooter on the grassy knoll and the real story behind Area 51. Is there anyone normal in Hollywood? You want a good action movie that's not loaded with Hollywood propaganda then go watch \"Tears of the Sun\" with Bruce Willis or \"Casino Royale\"."
    },
    {
      "rating": "9",
      "text": "It is rarely the case that the third film in trilogies turns out to be the stand out film in the series, but this is the case for the 'Bourne Ultimatum'. There are constant thrills and fantastic action sequences. The acting is top class and the storyline is very cleverly written. This is sure to keep you on the edge of your seat and thoroughly deserves its 3 Oscars."
    },
    {
      "rating": "10",
      "text": "It's safe to say that Jason Bourne is this generation's James Bond, only with better fighting.This film is a fast-paced, satisfying ending to a groundbreaking spy series of the 2000s. Filled with unexpected twists and Bourne's clever planning, the Bourne Ultimatum keeps the viewer on the edge of the seat during the whole movie.The Moby Extreme Ways ending song is just perfect for this movie."
    },
    {
      "rating": "8",
      "text": "It's a very fitting end to such an enjoyable trilogy. Solid acting by the cast, The movie is the perfect mix of action and story, The action itself is entertaining and fun to watch. It's simply a good film."
    },
    {
      "rating": "10",
      "text": "The Bourne Ultimatum is easily the best of the three films and arguably the greatestt action film ever with its breakneck pace and incredible camerawork."
    },
    {
      "rating": "3",
      "text": "Yes, thrilling. But the hand-held camera was way over done. If you like herky-jerky fuzzy blurry action sequences where you can't see what's happening, this is your movie. Too bad too because it's great otherwise."
    },
    {
      "rating": "3",
      "text": "Bourne flees, fights and (narrowly) avoids traps. He's closely monitored by the CIA. Someone's dirty secrets are disclosed. The end. A lot of stuff moved nicely except for the camera."
    },
    {
      "rating": "5",
      "text": "I agree about the car chases. I personally think it was the most fun of the movie. Over all it did have it's dull moments."
    },
    {
      "rating": "5",
      "text": "Very boring. One chase after another. And absurd that Bourne could have so many close calls yet never be seriously hurt. This is just a \"chase em, bang em up\" movie with a little class."
    },
    {
      "rating": "5",
      "text": "A superb film rendered completely unwatchable. Great plot, great dialogue, great acting, great fight choreography, great car chases... all ruined by Greengrass' insistence upon the motion-sickness-inducing haldheld camera work that went out of fashion almost as soon as the Bourne Supremacy was released in 2004... Give it up Greengrass! It's sooooo last season."
    },
    {
      "rating": "0",
      "text": "Total rubbish!! Matt Damon is such a horrible and dumb actor!"
    },
    {
      "rating": "0",
      "text": "After the first 15 min. I was hoping everyone would die.They even managed to make New York look bad."
    },
    {
      "rating": "5",
      "text": "The first Bourne movie to bore me. I actually could not help but glance at my watch from time to time this entire film."
    },
    {
      "rating": "6",
      "text": "Although it could never be seen as a weak movie, there is no doubt that The Bourne Ultimatum is a bit of disappointment when compared to it's thunderous predecessor The Bourne Supremacy. A lot of elements are recycled from that movie albeit without the same the sense of furious despair that made Supremacy such a thrilling ride. The Bourne Ultimatum does have it's plus points in the form of some great action scenes; the battle in Morrocco and the London Waterloo escapade are both truly excellent sequences. Overall, The Bourne Ultimatum is a descent movie but it doesn't live up to it's classic prequel."
    },
    {
      "rating": "9",
      "text": "Another fantastic thrilling action film. All the things that made the previous two great come together and feel more cinematic and high-profile. I would highly recommend it even if you haven't seen the previous two. Great pace, action and story all the way."
    },
    {
      "rating": "9",
      "text": "The best of the Bourne series yet without a doubt.Great acting, great dialogue, great action scenes and the story was as interesting as the one from the other movies."
    },
    {
      "rating": "10",
      "text": "Wonderful sequel that has a lot of amazing action and fun that The Bourne gives us throughout the whole movie."
    },
    {
      "rating": "8",
      "text": "Aside from the twist at the end, its attempts to be political were a bit... eh. I dunno. (The twist at the end, however, made the whole trilogy, like, allegorical--very nice.) Otherwise, this is Class A action. Could've used a titch less shaky cam. But still, really good."
    },
    {
      "rating": "9",
      "text": "This was, quite simply, one of the most exciting movies I've ever seen. A virtuoso display of shooting and editing. Amazing. As for you people who found it headache-inducing, maybe you should stay home and watch Merchant-Ivory costume pics."
    },
    {
      "rating": "7",
      "text": "I don't understand why this movie was better reviewed than the first, which was by far the best of the three. The camera work is annoying, the actors seemed to mail in their performances and the CIA scenes were ridiculous. I still enjoyed it a little, but really only because I grew to care about the character in the first one."
    },
    {
      "rating": "7",
      "text": "Best of the 3. A must see for any action fan. The shaking camera did get a little old at times. Bourne is the super spy of our time. Bye, bye 007."
    },
    {
      "rating": "7",
      "text": "Overall a strong film (best action film of the year), but I don't think that it equaled the excellence of \"Supremacy\". The Bourne-in-NY portion of the film wasn't as well done as the preceding portion...the element of realism that makes Bourne such a compelling hero was done away with completely with some of the stuff he was walking away from during the NY act (car falling backwards off a roof; the chase-ending car accident; the 10-story leap into the river). Also, was it just me or did the car chase end in exactly the same way as it did in \"Supremacy\", with one car t-boning the other into a concrete divider? The bike escpae in Tangier was much stronger. [***SPOILER***] Finally, I just felt that Pam Landy's actions in handling the Blackbriar report seemed out of character...I could have seen if she had gone somewhere else within the government (like Jack Ryan did at the end of Clear and Present Danger) to bring down the program, but proclaiming that \"this is not what I signed up for\" and going to the press seemed ridiculous. A couple of other things that cost this movie some points: 1) note that in the end of \"Supremacy\", when it shifts to NY, it's clearly not winter as was depicted during the NY portion of \"Ultimatum\"...some continuity would have been nice; 2) Bourne being chased on rooftops in Tangier by local police...where have we seen that before? Oh yeah...in The Living Daylights, a 007 film. As well done as that act was, it lacked some originality. Overall, very good espionage film, but could have been great if the NY act had been better."
    },
    {
      "rating": "10",
      "text": "So action pact thrilling and insightful must see!"
    },
    {
      "rating": "10",
      "text": "How anybody can give it less than \")\" is beyond. You ask for logic and realism ín an action movie? Come on. The scene in the London railroad station just blew me away. So did the scene over the rooftops of Tanger. This is first class and has never been shown better, period. Who cares for logic, the whole James Bond series would have been produced!"
    },
    {
      "rating": "10",
      "text": "This film sets the standard for action films in the 21st century. Damon's minimalist style coupled with director Greengrass's au naturale style are a virtuoso combination. The Bourne Ultimatum (and the Bourne series for that matter) is to the current Bond franchise what Batman Begins is to the old Batman franchise (Batman, Batman Forever, Batman and Robin, etc.). There is a clear difference in the quality, believability and style between them. It is refreshing to watch this film both because film-goers can now expect more from action films, and because (hopefully) lesser type action films will become less common because Ultimatum has raised the bar. A professional reviewer commented that after this final Bourne film, no other Bourne films should be made for two reasons-- 1) because Ludlum wrote only three books in the series, and 2) because inferior sequels shouldn't serve to denigrate the excellent job Ultimatum did to end the series. Prior to watching the film I agreed with this because I thoroughly respect and enjoy Ludlum's work (the initial reason I came to watch the first and subsequent Bourne films). But after watching Ultimatum, I must confess I've changed my mind simply because it would be a sizable loss for film-goers and film-makers alike if we all cannot see many more superbly made films such as Ultimatum."
    },
    {
      "rating": "10",
      "text": "This film, although highly praised, still managed to come out under-rated. Its not often that an action flick is elevated to art. What makes the Bourne Ultimatum so special is that it does it effortlessly. Nahhhh Strike all the above... I JUST LOVE THIS FILM!!!"
    },
    {
      "rating": "7",
      "text": "This was overrated. I enjoyed Bourne #1 and 2 better. This was supposed to be the big ender for Jason Bourne's story, unless the director is planning a fourth film! Then I hope it's much better. Still, this is a great choice if you're looking for a tense action film this summer."
    },
    {
      "rating": "9",
      "text": "The same manic handheld camerawork that was prevelant in supremacy reigns here, but for some reason it works better or maybe i've succumbed?  The \"where it all began\" flashback sequence that popped up throughout the whole movie should have been condensed.  That aside, this is a good action thriller worth seeing at some point."
    },
    {
      "rating": "9",
      "text": "Good ending for the trilogy! Some parts are not logical, but, hey, it's just a movie, compared with other crappy action films, Jason Bourne rcoks!"
    },
    {
      "rating": "6",
      "text": "It really could have been an excellent movie. The camera work, by itself, ruined it for me. I had to spend all my time trying to figure out what was going on instead of appreciating the movie. Some of the shots were just stupid (Over half the screen black from an out-of-focus person, the camera peeking over their shoulder), and the others were so shaky that it really detracted from the action. The action was excellent if you could actually make out what was happening. Overall, an excellent movie absolutely destroyed by the director."
    },
    {
      "rating": "9",
      "text": "Engrossing and satisfying despite some implausible moments that scoff at the laws of physics. If you liked the first two, you'll like this one. The way the final scene of \"Supremacy\" is woven into this movie is ingenious."
    },
    {
      "rating": "8",
      "text": "Not as good as the Identity, better than the Supremacy, this was a fun, thouroghly enjoyable Euro-spy Action flick. IMO, Greengrass should tone down the flashy, constantly moving camera tricks a bit...or maybe I just sat too close!"
    },
    {
      "rating": "7",
      "text": "Like Supremacy, the challenge is to try and see what is going on through the continuous camera movement. The camera is even being jerked around when filming a computer screen. Now picture what the camera is doing in a fight scene. Honestly, it would be easer to make sense of a dolphin via critter-cam than the cinematography in this movie. It's a shame because it is a great story."
    },
    {
      "rating": "10",
      "text": "Excellent story, non-stop action. Sets the Gold Standard for action, suspense thrillers. Superb cast, direction, camera work. I remember taking a breath at the start of the movie and another one an hour and fifty five minutes later when it ended."
    },
    {
      "rating": "10",
      "text": "I don't see how people didn't like this movie. It was suspenseful, action packed, and sometimes even funny. Best action movie of the year."
    },
    {
      "rating": "10",
      "text": "Action packed till the end. Definitely the best out of the three. Go see it, just for the sake that its one of the best movies of the year."
    },
    {
      "rating": "9",
      "text": "I had to sit in the far back rows as I am prone to motion sickness and director Paul Greengrass' camera is prone to motion. But the story, direction and acting are all top notch. Matt Damon is a total badass and Julia Stiles is surprisingly great. There are a couple of clunky lines here and there; luckily Matt Damon is terse throughout. Brilliant intertwining of the previous films and taut, dizzying action make this film one of the summer's best."
    },
    {
      "rating": "7",
      "text": "Good but not great. Almost a replay of 2: 'something happens to suck Borne back in; he makes the CIA agents look bad - beats up a bunch - but doesn't kill any! - cool vehicle chases... And the two cheap shots at the current Administration (won't give them away but anyone with a 3 digit IQ should have caught them) were pathetic."
    },
    {
      "rating": "9",
      "text": "The only reason I am not giving this exciting film a 10 is that it is confusing at spots, particulalry when it tries to fill in the neophytes on what has happened in the previous two films in the franchise. Let 'em go back and rent the other two. It's like picking up the third Harry Potter book and expecting to know what's going on. I was especially confused by the reprise of the end of the SUPREMACY just before the climax of the ULTIMATUM, i.e. the \"You should get some sleep, Pam, you look tired\" conversation. Can anyone explain why that scene was repeated?"
    },
    {
      "rating": "10",
      "text": "This is another great Bourne film. Lots of twists & turns, thinking and rethinking, and success is always determined by his smarts, aggressiveness, action and luck. The main character is not arrogant, but gritty, outnumbered and barely surviving. I think we all see ourselves like this in some ways. Love this series."
    },
    {
      "rating": "10",
      "text": "The best Borne movie to date! You will not be disappointed!"
    },
    {
      "rating": "10",
      "text": "I think Matt Damon is a great actor, and no one else could have pulled these movies off better them him!!!"
    },
    {
      "rating": "9",
      "text": "Best of the trilogy this movie was just amazing. but what was up with the camer-man with heroine relapses I couldn't see a thing he was shaking so much made it kinda hard to see what was happening but aside from that the movie was incredible I want to see it again already and I just saw it yesterday."
    },
    {
      "rating": "7",
      "text": "Could have been a 10 except for the camera work, which was some of the worst I've seen in years. It took away from a great movie."
    }
  ],
  "recommendations": [
    "the_bourne_supremacy",
    "the_bourne_legacy",
    "john_wick_chapter_3_parabellum",
    "den_of_thieves",
    "mission_impossible",
    "jason_bourne",
    "mission_impossible_ghost_protocol",
    "the_bourne_identity",
    "quantum_of_solace",
    "mission_impossible_rogue_nation",
    "the_island",
    "furious_7",
    "john_wick_chapter_2",
    "the_foreigner",
    "the_mechanic",
    "wrath_of_man",
    "maze_runner_the_death_cure",
    "avengers_age_of_ultron",
    "sherlock_holmes_a_game_of_shadows",
    "unstoppable",
    "transporter_3",
    "the_terminator",
    "edge_of_tomorrow",
    "the_fate_of_the_furious",
    "the_commuter"
  ]
}