{"id": 16, "title": "The Boss Baby: Family Business", "starring": ["Alec Baldwin", "James Marsden"], "runtime": 107, "genre": ["Animation", "Comedy", "Adventure", "Family"], "description": "The Templeton brothers — Tim and his Boss Baby little bro Ted — have become adults and drifted away from each other. But a new boss baby with a cutting-edge approach and a can-do attitude is about to bring them together again … and inspire a new family business.", "releaseYear": "2021", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/kv2Qk9MKFFQo4WQPaYta599HkJP.jpg", "categories": {"plot": 6.875, "acting": 6.0, "ending": 7.666666666666667, "soundtrack": 8.0, "cinematography": 9.0, "familyFriendly": 7.166666666666667, "funny": 6.5, "action": 9.5}, "reviews": [{"rating": "0", "text": "Pathetic. The first movie wasn't good to begin with, so they had a pretty low bar to reach, and they STILL failed. Just skip this painfully stupid, unfunny, pathetic excuse to make a franchise out of a movie that no one wanted to see more of in the first place."}, {"rating": "5", "text": "Why Was This Made?I get that it’s predecessor did very well at the box office but it didn’t need a sequel considering it one of DreamWorks’s worst films (Though I’d still prefer it over Shrek The Third ANY day). The sequel is equally as mediocre. Not terrible but definitely not good."}, {"rating": "7", "text": "Fans of the first film should like it. It’s more of the same odd, aimless plot and tone-deaf comedy. Amusing for children but probably even better for the 13+ crowd"}, {"rating": "5", "text": "The kids enjoyed it well enough but as a parent it was pretty mediocre.  While the entire premise of both movies is completely ridiculous this one does it worse than the first one.  To be fair it had its moments especially towards the end but so much was just groan inducing.  Unless you’re kids absolutely have to see it I wouldn’t spend much on it."}, {"rating": "0", "text": "Worthless. This movie has nothing funny or charming or intelligent or engaging to offer during any of its 107 minutes. No one should watch it."}, {"rating": "0", "text": "Awful.  Simply awful.  Even the kids in the theater didn't find it funny.  It is probably one if the worst animation features created.  The plot not interesting, the voices are annoying and the concept should have been thrown out with the first drafts.  Seriously, your kids will hate you for taking them if you do.  Just DON'T."}, {"rating": "1", "text": "I do not care for this utter piece of corporate sequel garbage simply meant to empty my wallet. Also they say \"boomers,\" and I'm mad now."}, {"rating": "10", "text": "Don't review this as an adult watching a film. Watching my 2 year old baby boy (who oddly looks like boss baby) crack up laughing most of the way through was more joy than I could ask for. Will be watching so many times more.Baby love watching babies in fight scenes apparently haha."}, {"rating": "10", "text": "I honestly love. It is fabulous and really worth watching. An extremely amusing movie."}, {"rating": "10", "text": "When I say that this movie is a godsend, I am not at all joking.  My son, Owen, was born with congenital rubella syndrome, as a result of my wife having the rubella virus, causing him to be both deaf and blind.  I am a firm anti-vaxxer, and will not be vaccinating Owen or any future kids I have, but that is besides the point.  I brought my deaf and blind son to this showing, and, I kid you not, it cured his congenital rubella syndrome.  Alec Baldwin's beautiful baritone voice broke right through his deafness, and upon hearing the voice he had to see who the godly, awe-inspiring tones were coming from.  And Lord did he see.  He looked at me and I looked at him, tearing up, and he said his first words: \"Father, I... I love you.\"  To anyone thinking about seeing this movie - please do.  It worked wonders for my family.  And to Alec Baldwin, if you somehow see this, I love you.  Thank you for saving my son from a life of darkness and depression."}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree.bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "10", "text": "ballsballsballsballsballsballsballsballsballsballsballsballsballsballsballsballsballsballsballs"}, {"rating": "10", "text": "the best movie boss baby family business"}, {"rating": "5", "text": "BBFB was an ok movie to switch off to but not as endearing as the original movie and with a far less compelling screenplay. Story was forgettable with some very weak dialogue for the new characters. Provides a colourful distraction for an idle hour and a half. Looks great in 4k hdr. Watch and forget!"}, {"rating": "4", "text": "Even if you add new elements to an old joke, its own predictability will always work against it, and a familiar joke just isn't as funny anymore.This is what happens here.Kids gonna have fun of course, but you know exactly why."}, {"rating": "8", "text": "An aweosme Sequel!Me and my brother was laughing throughout the movie, The starting was slow but the story and comedy makes it an awesome movie! The soundtrack was amazing and the reliving as a kid for both brothers in movie and the family emotion was amazingly showcased it was a fun and entertaining movie!"}, {"rating": "4", "text": "Well, what do we have as a result? The main characters actually did nothing, and, by and large, this task should have been taken over not by their father and uncle, but by their sister. The cartoon tries to say how important it is to keep the child inside yourself, to appreciate your family and blablabla. But, Tom McGrath, it's not enough to say this moral behind the scenes before the final credits. Tim was an infantile idiot, and he remained so. Ted was a careerist and remained one. The whole conflict was resolved by a sincere conversation, but in practice, these two did nothing to become better.But we have a very loud, stuffy and infuriating cartoon with sour tones. Of course, we have a cartoon that was created in order to earn money. And thank you for the fact that this time there were no children's asses and drooling close-ups. But still, this is a cartoon for children under 2 years old and parents who love all this cute nonsense. And this can be tolerated, but it becomes sad that dreamworks did it. I'll go to the shower to cry, and I'll declare the cartoon itself a big drug trip.Sorry for the bad English."}, {"rating": "10", "text": "A fun, lighthearted movie which shouldn’t be taken too seriously. It is a warm movie anyone could enjoy."}, {"rating": "9", "text": "The film picks off from the prequel differently then I thought. The movie kicks in fast and your in the story from almost the start. The movie focused much more on family then actually saving BabyCorp and the world. It felt kind of weird at first but I quite enjoyed it on the second run. I feel that there is less action then in the first film which can be saw by the composition of the movie were the plot twist here is at the end where the plot twist in the first film was in my opinion when the antagonist took the special milk although I still enjoyed it despite the less action. I liked the humor and the technical stuff like voice acting, animations, etc. were all on par. There were some lore inconsistencies from the first movie but unless you were looking for them you probably wouldn't notice them. Honestly this film was a great sequel and instead of comparing it to the first movie even though I just did we should look at it as an expansion to the grand story. Speaking of grand story I am not sure if there is gonna be a sequel to this movie. I want them to make a thousand movies in this franchise but they need to make atleast an another film to end things off and judging by the ending last few ending scenes I think the team at DreamWorks has already something planned just like how they did with the first movie. This is the best cartoon/animated modern franchise and this just feels more of the first film and it also speaks a message about how much family is important. Just wanted to write this and thank you for reading.Ps. 9/10 because it's a kids movie so on some places they've cut corners, being lazy at times like using glue to climb walls but yeah still a great movie."}, {"rating": "6", "text": "Mira, te soy sincero la pelicula esta buena pero al final en el minuto 1:32:45 sale la bandera lgbt por lo cual mi opinion sobre la pelicula cambia drasticamnete a un 2 pero soy bondadoso"}, {"rating": "3", "text": "The Boss Baby: Family Business is unfunny, uninspired, and undeniably stupid."}, {"rating": "10", "text": "What a masterpiece, you can truly see the bibles inspiration from this movie, so glad I saw this fantastic piece of art"}, {"rating": "0", "text": "Just by watching the trailer, I already knew the film was just a piece of trash."}], "recommendations": ["alvin_and_the_chipmunks_chipwrecked", "the_smurfs", "chicken_little", "spy_kids_all_the_time_in_the_world", "free_birds", "alvin_and_the_chipmunks", "diary_of_a_wimpy_kid_the_long_haul", "zookeeper", "ice_age_dawn_of_the_dinosaurs", "the_cat_in_the_hat", "cloudy_with_a_chance_of_meatballs", "the_croods_a_new_age", "minions", "uglydolls", "alvin_and_the_chipmunks_the_squeakquel", "home_sweet_home_alone", "alvin_and_the_chipmunks_the_road_chip", "yogi_bear", "the_spongebob_movie_sponge_out_of_water", "wonder_park", "the_game_plan", "the_lego_movie", "hotel_transylvania_2", "diary_of_a_wimpy_kid_dog_days", "night_at_the_museum_battle_of_the_smithsonian"]}