{
  "id": 3763,
  "title": "The Man with the Golden Gun",
  "starring": [
    "Roger Moore",
    "Christopher Lee"
  ],
  "runtime": 125,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "Cool government operative James Bond searches for a stolen invention that can turn the sun's heat into a destructive weapon. He soon crosses paths with the menacing Francisco Scaramanga, a hitman so skilled he has a seven-figure working fee. Bond then joins forces with the swimsuit-clad Mary Goodnight, and together they track Scaramanga to a Thai tropical isle hideout where the killer-for-hire lures the slick spy into a deadly maze for a final duel.",
  "releaseYear": "1974",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zULDLrGE42iTiizMJKDoTGbIKlu.jpg",
  "categories": {
    "plot": 6.538461538461538,
    "acting": 6.8125,
    "ending": 7.4,
    "soundtrack": 7.0,
    "cinematography": 2.0,
    "familyFriendly": 6.2,
    "funny": 6.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Warts and all, to me, this is one of Roger Moore's best outings as Bond.  It has everything needed to make a great Bond film, A solid villain, outstanding allies and even a believable macguffin in the Solex Agitator.  It has it's problems but it's a solid entry.http://latetothegame.blog/2019/02/28/key-movies-of-my-life-james-bond-edition-the-man-with-the-golden-gun-1974"
    },
    {
      "rating": "8",
      "text": "I put this up there in my top 5 Bond films. Christopher Lee is a fantastic villain who comes off as an equal to Bond and not an inferior one trying to get us to buy into his hype. I love that Lee's character makes it clear from the jump that he is out for Bond, thus making Bond on edge and fully expecting a challenge from a worthy foe, rather than someone hiding behind the curtain.It's a fun and entertaining movie that totally lives up. It's the best film that Moore does as Bond and an instant classic IMO."
    },
    {
      "rating": "5",
      "text": "Surely one of the worst parts of the franchise: The first part is a bit boring, because you know many of the scenes already. Roger moore doesnt have the same charisma as Sean Connery. Some of the action scenes are bad, especially the hand fightings. The oneliners and the humours scenes are also bad.What was good? Christopher Lee the villain was interesting. The asian setting was also nice."
    },
    {
      "rating": "5",
      "text": "Having watched 25 Bonds from Dr.No to Skyfall, I place this one at 13/25.The Man With the Golden Gun is fascinating to cricitise because there is so much to say.Right from his start with Live and Let Die, Moore entered like a dog in a bowling game. His first movie was terrible and it was in great part due to him playing his old role and being a pompous prancing bourgeois.For Golden Gun, they decided to force him to be serious, to be hard. And boy, did he catch that boat and ride it. We get to see Roger Moore threaten people with castration by rifle, we get to see him slap a woman in the face HARD, he threatens, he beats, he throws, it's a movie that aims to correct the excesses of the last one by whole new excesses in the other direction.And Moore delivered. He really did a great job on a movie that was decidedly against his style.However, Golden Gun had other problems. I often complain about the villains falling flat, well not here: Christopher Lee not only makes a good villain, but most importantly, we're rid of the old daring 00 agent VS Evil CEO/Scientist/madman. Scaramanga is a brilliant mirror to James Bond, a killer to a killer, a woman user to a womanizer, a man famous for his skills to one equally famous. The famous \"we're not so different, you and I\" speech comes from this movie, and by God, they really did it justice. Or they would have.I also liked the character of Nick Nack and the setting in Hong Kong was simply wonderful.With a great villain, a strong Moore, good theming and style, this would be a wonderful Bond. And then there's the 3 big problems.1: The Cop Character. Now you can like him or hate him, I hate him with a passion, but I suspect someone at EON who wrote plots was humiliated by the american police at some point, because there is the humiliation of the police in Diamonds, then the horribly stupid, ugly, redneck cop character in Live and Let Die, and now that same character, is somehow in Thailand and this time, doesn't just provide bad comic relief, he gets on Bond's car, and latches on to the movie for 15 whole minutes, killing everything.2: The comic relief. This is where the movie gets a bit schizophrenic. Golden Gun is a decidedly very dark Bond in several ways. But they tried to balance it out with the aforementioned cop, with the extremely stupid \"noob agent\" bond girl they shoehorned in, with lots of just disruptive scenes and moments that kill the mood.3: The kung-fu, and if I mentioned schizophrenia with the comic relief, it's nothing compared to this. After some 25% of the movie being a very dark and interesting Bond take, we have a (very stupid) scene where instead of finishing off Bond when he's down, someone orders that he gets \"taken to school\". The \"school\" is a martial arts school, where Bond wakes up surrounded by three women cleaning his nails and body(???), he then sees two students fight and murder one another(?????) and then is invited to fight, after which, realising he can't win, he jumps out a barbed window, not having any idea if he's on the 1st or 6th floor(??????), where a fellow agent just instantly finds him, picks him up, while his two 15 year old nieces destroy the entire 40-ish student body with their kung-fu(????????????). After that, the agent drives away, leaving Bond behind in some of the dumbest comedy I've ever seen, and the viewer is served with a long chase sequence. It's a massive WTF moment, perhaps one of the biggest in the series. This entire part lasts about 20 minutes, and considering the movie came out in 1975, this is one of the worst cases of cramming something popular to latch on to a fad.There are other issues like the very strange directing for the last part of the movie where it feels like Moore and Lee are having a casual friends talk while Lee exposes his Evil Plan, and it's a bummer that they just sort of drop the very interesting \"we're not so different, you and I\" conversation, that was clearly not going Bond's way.But really, the 20 minutes of terrible kung-fu, the 15 minutes of redneck cop, and the generally bad comic relief, all killed the vibe of a movie that could have stood as one of the greatest Bonds. The end result is a fascinating, but ultimately failed Bond movie."
    },
    {
      "rating": "10",
      "text": "A divisive James Bond movie. For some it is one of the weakest and for others it is an excellent one. This is because of Christopher Lee as Francisco Scaramanga / The man with the golden gun and his right hand man Herve Villechaize as Nick Nack (he is introduced as his servant but I will say he is his close friend, right hand and a really dangerous). He also got really famous later on in the TV series Fantasy Island. Back to the movie: It is the ninth movie and is staring Roger Moore but you can also say that Scaramanga is also a main character as you learn a lot about him. After the amazing intro which gives you a great insight into Scaramanga and Nick Nacks relationship and abilities the story starts when a golden bullet engraved with 007 is received by the MI6. They believed it was send by Francisco Scaramanga who is a legendary assassin and a myth as nobody knows much about him. He is possibly the most dangerous assassin on the planet and his skill might even be a deadly challenge for James Bond. Because of this James Bond is relived of his current mission to find a scientist who has the knowledge to solve the energy crisis. So starts the story. The story itself would be pretty weak but Roger Moore and Christopher Lee made it excellent. You always know it will end with a final duel of these two as they play a cat and mouse game. It is so enjoyable too watch how the characters enfold in the story. It is driven by the actors and this made me ignore all the other problems. For the cast we have Roger Moore in his second movie as James Bond. He improved and has become the James Bond we know and love (I wont bring up the Sean Connery or Roger Moore topic). As I already said Christopher Lee is also the main actor here or close to it. He gets a lot of attention and you learn a lot about him. An enjoyable and unforgettable performance and he reached the heights of the best James Bond Villains (best in the Roger Moore era with Jaws for me). Remark: Do you know that he was the step cousin of the James Bond author Ian Fleming? Herve Villechaize as Nick Nack delivers also a great performance. He is often forgotten in the list of best henchman / lieutenants. He is clever, dangerous and I do not want to have him as enemy. Richard Loo is the second antagonist of the movie and made a good performance. Clifton James returns as Sheriff Pepper. I so much enjoyed his stereotype parody performance. They also established the humor to the James Bond movies the Roger Moore era is famous for. Here are so many good jokes I wont spoil. Also the locations were amazing. This time we got Hong Kong, Macau and Thailand. Visually impressive and worth to visit in real life. Bonus for the MI6 headquarter in Hong Kong;-). This movie is full of interesting gadget and devices and I think I will not give you a spoiler free description here. Overall this is an excellent James Bond movie that I recommend. Be however warned as it is divisive. Like I said before for some it is a low point but I had no one ever see or heard criticizing Christopher Lees performance."
    },
    {
      "rating": "7",
      "text": "The Man With the Golden Gun is a fun James Bond movie. While not my favourite of the Bond franchise, it is one of the better Bond movies with Roger Moore in the title role. The film does have its slow parts, the plot isn't quite as tight as it could have been and the script isn't quite as well constructed as previous Bond outings due to some of the slapstick humour that didn't quite work. On the plus side, it is fun and is better than its reputation certainly. It is hugely benefited by the beautiful exotic locations, and Maud Adams is stunning here. So is Britt Eckland. The stunts are neatly executed, and the performances are brisk and solid. Roger Moore doesn't quite have the charisma and flair of Sean Connery, but gives a convincing enough portrayal of our favourite special agent, that makes Geoge Lazenby think \"Now I know where I went wrong\". Scaramanga is one of the more interesting Bond villains and is played with crisp efficiency by the majestic Christopher Lee, and Herve Vilechaize is certainly a scene stealer as henchman Nick Nack. And the music is outstanding. Overall, a very good movie, that is well worth watching for the locations and Lee's performance. 7/10 Bethany Cox"
    },
    {
      "rating": "2",
      "text": "Hamilton and Moore are changing the game, the result is one of the worst chapter of the franchise, so there's that record now, to break.The Man With The Golden GunHamilton is behaving like some angenieux filmmaker. Usually when you go behind the camera for the first time, what you wish to make and what comes out creates a long distance between the audience and the characters. For, how you are pretending the scene to come off and how it actually does is the grey area where a qualified maker aims to bridge. And in here, along with this issue, Guy Hamilton, the director, has lost the complete balance on humor. This is probably the worst to come across in the franchise. In a sense that it is not only not funny but also clearly wrong.It is more expressive about the offense that casts as a pseudo reaction than a purposeful message it tries to pass on- by the way, don't look for it, you'll be scrapping for hours before you find anything and if you do, then you've gone so deep that you are reading between the lines that doesn't exist. Roger Moore revisiting his character signifies his incapabilities in global scale. Now, I remember that this was the reason why I never fully understood his stardom, with questionable dialogue deliveries to an outrageously loud innuendos that makes you livid, he is surprisingly the anchor of the film.The Bond girl phenomenon is once again, showcased as an object than a being and along with a weak antagonist that isn't even correctly motivated, the supporting characters are also dragging this down way too low; how far are they going to rely upon old cameos that are supposed to make you laugh. The Man With The Golden Gun sounds corny as it actually is, the fired shots are empty just like a reason to produce this film, except for the box office results which too is among the lowest, this time."
    },
    {
      "rating": "5",
      "text": "Directed by Guy Hamilton and with a script by Tom Mankiewicz and Richard Maibaum, this is the ninth film in the 007 franchise and keeps Harry Saltzman and Albert Broccoli as co-producers for the last time. In this film, the second where Roger Moore embodies 007, the main subject will be the energy crisis and the advent of so- called green energies, issues that were very present at that time, due to the oil crisis and the beginning of ecological concerns in society.In this film, the British agent is threatened by an assassin called Scaramanga, famous for using a pistol and bullets made in gold. Discretely, Bond decides to set off in pursuit of his new enemy, with the permission of M. The clues lead him to Beirut, to the Portuguese colony of Macau and finally to Hong Kong, where Scaramanga kills Gibson under Bond's nose. Gibson was a scientist who invented a way to harness solar energy and alleviate the world's dependency on oil. Bond must now recover the stolen technology and goes to Thailand where, after many adventures, will join forces with his colleague Mary Goodnight, an English spy who is both beautiful as stupid. Finally he meets Scaramanga. The chase takes Bond to the island's villain, which takes the final confrontation, full of surprises.In this film, Roger Moore will continues the formula started in \"Live and Let Die\": sarcastic and calm in any situation, his Bond is also a natural seducer, kind and gentle, contrasting to the rudest posture of Sean Connery, while not giving any value to women who seduces and which quickly drops when it suits his mission. A curious note: the mechanism created by Scaramanga in his island for the use of solar energy, despite the science fiction touch, is very similar to solar panels we have today but I don't know if this was a \"jules- vernian\" stylish prediction or if, even then, we could logically predict the course of technology in this field. One of the most famous scenes of this film is the gold-covered woman, in a probable homage to \"Goldfinger\", an earlier franchise film where this scene first emerged. Another memorable scene is the car chase where Bond, to cross a water channel, makes a dangerous 360° rotation with the car, similar to Evel Knievel shows, a popular icon from these time.In addition to James Bond and Mary Goodnight (Bond-girl played by the Swedish Britt Ekland), the film brings again J. W. Pepper, which was a big hit in the previous film and works here just as comic element. The villain, Scaramanga, was played by the immortal Christopher Lee, whom the seventies ran particularly well thanks to vampire movies. His helper, the francophone dwarf Nick-Nack, was taken by the talented and funny Hervé Villechaize. The also Swedish Maud Adams embodied Andrea the second bond-girl of this movie, the only 007 movie (I think) with two bond-girls interpreted by actresses from the same country."
    },
    {
      "rating": "8",
      "text": "The BEST James Bond movie EVER!I always enjoy watching this movie.But still something is missing and some little things are a bit boringSo thats why i give 8/10."
    },
    {
      "rating": "5",
      "text": "ummary: James Bond is led to believe that he is targeted by the world's most expensive assassin while he attempts to recover sensitive solar cell technology that is being sold to the highest bidder."
    },
    {
      "rating": "7",
      "text": "The Man with the Golden Gun was already better for me than Live and Let Die. The story is much more interesting for me, even with a better negative. Location also better. I especially liked the final one and overall I really enjoyed the last 20 minutes of the film. So, after the previous film, I got a taste and it is again purely one of the better Bonds with Moore for me."
    },
    {
      "rating": "4",
      "text": "Absolutely terrible Bond movie, easily one of the worst Bond movies ever. The movie just loses itself and goes all over the place. Seriously, Bond doing karate, that car flip with the whistle, and Bond sucking the bullet out of that woman's belly button is just ridiculous. The Bond girl, Goodnight, is also very ditzy and clumsy, very annoying to watch. This is the only Moore film where I didn't really like his character all that much, I wouldn't expect Moore's version of Bond to slap women, suck bullets, and push a kid into a river. The film is partially saved by Christopher Lee giving a good performance as Scaramanga, but it's enough to save this disaster of a Bond film. Overall, it hardly feels like an actual spy film since you don't feel the stakes, let alone a James Bond film."
    },
    {
      "rating": "6",
      "text": "Thanks to Christopher Lee's fantastic villain, The Man with the Golden Gun is memorable, if not perfect."
    },
    {
      "rating": "10",
      "text": "The man with the golden gun was not so great film but I rate 100% because I love James Bond film series and Sean Connery and Roger moree was great James Bond actors. Roger moree really so great actor and his film **** was filmed in India and I'm born in india. James Bond was a masterpiece"
    }
  ]
}