{"id": 1544, "title": "The Girl Next Door", "starring": ["Emile Hirsch", "Elisha Cuthbert"], "runtime": 110, "genre": ["Comedy", "Romance"], "description": "Exceptionally ambitious high schooler Matthew has aspirations for a career in politics when he falls in love with his gorgeous 19-year-old neighbor, Danielle. But Matthew's bright future is jeopardized when he finds Danielle was once a porn star. As Danielle's past catches up with her, Matthew's love for her forces him to re-evaluate his goals.", "releaseYear": "2004", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/el8RGlODqenqIs6Mcbyaog6DnXe.jpg", "categories": {"plot": 4.111111111111111, "acting": 5.333333333333333, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "0", "text": "Irresponsibly exploitive and feebly made. Only harry potter abuses its child actors more."}, {"rating": "0", "text": "vile and disgusting film that never should have been made. If you like this film then there is something very wrong with you.It isn't scary or cool or interesting. It's a true story about something very very horrible that happened to an innocent young girl. There is absolutely no reason for this film to have been made. I'm pretty sure that watching something like this could cause permanent emotional damage to someone. And just so you know I like shock horror films. The more disgusting and disturbing the better. I try to find films that are as horrible as possible, but this film crosses the line. This isn't a horror film, this is a realistic snuff film that could only appeal to people that enjoy the pain and suffering of others. Normally I would read a review like this and watch the film right away, but I am warning you that you will not enjoy this film and you will regret ever seeing it."}, {"rating": "8", "text": "This is a faithfull and solid adaption of Jack Ketchum's brutal masterpiece, which was based on a true story. Could be deeper, but satisfying nonetheless Not for the squeamish."}, {"rating": "10", "text": "This movie is not an easy one to watch, but it is just as gripping and disturbing as the book, and blance baker as ruth was phenomenal."}, {"rating": "10", "text": "Don't listen to stodgy critics - this film is a powerhouse on all levels. Terrifying and tragic, it sucker punches the viewer and leaves him with a film experience he'll never forget."}, {"rating": "8", "text": "This movie is scaryâ"}, {"rating": "5", "text": "The transition from harsh abuse to sheer sadism and an exploitative exhibition of abuse with limited \"entertainment\" value. There is little to recommend the film, those with a morbid curiosity may wish to take a look as part of a self-endurance test. Prizes on the way out."}, {"rating": "4", "text": "Jack Ketchum's 1989 novel and the subsequent film are based on one of the most infamous sex crimes in American history. The crime was truly horrific, unfortunately the film is equally as bad. The story is about a young girl who is living with a relative for the summer, a twisted and evil relative, who not only abuses the girl, but allows the neighborhood children to take advantage of her as well. The story is more than a little disturbing, but it's made worse by a film that is ridiculously tedious and boring. This story was much too straight forward and simplistic to make for a good movie, especially when they're choosing to focus on the crime itself. The one bright spot in this movie is soap actor, Daniel Manche. I'd never even heard of him prior to this film, but he was really great. It's a shame this film was so bad and cost him the recognition he deserved, but this kid was on target and really displayed the emotions that the viewers were feeling. There is another film about this crime, which focuses specifically on the ensuing trial resulting from the crime. It's called An American Crime, and while I already know the outcome, I have to see it, because it stars one of my favorite actors, Jeremy Sumpter. I can only hope that that film is more interesting than this one was."}, {"rating": "4", "text": "\"The Girl Next Door\" was a horrifying movie to watch. The sadistic torture of a girl was truly just disturbing. But there's nothing quite interesting about the film other than what kind of torture they can do to the girl. There's not much reason to watch this movie and I won't recommend you to do so."}, {"rating": "5", "text": "A well-meaning movie with a message that got lost somewhere in the exploitative abuse, wooden performances, average script and poor character development. Blythe Auffarth doesn't make a very convincing 14 year old either. This movie would've been better served concentrating more on the characters and their motives and less on \"gee, what can we do today to Meg!\""}, {"rating": "1", "text": "The main problem in film seems to be ridiculous because it's so easy to solve at the beginning of film.    /\r ."}, {"rating": "8", "text": "Let me start by saying this is a very good film. Yes it is unsettling and vile, but it is supposed to be that way. This movie feels like Stand By Me and It in certain ways, while also bringing strong scenes that truly reflect the terror these kids experienced. The movie was filmed quite well and has excellent production quality, along with strong acting from the lead actresses, and decent child acting. The character of David was a standout performance in relation to the other kids. This movie starts by showing how innocent and kind Meg is, then quickly begins to show the abuse. The abuse can seem pervasive at times, perhaps dragging on a bit. I think the physical violence was fairly mild compared to what it could have been. The movie focused mainly on the psychological torture elements more, showing the kids strength and will to live. Overall very good but disturbing 8/10"}, {"rating": "7", "text": "Makes the Hills have Eyes look like Marry Poppins. It's not an easy film to watch but if you can get past that, it's good"}, {"rating": "2", "text": "Although disturbing, the viewer does NOT make any sense out of it. It is pointless, with a vulnerable screenplay, performances and direction. The Girl Next Door is does disappoint, with no, what's so ever, explanation behind what was going on."}, {"rating": "7", "text": "Two main flaws make the film way less shocking (and good) than the book: the way the movie was directed, in which the director didn't mind excluding essential parts of the book in order to get to the good stuff (the girl's torture),which made it all the harder to enjoy. And the child actors who were HORRIBLY unconvincing (except for the two sisters). The highlight to the film though, is Blanche Baker who was the most interesting character of the film."}, {"rating": "0", "text": "How anyone can even stomach watching this is beyond me. If you say it's non-exploitative or the main girl didn't look like she was 14, you're a pervert. She clearly wasn't 14 because of gross scenes of her. It's just torture and you want to slap the sh!t out of the kid who likes her and does nothing as she is abused. To a unfathomable level. The person that called this a masterpiece should have his hard-drive searched. Flippin' creeps."}, {"rating": "0", "text": "I wish I could give this movie a minus 10 score. (1) Alters real events (2) it felt that the writer wanted to show all the sadistic acts his sick mind could think of in one movie without any real or clear take home message. Why go to length to show sadistic scenes that involve children and in reality the movie has no clear message. This movie is just disgusting and a disgrace to the whole movie industry. At least have some respect for the dead and do not say this is a true story based on Sylvia Likens because it is not."}, {"rating": "10", "text": "Horrifying and Heartbreaking to say the least, however it's absolutely magnificent in portraying the horrendous sadistic acts."}], "recommendations": ["elle", "perfect_sisters", "the_book_of_henry", "eden_lake", "the_exorcism_of_emily_rose", "a_history_of_violence", "brimstone", "orphan", "eastern_promises", "fifty_shades_of_grey", "the_hunt", "to_the_bone", "antichrist", "the_machinist", "case_39", "boyhood", "fifty_shades_darker", "babel", "promising_young_woman", "the_lobster", "the_experiment", "mother", "the_fault_in_our_stars", "chappie", "run_hide_fight"]}