{
  "id": 1538,
  "title": "The Blair Witch Project",
  "starring": [
    "Rei Hance",
    "Michael C. Williams"
  ],
  "runtime": 81,
  "genre": [
    "Horror",
    "Mystery"
  ],
  "description": "In October of 1994 three student filmmakers disappeared in the woods near Burkittsville, Maryland, while shooting a documentary. A year later their footage was found.",
  "releaseYear": "1999",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9050VGrYjYrEjpOvDZVAngLbg1f.jpg",
  "categories": {
    "plot": 5.823529411764706,
    "acting": 7.083333333333333,
    "ending": 2.5833333333333335,
    "soundtrack": 8.75,
    "cinematography": 6.333333333333333,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I watched this movie for the thirteenth time last night, and was still creeped right out. Watching it on DVD in my house, I still felt as though someone might be watching me from down the hall. This is the effect of great atmosphere, and the Blair Witch Project has it. Every financially cheap aspect helps it. It's shot in a real environment, not a sterile set or against a CGI backdrop; its actors improvise their dialogue rather than read from scripts; the lighting is completely natural, and all the sounds are ambient. Instead of a soundtrack, this movie has whatever the microphones picked up in the woods - much scarier than a bunch of licensed music or orchestral tones. By shooting this movie over six straight days and camping in the woods, these college-level actors access real fatigue and real emotion that blows away Hollywood performances because even though their premise is every bit as fictional as a blockbuster, their feelings are real. Minimalism is the name of the game, hiding or only showing a little of any scene - only what was caught on the characters' cameras. Outside of those people who can't stand student film to begin with or can't appreciate something filmed with shaky cameras (something most people get used to in a matter of minutes, and something that is a huge part of modern news reporting), nothing can draw an audience in quite like this movie."
    },
    {
      "rating": "3",
      "text": "I've got to be honest, I didn't find it scary... at all. The tent shaking?! I suppose the way the marketed it to start with - as if it were a true event - was a good strategy, but beside that it just isn't scary. I wasn't on the edge of my seat, I was lying down on it snoring. The only reason it gets a 3 is for originality, but that's about it."
    },
    {
      "rating": "1",
      "text": "THE GOOD: I will keep this review fairly short.\r THE BAD: I will never get back the 81min run time that this film has.\r OVERALL: As you can tell, I'm not a fan of the film and could hack away at it all night penalising it's tacky use of camera, story, 'actors' and so on but I do have to say as a film buff myself that this film is extremely dated as of 2013 and will only become more so, obviously, from now on. This film was made on an extremely low budget as reflected and credibility has to go towards the marketing scheme of making people believe there is some truth to it, allowing the film to skyrocket in profit. All of which can be completely reciprocated for Paranormal Activity (Although I won't insult that QUITE as much in another film's review).\rI would advise this film for people more linked with cult followings in the film market and can admire the lowest of budgeting reflected in the film itself. But no matter of my opinion, remember as film goers to always keep an open mind either way!"
    },
    {
      "rating": "0",
      "text": "The only good thing about this movie is the acting. It's really just three annoying cardboard cut outs walking around in the woods for 90 minutes. The story is almost non-existent and the characters are flat.\r I'm all for \"what-you-don't-see\" type of horror. 'The Others' and 'The Haunting' from 1963 are some of my favorite films. But this film is just woefully boring, and when something is happening, it's just a shaky cam vomiting mess.\r The only reason it was successful was because people were dumb enough to think it was real.\r If you want to see a much better found-footage film, with a similar concept, but made first, and better, check out 'The Last Broadcast' from 1998. Skip this disjointed, over praised, shaky cam, boring and uninteresting trite."
    },
    {
      "rating": "10",
      "text": "The most scariest part of anything, is never seeing whats coming along your way, when you hear creaky sounds at home or in anywhere without seeing any ghost or demon or spirit, it is chilling and really terrifying, because you keep wondering and saying \"what if\" that what The Blair Witch Project Holds."
    },
    {
      "rating": "10",
      "text": "The Blair Witch Project es una de las mejores películas de Falso Documental que he visto. La película, en sí, trata sobre 3 adolescentes que buscan recopilar información de lo que es la leyenda urbana conocida como La Bruja de Blair., ésta interesante y entretenida trama logra ser efectiva y acierta hacia una buena perspectiva., en donde mientras que avanza el film el público siente nervios y escalofríos mientras avanza la película, con un buen razonamiento de sensaciones terroríficas y dosis de sorpresas que ocurren en el film, además de una forma eficaz en hacer que los personajes que habitan la historia se quiebren psicológicamente más y más a medida que avanza el largometraje. En general, The Blair Witch Project logra ser una buena película de terror que te llama la atención y que da una cálida sensación de angustia y miedo"
    },
    {
      "rating": "0",
      "text": "Maybe the worst and most boring movie i've ever seen. Detestably unrealistic, the girl keeps filming against all sense of logic.. 80 min. of absolute nothingness.. Please do yourself a favor and DON'T ever watch it."
    },
    {
      "rating": "10",
      "text": "This movie scared me, even though it doesn't have all that \"girl in white dress with long black hair standing in middle of road\" effects. I'm a horror freak, i know a scary movie when i see one, and this movie is the one. now,my movie rental money didn't get wasted this time!!"
    },
    {
      "rating": "10",
      "text": "This is, by far, the scariest movie ever made. Its like going to a strip club and seeing completely naked women vs. going to the beach and seeing women in bikinis. You get more turned on by the bikinis because you want to know what is underneath and you can form in your mind what you think they would look like naked. That is an analogy my friends. No, I'm not saying I would rather see the Blair Witch in a bikini rather than completely naked, I'm saying the movie does not blatantly show the boogy man, you can only imagine what the witch looks like, you can only imagine how it actually attacks its victims.. and that makes it great raw, unknown fear. Those who hated this movie would rather have things spelled out for them and lack imagination."
    },
    {
      "rating": "10",
      "text": "The Blair Witch Project is the only movie that I can say has genuinely scared me in my adult years. There"
    },
    {
      "rating": "10",
      "text": "Scariest movie of all time because of its reality. Look the movie is not real but the story is. This is what producers did, They took 3 film makers though them in the forest and then made noises and scared the hell out of them! They pretty much said here is a camera go make a documentary. They took eah person 1 by one and told them about, (the guy who acted like he died.) Not true but still if you don't know that, it is brilliant."
    },
    {
      "rating": "9",
      "text": "Really creative, really scary, really fun."
    },
    {
      "rating": "10",
      "text": "Great movie. Those who gave this a bad rating are probably too used to simple movies like Transformers. Know a real movie when you see it."
    },
    {
      "rating": "7",
      "text": "A well made horror film with a very original concept. Although I wasn't freaked out by this movie, it certainly has an atmosphere to it, and when you really examine it, it has some very well-executed moments. Especially the last 10 minutes. The dialogue was too over-the-top at some points, but was almost always convincing, even if the characterization of Josh adn Mike seemed to switch midway through. If you want to watch a movie alone some night, this si a good pick. If you want to watch a movie with firneds, it probably isn't such a good pick. But then again, what true horror buff watches horror movies with other people?"
    },
    {
      "rating": "10",
      "text": "Such a minimalist and overwhelming scare-the-crap-out-of-you thriller! I was sleepless for two nights just imagining what that odd sound in the water pipes might be."
    },
    {
      "rating": "10",
      "text": "This is one of only two movies I've been truly scared by, the other being \"Ringu\" (original Japanese \"The Ring\"). Despite everything you've heard and the amount you already know about the plot, still utterly terrifying. It serves as a reminder of the fact that we really do enjoy being scared by film."
    },
    {
      "rating": "8",
      "text": "Many people say it's old-fashion to see this movie now because there are a lot of scary movie better than this one. But I don't agree with that, I think TBWP can still scary out **** of me. It's raw and everything in the movie is like reality. Also the performance of the actor is awesome. I can feel their desperation and scare from the movie."
    },
    {
      "rating": "8",
      "text": "While the movie may not provide many jump scared as craved by audiences, it proves that the strength of imagination can be even more frightening than any film."
    },
    {
      "rating": "10",
      "text": "The Blair Witch is at no point overdone, nor a tad bit boring in any single second of any minute. The Blair Witch is a gripping, mysterious film that uses barely the location and the stories told by characters further to the beginning of the film to keep you suspended and immensely spooked out for the duration of the film, but mostly afterwards. Boring? Most definitely not, The Blair Witch is a stroke of genius. End of."
    },
    {
      "rating": "10",
      "text": "I watched this movie for the thirteenth time last night, and was still creeped right out. Watching it on DVD in my house, I still felt as though someone might be watching me from down the hall. This is the effect of great atmosphere, and the Blair Witch Project has it. Every financially cheap aspect helps it. It's shot in a real environment, not a sterile set or against a CGI backdrop; its actors improvise their dialogue rather than read from scripts; the lighting is completely natural, and all the sounds are ambient. Instead of a soundtrack, this movie has whatever the microphones picked up in the woods - much scarier than a bunch of licensed music or orchestral tones. By shooting this movie over six straight days and camping in the woods, these college-level actors access real fatigue and real emotion that blows away Hollywood performances because even though their premise is every bit as fictional as a blockbuster, their feelings are real. Minimalism is the name of the game, hiding or only showing a little of any scene - only what was caught on the characters' cameras. Outside of those people who can't stand student film to begin with or can't appreciate something filmed with shaky cameras (something most people get used to in a matter of minutes, and something that is a huge part of modern news reporting), nothing can draw an audience in quite like this movie."
    },
    {
      "rating": "10",
      "text": "Captivating movie and scary because of our imaginations. If you didn't think this was scary, then your IQ is low. People with high IQs have been shown to have high creativity and good imaginations and can suspend disbelief while summoning verisimilitude to put themselves \"in\" the film. This movie exudes authentic emotion, fear, and insane imaginative creep factor."
    },
    {
      "rating": "6",
      "text": "I liked the movie especially in the begining but when they go full on horror they just lost me."
    },
    {
      "rating": "0",
      "text": "I spent about an hour and a half sitting around in my living room on halloween waiting for something...anything to happen. Just when I thought it was coming to the big climax at the end in the house, nothing happens....big surprise.This movie is a complete waste of time..there is nothing scary about it unless you find filming shots of the woods, watching swearing teens, listening to a high pitched annoying girl voice (that was pretty scary), watching film from inside a tent with cheap sound effects playing outside, or watching a wobbly camera run through the woods at night (cant see anything), then you should skip this movie. If I was out in the middle of the woods, I too would decide to throw away my only way of finding my way around..my map. This movie had a weak, if any plot. This movie was one of the biggest let downs I have ever seen, and I've seen \"Batman and Robin.\"I've never seen BWP 2, but it's anything like this movie, it will be equally bad if not worse, because I would have to waste another 90 minutes of my life."
    },
    {
      "rating": "10",
      "text": "This movie is fantastically terrifying because of the way in which things unravel for the characters and the way in which the thing was marketed. Our three characters act much like how many twenty-somethings would act, and their reactions as they are hunted/stalked by the entity in the forest is entirely believable. The film very effectively builds the tension and unease as the time progresses (or does it?) for our group. As more and more happens to them they unravel pretty quickly and become distrusting of one another, which is realistic when thinking of how being stranded and lost in the deep woods would break one down. Then adding in the supernatural elements and the whole thing has me on the edge of my seat even knowing what going to happen at the end in the house.It's also crazy how back in the day they had the actors in the film listed as deceased for a year after its release. This film is in large part responsible for making found footage horror its own genre/sub-genre. Definitely check it out if you haven't yet."
    },
    {
      "rating": "10",
      "text": "this movie is one of my favorite, the idea and all the hypothese you can make with it is insane. It's all based on your mental, it shows nothing, wich is for me what make it so great. watch it, please."
    },
    {
      "rating": "7",
      "text": "Although the movie smells old and cheap, \"The Blair Witch Project\" is one of the standing point movies of the 'psychological horror'. It will scare the **** out of you."
    },
    {
      "rating": "1",
      "text": "Now this movie, what a load of crap this was. It had no scare factor at all, I don't get why people are giving this good reviews overall. This movie has about the same scare factor as me getting out of bed. The whole movie was just four people walking through the woods pretending to be scared. Also, despite the way it looks, its not actually based off true events, its just based loosely off a legend but thats it. The actors got paid, so their obviously not dead."
    },
    {
      "rating": "3",
      "text": "seriously this film is the worst. I can't even imagine that it was successful. Why people liked this movie? Was it scary? No Did it have a good plot? No. As a horror movie it's awful as a documentary it's ok. I watched it  untill the end just to see what happens because i read it was scary. You give to this film 81/100 and in Saw 46/100. Bad movie is still a bad movie, critics can't change the quality of a film. Thumbs down! Don't waste your time"
    },
    {
      "rating": "10",
      "text": "Completely horrifying, maybe the scariest film ever made. I pray to the movie gods that somehow this thing gets back into theaters so we can enjoy being terrified by this masterpiece with a room full of crowded anxious strangers. Don't be surprised if this film doesn't make you jump very much (especially if you're just sitting at home watching it by yourself), but it will haunt your dreams and keep you up at night with its intense creepiness. Do not see this if you are remotely afraid of the woods or the dark."
    },
    {
      "rating": "1",
      "text": "I saw this movie a few months ago for the first time, and do not understand at all the hype over this movie. The Blair Witch project was undoubtedly one of the worst movies I've ever seen.  The acting was absolutely horrendous, and it was impossible to sympathize with the characters. Heather, annoying brat that she was, insisted on filming EVERYTHING. Even as the other two guys were screaming at her to turn it off, she had to film every moment of their downfall. Her annoying voice was enough to make me hate this movie from the start, not to mention the series of ridiculously moronic things that these kids did from start to finish, from  throwing their map into the river, to going into the woods without listening or paying attention to the people they interviewed about it. Pretty much nothing happened the whole movie except watching them argue with each other.  The vague things that were supposed to scare us did nothing but make the story line more paper thin than it already was. The ending was stupid, and barely made sense even when you knew what was supposed to be happening. Even as Heather is walking up the stairs expecting to find her friend dead, she is STILL filming. It was completely unrealistic. The only terrifying thing about this movie is the fact that it is so popular. I think Family Guy did a perfect summary of the movie when Brian was explaining the movie while watching it with a blind guy. He said \"They're in the woods. The camera keeps moving around. I guess they're looking for some witch, I don't know, I wasn't listening. Nothings happening................nothings happening.................something about a map..nothings happening.... Its over. A lot of people in the audience looked pissed.\""
    },
    {
      "rating": "10",
      "text": "At a time when digital techniques can show us almost anything, The Blair Witch Project is a reminder that what really scares us is the stuff we can't see."
    },
    {
      "rating": "10",
      "text": "This is why there are so many found footage movies out there now! Because The Blair Witch Project is awesome! Its brilliantly presented, wonderfully executed, well acted, groundbreaking, chilling, thrilling, creepy and suspenseful! Watch the movie that invented the found footage genre, see where it all began. Because, found footage movies had a GREAT start! If you don't like scary movies, don't watch this, you will be scared, the movie still holds up today as a creepy ass film! It just goes to show that even with a low budget, you can still do some great things."
    },
    {
      "rating": "0",
      "text": "please dont bother watching this film, if you want a scare because it honestly isnt scary or creepy (well maybe a bit, but not enough)\r if you want a scare watch sinister, i highly recommend it, and it is genuinely scary"
    },
    {
      "rating": "2",
      "text": "I **** hated this movie, it was darn stupid. I would have been ashamed to be part in this box office piece of **** I have nothing against the director but  I just hated the movie."
    },
    {
      "rating": "0",
      "text": "When me and my friends watched this last Halloween, we were expecting a horrifying movie that would give us nightmares and a lot of stories to tell at school after. Instead what we got was an hour and a half of shaky cameras, mediocre acting and an ending that is more laughable than scary. A letdown for people who are looking for a good movie to watch on the aforementioned holiday."
    },
    {
      "rating": "10",
      "text": "While there is now technology that is terrifying, what we don't see is what we fear most, and \"The Blair Witch Project\" proves it. It might seem to generations that it is an old movie and a cheap one too, \"The Blair Witch Project\" stands out as one of the most impressive work in the horror industry, absolutely and highly recommended."
    },
    {
      "rating": "9",
      "text": "This is a very good film. films tend not to scare me, but i can definitely see why this would scare others. it is definitely a film not to watch alone. the acting is good and the general storyline is amazing. The producers did a great job of making everyone think that it was real, and nothing seems to disappoint.this is a very good film. ALMOST scared me, which means it may well scare you!!this is a must see, i realise that it gained mixed reviews. thus, you should watch it just in case you are like me; someone who very much considers this film a classic."
    },
    {
      "rating": "10",
      "text": "This film is most definitely the most horrifying movie I have ever seen, as well as my favorite horror film to date. Everyone who says there are no scary elements in this film are used to the current habit of American film to a.) make everything as gory, violent, testosterone-filled, and nonsensical as possible, and b.) rip off other countries' movies (and do so poorly - THE GRUDGE!!!). The Blair Witch Project is the embodiment of the human race's greatest fear: to be in a situation out of your control, to have your actions forced like a hamster in a maze. Also, I find the idea of not actually showing what is chasing them through the forest fascinating; your mind is left to wander upon the most terrible image you can muster, and it grows on you like a virus. The most exceptionally terrifying movie ever made; love it forever! :D"
    },
    {
      "rating": "8",
      "text": "I love tis movie. I know a lot of people say this movie isn't scary. this movie is scary in its own way. I think they did a good job with the idea of this movie. This movie is kind of scary at some parts. This was a good idea for a movie. One of the best horror movies ever made. This is on my list for best horror movie. I love this movie its really good."
    },
    {
      "rating": "9",
      "text": "Think the critics have this pegged better than the users for a change. If anything this movie is under-rated because it totally broke from the scary movie, bloody horror norm. Unless it's really happening to you it's hard to capture truly being scared but this movie comes close. Certainly not the budget of The Ring or Sixth Sense but still pretty good."
    },
    {
      "rating": "7",
      "text": "An urban legend getting an American production above the average, even with amateurish technical about. However, this is the great charm of the film, to bring a touch of reality to something that frightens people, while not real. With an unstable nature documentary footage, the two rookies directors, Daniel Myrick and Eduardo Sanchez, lead an unusual thriller that explores witchcraft in a peculiar way and extremely evil. What is most interesting in this production, is the fact that directors can create fear in the viewer, without the least show directly the source responsible for it. Imagine what you can not see. How can you not be afraid of it?The power of an urban legend is something that can be measured against the influence which it carries in the middle. In some cases, above the power is so vast that people around the world are interested in such stories. Based on this concept of influence, the plot of this production is a journey of three film students, to explore the long- cherished legend of the Blair Witch, however, what is shown on the screen, are just the roll of film found by police, after the mysterious disappearance of young people. Starting from a premise that the suspense has good things to come, the two directors work in the background that is extremely favorable for the development of the script.The amateur footage further contributes to the enhancement of the heavy atmosphere, which is already present in the photography involved. The naturalness of it is the factor that close ties to production reality. The sound system works like a soundtrack orchestrated by a great professional who knows very well to put it in the context of the film. Adding these two questions film, photography and soundtrack, we get a product that pleases and amazes the viewer, while every sudden movement of the camera. It is clear in this production, the film does not require cutting-edge technological improvement, to satisfy your audience.The script is working well and can, from the start, accumulating records that direct the viewer to understand the outcome. The development of the argument is a gradation of psychological conflicts of each character, which tracks the tempo until the final minute. Playing with the psyche of each character , the filmmakers create claustrophobic situations that reflect the viewer, keeping it stuck in that atmosphere without answers and with every move closer and with a look at the picture provided by amateur camera in the darkness of night, where the script comes to apex of the gloom .Combining certain techniques is a superlative effort to create something new, taking the proper proportions of gender addressed. Working from the premise peculiar form, the script can do justice to what is stipulated in your synopsis so enjoyable and interesting for the audience. The technique is not mainly attributed to technology, but on good ideas, falling in the right hands. Exercising a right direction and leading the film gradually, the two rookies prove that gender is not lost, but it takes a few bumps to get it moving again."
    },
    {
      "rating": "1",
      "text": "It was no big deal at all. I guess it would be a lot scarier if anything actually happened. It give it credit for going ahead and filming it differently than all other movies, but it was just bad. No interest in ever seeing it again."
    },
    {
      "rating": "9",
      "text": "A genuinely frightening film. With some good improvised acting and great filming techniques for a found footage film. A must watch in the middle of the night"
    },
    {
      "rating": "0",
      "text": "One of the scariest films ever. Plays on everyones fear, the dark, the unknown, the feeling of being trapped, and death. The film is played out through handheld camera, but this adds to fear, giving the film a sense of realism, making you think the film actually happened. The acting is very naturalistic, and in a rare case, the improvised script makes the film feel again more real, as if they would react in this way. The film is clear proof that in most cases not seeing the monster is scarier, for we imagine what is going on out there, or how we would be in that situation. The final sequence will easily go down as one of the best endings in history, and easily the scariest, playing on our minds after we leave the cinema, leaving a lot to the imagination. As a whole the movie is more terrifying after you leave than while watching even though you will undoubtedly gasp at certain scenes."
    },
    {
      "rating": "9",
      "text": "One of the scariest films ever. Plays on everyone"
    },
    {
      "rating": "8",
      "text": "Alright, this movie isn't too scary on it's own. I'll admit that. But you know what made this movie especially terrifying for me? I went into the woods a week after watching this movie. If you and your buddies are going to go camping any time soon, I highly advise making them watch this movie ahead of time so that their brains will be  when you're all doing a night trek through a forest.\r This movie did some things exceptionally well:\r1) the first person story telling was very captivating and really put you inside the character's shoes\r2) this movie doesn't have background music in it (except the beginning when they're in the car) which really makes the audience guess and interpret different scenes in this movie\r3) it really creeps the crap out of you.\r If you're looking for an \"in the moment pop up scary\" type of movie, you will be disappointed with Blair witch project. BUT if you are looking for a truly terrifying experience, watch this entire movie with the mentality that everything in it is based off of a true story, then go camping with a bunch of friends. and make sure you do a night trek through the woods (stoned if at all possible). You will   your pants."
    },
    {
      "rating": "7",
      "text": "I did enjoy this movie although it really wasn't that scary and the ending was kind of anticlimactic. I watched this for the first time at a horror movie marathon at a friends house and the scariest part was when the tv turned off and we thought it was going to be a jumpscare so we sat waiting for it for five minutes"
    },
    {
      "rating": "10",
      "text": "El Proyecto de la Bruja de Blair (1999)Sinopsis:Tres estudiantes de cine se pierden en un bosque habitado por una bruja, durante su investigación de la leyenda.Opinión:Esta fue una de las películas precursoras en el subgénero Metraje Encontrado o Falso Documental, no fue el primero ya que este fue Holocausto Caníbal del año 1980, pero fue el presente el que resultó ser un fenómeno de la cultura popular y cinematográfica dando rienda suelta a un sinfín de películas de ese estilo de ahí en adelante, con un presupuesto de $60.000 dólares, logró recaudar en esa época casi $250.000.000 sin realizar ajustes por inflación.En lo personal esta película me daba mucho miedo en su época, la producción cruda y minimalista da lugar a que la película se sienta realista al igual que las actuaciones que según leí, no lo pasaron nada bien durante el rodaje.Si bien es un clásico del género, siento que no ha envejecido muy bien habiendo otras películas de este tipo que la han eclipsado fácilmente y si existen es gracias a esta, y punto.Valoración:5 ⭐ de 5 ⭐ (basada en mi experiencia al verla cuando era niño, actualmente le pondría 3.5 ⭐ de 5 ⭐)"
    },
    {
      "rating": "3",
      "text": "One knows that a film Is genuinely 'scary' when there is a constant amount of suspense. Not once did I see the witches nor was I scared, u don't leave the film to the end for action to arrive."
    },
    {
      "rating": "0",
      "text": "This movie was one of the dumbest most boring not scary movie i've ever seen in my life. The ending was one of the worst endings that a movie could have and you do not even see the creature monster whatever it is attacking and terrorizing the group of people. I hate horror movies in general this i could and would not even come close to putting this movie in that genera I was not scared at all during this movie and for the people who gave this movie a good review you can not base a score on the movies originality. Sure it was original but still the acting was horrid, story was so incredibly stupid, and the ending was so retarded. Now I hated cloverfield I thought it was awful but it was 100 times better that the Blair Witch Project, For anyone who thought this was good well go watch a really movie without that stupid camcorder effect!"
    }
  ]
}