{
  "id": 3602,
  "title": "The Silence",
  "starring": [
    "Stanley Tucci",
    "Kiernan Shipka"
  ],
  "runtime": 91,
  "genre": [
    "Horror",
    "Drama",
    "Thriller",
    "Fantasy"
  ],
  "description": "With the world under attack by deadly creatures who hunt by sound, a teen and her family seek refuge outside the city and encounter a mysterious cult.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lTVOquzxw2DPF3MKuYd1ynz9F6H.jpg",
  "categories": {
    "plot": 7.5,
    "acting": 7.25,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "(spoiler alert) \"The Silence\" is at times like watching a car accident, you feel disgusted but you can't stop watching.  The acting is superb except for the detective, David.  I found him almost laughable at times.  This movie gives off a feeling of dread that keeps escalating but in the end justice is never fully served which is more truth than fiction.  I would have liked to have seen  the movie end just after the suicide.  The denouement was not necessary and I thought took away some of the suspense.  Definitely a thriller that is thriller."
    },
    {
      "rating": "8",
      "text": "At a confident and steady pace, the script allows the characters to develop powerful, subtle performances, rather than relying on their dialogue. Suspense fans tired of low-brow, explicit exploitation movies may want to check out “The Silence,” an absorbing German thriller that delivers the suspense without sacrificing the drama of the human experience.\r On July 8th, 1986, a eleven year old girl Pia (Helene Doppler) is raped and murdered by Peer (Ulrich Thomsen) while a second man, Timo (Wotan Wilke Möhring), watches with equal parts of disgust and arousal. The two dispose of the body and return home, but while Peer began to destroy any potential evidence, Timo has already packed and boarded a bus out of town. 23 years later, to the very day, another young girl goes missing with only her bike and bag left behind at the very spot where Pia was abducted years ago. Writer/director Baran bo Odar‘s film, “The Silence,” follows the distraught families, the police, and the two men behind the original unsolved case in a story that explores grief and guilt, obsession and duty.\r It's a well-acted, emotion-charged drama whose murder mystery is almost secondary to the human element. It's a complex examination of the many facets of humanity in which even those who commit the most heinous acts aren't complete monsters. The film is about tragedy and the everlasting impact on those involved, from the victims to the perpetrators.\r Director Baran bo Odar maintains a sense of morbid fascination in a film that in someone else's hands might become overwhelmingly unpleasant. Despite its nearly two-hour running time, it never becomes dull or depressing, thanks in part to large cast of characters whose nuanced portrayals strike a chord of truth  terrifyingly so for any parent. Even though the conclusion isn’t exactly overpowering, the journey is remarkably nuanced and compelling  and most certainly an uncomfortable one."
    },
    {
      "rating": "5",
      "text": "A haunting tale which was interesting enough to keep my attention, but surprisingly lacked somewhat the emotional connection I expected. It's definitely a minimalistic thriller, relying more on subtleties in character to drive the story, which is refreshing, but at the same time, too \"read between the lines\" for me. Motivation and means of the crime were not fully explored which was odd but intentional. It's so different that I'm surprised I didn't like it. Maybe it needs another watch."
    }
  ],
  "recommendations": [
    "thelma",
    "the_guilty",
    "before_i_go_to_sleep",
    "elle",
    "the_killing_of_a_sacred_deer",
    "stoker",
    "incendies",
    "all_i_see_is_you",
    "the_card_counter",
    "mine",
    "alone",
    "the_invisible_man",
    "the_voyeurs",
    "searching",
    "secretary",
    "high_life",
    "anna",
    "the_way_back",
    "the_night_house",
    "the_rental",
    "prisoners",
    "the_machinist",
    "you_were_never_really_here",
    "found",
    "the_howling"
  ]
}