{
  "id": 513,
  "title": "The Grinch",
  "starring": [
    "Benedict Cumberbatch",
    "Rashida Jones"
  ],
  "runtime": 85,
  "genre": [
    "Animation",
    "Family",
    "Comedy",
    "Fantasy"
  ],
  "description": "The Grinch hatches a scheme to ruin Christmas when the residents of Whoville plan their annual holiday celebration.",
  "releaseYear": "2018",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fDKfziciaKrdTzBZEnXH9tx6u2G.jpg",
  "categories": {
    "plot": 6.0344827586206895,
    "acting": 5.125,
    "ending": 4.5,
    "soundtrack": 5.666666666666667,
    "cinematography": 5.0,
    "familyFriendly": 6.647058823529412,
    "funny": 5.44,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "7",
      "text": "It's alright. I feel the whole thing with Cindy Lou's friends and mom was kind of unnecessary, but this movie is faithful to the original yet adds its own flavor at the same time."
    },
    {
      "rating": "7",
      "text": "Cuter and more charming than the loud and overstuffed Jim Carrey version. It’s just too obvious that not much will take for this Grinch to be nice. Since yes he’s a jerk but with a nice guy side throughout the film. This version is easily better than the Carrey one though. It may even get more of an emotional reaction than the original short. Still, it does nothing too spectacular with a story we all know by now."
    },
    {
      "rating": "6",
      "text": "\"The Grinch\" falls in line with \"The Lorax\" in which the movie is good but is dumbed down with childish toilet humor. I think this move doesn't deserve the heat it's getting. It's nice holiday fun and is a slight improvement from the already alright \"The Lorax\" fronting with Zac Efron and Taylor Swift. Benedict Cumberbatch was a problem for me. I didn't like his voice behind the Grinch. Overall that was a pretty easy pill to swallow. The rest of the movie is fine, but it picked up in the third act. That was a tear jerker which was really uncommon for the quirky Illumination studio. Overall I enjoyed the film mildly but had some gripes that could've been fixed."
    },
    {
      "rating": "8",
      "text": "I love this better then the first one it was funny and felt like a more Doctor seuss movie the only thing that I don't like is the song a little bit different lol and I feel like compared to the first one they changed the story a little bit but a good movie for me"
    },
    {
      "rating": "5",
      "text": "First of all, the only really good thing about this movie was the animation. The animation in this movie was pretty good to look at. You can easily see that the animators put a lot of effort into how the movie looked. The pacing was pretty decent seeing how it’s a kids movie. The pacing in the film felt around the same speed throughout the film and was easy to follow. Benedict Cumberbatch was ok as the Grinch. I’m not sure if it was his fault or the dialogue in the film because the dialogue was cringy. There was so much forced humour in the film but seeing how this film is a kids film that is understandable. Now like I said before the pacing in the film is decent just not great. The book is sixty-nine pages long and they expanded it to a two hour and twenty-six-minute long movie so at some parts it seems to drag on. In my opinion, the last half of this film is better than the first and by that I mean the last twenty or so minutes. There is a subplot in this movie that really doesn’t go anywhere so they could of just taken it out of the movie and probably make the movie a tiny bit better. The music in this film, which is scored by Danny Elfman, was actually pretty good but the the cover of the classic song wasn’t. At least this movie has a good message for people to follow that Christmas is about family and friends and not the gifts under a tree. In the end. The Grinch is a nice movie for kids but is an unnecessary film. If you want to see a good Grinch movie watch the 1966 one."
    },
    {
      "rating": "5",
      "text": "I'm going to waste less of your time than this movie will. It was extremely by-the-numbers, completely inoffensive, bland, generally unfunny, and extremely mediocre. It's obvious that the only people that cared even a little were the animation crew and Benedict Cumberbatch, and even he can't save this. I won't lie, I thought this movie had soem good ideas that were underused, like when the Grinch is, ya' know, stealing Christmas. The gadgets he uses were interesting and visually fun, but that's only about five minutes of the movie. I also did feel fairly festive during this movie thanks to the surprisingly beautiful animation. This is for sure the worst 'Grinch' adaptation. It's just like they stretched out the 20 page book into a 90 miute movie and gave Cindy Lou Who something to do to reach the expected length. The Jim Carrey 'Grinch' at least take some risks and expands upon the concept of the book. I'm not saying that movie is amazing or anythin, but I enjoying way more than this 'Grinch' just based on Carrey's performance alone. This not only the best, but my favorite movie from Illumination with 'Despicable Me' as a close second, which isn't really saying much since this is the second worst animated movie I've seen this year, with 'Early Man' taking the spot of the worst only because of the plot. I suggest you see this with your family, chug some spiked egg nog (as long as your at least 21 years of age), turn your brain off, and enjoy the pretty lights and colors. That's the best way to watch this movie."
    },
    {
      "rating": "10",
      "text": "I think this version surpassed the original in my mind. It remained faithful to it while adding only positives. New yearly Christmas movie for my family for sure."
    },
    {
      "rating": "9",
      "text": "Hands down the best Grinch ever. The characters are smart, funny, realistic, and do a great job of recreating a classic. My ONE thing I don't like is the speed of things. Most of it is absolutely perfectly paced, but some parts such as [spoiler]    aren't well thought out, but still make it so good. Cindy-Lou is different in a great way, and it so well expands on these characters and adds so many new ones which just fit in really well. Overall, this is one of the most well thought out remakes ever; it's colorful, fun, and enjoyable and is impossible not to love."
    },
    {
      "rating": "5",
      "text": "Illumination Entertainment seems to not learn its lesson from the mediocrity of The Lorax. In fact, the studio also seems to not learn its lesson from the mediocrity of Minions, Despicable Me 3, The Secret Life of Pets, and Sing. The Grinch unfortunately ended up having the exact same problems that The Lorax had. Instead of sexual innuendos as the time filler as you saw it in that How the Grinch Stole Christmas movie from 2000, The Grinch uses pop culture references as the time filler and whether that improves Dr. Suess's film adaptation library or not depends on how stale the jokes will become in the next couple of years. I can quickly say that with a film that barely explains its plot to the audience these jokes will not hold up for long."
    },
    {
      "rating": "8",
      "text": "This is better than Jim Carry's ugly version. Is not better than Chuck Jones version, but is good enough as it is."
    },
    {
      "rating": "7",
      "text": "There are some Christmas traditions that are non-negotiable for a vast majority of people; gifts, excessive spending, eggnog, mistletoe and of course, watching some of your all-time favourite Christmas movies. While everyone has their own personal favourites, I can easily bet that one of those holiday tradition films, thats easily labeled as a ‘required viewing’ for the festive season is the 1966 Boris Karloff TV special How The Grinch Stole Christmas! Growing up and even today, its hard to flip through the channels without catching the original special. Yet, no matter how many times we’ve seen it before, or what part the special is on once you flip onto it, you can sure bet that the special will more than likely be watched until its heart-warming ending. Too bad, I’m sure the same can’t be said with the 2000 live action remake starring Jim Carrey. Luckily, 2018 has brought us a new, brighter and greener Mr.Grinch. From Illumination, the studio that brought us those adorable little minions we can’t get enough of, The Grinch is a vast, richly coloured, fun and most importantly, loyal addition to the Dr. Seuss canon; proving that sometimes, changing too much of a good thing, isn’t always better. Instead, Benedict Cumberbatch’s newest interpretation of the Grinch is loyal to the Boris Karloff original, channeling his wicked sense of humour, dark and twisted hate of a joyful holiday and its gleeful spirit and most of all, some exceptionally great voice work.While almost everyone knows the basic narrative of the original story, this version pits us in a similar Whoville that we are all used to, but this time, the Mayor of Whoville, Mayor McGerkle (Angela Lansbury, yes the mayor is now a woman) declares Christmas be three times bigger; kind of ironic for a guy who’s heart is three times smaller than the average heart.At an hour longer than the original film, you would think that screenwriters Michael LeSieur and Tommy Swerdlow would dabble deeper into the past of a cute and small little fella, yet, despite brief flashbacks of a baby grinch in an empty orphanage, these questions aren’t really relevant in a child-friendly animation film in 2018 thats main intent is to cash in on cute and memorable commercial products for the 2018 holiday market. Even with very short and quick flashbacks of The Grinch’s Christmasless past, our miserable antagonist cannot seem too shake off these awful memories, no matter how much people around him, including the most cheerful who-of-them-all, The Grinch’s neighbour Mr.Bricklebaum (Kenan Thompson) tries to cheer our foul smelling greenie; nothing seems to glow his cold, cold heart.Although its been over fifty years since the original aired, and almost two decades since the live action remake, there is something special about experiencing such an iconic cinematic character being cherished by children for the first time. Luckily for myself, despite all the genuine laughs, gags and jokes that I found myself chuckling to, one fo the best parts of experiencing The Grinch was hearing the cheers, laugher and questions of the kids around me in the theatre. Asking their parents why he is so mean, why is our titular character is so green when everyone is ‘normal’, and if the movie is done with every fade out. Despite the endless kicks to the back of my seat from the youngster behind me, nothing melted my heart more than hearing their little chuckles with every thrown snowball and sight-gag involving The Grinch.Illumination, who luckily decided to really modernize the original story, and add its signature flare of whacky colours, vibrant animation and silly humour, does a fantastic job of staying true to the original, without ever compromising the fresh and radiant look of this 2018 version. Keeping many of the original characters was also a great choice, including the girl who challenges the grumpiness of favourite animated Scrooge, Cindy Lou Who (Cameron Seely), as well as, one of my loyal favourites, Max, the Grinch’s trusty yet sweet and loyal sole companion. Max warms your heart with each smile, wag, bark, drool and use of his powerful puppy-eyes.Yet, while the 2018 Grinch is a faithful interpretation, there are a few additions that we cannot help but fall in love with, including a yack-like looking reindeer Fred. Fred may be a tad overweight, have a slight obsession with whipped cream and pretty well eat anything in his sight (including Grinchie’s hair), Fred is a fantastic addition to the world of Dr.Suess, especially this adaptation of The Grinch. Along with Max, the two front-runners to guide the Grinch’s sleight that night, give the audiences the majority of the laughs to a newly vamped up Christmas classic.While The Grinch’s message of warmth and wonder is simple and never really changes between fifty years and three adaptations, it seems like each and every year, all of us need a real reminder of what the holidays are all about."
    },
    {
      "rating": "8",
      "text": "The best animated dog of this decade exists here. Max is just the cutest little guy. The Who`s look great including Cindy. Cumberbatch does well with the titular role. A perfectly safe film for the whole family of all age groups"
    },
    {
      "rating": "10",
      "text": "Truly enjoyed this remake.have seen both of the other versions. Prefer this one!!"
    },
    {
      "rating": "8",
      "text": "Yes! Perfect! Amazing movie, very very good movie, But some of it gets kinda boring."
    },
    {
      "rating": "9",
      "text": "Ok so walking into the movie I wasn't quite sure what it would be like what was in store well I loved this movie yes every inch of time spent with our good friend that Grinch the movie was funny yes quite a site some might say I was laughing all night the movie was wonderful yes this is true q really enjoyed this movie and I think so will you this movie was great that's all there is too it that's why I came home so I could review it its a great family comedy oh yes indeed you might find it the movie that your family needs"
    },
    {
      "rating": "10",
      "text": "This movie was so worth watching since it was completely faithful from its original source material unlike Mike Myers's The Cat In The Hat."
    },
    {
      "rating": "10",
      "text": "Wow, I do not understand where the negative or mixed reviews are coming from.  I am 36 years old and I grew up with the original cartoon movie and I use the book in my Kindergarten class.  This movie is perfect.  I can not think of any negative things to say.  The voices, the artwork, and the overall story is perfect.  They did change a few things from the original, but it did not hurt the story.  It actually made the story more heart felt to me.  Fred the fat reindeer is the highlight of the movie!  If you like Dr. Seuss and if you like the original Grinch, GO SEE THIS MOVIE!!!  I actually want to live in Who-ville.  By the way, a trailer for The Secret Life of Pets 2 is shown prior!!!!!  CANT WAIT!!!"
    },
    {
      "rating": "1",
      "text": "the new 2018 movie portrays the grinch as cuddly and fluffy he is supposed to be ugly and evil for one in the 2018 version he is nice to max the dog in both the 2000 movie and the one before he hated max and was mean to him in the 2018 version he eats spaghetti in the jim carry one he eats glass long story short the 2000 movie rocks and the new grinch is a terrible portrayal"
    },
    {
      "rating": "8",
      "text": "Of course we all know this classic story, but here it gets a fun, lively, and colorful makeover courtesy of Illumination (the animation studio that brought us the Despicable Me films.) Benedict Cumberbatch, who lends his voice to the titular character, is also a delight and brings great fun to the film! Overall, it may be simple and pretty standard and close to the original story and cartoon, but its timeless message and humorous antics are so much fun that it hardly matters, and I'm just relieved it was nowhere as near as obnoxious as the Jim Carrey one!"
    },
    {
      "rating": "10",
      "text": "Valió la pena esperar tanto para ver esta película, quedé totalmente satisfecho"
    },
    {
      "rating": "4",
      "text": "Whoever decided to release this thing in IMAX and Dolby Cinema deserves every insult and threat possible. And also that one guy who wrote the article on Variety about Chris Meledandri being the most powerful man in Animation. Now onto the review.You know what’s funny about The Grinch? The fact that I actually had hopes for it (being in the current status of a Universal Hater). Not the highest hopes,but some...Take it as an almost finished box of chocolate.After seeing the movie,not only did I dislike the movie,but you can go read my review of Jurassic World Fallen Kingdom and nothing changes (except the JURASSIC UNIVERSE thing). Or just stay here and read all the way to the end.It’s not as dreadful as that movie,though.  There are nice things I can say about it. I love the cave where The Grinch lives. It’s full of inventive contraptions and it’s always a blast to see it in motion. Just like the gadgets used in the third act,where he steals Christmas. SO MANY COOL GADGETS. Like,you have a candybar that hides a net to steal some presents,a pair of boots that can send you up in the air… James Bond would be proud.Unfortunately (or not) this is where the good stuff ends,because...MAN,this was a hateful ride. Let’s get this off the way: This may be the worst Danny Elfman score I’ve ever heard. There’s nothing redeeming or fine about it. Say what you want about James Horner (RIP)’s score of the 2000’s Version. That at least brought something new to the table. The movie takes the record at ruining the source material. The Grinch is mean,but he sometimes takes a step back and get either emotional or happy. 2 sizes too small my TNT,movie! And when it gets to the source material,it’s just gone like that. Either nothing happens or it was ruined by Pharrell Williams narrating his next paycheck (were Videogames and Drones narrated in the book?)The animation is so hateful in this movie. Aside from the house and the cool gadgets,the character design is so baffling. I hate the Who’s look so much,I’d rather either rewatch the Ron Howard movie with the weird horrifying designs or just Horton Hears A Who. The city of Whoville is just bland and adds nothing new to the table.The comedy is just nothing in here. Not even Benedict Cumberbatch’s zany Grinch voice can save this movie from being bad.Overall,I didn’t have a horrible time watching this movie (thank god),but still. There’s nothing redeeming in terms of quality about this movie. Nothing works in this movie at all,and when it wants to work,it’s quickly ruined by something stupid. Perhaps a reindeer who spits cream out of his nose? The Boris Karloff and Ron Howard versions of the Grinch were mean,but this one is better left off the toilet."
    },
    {
      "rating": "8",
      "text": "A Unique Adaptation This Grinch adaptation is no Christmas classic, But it’s certainly an entertaining adaptation."
    },
    {
      "rating": "2",
      "text": "This remake was terrible! The comedy is at best meh like when the Grinch was like hey that's me and then max crashes in too the Grinch. But at worst the comedy is abysmal like when there was a screaming goat!this movie is also very boring because of how by the numbers it is. For the last tucking stop remaking Grinch because soon there would be no ideas for the Grinch and i'm getting sick of it!I was originally going to give this a 5/10 but because they give him a backstory so dumb I'm give this a 2/10! The backstory is the Grinch is always alone on Christmas but everyone other then the Grinch in not!that backstory is dumb because the Grinch as a grownup lives alone anyways! So overall this movie is abysmal!"
    },
    {
      "rating": "8",
      "text": "This movie was super sweet. It was a very innocent take on the Grinch.The animation and visuals were beautiful. While the choice of having a rapper be the narrator was fitting, the choice of rap for the soundtrack was an odd choice that didn't fit the sweet and innocent tone of the film."
    },
    {
      "rating": "8",
      "text": "Surprisingly good! I'm a huge fan of the Jim Carrey version but I really enjoyed this animated film too! Think I'll add it to my Christmas collection."
    },
    {
      "rating": "6",
      "text": "Dr. Seuss' famous anti-Christmas character is voiced by Benedict Cumberbatch in this new animated version. Because of a childhood trauma, he hates the holiday and plots to steal all of the fun from Who-ville. While all the bases are covered, nothing new or special is created. The story moves well and the dog is the only cute supporting character. Otherwise, it's a rather average, but colorful reworking of the story…sufficiently entertaining for kids. Even though it's labeled as a musical on some sites, there's really only one song (sung by the townspeople as a carol). It doesn't feature characters breaking out in song (which is the traditional definition)."
    },
    {
      "rating": "10",
      "text": "This movie is amazing.Very kind, good for both children and adults.The animation is really good. The picture is beautiful."
    },
    {
      "rating": "5",
      "text": "Grinch has some nice animation and funny bits but is mostly unoriginal and bland."
    },
    {
      "rating": "6",
      "text": "It sets out to be safe and it hits that, but as far as entertaining young children or offering shots of holiday nostalgia to people like me who grew up with the cartoon and Carrey film, it’s not half bad."
    },
    {
      "rating": "2",
      "text": "The narrator was so poor; there must be a million actors who could have read a children's book better than that. Out of place hiphop; inconsistent character actions with the Grinch and, finally, thinking a screaming goat would be funny half a dozen times. On the plus side, the animation was top-drawer; the animation team can be proud of itself at least."
    },
    {
      "rating": "5",
      "text": "You're a mean one Illumination.Like take a 26 minute short and stretch it out to 90 - a similar mistake that Ron Howard did.The Grinch himself whose not as horrible as the narrator and songs suggest, just slightly frustrated. The animation is bright and colorful, but lazy at the same time as I can tell they copied the same character model's while changing the appearance a little - same thing with the backgrounds.Still, it's not a terrible movie just mediocre at best. I guess my heart didn't grow three sizes as it hoped."
    },
    {
      "rating": "5",
      "text": "Bland and uninspired. Seems like it's aiming to be as unoffensive as possible - particularly after the egregious 2000 one (doubly so since that one made the Whos straight up villains). Cumberbatch seems like a great choice on paper but basely gives energy to the role coming off more of a whiny \"I hate it because people like it\" type than evil. Kenan Thompson got some solid laughs as the added neighbor character. But the other additions, Fred the Reindeer - Cindy Lou's story, don't bring much outside of stetching the run time. The Dr Seuss wild machine and creative naming is dialed back so much Whoville feels like a regular place with some eccentricities. Weirdly changes between rhyming and not - many lines are spoken as if they'll rhyme when they don't.  Pharrells' narration is awkward, and the remixed You're A Mean One is even more so.  It may seem like I'm ragging pretty hard, but I didn't hate this version. Just didn't much like it either."
    },
    {
      "rating": "5",
      "text": "Bastante entretenida a lo largo de la pelicula se te hace llevadera pero el problema es el final ya que no es fiel a la pelicula original."
    },
    {
      "rating": "7",
      "text": "A great Christmas movie! I really enjoyed the animation, which showed off details and funny situations. The voice acting fit each character well too. The story though was too short, it could have been longer and added more to the story, which was still awesome, funny, and had great scenery."
    },
    {
      "rating": "4",
      "text": "It was exactly the same as How the Grinch stole christmas with a little bit so little difference. If it's reboot, they gotta do sth new, i donnu like, change the story or sth like that. It was a total copy+paste from the original one. Sorry Benedict but i didn't like it."
    },
    {
      "rating": "10",
      "text": "The Grinch. He's trying to steal Christmas again. Very nice and kind Christmas cartoon. Perhaps this version of the Grinch will seem too kind to many, but this does not spoil the impression at all."
    },
    {
      "rating": "5",
      "text": "Dr. Seuss doesn't really have much attention in Mexico and although in recent years with all the adaptations that have come out of his work he has become more recognized, yet is still far from being relevant.I have never read The Grinch but I understand that this version is more attached to the source material and although I can say that provides an entertaining time in the end it doesn't add anything and has nothing worth mentioning. It's an ok adaptation yet inevitably forgettable."
    },
    {
      "rating": "8",
      "text": "A very cute, funny, and sweet retelling of the original. The animation was spectacular and gorgeous. The voice over performances were great especially Benedict Cumberbatch and Cameron Seely. Though there will never be one that is better than the original this one was a fantastic remake. Merry Christmas."
    },
    {
      "rating": "4",
      "text": "Recreating The Weekday Lifestyle.The GrinchIllumination may be far from Pixar, but with adorable appealing characters that we all can resonate with, they soar above all for their gregarious tone. This infamous Dr. Suess's novel has had many adaptation but none of them actually quite got its cinematic version right. Maybe it doesn't have enough content to run for an hour long period or maybe simply there isn't anything cinematic about it, either way the result has never bred the sincerity the original tale had. Still, reincarnating this old chestnut of social satire, Illumination has at least managed to make this hostile host more friendly and adaptable to the kids.Voicing the iconic and titled character of Dr. Suess's visionary world, is Benedict Cumberbatch, for whom, it seems like this grumpy version wasn't difficult to voice. Since his previous egoistic roles has offered him to be easily offended and annoyed by the social rigmarole, it seems almost as if like Cumberbatch was born for this role. And perhaps this is what Cumberbatch's big win is, he makes it look easy as it should. Other voicing actors does their job perfectly with Pharrell Williams narrating and Cameron Seely winning our hearts with her cute voice over on Cindy-Lou Who.The music being a major part of this film is surprisingly good, not the on screen musical numbers sung by the actors, but the up beating background score. One would have assumed that remaking this fairy tale- almost -would mean that the makers have something new to invest in this storytelling, unfortunately, one mourns at the end of it. Kenan Thompson as the opposite personality to Cumberbatch, steals the show with his uncalled enthusiasm and hilarious one-liners. The Grinch works- sort of- in reverse for us, if the lead character turns from being disappointed to satisfied."
    },
    {
      "rating": "6",
      "text": "The good family movie for the New Year's period about kindness and spirit of the holiday. If I have children, I could take them on this film"
    },
    {
      "rating": "5",
      "text": "A modern take on the Grinch was a bold move. Whos with smartphones and elaborate machines and pop culture references galore certainly make it stand-out compared to the original cartoon feature and the 2000 live-action film. Unfortunately, this is not enough to actually make it appeal in its own right.Watching the Grinch in the cinema, the continuous dragging of the movie to extend playtime was blatant -- with some scenes amounting to nothing of substance whatsoever. Much of the original charm is gone too, with this adaptation trying much too hard to be different. And, at the end of the day, it just doesn't work.Cindy Lou has seemingly lost much of the childish innocence that made her relatable to the audience's current and younger years. The rhymes are \"modernized,\" but in doing so loose much of their original meaning. And the Grinch now feels like that awkward next door neighbor instead of a grouch who lives isolated on a mountaintop."
    },
    {
      "rating": "3",
      "text": "This movie would be good, but the movie feels extremely short. Even though the movie was 86 minutes long, it felt like it was only 30 minutes long. Also, there wasn’t much humor. There was only one thing that made me laugh (the emotional eating scene). At the end when the Grinch became good, it made no sense at all. The movie needs more detail, it just feels too much like the book."
    },
    {
      "rating": "4",
      "text": "Boring. Granted, Jim Carey was disturbing - and uncomfortable at times - as the Grinch in 2000...but stayed pretty true to the book. I liked that. This year's offering goes off on a tangent...and then another. Until we're lost. Then we're sleeping. Essentially - nothing clever about this version. I came out of the cinema baffled as to why anyone had to go back here again when there are so many other Christmas stories that could have graced our screens this year."
    },
    {
      "rating": "4",
      "text": "Disappointing. So many unnecessary changes from the original. Why is Cindy Lou being raised by a single mom? The introduction of the reindeer and its family was unnecessary. Why did they feel the need to give the Grinch a \"best friend\"? The Jim Carrey movie was at least funny. This has a few cute moments, but on the whole, it's really contrived and boring."
    },
    {
      "rating": "5",
      "text": "Llega la navidad la dulce navidad la arrogancia de los mortales es palpable en los regalos pero hay alguien que no disfruta de los dulces villancicos,The Grinch es una película realmente simple repite la misma tesis el usar gags como herramienta para desarrollar la historia y no sabe cuando callarse bromas ingeniosas y muy divertidas si pero que no ayudan a justificar del todo los actos de Grinch pero detengámonos un momento. La película corre a cargo de Yarrow Cheney y se nota,en momentos de mas humor es palpable la mente creativa del autor a la que has visto varias de sus obras (que ahora por cierto están a cargo de super mario bros haber que sale de ahí) el carácter de los personajes siempre es guiado por unos objetivos mas o menos creíbles y desarrollados pero es costumbre que sigan las mismas  pautas ((el humor)) odio repetirme pero es ahí de donde se extrae mas de los propios personajes y quizás es así que muchos son incapaces de tomársela en serio y... si coincido el ver que un elenco de personajes utilicen  gags humorísticos para mostrar el como son sin extensos monólogos donde se estudia su Sigue y si puede ser que estas mismas decisiones estén dirigidas a un publico mas infantil pero no lo justifica todo pero podría tirarme todo el día repitiendo la misma tesis sin llegar a ningún lado así que ¿en que me baso para decir todo esto?.bien empezamos por lo mas simple,Grinch odia la navidad simple y limpio (como kimgdom heaarts ah perdón)  el propósito de nuestro protagonista es el alejarse de esos momentos de la estación lo mas posible hasta que el barbas avisa del gran ´´advenimiento´´ que se aproxima y pasadas unas pocas escenas de ver sufrir a nuestro protagonista,el duende verde empieza su dulce travesía por acabar con la alegría de los ciudadanos del pequeño pueblo y es que todo repite el mismo patrón broma,desarrollo y se ve todo muy compactado como para que de veras pueda creerme todo esto y oye ya que me estoy quejando tanto del humor de este señor no estaría de mas indagar sobre como usa las bromas Yarrow Perrey como elemento narrativo ¿Verdad? si lo se es una mierda pero no me pagan por callarme así que dejadme en paz.Emm ¿habéis escuchado ¿o leído? lo que dije antes? jeje olvidadlo todo por que no hay nadie dando me maletines (no coño de verdad ya me gustaría)bueno basta de florituras y vayamos al grano ¿de arroz? ejem,bien después de haber superado el extenso trayecto hasta la gran pantalla,comprar las entradas y coger las palomitas iniciamos finalmente el film,vemos a Grinch durmiendo tan a gusto en su cama hasta que llega la radio lo despierta y vemos el primer contacto con el protagonista con un arranque de ira destrozando la radio, de esta escena se extrae el comportamiento que tendrá el moco verde durante gran parte del Film ¿Es algo simplificado? si pero es muy cómodo el reír y observar  mas sobre los personajes sin tener que molestarnos en estudiar diálogos insoportables (¡Evangelion me cago en la puta!).pero ¿hasta que punto puedo perdonarlo todo? esa es la pregunta y no tiene mucha dificultad.No no puedo simplemente el ver personajes mal presentados por la magia de la navidad al final todo acaba en la misma pregunta ¿te a gustado? pues si pero no podría decir que es lo mejor para despedir 2018 casi diría que os fueseis a veros Dragon Ball Super Broly (aliento) mirad si os gusta Grinch esta bien algunos diréis que estáis aquí por el humor pero creo que a los genios o los grandes estudios hay que exigirles mas sean quienes sean total no creo que nadie vaya a verme estas navidades creo que sera otro día viendo culebrones en Netflix,estoy tan solo"
    },
    {
      "rating": "2",
      "text": "This movie is just plain boring. There is absolutely nothing original or great about this film. This might be the most mediocre film I've seen in a while.My Metacritic Score: 32"
    },
    {
      "rating": "6",
      "text": "It's an Illumination cash grab, but it's a good one though. Benedict Cumberbatch delivers his own take on the sinister, Christmas hater and there's nothing much different about this film from the others."
    },
    {
      "rating": "5",
      "text": "I'll start with saying I'm a huge Jim Carrey Grinch fan, which for me sets the bar high for any subsequent Grinch movies. But even when not comparing to it, this Grinch movie can best be summed up as, \"Meh.\" It's good for a few cheap laughs your kids will certainly like, but as I saw in my theater it won't be enough to hold their attention the full 90-minute runtime. And honestly, they took the original animated Grinch with a runtime of 30 minutes and made it an hour and a half. But the biggest miss this movie made was the decision to take the mystery and fear the Whos had of the Grinch and take it away...they made him just another \"person\" they see in the streets, and really only seem to be mildly aware of his existence most of the time. All in all, it's a middling Christmas movie that may make you smirk and even get the feels at times, but won't be the movie you think of going forward come Christmas time."
    },
    {
      "rating": "6",
      "text": "There was good animation but the story was not as good as I was expecting. There was too much fun and I didn't find it funny"
    },
    {
      "rating": "1",
      "text": "The Grinch is an avalanche of a studio and it still is not the worse from a company. The only reason I don't think its the worse film I've seen is because it has good visuals and even then illumination had to cut corners even though they knew it was gonna make hundreds of millions of dollars."
    }
  ],
  "recommendations": [
    "the_peanuts_movie",
    "rio_2",
    "ice_age_the_meltdown",
    "ferdinand",
    "hotel_transylvania_2",
    "the_lego_movie_2_the_second_part",
    "scoob",
    "dumbo",
    "meet_the_robinsons",
    "smurfs_the_lost_village",
    "winnie_the_pooh_blood_and_honey",
    "the_lego_movie",
    "despicable_me_2",
    "madagascar_escape_2_africa",
    "hotel_transylvania_3_summer_vacation",
    "the_star",
    "trolls",
    "happy_feet_two",
    "paddington",
    "a_christmas_carol",
    "shaun_the_sheep_movie",
    "101_dalmatians",
    "how_the_grinch_stole_christmas",
    "the_tale_of_despereaux",
    "captain_underpants_the_first_epic_movie"
  ]
}