{"id": 3623, "title": "Thelma", "starring": ["Eili Harboe", "Kaya Wilkins"], "runtime": 116, "genre": ["Drama", "Mystery", "Thriller"], "description": "A college student starts to experience extreme seizures. She soon learns that the violent episodes are a symptom of inexplicable abilities.", "releaseYear": "2017", "mpaaRating": "NR", "imageUrl": "https://image.tmdb.org/t/p/w500/yzSfG8TLAqw7nMQh2lxirQkQpgs.jpg", "categories": {"plot": 7.333333333333333, "acting": 8.5, "ending": 8.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "Excellent watch! This is such an accomplished film from Norwegian film makers Joachim Trier and Eskil Vogt.A film which gives clues of what it is with Thelma. Has she supernatural gifts, is it her troubled background, her family history, her religious upbringing, the self loathing fear or is burden of over controlling parents?It's for you to decide. 10/10"}, {"rating": "7", "text": "A stylish, minimalistic, and effective thriller, Thelma isn't groundbreaking - apart from its LGBTQ representation (which is fantastic to see in this genre)  - but it engages the viewer and tells a coherent story that sticks the landing in the end."}, {"rating": "9", "text": "Wonderful movie.  Great acting from the leads.  Cinematography and mood were beautiful."}, {"rating": "8", "text": "This is interesting one. Because the I saw the movie I saw passion, love, pain, superpowers, sadness and every other emotion. But after the movie I don't know how much of these emotions stayed with me or should I say for how long. But anyways I really did enjoyed this movie from the start till the end."}, {"rating": "9", "text": "More than an updating of Carrie, this one is a psychological thriller about the fear of God´s punishment, the repressed daydreams and the misfitting. As a curiosity works as well."}, {"rating": "9", "text": "The perfect example of when a thriller has a solid script and it's directed by a competent director, a talented one.Thelma it's very well constructed, it's tense, it drives you, it attracts you and although everything is calculated it has its purpose and even though the film is kinda cold, the coldness of its tone is quite satisfactory. An unexpected but well-received surprise."}, {"rating": "8", "text": "Thelma opens strong, builds well and then fails to deliver at it's climax. The story delivers best when it focuses on Thelma's psychological uncertainty. We're left feeling abandoned or underwhelmed at the end when the movie explains things we don't care about and leaves questions unanswered that the audience has been asking the whole time. The movie is worth seeing for the first 2/3."}, {"rating": "9", "text": "One of the movies of 2017.A film where everything seems understated but put it all together and you get this fantastic, moody, stylish thriller ."}, {"rating": "0", "text": "Dès les premières minutes, on sent qu’on va se faire chier… et il est vrai que d’emblée, la première impression est mauvaise : mise en scène à deux de tension, lenteur et inanité des dialogues, rigidité du jeu des comédiennes, la jolie Thelma y comprise.On sent également la patte typique du film d’auteur à côté de ses pompes et de son sujet, noyé dans sa propre prétention de trou de balle qui pète plus haut que son cul : du cinéma d’auteur… typique ! rapidement, on constate l’absence de scénario dans ce merdier qui n’en finit plus de s’étirer sur quasiment deux plombes… alors, ça meuble évidemment… énormément.Certes, on comprend les émois et contradictions (c’est freudien…) de la cocotte qui en pince grave pour sa copine en dépit de son éducation personnelle très prude et puritaine (ses parents sont de vrais dévôts) mais tout de même…Quant à l’aspect « fantastique », il est sous-utilisé et désespérément minable, pour ne pas dire non avenu ; il ne faut pas s’en étonner puisque aucun scénario ne s’est manifesté lors de la « création » (?) de ce film de merde ! En résumé, rien à récupérer ici, tout est à jeter. Et c’est même pas recyclable."}, {"rating": "7", "text": "This is certainly a relatively sinister film in tone, with the scenes involving a snake being particularly ominous. I thought its quite a mysterious film too although not everything is fully explained by the end. There are one or two sub plots which were intriguing but equally, it was a shame that there were so many loose ends. I think the part that most interested me was watching Thelma suffer from the suspected epileptic fits and her trying to figure out what had happened to her family in the past, which may be clues to her current affliction. I did feel there were perhaps one or two cliches present, in terms of the symbology used and the relationship aspect and I can't say its a film I'd want to watch again but if it sounds of interest, its worth a watch I suppose, yes."}], "recommendations": ["before_i_go_to_sleep", "the_killing_of_a_sacred_deer", "the_machinist", "stoker", "the_beguiled", "midnight_special", "the_lodge", "the_guilty", "you_were_never_really_here", "prisoners", "thoroughbreds", "ex_machina", "21_grams", "the_mothman_prophecies", "us", "searching", "the_night_house", "donnie_darko", "the_good_shepherd", "the_invisible_man", "what_lies_beneath", "unbreakable", "incendies", "a_history_of_violence", "melancholia"]}