{"id": 4005, "title": "There Will Be Blood", "starring": ["Daniel Day-Lewis", "Paul Dano"], "runtime": 158, "genre": ["Drama"], "description": "Ruthless silver miner, turned oil prospector, Daniel Plainview, moves to oil-rich California. Using his son to project a trustworthy, family-man image, Plainview cons local landowners into selling him their valuable properties for a pittance. However, local preacher Eli Sunday suspects Plainview's motives and intentions, starting a slow-burning feud that threatens both their lives.", "releaseYear": "2007", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/fa0RDkAlCec0STeMNAhPaF89q6U.jpg", "categories": {"plot": 4.033333333333333, "acting": 3.8378378378378377, "ending": 3.4, "soundtrack": 2.4615384615384617, "cinematography": 2.0, "familyFriendly": 3.0, "funny": 10.0, "action": 10.0}, "reviews": [{"rating": "10", "text": "Daniel Day-Lewis and Paul Thomas Anderson have created one of the greatest movies of this time and perhaps of all time. There is so much ambition, brilliance, detail, and probably everything that you would put in a great movie. I don't think that anything, and anything could top this level of amazement for me. The film has put me through a cathartic and dogmatic experience by just watching. Truly outstanding on every **** level. A masterpiece."}, {"rating": "10", "text": "There Will Be Blood is a captivating film, detailing the extents of a man's ambition and, in turn, his eventual turn to madness. Paul Thomas Anderson has created a sprawling masterpiece, an epic of the most extraordinary genre, and one rich in emotion despite the fact that the lead character (acted superbly by veteran, Daniel Day-Lewis) lacks a shred of compassion. The ending is brutal, confronting and gut-wrenching in scope; it leaves the viewer lost in thought (and possibly weeping) as to how capitalism managed to have such an effect on Daniel Plainview. We are left in detest of the oil-man, but undoubtedly in awe of Paul Thomas Anderson's direction, for masterpieces are rare in any age."}, {"rating": "10", "text": "A modern masterpiece. This is Anderson's best film. Day-Lewis and Dano are both stunning. Greenwood's soundtrack is hypnotizing and phenomenal. The visuals are dazzling if not completely hallucinating. The black humor is outrageously funny and brilliantly placed so that only the most astute viewer and can notice it. One of the best films of the 2000's."}, {"rating": "8", "text": "Oil that is, Black Gold, Texas Tea.Daniel Day Lewis is \"into\" oil & makes his fortune, sometimes at the misfortune of others.Weighs in at just over two & a half hours but I didn't think it dragged too much & the authenticity of the film is superb.As to be expected, Lewis is brilliant but so is Paul Dano as Eli.Not to everyone's taste but I really enjoyed it.I'm finished!"}, {"rating": "10", "text": "One of the first great achievements in narrative and character study in the 21st century. There is no doubt in my mind that this movie will become one of the great classics of our generation."}, {"rating": "9", "text": "The films of Paul Thomas Anderson seem to polarise folks - I'm one who loves his films but plenty of people don't. That said this film is quite a departure from his previous work - no large ensemble cast, no contemporary / modern setting, very little humour, relatively sparse dialogue. This has the same feeling of unease as 'Punch Drunk Love' largely due to Johnny Greenwood's (of Radiohead fame) brilliant / unconventional score (incidental music might be more accurate). Daniel Day-Lewis plays the protagonist Daniel Plainview very adeptly - a great psychological study into the unique individuals that prosper in times of explosive industrial growth.\r A great and unique movie that will surely be recognized as a classic in years to come"}, {"rating": "10", "text": "UNPARALLELED!!! DANIEL DAY-LEWIS KILLS IT!!! THIS DESERVES TO BE CALLED A CLASSIC IN EVERY WAY... AMAZING ACTING, DIRECTING, MUSIC (JOHNNY GREENWOOD), ENDING... EVERYTHING."}, {"rating": "10", "text": "There Will Be Blood has to be the best movie of the decade, and an all-time favorite, and the man who helps the movie be as brilliant is Daniel Day-Lewis. He's that kind of actor that makes any film worth seeing. He played a staggering role in Scorsese's \"Gangs of New York\", and then makes an even better attempt in this. Paul Dano plays the supporting character as a young preacher, and boy was he perfect for that role. He should of won \"best supporting actor\", but at least Day-Lewis won. There Will Be Blood is a story about an oil man named Daniel Plainview and his adopted son, H.W, who make their way across California, trying to dig out every last bit of oil they can find. Having met by a young man, saying that there was loads of oil on their land. Having to travel miles to their small home, they lied and said that they were hunting for quail. After a while of the hunting, H.W found the oil. Then, when having dinner with the family, Plainview brings up the oil found on their land and asks if he could buy the land for three thousand dollars, and the family immediately says yes. But one of the family's sons, named Eliot, who's a young preacher for the towns church, disagrees and asks for ten thousand. This starts a rival between the oil man and the preacher, which will create loads of problems for both, that will also cause murder.This film may be my favorite movie of all time. This also had some parts that gives the movie resemblance to Kubrik's classic, \"2001: A Space Odyssey\", but like a western version, with the long stretch of the violin, and everything else quiet. I don't really find this slow at all, the whole time it was exciting and really interesting to watch. I bought the DVD without ever watching it before (though I knew it was going to be good), and now I can easily say that I made a great decision. Please watch this movie! I guarantee that if you have a passion for film or a huge fan of Day-Lewis, you'll love it!"}, {"rating": "9", "text": "after watching this movie, i became a fan of daniel day lewis... very dark and riveting movie. This should have been d oscar winning movie for me in that year.."}, {"rating": "9", "text": "Just fantastic. This was my first film that I've seen directed by Paul Thomas Anderson and it did not disappoint in the least. The film is slow, but the acting from Daniel Day-Lewis, Paul Dano and cast, is just so engrossing that you cannot look away. The sets were brilliant and looked extremely realistic and fit in perfectly with the times they were depicting. Those who claim there is no story are missing the bigger picture. Sure, there is no direct story, but what we are seeing is so much bigger than that. The interaction of every character and the constant \"peeling back of the onion\" that is Daniel Plainview and how evil he truly is make up for any story people may be searching for. In fact, I dare say that is the story; the revealing of how far a man will go to make money and how cutthroat you had to be to make it in the the time period depicted. Fantastic film."}, {"rating": "10", "text": "This is a big, bold film from huge talent Paul Thomas Anderson, but it"}, {"rating": "10", "text": "A masterpiece plain and simple.  Paul Thomas Anderson directs this film beautifully with shot after shot leaving me overwhelmed.  The score helps guide the scenes with perfection.  Finally Daniel Day Lewis gives one the finest performances in cinematic history."}, {"rating": "10", "text": "The best part about There Will Be Blood is the fact that Day-Lewis can give his character depth in the first ten minutes without saying a word. This shows what an actor he is. The rest of the movie falls in place from there, and is one hell of an experience."}, {"rating": "10", "text": "Now to my mind, it's an abomination to consider that any man, woman or child in this magnificent country of ours should have to look upon (this particular) loaf of bread as (anything but) a luxury\r I have drank this milkshake and I approve."}, {"rating": "2", "text": "Totally unlikeable character, never learned anything . Very male film. I didn't like it"}, {"rating": "0", "text": "What a waste of 3 hours of my time. Acting was all over-the-top, but that seemed what was called for. Movie was pointless and disgusting. Didn't like PTA's other movies and don't like this one. Don't believe the critics. I don't get it."}, {"rating": "0", "text": "BORING,BORING BORING!!! the story could have been told in 5 minutes instead of 3 hours. people were walking out when we went and I really wish I had."}, {"rating": "1", "text": "besides some nice pictures, it was really really boring."}, {"rating": "0", "text": "MOST WORTHLESS MOVIE I EVER WATCHED, NO PLOT , NO MORAL NO NOTHING I KEPT WATCHING THINKING IT WOULD BE CHANGNG , JUST WHEN YOU THINK THERES A PLOT IT JUST CONTINUES ON TO BEING MORE BORING THEN THE FIRST HOUR, WASTE OF TIME AND MONEY WATCHING THIS MOVIE, THERE WILL BE BLOOD ONLY HAS ONLY ONE PLOT, STEAL YOUR MONEY AS A MOVIE PATRON"}, {"rating": "2", "text": "I had heard good things about this movie, and I had been so psyched to go and see it...which may be part of why it ended up being such a disappointment. The music in the opening scene put me on the edge of my seat, and I spent the rest of the movie holding my breath for a dramatic and shocking event that would never happen. The movie dragged on and on, and I couldn't shake off the feeling that nothing substantial or relevant was happening. At first I did think the conflict between Daniel and Eli held a lot of promise, and I guess I kind of expected the movie to focus on this tension and build it up a little more--but here again the movie fell short, and the ending death scene blended in with the rest of the movie about as well as oil blends with water. It felt awkward and out of place. To make things worse, in my eyes at least, there was never anything likeable about DDL's character. I saw him take the orphaned baby from the scene of the mining accident, and when the movie immediately flashes to 9 years later and Daniel happens to be accompanied by a boy who looks about 9 or 10 years old, I put two and two together and suspected it was the same kid. Some have suggested that the son was the only character that Daniel cared about at all, but I question whether he even cared about the boy. Daniel refers to his son as a \"sweet face\" that helps him get his way in business deals. Then, when someone asks Daniel where his wife is, he gives a shifty look and replies that she \"died in childbirth\", and presto! The charismatic businessman is transformed into a lying scumbag. I'm guessing that explains why I wasn't at all surprised when Daniel sat H.W. down at his desk years later and finally told him that (gasp!) he's not actually his father. I get the feeling that this was supposed to be a very dramatic, climactic scene, but it left me cold because I'd been practically waiting for it the entire movie. I think the movie was supposed to center around the \"transformation\" of DDL's character, but I didn't really see much of a transformation, except in the end when he suddenly becomes psychotic, or maybe just reveals that part of his personality. It's hard to tell, because Daniel is very unapproachable as a character; tough to understand or relate to at all, and even tougher to like. The acting itself was still decent, but the character development was iffy at best. All in all, not recommended."}, {"rating": "2", "text": "Half-baked. I was fairly engrossed through the first 2/3 of the film, then I started to realize the entire film was heading nowhere and saying nothing. A string of disjointed episodes connecting several almost over-the-top scenes of DDR's mad rages without any real groundwork laid to explain or justify them. I have no idea what the critics who rated this so highly were thinking."}, {"rating": "0", "text": "Dull, confusing. I like intelligent/slow movies - Brokeback, Remains of the Day, Apocalypse Now etc, but this had nothing. Love Radiohead but the score was awful too, it seemed Greenwood thought \"how irrelevant can I make the score\". Hammy acting. Magnolia was crap too. And the first PTA film. Loved Boogie Nights."}, {"rating": "0", "text": "The entire audience was left dissatisfied. This movie did not live up to the hype! DDL played a fascinating lunatic, but...... so what?"}, {"rating": "2", "text": "Shit movie, only because it bashes Christians, of which Daniel Day Lewis isn't. I'm not saying that the Church portrayed in this movie was a legit church, not my church. Daniel Day Lewis was basically Mocking Christians in general in this movie. If the movie hadn't shown blatant blasphemy, then I would have given it 9 stars. As it is though, There Will Be Blood gets a big fat 2!"}, {"rating": "2", "text": "Guess what \"Professional Critics\"...open your eyes..the emperor has no clothes. I spoke with 6 other people after the movie and all agreed the movie sucked..too long..one dimensional..absurd storyline...with a pathetically uncreative ending. There Will Be Bullsh--."}, {"rating": "2", "text": "Another Daniel Day-Lewis vanity piece. Yes he's amazing. But when the curtain comes down -- who cares? What reason is there to care about his character or any of the others? Very little character development, he starts out a shithead and ends up a shithead. Positives: cinematography, highly effective use of sound and music. Just plain shoddy: Paul and his twin brother. Right."}, {"rating": "1", "text": "The only reason to give this movie a 1 is DDL. The movie is a pretentious, plodding, glacial study of good and evil...actually, of evil and evil. You are bludgeoned with blatant symbolism, annoyed with jarring music (I assume this was intentional?), bored with overly long sequences where nothing substantive happens - filmmaking 101 anybody? - and generally beaten down with the message, which as far as I can tell is: \"Bad people are bad. So there.\" Wait for this one to come out on DVD -- oooh, an extended director's cut. Oh, goody -- and then convince your friend to rent it. Then stay home."}, {"rating": "1", "text": "This film was too long and the soundtrack was god-awful.The constant pounding in the soundtrack and the annoying music only subtracted from the viewing experience. They could just as well cut out the first 30 minutes and the story, what little there was, would not have been hurt. This story could have been told in 30 minutes, and with no sound track at all.Problem is , that won't make it a movie will it? Those who fawn over this film sure are forgiving of it's many faults. Bill C."}, {"rating": "0", "text": "I agree with many others that this was one of the worst movies I have seen. If I had been alone I should have walked out in the first 10 minutes, or less. The noise was deafening and SO unsubtle; it seemed as if loud and frightening sounds and music were needed to convince the audience that something was going on. If a movie relies upon this, then it shows me that they did not have full confidence in their production. If you like loud amplification, excellent scenery, blood, sweat, tears, child abuse, psychotic behaviour and enjoy looking at your watch every ten minutes to see whether the film might soon be ending, then go to see this movie and enjoy!"}, {"rating": "1", "text": "Possibly the worst movie I've seen in the last decade. The music was annoying. The characters were boring and one dimensional. If it wasn't up for best picture I would have walked out after 10 minutes. By the end, I was really sorry I didn't. You can't wrap a 2 hour movie around the \"I drink your milkshake\" line!"}, {"rating": "0", "text": "This has to be one of the worst movies of 2007, along with No Country for Old Men. Plot, what plot? The movie was a waste of film. What was so great about it? It was another worthless film that movie \"critics\" love because it is pointless and it gives them something to try to make sense of. If you want entertainment, go outside and watch the grass grow. You will have more fun!"}, {"rating": "1", "text": "This movie was so boring!!!!!! I like good acting as much as the next guy but at the very least I want to be entertained!!!! ddl was good in his role but it was just way too long and after a while you just don't care cause you just want to be put out of your misery."}, {"rating": "2", "text": "wow, this movie was so boring. great acting but this movie was painfully dull"}, {"rating": "0", "text": "If the movie wasn't so tedious and long, I'd waste more time explaining why you should not avoid the hype."}, {"rating": "1", "text": "The most insanely boring and pointless movie i have ever seen in my life."}, {"rating": "1", "text": "This P.O.S. sucks worst than gravity! Over done musical score, over the top and totally hammy acting, DDL during the church scene, please. No plot direction, weak storyline. This movie was just plain bad. What a waste of two and a half hours!"}, {"rating": "0", "text": "I cant believe i am in the minority when it comes to this movie! The worst movie i have seen in the last five years, hand down. I think people have confused total crap with art here. I have never seen a worse movie rated so high for absolutely no reason. I could never be friends with anyone that thought this move was in the least bit entertaining."}, {"rating": "2", "text": "I tried to keep an open mind.... This movie could have been trimmed down to half it's length. So many bland scenes that left me confused. And the ending..... What??? Maybe I am the type that likes to watch movies that don't make me think. But hey, this is entertainment, not college!"}, {"rating": "1", "text": "This is truely one of the worst movies that I have ever seen. I suffered through every minute expecting something, anything to happen and got nothing. It is predictable from beginning to end. I didn't appreciate the script, the characters, their motives, the cinematography or anything. The film critics, who are so sophisticated may find something to actually appreciate about the film, but then they also find give numberous awards to all those stupid movies that nobody has ever heard of. I encourage everyone to not waste their time on this film. It was truely a let down!!!!!!!! Oh yea-the music suks too!!!!"}, {"rating": "3", "text": "Film should be considered an art and undertaken with high aspiration, but this is like way too many art house type movies that average folk will go see because they are fantastically reviewed and then walk out of saying, and rightly so, that there is something very wrong with this industry. A pretentious film school exercise doth not a legitamit movie make. It might have been a character study... but no, it's not really; even though Daniel Day Lewis gives a bravura performance, he did this \"king thug\" guy in \"Gangs Of New York\" already and it's invulnerable and not by itself affecting. It might have been a clash of ideals story... no, it's not that either (the preacher character disappears for maybe an hour at one point). I guess with a lot of good cinematography on location mixing big theatrical performances with realist ones (using many non-actors), even without a story, film nuts will think its deep."}, {"rating": "0", "text": "I've never even heard of it...and inevitablely it cant be good."}, {"rating": "2", "text": "Honestly, Thirty Days of Night was better than this film. It was about half an hour too long, boring, pretentious, and like one poster said, halfway up it's own backside. Don't know what the critics were on when they saw this one. Spend your hard earned cash elsewhere."}, {"rating": "2", "text": "This was a terrible film = poor storytelling, slow, and pretentious. why did all these critics say it was so outstanding. We were passive. The director wanted the images to move, but he didn't find the key to make them work,"}, {"rating": "1", "text": "If you think this acting performance is great performance, go to a theater and watch students work. Than you know how overacting will look like, and you will find interesting parallels to what will get here an Oscar. Besides this i understood the message and emotions the music wants to create, but its still uncomfortable too loud and annoying. Story make sense only 2/3 of the movie. At the end i guess the writers went on striking."}, {"rating": "2", "text": "This movie was a waste of my life. Yes it's intended message of Greed and money twisting everyone is a good one, but that point has been made many a time. We don't need another two and a half hour movie where the weak dialoges play second fiddle to the soundtrack to beat that dead horse. \"I'm finished\" Roll Credits."}, {"rating": "0", "text": "I just don't understand how anyone could enjoy this movie. Sure, the acting was top quality, but there is only so much a talented actor can bring when the plot is bad. In fact, the plot isn't bad, it is simply non-existent. The fact that great actors are forced to act out this long, boring mindless drivel is an incredible shame. For this reason, I consider this one of the worst movies I have seen since The Thin Red Line (another critically acclaimed pile of rubbish)."}, {"rating": "2", "text": "The fact that this movie is getting so much Oscar hype and critical acclaim completely bewilders me. The film is so littered with tremendous gaffes in plot development that it becomes a melodramatic train to nowhere. Sure the acting is intense, but rings completely false, as characters do complete about faces from scene to scene. Yes, it is a \"pretty\" film and educational about the early days of the oil business in the U.S., but outside of that worthless. I would have rather watched a documentary on PBS. Ultimately, I didn't care about the fate of any of the characters by the movies' end. A true sign that the film was a colossal failure."}, {"rating": "2", "text": "I have heard a lot of people cite the acting in this movie as a reason for a hands-down 10. I, however, look at a film as a whole. I judge art according to its contribution to society as a whole... Art, after all, is derived from life and not the other way around; I don't see a chicken-or-the-egg conundrum. So I can't accept a film that seems like cinematic and theatrical masturbation. Yes, the actors in it did excellent jobs. Yes, the elements of cinematography, lighting, and music were original and innovative. But did it affect me? Did it even affect anyone in the entire theatre? The work *as a whole* was ineffectual, anticlimactic, uncompelling, and unrelatable. I'm not even interested in the characterization of Daniel Plainview. The glimpses of the shards of his humanity were too few and too distant for me to care about him; and a person that monstrous provokes me only to marvel briefly and incomprehendingly at his monstrosity. I want to be as far away from Daniel as possible, and I want to forget the movie. I'm not against \"weird\" movies or movies that require a long attention span, but I perceived a vagueness in the characters and story that seems to come from a lack of specificity in purpose... and if there was a specific subtext in the minds of the actors and and a specific intent in the mind of the director--sorry, it was not conveyed. This objectivity wouldn't be so bad except that at times the movie leads the viewer to believe they should be understanding some kind of message. There Will Be Blood: you fail at communicating."}, {"rating": "1", "text": "there are some mildly compelling portions of this movie. That's the only thing positive that i can say. This movie is so overrated it hurts. It was boring beyond belief. there isn't a story. The characters are annoying and not that interesting. The acting have been blown way out of proportion. It isn't that great. I hate this movie and I could not be happier that it didn't win the Oscar for Best Picture. This movie is not good. Don't spend your time watching it. It will be forgotten in 5 years. This is a prime example of the overly inflated Hollywood hype machine causing people to show interest in a movie for some reason not based on merit. Watch something else."}, {"rating": "0", "text": "This was the most boring movie I have ever seen. Three hours of hell. Would have rather watched paint dry."}], "recommendations": ["the_power_of_the_dog", "seven_pounds", "the_curious_case_of_benjamin_button", "meet_joe_black", "slumdog_millionaire", "boyhood", "the_gambler", "the_counselor", "all_eyez_on_me", "hereafter", "the_butterfly_effect", "inherent_vice", "the_irishman", "hugo", "tenet", "greenberg", "revolutionary_road", "black_panther_wakanda_forever", "the_american", "sanctum", "alexander", "pay_it_forward", "the_twilight_saga_breaking_dawn_part_1", "the_hateful_eight", "magnolia"]}