{"id": 4059, "title": "They Live", "starring": ["Roddy Piper", "Keith David"], "runtime": 94, "genre": ["Science Fiction", "Action"], "description": "Nada, a wanderer without meaning in his life, discovers a pair of sunglasses capable of showing the world the way it truly is. As he walks the streets of Los Angeles, Nada notices that both the media and the government are comprised of subliminal messages meant to keep the population subdued, and that most of the social elite are skull-faced aliens bent on world domination. With this shocking discovery, Nada fights to free humanity from the mind-controlling aliens.", "releaseYear": "1988", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/ngnybFTuopfbfmmEeX9jjBQQmF6.jpg", "categories": {"plot": 7.4, "acting": 6.5, "ending": 7.0, "soundtrack": 5.5, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.0, "action": 7.538461538461538}, "reviews": [{"rating": "8", "text": "Just saw this movie for the first time and damn was it good. I love the soundtrack and the build-up of it all, the main character's actor is also pretty good and now I see where Duke Nukem got some of his quotes, haha. Overall a good movie. Oh and don't believe the critics who gave negative reviews, they obey the authority."}, {"rating": "10", "text": "I love this movie. john carpenter has a way of making his actors iconic. he did it with kurt russel and he does it here with rod piper. The premise of the movie is pure genius and makes you think and mistrust the begin to question the world around you. The violence is over the top fun and the one liners are the best ever."}, {"rating": "8", "text": "John Carpenter's modern masterpiece is an action/horror/comedy film wrapped up inside a narrative of Capitalism, greed, destruction, friendship and the struggle of the have-nots in a world of rampant consumerism and overt aspirational advertising.\rOh,and there are aliens..... Never a bad thing in a big(gish) budget B-Movie, in fact in a lot of ways it's more of a B-Movie parody!\rIt's not a perfect film by any means. Carpenter's direction can get very distracting, the soundtrack is a 'love it or hate it' mash up of electronica and thumping basslines, the acting varies wildly in quality, and the pacing lurches from slow, to fast, then back to slow.\r However, for all its flaws, it IS a fantastic movie. Criminally slated back in 1988, it's now a definitive 80's cult classic, watched as a rite of passage by teenagers everywhere!\r If you're someone who missed it as a teenager, then find a copy and settle in for some serious fun and action."}, {"rating": "8", "text": "Characterized as an allegory for Jewish control of the media by neo-nazis, it is borderline comical to see how such great art has been misinterpreted. Guess that is what happens to those of us who are a few cards away from a full deck. As it stands, the film is truly just an inventive alien invasion flick that doubles as a social critique for how people sit back and do not question what they are told. This, again, is a problem that continues to today where people simply read or hear something and take it as the gospel truth because the person is on the news or sounds like they know what they are saying. They Live is a cautionary tale in this regard as people have been lulled into believing they are safe when, in reality, we are blind to the negative forces all around us that corrupt our minds. In John Carpenter's incredibly inventive and imaginative They Live, those negative forces are aliens.Unaware of what is going on until he puts on some special sunglasses, John Nada (Roddy Piper) quickly sets out to help the resistance expose the control the aliens have achieved. Through cool gadgets such as those sunglasses of the aliens' watches, the film creates some great little science fiction touches that really only add to the experience. In particular, the former creates incredible anxiety. As John gets surrounded by aliens that know he can see, the film takes on an incredibly thrilling and terrifying tone. However, the same can be said for when he has the glasses off. Whenever he is in a tough situation and Carpenter does not immediately have him put on the glasses, the film is packed with tension and paranoia. The film manages to convince you that everybody and anybody could be an alien, especially when he lacks the glasses. When he loses them, the tension and anxiety to put them back on is felt by the audience as our heart races along with John's.Action-wise, the film is incredibly strong. Each action set piece is incredibly strong and Carpenter knows his way around a gun battle. This is very much the case in They Live in which his battles are very similar to ones found in the very beginning of his career, except with more polish and better effects. On that note, the visual effects are very good. The film does a great job crafting the look the aliens and it feels like it is very similar in style in that area to Tim Burton's Mars Attacks!. However, it feels realistic and looks funny at the very least. Carpenter plays on this at the end when the aliens are revealed in bars, having sex, or on television. While comical in look and feel, the aliens do look pretty interesting and feel authentic and an interesting take on what aliens would like and do on earth.They Live could also be categorized as Carpenter being very tongue-in-cheek with his fighting against criticisms towards his use of sex and violence. The ending highlights this with an alien on television saying that he and George Romero need to tone down both. Here, Carpenter essentially compares his critics to being mindless robotic aliens, incapable of formulating their own opinions. Instead, they opt to parrot what they have heard others say. This is unfortunately still prevalent today, especially in film criticism when a popular film or artist's reputation is quickly torn apart after one critic or person makes a short-sighted argument, which then gains steam and popularity. Carpenter had obviously been critiqued for both sex and violence, so he answers with a film built on testosterone and campy violence and action. Honestly, it is admirable to see him fight back in this fashion.They Live is a truly entertaining and campy science fiction horror comedy about a man who wakes up to alien invasion taking place on Earth. While silly, its science fiction pieces are imaginative and truly engaging. It creates a world that is worthy of further looks and is truly fun to imagine the possibilities within this world, especially with the cool knick knacks introduced by Carpenter throughout the film. Action-packed, inventive, and simply a good time, They Live is another top-notch film from John Carpenter."}, {"rating": "7", "text": "Another 'rassler takes a try at acting on the big screen.  The thing is, 'Rowdy' Roddy Piper actually plays the role, rather than injecting his wrestling persona into the character (unlike other wrestlers-turned-movie-actors).  I find this movie very watchable.  For one, it's science fiction (and I'm a sucker for that genre).  The main objection I have about it is it's relentless 'persecution' of commercialization (not that it shouldn't be persecuted, just that the film keeps pile-driving the point home).  The special effects really aren't too bad - but that's mostly limited to the makeup, which is rather cute (especially the results showing the 'special' glasses being put on and taken off).  Another bone to pick is that it almost wants to lean heavily into the comedy genre, especially the closing sequences.  But overall I enjoyed it."}, {"rating": "8", "text": "They Live is a good & interesting movie for people who are into conspiracy theories but also for sci fi fans. Rowdy Piper does his role well for have being a wrestler and Keith David is always good on screen. The action scenes are not amazing but they're still good. Overall you'll have a good time if you're into this kind of movies or if you are open minded."}, {"rating": "8", "text": "They Live has definitely withstood the test of time. The meaning behind it all is still very much relevant in this day and age. Piper and David are a great duo together, with Piper's performance really driving this film and helping make it so memorable."}, {"rating": "6", "text": "From last few days, I have been watching John Carpenter's movie. I read alot of good things about this movie and watched it. I liked the idea of the movie and it was different for that time. For your info, this movie is now considered cult classic like Carpenter's other movies.For me, the movie was nicely made and was dark and tense like Carpenter's other movies. There are some good tense scenes such as the climax scene. The suspense is also nicely built up and there are some surprises also.If we talk about performances, everyone did their job nicely. Direction by John Carpenter was just like his other movies such as Halloween and The Thing. There were a few issues with the pacing but it will not effect the overall experience.Overall, the movie is good and different for it's time. I want this movie to be remade just like Halloween so that we can enjoy the modern touch."}, {"rating": "10", "text": "The movie was well ahead of its time if one considers contemporary affairs (2011). The premise is both satirically hilarious and compelling on its own terms. The execution is admirable. This is a must see cult-classic."}, {"rating": "10", "text": "1984 for movies. That's how I interpret this film. The plot and images it shows are out of our present and future. Last but not least, the music, which is imprinted in your mind. A perfect 10 for years to come."}, {"rating": "8", "text": "Unexpectedly I loved it. Amazing fight between Piper and David! Nice bluesy-country feel to Carpenter's soundtrack. It really showed Carpenter's strengths, both in terms of ideas and visual storytelling. Piper's ad-libbed dialogue was hit and miss, probably the film's only weakness, but still had some wonderful gold to mine. Sad to say, due to the state of the world, this is a film that not only doesn't age, but is years ahead of its time."}, {"rating": "10", "text": "Фильм, который открыл глаза многим на то, что нами управляют масоны, которые не жалеют, чтобы мы что-то осознавала, они нас контролируют, издеваются над нами, как могут, но мы сея верим, что рабство нет, но он есть и посмотрев этот фильм, вы проснитесь от долгого сна и осознаете что-то то, чего вы раньше никогда не знали."}, {"rating": "3", "text": "This movie takes forever to get going and once it does, it really doesn't go anywhere. It proves to me that Roddy Piper should have invested some of the wrestling money he earned into acting lessons and it also shows that John Carpenter is a hit and miss director, and this is one of his misses. Meg Foster has some of the weirdest eyes I've ever seen."}, {"rating": "6", "text": "It's only sparingly interesting and sluggishly paced, but overall \"They Live\" still proves to be a slightly entertaining sociopolitical sci-fi flick."}, {"rating": "6", "text": "A classic Carpenter movie. 'They Live' is an iconic romp through b-movie science fiction and 80s buddy-action, laced with seething satire.\r Roddy Piper plays Nada, the nameless drifter whose entire world is turned upside down when he puts on a pair of sunglasses. The film makes a powerful reflection on modern society, consumer culture and inhumanity of the cultural elite and their disregard of the social divides, Carpenter does well to present the frustration felt towards this intolerance, and puts a satisfying spark of dark sadistic comedy into the mix.\r The reason why I only gave a 6 was because the film does fall a bit short structurally, the beginning and end were nowhere near as enjoyable as the middle act. But the middle act is enough alone to watch the film for. Look out for the famous fight scene between Roddy Piper and Keith David, which is easily the best part of the film."}, {"rating": "8", "text": "+ Great sci-fi concept+ Excellent cast deliver memorable performances+ THAT fight scene.... :P- Pacing is slow and awkward at timesA grand centerpiece of my old VHS b movie years this is a J Carpenter gem! Timeless sci-fi tale of paranoia and brutal oppression in a multidimensional and violent world."}, {"rating": "0", "text": "Pure CRAP, don't waste your time watching it, trust me! This rating is so unbelievably overrated! This is just a B crappy movie, it won't get any worse. Unwatchable!"}, {"rating": "8", "text": "One of the better sci-fi films in the \"all-is-not-what-it-seems\" genre.  Very much an early version of \"The Matrix\" concept, where instead of the red pill the rebels have tactical sunglasses that let people see through the projected illusions surrounding them.Because of its gritty, man-on-the-street, realistic, present-day ambience, the sudden reveal and the ensuing drama packed quite a punch (at least, in the 80s when this film was released, when there was no precedent for it).  It's eerie and effective because of the rarity of special effects, not in spite of them.  The lower-budget approach makes this more convincing than the bluish CGI crap we get today in sci-fi films.  Definitely see this film!"}, {"rating": "6", "text": "It looks fine. The sunglasses world is particularly startling. Good music but slightly disappointing sound overall. The underpinning story of underclass values destroying middle and lower class life was fascinating although I think that the target audience possibly missed that. Biggest issues for me were the main guy being a terrible actor and the alleyway fight scene looking like god-awful wrestle mania. Not very scary but certainly very interesting and relevant."}, {"rating": "10", "text": "This movie rocks. there is absolutely no reason not to watch it! it is funny, intense, and generally all around bad-ass."}, {"rating": "5", "text": "The core of the movie is not that bad, maybe even the best thing in it. But many scenes are too long and are looking cheap, especially the action scenes. So in the end it looks like a B-Movie"}, {"rating": "10", "text": "This film was hugely ahead of its time. It didn't lost a bit of being actual even in 2020."}, {"rating": "1", "text": "At least there is a story, albeit woefully executed. Bad preceeds any aspect of the movie you care to address. The fact that the movie addresses some social issues that have existed since the dawn of time does nothing to or is of relevance to the quality of the movie."}, {"rating": "6", "text": "They Live is one of many dystopian films of the 80s. But only John Carpenter took it off. And as a viewer, you expect an Escape from New York film. But They Live is a completely dull film, the script in it has many holes, the logic of the existence of the world is delusional, and the rules by which he lives wrote the child. Well, of course, the game Roddy Piper disappoints, he is clearly not an actor. The ending of the film seems to emphasize the idiotic logic of the world of the film. You can watch, especially John Carpenter fans."}, {"rating": "9", "text": "I loved it! I really liked Carpenter's b-movie. It was crazy, badass, fun and supercool! I didn't like the ending though, but the movie was so philosophical and an all-time masterpiece."}, {"rating": "8", "text": "From his movies I've watched so far, I can say that Carpenter's movies share a cool style of direction, cool ideas, and cool characters. But They Live has something more.... a cool way of unraveling and unfolding the plot!Carpenter here unfurls his movie's story as if he says to his audience: \"I don't care whether you're enjoying the movie or not. You came here for the movie's bizarre and outlandish concept, and here it is!\".Not too much dialogue; the thing that may make the viewer feel a bit bored, especially before the action rises. But so what as long as this brilliantly reflects the movie's themes of working-class subjection and media control!A very slow way of resolving the conflict of the plot; the thing that may infuriate the viewer, and make him worried lest the denouement would be so rushed. But so what as long as the results, as the movie proceeds and the end result, are more than fulfilling and rewarding!In all honesty, Carpenter went a bit too far to say the least. As the transitions between an act to another are quite abrupt and scrappy that can make you feel as if something is missing; something that is necessary to make you more convinced. The transition between the first and the second act can redeemed; because there is an information that is represented later at the second act in a most subtle way. But this is not the case about the transition between the second and the third act. As there are some things that should have been quite difficult to work out, but they ended up being solved pretty quick by some coincidences and plot holes. Let alone the major plot hole concerns the whole story that you may realize at the end, if not while watching the movie.It goes without saying that in They Live, Carpenter offers a timeless biting and daring political satire neatly encapsulated in a loony thought-provoking sci-fi flick while maintaining, at its core, its B-movie quality the genius director famous for.(8/10)"}, {"rating": "5", "text": "This was a pretty hilarious 80s Sci-fi B-movie .The acting was incredibly bad (but in a funny way) and for some reason they looped only 1 song in the entire movie (lmao). For it's time the idea is fine (capitalism bad , illuminati bad, etc) but nowadays you won't get anything that well made in regards to these subjects."}, {"rating": "8", "text": "They Live is an interesting story.  I think it was well written and well acted.I'm likely biased since I've always enjoyed the silliness of wrestler turned actor Roddy Piper."}, {"rating": "10", "text": "Incredible movie that everyone should watch right now. It's extremely relevant today because of the world economic forum and corrupt politicians and the great reset."}, {"rating": "10", "text": "A seminal film!  Some average acting, but an excellent storyline for its time. One of the most quotable films ever! The laboured fight scene is also a laugh!"}, {"rating": "7", "text": "Nada is an unemployed worker from Los Angeles who comes into possession of a strange pair of black glasses, thanks to which he discovers that many human beings are actually extraterrestrials who try to condition humanity with subliminal messages. Shocked by the revelation, the young man embarks on a relentless fight for freedom.Probabily not my Carpenter favourite film but  certainly a very good film that I recommend seeing to get an idea of ​​the style of one of the greatest and most influential American directors ever."}, {"rating": "9", "text": "Timeless classic 80s movie. Some memorable scenes. Fine Soundtrack. Recommandable."}, {"rating": "0", "text": "After I finished this movie, it almost felt like taking those very sunglasses and no, not putting them on, because for the life of me I can‘t see any big conspiracy behind Coca Cola advertisements, more like taking them off. It gave me a headache. It‘s absolute dog water and I still have no real idea what the hell it was meant to say. Consumerism, blah blah, rich people bad, blah blah, everything‘s a conspiracy, blah blah, Fanta is trying to turn you into a zombie, blah blah. The acting was ok, the plot was terrible, music actually quite good, but I have no clue how people can find any meaningful or deep social commentary in this movie. It tried to dig a hole with a fork. The movie did however entice me to look up some science on subliminal messaging and I found nothing concrete. But what I found is a whole group of absolute lunatics that believe in lizard people and say „this movie is actually a documentary and everyone not able to see that is sleeping“. I therefore come to the conclusion that this movie is actually kind of dangerous in the sense that it reinforces conspiracy theorists in their world view. This movie all around left a very foul taste in my mouth and ruined my week-end. Hope you don‘t make the same mistake of watching it…"}], "recommendations": ["equilibrium", "morbius", "chappie", "arrival", "signs", "sunshine", "inception", "the_matrix", "mortal_engines", "sucker_punch", "us", "color_out_of_space", "jupiter_ascending", "the_13th_warrior", "captive_state", "lucy", "reign_of_fire", "v_for_vendetta", "antebellum", "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_", "the_girl_with_all_the_gifts", "moon", "king_arthur_legend_of_the_sword", "tomorrowland", "the_matrix_reloaded"]}