{
  "id": 4020,
  "title": "Think Like a Man Too",
  "starring": [
    "Kevin Hart",
    "Michael Ealy"
  ],
  "runtime": 105,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "All the couples are back for a wedding in Las Vegas, but plans for a romantic weekend go awry when their various misadventures get them into some compromising situations that threaten to derail the big event.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bsKfhf0y9Zx7h4j5GHu1JANpKwl.jpg",
  "categories": {
    "plot": 3.272727272727273,
    "acting": 1.9090909090909092,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.8,
    "funny": 3.25,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "My appreciation for this film comes from knowing what I was looking at, and from not looking for more than what's there. It's a comedy. I don't say \"comedy\" as a description of the genre to which this film belongs (which is the sad case for a lot of garbage being passed of as comedy). Hart's delivery, and the performance of the [mostly] well-put together cast, produces spontaneous, and sometimes explosive, laughter throughout the film. The film was also enjoyable because I saw myself in its humor, its sensibility, and its perspective. It didn't try too hard to create \"types\" of black people. These characters could easily be me and my friends doing everything on our cliche list of things we HAVE to do while we're in Vegas [minus the celebrity factor and the public brawl, of course]. What's more, the film was not designed to be a definitive statement on romantic relationships. The [not really] dramatic elements provided continuity, as a sequel, and gave the film just enough substance to distinguish itself in a genre dominated by pointless fluff. It's an excellent date movie that left me with an unexpected feeling of lightheartedness. My take-away's: Create your own adventures. Make life fun and interesting. Pay attention to the needs of others.Be ready to take a stand and commit yourself to something when the time is right. But, you'll enjoy life more, and laugh much louder and longer when you don't try so hard to make things work."
    },
    {
      "rating": "6",
      "text": "No, it's not high art, but it's FUN!  Some of these critics in the \"red\" zone have no sense of humor.  Kevin Hart is hilarious, as usual, and the cast is pretty amazing. (Pretty cool to see Detective Carter from \"Person of Interest\" let her hair down....)  It's definitely better than the 2nd and 3rd Hangover movies, though not as good as as the original or Bridesmaids.  I laughed VERY hard many times during this sucker.  Great to see Dennis Haysbert crash the party."
    },
    {
      "rating": "5",
      "text": "When I saw the original film, \"Think Like a Man,\" I was pleasantly surprised. While by no means a groundbreaking film, it at least had a coherent point of view.  It was also entertaining in the way it explored male-female relationships.  Unfortunately, \"Think Like a Man Too,\" is several steps down from the original. Rather than expanding on the original in its exploration of romantic relationships, the sequel relies too heavily on Kevin Hart's frenetic energy and the Las Vegas location to carry the film.  Most of the humor is fairly lowbrow with tasteless jokes referring to people's skin color and body odor. Like many of Tyler Perry films, this Will Packer-produced movie relies too heavily on cliches and stereotypes. The characters are largely self-absorbed and lacking in dimension. While the film has a few mildly humorous and even tender moments, they are mostly drowned out by one outrageous scene after another."
    },
    {
      "rating": "0",
      "text": "Comedy films are a genre of film that unfortunately have a lot of liberties taken with it. The genre seems to be victim to studio massacres when it comes to pumping out sequels when originals exceed expectations and budgets. The comedic genre is one that is usually produced for much less than the expensive action-adventure and science fiction films during the summer. So when a small-time movie succeeds, bet the house that a lacklustre sequel is on the way, hence, Think Like A Man Too.\r Now whats worse than having a successful comedy film for a studio? Having a huge rising star that can be forcefully placed into any comedy for a studio. Take one of my all time favourite, generation-defining original comedies, American Pie as an example. Pie, which was made in 1999, inspired a slew of sequels, spin-offs without the original cast members, and a whole generation of laughs which have made its way up to audiences in 2012 with American Reunion. Now, there is always a stand-out comedian that steals the show and becomes an icon for a generation of audience members and adolescents, and for the Pie series, that character was undoubtedly Steven Stifler, played outrageously by Seann William Scott. Stifler was such a huge comedic force for the series that, by the time American Wedding came around four years later, the movie might has well been called Stifler: The Movie since the narrative followed the missteps and redemption of the outrageous character more than the actually wedding at hand. Scott, who was thankfully a star for his portrayal as the limitless frat-boy, was quickly exhausted and eventually forgotten by the time the much needed career boosting reunion was announced.\r Now with the surprise, box-office champion Think Like A Man, expectations for the comedy were low, which came a surprise when it reigned supreme at the box-office. As the film almost reached $100 million domestically and movies like Ride Along and About Last Night made Kevin Hart a certified box office force to be reckoned with, it seemed like a no-brainer for the movie to inspire a sequel. Not surprisingly, Think Like A Man Too is a loud, obnoxious cinematic overindulgence during a time of movie gluttony at the multiplexes.\r There is no denying that Kevin Hart is one of the hardest working comedians in Hollywood today. Earning his place and working over a span of twenty years trying to make it to the top, Hart is a relentless actor who seems to always get the attention on him. In Think Like A Man Too, Hart’s annoyance reaches a new high, and that is saying a lot. The ridiculousness of his character are unbelievable, his scenes of unequivocal loyalty are poorly conceived, and his high-stake redemption plot points are subsequently brought to him on a silver-platter by other characters. Think Like A Man Too may not be all Hart’s fault, but when it comes down to it; his voiceover throughout the film, face in front of all the marketing and high-ranking comedic position sure makes his the easiest target for one of the worst comedic missteps of the summer.\r Not really thinking like anything or taking to heart any of the subject matter from the source material which the film is based off of, Think Like A Man Too finds the group of friends in Las Vegas for Michael (Terrence J) and Candice’s (Regina Hall) wedding. And like any good weekend in Vegas, there is always the overbearing presence of having the best wedding ever, but, as per usual, chaos ensues. You would think that any wedding deciding to have their bachelor and bachelorette parties the day before the big day have learned from various pop culture disasters not to do that, but hey, no one said any of these characters were rational.\r Taking too many of the wrong cues from the last Hangover film and not enough from the first trend-setting film, Too feels like too much of the rehashed failures of so many other movies before it. Thankfully, the original cast was able to return for a trip to Sin City, but unfortunately, no one is able to make matters any better as the jokes fade fast, the laughs come sporadically and the cast members seem to be cashing in like so many of the extras acting around them.\r Michael Ealy, who seems to be Hart’s yang when it comes to his presence on the big screen, does what he can with the emotional scenes and heart-wrenching moments of love. Ealy, whose doe-eyes are the perfect balance to the stark comedy Hart offers, does what he can, and that is bringing the ladies to the theatres. The real stand out of the ladies is the always sidelined La La Anthony, who plays Sonia, a friend invited to the bachelorette party but not given any space in the bridal party. Sonia steals so many of the scenes with the girls offering some real-world girl fun and comedy to a movie that seems have its head in the stars."
    },
    {
      "rating": "1",
      "text": "Think Like A Man Too is what most sequels to successful comedies are, a cash grab. With no real creativity this stereotypical Las Vegas-based Rom-Com draws the occasional laugh in an otherwise reserved and rather stale story. With this cast the film had the potential to get a little raunchier than the previous one with the Vegas atmosphere but instead decides to tone back and the quality is greatly affected. Should have stuck to a single movie story."
    },
    {
      "rating": "8",
      "text": "Steve Harvey's romantic story of \"the game of love\" is back. the romantic sequel that lovers were excited about and i was one of them.This definitely is the funnest Think like a man movie ever it has the hilarity, the charm. But i felt like the first one was more romantic then this, this sequel was more FUN. some of this film has some cliche's;"
    },
    {
      "rating": "7",
      "text": "This film was a decent comedy film which was unexpected given the put-together-quick attitude of most of Kevin Hart's films. In this film, Kevin Hart does not play the \"wild short man\" which has become a kind of trademark in his film comedy. His role is much calmer in tune with some of his stand-up and focuses more on subtle comedy which is always beneficial in the comedy genre. Some scenes were very unnecessary such as the dance montage scenes which didn't get an ounce of laughter from the audience in attendance. A mention regarding Elvis or someone appearing in his jumpsuit would have authenticated the film a bit more and including the Elvis classic and unofficial theme of the city 'Viva Las Vegas' would have given the movie more of an inside feeling. But all in all, the movie was funny and as a comedy movie, that is the main point here. If you're out with your girlfriend or vice versa and you're looking for a movie to talk about for the night and share a few inside jokes from, go watch it. If you're looking for a comedy classic, find something else."
    },
    {
      "rating": "7",
      "text": "hey guys out if y'all looking for some fun and get your mind off work or any stress..this is that movie to get and also even if your chilled at home . The movie really all started all good for my liking really,but i didn't like the old cliché that it went through at the end or almost end mid parts were the couple reconcile with their mates at the same time...like REALLY,..it has been done and is still being done  especially by black comedies,.. really writers need to stay away from that kind of approach really its really getting old  and boring it makes their movies really predictable.....other wise the movie is good it money well spent"
    },
    {
      "rating": "3",
      "text": "Think like a man too is a bad movie.But it also ruin think like a man.This is a sequel to think like a man and the sequel was so bad.Predictable, Bad acting,stupid scenes and boring.The 2 good things about this film is kevin hart and some jokes were good. But I give Think like a man too a 3.9/10.This film is just awful"
    }
  ]
}