{
  "id": 1600,
  "title": "This Is the End",
  "starring": [
    "James Franco",
    "Jonah Hill"
  ],
  "runtime": 107,
  "genre": [
    "Action",
    "Comedy"
  ],
  "description": "While attending a party at James Franco's house, Seth Rogen, Jay Baruchel and many other celebrities are faced with the apocalypse.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7Wdc3etyBJA4432TYtz6n9GQd1c.jpg",
  "categories": {
    "plot": 6.684210526315789,
    "acting": 5.882352941176471,
    "ending": 5.75,
    "soundtrack": 8.0,
    "cinematography": 6.5,
    "familyFriendly": 3.0,
    "funny": 5.221052631578948,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "This Is the End offers a solid cast with some outrageous and witty moments that will have you laughing. All the actors have great chemistry and for the most part are real likable. If you like cameos, references, crude humor and apocalypse's then this movie is for you. But if you're into a little more clever along with less blunt and immature humor, you might have to look elsewhere."
    },
    {
      "rating": "8",
      "text": "Every year we get a whole new lot of comedies rolling out into cinemas. Rarely ever do they do what \"This Is the End\" does. \"This Is the End\" dares to be different, without losing sight of being absolutely side splittingly hilarious!\r Seth Rogen, Craig Robinson, James Franco, Jonah Hill, Danny McBride, Michael Cera, Emma Watson and many many others all join together to create one of the funniest comedies I have seen to date. Personally for me after reading the cast for this movie I was very hesitant as most movies with all star casts tend to crash and burn under their own weight (ex. Movie 43). Luckily however, this is really just a bunch of friends getting together to make a hysterical movie and on that it succeeds brilliantly.\r It's refreshing that the plot of this movie does not stick to most of the comedies structures that we see all the time, recent example \"The Internship\". The movie hardly ever takes itself seriously, aside from some scary and graphic scenes. But even then you'll be laughing almost immediately after. The great thing about this movie is that the plot had key points in which the actors would have to get to to progress the story but other than that every line is essentially ad libbed and improved based on all the actors just playing off each other.\r Easily the best part of this movie is the inside jokes about the actors. For example James Franco makes jokes and references to his movies such as \"127 Hours\" and even references to his work with Seth Rogen in \"Pineapple Express\" and several other movies. You don't need to know their past work but it definitely will increase your appreciation for this movie.\r Overall, I can't say for sure that if you don't like any of the actors involved that you will enjoy yourself. But I can say that it is one of the most original and down right raunchy comedies I have seen in a long while. All of the actor's \"playing themselves\" worked wonderfully and it was a roller coaster of laughs from start to finish.\r I give \"This Is the End\" a 8.0/10"
    },
    {
      "rating": "6",
      "text": "Raunchy, vulgar and incredibly, ignorantly profane. But I'm green-lighting it for the laughs, which I really needed today. From the mildly funny stuff (e.g. Seth Rogen trying to compare the Trinity to neapolitan ice cream) to the laugh-out-loud shtick (e.g. Aziz Ansari's fate!) it is full of insidery humor. And a hint of a moral, amid all the immorality. Might just be me, but I would have enjoyed at least one lasting female presence to break up the repetitive bromances and perhaps limit the talk of penises and masturbation."
    },
    {
      "rating": "0",
      "text": "Absolutely atrocious. No thought of effort went into this. Famous potheads ad-libbing does not make an interesting film. Very lazy. One of the worst movies I've seen in a long time."
    },
    {
      "rating": "6",
      "text": "After so many Seth Rogen ensemble comedies it was inevitable that the jokes would be harder to come by and harder to land, I mean there are only so many Danny McBride rants you can take before you have to slam Up in the Air in the DVD drive just so you can see him do something different for a change. This is the End tells the story of what happens when Jay Baruchel and Seth Rogen go to a house party at James Franco's house and the apocalypse begins leaving them, Jonah Hill, Craig Robinson and Danny McBride to fend for themselves and try to make it out alive. It's a clever concept as it allows real laughs while exploring everything meta comedy has to offer which turns out isn't a lot. The central joke that these people really exist an its funny to watch them do despicable things gets old really fast (except for the unveiling of a gimp at the end, that's hilarious). The idea of six celebrities trying to survive a horrible event is interesting but they do so by hiding away in the same building for almost the entire movie making for a very slow moving comedy. The film relies upon lengthy set ups to pretty regular material so there are long boring sequences to struggle through. That being said the last 30 minutes are fun, fast paced and exciting because there is actual momentum. The film suffers from bad plotting and never really recovers but it's worth watching for some surprisingly well directed action and a few genuinely laugh out loud moments."
    },
    {
      "rating": "6",
      "text": "Rogen 3/10, sorry, he just isnt funny.\rRobinson 8/10, great work, i look forward to seeing what he does next\rBaruchel, 7/10, he played a good level-headed foil for the most part.\rHill, 5/10, has his moments but just not a funny man\rMcBride, 8/10, breathed life into the film at the right time\rFranco, 8/10, his confession line about Li-lo had me laughing uncontrollably.\r All in all, better than i thought it would be and a strange non standard flick"
    },
    {
      "rating": "9",
      "text": "Most of Seth Rogen's & Evan Goldberg's filmography can be some very solid stuff, but this time around they've gotten the director's chair, giving them more creative control. As a result, \"This Is The End\" not only passes being a good comedy, but a good MOVIE as well. Brandon Trost's cinematography is great and the dialogue between the actors can be noticeably ad-libbed, but it feels very genuine since just about everyone turns in a brilliant performance. This was the first mainstream movie that portrayed actors as, well, normal people. They're imperfect and don't always have an answer to everything, it helps them become much more relatable as people. Some of them play exaggerated versions of themselves that's very fun to watch and it's pretty obvious that they're having a blast doing so. This movie is very re-watchable and it's certainly the best movie Seth and Evan have put out. I love it."
    },
    {
      "rating": "0",
      "text": "This is a witless steaming pile of dog poo. SAVE YOUR MONEY! The moronic sense of self-satisfaction that is displayed by the half-wits that compiled this garbage truly depresses me. A waste of money and time."
    },
    {
      "rating": "9",
      "text": "Man, oh Man! This movie was way different than I thought it would be. It is extremely hilarious and fun/enjoyable to watch. It's weird how, the story (in a sense) is kind of unoriginal. I mean, it's an apocalypse movie. But when you combine it with a story where the actors play exaggerated versions of themselves in the same situation, you have one killer movie. Everyone in this movie was awesome and funny. Let me also say this. Craig Robinson, you've had a rough start this year, but I'm happy to say that you've redeemed yourself. Your officially on my good side once again. Also, the story and the humor mixed in is surprisingly clever. Plus the fact that they also mention stuff from there other movies as well. Like James Franco's fake arm from \"127 Hours\"  and Danny ranting on Seth's previous roles. If you don't know what I mean by that, watch the teaser trailer. I even loved Emma Watson in this movie. Yet, she's not really a full blown cameo, but all the time she was in this movie, I loved her. But the best part of this movie was Micheal Cera. I've never really been a big fan of him, but now I can say that even though he wasn't in the movie very long, he was f-ing awesome for the time he was in the movie. I've been so excited to see this movie, and now that it's hear, I'm glad that it was an amazing movie. Overall, it's an original/outrageously hilarious apocalypse movie."
    },
    {
      "rating": "0",
      "text": "Before I start, I should write that I am a Seth Rogan fan and thoroughly enjoy his past work such as Knocked Up, Pineapple Express etc.. I had high expectations for this film after hearing Seth and Evan Goldberg interviewed on the Adam Carolla Podcast. I went to the film, sat patiently waiting to be entertained, ready to laugh and my face and inward demeanour rarely changed from a blank expression and inner calm throughout the whole showing. I did smile occasionally but did not at any time have a full laugh and I mean that sincerely. The persons behind and in frontof me also showed no emotion whatsoever throughout the film although I did hear an occasional laugh in the audience in another part of the theatre. I found the film almost painful to sit through. However, a black comedy is usually more clever and inciteful on society and relationships than a regular comedy. I found the film neither clever or inciteful and certainly not entertaining. I will not give up on Seth though as he has shown a comic flair in his writing in the past  and hope the future holds more Knocked Up-type humour."
    },
    {
      "rating": "0",
      "text": "This was the worst movie I have seen in years.  I was so looking forward to it too. Do not go! It was a total waste of time and money. The target audience must be 13-16 year old immature pimple faced boys who have never had a date and boys who smoke dope and love to hear about dick and penis jokes. This will be my last Seth Rogan movie ever. He has now taken over for Adam Sadler for making a the longest string of bad movies that nobody wants to see."
    },
    {
      "rating": "5",
      "text": "I felt pretty meh about this.  No doubt that this comedy will be a big hit with a lot of people.  I did get some laughs out of it, although it took about 30 minutes before they started to come.  I'm surprised it is doing so incredibly well on reviews when frankly I have seen funnier films."
    },
    {
      "rating": "1",
      "text": "I keep hearing how people love this film and they claim that if you're a fan of the actors involved you'll love this, this is not the case. I'm a big fan of all these actors & instead of listing the films I liked them in, I'll just name the one I didn't like, \"Your Highness\". Automatically I couldn't wait to see this, I knew exactly what I was in for however the jokes were unfunny, the acting was bad and the story was flat. I can't help but hate this film & I really can't understand how anyone could like it. Massive disappointment especially considering these actors have been in films like Pinneapple Express, Superbad & Knocked Up which are all real comedies. This film is a joke and I mean that in a negative way."
    },
    {
      "rating": "0",
      "text": "Are you people insane?  If this is what you are willing to pay your hard earned money to see then why should anyone work at their craft.  Possibly the most juvenile idiotic movie I have ever seen.  Is this what Hollywood now calls entertainment.  I have as good as sense of humor as the next person but this flick was awful.  The people connected in making this should be ashamed."
    },
    {
      "rating": "1",
      "text": "One of the worst movies ever! It can be termed comedy is boring is the new funny. Senseless jokes and awful acting. Thankfully, it gets better at the end but the first quarter of the movie there was only one person laughing in the entire theatre. Just terrible!"
    },
    {
      "rating": "4",
      "text": "Not enough laughs.  Not enough story.  Review must be 150 characters long, Not enough laughs.  Not enough story. Not enough laughs.  Not enough story. Got it?"
    },
    {
      "rating": "0",
      "text": "'This Is the End' I was hoping 5 minutes into this hunk of junk. Jason Segal got out of there early, although he was still in it so he's now out. Stick to the f**king muppets man, they have way more character than these lame pricks."
    },
    {
      "rating": "4",
      "text": "In a simple conclusion, this film is a high budget youtube video distributed for mass consumption. The jokes are rather redundant after 30 minutes into the film. If you enjoyed Superbad or 40 Year Old Virgin, then this movie will disappoint. The characters do a wonderful job with their improvisation, and the cinematography is great. Outside of that, the film is a major let down."
    },
    {
      "rating": "3",
      "text": "If you have seen \"Your Highness\" then you know what to expect in this movie =tons of Penis's on screen with alot of akward jokes about rape, etc. I really wanted to like this movie but its gross out humor and over the top acting was a bit too much to enjoy."
    },
    {
      "rating": "9",
      "text": "The straight-up End of Days has a nice way of bringing out the real deal of many people, and in this film is certainly so for a small cadre of actors.  If you've seen Seth's works before, particularly Superbad and Pineapple Express, chances are you'll enjoy this movie.\r Rapture comes calling, and these few survivors are stuck in Franco's tacky mansion forced to learn how the new age of the world works, if they can figure out how to live with each other, and how exactly to find more sustenance without wandering outside too much, if they can help it.\r Plenty of laughs, slightly horrifying imagery (so many phalli, don't bring the kids) and a metric butt-ton of cameos  it's definitely one of my new favorite films."
    },
    {
      "rating": "2",
      "text": "The movie is painfully unfunny and blunt. Half of the moments that I chuckled at were in the trailers. The acting is abysmally bad, feels like an extremely cheap sitcom. For a moment I thought that they acted so cheesy on purpose but it is not the case. This Is The End is almost as bad as Your Highness.\r And no I am not a puritan, normally I laugh my lungs out on dumb vulgar movies."
    },
    {
      "rating": "0",
      "text": "Worst movie ever! It was embarrassing to watch or to hear! It was a horror movie for me, way to dirty, gross, boring! The trailer is a lie, doesn't honor what it promises. I mean really! All you see is a bunch of dumb actors, getting high and talking about their male parts! A total waste of money and time! I hated it!"
    },
    {
      "rating": "2",
      "text": "It has a few funny lines here and there, I suppose. Unfortunately, every joke that made me laugh during this was at Michael Cera, who is only actually in about 10 minutes of the film. It drags on FOREVER. The length between laugh out loud lines is sometimes unbearable. I will admit some of the visual effects were better than I thought they would be, although the shear lack of comedy just couldn't be made up for. From the reviews it looks like mostly people enjoyed it, although when I saw it the theater was almost silent the entire time, laughing only at a few moments. Only part that seemed to please everyone was the BSB cameo  that say a lot about a movie, I'd say. I wanted to enjoy this movie, as the first 20 minutes is very funny, but me and my friend actually talked about leaving about 40 minutes in  we decided to stick it out but this was a mistake."
    },
    {
      "rating": "0",
      "text": "What has happened to society!? Are male members really worth basing an entire movie on? I didn't find the humor in this at all and was really looking forward to a LOL movie. To say I was disappointed is an understatement."
    },
    {
      "rating": "1",
      "text": "This was the worst film i have see in a long time.  Most of the shock value type potty humor falls flat and gets boring fast.  The are much better ways to inspire others to be honest and truthful to their feelings, than the fear of being raped by ugly demons of the Apocalypse.  A crappy movie at best."
    },
    {
      "rating": "10",
      "text": "I never write reviews, but this movie is an instant classic. The creativity and the improvisation are, as always, big parts of what make the movie work. But also just the sheer joy of watching Hollywood's lovable actors cooped up in one house with one each other during an invasion make this movie sure a memorable time at the theaters. \"This Is the End\" is a perfect watch throughout the strand of disappointing comedies as of late. Maybe its because of the lack of creativity in Hollywood or because it really is sheer genius, \"This Is the End\" is the funniest movie I can remember watching in the theaters. Must see."
    },
    {
      "rating": "0",
      "text": "This has to be one of the most pointless movies I have ever seen. I enjoy stupid comedy like many others but the jokes seem forced and the bromance element was poorly done. I loved superbad and pineapple express but this lacked any real meaning. It went from one predictable scene to the next forcing one issue after another with lame fart jokes and fake buddy buddy crap. This was unwatchable"
    },
    {
      "rating": "5",
      "text": "If I were younger I would probably like this movie more, but I've seen too many films similar to this.  If you're tired of men being portrayed as stupid, bumbling idiots, like every commercial on television, then you probably won't like this film.  It was refreshing that the actors play themselves, and make fun of themselves and other actors, but there just wasn't quite enough laughs to recommend.  The special effects surprised me  they were excellent.  All the actors are excellent as well  I just wish I laughed more."
    },
    {
      "rating": "0",
      "text": "How can any civilized person think a movie based around demon rape and rape jokes is even remotely acceptable? How on earth did they manage to get an R rating for this?"
    },
    {
      "rating": "6",
      "text": "it was kinda funny i guess, but it was kinda just to silly in some/most areas for me to fully enjoy it. some jokes they tried to run with ran to long and became quite boring or just awkward scenes. overall the movie was cool for like a one time ever viewing, i'll probably never watch it again though."
    },
    {
      "rating": "6",
      "text": "Is it stupid you bet, but overall its widely entertaining and hilarious film that puts a different spin on things. With nothing but below average comedies so far this year, This is the End is a good comedy that could have used a few tweaks to make it a great."
    },
    {
      "rating": "8",
      "text": "\"This is the End\" is a highly original meta-comedy that puts well known actors into an apocalyptic world. It’s self-referential and the actors essentially play an exaggerated version of themselves. The film is filled with strong creative writing with a lot of laughs. The themes are about being a good person and sacrificing yourself for something greater. The punches keep rolling, only slowing down in a few spots. Seth Rogen and Evan Goldberg’s direction is pretty good. They handle spectacle and slow moments very well. I really enjoy how this film manages to throw curve balls once in a while and have the audience on their toes as the movie gets bigger.\r The actors play an exaggerated version of themselves. Jay Baruchel is the main character and fights for his friendship with Seth Rogen over James Franco and has a rivalry between Jonah Hill, who is the funniest amongst the whole crew. The cast has great chemistry together as they play off each other very well and you can get a pretty good vibe that these guys are actually friends in real life. They’re all jerks and have to deal with judgment day as they attempt to survive and become better human beings. There are some great cameos from other actors in the film. The best would have to be Emma Watson as she plays a version of herself that we aren’t really used to. The only person that I didn’t like is Danny McBride. He’s annoying and aside from his introduction isn’t all too funny. The cast as a whole is pretty strong and work well together to bring us the laughs.\r Overall “This is the End\" is an excellent and highly original comedy. It’s extremely funny and smart filled with slapstick, situational, and self-referential humor. The laughs keep coming and only slows down a few times in the beginning and some parts in the middle. The special effects are handled well and the soundtrack supports the film very well. The actors have a fun time playing tabloid versions of themselves and play off each other very effectively. Seth Rogen and Evan Goldberg’s script is top-notch and they greatly handle the ever growing scale of the film. I give it 4/5, original and great premise accompanied by a committed cast and laugh out loud humor."
    },
    {
      "rating": "0",
      "text": "what is this crap\rI gave in and watched this movie after seeing a lot of positive reviews. After finishing the movie I have yet to find a funny moment. Not to mention totally uncalled for offensive garbage that fails at humor."
    },
    {
      "rating": "9",
      "text": "The funniest film I've seen in a long time.  This is what an R rated comedy should be like not playing safe andjust going for it.  The cameos in this film are also fantastic from Emma Watson to coked out Michael Cera to Channing Tatum this film is hilarious."
    },
    {
      "rating": "7",
      "text": "I really should stop doing reviews a week later. \"This is the End\" is an apocalyptic comedy film that ask one important question. Can a movie be good if it is just one big cameo? The answer is, well, read the review. First the concept, a cameo is basically any reason to star someone famous in the hope that it makes your movie seem better, despite that character having no real point in the movie. It is a cheap ploy to sell more tickets to the movie as it gives the would be audience the feeling that the character will play a major role when they don't(ex: the scary movie franchise). It really shows just how big of whores writers and producers are. That being said, again can this work in the concept of the movie? Actually, yes it can.The actors aren't playing characters they are playing themselves. And I gotta say they seem to have fun with it and appear to act like they are known for acting like; Seth Rogen is calm yet sarcastic, Jonah Hill is kind to a fault, Jay Baruchel is very religious and Danny McBride is an irredeemable douche. They know there movies and everything, so they come off as genuine unlike other shameless cameos. Speaking of which: The movie starts with Rogen and Baruchel going to a party filled with cameos at James Francos house. People like: Rihanna, Michael Cera, Aziz Ansari, Kevin Hart, Paul Rudd and others. Most of which are violently and hilariously killed off pretty quickly.(granted this mostly cause I have a dark sense of humor, up until this part the movie was pretty dry). Our Protagonist must then survive by living inside of Franco, so the monster don't attack and kill them. Why don't the monsters just break in and slaughter them, especially since it is shown in two scenes that they are able to? I don't know. It's never explained. Maybe the demons are just  with them. This is one thing I like about the movie does well. Aside from the great jokes that are told, whenever a character is killed it is funny as hell and never feels unceremonious. As the story goes on we get an influx of funny jokes, however this is also a problem with the movie. IT IS FILLED WITH FILLER!!! This movie is over 2hrs long but it doesn't feel that way for two reasons. One the jokes and two all the crap that if it wasn't here the movie wouldn't be affected(aka big-lipped alligator moments). However with that being said the story(which is based on a 2007 short comedy film called Jay and Seth versus the Apocalypse) isn't very good. Not the worst this year(that would be The Purge) but it has room for improvement. Also while I like the spoken jokes the physical comedy is pretty low-brow. Granted sometimes that's funny like Satan getting his dick cut off an grabbing his crotch in pain. However most of it is just gross and distracting. Speaking of distracting this movie has some of the worst special effects I've seen in a while. Even when compared to The Asylum. Who is The Asylum? Wiki them and look up their movies. Yeah that bad. The monster CGI is bad and the green screen is terrible. It is obvious the budget, which for a movie like this wasn't very high, was spent on the cameos. Something else that gets in the way is the religious undertones which in my opinion just aren't handled correctly and are really out of place in a movie like this. But to me the most egregious thing about this movie is the ending. This move, like I said, is over 2hrs. They spend only about 15 min wrapping it up in a  and contrived way. When I saw this ending all I could think was the writers needed a resolution and instead of creatively making one they just rushed a poorly done one. and No amount of Backstreet Boys will change that. They could have made a better ending if the had cut out some of the filler. I was laughing so hard most of the movie which I normally don't especially for comedies(cause lets face it good comedies are a dieing art). However there are just so many mistakes that were made during the flick: The filler, the ending the fact that Wil Ferrel isn't here so he could die painfully.....ok that last one is counted but you get what I mean. This in my still brings This Is the End to a 7/10 a great film. Does the movie have its problems? Yes. Like that dumbass ending, but it will not keep most people from having fun with it. That is until they inevitably make a  sequel/spin-off. If you haven't seen this movie I would see it and form your own opinion. Plus Channing Tatum is Danny McBride's  Nuff Said."
    },
    {
      "rating": "9",
      "text": "I am not a Seth Rogen fan, however, this movie is truly a great funny comedy.  This movie is not going to win any Oscars but it is damn funny.\r Everyone plays themselves, or should I say a version of themselves, in this comedy gem from director Seth Rogen.  The movie is an end of days apocalypse movie with a message about what it means to be an honest and good person.  As Seth Rogen and company venture through the impending doom and rapture, they encounter everything from beasts and exorcisms to one pissed off Hermione.  Speaking of which, the cameos in this film are all great and get pretty decent screen time too.  I had pretty low expectations going into this film but I can safely say this is a DVD purchase and it has tremendous rewatchability with tons of quotable one liners.\r Watch for Danny McBride, who is this film's scene stealer and delivers probably one of the best laugh out loud moments I've had in a long time.  He is an underrated comedic genius in this movie.\r I highly recommend this movie to be seen in the movie theater and worth the price of admission.  It might be the best comedy of the year."
    },
    {
      "rating": "7",
      "text": "This is the End es una película bastante satírica, filmada de una manera muy poco madura, con un humor negro y crudo, la profanidad cruza sus límites, hay fiestas, hay actores graciosos y con talento, hay severas obscenidades a religión y, lo más importante, risas sin parar.\rRecomendaría This is the End a las personas que disfrutan del humor negro (así como yo) y entonces la disfrutarán mucho y tendrán muchas carcajadas, además el reparto que se interpreta a sí mismo es delicioso y bien actuado (supuestamente porque no es muy difícil actuar como uno mismo). Gran comedia."
    },
    {
      "rating": "0",
      "text": "This movie is hilarious!  I would love to hang with those guys but alas I'm too old.  Had I known people like that (Rogan, Hill, Robinson, Franco, McBride, & Baruchel) when I was the age they are now my life would have probably turned out differently (for the good).  I've taken life (as brief as it is) far too seriously and have been stressed out my existence.  Those guys teach a very valuable lesson: chill!!!!"
    },
    {
      "rating": "0",
      "text": "This is the end is one of the worst movies I have ever seen. It was not funny and frankly I want my $1.50 back  How people could think the movie is funny is beyond me."
    },
    {
      "rating": "0",
      "text": "Don't waste your time.  I thought this must be funny after hearing such a positive review, 4.5 stars, by David Blaustein of ABC and WJR.  There are a couple of laughs but that is about it.  We walked out after about 40min.  It may help if you are high before going.  Totally over rated.  I now know to ignore Blaustein.  Rent a Cheech and Chong movie."
    },
    {
      "rating": "3",
      "text": "Born in the 70s, am I getting too old?  This movie falls along the same line of all the over-the-top, how many can we offend, let's see if we can shock anybody, movies of the last decade.  The Apatow school of comedy filmmaking.\r Apparently the majority of the dialog was improvised, which I felt was very obvious.  I don't mind raunchy humor, I just don't find it funny when it's just done for raunchy sake.  I walked in expecting There's Something About Mary, Tropic Thunder, and Talladega Nights, and instead it felt more like Borat.  It was like watching the Seth Rogan comedy hour live with no script.\r I score it a 3, because it does have some laughable moments, especially when it involved the self deprecating jokes towards the narcissistic Hollywood lifestyle.   But this movie just didn't click for me.\r In our large, crowded theater, the room was clearly divided with half the room applauding, exclaiming \"best movie ever\"  and the other half shaking their head, wondering why they didn't leave early."
    },
    {
      "rating": "0",
      "text": "I loved Superbad which is why I went to The End. Huge mistake. What a horrid piece of junk, made by a bunch of guys who are not nearly as funny as they think they are   by a long shot. I want my 2 hours back."
    },
    {
      "rating": "8",
      "text": "When I first saw the trailer, it seemed okay. And during the movie, I've never publicly laughed out loud in a theatre, and this was a first, especially when you're laughing with the whole audience. The whole movie was just ridiculous and, obviously hilarious."
    },
    {
      "rating": "5",
      "text": "Yes it's a comedy all right. You know what to expect when Seth Rogen, Jonah Hill and similar are starring... It does have a few funny lines, not too many but still... Silly-funny, not smart-funny but (excuse the repetition) it was expected. So, for the most part it was amusing to watch. Yet when I was leaving the theater I felt sad. These talented actors are already all in their 30's yet the way they talk and behave is as if they are teenage half-wits who can only think about drugs and fornication. This movie could be easily done with marionettes instead of actors, \"Team America\"-style. In fact, it would be even funnier. What I mean is there is nothing to play in that script and it seems to be a waste of actors' skills. Is it a quest for easy money or inability to get out of an established stereotype screen character?"
    },
    {
      "rating": "10",
      "text": "Instant classic. This movie is so funny, so outrageous, so filled with energy you should put Man of Steel and every other movie on hold. Do yourself a huge favor and just go see it."
    },
    {
      "rating": "8",
      "text": "These guys are hilarious, and they really put their comedic talents on display in \"This is the End\". If you liked \"Superbad\" and \"Pineapple Express\", do yourself a favor and see this movie. You won't be disappointed."
    },
    {
      "rating": "10",
      "text": "From Superbad to Pineapple Express and now This is the End, the West Coast writing duo Seth Rogen and Evan Goldberg have specialized in movies about modern bro-ships. In with their new apocalyptic comedy This is The End, friendships are strained as never before and yet the calamity always starts from a kernel of truth. A prank for TMZ-obsessed times, This is the End features a galaxy of stars playing themselves, like a Mad Magazine parody brought to life. The story starts simply  Montrealer Jay Baruchel flies to L.A. to meet up with his Canadian homey Seth Rogen. Baruchel is looking forward to a quiet evening of dope and Xbox but Rogen wants to hang with his hip Hollywood friends. James Franco's having a party at his new pad. And so the dynamic is set. Rogen as the mellow peacemaker  Baruchel as the reluctant insider who never really belongs. So we see Franco playing it up as the pretentious poser, his Hollywood digs covered in his latest art acquisitions. Jonah Hill comes off as a polite, but snide, social climber, with a gaudy diamond to accent his d-bag status. Craig Robinson just wants to chill, appearing as a towel-slinging Romeo looking to ride out his last days. In terms of just what is occurring in This is the End, I don't want to reveal too much,  but let's just say it gets Biblical. In terms of pure schadenfreude, it's unlikely you've seen this many famous faces fall to their death since The Poseidon Adventure. But the breezy 1970s disaster movie production values give the carnage an almost campy feel. Like a demonic cross between The Hangover and Ghostbusters, This is the End works because the comedy springs from an emotional truth. Every riff seems to come from the question \"What would I do now?\" Like so many Seth/Evan collaborations the action is anchored around the friendship  in this case between Seth and Jay. It might sound dull, but in a comedy filled with dangling demon parts and hell hounds, it helps to be grounded. It's that mix of improv, irreverence and reality-based beginnings that makes This is the End a comedic revelation."
    },
    {
      "rating": "10",
      "text": "I adored this movie.  I never stopped laughing.  The humor is raunchy as hell, but it's not the shock, it's the truth of how people would react in these circumstances that makes it great.  And there's actually a real sweetness to it.  I came out of the movie inspired  and still laughing to myself.  If you liked Superbad, Pineapple Express, or Tropic Thunder, you should really enjoy this."
    },
    {
      "rating": "8",
      "text": "The movie is raunchy and hilarious fun. There are a couple of slow spots in this almost two hour movie but the ending is so funny it is worth the wait."
    },
    {
      "rating": "8",
      "text": "Classic comedy with a few scary moments. Yes, the humor does trend a little crude at times, but if you could not guess that from the trailers, you are not paying attention. All in all a good comedy that could have used a few tweaks to make a great comedy."
    }
  ]
}