{"id": 294, "title": "Thor", "starring": ["Chris Hemsworth", "Natalie Portman"], "runtime": 115, "genre": ["Adventure", "Fantasy", "Action"], "description": "Against his father Odin's will, The Mighty Thor - a powerful but arrogant warrior god - recklessly reignites an ancient war. Thor is cast down to Earth and forced to live among humans as punishment. Once here, Thor learns what it takes to be a true hero when the most dangerous villain of his world sends the darkest forces of Asgard to invade Earth.", "releaseYear": "2011", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/prSfAi1xGrhLQNxVSUFh61xQ4Qy.jpg", "categories": {"plot": 7.0, "acting": 7.6440677966101696, "ending": 7.625, "soundtrack": 6.0, "cinematography": 6.0, "familyFriendly": 6.0, "funny": 7.111111111111111, "action": 7.809523809523809}, "reviews": [{"rating": "10", "text": "The reason I loved  Thor was because it performed well on a few fronts. The Special Effects are the best to date. Thor is portrayed very closely to his comic character, in terms of Powers, attitude,etc. The arc of th story was well laid out and the pacing was balanced. It was a brilliant way to bring a really fantastic  un-real world of Marvel Comics and Norse Mythology into an almost plausible reality. Props to the principle cast, and Brannagh may be the ultimate reason this Stan Lee creation works so well on screen"}, {"rating": "7", "text": "Thor had solid acting, including a breakthrough performance by Chris Hemsworth, great action, solid humor, and a good ending. However, Thor also suffered from some pacing issues and some scenes that take you out of the experience. Nonetheless, this is still a movie worth watching and is a solid adaptation before The Avengers comes out next year."}, {"rating": "9", "text": "I had a blast watching this, it not only has some amazing special effects, but extremely enjoyable characters, these are some of Marvels most human characters yet, it can be genuinely funny, somewhat touching, and backs it all up with some awesome fights, and I just love the references to the other super heroes, like Iron Man (and was that Hawkeye?!), and the way it brings you closer to the future Avengers movie, honestly the most disappointing part was the ending, and it leaves the question of what's next for Thor? but this is still an awesome movie, and a perfect see for fans of Marvel."}, {"rating": "9", "text": "Thor is about a powerful but arrogant warrior whose reckless actions reignite an ancient war. As a result, Thor is banished to Earth where he is forced to live among humans. When the most dangerous villain of his world sends its darkest forces to invade Earth, Thor learns what it takes to be a true hero. Although the film is undeniably cheesy Thor is extremely entertaining, action packed and funny and features a fantastic debut performance from Chris Hemsworth and a charming performance from Kat Dennings. Although Natalie Portman just won herself an Oscar her character is cliche and that is the exact performance she has brought us. It seems Natalie is going back to her old bad acting ways like Star Wars. I give this film 88% of a good movie."}, {"rating": "6", "text": "Often pointed out as the worst in the marvel phase one, Thor is a movie that was not able to reach its full potential but still remained as an enjoyable ride from start to finish. It can be seen that Chris Hemsworth really tried, but his lack of charisma really didn't make the title character interesting. Maybe its the character itself at fault here, but he really wasn't likable enough."}, {"rating": "7", "text": "Maybe not \"Iron Man\" good, but certainly \"Iron Man 2\" good.  A great rendition of a famous, if not popular, Marvel character.  I can't think of a better Thor than Hemsworth (though young Thor maybe could've been played by that \"Little Hercules\" kid).  I was leery of Portman in a Marvel movie but she did good.  In fact, the entire cast was quite well chosen:  from Odin to Loki to Frigga.  They *are* missing one very beloved Norse god (can you guess which one?)  But I figure a third Odinson would mess up the plot (don't laugh, there is enough plot to hold it together).  The critics were kind of right about scenes on Earth being more dynamic than the ones in Asgard, but the continuous switching between the two keeps this balanced.  I thought Asgard a little too sterile to be the viking \"heaven\" (I was hoping for some hot valkyries), but their rendition of Bifrost works great.  The mythology is dealt with exactly as I would have:  the Asgardians never refer to themselves as gods.  Though the frost giants were a bit puny to be \"giants\".  Marvel continues the trend of strong female characters (Aunt May, Betsy Ross et al) with Jane Foster.  I dig the hilarious female sidekick Darcy (Kat Dennings).  And Sif (Jaimie Alexander) is a knockout.  The rest of Thor's pals were also faithful to the comic.  And so were the helmet designs.   I miss some of the classic battle cries (For Odin!  For Asgard!) but I suppose those went out along with beardless Thor.  Still, the fanboys should be pleased with references to Donald Blake and the effect of spinning Mjollnir.  Thor could've come off very badly, but it actually ends up standing well on its own.  I'm sure it'll rake in big at the box office this weekend, but Thor isn't one of the characters that is easy to make sequels for.  This will probably be the one and only.  That alone would be a good reason to see it.  On top of that, you know that if you're looking forward to Avengers, you're going to have to see all of these solo outings!"}, {"rating": "7", "text": "The mythological God of Thunder (Chris Hemsworth) is cast out of his kingdom and becomes a mortal on Earth. This flick has a lot going for it: magnificent art direction, moments of down-to-earth humor, extravagant spectacle and newcomer Hemsworth's undeniable charisma (not to mention that body). On the down side: the fight scenes are an indistinct blur and the drama drags down the pacing. Overall, it's uneven, but entertaining. NOTES: I didn't bother with the 3D and didn't miss a thing. Stay thru the credits for another \"Avengers\" teaser."}, {"rating": "10", "text": "The action was pretty solid, and Hemsworth did a good job conveying Thor.  The actor playing Loki also did a great job.  The love story though really detracted from it.  No connection, and no real sense of them coming together, yet the movie tried to force down our throats that they'd fallen in love.  And the big end scene where Thor's changed behavior was credited to Natalie Portman's character left me going, \"Really?\"  Did I fall asleep for 15 minutes and miss the big scene where Thor learned about sacrificing for the greater good from her?  I certainly didn't hate the movie and got some enjoyment from it, but I felt like ultimately, they needed a much better script.  Plus a love interest that actually had some chemistry with Hemsworth."}, {"rating": "0", "text": "Honestly, ZERO is too high for this movie. Big shame artists like Portman and Hopkins take roles in such movies for money. Wasted two hours of my life watching it because of surprisingly high ratings of other people :-("}, {"rating": "10", "text": "This was an astoundingly huge, incredibly well done movie.  Brannagh has taught a lot of filmmakers 'this is how it's done'.  It is *not* a superhero movie.  It's a battle between gods, and a classic drama of struggles with a king as his heirs, and a fantasy epic, and the frequent theme in mythology of a god fallen to Earth, to live and move with mortals.  Asgard and everything in it is thought through far better than it ever was in the comic.\r The special effects were examples of what the best filmmakers do:  they don't just throw a budget and a bunch of code monkeys at it;  they think through what an effect really should be doing, and how it makes sense.  That's why the effects, though technically great, really impress.\r When there are \"superhero', or Asgardian warrior, action, it's jaw-droppingly well done.  And when Thor is on Earth, there's constant challenge, humor, and lively interaction with every character.  This is not a case of a movie trying to live up to a comic book:  now, the comics have to learn to live up to the epic on screen.\r Don't worry about the comic books.  You don't need to know them to watch the movie.  You don't *have* to know all about Greek mythology to watch movies about battles between those gods and demigods and mortals and so forth, and when is it confusing if the very powerful become so arrogant or power-hungry that they are damaged and cause damage to those around them for their hubris?  This movie is like that.\r And I read the pro's and users here talking about how 'dumb' it was, boring, etc.  I guess it didn't have the sort of brilliant writing of Fast Five or Buffy the Vampire Slayer, or a scene in a strip club, or the touching directing talents of George Lucas.  How come there was all that boring talk in Henry V?  Why is there no Michael Becerra or 'homages' to crappy kung fu movies like \"Kill Bill\"?  How come there aren't 50 scenes of Natalie Portman bending over a motorcycle?  Why isn't it filled with a bunch of magic kids who never express any emotion and who are always saved by a newly discovered relic?  Obviously \"Thor\" can live up to none of these high standards.\r I would like to think it's a movie which will continue to grow in popularity based on word of mouth;  it's not too often I go in thinking a movie will be a lot of fun, and then see something far above my expectations.  From what I've heard, especially from people who didn't know too much about the character, I think that's likely.\r If you aren't the kind of person who likes intelligently written, large-scale epics with brilliant direction, gorgeous special effects, rivalry for the throne, big action scenes, and characters with depth and most of whom are played by fantastic actors, then this movie's not for you.\r Others should really go and watch it."}, {"rating": "9", "text": "This film was awesome. It was as entertaining as the first Iron Man.The action was crafted well and the acting was great too. Kenneth Branagh was a perfect fit to direct this film and I can't wait for the Avengers"}, {"rating": "10", "text": "One of the best Marvel movies ever. It has great acting performances, colorful, and has pretty good special effects. I must say, I was skeptical about this film when I first heard about it because Thor is a God. He has so much power and if they had of messed up, the movie and especially his character would of been not enjoyable. But they didn't. What I also love is how Kenneth Branagh stayed true to Thor's comic book **** powers, abilities, and perhaps, naiveness. However, the love scene wasn't deep at all like some people make it out to be. It was actually rather corny. But other than that, it is an impeccably balanced movie and a genius way to connect Thor to Mythology to Jane Foster, all the way to the big screen!!!"}, {"rating": "6", "text": "Silly Marvel fun.  My children (8 and 9) really enjoyed it.  I did not have high expectations for the film but enjoyed it.  I was not impressed by 3D rendering and found it distracting."}, {"rating": "10", "text": "Fun action movie. don't try and break it down and analyze it. the movie is meant to entertain and be a fun movie about THE GOD OF THUNDER!!!!!! if you wanna chill out to a cool action movie this is a good choice."}, {"rating": "8", "text": "To say that Thor is a bad superhero movie is wrong but saying it's the greatest superhero movie is also wrong. Though I enjoyed Chris Hemsworth as Thor and I found everyone to be not as enthusiastic as Thor himself particularly Kat Dennings character who just was annoying and made to many references to todays society. the CGI effects are terrific particularly the Asgard scenes. Nice little cameo from Hawkeye for next years Avengers film and Samuel L. Jackson makes another appearance as Nick Fury which is pretty cool. Overall the was ok just a few things wrong with it. hopefully the Avengers and Thor 2 in 2013 will sort things out. I look forward to seeing Hemsworth work with RDJ and Chris Evans next year"}, {"rating": "10", "text": "This a fantastic film, the mithology of the comic appear in this film, the cast do a great performance of the characters, and the effects, wow, are awesome, the screenplay is good. Thor is one of the better MARVEL Studious films."}, {"rating": "9", "text": "I loved this movie, but I was more amazed by the character Heimdall! He was epic! This movie is more about learning about Thor, I expect any sequel to have more action."}, {"rating": "8", "text": "Not as good as I first remembered but still a highly entertaining film. There is plenty to like here as Thor is one of my favourite characters from 'The Avengers' line-up and I find I can enjoy this film as apposed to the likes of the 'Iron-Man' series. There isn't a great deal of Action for a film that you would expect to have a lot of it, but the final few scenes is where it picks up. Overall a very good film and I am quite looking forward to the sequel later this year!"}, {"rating": "7", "text": "'Thor' follows the story of a once arrogant God named Thor (Chris Hemsworth), who is banished from his world, Asgard by his father and king, Odin (Anthony Hopkins). Along the way, at Earth, Thor meets three scientists; Jane (Natalie Portman), Eric Selvig (Stellan Skarsgard) and Darcy (Kat Dennings).\r At Earth, Thor learns what it is and how to be worthy in order for him to become a mighty God again, but all that doesn't go according to plan when his scheming and jealous brother, Loki (Tom Hiddleston) plans to jeopardize Thor's return to Asgard and become King once again.\r Kenneth Branagh directs this movie with such visual ambition, the actors commit to their roles very well despite looking and often sounding ridiculous what with the costumes and constant Shakespeare-like dialogue. It definitely doesn't feel like a comic book movie, instead, more like a tone-down version of \"The Lord of the Rings\" and \"Game of Thrones\".\r The film does suffer from predictability and, possibly, just a short and thinly written plot, but it is a lot of fun, it may not rank among some great comic book films like; 'Superman' (1978), 'X2: X-Men United' (2003), or even 'The Dark Knight' (2008), but if you are a fan of the \"Thor \" comics...then you will like this for what it is."}, {"rating": "7", "text": "Unique among superhero films. For one thing, it's got a fantasy feel to it and for another thing, the main character has been stripped of his powers for most of the movie so it's more of a fish out of water story. Tom Hiddleson's Loki was brilliant (looks like the MCU has found their Heath Ledger) and Chris Hemsworth was very good as the title character. It's a pretty good movie, different from most films of its kind."}, {"rating": "6", "text": "56/100This movie is weird. It does not bring anything new, many scenes were filmed tilted ( I really didn't like that ) and I think I found the most useless character in a movie, Darcy..."}, {"rating": "6", "text": "The Good:- Chris Hemsworth IS Thor. He's pretty much perfect for the role.- Sets up Asgard well for future MCU movies, and visually it looks fantastic. - Has some nice character progression for Thor; shows him grow into the superhero he needs to be for the MCU. - The Loki and Thor sibling rivalry is very believable and very well done. This film also sets up Loki as one of the MCU's most formidable villains. The Bad: - The pacing in Thor is never very good. The beginning sets up an intriguing world but then Thor is banished to Earth where he runs around without his powers for a while, and the characters he interacts with are nothing special. It essentially slows down to a crawl and struggles to find its feet for the final act. - The final \"boss battle\" was incredibly disappointing. - For a superhero film, Thor feels very bland throughout. There is not much excitement and little actual fun to be had. This is essentially a set-up movie that fits well in the grand scheme of the MCU, but isn't that great on its own."}, {"rating": "7", "text": "this movie has some realy good action sequences, the character of thor was very wel developed, Loki in this movie is great. The casting for this movie was very good! At times the pacing is not that good and sometimes stuff that happends on earth is not very interesting."}, {"rating": "7", "text": "This actually in my opinion pretty fun movie.I understand why people don't like it."}, {"rating": "6", "text": "This film is a decent setup, leading to \"The Avengers\". It has emotion, good visuals and a great villain, Loki, which is very well-played by Tom Hiddleston."}, {"rating": "4", "text": "Yeah not my favorite phase one film.  The plot is fine, I particularly like the drama around Loki.  I just personally don’t like Thor’s character, he’s just kinda boring for me.  Other films rectify this but it isn’t really a good start for the character.  Thor as a film has a weird feel, being a comic book super hero movie with high drama, sci-fi, and Norse fantasy, it just doesn’t mesh together well in this film.  I do love the conflict between Thor and Loki that follows this film, but it does feel a bit forced.  Otherwise the CGI looks good and the design and look of the worlds are great and refreshing in the greater MCU, especially at the time."}, {"rating": "6", "text": "This is an action adventure film with obvious fantasy (in a mythological, almost science fiction sense) elements presents. It covers themes including father and son relationship and betrayal.The first half an hour or so is set in the 'realm' or other world and I felt less bothered or interested in it during these scenes as everything just looked so clearly artificial. For me it was when Thor was sent to Earth and forced to get the help of humans, that it really started to interest me. There were definitely some awkward scenes with Thor, finding himself unsure of his surroundings and acting unsurprisingly peculiar to the eyes of onlookers and I found those scenes quite amusing. Of course the plot is somewhat ludicrous but to me it was a mostly enjoyable watch, a bit of fun. I felt that there were some quite impressive special effects used - the visuals are quite good (explosions etc.), with bright lights, fast paced scenes, and plenty to keep you watching. The camerawork is quite good too, with various angles used and quick cutting between them, meaning that it doesn't get especially boring (in terms of looking too bland or stale) while characters are in discussion.Cast wise, Chris Hemsworth plays the title role of Thor - he very much looks the part in as much as he sounds quite reverential and looks to have a steely, determined expression on his face for most of the film.  Jane Foster is portrayed by Natalie Portman, who plays a fairly typical somewhat air-headed young American adolescent. She seems quite excited by the prospect of finding some proof that things science say aren't real, are. She seemed pretty believable in her role. Anthony Hopkins plays Thors father, Odin, an aged yet wise man who clearly has learnt a lot in his time. I thought Hopkins role was particularly good and he was well suited to it.  Tom Hiddleston plays Loki, Thors brother.I also thought he was well cast as he seemed very much to be enjoying playing the role of the somewhat meddling brother, who always has something to say and another way of seeing things. Other cast members include Clark Gregg as agent Coulson, Idris Elba as Heimdall, Ray Stevenson as Vostagg and Jaimie Alexander as Sif.Yes this film is a bit silly and it does take itself seriously but I thought it was an entertaining watch. I'm no massive fan of Marvel comics per se but I can enjoy some film adaptations if made with good quality effects, cast and scripting. The effects and cast were all quite high quality and the camerawork was good too. The characterisation wasn't too bad either.Content wise, this film contains some mild sex references and partial nudity (such as scenes in which Thor is topless). There is violence present, although it isn't particularly bloody, if anything its more comic in style, with people, or beings, attacked by blades and hammers. There are some scenes which may be relatively frightening to young children, with the music played in the background and the effects used making it clear that things are perilous, although nothing graphic is shown. Language wise, some fairly mild profanities are used but again nothing very explicit. The film has a 12a rating to reflect this content.There is undeniably an amount of cheese present and I felt that, if anything, in one or two parts it was a bit too over the top, with loud booming/looming orchestral music pieces played, characters trying desperately to out wit one another with potentially worrying outcomes and the sense of doom is over done in my opinion but I did think that overall it was an adequately entertaining film, which was certainly mildly immersive and had its funny moments too.Yes I'd recommend this as an entertaining watch. It features a good cast, some decent characterisation, good special effects and decent camerawork, although it is definitely relatively cheesy in parts and a bit over the top. I enjoyed it in any case and I'm not always keen on such types of film."}, {"rating": "6", "text": "I recently rewatched this movie and seeing how thor is now the movie feels very strange to watch. his character is completely different. the movie is kind of cheesy but in a bad way (unlike Sam Raimi's Spiderman 1 and 2) and the villains are so forgettable and meh. Chris as thor is great and Tom as Loki is also great but the story is overall just okay and there is nothing really special about this film with the acceptance of a couple of things."}, {"rating": "8", "text": "I was surprised how much I liked the Norse mythology modern love story mash up.  Hemsworth is a very credible Thor.  His band of friends are fun to watch.  I liked the two congruent stories, on earth and in Thor's home world.  Anthony Hopkins was his usual credible self as Odin.  Anyone could have played the Natalie Portman part, but she was fine, nothing special.  Still, it was fun to watch.  I'm glad I did not see it in 3D because it was very dark at times and that is a recipe for disaster in 3d.  It was entertaining, light, did not take itself too seriously and was fun: great summer movie."}, {"rating": "9", "text": "I thought it was superb but then I was already a fan before the movie's release.  In my opinion the genius was in the casting.  Anthony Hopkins as Odin was a master stroke and Chris Hemsworth's version of Thor had just the right amount of pomposity without being too over the top.  I did think they missed a comedic opportunity with the Volstag character and took slight liberties with the storyline but those are  really only a minor complaints.  Overall Mr Branagh really captured the essence of the character which is pretty much all you can ask of a comic book recreation.  I left the theater wanting more.  Well done."}, {"rating": "8", "text": "What has made Nolan's Batman, as well as Favreau's Iron Man, movies so well-received has been because they have taken normal humans and had them rise into something bigger, making it more believable, no matter how outlandish.  So when I heard Thor would be included, as he should, in the Avengers saga, especially with his own film, I was admittedly concerned that there was no way to maintain the integrity established by Nolan and Favreau and retain the strong story and audience.  I was wrong.  While not a perfect film, I cannot imagine a better handling of this mythological story and have it connect to the world today as perfectly as Kenneth Branagh's Thor."}, {"rating": "10", "text": "Thor was so much better than I thought it would be. A lover of highbrow, thought provoking movies. Wow, this was so much fun!! I was worried about no substance, all action, etc. and yeah, it kind of is. But, come on it's science fiction and fantasy mixed and does a good job at both. What more could you want? Oh, yeah, the hottest guy to hit the screen since Brad Pitt. As a classical trained actor Thor comes across as a well educated, gallant, god of a man. Kenneth Braghnaugh combines the old and new with genuine laughs and only a few \" Oh, no\" groans at some cheesy lines. History buffs might me a little disappointed in the lack of backstories, but it finds it's way in in little patches. Hammer on God of Thunder!!"}, {"rating": "9", "text": "Yesterday night I had the honor of watching Thor, and if I had to describe the experience, I would day that I was geniunely impressed. Allow me to go through each key category in detail (without spoilers) to show you how impressive this movie was:Story: This film had a surprisingly good storyline to it. It wasn't exactly groundbreaking or even excellent in this area, but it didn't have to be. All that had to be done was for director Kenneth Branagh not to mess up. He didn't. 7/10Acting: This was the film's strong point. Each actor delivers a tremendous performence ESPECIALLY Chris Hemsworth as Thor and Tom Hiddleston as Loki. Loki plays out as a surprisingly complex character and Hiddleston steal every scene that he's in (no matter how briefly), however this movie belongs to Thor and Hemsworth assures that with his impressive performance. I also must mention Anthony Hopkins as Odin. Lastly, we have our (main?) villian, King Laufey, played by Colm Feore, who you should INSTANTLY recognize as the Lord Marshal from Chronicles of Riddick (They look EXACTLY the same). 9.5/10Visuals: Before I talk about visuals, I must mention that I saw this movie in 3D, and the only thing worth looking at in  3D is Natalie Portman, save your money and watch it in 2D. The CG in this movie was top notch, however, it's Asguard that shows the visual capabilities of this film and of film in general. Seeing Asgurd was when this film first impressed me, and it is a sight to behold.This movie is one of the best looking out there. 9/10Sound: Loud. 8/10 Action: Top notch. This wasn't some drunken editing hell like Harry Potter 7, this was fun, fluid action. The only problem is that there was less action than expected, and the biggest action scene happens around 10 minutes in. 8/10.Overall: This movie kicks ass, and does it in style. It again lives up to Marvel's high standards for Comic Book films. 8.5/10 (for Metacritic's sake, I'll round i up to 9)"}, {"rating": "10", "text": "I saw the movie. One word... Amazing. Branaghï»¿ captures the essence of the comic and delivers a film that could be a strong contender to be the blockbuster of the summe..."}, {"rating": "9", "text": "Great movie. Great balancing of action and comedy. It definitely is as good as Iron Man. Marvel proves once again that they are the only ones who can treat their properties the way they deserve. I wish there had been less Earth and more Asgard but overall quite a good and enjoyable movie."}, {"rating": "7", "text": "Based on the marvel character of the same name, this live-action movie tells the story about Thor, a noble warrior who gets exiled by his father Odin to live on earth amongst the humans. There, he meets a scientist named Jane Foster, who teaches him lessons as his brother plots to send out his dark forces and take over all of Asgard. It is up to Thor to regain his strength and save the two worlds.I caught the screening of this movie almost four months ago and enjoyed it. Now to my opinion.Bad: Some of the scenes have product placements like the 7-Eleven store, the Burger King soda drink, and it even had an IPOD mention. The story was lacking and the ending was too clichÃ©d.Good: The actors were very good at their performances. Chris Hemsworth was very compelling as Thor and he had enough screen time. Natalie Portman was a lot of fun as Jane Porter and she was very funny. Tom Hiddleston was entertaining as Loki and had a lot of talent and Anthony Hopkins was also entertaining as Odin. The CGI and the settings were pretty good and the action scenes were amazing.Thor may not be the best movie of 2011, but it lives up to its potential of the comic books with neat special effects, solid acting, and great action scenes.7/10"}, {"rating": "5", "text": "I love the super-hero movie genre and I love fantasy action. I didn't think this movie would be much and I was right. First off, I never felt Thor as a god but more of an arrogant jock. Even at the end, that feeling never left. Action wise, it was great four years ago. Here it all felt dated especially coming behind two Iron Man movies and Incredible Hulk. The story didn't do it justice. On the one hand there is Thor and the jealous brother Loki. This could have been better except it feels like they are stuck at 12 years old. On the other hand, there is the relationship between Thor and Natalie Portman's character. It was really forced and cliched. Not to mention a love scene put in for no good reason. Idris Elba's character was great and should have been givin more to do. Odin was also really good and the only \"god\" in the movie. Special Effects looked awsome but a pretty picture wasn't enough to pull me in. I know this movie is only to provide insight as to how Thor becomes and Avenger, but it could have been better than this."}, {"rating": "0", "text": "Pathetic movie. People rating this movie extremely high had to be drunk when seeing this film. First off the movie was no better than your typical Tv Sci Fi flick. The humor was uninspired as were the action sequences which all only lasted rougly 1-2 minutes. For Thor claiming himself to be \"THE MIGHTY THOR\" all throughout the film gee not much might was demonstrated. His great generic comeback sequence was over before it even began."}, {"rating": "9", "text": "A good job telling a very difficult story, both of my kids were on the edge of their seats for the battle scenes.  I thought the acting was good and look forward to seeing more."}, {"rating": "9", "text": "\"Now is the [summer] of our discontent.\" As pertaining to classically-trained Shakespearean actors starring in \"high-concept\" movies soon after the phenomenal success of  \"Jaws\", surely it was Alec Guinness, who may have first thought those words on the set of \"Star Wars\", playing Obi-Wan Kenobi, a film and role he utterly despised. If not for the great white shark that terrorized Amity Beach vacationers just two years earlier, which put an end to the golden age of director-driven movies, Guinness, who played Exeter opposite Laurence Olivier in \"Henry V\" and then the title role in \"Romeo and Juliet\", probably wouldn't feel impelled to go anywhere near a light saber or a wrinkly green Jedi. Thirty years later, \"selling out\" has a new name; it's called \"rebranding\". And so it goes. Kenneth Branagh, director of the much-ballyhooed \"Hamlet\", could conceivably have said, \"How did I come to this? I played Richard the Third,\"(it was actually Alan Rickman in \"Galaxy Quest\"), because even though Asgard is a long ways off from the Crucible Theater(where Branagh played the Machiavellian king), \"Thor\", conversely, is also a long ways off from rubbing elbows with the likes of \"Daredevil\", \"Ghost Rider\" and \"Catwoman\". So even though nobody who knows Branagh in his previous incarnation as an Anglophile would be in his right mind to give him \"five curtain calls\"(like Rickman's Alexander Dane, who plays the Spockish alien Dr. Lazarus in the \"Star Trek\"-inspired show-within-the movie) for dumbing down with a movies that was motivated by careerism, this high-profile booster of Shakespeare's plays, as a trade-off, has earned himself some hearty applause from the discriminating fanboy, who may be unschooled in the works of the Bard, but can name every superhero in the comic book universe. Unlike Arnold in \"Conan the Barbarian\", the audience is laughing with Chris Hemsworth, not at him. Personality-wise, the title character is more Dark Horse than Dark Knight. In other words, Branagh uses comic relief as a counterpoint to the obligatory action set-pieces, in very much the same manner as \"Hellboy\". You don't take Batman to a diner for food and drink, or \"sustenance\", as Thor puts it, because if the Caped Crusader smashed a glass to the floor, patrons would be heading for the exit in droves. Unencumbered by childhood angst, Thor takes his new surroundings in stride, sporting a convivial spirit you wouldn't expect from a man of the tenth century. The Norse god is also a known entity to the world at-large. In the Guillermo del Toro original, Hellboy is immortalized in comic books(\"They never get the eyes right,\" the red creature muses aloud), whereas Thor inspires Erik Selvig, Jane's mentor, to check out \"Myths and Legends of the Norse Gods\" from the public library. But this isn't your grandfather's Asgard. The capital city of the Norse gods is the gaudiest thing this side of \"Flash Gordon\". Appropriately enough, Thor looks like a prototypical tight end, a football player, as was Flash, a QB, who finds himself on the planet Mongo, making like Fran Tarkenton in the court of Ming the Merciless, because Hans Zarkov knew that nefarious forces could be behind an unexpected total eclipse of the sun and a moon gone rogue. Resembling Zarkov, she alone keeps chasing wormholes in the New Mexico desert, because both scientists on the fringe believe that science fiction and science fact could very well be one and the same. As a result, she is more willing to accept the existence of Asgard than her hypothetical-minded colleague. When Odin banishes his war-mongering son to earth, the mode in which he travels through the space-time continuum(the body itself as a ship) resembles the interplanetary trip that the television actors make in \"Galaxy Quest\". Since Eric acknowledges the Norse god solely in its guise as a literary figure, and not the Avenger of Marvel lore, a juxtaposition presents itself, in which popular culture is shown to have replaced literature as the stuff that fuels young people's dreams. Whereas Eric, as a child, believed in something he read in a book, the young fan in \"Galaxy Quest\" swears that the cheesy space opera, something he saw on TV, is real, a surrogate religion. For the alien envoy who confuses the show for \"historical documents\"(read: Bible), it's religion personified, going so far as remaking themselves in God's image. For Brandon, receiving the transmission from the captain is akin to being a prophet, doing God's work from earth while the starship captain and his crew do battle in the celestial heavens. \"Galaxy Quest\" works as a metaphor for the validation of Scientology as a religion. In \"Thor\", the god that figures prominently in primitive Germanic religions, is recast in a sci-fi setting, so when Thor and his friends manifest themselves on earth, the Norse creation myth is validated. It's \"Dianetics\" in disguise."}, {"rating": "8", "text": "Very entertaining. The opening sequence was obviously an homage to Lord of the Rings minus the 'epic' feel to it. I really loved all the Iron Man/Tony Stark, Hulk and The Avengers references. The emotional core of 'Thor' was surprisingly deep, it felt more human than the mechanical synthetic Iron Man 2. Loved the idea that a God can fall in love with a mortal woman. Chris Hemsworth is perfect for the role and has some really funny scenes walking around New Mexico as the God of Thunder (he's delusional to everyone around him). I'm more into the reality-based superheroes (Batman), but I really enjoyed Thor. If you've been reading the Marvel Comics than you'll definitely love this one. The only problem I had with this movie was the jumping between Asgard and earth, made it feel like it was two different movies simultaneously and not in a good way. Stick around after the end credits for an Avengers spoiler. The Avengers can't come soon enough, really excited for that one! Although this is no Batman Begins or the first Iron Man, it really works as an introduction of the God of Thunder into the Marvel Universe.Favorite scene:  very touching moment between Thor and his Mjolnir."}, {"rating": "9", "text": "When i first came across this film, i thought this was gonna be cool. I am a big marvel fan so i decided to see it. It was amazing!! The special effects were excellent! The action was amazing! The acting was good. I mean I had a great time at the movies! Overall awesome.\r 9/10"}, {"rating": "6", "text": "There is something very distinctive about Thor's character that was missing in this movie. He wasn't as arrogant as he should have been and way too sappy towards the end. While Jane's character did not add anything to the overall plot. Yes her Jane is a major character in Thor-lore, it was just superfluous in this instance. The movie is fun to watch though, i wish the battles were a little bigger. And what happened to the cry \"Have at thee .....\"?"}, {"rating": "7", "text": "It was an ok movie, but the problem was that it sold itself as an action movie, not the drama that I got. I will say that the characters had good chemistry and everything seemed to go well together. The main problem that i had with the plot was that they started it with WTF moment, and then explained with an hour long flashback, totally taking away the mystery factor that we were going to be presented with. Even though this movie had some major flaws, you must remember that this is merely a necessary step in the road to the Avengers movie. I certainly hope that Captain America will be better."}, {"rating": "2", "text": "Perhaps it's because I did not realise this was based on a comic before seeing the film, but I was just surprised by what this film ended up being. I'm not biased against comic book themed movies - in fact I generally like them - its just that the melding of ancient mythology, comic style and the 21st century seemed so odd. The story just does not stand up - in fact, it makes very little sense. The motivations of Loki were just incomprehensible and the transformation - seemingly in 5 minutes - of Thor from an arrogant war monger to a great leader and peacemaker was poorly done. The special effects in the film were impressive - but that's not really a plus these days, it's just a given - however, I thought the sound effects were poor, especially the continued high pitched 'electrical storm' sound effects that happened regularly. I found myself regularly wincing. Overall - not a film I would recommend."}, {"rating": "10", "text": "Exciting, captivating, visually stunning.These are just a few words that help sum up the superhero epic \"Thor\".The acting is sublime and the directing seems more than perfect, this is probably the best superhero movie made, sitting beside The Dark Knight of course!"}, {"rating": "2", "text": "By far the worst Marvel movie I have ever seen in my life... it was cheesy corny and im so glad i saw it for free because i wouldnt pay a dime to see it again... if you actually enjoyed this movie and is looking forward to thor 2 ....you need to recheck yourself."}, {"rating": "3", "text": "This is just another Hollywood film, taking an already established and respected series and converting it to a movie with no depth at all. The story is so simple and shallow, and after 30mins into the movie, anyone can predict whats going to happen. Arrogant heir calls for war against the frost giants, inadvertently disrupts the  weak truce, loses his power, meets and falls for local scientist, and through some apparent unknown reason, gets his power back through a valuable lesson and beats the bad guy. No originality here. The romance is weak, Portman and Hemsworth know each other for about 3days yet they are so smitten by each other and care about each other so much.  There was also no character development. We really don't know who are Thor's 4 companions are. Action scenes had good effect, but it was nothing too special, just a lot of CGI. There were many cliches in the movie and no suspense at all. It is very obvious who let the frost giants in. Overall, storyline was weak, no character depth, and most scenes became dull. If you are into an action movie with very little story, weak dialogue, and a very basic & simple lot, but with some average actions but good CGI to go with it, this is your movie to go. A disappointment as a movie."}, {"rating": "10", "text": "Thor is an okay film. I loved the characters, especially Tom Hiddleston's Loki. I loved the story and I really loved the action sequences."}, {"rating": "5", "text": "While Chris Hemsworth does a solid job and is charming, and his band of buddies is fun, the movie as a whole is just flat.  Way too much focus on the solely CGI \"other\" world, and not enough on the human (or superhuman) interactions.  Kat Dennings is terrific, but Natalie Portman's character just seems starstruck throughout, and she doesn't do much acting. Probably the best acting job in the film is done by Idris Elba as the guardian of \"the bridge.\"  The movie pales in comparison to  the best of the new generation of superhero movies - Batman Begins, Iron Man, and Dark Knight - but it is fun, and much better than the crap-fest that was Iron Man II. I'd say it's worth a look to acquire the knowledge necessary to watch The Avengers next year...."}], "recommendations": ["man_of_steel", "captain_america_the_first_avenger", "thor_the_dark_world", "fantastic_four", "avengers_age_of_ultron", "aquaman", "the_suicide_squad", "hellboy", "doctor_strange", "spider_man_far_from_home", "black_widow", "hercules", "ant_man_and_the_wasp_quantumania", "thor_ragnarok", "elektra", "oz_the_great_and_powerful", "rise_of_the_planet_of_the_apes", "indiana_jones_and_the_temple_of_doom", "fantastic_four_rise_of_the_silver_surfer", "superman_returns", "hulk", "bumblebee", "wonder_woman", "x_men_apocalypse", "fantastic_beasts_the_secrets_of_dumbledore"]}