{
  "id": 3608,
  "title": "Thoroughbreds",
  "starring": [
    "Anya Taylor-Joy",
    "Olivia Cooke"
  ],
  "runtime": 92,
  "genre": [
    "Drama",
    "Thriller"
  ],
  "description": "Two teenage girls in suburban Connecticut rekindle their unlikely friendship after years of growing apart. In the process, they learn that neither is what she seems to be, and that a murder might solve both of their problems.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pIxZzTfITqBpZxbIGsV01DcoHsT.jpg",
  "categories": {
    "plot": 6.833333333333333,
    "acting": 6.771428571428571,
    "ending": 6.461538461538462,
    "soundtrack": 8.5,
    "cinematography": 8.333333333333334,
    "familyFriendly": 3.0,
    "funny": 5.571428571428571,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "What the other reviewer fails to understand, is that this movie is ultimately about the (slight) transfer between personalities that the two characters undergo over the course of this movie... the characters in this movie shouldn't be considered to be relatable, and are quite frankly psychopaths, so congrats to NightReviews for not understanding the basic principles of analyzing a film whilst foolishly getting his personal feelings involved...Anyway, the actual positives in this movie are the performances (especially from Olivia Cooke), its quirky writing in the first half, and the interesting character study of both characters and their progressions in the movie (which are very subtle.) The direction is also surprisingly good considering it comes from a playwright who's doing this for the first time. Of course, this movie isn't perfect. Personally, I do wish that this was longer just so they could fill some voids in or maybe add more satisfying plot elements (this is somewhat unrewarding in the second half, however, the last few scenes themselves are quite good.) Honestly, I'll probably get around to watching this again within a few months... so yeah, I like this movie."
    },
    {
      "rating": "10",
      "text": "Thoroughbreds is a fascinating movie in a number of ways.  The cinematography is slow, patient, and at all times purposeful.  Never is a shot wasted in this movie.  The soundtrack is likewise intent on imbuing the viewer with a certain uneasiness throughout.  But the real star here (and no surprise coming from an adapted play) is the character study and superb scripting from Cory Finley.  At times approaching Juno (2007) levels of quirkiness, the writing also never fails to also feel grounded and real for the two central characters.  The entire story is very much the investigation of the relationship between Lily and Amanda, and the way in which their characters grow closer as they toy with the life-changing act of murder.  \"It doesn't make me a bad person, it just means I have to try a little harder to be good\" says the sociopathic Amanda, and in every scene of the movie, this is her driving philosophy.  She feels nothing - no guilt, no pain, and, tragically, no joy - and yet she constantly endeavors to do what she sees as right.  She confesses to faking her tears after the death of Lily's father, but it wasn't done out of any malice or in any attempt to manipulate her.  She did so simply to comfort Lily in her sorrow, even if she had none of her own.  The final line of the movie is a gut-punch, and I'll admit to at first feeling cheated by what felt like a flippant, unfair conclusion.  But the real (or perhaps just my understood) meaning hit me on the drive home.  I realized that the ending, much like Annihilation (another fantastic film I would recommend), and likely much like Hereditary later this year will be, deals with an inheritance of character, or traits.  Lily has effectively grown into Amanda - not actively evil, and perhaps not even actively good like Amanda.  It's a film that begs discussion - over Lily's abandonment of Amanda, over Amanda's sacrifice for Lily.  None of the events in the movie are fully black and white, and I think it's the realness and honesty that director Cory Finley maintains even through the ambiguity and uncertainty that really elevates this to something great."
    },
    {
      "rating": "8",
      "text": "This movie is done really well however the ending was lackluster. I wish there was a better ending than what happened but the whole movie and the tone of it was very excellent."
    },
    {
      "rating": "10",
      "text": "A darkly funny film that will gain an audience over time. Anya Taylor Joy and Olivia Cooke are fantastic actors and I can't wait to see what they do next."
    },
    {
      "rating": "6",
      "text": "Like many others I'm sure, I was intrigued by the trailers and the dark-comedic nature of their approach, as well as the fact that it was the wonderful (and sadly late) Anton Yelchin's final film. Unfortunately, the film fell short of my expectations. Many critics and reviewers have made comparisons to films such as 'Heathers', 'American Psycho', 'Heavenly Creatures', etc., and while their influence is definitely felt in this film, the overall premise and ideas in this film weren't taken full advantage of or expanded upon near enough in my opinion. On top of that, even the ending left me underwhelmed and disappointed. The only real positives that I can think of were the acting of course (Olivia Cooke, Anya Taylor-Joy and Anton Yelchin all turned in great performances as expected), as well as some of the creepy background soundtrack that fit rather nicely with the film's tone, as well as some of the cinematography/tracking shots that really were intriguing to watch. Overall, it's not without some of its unique and intriguing aspects, but for me, they weren't quite enough to make the rest of the film feel totally worthwhile for me."
    },
    {
      "rating": "5",
      "text": "I had high hopes for this film based on the trailers.  The actual film was just average, nothing memorable.  I left this film feeling that key pieces of the film were cut out and missing."
    },
    {
      "rating": "8",
      "text": "This was a lot better than I was expecting it to be. Genuinely really well directed, with an awesome score, awesome editing, writing, and terrific performances from Anya Taylor Joy, Anton Yelchin (RIP :/), and especially Olivia Cooke. A really good dark comedy"
    },
    {
      "rating": "1",
      "text": "When I learned that another neurotic coming-of-age narrative film was actually coming into fruition, written and directed by an actual post-millennial, starring the late Anton Yelchin in his final role, as well as Anya Taylor-Joy (The Witch, Split) and Olivia Cooke (Me, Earl and the Dying Girl), I could not contain my excitement. Thoroughbreds seemed like a self-aware, startling look into the world of over-privledged high school girls on the road to vengeance; with hints of Ingrid Goes West meets the precision of a David Fincher film. Yet, Cory Finley's debut feature is a puzzling step into a world of teens who are usually overly medicated, defiant and just plain bored.Thoroughbreds starts off very promising, borderline extremely interesting narrative teen angst film; showcasing the relationship between two very opposite and quirky teenage girls who have lost touch since going to high school (think quirk, a LOT of quirk). Amanda, played by the wonderful Olivia Cooke, admits early she is void of all feelings; proving her talents by showing Lily how to fake cry, in what she describes as \"the technique\", as well as how to not care about anything and how to defy everyone in her world. Lily on the other hand, played wonderfully by the porcelain beauty Anya Taylor-Joy, is an emotional high-schooler who lets the little wealthy nuances of her step-father Mark (Paul Sparks) and her inactive choices of her mother really crawl under her skin, pushing her to the point of no return, birthing an idea for a plan on how to kill her step-father.What began as extra money for Lily to tutor Amanda, quickly becomes a very awkward, strange and one-sided friendship based around the evolution of a plot to killing Lily's uber-rich step-father. Mind you, Lily and Amanda never really think what would actually happen if they did kill a human being, especially when one acknowledges the fact that they spend most of the film drinking his expensive wine; swimming in his luxurious pool and playing with his life-size garden chess pieces in the backyard; but hey, who am I to judge the semantics?When we first meet Amanda and Lily, Finely does a masterful job of capturing us in their web of natural seduction and arousal. Between the denim short-shorts, the summer dresses and low-hanging tops showcasing the young women's sultry and seductive assets, Amanda and Lily are two very attractive young ladies who are unfortunately plagued with what I like to call, a severe case of \"first-world problems\". Lily can't stand her step father's rowing machine upstairs, or the way her treats her mother, despite her relishing of the newly purchased tanning machine in the basement, or extravagant chef-inspired dinner dishes in the evening. Luckily for Lily, thanks to her newly rekindled relationship with her elementary school weirdo friend Amanda, who recently butchered her favourite riding horse in the family barn, gives Lily the idea and nerve to hatch a plan to kill Mark.Finely shows immense potential as a debut filmmaker. His natural use of getting the best out of his actors with his fluid direction and razor-sharp script, allows the talented young actresses hone in on their naturally seductive characters, mannerisms and nuances. Amanda's constantly witty remarks to justify herself to Lily never grow old; Lily's ferocious delivery of her ideas and counter-arguments to Amanda are entertaining as heck, and the two girls constantly keep the audience engaged throughout.Luckily, aside from Amanda and Lily, the last piece to the puzzle of murder and anarchy is Tim; a sluggish extremist who provides the film with its majority of dark comedy and humour, played mercifully by the late Anton Yelchin. Unfortunately, Yelchin was never able to see the film finished, due to a very tragic and bizarre vehicle freak-accident. Thankfully, Tim is the film's very emotional core; see-sawing between compassionate anti-hero, to logical irrationality, dabbling with hints of disillusionment and false promises. Yelchin has never been better as a battered and bruised stoner, idealist and ultimate dreamer.While I truly admire the bravado of Thoroughbreds, my final feelings for the films lies heavier towards the spoiled and pretentious spectrum of the scale. As a man who one day hopes to have children, it gives little to no hope for being a parent; giving the assumption that teenagers within the middle-class to upper-class realms of Western society, won't like the choices their parents make for them, and maybe just decide to do away with them, and kill them, or at least, think of killing them. I mean, is going to boarding school really  that bad, especially when you can't stand your step-dad but still need to abide and live by the rules of his lavish Connecticut mansion? Even when he is as robotic as RoboCop and seems more mild-mannered and polite as Pee-Wee Herman?"
    },
    {
      "rating": "9",
      "text": "An excellent re-imagining of the Sling Blade formula. **** step-father is ruining the main character's life, and the well-meaning friend with a psychiatric condition formulates a plan to do away with that person, sacrificing him/herself.  It works, and this is a fun version of that story."
    },
    {
      "rating": "4",
      "text": "This was the last performance by talented Anton Yelchin and the main reason I wanted to see the film. Although he's good as usual (and dark, which is a bit of a departure) he only has a supporting role. The story revolves around 2 mean teens, disaffected girlfriends who decide the kill someone. However, the dialogue is super-slow and crammed with extended pauses. There's certainly a dark touch pervading every moment, but it fails to engender much empathy or suspense. I found the whole thing dreadfully dull, wishing for snappy dialogue or a story surprise. (It was, appropriately, dedicated to Yelchin.)"
    },
    {
      "rating": "7",
      "text": "A plot more twisted than it originally seems. The film is very well-cast and the director and actors keep you interested even when at first you think you are simply watching yet another tired tale of life among the moneyed class."
    },
    {
      "rating": "8",
      "text": "A quirky and well acted film about 2 girls who have grown apart but begin to bond again over one's hatred of her step father. One, played by Anya Joy is by all accounts a well intention-ed, upstanding young woman whilst the other, played expertly by Olivia Cook is a bit off but likable. It is not for everyone obviously, it's a very slow film but no shot is wasted and the director does a fantastic job of ensuring a good payoff in the end. Definitely would recommend this movie"
    },
    {
      "rating": "3",
      "text": "So what's so great about this film?  Other than having some promising young actors (and being Anton Yelchin's last film), the plot features amoral, self-indulgent characters, none of whom had any redeeming features.  There's two morally flawed teenagers, one young drug dealer, a mostly oblivious mother, and a scheming step father.  Surely the two bright (but morally challenged)girls could have come up with a better way to get even with the step father.  I really didn't see any humor in the story.  Other than the interesting sound effects/score, there weren't many other pleasures."
    },
    {
      "rating": "7",
      "text": "An eccentric but irresistibly sophisticated film, although Thoroughbreds is definetly unconventional, it nevertheless captures your attention with its carefully constructed story, visual attractiveness and rather thougt-provoking concepts. It also playfully manages to switch tones without losing control of its twisted intentions."
    },
    {
      "rating": "7",
      "text": "Two upper-class psychopaths/ladies Lily (Anya Taylor-Joy) and Amanda (Olivia Cooke) reconnect their friendship after years of growing apart. Although their lives are almost polar opposites they bond over Lily's hatred towards her step father.Yes I went to see this purely for Anton Yelchin and I would have liked to see more of him but I wasn't prepared for how much I liked Thoroughbreds. Director Cory Finley gives us an unsettling and deeply disturbing piece of film. Although this one is definitely a slow burner all that tension building certainly pays off. Everything is there to unnerve you, from every single line delivery to the distressing soundtrack. Excellent, chilling and believable. Anya Taylor-Joy and Olivia Cooke both give eerie performances and together create surprisingly great chemistry. Recommended."
    },
    {
      "rating": "7",
      "text": "I don't find myself disappointed at all with this film, yet my opinion may sound like that. I'll elaborate.Thoroughbreds is what I would call a dark mistery and suspense teen drama that engages you pretty easily. The story is well written, it's interesting enough and it's pretty well acted by its two young lead actresses; Olivia Cooke and Anya Taylor-Joy, although in my opinion, Taylor-Joy's work was more captivating.Honestly I really liked the film, but I feel that it lacks attitude, it lacks brazenness, it wasn't sassy enough. And I say this because I'm taking into consideration the kind of story it's telling and the psychological profiles of the main characters. What they were planning and eventually where the film ends.Let's say that I felt the story wasn't willing to explore a darker side or deepen in that darkness, even though I admit that it could fall into cliche, especially with two female protagonists. I just feel the film owed me more in that regard but that's just a personal expectation.I've heard some people found it unpredictable but at least it wasn't for me. Beyond the fact that I wasn't sure if Taylor-Joy's character would end up doing what she did, it was evident that she was quite manipulative and parts of her resolution could be intuited.But again, my personal expectations have no relevance to what was delivered and Thoroughbreds is a good film, an excellent proposal outside the mainstream and a great option for any film lover no matter the day."
    },
    {
      "rating": "7",
      "text": "if not appropriately bred, certainly is electrifying..ThoroughbredsThoroughbreds; if not appropriately bred, is certainly electrifying and genuinely moving in its structure that is different than one's usual thriller-drama. The camera work and background score is horrifyingly uproaring and has an uncanny resemblance towards the feature \"Birdman\" in such technical aspects. The script is bold and revealing which is their \"in\" among the viewers and the makers being aware of it uses it wisely. The tone of the feature is rich, clean and visually pleasing where the credit goes to stunning production and costume design (even the sloppy characters in here are more poised than any other features). It's poignant premise that churns itself on background never changes a shade or let's it effect on screen and the reason being, the unbreakable if not practical, bonding of the lead characters which is light and breezy contrary to its premise. Anya Taylor-Joy and Olivia Cooke in their parallel roles are convincing as troubled teenagers seeking their characteristics through their own eerie perspective which is something to explore in here. Cory Finley is no short on execution and gets the anticipated vision on screen. The screenplay although gripping and layered, is somewhat hollow in its own creation which itches the viewers even after leaving the screen. Thoroughbreds is a must-see character driven feature that is completely dependent on the bonding of the lead characters and an attempt to grasp something beyond its reach (which is admirable) but unfortunately is all moot at the end of the line."
    },
    {
      "rating": "8",
      "text": "Anya and Anton played their usual indie film characters, but they fit really well into this setting. Anya has an especially intriguing character here that appears nearly 2-dimensional upon the first watch but really has some interesting developments and intricacies. I really enjoyed the use of still shots and the persisting, almost dubstep score and sound design. The ambiguity of the shots, things happening off screen, really added to the suspense and helped build up the confusion of the viewer. It is hard in this movie to distinguish truth from fiction, and many things are left ambiguous, is that our main characters are pathological liars. The film's portrayal of mental illness was an interesting perspective that is usually skipped over. This aspect is that it can be hard to come to terms with one's condition it even identifies it in the first place. The acting was stellar from almost every member of the cast, and I have completely entertained the whole way through. The use of background television and ambient audio offer quite the eerie vibe. The shot composition was relatively diverse and helped build upon the going paranoia of the characters. One of my main complaints is that Olivia Cooke's character really fell off at the end in terms of intellectual prowess. The mother of Anya's character felt poorly written, almost feeling unnecessarily oblivious. I feel this movie could have been more subtle when it came to a few plot details, as the way it handled the audience changed drastically, sometimes clueing into things, while other times having direct assertion if what had been shown. I would recommend this film to fans of horror films, dramas, or for people who enjoy Anton Yelchin, or Anya Taylor."
    },
    {
      "rating": "7",
      "text": "In his directorial debut, Cory Finley follows Martin McDonagh's distinctive combination of both violence and morality, and presenting them in a whimsical and cynical way. It's very clear that Finley is influenced by movies like The Shining, and that's not just in the visual way, like using bright colors, tracking shots,, etc, but also in terms of presenting the plot; the way Kubrick used in The Shining of showing and tell, yet never making every detail explained. And while here the risking of leaving some unanswered questions by no means reached the The Shining level, Cory Finley left a room for us to make some interpretations about some ambiguous minor details. The movie feels so flat and cold, and that really give kinda creepy atmosphere that is never avoid of irony and eccentricity. Also, this cold atmosphere matches the psychology of the movie's characters, specially Amanda (Olivia Cooke) who suffers a complete lack of emotion. That being said, this very atmosphere that was once supporting the movie, became very mannered and stilted after using it with and without reason. I think there was no need from sticking with this creepy tone after the main plot kicked off, and when the movie decided to delve into the character's minds. It seems to be a minor flaw, but it's effect during the viewing is very big. The movie's plot is genuine as well as the characters. Speaking of the characters, they are well-developed, and support the movie's message. Yes, this movie has a message! But the real surprise here is that the message about the friendship and empathy, and that they are instincts or gifts from god that seem to be faded from us, as humans beings.The Movie also suffers from using unnecessary allegories, and its final act, which leads to the ending, isn't as satisfying nor riveting as the rest acts.   In general, I think Thoroughbreds is a very unique take on this genre, and it proves that Cory Finley has a very promising career. I think he's gonna be one of the best horror/thriller filmmakers!(7.5/10)"
    },
    {
      "rating": "10",
      "text": "This is not for everyone but it’s one of the most intriguing films I’ve seen in awhile. Very dark, quirky, offbeat and different. Fascinating use of soundtrack and dialogue in its pursuit of understanding how emotion, relationships and power are subject to manipulation. Much deeper and darker than the trailer might seem. It’s brilliant if your tastes run in its direction. Not everyone’s taste will run in this direction, though."
    },
    {
      "rating": "8",
      "text": "Another one of those films where it is best not knowing too much about it before you see it to keep the experience as fresh as possible. For that reason, I am going to avoid writing about the plot and the rest. You will probably enjoy this if you are looking to see something different. Thoroughbreads is a nice blend of many things. It is funny, strange, a bit disturbing at times but thoroughly enjoyable. The characters are very well written and two lead performances are fantastic. Olivia Cooke and Anya Taylor Joy captured their characters perfectly and the chemistry between them is great. This is Cory Finley's directorial debut and it certainly does not feel like it since the film looks like it was shot by an experienced director. This is also Anton Yelchin last film performance before he tragically passed away and it is sad to see the great talent that the world lost. A film that I would definitely recommend."
    },
    {
      "rating": "8",
      "text": "A funny and well acted movie with unique music and good cinematography. I enjoyed this movie even more on my second viewing. It is short, to the point but does make you care about the characters. Definitely one my favourite of the year so far."
    },
    {
      "rating": "7",
      "text": "This is quite a dark film - thematically speaking and comedically speaking of course - its certainly dialogue heavy. It's quite atmospheric at times and it leaves you wondering what's going to happen when. It reminded me a bit of 'Cruel Intentions'. It features a good cast, although it isn't a particularly thrilling film as such, it has a slow plot pace and won't suit all. If this is your sort of thing then yes, it is worth seeing."
    },
    {
      "rating": "5",
      "text": "the premise for this dark comedy, while not new, seems appealling, but ultimately it falls flat"
    },
    {
      "rating": "10",
      "text": "One of my favorite movies. I think it is what made me love Anya Taylor Joy before split or queens gambit"
    },
    {
      "rating": "8",
      "text": "A first-rate dark comedy with first-rate performances. Anya Taylor-Joy and Olivia Cooke's chemistry shine over a really good screenplay."
    }
  ],
  "recommendations": [
    "20th_century_women",
    "blue_valentine",
    "21_grams",
    "closer",
    "the_rover",
    "nocturnal_animals",
    "secretary",
    "the_beguiled",
    "the_good_shepherd",
    "a_simple_favor",
    "black_swan",
    "walking_out",
    "the_place_beyond_the_pines",
    "ex_machina",
    "the_killing_of_a_sacred_deer",
    "the_devil_all_the_time",
    "arbitrage",
    "white_boy_rick",
    "stoker",
    "melancholia",
    "you_were_never_really_here",
    "anna",
    "phantom_thread",
    "legends_of_the_fall",
    "the_machinist"
  ]
}