{
  "id": 296,
  "title": "Thor: Ragnarok",
  "starring": [
    "Chris Hemsworth",
    "Tom Hiddleston"
  ],
  "runtime": 131,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy",
    "Science Fiction",
    "Comedy"
  ],
  "description": "Thor is imprisoned on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarok, the destruction of his home-world and the end of Asgardian civilization, at the hands of a powerful new threat, the ruthless Hela.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rzRwTcFvttcN1ZpX2xv4j3tSdJu.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.307692307692308,
    "ending": 8.0,
    "soundtrack": 7.0,
    "cinematography": 8.5,
    "familyFriendly": 6.0,
    "funny": 7.581818181818182,
    "action": 7.878787878787879
  },
  "reviews": [
    {
      "rating": "10",
      "text": "The third installment in the Thor trilogy is by far the best one. It's the most fun movie of the year, hilarious but also epic, filled with incredible action sequences, stunning visual effects and a powerful cast."
    },
    {
      "rating": "8",
      "text": "This movie was a whole lot of fun. Great action sequences, good music selection, genuinely humorous moments. It's the best movie Marvel has done. It's just a fun action flick."
    },
    {
      "rating": "9",
      "text": "Easily the best Thor film. Ragnarok changes key elements from the comics, includes a bevy of minor Marvel characters and adds a truly 1980s sci-fi look and somehow manages to make it all work."
    },
    {
      "rating": "10",
      "text": "Those complaining about the humor seriously need to watch more diverse films and look up Waititi’s films. The film utilized Gallows Humor. I know it’s probably unfamiliar with most people but Waititi’s films have all incorporated that form of humor."
    },
    {
      "rating": "8",
      "text": "Taika Waititi has brought us a film firmly set in the MCU while still putting together a piece of bold storytelling. It has a Guardians of the Galaxy feel but the way the comedy is delivered here is much more stripped down and less produced. Films like this will keep the MCU fresh. A-"
    },
    {
      "rating": "7",
      "text": "Changes a lot with the other Thor's movies. I didn't feel scared about Hela or de Ragnarok, fight scenes aren't bad as much. Another movie from Marvel but not another movie from Thor. A Guardians of the Galaxy movie but with only humor, 0 drama."
    },
    {
      "rating": "8",
      "text": "While this isn't close to the best marvel movie, its still a good one. With some fun humor, nice direction, and solid action, plus working as a stand alone film, it keeps the viewer entertained for sure. It struggles to break it's MCU problems though, like it's mediocre color palette, weak villain, and by-the-books plot, but Thor: Ragnarok is a nice superhero movie worth watching."
    },
    {
      "rating": "10",
      "text": "This is the only Marvel movie I have ever watched that I can honestly say deserves a 10/10. I think it surpasses both of the prior films. I've never been in a theater and heard so many jokes land so well and get belly laughs from the audience like this film did. Every scene was engaging and the execution was absolutely perfect."
    },
    {
      "rating": "9",
      "text": "Under the direction of New Zealand director, Taiki Waititi, Thor: Ragnarok is Marvel's most audacious film in their cinematic universe to date. Not only does it supersede the previous Thor films, but does so in the funniest and entertaining of ways. By far the most unorthodox character change within the Marvel universe, the new direction for Thor is pleasantly unique and sought-after, filled with Waititi's trademark humor and exuberance from start to finish. However, Thor: Ragnarok is more than just a comedic act. There are dark undertones that prevail throughout the core plot of the story, and the fundamentals of a superhero movie are all present. From the opening sequence, the action and visuals are on point, the quality never deterred for a second. And it has now become quite clear that Chris Hemsworth has embraced the role as Thor Odinson, showing off his comedic range and immediately making the character much more compelling than the darker and least fun of the Avengers that we were previously used to. In the film, Thor must prevent Hela (Cate Blanchett) from unleashing Ragnarok, the end of everything, and in doing so, must assemble a team to face her head- on and save the Universe because-as he quotes-\"that's what heroes do\". The \"Revengers\" as he names them includes the Hulk (Mark Ruffalo), \"his friend from work\", Valkyrie (Tessa Thompson), a hard-drinking former warrior, and Loki (Tom Hiddleston), the mischievous brother who no- one should trust by now. And it is not a Waititi film without an appearance by the man himself, which came in the form of Korg, a hilariously voiced rock-monster who was the champion of cracking a joke whenever he popped up. Waititi's style of filmmaking is palpable to the point where it becomes evident that everyone had so much fun making this movie, that is carried through to what audiences were seeing. This is why Thor: Ragnarok works so well and is so fun."
    },
    {
      "rating": "9",
      "text": "It's a really fun movie with a spectacular picture. The effects are also extraordinary, which gives you an agony, is that the film does not end and this, gives you a discomfort, gives the impression that the end will not come."
    },
    {
      "rating": "7",
      "text": "Thor: Ragnarok is a fun re-invention of the Thor film series.After the disappointing The Dark World, Marvel needed to get the next Thor film right. Chris Hemsworth (Thor) demanded the next film be more comedic and his character funnier, like Guardians of the Galaxy, and it shows on Ragnarok. There are plenty of jokes and running gags, but thankfully not too many as to drag the film down in parody (unlike the Guardians of the Galaxy films). Seriously the film is a joy to watch. A couple of laughs never hurt anybody.The action scenes are amazing and beautifully executed. From the gladiatorial fight between Thor and Hulk, to the fight against Hela and her army of the dead, to the air fight on Sakaar. Special effects abound, and we even see Thor finally mastering his power as the God of Thunder, after his Mjolnir hammer was destroyed.The story is complex but still quite predictable. The movie's plot is a mix of the Ragnarok myth (the Viking equivalent of the End of the World), the \"Planet Hulk\" comic book storyline, and a new enemy, the Goddess of Death Hela, who escapes from her prison and is hell bent on revenge against the House of Odin. After a series of events Thor ends up on the planet Sakaar which is ruled by the Grandmaster who organises gladiatorial fights for his pleasure. Thor has to fight against Hulk to gain his freedom. They both escape from the planet along with Valkyrie and Loki to save Asgard (and the Universe) from Hela's army.But the film's story features plot holes and logic inconsistencies, like, isn't Ragnarok too convenient to take advantage of while at the same time Hela happens to be on Asgard, raising hell (literally)? Still it's a fun movie to watch but I think Thor Ragnarok adds nothing new to the wider Marvel Cinematic Universe (for example there is no new Infinity Stone found) other than introduce the Valkyrie (possibly a love interest for Thor in the future films), the Grandmaster and a couple minor characters. Hela could have been a major enemy of the Avengers but she is no more apparently (you never know whether Marvel bring her back somehow, after all she's the Goddess of Death).All in all, I definitely enjoyed Thor Ragnarok even if it's not perfect. Go and see it, it's great."
    },
    {
      "rating": "8",
      "text": "I think it's fair to say that, of all the franchises in the Marvel Cinematic Universe, the \"Thor\" franchise, to put it short, is passable. While 'Thor' (2011) was a better-than-your-average introduction to the God of Thunder, many did feel that it didn't spend enough time showing him as such, instead they had to make him human in order for us to get to know him. I liked the spectacle, the emotion and the effort for it... it was an entertaining film, but nothing special. 'Thor: The Dark World' (2013) did have bigger action sequences, and more funny chemistry between the brothers Thor and Loki, but the comedy and final act dragged it down, and became forgettable and uninspired, but I still had some fun with it. So, it's easy to understand that with the third movie about the mighty God of Thunder, Marvel needed this one to be good. And, luckily, with director Taika Waititi ('What We Do in the Shadows'), it seems this franchise has been brought some life. 'Thor: Ragnarok' is easily the best chapter in this saga. It's vibrant, entertaining, action-packed, sometimes dark, and, to many's surprise, very funny. I know the word \"funny\" is odd, since the story of \"Ragnarok\" is meant to be dark and apocalyptic, but the humor does hit when it needs to. We see that Thor (Chris Hemsworth) has been imprisoned, still searching for those Infinity Stones, but as he returns to Asgard, he discovers that his brother Loki (Tom Hiddleston), the God of Mischief, has been ruling the kingdom and Odin (Anthony Hopkins) is nowhere to be seen. They discover that Asgard is in danger when they meet Hela (Cate Blanchett), the Goddess of Death, and sister of Thor and Loki (wasn't she supposed to be Loki's daughter? Then again, Ego was never meant to be Peter Quill's father...), who wants to rule Asgard and banish those who wrong her. Thor ends up on Sakaar where he meets Valkyrie (Tessa Thompson) and the Grandmaster (Jeff Goldblum), and he is told that he must fight in the arena in order to get to where he needs. His opponent happens to be the Hulk (Mark Ruffalo), which is seen as not much of a challenge for him. Thor tries to reason with the Hulk and manages to persuade him to help fight Hela before all of Asgard is in ruins. What makes this movie work is that it seems Chris Hemsworth has more fun in the role of Thor than in previous films. Thor has always been seen as the more \"boring\" Avenger simply because he is an all powerful god who holds a hammer. There's nothing more about him to make him sympathetic, only when he is rid of those powers, does he become interesting. Taika Waititi has a unique vision on the characters of Thor and the Hulk, they really get a chance to shine in this movie than previous ones. They are more interesting here, than before. Plus, the comedy is used effectively. Unlike in 'Guardians of the Galaxy Vol. 2' (2017) where the humor stretches beyond the first act, and the characters joke, even when they're in danger... here, Waititi only uses the humor when its needed. During the final battle, no spoilers, there is little-to-no joking around, especially when the whole world could end. Plus, the replacing of Kat Dennings with the charismatic Jeff Goldblum is also inspired... he is great as the Grandmaster, and I cannot wait to see more of him, if Marvel decides to put him in more upcoming films. Overall, this is a fantastic \"Thor\" movie, and it works because it ticks the boxes that the other two films forgot to tick. Hemsworth really shines as the God of Thunder, and the supporting cast all do a terrific job in their respective roles. It's funny... but not too funny. It's a blast."
    },
    {
      "rating": "8",
      "text": "Let me sum up Ragnarok in a few words:'It's that great moment when a studio like Marvel understood that we needed a comedy a-la Spider-Man (2002) (Aside from Guardians Of The Galaxy 2014)'. But really,getting out of Thor Ragnarok really made my day,because it was exactly the movie i wanted to see: (Ragna) Rocky,Action-packed,and mostly funny at times.Let's talk about the story...I was blown away. Not by how the story was structured,but because they somehow managed to transform the dark and gritty source material of the comics into a flat-out comedy in the best way possible. What they tried to accomplish in 2h 10m really gave me a huge smile on my face. Oh,and also because we're talking about Thor,which movie-wise,was kind of decent as a franchise (quite frankly). Don't get me wrong,i loved it,but there are some problems with the story. If you already saw The LEGO Movie,well,get ready,because there are so many jokes in this movie that at some point you won't even remember that you smiled. Another problem is Hela. While being excellently played by Cate Blanchett,i was almost going to call her Mrs. Exposition,given the fact that in some scenes it'll be just like The Mummy (2017),where you'll see stuff that sets-up something for another movie.The humor,as i said,was really great all around,and there wasn't a moment where i rolled my eyes or got bored with it. It was some solid humor all along. When the action kicked in,i was amazed by how those were choreographed actor-wise and created effects-wise. You even get to hear The Immigrant Song,which was used in the trailers as part of the \"Hype Engine\".And it was satisfying to see some actors (like Chris Hensworth and Mark Ruffalo) actually breath some fresh air (not the serious fresh air of the comics).So in the end,if you wanted to see a comedy that is really good and not The House or Rough Night,then this is the right movie. Thor Ragnarok deftly pays off itself with a great (mind-blowing for me) story,some funny hints at humor and some of the (not really) best action scenes of the year. And all of this comes out from a Thor movie,so i'm impressed."
    },
    {
      "rating": "4",
      "text": "This Thor is a deviation from an already deviated cb origins that MCU adopted on the predecessors. I'd say the forced injection of humor in the form of corky, fratboy stuff and bathos to instill the idea of FUN is used at the expense of something that could have had a bigger potential for fans who were expecting more post the vision in Ultron. It leaves you demanding more justice to the central character. Taika's humor might land well for those who follow his previous offers."
    },
    {
      "rating": "8",
      "text": "The short review: Starting wonderfully with surprising cameos, links to other Marvel Cinematic Universe (MCU) characters, and a great Infinity Stone-esque reveal, the film peaked at the Thor vs Hulk fight (not a spoiler) in the middle and did not rise any higher in the final act.Related media: I have seen all of the MCU films, but felt that the Thor films were never great. Thor was 3/5 and Thor 2 was 4/5.What's it like?: Packed with surprising things, was very funny, but the final act was sort of OK, not great.Pros: 1) The best part of the film was the Thor vs Hulk fight, particularly the part where Thor has to rediscover himself. 2) The film is super funny.3) The film started well with surprising cameos, links to other MCU characters and a great Infinity Stones-esque reveal.Cons: 1) The final act wasn’t as sharp, doesn’t completely make sense and wasn’t as funny. This seems to be typical of Thor films where the directors run out of ideas at some point in the films.2) Karl Urban’s character, Skurge, was poorly written and poorly acted.How would the the different age groups rate it?Children: (not rated for children)Teens: Average: ExcellentYoung adults: ExcellentMedium age adults: GoodOld adults: GoodRating: 4/5 (no half scores). It's worthwhile to pay to watch it in the cinema."
    },
    {
      "rating": "8",
      "text": "Thor – and Hulk after a certain amount of years since Age of Ultron's release to theaters – returns yet again with their latest Marvel adventure that Marvel Studios has bought for us. I won't – scratch that, I meant to say can't bother to say that this may be disappointing because it actually isn't in the movie's inner core heart. Fun enough to actually be called a new adventure that features lovable characters that gets treated as much as the plot actually does to make the movie feel brand new."
    },
    {
      "rating": "1",
      "text": "Cheap comedy with no real substance. Feeled walking outta a stand up comedy rather than a superhero action drama. But still best Thor movie till date. This movie adds to trash Guardians of Galaxy 2 came with. Captain America Winter Soldier still remains the beat MCU movie till date."
    },
    {
      "rating": "1",
      "text": "This might be the absolute worst movie I have seen since Star Wars Episode 2. Never have I seen a company or owner of an intellectual property treat not only the product this badly, but to treat its fanbase like this is astonishing. Marvel took the last decade or so of these movies we've watched and flush them down the toilet with this abomination.Nothing works in this movie, not within the confines of the movie, not within the confines of the narrative of the MCU. When did Thor turn into a stuttering, unsure dork? Why is Bruce Banner suddenly the stereotype of a Jewish guy from Queens? Did every single line have to be humor? Why did this thing have to exist!! It makes zero sense from start to finish. The end of Asgard was a foreboding moment in the age of ultron, one the audience knew to look forward to because of the Epic moments to come. RAGNAROK!!! We instead got campy Flash Gordon with a huge budget. I hated this movie with every fiber in my being. I feel betrayed as a fan of these movies. This epic narrative these movies have been building to is gone with this abortion. It's one thing to poke fun at yourself, it's another thing entirely when you poke fun at EVERYTHING you've done. Thor Ragnarok just unwound this entire franchise for me. The humor was forced, the \"effects\" were bad (The Hela fights were laughably bad. Like Matrix Reloaded bad). The Odin moment was god awful as was the Jane breakup. I don't say this often, but spare yourselves, don't go see this. Easily in my top five worst movies of all time."
    },
    {
      "rating": "4",
      "text": "Not bad by any means, it's still a satisfying conclusion to such a disappointing Trilogy. It's better than other awful 2 first movies. The comedy is good, better than Vol 2, which proves Waititi needs to direct GOTG Vol 3 instead of James Gunn again.Thor & Hulk have their best performances yet, Loki still shines. Valkyrie is break-out. However Hela is overhyped even though she's fine.The movie smashes Planet Hulk & some bits of Ragnarok into each other in a Jack Kirby-ized movie. It's messy in some parts as well.Overall, Finally a Good Thor movie but still Overhyped and Overrated. 8 / 10 (CBM Fan-Service)4 / 10 (Cinematic View)"
    },
    {
      "rating": "3",
      "text": "The only thing that saves this movie is the last 20 minutes because these things are taken seriously and you are left wanting to see what happens afterwards (I felt the desire to see Infinity War). If it were not for this the film would be bad for: Hulk and Valkyrie inescesarios (they contribute almost nothing to the plot), Hela appears little, the cameos did not like me, Loki very out of place making jokes, the music also out of place, many unnecessary jokes that ruin moments and CGI half fart. Even so, the movie can be seen and, as I said, the last half hour is full of action."
    },
    {
      "rating": "7",
      "text": "Those who love Nordic folklore will not enjoy the latest Thor much. I imagine they will feel it borderline sacrilegious. They should keep in mind that this is a Marvel comic books production with profit in mind.Thor is essentially a comedy with fantastical characters. In its favour, it is much much funnier than 99% of the comedies we've been forced to endure the last number of years. It's a tremendous spectacle with heaps and heaps of CGI , cosplay and in jokes. It doesn't take itself too seriously and that works here. The focus is on laughs and special effects. Purists will bleat but I think the die is cast for Thor . Jeff Goldblum's very funny comic side is on show here and will be a permanent feature for sure."
    },
    {
      "rating": "9",
      "text": "Taika Waititi takes Thor in a bold new direction that completely redefines the character. A smart move as his previous two movies have been among the most divisive in the MCU. What we end up with is more Guardians of the Galaxy than god of thunder. Only drenched in 80's neon flair and with a taste for heavy metal.The action is stellar and the sense of humor is the funniest this cinematic universe has had thus far. Waititi proves to not only be more hilarious than Gunn, but more imaginative as well. Ragnarok takes us to surprising new corners of the MCU. Every time I think the world of these heroes can't get any bigger another movie comes out that proves me wrong. Thor 3 is yet another example of that. The expansion on the Asgardian mythology is equally as impressive.The latest events Thor finds himself mixed up in are a lot of fun and filled with memorable characters. Ragnarok has a great villain in Cate Blanchett. Hela? More like hella cute. Tessa Thompson is no slouch either. This movie has the baddest women in superhero history onscreen. The brotherly love and rivalry between Thor and Loki is just as compelling as ever even if it feels like some ground is just being retreaded. What did they do to my boy Heimdall? Elba looking all old almost made me question if he is actually the sexiest man alive. Almost. Kudos to the movie for trimming some of the fat character-wise in the Thor trilogy. I mean, it adds it back on by the end but at least the new guys are much more interesting. Can't forget Karl Urban. So underappreciated as an actor.This is simply an absolute blast of a movie. Kudos to Marvel, Disney, and Waititi for actually bringing some change to the MCU and for finally doing something significant with the Hulk after leaving him in a sort of lame limbo since Incredible back in 2008. It only took them nine freaking years. Ragnarok stands out as the most original feeling entry to date. It's all so boldly done and stylish to boot.9.2/10"
    },
    {
      "rating": "8",
      "text": "This is a movie that's not afraid itself lightly, which definitely allows it to hit some of the most organic comedic notes in the entire MCU. I think the biggest plus in this movie was the pacing; the story isn't much better than \"a'ight\" on the whole, but I'm actually surprised in hindsight at how smoothly it breezed from the titles to the credits... The ups and downs are there, but with none of the jarring feeling that often happens with these movies.It's like the cinematic equivalent of being on a rollercoaster at zero G (in a good way.) It's also got some inventiveness to it in the third act—or maybe it was pulled from the comics, I don't know. Oh, and it has just the right Goldilocks level of Jeff Goldblum.   On the minus side, not crazy about Loki's character arc. Also, I'm guessing I'll need another couple movies before I can understand how this one has any meaningful impact on the wider MCU, besides the fact that Hulk can talk now."
    },
    {
      "rating": "8",
      "text": "It's rarely often that the sequel is better than the first film, let alone the third installment, but 'Ragnarok' is a pleasant exception of \"three is the charm\". Its emphasis on humour dilutes the melodrama that accompanies fantasy movies whose main characters have a British accent, and instead places more support on the fantastic chemistry between Chris Hemsworth and Tom Middleton, who is always the breakout whenever he gets a chance to play Loki. It also has a more dynamic villain and an ending without a ex machina that saves the day. The ending leaves as much doubt as it does hope. For a more comical entry, it also packs a heavier dramatic punch that first two."
    },
    {
      "rating": "7",
      "text": "It takes time to adjust to \"Thor: Ragnarok\"'s whimsical plot and humour, but once the zaniness settles, it's an entertaining and genuinely hilarious ride."
    },
    {
      "rating": "10",
      "text": "Funny from start to finish. Doesnt take itself too seriously, lots of kick arse action and a super battle scene between two huge Marvel characters. Also add in a superb sound track, with many of its songs now part of my weight workouts."
    },
    {
      "rating": "9",
      "text": "One Of Marvel's FunniestWho Would've Thought That A 3rd Thor Would Be A HUGE Improvement On The First Two!?"
    },
    {
      "rating": "10",
      "text": "This movie is way better than other 2. I loved it. Amazing writing and Planning and plotting was so clear. Heads off to 'HELA'. She is damn good."
    },
    {
      "rating": "9",
      "text": "the best of a group of very solid Marvel movies. Witty, fun and clever. The ending was kind of rushed but the film is well worth the hype"
    },
    {
      "rating": "9",
      "text": "Thor has got to be one of the least interesting Avenger (well maybe on the same level as Hawkeye) and his movies aren't exactly memorable with his second entry being one of the worst MCU movies. This third entry decides to take a vastly different approach and it works. Director Taika Waititi puts a lot more comedy into this movie and adds a lot more comedic personality to Thor. This really makes the movie a very enjoyable watch and some great moments.The plot is relatively simple in the fact that because of Loki taking over Asgard it has resulted in Hela a new threat trying to take over Asgard. Thor is sent to the other side of the universe and now has to rush back to Asgard to prevent Ragnarok. While many synopsis of the plot and even the title itself makes it seem like the stakes are really high. However, in the film it never really does amount to anything and watching it you don't feel like there is really any stakes at all. This is especially because of the fact that this movie is much more comedic and can be a bit jarring. You could go from Hela murdering people to a fun moment with Thor and it makes the plot not seem that important. The characters are great and fun to watch. Thor now has a much more lively personality compared to previous entries and there are some moments where we see more of his character. Still only \"some\" which is really weird considering the fact that his home is about to be destroyed and he isn't as panic as we think he should be. Chris Hemsworth is still a great Thor and while this movie does feel like more of Chris's personality than Thor it still feels natural and gives a much more fun movie to watch. Loki returns and is treated much more of a joke in this movie which leads to some great laughs but you remember that he was the threat that led to the Avengers to Assemble in the first place. Still he does have a pretty interesting character arc in this story and it works quite well with Tom Hiddleston still being an amazing Loki even for the laughs. Hela is the villain of this movie played by Cate Blancett and is the first true female MCU villain. Sadly, just like most MCU movie villains she is rather forgettable and underused. She only has one really cool scene and then is just typical villain of the day which is a shame as there was potential.The stand out of this movie is Valkyrie played by Tessa Thompson who is an amazing badass character and Hulk played by Mark Ruffalo. Valkyrie has a lot of great cool action moments and Hulk just steals the scene every time and since he can speak this time it leads to great moments between him and Thor. Though Hulk isn't in this movie for as long as you think he is which is a shame but understandable since this is a Thor movie still. Jeff Goldblum is the grandmaster with a lively personality and is great in every scene he is in and Karl as Skurge is pretty good as well with his own believable character arc though a relatively small role. Taika Waititi the director as Korg was also very funny as well. The best part of this movie is the amount of colour and design that goes into the sets. Clearly this movie took a lot of inspiration from Guardians of the Galaxy and it definitely shows, They both explore the cosmic side of the MCU and are much more focus on the comedy. The design of the sets though have a Jack Kirby feel to it and that is very fitting for the planet of Sakaar. The action scenes are also very good especially the Thor vs Hulk fight with its great choreography and comedic timing. The action scenes are much more memorable then Spiderman Homecoming and are much more enjoyable to watch in my opinion. The score while not super memorable, still does its job and led zeppelin \"immigrant song\" is a great song.Some critics say this movie sets a new standard for the MCU and I honestly don't agree with it. I think this is a really good movie and is most definitely the best Thor movie. However, it does have the feeling of a typical MCU movie. It takes many tropes that have happened in the MCU and amplifies it. This really worked for the movie and creates an enjoyable experience for us. This movie is what we loved about the MCU and that is why it was such a good movie. The fault for this movie is that it doesn't really go in a new direction and still has the common flaws of a MCU movie. Still, if you liked many of the MCU movies then you are going to really love this movie as it feels like a love letter to us fans."
    },
    {
      "rating": "10",
      "text": "just bought the blue ray of Thor Ragnarok. I've been waiting month to watch this for a second time and I've come to the realization that, it's \"perfect\" for me at least, heres why...The goodDamn near everything. It's so **** sci-fi and Metal! When I go looking for sci-fi stories this is what I'm after. A heroic tale, magic powers and space ships, an epic adventure, topped off with fun an interesting characters. Sprinkle on some emotional impact and you have my ideal sci-fi experience. TR had all those things plus amazing fight scenes, tons of humor, and visuals that were so GOD-DAMN beautiful each still could have been a painting. I mean Hole-ee **** do I need an art book of this **** movie! The women were so bad ass and I have to mention the guns on Tessa Thompson. She was Jack'd! and I mean that in the best way possible. This is going to get long if I talk about how great each individual character is so let me just say they range from good to great. Goldbloom was exceptional tho, had to be said. I think I covered everything. It's **** perfect. What more could anyone possibly **** want. I mean if you find yourself wanting after seeing this then you're just a greedy little **** and you should **** off some where and let people enjoy this perfect **** movie starring the perfect **** Tessa Thompson. Just go **** yourself, seriously.........there is one thing...The badThe CG on the hulk was a bit wonky. Barley noticeable , but after seeing what they did with those damn dirty apes I expect more.The uglyThere is none, **** off! This movie is **** perfect."
    },
    {
      "rating": "10",
      "text": "Thor: Ragnarok: After the last film Left Loki (Tom Hiddleston) in charge of Asgard disguised as his father Odin (Anthony Hopkins) whom he trapped on earth, Thor comes home to set things right. Thor (Chris Hemsworth) then finds out he has an older sister Hela (Cate Blanchett) who is the vying for the throne. Can Thor stop the usurper, take his place as the rightful heir and save Asgard from Ragnarok a prophesied destruction of both Asgard and all the old gods?The Good: Pretty much everything. Looking at the above synopsis one can easily imagine a dour grey family drama with lightning. (Heck one doesn’t have to imagine it just watch Thor the Dark World again.) Instead, we have a joyful, colorful action-packed film that is easily the most fun I have had watching a movie in a long time. It is pure joy. Too many things are perfect but a shout out to the use of Led Zepplin’s Immigrant Song and director Taika Waititi as super friendly rock monster Korg.The Bad: Nothing. Seriously nothing. Okay fine the use of Willy Wonka and the Chocolate Factory’s Pure Imagination is a little on the nose. There is also a realization while watching that not enough films have Jeff Goldblum in them… does that count as a negative?In Conclusion: Thor Ragnarok is simply the most fun I had at the movies this year. Dunkirk is a slightly better film and there are certainly more “important” films out there but this was pure joy. Imagine a comic book movie that felt like reading a comic book. What will they think of next?"
    },
    {
      "rating": "8",
      "text": "Spectacular visual effects, very good performances, fresh comedy all present in the Thor Ragnarok"
    },
    {
      "rating": "8",
      "text": "Out of all the MCU Movies, the Thor films have been the weakest in the bunch. However, Thor finally gets a solid film that does it's source material justice. 'Thor: Ragnarok' is a fun film that is very different to the previous. This isn't a really bad thing, but makes the movie awarkward. Thor and Thor: The Dark World had comdey in them, this film has a lot of comdey, and really didn't feel like a thor movie at times. Don't get me wrong, i'm with comdey MCU movies (Guardins Of The Galaxy), but jumping from different genres was a strange change. Besides that, the film was still funny and had awesome action scenes. However, with the jumping between two places with Hella, then back to Thor and the focus on comdey, it doesn't make this the best MCU movie. But anyway, this was one the best movies of 2017, and from this film, I have high hopes that the future MCU movies will be good!"
    },
    {
      "rating": "10",
      "text": "Thor: Ragnarok was a blast. This is now one of my favorite MCU movies. Also probably the funniest. Sorry, Guardians of the Galaxy."
    },
    {
      "rating": "7",
      "text": "good movie but it could have been great if it was serious with way less jokes, if you love the movie because it has a lot of jokes and because it does not take it self very serious, thats fine , i just do not.7,5/10"
    },
    {
      "rating": "10",
      "text": "Thor: Ragnarok reinvents the Asgardian God in a way that by the end of this film, he became from one of my least favorite Avengers to one of my favorites. This film simply focuses much more on him, his powers and the comedic talents of its star, which, combined with the dazzling visuals, the killer soundtrack and the powerful supporting cast leads to a nearly perfect superhero adventure."
    },
    {
      "rating": "9",
      "text": "The reason why people don't enjoy this film is because they just expect too much. You can't just have Thor doing the same thing over and over again. Right now he's taken on a different direction of character development but he is still the God of Thunder."
    },
    {
      "rating": "9",
      "text": "'Thor: Ragnarok' continues the upward direction of the 'Thor' films.I had a blast with this. I thoroughly enjoyed seeing the story unfold, the score is terrific, the new and old cast members are great and there's a lot of amusement in there too. It's superb, it's my third favourite MCU film at this stage.Don't get me wrong, I like the 2011 original but that's turned out to be the weakest of the three. I found 'Thor: The Dark World' to be a fairly major improvement on that, this 2017 is narrowly better than that aforementioned 2013 release. Bring on 'Thor: Love and Thunder'!Chris Hemsworth is quality in the lead role, I found him super enjoyable in this second sequel. Big fan of his new hairstyle, by the way. This is also the most I liked Tom Hiddleston in an MCU film. Jeff Goldblum, Cate Blanchett and, particularly, Tessa Thompson are fab additions. Shoutout to (director, as well!) Taika Waititi also, he made me laugh a fair few times as Korg.Great film, oh and I love the nod to a certain 1971 Quaker Oats Company-induced film... nicely done."
    },
    {
      "rating": "8",
      "text": "After the release of Infinity War, I had begun bingewatching all the MCU movies. And I'm not gonna lie to you. I wasn't feeling like watching this movie. After seeing Thor and Thor: The Dark World, I had taken the assumption that Thor movies are always bleak and lifeless. They always try to be serious when they can't possibly do it when they have characters like Thor, Loki and Odin. And so when it was time for me to watch this movie I was very reluctant, because I knew I can't skip it. But I'm glad I sat through this movie, because it was a huge improvement.The movie started out in Asgard, from the point where Thor: The Dark World left (and honestly the only thing I remember about that movie). The way that movie had ended, I had thought this movie would build more on Loki pretending to be Odin. But that ended immediately. Instead this movie focuses on Thor and Loki's estranged sister Hela, who had been abandoned by Odin at a young age. She easily manages to defeat both Thor and Loki and sends them to exile on Sakaar, with Thor reaching the planet two weeks after Loki. That was the part where the movie skyrockets the interest. I like everything about it movie from a cinematic point of view - the CGI, the acting, the comic timings, the story, the dialogues. Everything is absolutely perfect. I could undoubtedly say that this is one of, if not the best superhero movies which is not an origin story but rather a continuation of events. The comedy of the arc is the selling point. My favourite dialogue was the rock guy saying, \"I planned to start a revolution but didn't publish enough pamphlets so hardly anyone turned up.\"After Thor, Loki, Hulk and Valkyrie come back to Asgard to stop Hela we get the best CGI ever witnessed with Thor. I really like how his eyes glow whenever he has to shoot lightning. I always wanted him to be like that. Thor really had a very drastic character development. I know many people have said this - he lost his father, learnt about his sister, his friends were killed, his precious hair was cut by none other than Stan Lee himself, he continuously got taken down by Valkyrie and lost against Hulk, his entrie planet got blown up and his people encountered Thanos in space. And yet this was the funniest MCU movie yet. And not just Thor, every scene that had Loki in it was always interesting too.However, this movie was obviously not without its set of flaws. For starters the elephant in the room, the amount of exposition that was given throughout the movie was too much, with most of it never being mentioned any time afterwards. There was even a scene where Thor is explained everything about Sakaar on a virtual trip, but it was never talked about afterwards nor was it necessary. If it wasn't for this unnecessary padding of runtime, I'd have given it 10/10. The Planet Hulk arc was also quite unexplored from the comics, and it would have been great if they made a spinoff movie on Hulk also since Hulk has never been given a solo movie starring Mark Ruffalo. Then the biggest plot hole, Valkyrie electrocuting Thor also didn't make sense since Thor is literally the God of Thunder and he shoots lightning from his hands. And then when Hela pins Thor he gets the ex-machina of his father telling him about his superpowers.Thor: Ragnarok is an excellent MCU movie. It's kinda sad that this can't be enjoyed unless you've watched Thor: The Dark World and Avengers: Age of Ultron. Because it could have really been cool to show to someone who has no idea what the MCU is all about. It does have the good reward to it, since you can watch Avengers: Infinity War after it. And the tone of this movie is so flexible that even the grim Infinity War completely suits in being its sequel."
    },
    {
      "rating": "9",
      "text": "It's a THORtastic adventure, HULKed up with excitement, laughter, fun and a SKURGE of good times! There is nothing LOKI about it. You ODIN to yourself to take a ride with the VALKYRIEs for a RAGNAROK'um sock'um HELA good time. It's better than Wonder Woman and Geo Storm combined! It's so good you'll want to KROG about it!"
    },
    {
      "rating": "7",
      "text": "The Incredible Hulk isn't very Incredible.Edward Norton gives a good performance but the concept of Hulk itself just seems tired. There is no new outlook on the hero just simply a repeatedly mediocre take on a very one dimensiona"
    },
    {
      "rating": "10",
      "text": "This is the best Thor movie. It's very fun and it has a lot of great action scenes. Some very cool battles, too. We also see Thor at his most powerful so far in the MCU. The events of this movie significantly change his character. It's a very solid film."
    },
    {
      "rating": "10",
      "text": "Great and fun movie. With both great action and humor and jokes. Doesn't get bored even after watching It several times. I can 100 % recommend"
    },
    {
      "rating": "8",
      "text": "I really like Thor Ragnarok. Thor and Thor The Dark World are probably the worst movies in the MCU but Ragnarok was really good and my one of my favorite movies in the MCU"
    },
    {
      "rating": "8",
      "text": "Thor: Ragnarok may have picked up everything he had. The story is excellent, so is the soundtrack, the action is again in number one, and finally the mistake of previous films is not repeated here, and that is predictability. Overall, this is an excellent Marvel, which I can recommend."
    },
    {
      "rating": "7",
      "text": "i love itt yes finally we are back!!! best thor movie so far. it’s funny too. i love hela & valkyrie so much, great actresses"
    },
    {
      "rating": "8",
      "text": "One of it not the best entry into the MCU. With Guardians of the Galaxy easily the funniest.Getting Taika Waititi to direct was genius, bringing a freshess to the MCU that was much needed."
    },
    {
      "rating": "10",
      "text": "one of the best movies from 2017 along with cars 3 and transformers 5! i rate this movie a 10/10!"
    },
    {
      "rating": "9",
      "text": "The funniest MCU movie, although that sometimes comes at the cost of some potentially emotional moments."
    }
  ],
  "recommendations": [
    "thor_the_dark_world",
    "guardians_of_the_galaxy",
    "avengers_age_of_ultron",
    "deadpool_2",
    "the_a_team",
    "edge_of_tomorrow",
    "bumblebee",
    "the_suicide_squad",
    "captain_america_the_first_avenger",
    "thor_love_and_thunder",
    "indiana_jones_and_the_temple_of_doom",
    "kingsman_the_golden_circle",
    "ant_man_and_the_wasp_quantumania",
    "shazam",
    "hercules",
    "kung_fu_panda_2",
    "shazam_fury_of_the_gods",
    "incredibles_2",
    "justice_league",
    "terminator_genisys",
    "hancock",
    "ghostbusters",
    "thor",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "jumanji_the_next_level"
  ]
}