{"id": 3057, "title": "Thor: Love and Thunder", "starring": ["Chris Hemsworth", "Natalie Portman"], "runtime": 119, "genre": ["Fantasy", "Action", "Comedy"], "description": "After his retirement is interrupted by Gorr the God Butcher, a galactic killer who seeks the extinction of the gods, Thor Odinson enlists the help of King Valkyrie, Korg, and ex-girlfriend Jane Foster, who now wields Mjolnir as the Mighty Thor. Together they embark upon a harrowing cosmic adventure to uncover the mystery of the God Butcher’s vengeance and stop him before it’s too late.", "releaseYear": "2022", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/pIkRyD18kl4FhoCNQuWxWu5cBLM.jpg", "categories": {"plot": 4.575757575757576, "acting": 4.956521739130435, "ending": 5.75, "soundtrack": 5.0, "cinematography": 0.0, "familyFriendly": 5.666666666666667, "funny": 4.2631578947368425, "action": 5.6}, "reviews": [{"rating": "2", "text": "Nobody reigned in the director. It is a bad parody of a Thor movie.  When they got to the shadow realm I realized that we were in fact watching a what we do in the shadows movie rather than a marvel movie."}, {"rating": "3", "text": "Terribly unfunny, doesn’t take itself seriously even if it tries to and it just proves to me that Taika Waititi has been overrated from the get-go.This movie makes Multiverse Of Madness look like a masterpiece."}, {"rating": "2", "text": "I don't know what has happened to Marvel since Infinity War, but outside of No Way Home (which I still think was a little overdone), it has been a lot of shoddy work. This might be the worst of them and that is saying something considering that Eternals exists. The tone of the movie is all over the place and the humor mostly misses (or is something a 7 year old would find funny) . Everything just felt forced and they also turned Thor into a buffoon. The only redeeming quality to the film was the performance of Christian Bale. I think this is the last Marvel movie I am going to see - just a waste of $$$ at this point."}, {"rating": "2", "text": "This was written by adults with the mentality of seven year olds, for three year olds, and directed by someone that only cared about how many jokes he could stuff into it.  A four hour movie that was tossed into a blender and only two hours were poured out, without bothering to make them coherently connect.  If you can think, then almost everything in the movie makes no sense, especially the big threat which invalidates Infinity War/Endgame.  Typical MCU, where canon and continuity are not part of the FRANCHISE so nothing can make sense, and there are no stakes.  Jane's entire power explanation is laughably bad, and contradicts what Odin said in Ragnarock.  I guess Taika could not even remember his previous Thor movie...  But at least he will win the Oscar for the most useless exposition in a movie."}, {"rating": "0", "text": "I love Marvel movies but this one missed the mark by a mile. Only good part was the soundtrack. Two great Thor comic stories turned into the dumbest least funny movie Marvel has made. Thor 2 seems Oscar worthy by comparison and it was bad."}, {"rating": "0", "text": "This movie is awful, the jokes are to forced and showed down your throat, it doesn't have the balance between comedy and storytelling that Thor 3 had, the movie is to childish and never takes itself seriously, not even the villain, this is a movie for children, yet they choose to make a movie about the Gorr storyline, which is one of Marvels darkest, most dreadful storylines, the movie has tons of problem and I could go on, overall this movie is a joke."}, {"rating": "6", "text": "A movie that was enjoyable but far from perfect. At the same time I feel its certainly not the worst of the Thor movies sorry Dark World. Was interesting that Marvel didn't take the easy way out I was expecting them to with Jane near the end. Chris Hemsworth and Natalie Portman were great in this. Where the movie falls down is it gets very cartoonish with its humor there were some parts that made laugh admittedly but unfortunately a lot more parts that made me cringe and took me out of the story. Christian Bale did what he could with Gore but his arc felt a bit rushed and not fleshed out. Zeus felt like more of a punchline rather than a powerful god it was like the parts that should have been serious in the movie couldn't be as the movie was sort of stuck in cartoon mode. Overall there is certainly enough to enjoy in this movie but it struggles to balance humor with serious parts was great to see the guardians though."}, {"rating": "4", "text": "This movie is exactly what Taika Waititi wanted it to be: a complete joke..."}, {"rating": "3", "text": "Way overhyped. The movie has some nice bits but on the whole it was just more of the same, with excessively childish humour mixed with copious same sex references all over the place, which makes one wonder who the hell the target audience of this thing is. I definitely am not going to take my son for this one - was going to because were both fans of Ragnarok and Taika is the director there too. I'm not a conservative nut job and am generally open minded but I fail to see why sexual references (hetero or otherwise) need to be in a movie like this. It's just jarring. It could have been a much better movie had they just dialed down all the weirdness."}, {"rating": "5", "text": "Boring movie with an excess of jokes. There are two or three that made me laugh, but most of them didn't land. Natalie Portman and Christian Bale are underused, and the story isn't that engaging. Chris Hemsworth is fine, but he's not enough to keep you interested. I Taika Waititi saturation has finally happened."}, {"rating": "5", "text": "I’m honestly supremely disappointed, like exponentially so. This is easily the first genuine miss of Phase 4 for me. The movie is criminally unserious it’s a **** joke. Gorr knocks it out the park from the jump but as soon as the Marvel Studios logo rolls it’s all downhill from there, tonally. Thor and co. are written like an actual Muppets skit, complete with fighting literal Muppets within the first 10 minutes. Star-Lord gives this unusually out of character and frankly garbage pep talk to Thor that doesn’t really pay off at all when Thor recants it to Jane later in the movie.For the great execution Christian Bale gives Gorr, he does ZERO God-Butchering in this film outside of the 5 minute prologue. They literally find out about this guy from a space Fox 5 broadcast labeling him Gorr The God Butcher while cutting through slides of dead god bodies.Janes’ handling is great overall I think, but Marvel clearly cannot keep things interesting inflicting trauma on woman characters. Post-credit stuff was great though so I’m cautiously optimistic.Overall this movie felt entirely disrespectful to Thor fans, like a parody Monty Python-ification of the typical slate of MCU one-liners and gags. Decent action sets and rare moments held intensely together by Christian Bale alone don’t save what is otherwise the weakest entry of Phase 4 without a doubt and possibly my least favorite MCU movie of all time."}, {"rating": "0", "text": "Two hours of the worst jokes and premises the director could cram in. If you want jokes that constantly undermine every scene to the point were you stop caring about the movie then this sorry excuse for an entry in the MCU is for you."}, {"rating": "0", "text": "Taika Waititi you dropped the ball. Thor is very stupid in this movie.The movie is Way too silly. avoid. total mess. the movie fails when tries to be serious throwing you stupid jokes every 5 seconds."}, {"rating": "3", "text": "Absolutely love Ragnarok, but this just was so amateurish. No cohesion, the CGI is extremely bad and the story is just not interesting. Bale is awesome, tho wasted in a bad movie. The jokes are not there or at least not my cup of tea and the movie is so so SO cringy. Everything looked staged in front of a green screen."}, {"rating": "3", "text": "If seen as a comedy, this movie feels like a joke that its missing its \"second act\", it goes from the set-up straight to the punchline.But since the movie is trying to sell a dramatic story, you have to judge it for that, and it becomes plain terrible.Christian Bale is, by far, the best thing in the movie, but he is barely in it, in a movie that is clearly missing A LOT of footage, which also makes it incomprehensible at times.Hard to believe this was made by the same people that made Ragnarok."}, {"rating": "1", "text": "It feels like the sole purpose of the movie is to mock comic book movies and the fan group that loves them."}, {"rating": "6", "text": "Perhaps the biggest movie for Marvel and Disney this year, Thoe delivers another meh and typical movie. Highlights-Chris as Thor, Natalie is wonderful and a delight as Mighty Thor, Bale gave a 5* performance and supporting cast was great. Bad part? Way to choppy, editing was a mess, you could tell the movie was shot on a virtual set for majority of it and I could go on. Marvel is trending down and Disney needs to get their act together."}, {"rating": "0", "text": "This was hard to enjoy. It is a hodgepodge mess of humorless quips, rushed arcs and baffling conclusions. A story that given the comic books material should've been an easy evocative adaptation that delt with powerful human feelings such as love & grief instead becomes a stretched, dare I say tried addition to Marvel's expanding catalogue of recent misses. Not only is the bright color scheme biting but so is the poor set work. This should've been better."}, {"rating": "1", "text": "If you want jokes that constantly undermine every scene to the point were you stop caring about the movie then this sorry excuse for an entry in the MCU is for you. The people who like movies like this like them because they are able to completely turn off their brain to the point were all it's doing is keeping their eyes working. Yes, it really is that bad. You've been warned."}, {"rating": "5", "text": "As the MCU has been growing each film in its repertoire since Phase 3 has basically been chained to one another, for better or worse.While Phase 4 has been a mix that hasn't shown coherence. Neither in the movies nor in the Disney+ shows.With the exception of Loki, it doesn't seem like it's going to be very clear where this story is headed and Thor: Love and Thunder won't be the one to explain it to you.This is a story that stands on its own, but that has caused it to fall short in that regard and also fall short for the long run because it doesn't seem that it has any kind of usefulness in the grand scheme of things.I've never had a problem with the humor in the MCU, I'm not a sourpuss, but Taika Waititi turned this film into nothing more than a succession of gags that make of Thor a joke and all the other characters, have to follow his stupidity.Natalie Portman shines in her best moments, but her story arc is only a step for the climax and closure of Thor's storyline.Tessa Thompson is only there because the story cast her as the King of Asgard while once again Marvel wastes an excellent actor like Christian Bale on a villain who in the comics was epic, but in the film gets severely overlooked.Thor: Love and Thunder is colorful piece of work that functions more as a comedy than a superhero film and gets lost in the grandiloquence of its own conceit, while offering nothing for the character or the rest of the MCU.It's one of the weakest entries of the franchise and a major disappointment for the character.At the end of the credits we find the usual caption: ''Thor will return''. If so, what Marvel desperately needs to do is take him off Waititi's hands"}, {"rating": "3", "text": "Two hours of the worst jokes and premises the director could cram in... Not so much a lame and somewhat mediocre MCU entry but like an extended horrible 'Whose Line Is It Anyways ' special with actin sequences. Much blame will be spread around on how bad this film actually is..."}, {"rating": "5", "text": "Thor: Love and Thunder ends up haunted by it's predecessor and the successes of it's own director in Ragnarok. The idea of delivering an over-the-top, corny film as the best of '80s hard rock is a great one - it's a shame it left out the all-important melodrama that made the genre so unique to this day."}, {"rating": "1", "text": "Comically bad it borders on offensive. It's more like a series of lame SNL sketches strung together rather than a coherent movie. It feels like a parody of Thor: Ragnarok but without the depth or meaning. Each character is so one note and almost none of the jokes land. Watched it the first day it came out with a full cinema and no one even chuckled. Hugely disappointed as I am a fan of Taika's comedic style and what he'd done with Ragnarok, but I'm really struggling to find anything positive to say about this movie. There's nothing remotely funny or interesting about it, they should have left it at the trailer."}, {"rating": "0", "text": "another boring stupid Marvel movie that shouldnt even exist.... i would give it - 100"}, {"rating": "4", "text": "I mean, sure. Fine. Whatever. A big budget movie that feels like an episode of TV. Except you pay twelve bucks. Lady Thor has no big moments. She’s just a downer plot device. Bad guy, of course, has understandable motives – so he never ever feels like a threat. Every Marvel movie must now feature established hero teaming with children. I dunno – these movies became popular without pandering to kids. Increasing feeling of “what’s the point?” with continuing to watch these films."}, {"rating": "5", "text": "Love and Thunder is the result of trying to be funny no matter the costs - be it character development or even the plot. It has a few laughs, but nothing that would justify the lengths it takes to get there."}, {"rating": "0", "text": "First time in my life I've ever walked out of a film half way through.Every moment played for laughs, I just felt my heart sink every time something looked like it could be really cool, but then turned into yet another joke.Deadpool has more sincerity."}, {"rating": "5", "text": "Way to many jokes & most of them aren't funny unless your like 5 years old. The best part of the movie is Gorr even though he is barely in the movie."}, {"rating": "0", "text": "Langweilig....Lächerlich.....Enttäuschend....schade ums Geld und die Zeit...hoffe Disney setzt Marvel nicht genauso gegen die Wand wie Star Wars!!!!Alleine der Spagat ....wieso so ein sinnloser übertriebener Klamauk. Ein paar kleine Gags wie im ersten Teil wären doch OK gewesen aber Thor zu einer Witzfigur machen geht gar nicht..."}, {"rating": "0", "text": "I am absolutely gobsmacked at how bad this film is! When I saw the ratings were over 7 it still meant that it's not going to be best film but still enjoyable and entertaining. Well.... It isn't! This is the only film I have ever walked out on and that's saying something since I sat through the train wreck Eragon.The story is weak, the acting is some of the worst, the jokes are frequent but terrible, and the screaming goats get old reallly fast!It was so boring and it felt like it was trying too hard to be Ragnarok and it just wasn't working."}, {"rating": "5", "text": "I'm this fourth solo outing for the God of Thunder, Thor (Chris Hemsworth) joins forces with his old lover Jane Foster (Natalie Portman), who has now taken on the hammer of Mighty Thor, and King Valkyrie (Tessa Thompson) in order to defeat a new dark and sinister evil known as Gorr the God Butcher (Christian Bale). In total honesty, gone are the days where I'd become excited and overjoyed for the newest MCU film. In my eyes, the MCU's golden age ended with 'Avengers: Endgame' and it just hasn't been the same since. For the most part, we've been plagued with films that simply feel like obvious afterthoughts or expertly-written epilogue fanfiction at best, and this one is no exception. Riddled with an absurd amount of corny moments including but not limited to flying/screeching Taylor Swift goats, Thor riding his Stormbreaker axe like a witch on a broomstick, Thor caught in a jealousy love triangle with his old hammer MjoInir and his Stormbreaker axe and talking to them quite often throughout the film, random accents galore (Valkyrie now suddenly has a British accent and Russell Crowe's Zeus's accent is beyond silly, all over the place, and impossible to pinpoint), etc. The list goes on and on. Not even the performances can really save this one, as Hemsworth remains charming yet goofy to a fault in this one, and Bale's Gorr simply loooked and felt like a Voldemort ripoff. For me, the film's biggest standout star was Portman's Mighty Thor. Watching her carry the hammer and kicking ass was incredibly fun and satisfying to watch. The Guardians of the Galaxy also make a brief appearance at the beginning of the film that felt fun but mostly rushed and wasted unfortunately. Like I said before, the story and writing simply feels like fanfiction material at this point in the MCU and the stakes and emotions never feel as high anymore. So overall, while it's big, bright, and does have its fair share of enjoyable action sequences and a solid action performance from Portman in particular, this 'Thor' still feels like too much of a burnout like the rest of Phase 4 of the MCU has felt so far for the most part and is simply just a jumbled and corny mess."}, {"rating": "1", "text": "Add a review here for Thor: Love and Thunder, or submit with only a rating...I would say only one thing \"This is the death of Marvel!\" Missed stan lee and hope if marvel studios create something more relevant and logical."}, {"rating": "0", "text": "This was a weird movie.  It forces comedy and it works....sometimes, but an hour in you are like enough already.  Just get on with it.  Crowe was good, but Waititi  just got too full of himself and made into a slapstick disaster."}, {"rating": "1", "text": "The worst Thor movie so far.Joke after joke after joke, and its not funny.Thor is just a walking joke, but the females character are strong and cant do nothing wrong."}, {"rating": "3", "text": "Losing what was great about Marvel films. Writing and flow missing. A lot done that didn’t make sense in the end."}, {"rating": "2", "text": "Stupidity + Ruined characters + Disrespecting culture + No stakes = Thor: Love and Thunder You really know something is wrong when Star-Lord is the more mature character than Thor. Christian Bale was great though"}, {"rating": "5", "text": "Spoilers: If you haven't seen a marvel movie about a character who is corrupted by an ambiguously ancient evil that uses them for their own goals of destroying the universe in the last month, this movie might be worth a watch. Bringing back Natalie Portman just to have her be a former/current love interest and die so Thor learns a lesson feels like a misplay. Gorr as a character is utterly wasted and putting his quest tied to a universal threat takes away from what could have been an interesting revenge story that was teased by Thor and Eteri's interaction in Infinity War. Some of the 80s metal homages are cool but it's not enough to save the movie."}, {"rating": "0", "text": "Well then that was definitely a Disney movie. The woke is strong with this one. This is not the end, or the beginning, but definitely the movie that might get marvel sold to Sony."}, {"rating": "7", "text": "The movie is just ok. Visually interesting. Christian Bale gave a pretty great performance, Natalie Portman not so much, her lines felt forced and unnatural. Overall the movie just had too much comedy. I know Ragnarok delivered on the laughs but it was well balanced, this one not so much."}, {"rating": "8", "text": "I Had low expectations about the movie, but it was surprisingly good. Pretty good flow, great characters and a strong villan. Sadly they were not able to utilize the potential of Gorr, also many jokes were just bad and not even funny and at times it was predictable what will happen. Overall i was surprised  about the quality because as I mentioned I really had low expectations after watching spider-man last time."}, {"rating": "0", "text": "I know the target audience truly doesn't care about stuff like this, but holy shxt when is Hollywood gonna stop pretending Chris Hemsworth can act? He literally has nothing going for him other than Hollywood deciding that skinny white guys with abs is the Ideal. And before anyone thinks this is hateful: Hemsworth is fully aware of this and admits as such; it's why clings onto the only role he actually makes money in and only gets cast to get naked in damn near every movie he's in. Truly no talent, just vibes."}, {"rating": "8", "text": "The movie is hilarious at times, quite funny at others. writing is pretty good, and the plotline with jane foster is quite nice. (Mighty Thor as a name sucks, its just the dudes name, not a mantle). easily the best part of the movie was Christian bale as Gorr the god butcher, without going into spoilers, his story is amazing, his character is menacing and steals every scene he's in, his motivations make sense, and the prologue at the begining of the movie with him in it is great.my main issue with the movie is its jarring changes between the funny scenes and the gorr scenes, and the other issues that come with the movies rather short runtime. i feel the transitions of feel would have been fixed with something like a mere 3 minutes more of runtime. i feel that the jane foster plotline could have been at least a little more fleshed out instead of dumped into 2 minutes at act 3. tessa thompson's valkarie was underused as well, and an already great scene at the beginning of act 3 would have been much better if she was given even a scene of her own. Gorr also should have just had more scenes, would have loved to see him moreoverall, a great movie, best mcu project of phase 4 (fight me), though it could have been an amazing movie if its runtime were bumped up a bit"}, {"rating": "9", "text": "Great addition to the mcu, it aint perfect, but is is wildly entertaining (sometimes to much humour). Christian Bales performance really steals the show, but i wished they would have kept him on for more movies in the mcu. If you like the style from Thor Ragnarok, you will most likely enjoy this one too."}, {"rating": "8", "text": "It really leaned into stupid absurdist humor and I was totally here for it. Also appreciate Natalie Portman being way more fun as Jane Foster this time."}, {"rating": "8", "text": "I liked it a lot. Despite the fact that the film was supposed to be a comedy because of how the character has been treated lately turning him into a clown, it has drama, action and epicness... And a lot of love. The villain is well-constructed, his origin-to-end story arc is very good, though I'm sure comic book lovers will say he sucks. The scene with the empowered children was a perfect touch. Using Zeus for the issue of inclusion and progressivism was funny, not forced at all; and the thing about Korg makes sense because he's just rocks. The Jane Fonda arc... I mean, Jodie Foster... I mean, Jane Foster and what she did at the end was fine, and the scene with Thor was very emotional and deep. Taika Waititi definitely convinced me this time, he gave us a good installment.The mid-credit scene was very interesting, let's see what happens with Thor's future, and the post-credit scene was satisfactory."}, {"rating": "7", "text": "Thor L&T is a space viking experience with incredible visuals, sharp screenplay, wonderful performances, an amazing soundtrack, lovable characters and solid jokes. Unfortunately, these strengths are built on a foundation riddled with plot holes, subpar story elements, wasted characters and a sense of humor that seems to be over irritating to half of the audience."}, {"rating": "10", "text": "I didn't have high hopes for the movie, but I was pleasantly surprised. A powerful villain, fantastic characters, and a really solid flow. Sadly, they were unable to fully use Gorr's potential. In addition, many jokes were just terrible and not even humorous, and occasionally, the outcome was foreseeable. Overall, I was pleasantly impressed by the quality because, as I already indicated, after viewing Spider-Man the last time, I had very low expectations."}, {"rating": "8", "text": "Really wacky but really good. The main thing lacking in comparison to Ragnarok is that the chemistry between the cast mates isn't at the same level. Still, it's legitimately fun and the humor does land, they just don't knock the banter out of the park quite like they did in Ragnarok. Definitely would recommend. Also, you get the full Hemsworth"}, {"rating": "7", "text": "Not gonna lie your gonna laugh your ass off the whole movie. But same goes with Doctor Strange Multiverse of Madness there are certain scenes that aren't really necessary or in any way interesting. It' no Thor Ragnarok great but it will do. Would still recommend the fans watching it on cinema and Another thing both Chris Hemsworth and Christian Bale did a superb job with this movie."}, {"rating": "7", "text": "O que a expectativa faz com a gente né...Se o No Way Home nos prometeu tudo e nos entregou tudo e mais um pouco, e Doutor Estranho 2 nos prometeu bastante também e foi decepcionante (pra dizer o mínimo), temos aqui um filme que não prometeu nada. Apenas uma viagem espacial da cabeça do Taika Waititi. E bem, aí é subjetivo, mas pra mim, entregou na perfeição.Pra esse filme eu não tive a mesma ansiedade, comprei o ingresso tardiamente e até me descuidei e acabei lendo uns comentários do pessoal que tem acesso antecipado. E pelo o pouco que já li, me tirou qualquer hype ou expectativa. Acabei embarcando nessa história esperando ser apenas mais um capítulo dessa fase 4, apenas mais um episódio de um série da Marvel do Disney+, e, sob essa visão, acabei me surpreendendo o quanto eu estava curtindo cada minuto de projeção.Primeiramente, o filme é LINDO, sério. Pode ter algum CGIzinho ou outro meio mé, mas no geral, o design de produção e a cinematografia estão ESPETACULARES. A direção está bem competente também, não adiante, o Taika entendeu ESSE Thor do MCU e do que ele precisava pra funcionar nas telonas. Ouvi alguns comentários de profissionais sobre uma certa dissociação entre os momentos \"sérios\" e \"cómicos\" do filme, falando que faltou tato no diretor nesse aspecto. Bom, quem sou eu, mas sou obrigado a discordar, posso precisar de uma revisita pra avaliar melhor, mas a primeira experiência pra mim foi muito fluída, eu mal senti o tempo passar. Achei toda a narrativa muito bem amarrada e natural. Talvez uma ou outra piadinha que se estendeu demais, mas nada que mate o filme.Indo para os atores: de maneira breve, todos bem. Chris está obviamente se divertindo demais no personagem, ele virou o Thor, não tem jeito, já é da família (piadinha ruim, mas quem viu o filme vai entender*). Natalie Portman volta revigorada pra franquia, com um arco melhor construído e em um filme onde ele pode se soltar e fugir o arquétipo de \"mulher do protagonista\". E, um último que eu quero comentar, é Christian Bale; rapaz que personagem bacana e como o ator parece a vontade em interpreta-lo. Os trejeitos, o olhar, a voz, tudo convence demais. Novamente, parece que a palavra chave do filme é diversão mesmo, porque Bale transparece estar adorando voltar a fazer filme de herói (mesmo que ele tenho dito no passado que nunca mais faria).Bom, se não tem do que reclamar, porque não a nota máxima? Bem, não é só porque eu não esperava nada, que eu acho perfeito qualquer coisa. O filme é bom, divertido, enérgico e tocante. Mas é muito \"pouco\". Veja bem, estamos numa escalada no MCU, cada vez mais as histórias estão maiores e mais complexas. E quando digo maiores, é em tempo de tela mesmo. São filme que beiram 3 horas, série que passam das 6 horas. Aí chega num filme grande desse, menos de 2 horas é inadmissível e eu senti isso o filme todo. Thor PEDIA mais tempo de tela, Jane PRECISAVA de mais tempo de tela e o Gorr MERECIA mais tempo de tela. É tudo muito breve, é tudo muito \"fácil\", não existe uma escalada, uma montanha-russa emocional. Os personagens mal conversam direito. E é aí que eu entendo as críticas as piadas do Taika, afinal em tão pouco tempo, ele ainda um parte considerável pro humor (que eu gosto), mas que na hora de botar no papel e somar os resultado, acaba pesando demais.Por fim, é um bom filme, nível Guardiões 2 eu diria, mas muito pela minha baixa expectativa (talvez até por eu ter acabado de maratonar várias séries MCU do Disney+).*se não entendeu ainda assim, pesquisa o nome daquela atriz que aparecesse no final."}], "recommendations": ["shazam_fury_of_the_gods", "deadpool_2", "guardians_of_the_galaxy", "zombieland_double_tap", "minions", "thor_ragnarok", "baywatch", "black_panther_wakanda_forever", "zoolander_2", "pitch_perfect_2", "hancock", "kingsman_the_golden_circle", "the_twilight_saga_breaking_dawn_part_1", "dolittle", "the_a_team", "poseidon", "suicide_squad", "terminator_genisys", "the_cobbler", "the_green_hornet", "burn_after_reading", "the_men_who_stare_at_goats", "tusk", "deadpool", "justice_league"]}