{"id": 397, "title": "Thor: The Dark World", "starring": ["Chris Hemsworth", "Natalie Portman"], "runtime": 112, "genre": ["Action", "Adventure", "Fantasy"], "description": "Thor fights to restore order across the cosmos… but an ancient race led by the vengeful Malekith returns to plunge the universe back into darkness. Faced with an enemy that even Odin and Asgard cannot withstand, Thor must embark on his most perilous and personal journey yet, one that will reunite him with Jane Foster and force him to sacrifice everything to save us all.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/wp6OxE4poJ4G7c0U2ZIXasTSMR7.jpg", "categories": {"plot": 6.555555555555555, "acting": 7.105263157894737, "ending": 6.625, "soundtrack": 5.0, "cinematography": 4.0, "familyFriendly": 6.0, "funny": 7.0476190476190474, "action": 7.142857142857143}, "reviews": [{"rating": "10", "text": "Thor 2 is a huge improvement over Thor 1. Everything about this movie excelled my expectations, The action is truly epic, its a lot more brutal and darker. the Villain was done properly!! finally Marvel!! Malekeith is brutal, heartless, and a force to be reckon with, his personal bodyguard gave Thor some much needed challenge. Loki is brilliant as always, the movie rarely slows down and the action has a great pace, it has some cheesy moments with awkward humor, but does not distract from the overall experience. Thor uses all his powers and the effects are superb. DO NOT MISS THE BEGINNING CREDITS AND THE POST CREDITS SCENES.\r PS: dat shape shifting cameo, genius"}, {"rating": "2", "text": "This movie is terrible, I am really unable to understand how anyone likes this. From the antagonist to the main lead (they should've cast a slice of bread instead and still no one would've noticed), this isn't even half the movie that the first one was (which I actually liked). The movie is boring and really shows how overrated the marvel brand name has become."}, {"rating": "4", "text": "i guess this movie being bad or good completely depends on the person's opinion on the matter because it looks like everyone seemed to enjoy this movie; i for one disliked it; why you ask? because this movie failed to excite me or keep me on the edge of my seat; thor tries so hard to be intense, epic, and funny and the same time! what thor fails to realize though is that if you try to be funny then you ruin the intensity of the action youre trying to aim for; the epicness was cobbled down by all these comedic one liners the cast shouts out every 5 minutes; thats fine and all if youre trying to be a funny movie; but this movie is trying to get you worried about villians trying to take over the galaxy but when youre laughing the whole time, the worryment tends to fade away; case in point, this movie didnt know what it was trying to be; the movie spouts off in all sorts of different directions and fails to establish itself strongly in a style\r case in point, this movie failed to excite me, the villains were forgettable, the plot was uninteresting due to lack of explanation of whats going on; lack of character developement, lack of acting and attachment to the characters,this movie has so much going wrong with it\r the only thing keeping me from giving this movie a 0 was the CG effects and thor's brother; thor's brother was like the only character that stood out from the rest; he carried a persona and executed it well through his style"}, {"rating": "3", "text": "Liked the first one even with it's somewhat lackluster second half but Thor 2 isn't very impressive. The majority of the movie is people talking most of the dialogue isn't really engaging nor important. The scenes with Loki are the highlight as is the last fightscene but everything else is pretty bland. The rest of the fightscenes are boring and the while the villain, Maliketh is very intimidating, he along with most of the movie is pretty generic. Save your money for Winter Soldier, Days of Future Past and Avengers 2."}, {"rating": "7", "text": "Derivative as it is, a charismatic cast, witty dialogue and Loki saves Thor: The Dark World from being just a gala of special effects destroying the universe."}, {"rating": "3", "text": "This movie was more soap opera than action adventure and there was way too much comedy. All in all it was pretty boring with only 15-20 minutes of action. There is too much time spent on Jane Foster, Sif, Loki and his family issues, and the nutty doctor and assistant. One of the major scenes is stolen straight out of Batman and the final scene is silly to say the least. It was a major disappointment and even the end credit scenes were weak."}, {"rating": "3", "text": "Terribilmente noioso, film blockbuster con poche idee più complicate che complesse, con un cattivo che non fa paura, con una trama prevedibilissima, senza anima e senza emozioni.\rPersonaggi privi di risvolti psicologici. Da dimenticare il prima possibile.\rSi spera che Sir Philip Anthony Hopkins faccia altri film in modo da non chiudere la sua carriera cinematografica con questo film.\rSaccheggio maldestro di alcuni temi del Signore degli Anelli, film di tutt'altro calibro."}, {"rating": "3", "text": "This is my least favorite marvel film after Iron Man 3. The great villain is unfortunately completely wasted on this very dry, stereotypical, by the numbers film. There is too much humor, and even the action looks boring and uninspired. The final sequence is one of the worst of any action film I've seen. It feels like nothing of this matters, including the characters."}, {"rating": "5", "text": "Just like its boring predecessor, \"Thor: The Dark World\" is filled with heavy-handed sub-par action, dialogue, and performances. Probably the weakest series in the Marvel universe by far."}, {"rating": "5", "text": "It seem the movie is carried by gags and silly jokes. The final battle is literally mixed in with numerous gags. If that's your thing, then you will surely enjoy it.  But I wonder what this movie would've been like if the plot and villain were to fleshed out better, with better motivation, and dramatic moments were left comedy free. Oh well."}, {"rating": "10", "text": "This movie was amazing. The scale of the worlds was immense and the effects were amazing. The plot was also fantastic. Loki, as always, steals the show. But to be honest, the best part of the movie was the after credits scene. SPOILER ALERT: It contains a reference to the infinity stones, referring to the tesseract and the aether as two of the six. If you're a Marvel fan, then you'll be as giddy as a little school girl."}, {"rating": "9", "text": "I don't know why the movie was critiqued so harshly, but the movie was amazing. It was very funny, emotional at times, and had epic action sequences; I had blast watching it."}, {"rating": "10", "text": "I loved Thor 2 and so did the rest of my family it had some very very funny moments,Loki's scenes were all brilliant and the acting throughout was top notch and make sure you stay for the after credits scene!!! It sets up for the next films perfectly and I can't wait for the next marvel movies! Make mine marvel!:)"}, {"rating": "10", "text": "Went to see this with my family and we all absolutely loved it. My Dad is not a fan of superhero movies but he really enjoyed this and was totally surprised and pleased with the incredible quality and intelligence of it.\r Has a perfect balance of action and intelligent dialogue, the serious with humour, the celestial with family. A wonderful addition to the Marvel film universe and my favourite so far. A must see for anyone who wants to see a quality film you can watch and enjoy again and again.\r You can really tell just how much hard work and effort has been put into this film to make it the best it can be thought the whole of the film. The story is gripping and well told, the dialogue in every scene whether serious or funny is wonderful, the acting is superb, all the characters are interesting, believable and compelling. The locations and are just stunning!\r I can not praise this film enough, a must see film!!!"}, {"rating": "9", "text": "Big improvement in every way over the first one but not perfect yet.  The one thing I felt could definitely be improved on are the battles, I felt they were rather lackluster, especially the final battle.  The soundtrack, the story, the settings, and the costumes were very impressive, and this movie is much funnier than the first one but in a good way, the humor doesn't distract from the seriousness of the situation and helps keep the audience awake."}, {"rating": "7", "text": "A crammed cinema-going for the weekend is a belated diversion since not too much going on for the past month in the burgeoning Chinese market. The chapter one THOR (2011, 5/10) and the mega-amalgam THE AVENGERS (2012, 5/10) didn’t lure me into Thor’s fan base, but this sequel does boost the franchise’s morals by further intermingling the epic apocalypse between the vast Gods’ realm and the puny but ego-maniacal earth, saw it in its over-charged 3D version (nearly impossible to find a 2D screening nearby), THOR: THE DARK WORLD is a massive crowd-pleaser, terrific art production and the trappings of a Marvel vehicle, shrewdly fictionalizes the love-and-hatred bromance between Thor and Loki, which is much hyped as the dominant draw for this action-packed escapade.\r There is darkness before the birth of the universe, so as to against the plot of Malekith (Eccleston) to utilize an amorphous weapon called Aether to set the universe back into pitch-blackness, Thor (Hemsworth) has to team up with Loki (Hiddleston) to rescue his earth girlfriend Jane (Portman) who has been infected by Aether and being pursed by Malekith and his toadies, notably, a mutated fiend Algrim (Akinnuoye-Agbaje).\r Whiling the most entertaining part comes the polarized tenors of the Asgard kingdom and the contemporary earth, one is solemn, majestic, atavistic and Shakespearean (thanks to Kenneth Branagh for setting the tone in THOR 2011) and the other (this time the locale is an overcast London) is glossy, modern, farcical and doomed to be pulverized. The spectacles are generally gratifying and on a par with the earlier IRON MAN 3 (2013, 6/10) to say the least.\r Wonderful comic relief from the earthbound trio, Dennings, Skarsgård and Howard plus a surprising cameo by O’Dowd. Hemsworth and Portman are predictably playing the hero and his fearless girlfriend-in-danger default while Hiddleston easily grabs all the attention by influencing meatier character development, more ambiguous in his stance and a timely twist in the end can suffice to ignite fans’ passion to the next installment, or maybe a Loki-based spin-off which will be more intriguing and anti-trend in its own way. By any means it is a solid sequel which inherits the merits from its predecessor and put more verve into its gods vs. mortals contradiction, director Alan Taylor has well handled a hot potato, next step, sit and wait for CAPTAIN AMERICA: THE WINTER SOLDIER (2014) coming this upcoming April."}, {"rating": "8", "text": "To be perfectly honest a lot of the first half of this movie left me lost and not caring to know too much of what was going on, especially as the dark elves and their plans for world/universal destruction seemed more of a requirement rather than a plot with real motivation behind it.\r But all throughout the movie there's plenty of humor, Natalie Portman is a far better superhero love interest than Iron Man's Pepper Potts and when push comes to shove, Thor in action does remind me a lot of Superman (not just because of the cape). That's a personal preference of mine but the character and the movie stand on their own merit mainly because of the second half of the movie where the action is pretty well done and holds your interest.\r Not a fan of the shock/twist ending with Loki. Thought the ending would have been better with him left to the fate we all thought he succumbed to.\r But still, a good movie and a far better follow up to the first Thor than Iron Man 2 was to the first in that series."}, {"rating": "9", "text": "Better Than The First Thor Due to A Engaging Plot, Fun Characters, Humor, Action, SFX,  And More but One Thing I Though Was A Little Eh Is The Shoehorned Side-Plot Of Darcy And Ian (Her Intern)."}, {"rating": "10", "text": "I loved the first film and have been impressed to no end with the undertaking that Marvel Studios has taken with their shared cinematic universe.  \"Thor:  The Dark World\" is exciting, dramatic and, most of all, very funny.  Once again Chris Hemsworth and Tom Hiddleston prove that they were born to play Thor and Loki and Christopher Eccleston shows that he can make it as a dark, foreboding villain in the Marvel universe as Malekith.  From start to finish, I feel this sequel out-did the first movie and showed us exactly how comic book adaptations are suppose to be:  Fun, action pack and full of larger than life characters."}, {"rating": "10", "text": "Marvel was right. Marvel was right every time. No one knows how to make a movie with a marvel super hero like Marvel. This movie is awesome, epic and totally right. Chris Hemsworth is amazing. Tom Hiddleston is the better God ever. Natalie Portman keeps wonderful and beatiful. I would like to marry this woman. PERFECT MOVIE."}, {"rating": "8", "text": "Thor: The Dark World is not going to win any Oscars. But it's a solid movie  it builds well, Thor seems human for the first time, and the supporting cast is excellent. The pacing has been criticized, and I will admit that it's a slow build, but I can't think of any scenes I would have cut out.\r Ultimately, it manages to be about more than explosions and set piece battles, and rises above Thor 1, Iron Man 2 and 3, the Avengers, and certainly the last two Superman flicks to be one of the better comic book movies I've seen.\r Does it reach the heights of the new Batman movies? No. But it's sincere, and fun, and you'll walk out of the theater feeling good. And so far this year, that's been a rarity."}, {"rating": "7", "text": "A very fun and high energy movie. Kat Dennings and Tom Hiddleston is what really made the movie. Dennings gave such a great comic relief and glad that she has more presence than the first movie. Hiddleston as Loki is the best casting, I don't really think anyone can do better."}, {"rating": "9", "text": "I'm not sure why the critics reviewed this poorly, maybe I'm missing the point  but this movie had everything you'd come to expect from a great Marvel adventure. Great twists, \"did that REALLY just happen\" moments, fantastic action, humour, top notch visual effects and Asgard looks more impressive than ever. Ok, some of the acting is a little weak in parts but that's more than made up for by the rest."}, {"rating": "7", "text": "This movie was extremely well done especially considering it had to live up to its big brother, The Avengers. This movie was way more action packed and comedy filled than the first one.  In the beginning it did admittedly seem to drag on but at the 35 minute it began to really hit home. Personally I'm more of a Loki fan myself and anyone agreeing with me does get a fair share of Loki in this movie, supplying lots of comic relief and even some parody! I recommend anyone that enjoys action movies such as The Avengers, Iron Man or even Hulk to to go see Thor right away."}, {"rating": "10", "text": "Spectacular! Marvel once again shows its power in a flawless blockbuster, has everything a good movie entertainment can introduce ourselves. The timing  between actors and good script is the highlight of the film. And exploration of Asgard gave a special glow on the screen."}, {"rating": "10", "text": "Having read some bad reviews, I wasn't expecting much. But the film surprised me; it was funny and touching and emotionally engaging, without going for the overblown melodrama that it sometimes threatened to sink into. The action here is darker  Odin is crueler, Loki is angrier and more bitter, Thor too has difficulty accepting the mantle of kingship he is told to take up. The pace is a constant, only pausing to breathe when Darcy (who, despite what some said, was near-perfect) or Ian the Intern had a Moment, or for moments of comedy that made the audience in my cinema laugh aloud. Loki and Thor, however, remain the fulcrum on which the whole film rests, and they do not disappoint. Loki sidles and wheedles and bites out sarcastic remarks, and Thor counters them as naturally as the brother he would  to regain spits back. Malekith was brooding and serious (couldn't miss the nose, though) enough to fall the right side of \"camp superhero villain\".\rI was very, very impressed."}, {"rating": "5", "text": "For me, the first movie was more enjoyable. The Dark World has potentials but failed to deliver a convincing act and dialogue. The jokes are often on-point, but some are too much. The production is also a little bit all over the place and I can't really enjoy the one and a half hour spent seeing the whole movie. It did entertain me, but not to the point where I'd happily give out at least a  7 or an 8."}, {"rating": "9", "text": "Thor: The Dark World is a sequel that it's prequel is truly not worthy of. This movie is very entertaining, and had me on the edge of my seat the whole time! The only downside towards the movie was the attack scene on Asgard in the climax of the movie involving the Dark Elves and their spaceships. That one scene left such a bad taste in my mouth that I thought that the rest of the movie would be as bad, but it's not. This movie is one of the very few movies that can actually surprise me with it's story, and it went ahead to do so several time. There's plenty of humor, but it's appropriate for such a movie. A must-watch!"}, {"rating": "6", "text": "Seen it yesterday  very poor movie ,plot and very poor actor  I sometimes enjoyed some scenes  especially the big battles and thor sequences  but that's it  you will forget this movie very soon"}, {"rating": "4", "text": "the jokes in it are not funny. The movie starts  to get boring from the beginning. I heard the last few scenes are saved by the director of The Avengers, which are the only interesting parts in this movie."}, {"rating": "1", "text": "I liked the first Thor but this one was a total failure.\r The plot to this movie is as thin as an 80 Yr Old Pair of Underwear that has been worn by a homeless dude for the past quarter century.\r I mean thin. The beginning was difficult to understand. I even attempted to use closed captioning to get the drift of the beginning.\r The only redeeming features of the movie were Loki and the two subcharacters who worked for Jane Foster.\r It sounded like Chris Hemsworth just graduated from Woolloomooloo Grammar given his thick Aussie accent (which was not as pronounced in the first movie)."}, {"rating": "8", "text": "This movie features a lot of action and epic special effects. It is a good movie to watch.The ending is weird and hard to understand. Overall, this is a great film."}, {"rating": "7", "text": "Derivative as it is, a charismatic cast, witty dialogue and Loki saves Thor: The Dark World from being just a gala of special effects destroying the universe."}, {"rating": "10", "text": "this movie is awesome, all the thing in this movie are badass, I want more of thor and loki\rI give the movie an 9.5 out of 10................. the marvel cinematic universe is awesome"}, {"rating": "4", "text": "The first half of the film was very boring and did NOTHING to engage the audience. The film only really picked up just before Loki was broken out of his cell by Thor. Characters (apart from Loki) were bland and extremely boring, Malekith was terrible, the Aether just seemed like another Tesseract, his army were a little too similar to the Chitari for my liking and may as well have just been Storm Troopers and the whole \"turning the entire universe into darkness\" plot line seemed too cliché.\r Special effects were special. What was with the weird colour scheme used and the blurry backgrounds? It looked like something out of 300. Asgard still looked nice.\r I enjoyed seeing Loki and Thor team-up but Thor's action sequences on his own weren't that good. The final battle was a little too reminiscent of the IM3 final battle for my liking; Thor jumping into different worlds/Tony jumping into different Iron Man suits.\r So, this film is only really good enough because of Loki. If it wasn't for the character and his excellent portrayal by Tom Hiddleston, this film would most likely get a 3/10. If you want to know what happens in the film because you want to catch up with the Marvel Cinematic Universe, just read the plot online and maybe watch a montage of the best Loki moments in the film."}, {"rating": "7", "text": "Not quite as good as the first but still enjoyable. Malekith seems to get a lot of hate as a villain but I thought he was pretty cool. There IS a bit too much CGI but it's a superhero movie so what else can you expect? Plus, the movie sees the return of Loki, Marvel's equivalent to the Joker and he's more badass than ever before. There are quite a few laughs to be had as well as thrills plus, a teaser for the best MCU movie ever-Guardians of the Galaxy! I definitely preferred the first but I liked this one anyway. It's fun!"}, {"rating": "7", "text": "Thor: The Dark World is pretty to look at and while enjoyable too, Marvel brings us another Thor movie to pull us out of our seats. I'm like pretty sure the next installment could do a lot better though."}, {"rating": "3", "text": "Marvel Studios STOP ruining Thor for future generations! Just stop! Again we have yet another MCU title with no intelligent plot, a terribly weak villain and no character development. All comic-book lovers should consider boycotting these movies until Feige gets his **** together. Overall, this movie will be forgotten in T-minus one second."}, {"rating": "7", "text": "Underrated MCUmovie in my opinion, i actually like it more than the first thor movie. Once again loki was great and he was the best part of his movie. The villains were the weaker part of this movie but the story itself i thought was pretty good. I did not care too much about what happend on earth. good movie 7/10"}, {"rating": "9", "text": "Thor 2 is a massive improvement over Thor. be It the Story  Acting  Action or even the Direction  the Highlight of the Movie is the Chemistry Between Thor n Loki. Loved the Scenes between Loki n His Mom. the Movie is Action Packed. It has enough Humor n Seriousness packed in this one.\rThe only Flaw is that the Movie starts a bit Slow. Better than expected 9/10"}, {"rating": "9", "text": "The first Thor movie was good but the problem i had with that movie was that we barely saw Thor in action. So i was hopping Thor 2 would show more of Thor in action. And it did! Very action packed movie, good humor, dialog between Thor and Looki is excellent and the ending is awesome!!"}, {"rating": "9", "text": "Thor: The Dark World is packed with brilliant dialogue and humour throughout. The story itself expands greatly on the various characters previously met along with introducing a couple new ones. A brilliant film and a must watch to anyone who enjoyed the first film."}, {"rating": "7", "text": "Very entertaining. Lots of good action and decent effects. Don't expect much from the 3D, in that respect it was rather disappointing. But that money-making gimmick aside, it was a rousing effort. I've heard some complain about the lack of depth in the movie's villain, and a plot that didn't score high marks in the complexity department. I think most of us knew we weren't watching \"Tinker,Tailor,Soldier,Spy\". I think the movie could have benefited from a brief crossover with another superhero, but that aside, I definitely give it one hammer up."}, {"rating": "10", "text": "Thor 2 is possibly the best MCU movie aside from Avengers itself (possibly tied with Iron Man 1). It is a fantastic solo movie  that focuses on Thor and Asgard while also allowing for the existence of the rest of the MCU, unlike Iron Man 3 where everything else was ignored as if it did not exist."}, {"rating": "10", "text": "A fantastically great movie. If you've seen the original Thor, don't despair, this one's way better. If you liked the Avengers, this one topped it in my opinion  phenomenal graphics and score, a great ensemble of characters, Loki (ye old norse gods, I love Loki!), smart dialog and  the highest praise I personally can accord a movie  internal logical consistency. Fine storytelling, some real puzzlers left for continuity, but no extreme and clumsy cliffhangering. I'd go see it again right now if I could. Go spoil yourselves, this is the movie to see this day and month..."}, {"rating": "10", "text": "I found Thor: The Dark World to be a huge improvement over the first movie. Malekith is a believable villain, and he looks the part. But the real star in this film has to be Loki. Absolutely brilliant film and one of Marvel's better superhero flicks."}, {"rating": "9", "text": "Tonight, not even the gods are safe as Thor: The Dark World debuts in theaters. The second chapter (third if you count Avengers) of Thor’s story, The Dark World is by no means a perfect movie, but it really doesn’t need to be: It’s tremendously fun and eminently worthwhile, warts and all. If you’re already a Thor fan courtesy of either the comics or the first film, it’s a safe bet that you’ll enjoy The Dark World. Thor, at its best, has always blended epic gravitas with humor, so prepare to laugh  a lot. It’s a tradition that The Dark World embraces enthusiastically, from the awkward culture clash of inserting a Norse god into modern America to an epic battle that plays out like a mix between a boss level from the video game Portal and a Dungeons & Dragons teleport puzzle, and even an unexpected Chris Evans cameo as Captain America (sort of). The silver lining, of course, is more Loki. Tom Hiddleston is justifiably the break-out star of the last several years of Marvel movies, and his performance as the embittered trickster god in The Dark World is his best yet. We saw Loki begin to fray in Thor and unravel across Avengers; now, returned to Asgard and incarcerated for what is meant to be eternity, he clings to arrogant indifference over a profound pathos that surfaces only during a visit from an illusory projection of Frigga  though whether she’s a projection of Loki’s actual adopted mother or a figment of his own conjuring is never clear. As this is a Marvel movie, you probably already know to stick around through the credits for a bonus scene. The Dark World has not one but two stingers  the first after the film ends, and the second after the credits finish rolling  and it’s worth sticking around for both of them. If you’re a long-time comic reader, the second’s got a cameo on par with the reveal of the villain Thanos after Avengers. Thor: The Dark World may be a bumpy ride, but it gets its hero where he needs to go  from Prince of Asgard to hero of Earth  with grace, humor, and a lot of heart. It’s not perfect, but it doesn’t have to be: It’s awesome."}, {"rating": "7", "text": "Even if Thor 2 is not as god as the first one, it still one of the most entertaining movie of the year. Spectacular visuals and engrossing action mixed with mediocre plot and week villains."}, {"rating": "9", "text": "Thor: The Dark World is a step up from the first one!  I might be of the very few who enjoyed the first film and the sequel surely delivers more action.  Though the storyline is a bit complicated and with a post credits scene that will leave people scratching their heads, it's still great fun to watch.  Lots of laughs throughout the movie and a twist here and there.  The acting is top notch, especially from Tom Hiddleston as Loki.  Another great outing for Marvel at the movies."}, {"rating": "6", "text": "Thor 2 is easy to forget, with a predictable story and character not so charismatic. Sometimes can be a little bit boring, but have some good action scenes."}], "recommendations": ["avengers_age_of_ultron", "thor_ragnarok", "guardians_of_the_galaxy", "indiana_jones_and_the_temple_of_doom", "hercules", "edge_of_tomorrow", "the_suicide_squad", "ant_man_and_the_wasp_quantumania", "thor", "the_a_team", "poseidon", "transformers_dark_of_the_moon", "justice_league", "bumblebee", "jack_the_giant_slayer", "shazam_fury_of_the_gods", "kingsman_the_golden_circle", "black_widow", "the_three_musketeers", "dredd", "american_ultra", "jungle_cruise", "kung_fu_panda_2", "sherlock_holmes_a_game_of_shadows", "king_arthur_legend_of_the_sword"]}