{"id": 288, "title": "Those Who Wish Me Dead", "starring": ["Angelina Jolie", "Finn Little"], "runtime": 100, "genre": ["Thriller", "Action"], "description": "A young boy finds himself pursued by two assassins in the Montana wilderness, with a survival expert determined to protect him, and a forest fire threatening to consume them all.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/xCEg6KowNISWvMh8GvPSxtdf9TO.jpg", "categories": {"plot": 5.607843137254902, "acting": 6.076923076923077, "ending": 5.6, "soundtrack": 5.0, "cinematography": 5.25, "familyFriendly": 3.0, "funny": 5.0, "action": 6.333333333333333}, "reviews": [{"rating": "5", "text": "I'm one of those of the idea that as many movies as possible should get a theatrical release. This even before the pandemic.However, in recent years and especially with Netflix, we've seen a huge decline in quality.A lot of films are getting made, and because of how simple they look, we now consider them ''made for streaming''Something that worries me about the arrangement that HBO Max made to release the supposed great Warner movies for this year, is that this movie, along with The Little Things, and Tom & Jerry, are movies that seem made for streaming. Because it's hard to believe they were going to be released in theaters. Those Who Wish Me Dead has an overly simplistic story, and seems like an overly simplistic film.It takes a long time to start, and when I say this I mean action that requires nothing more than turning off the brain, because the characters are painfully hollow.The script tries to give a trauma to Angelina Jolie's character, but only to give her a little context, and of course provide her with dramatic arc while protecting the child, but there's only that.The villains are basically Storm Troopers.I mean, these do kill people, but they only hit the ones who don't matter.They shot a father in front of his kid, but were they good because they didn't want to execute a pregnant woman?They're fully disposable, and only a means to an end.There are many disappointing things in this film, and beyond the little entertainment it can provide, the oblivion into which it will fall will be overwhelming.And I say that for everyone involved. Including the viewer."}, {"rating": "4", "text": "Richard Roeper gave this dud a 100 score?  Are you freaking serious?  This movie was average at best.  There was zero plot, and zero explanation for two guys running around murdering people.  This movie made no sense at all, and it was pretty nonexistent as a firefighter movie.  This film has nothing on Backdraft.  Save your money and download a torrent for this one time watch."}, {"rating": "5", "text": "The entire diving point of the movie never gets revealed or gets any clarity. There is no shown resolution, there isn't anything that gets cleared up at the end of the movie. A lot of loose ends with poor writing and poor narration choices. Only the deaths of the two persueres where good but who they where and where they came from has zero clarity. Using the idea of explaining it in another movie is just lazy. You can explain and introduce an organization in a movie and expand on it more later. This doesn't desserve another movie"}, {"rating": "4", "text": "Knowing Taylor Sheridan wrote some of the best dramatic thrillers of recent years, I was anticipating a smart and possibly twisty actioner, despite the generic looking trailer. Nope. Sheridan looks like he embraced the thrillers of the late 80s, early 90s, like The River Wild or Shoot To Kill, without improving on them. So many cliches and tropes. Two bantering hitman. Check. Low level employee of some crimelord marked for assassination. Check. Hazardous worker (firefighter) dealing with past trauma. Check (causing nightmares that makes the person jolt out of sleep. Double Check). Pre-teen who swears like a sailor. Check. Heroine who should be crippled from  multiple injuries seems to be pretty much fine. Check. And so on and so on... The performances are good across the board. Although Tyler Perry did appear in such a small role, it looks like he stopped by between taping episodes of Meet The Browns. One scene, in particular, drove me nuts. A character is hiding from an armed gunman behind a tree that is barely wider than the character themself. In a sparsely wooded area during the forest fire finale. Why the gunman didn't just run up and shoot them...well..A film that you'll forget soon after."}, {"rating": "4", "text": "Angelina Jolie has NOT hit the wall. She still looks awesome up on the big screen. She oozes charisma and is by defintion a movie star.   But did I ever once believe her as a fire fighter/smoke jumper looking for a little redemption?  No. Bad script. Real bad CGI.  Cookie cutter pain-by-number bad guys who wear suits and ties into the forest. It was silly. But Angelina sure looked good."}, {"rating": "3", "text": "Never saw Anglina jolie as a good actors and she was one of the most overrated actress in Hollywood maybe because of her family or her Ex's Script is very weak , no plot , the director didn't  bother himself by so many details unexplained in the movie , definitely one of the worest movie in 2021"}, {"rating": "3", "text": "It was really good until the end bad writing great acting.... not worth the money it felt rushed and they just put ms Angelina Jolie for sales.  Watch on hbo don't go to the theatre"}, {"rating": "3", "text": "Movie sucked they did even tell you the damn secret ! Absolutely a waste of time so bad I made an account just to say this !"}, {"rating": "6", "text": "I felt that I have seen this move before. A fire 'personnel' has a traumatic past and must face a bunch of 'bad guys' that set a forest  on fire...nope, its not Firestorm, a 1997 action film...it's the plot of this movie, a star vehicle for Jolie that failed to 'ignite' the cinemas or the small screen for that matter. Cliched characterization and plot that was lifted from any Die Hard 'wannabe' but with 'less bad guys' to kill and maim.  And in the age of 'de-glamourized' actresses, lead by stellar performers like Charlize Theron, Jolie looked so out of place; hair flowing, looking as glamorous as ever in a 'gritty' film about 'fire jumpers'(?).  If you have HBO Max, then it's worth a watch while it's free. If you need to go to the cinema for this, don't bother."}, {"rating": "4", "text": "Total snooze fest! Hard to follow and dumb cinematography and story. Seemed they spent their whole budget on getting Angelina Jolie, which, she was amazing as always but very unconvincing in her character. She looks like a model but she’s a park ranger? Ok… woulda been better off hiring a fresh face and supporting her with a strong cast. Would not recommend this to anyone I know."}, {"rating": "3", "text": "Impossibly bad screenplay, performed by actors who are asleep, and some mesmerizingly beautiful shots of Montana. The lead is supposed to be a veteran firefighter, the kind who easily wears makeup during a firefighting drop, yet she acts like losing a civilian and a colleague in a wildfire is the most unlikely-to-ever-occur, blame-myself-forever event. The watchtower she inhabits gets struck by lightning the first day, destroying everything inside - you would think, what with it being an iron tower,  that would happen before and someone would invent a lightning rod by then? Her only means of getting out is wildly unsafe and even though she falls two stories, on her back, and communications are off, nobody thinks to check up on her. But don't worry, she gets struck by lightning later again, and she doesn't even get fuzzy hair. Like that time she gets beaten to a pulp, only to appear a little bit panda eyes smudged a few hours later. The lady who uses a spray can to pull the fire out of the fireplace and towards an assassin (who instantly knows she used a safe word when asking if the kid is hungry, somehow), doesn't get her hair singed even a little either. It is so, so dumb. Really, it's worth seeing just for the beautiful landscape, but as for the plot and the performances, holy cow, it's really bad."}, {"rating": "6", "text": "What was the last movie that anyone saw Angelina Jolie in? Maleficent from 2014? No one cared about the sequel to that, right? Well, she's back this weekend in the action, thriller, Those Who Wish Me Dead. This movie is following the Warner Bros. Strategy of a simultaneous release in theaters and on HBO Max. Let's see if you should care about Jolie in this movie.Those Who Wish Me Dead is directed by Taylor Sheridan, who wrote one of my favorite movies from 2016, Hell or High Water. There are multiple plot threads in this movie that predictably converge as these types of films do. Angelina Jolie plays Hannah, a smoke jumper in Montana who is dealing with a devastating loss in a previous fire. Finn Little plays Connor, a teenage boy on the run from the men who have been after him and his father. There are the assassins (Nicholas Hoult and Aidan Gillen) chasing after Connor and his father for some not clearly defined reason; and there is also John Bernthal, who is Connor's uncle, and his pregnant wife that get caught in the literal and figurative cross fire. The action moves them towards the vast Montana wilderness as a fire encroaches and Bernthal, his wife, and Jolie attempt to protect Connor.Those Who Wish Me Dead is nowhere near as taut or clever or fascinating or entertaining as Hell or High Water. Since the plot is really simple, even if the motivations of the characters are convoluted, the only hook there can be is whether you care about what happens to Connor. On a positive note, Finn Little is a good child actor. He makes Connor compelling and not annoying as many teens in these movies can be. Plus, Little has good chemistry with Jolie. The bond between Hannah and Connor is fast but believable. Ultimately, you want them to survive. I will shout out Medina Senghore, who plays Allison, Bernthal's pregnant wife. She's good and gets to have fun kicking butt while pregnant - the only other interesting cast member.Everything else plot-wise is just meh - it could be any movie, happening anywhere with any cast of characters. Just add a fire and you got it! It's like Twister except for tornadoes there is a forest fire and assassins after Helen Hunt and Bill Paxton.Speaking of fire - I really feel duped. I thought there would be more of the actual fire in this movie. All of the promotion really sold the fire aspect and it's so minimal. What we do get is fine, but ultimately disappointing. I don't even know that watching it on a big screen would make it any more impressive. Also, Hannah is a smoke jumper, but we don't get to see her do that! That feels like a missed opportunity and waste of Jolie's action chops.Those Who Wish Me Dead is an alright movie. There's no real hook here that make anyone need to run out and see it immediately. It's definitely not necessary to see in a movie theater. At best, it's a Saturday afternoon in the background kind of movie. Take a handful of popcorn and look up every now and then when you and the buds are playing cards."}, {"rating": "5", "text": "Посредственное кино, проданное под соусом триллера во время катастрофы, по факту оказавшееся проходным боевиком с Ларой Крофт на пенсии."}, {"rating": "3", "text": "There is a child in distress, there is an actor from game of thrones and one from walking dead, there is a fire and one bare foot of Angelina. And that's all."}, {"rating": "5", "text": "Movie had great graphics and the story line was pretty good. Very much predictable but not at all realistic. 1. MacBook unlocked seamlessly? 2. No cellphones? 3. Can you not see the fire? Angelina Jolie, if you are reading this I love you"}, {"rating": "1", "text": "Poor movie with weak storyline with q pointless ending.still don't know why they wanted to kill the boy.next thing the credits popped up.waste of my life .avoid"}, {"rating": "6", "text": "Not a huge fan of Jolie, but this movie definitely had enough going on to keep me invested. Don't expect a blockbuster, but it was definitely entertaining.Child actors can also really be hit or miss, but Little was easy to root for."}, {"rating": "6", "text": "A decent action thriller where the chemistry between Angelina Jolie and Jon Bernthal are fresh and highlighted throughout this film, however the film itself does not deliver any unique perspective to the action genre."}, {"rating": "3", "text": "Hopefully shot and edited under Covid restrictions. This 80s TV-esque film will have you asking questions like: Where in America are these character’s accents from? Did Michael Bay’s nephew do this with an iPhone? Was there a plot? Why does Sheridan film so many random cold-blooded homicides in his movies? Why are people ok with that? Is the beautiful American Midwest a place filled with random murders, missing persons, lawlessness, psychopaths, and unsolved murders? Does ghost fire really destroy the same as real fire? Watch this one while cooking dinner or cleaning."}, {"rating": "3", "text": "Reminds me of something Slick Willy and Hillary Hag would instigate using federal thugs to do their dirty work."}, {"rating": "0", "text": "The movie revolves around a plot hole that is never explained, and the plot hole's explanation is the only reason to keep watching. So maybe it's a good movie if you like getting psychologically cucked. Please give me my 2 hours back."}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "6", "text": "Those Who Wish Me Dead is directed by Taylor Sheridan who is known for writing Sicario and Hell or High Water. He also directed Wind River which is an amazing movie. So hearing that he is directed and writing a new movie with Angelina Jolie as the main lead sounds like a recipe for success. The premise is \"Still reeling from the loss of three lives, Hannah (Angelina Jolie) is a smokejumper who's perched in a watchtower high above the Montana wilderness. She soon encounters Connor (Finn Little), a skittish boy who's bloodied, traumatized and on the run in the remote forest. As Hannah tries to bring him to safety, she's unaware of the real dangers to follow: two relentless killers hunting Connor, and a fiery blaze consuming everything in its path\". So was one hell of a fire or a smouldering mess?Firstly, all the actors do a great job in their respective roles. Angelina Jolie gives a great performance as a person with PTSD. She delivers some dry charisma to a person who seems fed up with everything perfectly but is also able to deliver those emotional moments effectively as well. Finn Little who plays the kid is not a terrible kid actor, thank god. He felt really believable as a scared kid and was also able to give an emotional performance as well. The antagonist played by Aidan Gillen and Nicholas Hoult are also great. Aidan is still able to give that creepy yet charming performance while Nicholas was quite surprisingly scary near the end of the movie. The supporting cast also all do a fine job with Jon Bernthal still being charismatic and lovable in his role. The real stand out has got to be Medina Senghore who plays Jon's wife in the movie. She is the real badass and the real star of this movie. The biggest praise has got to be the cinematography by Ben Richardson. There are some gorgeous shots here that feel like it's out of a painting which is partially thanks to where it is shot. Ben does a great job with the lighting especially when the fire starts to come into play. He illustrates fire in a way that makes it look quite beautiful despite the situation of the characters. One thing that is brought back from Sicario is the wonderful gun shoot out scenes. They are gritty, grounded and great to watch still as it feels real. While it isn't an action movie, there is a great shoot out scene between two characters that are incredibly tense. Nevertheless, the plot and characters aren't that good. The antagonist who is trying to kill the kid is shown at the beginning to be ruthless. Afterwards, they seem to forget that they were ruthless and continue to do dumb decisions that involve sparing people or forgetting about certain people. One of the antagonists even says that \"they will kill anyone who sees their face\" but then they don't, which makes the line seem stupid. They also start a fire as a diversionary tactic but it didn't feel like there was much benefit to doing it. There is also a really dumb part in the story where Hannah (Angelina Jolie) and Connor (Finn Little) leave the watchtower to trek to town and even run past a field getting strike by lightning. However, they decide to go back to the watchtower because of a raging fire even though there are killers after them! My biggest gripe has got to be the plot device that the entire story is revolved around, what Connor's dad discovered. The antagonist work for some evil group and that group wants them to kill Connor's dad because he discovered something about them. The thing is, we never do find out what that is. It just feels like a giant insult that we don't even find out what it was considering the whole story is revolved around it. Likewise, the ending doesn't even completely resolve everything and feels a little empty. We don't know what is going to happen to our characters from now on or what the evil group is going to do since they are still functioning.Overall, the biggest reason why I liked Taylor Sheridan is not here. The writing is very weak and probably the weakest he has done. Still, if you can get past the weak writing then there is a somewhat enjoyable action thriller movie with impressive visuals. Just watch it for Medina Senghore, trust me she is the best part of this movie."}, {"rating": "1", "text": "Automatic downvote for Angelina Jolie. I don't think she can act and I don't find her attractive. She's just devoid of any talent and it detracts from any film she is in. I truly believe she has costed into fame on the tails of her father and husband; nothing more."}, {"rating": "7", "text": "This drama from writer/director Taylor Sheridan places a classic “escape the bad guys” scenario in the path of a fast-moving forest fire. Angelina Jolie stars as a smoke jumper who ends up helping a 12-year-boy elude 2 vicious killers. Jolie does fine, but that long hair and her glamorous demeanor interfere with acceptance of her as a toughie. More impressive is the performance by Finn Little as the desperate boy. Even though the plot hits predictable points, Sheridan keeps involvement solid, while creating some strong action beats. The raging blazes are especially impressive."}, {"rating": "8", "text": "An incredibly well-acted and directed action-thriller with a taut, exciting plot, two truly despicable villains, and a little bit of environmental danger thrown in for good measure. It won't blow you away and doesn't do anything terribly new, but shows how enjoyable the simplistic and straightforward can be when performed to such a high degree of quality. A cast of big name actors portray characters with traits and situations that make them sympathetic in a natural way to allow for a bit of emotion to flow throughout, but never to the point where things become mawkish. The setting is just as much a player in this as the stars traipsing around it are, and each confrontation with the bad guys or nature itself is delivered with a gut punch of realistic brutality that ensures things remain gripping until the credits roll. Plus, to top it all off it has a brisk, under two hour running-time making the experience quick, breezy, and easy to digest. Overall, leaving me very impressed with a movie I expected nothing from going into it."}, {"rating": "8", "text": "Overall, a really solid drama with great performances and pretty compelling action scenes."}, {"rating": "7", "text": "Nowhere near as raw and as potent as co-writer/director Taylor Sheridan's previous effort \"Wind River,\" \"Those Who Wish Me Dead\" leaves much to be desired in the structural/pacing department, but it's still a couple notches above what I'd consider \"sophomore slump\" territory. As with other efforts in Sheridan's filmography (both as a director and a screenwriter) the set piece design and gunplay are intoxicating, featuring numerous moments where both the tension and the audience's expectations are toyed with marvelously. All of the narrative parts work here as well, but only really on their own. Where things get messy is in the confluence of all these different story pieces, namely the fact that the crux of the narrative - a friendship between a woman and a child - remains the most underdeveloped facet in question. None of these pieces are necessarily bad or poorly executed, but the divvying up of screentime between each plotline felt a little off to me. Wouldn't surprise me to hear that there's about 10-15 minutes of this movie that didn't make it past the cutting room. Maybe they should have. In any event, the final product makes for a decent, rainy day watch, but that's about it."}, {"rating": "7", "text": "Its not Wind River or Hell or High Water but its a nice throwback to some of those natural disaster movies from the 90s. It shows Sheridan's continued talent as a director and is a perfectly solid vehicle for Angelina Jolie."}, {"rating": "8", "text": "I really enjoyed Those Who Wish Me Dead. Angelina Jolie gave an outstanding performances also Finn Little, Medina Senghore, Jon Bernthal, Aidan Gillen, and Nicholas Hoult gave great performances. The visual effects were phenomenal, really authentic looking. The makeup and hairstyling was excellent especially on Angelina Jolie."}, {"rating": "9", "text": "This was a really entertaining, serious and artistic film. The plot was intruiging, and the suspense kept throughout. And the backdrop of the american great forests was a superb setting for it all to take place. Well done to all involved"}, {"rating": "7", "text": "Seriously bland story and writing.  Some great scenery.  Some amazing supporting actors.  I was blown away by everyone except Angelina...Worth watching."}, {"rating": "8", "text": "Surprisingly good. Not a big fan of Angelina Jolie but it was a solid action-thriller."}, {"rating": "10", "text": "The film is an old school thriller, one could say this is Angelina Jolie’s Cliffhanger. Taylor Sheridan directs and helped adapt the script for the big screen. You should definitely watch it, I promise you will enjoy it!!"}, {"rating": "10", "text": "I loved this movie! My family and I didn't get up once. Which is a big deal for my bunch. We enjoyed it very much. Highly recommend."}, {"rating": "10", "text": "This is a great movie. Most definitely worth the watch ! It is my hope that they will have enough sense to make a sequel."}, {"rating": "7", "text": "This movie surprised me in a good way.  Kind of anticipated the plot, but the effects were genuinely scary, the characters were believable, and all the acting excellent.  Especially liked, the tone - all the characters and the director took the drama seriously - no winking.  You can feel the commitment to the product throughout."}, {"rating": "10", "text": "Refreshing. The transitions and scenes with Angelina dealing with smoke and fire. The capture of that essence. All performances done without a stunt double."}, {"rating": "8", "text": "Great film but with lots of unanswered questiouns. Kept me on the edge of my seat as it was full of tension and action packed scenes!"}, {"rating": "7", "text": "Those Who Wish Me Dead was entertaining, but it could have been better. It reminded me of The Accountant (funny thing is that Bernthal is the assassin in that movie) but without the Batman-like action sequences. A forensic accountant discovers something he didn't have to and now he's in danger, but instead of going to a journalists and making everything public, he puts other people in danger by taking his problems to his brother-in-law-soon-to-be-father and the assassins discovered that by just looking at a picture on the wall (how convenient) and the accountant's plan goes to hell, he dies and thanks to him other 2 innocent people. I don't know how is the police in places like that, but they are not that good and not enough. Sheridan used Jon Bernthal again as the sweet guy that has a beautiful relationship with his partner and later dies. It broke my heart because his wife is pregnant and their daughter won't have a father. Medina Senghore stole the movie! She was so badass! More badass than the freaking Punisher and Angelina Jolie. Jolie's character story arc wasn't that interesting, she feels guilty for a big mistake in the past and spends all the movie crying because of that and the kid was the way to redeem that mistake. Hannah had superhero powers or something because she survived a fall and a lightning strike with no medical intervention! Finn Little great actor, he delivered every single line and emotion, he has a good future as an actor.The assassins end up being dumb as always and that's why they didn't win. I love that the pregnant woman and the kid were smarter than them. Overall the movie was good, if you love seeing things getting burned, this is your movie."}, {"rating": "5", "text": "Deapite its charming 90's style editing and production, the screenplay is pretty poor, the characters never seem to exhibit depth beyond what the exposition heavy dialogue allows. Sadly the maguffin for which all the g-men hits are there to cover up is never revealed leading to us rooting for characters based on the short introductions they get. Often felt like edits killed any tension that  built up was handled poorly with sequences that felt to action oriented but it was still very watchable. If you like this genre there will be something here for you to enjoy."}, {"rating": "4", "text": "The director should really have kept Angelina's arms and legs from ever being seen.  She looks anemic, yet they have her surviving a 20+ foot fall onto her back and getting struck by lightening.  Plausibility flies out the window, and then they put a heavily pregnant woman on galloping horse-back.  Not to mention the fire that knows exactly what speed the plot needs it to be, regardless of how forest fires actually are.  Finally they have the two bad guys (the other two that took the car just mysteriously vanish) that were Green-lit to have more people just choose not to.  Finally, if you are going to take a cop's weapons to use as a tracker, then take the bullet resistant vest as well.  Hell, take any identifier that says he is a Sherrif.  Most people tend to notice a Sherrif being threatend by non-cops, especially when one has a half-melted face.4/10"}, {"rating": "6", "text": "This is an okay movie.  Mostly, it is a showcase for Angelina Jolie, who plays a hotdog firefighter who seems to be intent on being one of the guys and keeping up with their antics.  She is sent to man a fire tower where she will stay alone - without a bathroom - for a couple of months.  In a separate story, a forensic accountant is on the run from bad men because he knows too much.  He takes his young son with him.  The characters’ lives intersect and Jolie must help keep everyone safe in the wilderness from the bad men and a raging fire.  Not a bad story, but some pretty relentless violence bothered me."}, {"rating": "5", "text": "Those Who Wish Me Dead – Wish there was More.This interesting story gets a halfway interesting script. For something with several writers, it should have been far better, or were we simply seeing some attempts to re-write the weaker elements with more impact?  Whatever, this could have been a gut-wrenching survival epic if it was marketed towards a wider audience. Who was it intended for?  We have a 12/13yr old boy placed in a shockingly deadly situation, who witnesses an unspeakable murder but his scenes are surrounded by a bunch of boozy, swear fest, dim-witted,  potty-mouthed firefighters, who speak and act more like brain dead morons from another planet – why were so many needless scenes included with this uninteresting lot? Has Hollywood completely been taken over by movie makers that have so little idea what makes audiences react?  (IE;  a 12 or 13yr old with a major role in a show that’s rightly, not recommended for anyone under 17. )Much excitement is included with a pair of super deadly hitmen being sent to take out some honest citizens - exposing some nasty graft and corruption in high places. There are some genuinely interesting characters along the way such as the Survival Camp couple but these are smothered by unnecessary over the top situations - that simply end by getting in the way of the overall impact. Then the super-smart assassins eventually end up making some super-dumb decisions which also weakens the outcome. Angelina Jolie, the writers, and director seem to have been trying to appeal to the mindless juvenile action audience as some of her character's motivations and dialog, were particularly poorly written and suspect. For a woman who claims to have the health and safety of children as her first and foremost aim, much of this looked perhaps hypocritical. Finn Little playing the young boy, out-classes most all others in this effort. Great Montana location cinematography helps (second unit or stand-in?) but the story could have been terrific if toned down and treated with more descent believability."}, {"rating": "5", "text": "(Mauro Lanari)It is not the usual film with the heroic protagonist having to deal with a PTSD. Jolie has a broken heart to which the wounds to her hands and feet are added. In short, also Zaillian adapts by producing a film where the christologically stigmatized and messianically salvific figures are women and mothers, while we males are judged expendable (the only exception allowed: if we are part of their offspring). The man-hunt or almost is well directed, but it does not hold up such a trendy and biased ideological burden: paradoxically, movies like \"Silent Fall\" (Beresford 1994) or \"Mercury Rising\" (Becker 1998) have shown greater courage with their examples of caregiving manhood."}, {"rating": "6", "text": "Those Who Wish Me Dead is a fun film with lots of action, great visuals, and powerful performances, particularly from Angelina Jolie and Jon Bernthal. The pacing isn't always perfect as the story moves very quickly at times, but feels rushed at others. This movie also ran into a problem that many modern blockbusters face in that it felt like the characters were incapable of injury despite being in almost certainly fatal incidents. Even with these flaws, this is still a decent movie that is worth giving a view, even if it's for no other reason than having a chance to look at Montana landscapes."}], "recommendations": ["unhinged", "taken", "snitch", "savages", "no_escape", "the_town", "flightplan", "jolt", "the_commuter", "x_men_origins_wolverine", "the_little_things", "the_unforgivable", "3_days_to_kill", "killer_elite", "the_ice_road", "cold_pursuit", "hanna", "the_accountant", "till_death", "honest_thief", "man_on_a_ledge", "angel_has_fallen", "the_call", "mile_22", "infinite"]}