{"id": 4607, "title": "Three Kings", "starring": ["George Clooney", "Mark Wahlberg"], "runtime": 114, "genre": ["Action", "Comedy", "War"], "description": "A group of American soldiers stationed in Iraq at the end of the Gulf War find a map they believe will take them to a huge cache of stolen Kuwaiti gold hidden near their base, and they embark on a secret mission that's destined to change everything.", "releaseYear": "1999", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/fClJQW8xn8wHOFqoA4jUn0PZh1f.jpg", "categories": {"plot": 7.625, "acting": 8.11111111111111, "ending": 9.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 8.0, "action": 8.5}, "reviews": [{"rating": "9", "text": "I just watched this for the second time (2006) against the backdrop of current events (ie. resistance to, support for ongoing war vs. terror). Yoon C (and detractors among the metacritics), while your comments are intelligent and incisive, I would argue that this movie is great precisely because it plays (and I mean, plays) along all those lines without telling you what to think. If anything it shows that all people's opinions are ridiculous and it imposes none of its own. It sounds to me like you are looking for a movie to tell you what to think of war in Iraq (that is, to tell you \"war is hell\" or something like that - the message you are expecting becausue you've already heard it in other movies and novels). Whatever else you say about this, it's a war movie unlike any other. It rocks first and foremost, but it also socks and it even (dare I say) does make you think. And it's still relevant seven years later, in ways that it was not when it was made. That anticipatory quality makes it much more artful than the huge majority of \"deep\" arthouse movies with a moral agenda. Maybe the best thing about it is that it gets the Schwarzenegger-set to watch and rewatch a movie where a child cries over her dead mother, where men are torn by morally ambiguity, where in the end we are at least given an inkling of how hard it is to \"do the right thing.\""}, {"rating": "10", "text": "The 3rd best film of 1999(next to American Beauty and Magnolia)."}, {"rating": "9", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"}, {"rating": "9", "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"}, {"rating": "10", "text": "Not for those who don't like politics. I enjoyed the original story, the acting was alright and it has just enough action to keep things exciting. Definitely worth watching, I would say not a popcorn flick."}, {"rating": "8", "text": "The Gulf War was a total waste of time and money, but we all know what it is interesting about this movie surrounded by stars and known direction, is how it exposes issues such as greed, sacrifice, comedy and action as realistically and moving, even if sometimes he is a bit inconsistent in transit and wants to spend time with dubious quality between pure drama and black humor, but other than that he and a lot of fun and their performances are very charismatic cat, especially from Clooney."}, {"rating": "8", "text": "Updated version of The man who would be king (almost). About three marines in the Gulf War who shall retrieve a cargo of gold and protect as heroes a bunch of insurgents. The bond of comedy and action makes it worth the effort for va weekend."}, {"rating": "10", "text": "This movie, although starts out as a buddy cop style movie, really hits me as the characters become more and more human as the story progresses. I definitely recommend people watch this movie."}, {"rating": "8", "text": "I wasn't expecting to like this movie as much as I liked it.There is not a lot of action and it's more of a politic movie but,the acting and the script is good enough to hold the movie."}, {"rating": "6", "text": "Overall, this one is a pretty good film. George Clooney, Mark Wahlberg, Ice Cube, and Spike Jonze, are all good here and really help this film out. The direction from David O. Russell was also very good and gave this one a unique feel. Many war films do not really have character development and this one did not have a ton, but it at least had some to let us know the motivation behind the main characters' actions. However, the narrative slacks at times and can be a tad boring at times for my liking and even when it was not, I was never fully gripped by what was happening. It was certainly interesting enough, but the plot was a tad too outlandish and predictable for me to fully enjoy it. Now, the film is still entertaining and is still very well made and well acted, so I can see why it got the praise it did. However, this one was just not fully for me, though it was still a pretty good film in my eyes."}, {"rating": "8", "text": "are we shooting..Three KingsThe sense of urgency is kept alive throughout the course of the feature with a hint of amusing sense present in each characters that resonates the most with practicality no matter how much peculiar and unpredictable it may go later. David O. Russell is as usual brilliant on his work and aces on handling such big stars on a screen in the most subtle possible way addition to the powerful script he co-wrote with John Ridley. Mark Wahlberg, George Clooney and Ice Cube (surprisingly he is good too) all of them are doing a great job supporting each other in this almost 2 hour journey and gives enough room to each other too. Three Kings had a great new and fresh concept that is well taken care of on script with keen sense of humor where the rest of it is left upon the performance objective which is satisfied utterly by the actors."}, {"rating": "7", "text": "Stupid plot but good acting and atmosphere I enjoyed most of it to the end."}, {"rating": "9", "text": "Damn good movie. interesting and different. probably to much so for some people."}, {"rating": "9", "text": "=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:=:_____________________________♡♡♡♡♡♡♡♡♡♡"}], "recommendations": ["v_for_vendetta", "ant_man_and_the_wasp_quantumania", "war_dogs", "chappie", "avengers_age_of_ultron", "bright", "glass", "jarhead", "tomorrowland", "hancock", "nobody", "terminator_genisys", "fantastic_beasts_the_secrets_of_dumbledore", "the_equalizer_2", "twelve_monkeys", "black_panther_wakanda_forever", "hercules", "black_widow", "surrogates", "thor_the_dark_world", "blade_of_the_47_ronin", "the_accountant", "x_men_apocalypse", "the_a_team", "edge_of_tomorrow"]}