{"id": 2812, "title": "Till Death", "starring": ["Megan Fox", "Eoin Macken"], "runtime": 89, "genre": ["Horror", "Thriller"], "description": "After a romantic evening at their secluded lake house, a woman wakes up handcuffed to her dead husband. Trapped and isolated in the dead of winter, she must fight off hired killers to escape her late spouse's twisted plan.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/mI7xBibGBNai6vSdycTjgxEQQOO.jpg", "categories": {"plot": 4.818181818181818, "acting": 5.1, "ending": 6.666666666666667, "soundtrack": 5.0, "cinematography": 3.0, "familyFriendly": 3.0, "funny": 8.0, "action": 7.0}, "reviews": [{"rating": "8", "text": "I went in with very low expectations and came away really enjoying having watched this movie. It was a fun game of cat and mouse. The plot moves along at a steady pace and the writers managed to successfully keep a sense of suspense going throughout. Acting was pretty decent. Callan Mulvey always plays an excellent villain and needs more roles where he can do his thing. Megan Fox was fine too. Well worth your time."}, {"rating": "7", "text": "Very impressed with the direction. Looking forward to seeing more films from them. Anyone giving this film anything less than a 5 has some weird problem with Megan Fox. They should watch Jennifer's Body another time and realize she's actually a talented actress. Definitely worth a watch. I also think the brother of their villan was great"}, {"rating": "6", "text": "I normally start to write my thoughts down about a movie before it even finishes. Mostly so I can keep things fresh in my head, i.e. the use of the score, the acting, the filming etc. Then I can put a review up right out of the gate after I finish watching it. I couldn’t with this. It’s been a little while since I viewed it and I’m still not sure what I think. It’s so greatly atmospheric, evenly paced and well set - but I feel like there is so much missing that could have been added to film without weighing it down. A slight bit more back story or exposition. The decline in the relationship needed more explanation. The idea that the husband was always just “bad” could have been more of a plot point. The position that the audience is put in because of what we’re missing is arbitrarily polarizing. You are either rooting for the lead because they are an unhappy married woman - or - hoping she meets a bad ending because of the path her indiscretions have set her on. You get just enough information to to make a decision as to where you stand and then all hell breaks loose. I don’t know if I liked this or if I could recommend it, but I can tell you I couldn’t take my eyes off of it. It’s gripping and grizzly…and I while I can’t stop thinking about this movie I’m not putting myself through that again."}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "0", "text": "bad movie, bad acting (megan fox you are not for acting, never was). nothing original. zero for me! waste of time."}, {"rating": "7", "text": "I went in with very low expectations but Till Death and its leader Megan Fox surprised me. The mystery of a woman handcuffed to the corpse of her dead husband is interesting, but it gets more as the story unfolds. Kept me hooked till the end with some clever writing in the final act and excellent action overall."}, {"rating": "4", "text": "The concept is very straightforward, and the execution is nothing out of the ordinary.By enclosing everything in one setting, and with a plot that involves playing cat and mouse, what you are left with are constant comings and goings that become tiresome, because it's laughable to what extent the characters do so little to find themselves, even when that it's the only thing they're doing.I have a hard time believing that the suspense is as good as I read in professional reviews, because I never saw that, but I suppose they should soften their opinions a bit.What surprises me the most are the mentions of the lead, that's Megan Fox, and more than anything because of what many acclaim as her return.When did she left, that people missed her?When did she make a great movie?Or more importantly. When did she act well?There is a scene where a character she was having an affair with, asks her: \"Is it because of us?\"And she responds with a lazy and completely tedious: \"I'm sure it was because he was insane\"She says this covered in blood with the corpse of her husband handcuffed next to hers, after committing suicide.And that ladies and gentlemen is the extent of her acting rank.But that's not really her entire fault. The rest of the short cast is pretty bad too.The physical part, she pulled it off great, and the film demands a lot of that from her, but when she has to speak is when it gets bad.Obviously there's the background of the plot that talks about a woman escaping from abusive men, but frankly that theme is completely drowned out by what the film was most interested in showing, which was the thriller stuff.It's not awful **** but it's also hardly worth mentioning at all."}, {"rating": "10", "text": "Não esperava gostar tanto assim do filme, e acabei me surpreendendo muitíssimo positivamente. Megan está realmente incrível no papel, um excelente comeback após tanto tempo fora das telas."}, {"rating": "8", "text": "didn't expect much but was pleasently suprised. i'm also happy to see megan fox in another movies, it's great to see her acting. Would watch this movie with friends again."}, {"rating": "10", "text": "People really hate Megan Fox just for being Megan Fox, it’s kinda gross guys. Get over it, she’s pretty. You can’t have her."}, {"rating": "5", "text": "Guy whose wife is cheating on him, takes her to a lakehouse, and in order to have his revenge, handcuffs her to him, shoots himself in the head and makes her drag his corpse around for the rest of the film."}, {"rating": "7", "text": "This film was better than expected, I really was at the edge of the seat!The beginning was a bit slow but like after 15-20 minutes the pace of the film was great, it was trilling, interesting and overall pretty good!Megan Fox was also good, and her acting is by far the best in the film.To sum up, if you're looking for a short (88 min), that is trilling and will make you wonder what will happens next this is the film for you, nothing less nothing more."}, {"rating": "10", "text": "I really liked the moviethe acting of actress Megan Fox has improved a lot.I confess I'm surprised."}, {"rating": "8", "text": "This film pleasantly surprised me. I was expecting a throw away slasher film, but its a well-crafted tense thriller that had me engaged the whole time. And Megan Fox is actually quite good here, some of her dialogue delivery is wooden, but she's convincing enough. Worth checking out."}, {"rating": "3", "text": "SPOILER ALERT!! The website wouldn’t allow me to click on the Spoiler Alert circle!This movie’s plot was not that bad. What ruined it for me was Fox’s makeup. Throughout everything that she went through, even after washing blood and brain matter from her face, even after almost drowning in a frozen lake, her eye makeup and lipstick were perfect. Ridiculous. The makeup on her dead husband was very accurate. I am a retired CSI, so I’ve seen my share of GSWs to the head. Also, after she exited the frozen lake, the water coming from her clothing and body would have pooled around her in a pinkish color from the bloody shirt and her injuries.You really should hire experts in Crime Scene Reconstruction for these movies. Because of these scenes, it ruined the entire movie for me. Realistic makeup is important. Not conforming to keeping a beautiful actress in her perfect makeup after all that she went through, even waking up to find herself cuffed to her husband with her makeup perfect was the beginning of the ridiculousness."}, {"rating": "1", "text": "One of the worst movies I've seen in my life. The plot/storyline is more terrible than the acting. Total waste of time."}, {"rating": "3", "text": "First half was about a 5, but then it devolved into paint by numbers redundancy. Plus, the freezing conditions were meant to be a major factor, but didn't realistically have the effect they would have in a more tension filled script. It all felt too familiar to be exciting, and pretty bland. Poor acting as well from everyone, so that indicates more of a script/direction problem. This was very \"direct to video\" in every way; Technically, story, directing, acting."}, {"rating": "6", "text": "Slow to start, subpar acting from the lead, but a genuinely interesting movie nonetheless. It is an engaging thriller with a little too many twists but it's a good way to pass the time."}], "recommendations": ["the_loft", "man_on_a_ledge", "awake", "a_perfect_getaway", "house_at_the_end_of_the_street", "jolt", "old", "shut_in", "marrowbone", "the_call", "next", "the_mountain_between_us", "contraband", "those_who_wish_me_dead", "jumper", "seeking_justice", "i_see_you", "red_sparrow", "gone_girl", "sanctum", "miami_vice", "hanna", "the_possession_of_hannah_grace", "now_you_see_me", "the_snowman"]}