{"id": 4590, "title": "Timecop", "starring": ["Jean-Claude Van Damme", "Mia Sara"], "runtime": 99, "genre": ["Thriller", "Science Fiction", "Action", "Crime"], "description": "An officer for a security agency that regulates time travel, must fend for his life against a shady politician who has a tie to his past.", "releaseYear": "1994", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/qDjne2UffjOpZAg9cFmzteWqhd3.jpg", "categories": {"plot": 5.8, "acting": 3.4, "ending": 7.0, "soundtrack": 5.0, "cinematography": 3.0, "familyFriendly": 3.0, "funny": 5.0, "action": 6.1}, "reviews": [{"rating": "7", "text": "It's a rare occurrence, but once in a while, a film is made that is way ahead of it's time, too far ahead of it's time, and Timecop is one of those films. Had it been made in the error of CGI, this film would have been so much better. The story is strong, a lot stronger than the performances, and the use of some crazy special effects would have taken it over the top, but those weren't available in 1994. The result is a slightly above average film, with a really cool plot, and not much else. The story follows Max Walker (Jean-Claude Van Damme) whose job is to stop people from using illegal time travel technology, in order to change the past. Changing the past can drastically change the present, and is often abused by criminals trying to get wealth and power. One of those men is U.S. Senator McComb (Ron Silver), who has his eye on the Presidency. Walker must go back in time to stop McComb and expose him, before he can reshape the country in his own image. I love time oriented Science Fiction, as the story can take you on a magical trip all throughout history, like nothing else can. In this film, they didn't travel as much as they should have, and the technology and effects behind time travel were so basic, that it's hard to buy that this could ever work. Jean-Claude Van Damme stars and we all know that I see him as one of these brawn over brains guys, that only get work because of their looks and their fancy movies. Van Damme wasn't bad, but this is a film that had real potential, and simply using an average star, contributes to the overall sentiment of the film. Timecop is a great story, and in my opinion is something that could really work if it is re-made properly. It's not because the film is bad, it's just not a good as it should have been. If you're a Sci-Fi fan, I definitely recommend it, but if it's not your favorite genre, you might want to skip this one."}, {"rating": "5", "text": "Peter Hyams who brought us Sudden Death which was stupid but fairly decent brings us TIMECOP which is a 1994 fantasy/ sci fi action with probably bits of humour in it... I remember most if not all of the movie and Ron Silver playing some senator guy who sees his other self due to time travel.. This film is the equivalent of Back to the Future but with violence and going back in time and preventing things from happening. The whole concept is about time travel but the violence is there just as an added spark to make the movie seem more entertaining and fun. Some of the villains are fairly decent and some utterly laughable in a bad way especially Ron Silver and also we get to see Mia Sara aswell in the movie.  The scene where some character is falling off a building or out of a window and dissapears suddenly before he hits the ground and faces trial or sentencing in another time period before being found guilty then returned to his original time period and continues to fall from the building and eventually is splattered on the pavement and dies is pretty hilarious and decently done. Some of the action is decent including Van Damme's fight scenes so this is watchable at best but not that great."}, {"rating": "3", "text": "As you may deduct by yourself this movie is about time-travelling. But it totally misses its point. From its beginning the movie sets a lot of dumb and weird rules about time-travelling, so-called secret files and deontology. You don't have to wait long to realize these rules are a big bag of crap. Scenario is generic and really predictable. I however have to admit that the way events happen surprised me and were less predictable than the scenario in overall.All the constant time-travelling dimension makes it really hard to understand realtions between characters since some don't act and think the same way in the very past, the past and the present times.Van Damme's acting is great and it almost goes the same way for the rest of the cast. Really honorable mention to Mia Sara whose acting and presence bring an authentic human touch to the movie. 'Timecop' is once again one of those movies highlighting Van Damme's abilities and especially his flexibility (just as 'Kickboxer' did five years before its release). So don't even question scenes in which he will fight almost naked and will do gymnastics splits for nothing.Visual effects are decent (even if you watch it in 2021 like me) excepting this ugly scene at the end. If you watched the movie you surely know which scene I'm talking about. The lighting is terrible. I stopped counting the number of scenes that are so dark that you can't see what's going on. Soundtrack and audio atmosphere are dull and almost non-existent. Fights and violent scenes are terribly presented. You simply can't feel the stakes of conflicts. Almost all the characters' deaths don't evoke any emotion to me and are poorly shot.Ending (no spoil) is awful. It is full of fake and useless suspense, it is inconsistent and feels like it is lasting a whole hour. Villains don't stop to appear and wake up from total coma just to make action scenes be a bit longer. Seeing credits never made me so happy."}, {"rating": "8", "text": "Timecop is a must watch for Jean Claude Van Damme fans and is one of Van Damme's best films (in my opinion at least). Timecop is an enjoyable and entertaining action sci fi (or sci fi action) film from the 90s that most action fans of 80s & 90s action flicks will like. Most action scenes & effects are good. The last action scene can be dissapointing due to it taking place at night making it hard to see what's going on."}, {"rating": "7", "text": "No es fácil hacer películas que toquen el tema del viaje en el tiempo. Tienen que estar bien armadas y conectar todos los elementos con precisión. Esta película lo aborda, de manera básica, pero lo aborda. Me paso con el caso de End Game, después del final de infinity war(que por cierto es muy bueno). Sentí, que establecieran lo de los viajes en el tiempo, era como la solución más fácil a todo lo bien logrado en la anterior película.Volviendo a la peli. Está bien, Van Damme no actúa mal, hay muchos actores de acción que son medios duros para trabajar, como es el caso de la roca, terminator y el demoledor.¿Es básica? Sí, pero cumple lo más importante. Entretener. Se deja ver y se disfruta¿La recomendaría? No necesariamente, hay muchas mejores películas de viajes en el tiempo.¿La volvería a ver? Si la volviesen a pasar en la tele y no tuviese nada que hacer seguro.Otra cosa que siempre pasa, es que en la mayoría de películas de este estilo las cosas se podrían resolver más fácilmente de lo que se terminan resolviendo. Pero bueno, si fuera hecho de mi forma no existiría la propia película"}], "recommendations": ["mission_impossible_ii", "abraham_lincoln_vampire_hunter", "quantum_of_solace", "xxx_return_of_xander_cage", "infinite", "jason_bourne", "transporter_3", "kate", "transformers_dark_of_the_moon", "the_transporter_refueled", "war", "mad_max_fury_road", "the_mechanic", "the_ice_road", "john_wick_chapter_3_parabellum", "the_bourne_legacy", "the_bourne_ultimatum", "furious_7", "angel_has_fallen", "terminator_3_rise_of_the_machines", "bloodshot", "salt", "mechanic_resurrection", "the_terminator", "underworld"]}