{
  "id": 2058,
  "title": "Time Trap",
  "starring": [
    "Andrew Wilson",
    "Cassidy Gifford"
  ],
  "runtime": 95,
  "genre": [
    "Science Fiction",
    "Adventure"
  ],
  "description": "A group of students become trapped inside a mysterious cave where they discover time passes differently underground than on the surface.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8w0hBC9kLy56F7rjwGIe8JtIrHS.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.0,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "This movie was 50% awesome and 50% me yelling at the screen from stupid dialog and illocigal character actions.The concept of the movie is really quite intriguing. Even though it's never really fully explained what is the cause, the ideas they built up around the time anomaly kept me interested. And a lot of it works.Better dialog and acting could have made this a sci-fi masterpiece. But it kind of stumbles over itself a lot of the time. It builds up these interesting ideas, then executes them pretty well. And the next scene you have the characters reacting to what just happened. And my reaction to thos sequences was something along the lines of \"What!? Why would you say that?! Why would you react to that in such a way!?\". And that just kept happening over and over again. So all the stuff that's going on is pretty cool. But the characters are really soulless and shallow except for Furby (who I quite liked, even though he was a bit much at the beginning) and Cara (who probably delivered the best acting out of all of them)."
    },
    {
      "rating": "7",
      "text": "Just watched it on Netflix, the thing is, I am the kind of person who likes to watch fiction randomly and sometimes without searching scores. Sometimes I fail, sometimes I get to watch some hidden gems. This is one case of finding a not well acted and maybe not well presented movie, since the affects weren't that great, bad at some point, but I think the story is well made and let alone a always gets me. I'll just give it a seven because I really liked the story,  it's one of that crazy ones about time and if you have certain love for time travel or time related movies or shows, I guess you should not skip this one."
    },
    {
      "rating": "7",
      "text": "A classic low budget resume movie useful if you're in a lockdown.  On the positive, it's a low budget masterpiece demonstrating how imaginative writing can triumph over very low budget limitations. Demos how to think outside your box when budget says the box has to be small.  The critics criticize this as a change in tone.  Actually \"change of tone\" and reframing the whole story IS the story.  A wrenching narrative re-frame 3/4 the way thru is used occasionally even on big budget films like Star Trek movies."
    },
    {
      "rating": "8",
      "text": "Time Trap is a good example of the fact that a good film can be made for as little as $3 million. There are no expensive sets, there is no yawning cast, there is no expensive CGI. But at the same time, Time Trap has an interesting story, a little Sci-Fi and excellent use of time as another actor. Everything in the film turns into a circle of interpretation of time. It's so easy to actually show that it doesn't require big budgets and expensive scenes in CGI. Quite simple pair of videos on the home camera. Yes, if you soberly evaluate Time Trap a completely passing film that cannot withstand comparison with any more less serious film on the topic of time loops or time travel. But I don't want to compare at all, Time Trap is a good film in itself. If you're not chasing maximum showmanship then watch Time Trap, it's a good movie for your budget"
    },
    {
      "rating": "7",
      "text": "It kept me entertained and interested to see what was going to happen next. I just wish we could have seen more of the \"future\" when the gang got back to the surface."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)A rather ambitious sci-fi B movie, where however every twist thickens and does not dispel the logical inconsistencies."
    },
    {
      "rating": "8",
      "text": "Surprisingly good scifi.  Thoughtful and interesting but still exciting for a nearly single set movie."
    },
    {
      "rating": "9",
      "text": "Rather cool movie without any unrelated drama, just the fiction story+ not a single negro - instant 10/10"
    },
    {
      "rating": "2",
      "text": "What on earth am I watching? Supposed smart man professor type doesn't realise he's gone forward in time. Chucks all of his glow sticks in the entrance to the cave he's exploring. Needs his \"expert\" typical jock/cheerleader teen team to come rescue him. Also generic children who hate bugs / cocky tween girl turn up to help."
    },
    {
      "rating": "7",
      "text": "Time Trap is an interesting movie for a time traveling scenario. The movie has a great concept but in the time allotted left a lot out to complete the movie. Slightly over half way, the viewer is left with a where is this going feeling and thinking there's not enough time left. With the last fifteen minutes or so feeling like the the story was rushed to finish.The story line would have been better if put into a one season series."
    },
    {
      "rating": "8",
      "text": "I really liked this movie. No political agenda whatsoever, just good film making, and it didn't need a huge budget or a bunch of flashy special effects to do it. Very refreshing. This is how movies are supposed to be made. Not sure what the critics were thinking giving this such a poor rating, but it seems lately there's a huge chasm between what movie goers like and what movie critics like."
    }
  ],
  "recommendations": [
    "project_almanac",
    "pandorum",
    "monsters",
    "the_cloverfield_paradox",
    "the_tomorrow_war",
    "the_darkest_hour",
    "geostorm",
    "chernobyl_diaries",
    "into_the_storm",
    "bird_box",
    "jupiter_ascending",
    "independence_day_resurgence",
    "bright",
    "the_maze_runner",
    "eo",
    "freaks",
    "the_day_after_tomorrow",
    "riddick",
    "code_8",
    "in_time",
    "gods_of_egypt",
    "the_new_mutants",
    "city_of_ember",
    "unfriended_dark_web",
    "2012"
  ]
}