{
  "id": 1344,
  "title": "Tinker Bell and the Legend of the NeverBeast",
  "starring": [
    "Ginnifer Goodwin",
    "Mae Whitman"
  ],
  "runtime": 77,
  "genre": [
    "Adventure",
    "Animation",
    "Family"
  ],
  "description": "An ancient myth of a massive creature sparks the curiosity of Tinker Bell and her good friend Fawn, an animal fairy who’s not afraid to break the rules to help an animal in need. But this creature is not welcome in Pixie Hollow — and the scout fairies are determined to capture the mysterious beast, who they fear will destroy their home. Fawn must convince her fairy friends to risk everything to rescue the NeverBeast.",
  "releaseYear": "2014",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3S0mmmpYStB3GqodRghcfOt81wQ.jpg",
  "categories": {
    "plot": 8.6,
    "acting": 8.333333333333334,
    "ending": 7.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 8.5,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I wanted to add this review to balance out the few \"professional\" ones that are highlighted by metacritic. The one from The Guardian borders on insulting, it's so short -- not to mention the fact that it mistakenly identifies the main character as Tinker Bell, instead of accurately noting that FAWN is the star of this picture.\r For parents, this movie IS much darker than previous installments of the franchise. However, that being said, it's head and shoulders above other kiddie fare out there. It tackles love and loss, the consequences of snap judgments and learning to trust your heart, not your head. These are lessons I wish my five-year-old daughter learns at the end of a movie -- and they've been echoed in all the Tinker Bell movies. I don't wish to go into too many spoilers here, but if you have lost a pet (however recently), there is a plot point that may resonate strongly with you. Personally, I bawled buckets -- though this IS a Disney movie, so there's no permanent scarring. Also, the aforementioned five-year-old cannot stop asking to watch it again and again. So either it's gone over her head, or she's far more adjusted than I give her credit.\r On a related topic, the word on the street is that this movie is the last one for the Tinker Bell line, due to \"poor merchandising performance.\" Should ANY Disney exec read this review (on which I'm not banking), I would point out that there needs to actually BE merchandise available when a movie is released, and for execs not try to hedge bets by waiting months to see if a movies catches on. Disney did the same thing with \"Frozen\", if anyone can remember a time when that movie wasn't permanently etched onto our corneas. When \"Frozen\" hit theatres in November, it was more than a YEAR before Disney started stocking merchandise. They didn't \"believe\" in programming for little girls. In fact, Disney planned on not releasing \"Frozen\" at all, until \"Tangled\" performed so well. If their decision to end the Tinker Bell movie franchise is based upon this short-sighted business plan, I wonder if more shlock like \"Planes\" is expected, while gems like \"Tinker Bell and the Neverbeast\" are left to go unnoticed. :/"
    },
    {
      "rating": "10",
      "text": "heart warming fun that will bring a tear to your eye the story was excellent as always from the tinkerbell franchise welldone disney i look forward to the next installment as do my two daughters."
    },
    {
      "rating": "7",
      "text": "You'd have to have a heart of complete black tar (like Disney for cancelling the series), to not be engaged by this film. Sure, it starts out light & fluffy, kind of more-of-the-same...until the introduction of the Neverbeast (one of Disney's finest creations). Then, the movie finds its footing and off we go!\r This time around, the story's main focus is on the character of Fawn (Ginnifer Goodwin, doing her usual great work), and her search to discover just what the creature is, and why it's come to Pixie Hollow, before the Scouts, led by Nix (Rosario Dawson, also good) can get to it.\r Warning: the ending is HEARTBREAKING. Thoroughly so, but it doesn't feel cheap or tacked on to manipulate, it earns its tear-jerking effect.\r This is the best of the Tinkerbell series."
    },
    {
      "rating": "10",
      "text": ".Disney movie that captures the heartThis movie was as expected and like with all other Disney movie, it contains morals and values for kids to learn from. As the synopsis briefly describes, you can never judge a book by it's cover or in this case, the fangs.As an adult, you can see the message they are relaying to everyone of all ages. Children especially because they need to know this stuff to develop into their positive character trait.I also did not expect to cry from this movie. It's very touching and hits you in the heart. Loved ones will want to watch this together. Especially if you have kids. I just couldn't help but shed a few tears, and I'm not the type to get teary-eyed either.Overall, this movie is cute, funny, adorable, touching, and keeps you drawn to the plot. Excellent!"
    }
  ],
  "recommendations": [
    "bridge_to_terabithia",
    "coraline",
    "ralph_breaks_the_internet",
    "the_star",
    "the_art_of_racing_in_the_rain",
    "my_little_pony_equestria_girls_forgotten_friendship",
    "the_peanuts_movie",
    "the_land_before_time",
    "where_the_wild_things_are",
    "the_boss_baby_christmas_bonus",
    "the_polar_express",
    "brave",
    "flipped",
    "meet_the_robinsons",
    "cloudy_with_a_chance_of_meatballs_2",
    "moana",
    "happy_feet",
    "frozen_ii",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "ferdinand",
    "my_little_pony_a_new_generation",
    "toy_story_3",
    "ice_age_continental_drift",
    "the_good_dinosaur",
    "the_smurfs"
  ]
}