{
  "id": 548,
  "title": "Titane",
  "starring": [
    "Agathe Rousselle",
    "Vincent Lindon"
  ],
  "runtime": 108,
  "genre": [
    "Drama",
    "Thriller",
    "Horror"
  ],
  "description": "A woman with a metal plate in her head from a childhood car accident embarks on a bizarre journey, bringing her into contact with a firefighter who's reunited with his missing son after 10 years.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/37JWYHDvIu7XbuldEKZchDXcVDz.jpg",
  "categories": {
    "plot": 5.5,
    "acting": 5.904761904761905,
    "ending": 6.3076923076923075,
    "soundtrack": 7.0,
    "cinematography": 6.75,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.5
  },
  "reviews": [
    {
      "rating": "4",
      "text": "(Mauro Lanari)Provocative, disturbing, shocking? No, because the \"very French and self-satisfied chic dress [...] keeps at a distance anyone who is not surprised by a confused, unrealistic, studied at the table provocation\" (Emanuela Martini). \"Titane\" begins with \"L'homme machine\" (1747) by La Mettrie and \"Crash\" by Ballard/Cronenberg in a gender liquid version, \"pansexuality, hybridization, identity redefinition beyond the registry office and biology\" (Raffaele Meale), and if at the base there is all the cyberpunk with Carpenter (\"Christine\" 1983) and Tsukamoto (\"Tetsuo\" 1989) as well, Refn, Noé, Carax are grafted onto it, rendered emotionally aseptic. \"It continues like a cyber horror to then go to get tangled up in the mélo [...] Too ambitious, narcissistic and fashionable\" (ibid.)."
    },
    {
      "rating": "6",
      "text": "Raw was super awesome, but this? Not so much. Jumbling bizarre body horror ideas into a long mess and yes, **** a car, then reuniting with people is a film genre worthy of the Palme D’Or."
    },
    {
      "rating": "5",
      "text": "It was a great experience seeing this in a movie theater. I'm quite happy that movies like this are still being made.But definitely not for everyone."
    },
    {
      "rating": "3",
      "text": "Begins with a woman dancing provocatively with the camera focused on her crotch, a [too] long shower scene followed by a murder followed by another shower scene. And after all that cleaning up, she has sex with a car. Seriously. Can we please stop trying to depict this in movies? It's been tried before and is never convincing or realistic. Just silly. I love nudity. I love cars. I love murder. I love women. But not this way. There is nothing sexy about this. Not interesting or memorable. And the murder was strictly amateur. It's competently made and acted . And I guess it's going for different or shocking. But the level of sophistication is like a 90s movie. It could have been more over the top. Or darker and depressing. But it just sort of lies there.Summary: Nudity. Murder. And brutality. But boring"
    },
    {
      "rating": "1",
      "text": "While this utterly out-there cinematic fiasco may do a fine job at generating shock value (though schlock value would probably be more fitting), there's nothing otherwise redeeming about this exercise in pointless, pretentious crap. With a story line that's all over the map, virtually nonexistent character development and almost no resolution to any of its diverse narrative threads, this truly is a case of there being \"no there, there.\" Those who erroneously try to characterize this garbage as high art will likely rationalize away the complete lack of a coherent story or meaningful insights as \"unimportant,\" but that's just far too convenient an excuse to justify the validity and viability of this nonsensical trash. Its stunningly odd mix of slasher film elements, cheesy sexual gratuitousness and bizarre horror film tropes just doesn't cut it, particularly when it's further enhanced by such peculiarities as a sexually ambiguous fire company, a steroid-obsessed father figure and incidents that bring new meaning to the concept of \"auto\" erotica. It's puzzling how director Julia Ducournau's latest even made it to the Cannes Film Festival, let alone how the picture walked away with the Palme d'Or, the event's top prize. It has since also been named France's official selection for the upcoming Oscar competition. Let's hope that saner heads prevail before that august ceremony and stop the ill-considered madness associated with this travesty before things go any further."
    },
    {
      "rating": "0",
      "text": "Rien que l’affiche est déjà malséante et de mauvais goût, comme un avant-(mauvais) goût de ce qui vous attend dans cette espèce de film malsain et dégueulasse, névrosé et volontiers psychopathe. Mais également très progressiste et décousu à la fois avec son agenda woke à la petite semaine !On suit donc -ou du moins on essaye en tout cas- les « aventures » d’une fêlée du ciboulot avec sa plaque de titane dans la tête (ceci est expliqué tout au début du film) qui baise avec une bagnole, puis tombe enceinte (si, si…) et se tape plus tard un camion (rouge pompier). On devine à ce train-là qu’elle va rapidement accoucher d’une Twingo.Accessoirement, cette tarée tue des gens ici et là, sans qu’on ne sache pourquoi (tout cela est accessoire sans doute) jusqu’à ce qu’elle se fasse passer pour le fils de Vincent Lindon, lequel s’est égaré dans ce salmigondis provocateur, inepte et surréaliste (ce film d’auteure a remporté la palme à l’asile des peigne-culs de Cannes, on comprend pourquoi…!).On regarde néanmoins jusqu’au bout, jusqu’au grand final qui se vautre dans le ridicule le plus complet… Le précédent film ou plutôt étron de la réalisatrice était déjà gravos et odieux mais là, on touche le fond dans l’abjection purement provocatrice ! on tient donc avec cet étron vaguement filmique une grosse merdasse de plus, putassière et répugnante. Il faut l’évacuer bien au fond des chiottes et tirer trois fois la chasse par dessus."
    },
    {
      "rating": "0",
      "text": "Horrible.It is a pity that they are giving up beauty and art in the name of their political views."
    },
    {
      "rating": "1",
      "text": "A hollow post-modernist attempt at art, riff with nihilism and shock for shock's sake. All cheaply imitated style (Gaspar Noe & Cronenberg) with zero substance. Heavily influenced by Gaspar Noe's \"I Stand Alone\" and \"Irreversible\", with some sequences and characters almost directly ripped from these films. Yet where Noe's films attempt, in some form, to portray some meaning in the meaninglessness via the characters who at least have some human goals (even when depicting the disturbing lead character in \"I Stand Alone\"), \"Titane\" simply portrays an inhumane caricature of emptiness that embodies the selfish self-destruction of the nihilistic mindset. The film is as cold as the titanium in its heroine, marking its attempts at cheap \"shock\" with polarizing gimmicks that consistently fall flat. An utter waste of celluloid if there ever was one. So why did it win the Palm d'Or? Politics, hijacked senses in an era of fear."
    },
    {
      "rating": "5",
      "text": "I can’t believe this movie won Palme d’Ore at Cannes film festival. “Titane” has basically no story, dialogue, nor it makes any sense. Nothing, other than a grotesque series of images describing the struggle of a trans-women fighting against the world and “her/his/its/their” body. It does send a message in that regard, yet its bigger statement is a testament to the power of the LGBTQ+ lobby and to the twilight of the western cultural supremacy. Last year the festival was suspended due to COVID. The last two winners were Shoplifters from Japan and Parasite from South Corea, both ferocious critiques to the capitalist system and its inequalities. While the rest of the world is concerned about the climate and wealth distribution, the left in the west is struggling to define itself, giving precedence to identity politics while migrants drawn in the sea."
    },
    {
      "rating": "0",
      "text": "It has shock value to the easily-shocked and exactly nothing else to offer."
    },
    {
      "rating": "0",
      "text": "Cronenberg created a very underrated masterpiece with \"Crash\", a refined, sensual musing on beauty, the concept of perfection and pulsions through scars and carsThis is an unashamed bastardized, muddled and lazy copy that cowardly uses woke-baiting to prop up the inanity of its core. Sadly, it worked with the degenerate Cannes crowd."
    },
    {
      "rating": "3",
      "text": "This was... A rather interesting film to say the least. From Julia Ducornou (director of the grotesque but also very overrated 'Raw'), I can't even begin to describe what this film is about, cause even after seeing it, I still have no idea what it was even supposed to be about. (Somehow) the winner of the Palme D'or (a French Oscar) at the Cannes film festival, the film follows a woman who's a serial killer in France that finds herself in unusual circumstances when a man takes her into his home while she's on the run. And to give any more than that away would likely ruin the film, but what's the point in worrying about that when this film is simply bizarre, pretentious, and pointless just for the sake of it!? Seriously, the film is simply disgusting, weird, and random with no merit, rhyme or reason behind it (or at least no smart or justified reason) oh and to cap it all off, one of the main plot points involved the main female lead engaging in sexual intercourse with an... Inanimate object and becoming pregnant as the film progresses. Ya...this film was absurd, and not in a cool Lynchian or Cronenberg way like what many other reviewers have been saying."
    },
    {
      "rating": "6",
      "text": "I certainly enjoyed the film, but I'm just not finding it as horrific or outlandish as the reviews I'm reading and I'm stumped at why it got the palm at Cannes, but I often am. I can definitely feel the influence of both Noe and Carax, both far superiors directors, but it lacks their punch if what Ducournau is going for is something like Climax or Holy Motors. The car theme was lost on me, but I did like the humanization of Alexis. She goes from random killer to son/daughter by the end and learns what it means to love and be loved. Not sure if there's supposed to be a message about gender, but I don't really care to hear it anyway, and it certainly didn't resonate.Seems like everyone is drooling over Rouselle's performance as it's her first and she carries the film, but Vincent Lindon's was more impactful for me. Rouselle was not bad by any means, but I related more to Lindon.The ending was a dud for me as well. I read another review that said it was more like a string of music videos and I can see that. Too much left out to allow the audience to connect to the protagonist, but then again, could you even connect with a psychopath?If you watch it because it got a palm, you probably won't like it, or just lie that you do. If you're intrigued by the genre, I'd recommend Holy Motors, Climax, or Irreversible. More shocking and better films."
    },
    {
      "rating": "6",
      "text": "Oh wow I think I may need some therapy after that experience. Titane is really like nothing I’ve seen before, it’s truly horrifying in a “what the hell am I watching and why am I watching it” sort of way.After a series of violent and unexplained crimes, a father is reunited with the son who has been missing for ten years. That’s all I can say about the plot as it’s definitely better to go into Titane knowing as little as possible. It really feels like a mishmash of genres, never comfortably fitting into one. Occasionally a director will make a movie so insane you won’t know whether you’ll love it or hate it, the only thing you can do is watch it and find out. You might be disgusted and walk right out of the cinema or you might be glued to your seat unable to look away as you’re too desperate to know what happens next. Either way you’re in for something you’ll be stuck thinking about long after you’ve stopped watching. Robert Eggers got a similar reaction from me after The Lighthouse and now director Julia Ducournau has created something grotesque, unpredictable and unique. You also may remember hearing that Titane won the Palme d’Or at the Cannes Film Festival so clearly some people out there really loved it, that being said I’ll never watch this again.Titane is not going to be for everyone, it will shock you and make you squirm all while intriguing you and reeling you in deeper and deeper because no matter how disgusted you feel watching Titane a part of you can’t help but want to know what the hell will happen next. It was giving off strong David Cronenberg vibes, so if you’re a fan of his movies then there’s a good chance you’ll like Titane. Also recommended for fans of director Julia Ducournau’s other movie Raw. It’s safe to assume if you liked Raw then you’ll probably like Titane too."
    },
    {
      "rating": "8",
      "text": "From the opening scene, Titane continuously doubles down on its own outrageous absurdity until it suddenly pulls back. You go from watching a thriller, to body horror, to something that has a lot to say about what it means to be family. Specifically, what it means to be family in action, not just by blood or oil. Titane somehow addresses gender fluidity, the role of parents to support and accept, the male ego slipping as bodies and testosterone age away, and the opportunity to choose a family not given to you by birth all while bombarding the screen with gore and squirm inducing violence. You find you cannot look away from these disturbing images partly because of how beautifully Titane presents them and partly because they all have something to say. Even though the film may retreat too far from its own deliriousness in the second half, it comes speeding back just in time for a finale that will have you guessing until its last push. Strap in because Titane is one hell of a ride."
    },
    {
      "rating": "7",
      "text": "Visceral, provocative and shocking yet poetic. Greatly acted, beautifully shot, and well written. Definitely not for everyone."
    },
    {
      "rating": "7",
      "text": "To say this movie is weird is an understatement. It's a strange body horror / human drama combination of genres thats surprisingly executed quite well. I loved the acting performances and the cinematography. The premise is strange, but I was always interested to see how the story was going to unfold. Beware, this film definitely won't be for everyone, but for lovers of cinema I think it's worth checking out."
    },
    {
      "rating": "8",
      "text": "A massively uncomfortable film that is still powerful with its emotions. The subject matter and visuals the film shows are internationally EXTREMLY uncomfortable. I felt myself squirming and not feeling right after watching this film which has not happened in a long time but the way the film uses it’s stellar sound design to make you uncomfortable adds to this story of family and accepting others even though our protagonist is a horrible person. The performances and direction here are some of the best of the year with Vincent Lindon being the standout here. He gives an Oscar worthy performances. His wide range of emotions and how his character interacts with our protagonist is powerful and terrifying to watch. I really hope he isn’t snubbed during this year’s award season. The cinematography is pretty great at points with several shots looking absolutely phenomenal. The shots add to this powerful story and even add to the sense of uneasiness especially the final shot. The music while definitely being a weak aspect is still pretty great towards the ending with the final piece sealing the deal with the emotion of it. As much as I would like to recommend this, it’s hard to with how uncomfortable in makes you and I could definitely see some getting physically sick after watching it."
    },
    {
      "rating": "8",
      "text": "Julia Ducournau’s first film was Raw, which was about a vegetarian who develops a taste for raw meat. It established Ducournau as a writer/director with a unique sensibility. This time, Agathe Rousselle plays an exotic dancer who becomes impregnated by a Cadillac and things only get more bizarre from there. Being French, there are lingering shots and introspective moments, in addition to plentiful nudity and moments of violence. Thru all the upended expectations, there’s a tender core with a compelling relationship. Since it’s undeniably twisted and extreme, some will be intrigued, while others will be turned off.  BTW, the title is French for titanium, which is reflected in the implant she receives after a car accident"
    },
    {
      "rating": "7",
      "text": "I liked 'Raw,' but not that much, and I think it happened again with 'Titane.' I mean, this is almost everything I expected it to be, but I felt a little underwhelmed by the end. What didn't convince me was Alexia's psychopathy: what was the reason for it? Still, the acting and the body horror are truly something to behold. And, whatever you do, go see it spoiler-free."
    },
    {
      "rating": "9",
      "text": "I was blown away by this! Ducournau's \"Titane\" might be the best film of 2021 for me."
    },
    {
      "rating": "8",
      "text": "trying to review or analyze this movie will turn your brain into soup, what the **** did I just watch. French filmmakers are wild af"
    },
    {
      "rating": "9",
      "text": "it´s a weird movie but still good!i love Agathe Roussele´s performance so much"
    },
    {
      "rating": "8",
      "text": "everytime i think about this movie my first thought is: wtf. in a good way ofc, i really like this one."
    },
    {
      "rating": "10",
      "text": "- Review before have seen an explanation -This film shows us a surreal and strange world, but with a graceful way of handling the script and a colossal staging. Undoubtedly that this was so unnerving and alluring, both performances and technical / practical field.An indie film in the right hands manifests the biggest quality of the director to make appear a short budget film to a big budget film. It takes liberty of doesn't explain us some important plot gaps, but you don't need at all, because it's intriguing enough and it's totally unforgettable.- Review after have seen an explanation -Now I confirm that this film doesn't need an explanation, all it did was open my eyes a little more, because the representation of some ideas like redemption, affection and a pretty weird way kindliness is obvious now that I think about it and that gives all the meaning to the film."
    },
    {
      "rating": "9",
      "text": "An accurate and strong film but with a relatively weak characterization; Especially in relation to Alexia's character."
    },
    {
      "rating": "9",
      "text": "This film is so freaking cool. I don't know how to describe it, and I also cannot say what kind of person would enjoy it, but I love it. The actors performances are absolutely stellar, truly I haven't seen anything this compelling in a decade. The flow and vibes are so entertaining and the narrative is so gripping that you will be glued to the screen well after the credits roll. Throw away your expectations and get wrapped up in it."
    },
    {
      "rating": "7",
      "text": "Titane, from the flaming Palm d'Or winner Julia Ducournau, it's a story about identity that unfortunately shows too many plot cracks and narrative inconsistencies that tries to cover by trying to shock the viewer as much as possible.I'm not saying the attempt is bad, but in my opinion I could hardly say that I found something memorable in it.I questioned a bit how Julia Ducournau won the most prestigious award at Cannes, although ultimately that's irrelevant if the film would have some sort of legacy in the coming months.After all, it was released in mid-July in France and I hardly see people talking about it anymore. The comparisons with Cronenberg, and even with Lynch will be numerous and have grounds to be so.I can't deny Titane does offers some interesting moments, because frankly I think its ultimate value has more to do with entertainment than what it actually seems to be trying to say.And those attributes are not bad, I liked the style, but the lack of substance is inevitably questionable.Part of me is a little undecided as to how much of the film seeks to be confrontational and how much of it seeks to be enlightening.I question this because crudity is defining in this film, and everything leads to a climax that at that point feels even a bit tamed, since at that point, after everything you've seen so far, you're already desensitized, and the payoff isn't remotely gargantuan or brutal.It's simply the closure that it has been building since the plot lets you know that this is where it's going.And that's precisely the problem, because what you have seen until then makes you believe that it will be something that will make you tremble, and it doesn't happen like that.Because as it occurred with Raw, you end up talking more about the images that shocked you, rather than the underlying themes that the movie also presents, and while that's not necessarily a bad thing, they also make it clear that unless you don't make noise somehow, people won't turn their heads to look at you, and Titane, even with the things I liked, was more noise than content."
    },
    {
      "rating": "10",
      "text": "This is the best movie of 2021 hands down. You will not see a movie like it. She put out Raw (2016) which was an amazing movie and Titane is even better."
    },
    {
      "rating": "9",
      "text": "Presented at the Cannes Film Festival 2021, the second film by Julia Ducournau,that we remember her for having made her debut with “Raw”, returns tto the Cinema with very strong objectives and sensational claims.Alexia, after a severe car accident, survives thanks to a piece of titaniumthat is grafted into her skull: from infancy we pass to youth, wherewe see that the little girl, now grown up (and still with the \"trademark\"on the skull), works as a sexy presenter of dilapidated cars: herself,made up partly of titanium pieces, it's a hybrid, just like a car.Alexia, however, has not been the same since the accident, and this can be seen very wellfrom the splendid scene in which he observes his father in the hospital (typical lookKubrickian), as he said to him “Now here's who I am thanks to you: a monster. \"SPOILER ALERT!!!With the passing of the years, therefore, represses all the anger, until, during oneafter-work night, it explodes, and engages the highest gear, killing anyone it doesyou can find in its radius, on the notes of Caterina Caselli: it is not over, however, returning to house, after having washed herself from the dirty murder, she decides to have sex with a car, which after knocking on her door, seduces her to coitus.Cold and merciless in its action, just like a hybrid engine, after severalescapes and ways not to be recognized, find refuge with a firefighter, withobvious problems of loneliness, which find in her the perfect girl to be able tofill that void.“It doesn't matter who you are, I don't even want to know. ”She tells him during onescene the father to the alleged daughter, after having discovered the harsh truth.A ruthless, raw film without any kind of filter in showing what it isintends to demonstrate: lack of affection, unstable relationships, more lonelinessextreme that finds hope even in a murderer, the creation of a monster, after which the final revelation.The protagonist is very great, who with a few lines, paints a portrait ofcharacter to perfection, making human what is actually titanium, thereforethe opposite.Perfectly in tune with Agathe Rousselle, we find a Vincent Lindon inexcellent form, which gives us one of his best interpretations, managing tomake us understand the pain of a father who, in order not to be alone, welcomesa murderer in his house.Direction of the film excellent, different from the mostly static direction of “Raw”, withmany hand-held camera scenes, pumped by these neon lights that sometimesthey hit the viewer like a fist, while others caress him softly, on the notes of “The Zombies”.A historic moment also for the Cinema: from “The Piano”, where a splendid oneJane Campion won the Palme d'Or, up to \"Titane\", the opposite: twomagnificent portraits, which although different (just like the water of the spectacularscenes from the Campion and the blazing expanses in which Vincent Lindon finds himself),they give something extra to the cinema, and for this we thank them infinitelyboth."
    },
    {
      "rating": "7",
      "text": "not as good as Raw, but a new Julia Ducournau movie is always welcome. also, vincent lindon is really good in this"
    },
    {
      "rating": "10",
      "text": "Omgggg, I love this movie. At first, when I saw it, I juggled with what I'd just seen, but now I haven't been able to stop thinking about it. I am a huge horror fan and delighted to report that Titane falls into the French Extreme category. The premise is such a great idea. I won't say another word so as not to spoil. I wish there were more of this movie. The director is an answered prayer. If you haven't seen Raw, go now."
    },
    {
      "rating": "9",
      "text": "Fearless film-making, and funnier and more intimate than I was expecting, but I guess I missed how feral Raw felt. Still, undoubtedly one of the year's best."
    },
    {
      "rating": "10",
      "text": "I’m still processing this film but I knew immediately after watching it that it was an essential work. I left the theater in pure awe of what was on display. It was a true work of art that is so rare these days. If it’s playing at a theatre near you please take the time out of your schedule and let it work it’s magic on you. 10/10"
    },
    {
      "rating": "10",
      "text": "The first time I watched TITANE by director Julia Ducournau I didn't like it - I was disturbed by the killing of innocent people, therefore I couldn't empathise with the protagonist. But then the movie grew on me, and I loved it. It's just magnificent, there is so much sweetness despite all the horror Alexia is immersed in. The movie ultimately is about the redemption brought by love. And what a soundtrack! True masterpieces stay with you, no matter how much you disliked them in the beginning."
    },
    {
      "rating": "7",
      "text": "UmmmmOKInteresting acting, odd story with poor pacing, I don't know if it's good or not to be honest.Now.... The ending makes absolutely no sense at all. Hell the whole movie makes no sense. Then again neither does tetsuo soooo there is that lol"
    },
    {
      "rating": "8",
      "text": "It's definitely very weird but the performances and story is very good with some amazing sound design."
    },
    {
      "rating": "7",
      "text": "I'm a big fan of this director's previous film, Raw, but Titane didn't really work for me.  There were just too many ridiculous moments that took me out of the experience.  The performances and cinematography were excellent again, but the plot felt very thin and very random.  Check it out if you're looking for something VERY unconventional."
    },
    {
      "rating": "0",
      "text": "A terribly stupid and illogical picture. Forced and boring. One of the worst films I have seen lately. a complete waste of time."
    }
  ],
  "recommendations": [
    "antichrist",
    "under_the_skin",
    "the_machinist",
    "enemy",
    "us",
    "the_killing_of_a_sacred_deer",
    "you_were_never_really_here",
    "donnie_darko",
    "a_history_of_violence",
    "a_clockwork_orange",
    "the_lobster",
    "mother",
    "eyes_wide_shut",
    "the_green_knight",
    "a_cure_for_wellness",
    "sleeping_beauty",
    "apocalypto",
    "black_swan",
    "antebellum",
    "no_country_for_old_men",
    "a_ghost_story",
    "annihilation",
    "the_invisible_man",
    "perfume_the_story_of_a_murderer",
    "zero_dark_thirty"
  ]
}