{
  "id": 336,
  "title": "Titanic",
  "starring": [
    "Leonardo DiCaprio",
    "Kate Winslet"
  ],
  "runtime": 194,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "101-year-old Rose DeWitt Bukater tells the story of her life aboard the Titanic, 84 years later. A young Rose boards the ship with her mother and fiancé. Meanwhile, Jack Dawson and Fabrizio De Rossi win third-class tickets aboard the ship. Rose tells the whole story from Titanic's departure through to its death—on its first and last voyage—on April 15, 1912.",
  "releaseYear": "1997",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg",
  "categories": {
    "plot": 7.617647058823529,
    "acting": 8.166666666666666,
    "ending": 8.0,
    "soundtrack": 10.0,
    "cinematography": 6.5,
    "familyFriendly": 6.0,
    "funny": 10.0,
    "action": 9.8
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Titanic is the movie which really made me respect James Cameron as a film maker. He had made excellent movies before such as Terminator 1 and 2, True Lies, and Aliens, but Titanic is really different. Here he offers excellent and believable characters, stunning visuals and a compelling story. This movie is truly a 10!"
    },
    {
      "rating": "10",
      "text": "I can't believe some people don't like this film. It is timeless, I have seen it at least 15 times and would gladly watch it another 30 (I probably will). One of the rare movies that can make me cry every time. However, it is not the \"I'll never let go\" part that sets me off...it's the old people cuddling in bed and the mother reading one last story to her children..because you know then that they have lost all hope. Truly beautiful."
    },
    {
      "rating": "10",
      "text": "Beautiful movie....\r This movie is the greatest in Romantic genre.\r Perfect movie by James Cameroon.\r Perfect acting by  Leonardo DiCaprio, Kate Winslet"
    },
    {
      "rating": "10",
      "text": "to all you people who claim its bad, only because you dont like romance or that it wasn't actiony enough for you: dont comment on how good a movie it is if you cant stand apart from personal opinion. its a damn good movie and even if you don't like romance or epic 11 TIME OSCAR WINNERS -may i point out-you have to admit its amazing. i love it and will always love it."
    },
    {
      "rating": "10",
      "text": "This is by far the best movie ever made! he acting is amazing and the effects are perfect and the score is lifealtering. you will cry your heart out! the movie will change your life. after seeing it, i was numb and cried every time someone even mentioned titanic....... and i am a 14 year old boy! best movie ever!"
    },
    {
      "rating": "10",
      "text": "This is the best movie ever. Those who say that it's horrible, are just people without feelings. If you are sentimental, you love love stories, you will definetily will love this movie. Kate ands Leonardo are just great. The whole movie is great. The best of all times."
    },
    {
      "rating": "10",
      "text": "Why do people hate this movie? Because they are flawed, they are jealous about how a movie like Titanic can be this perfect.Universally acclaimed and adored, perfect box office record, Oscar-sweep, all time hit soundtrack and the whole phenomenal. Titanic haters will always be remembered as loser, or they are just emotionally retarded."
    },
    {
      "rating": "10",
      "text": "One Of The Saddest Movies Ever MadeTitanic is absolutely beautiful from start to finish."
    },
    {
      "rating": "3",
      "text": "If director James Cameron had concentrated on his thesis -- that the sailing of the Titanic basically marked the transition from 19th Century ideas of classism to 20th Century notions of egalitarianism -- and had ignored the boring love story, this could have been a far more impactful feature."
    },
    {
      "rating": "10",
      "text": "I can't believe some people don't like this film.Titanic is best movie that I saw in my lifetime. With the wonderful artist Leonardo DiCaprio and Kate Winselt, I love them."
    },
    {
      "rating": "3",
      "text": "Ordinary and and utterly predictable piece of storytelling. Special effects are great but that doesn't make up for this bloated and dull movie.How it won the best picture oscar is anyones guess."
    },
    {
      "rating": "3",
      "text": "It is a very boring movie I fell asleep watching it and the truth is that it is not enjoyable at all and the \"action\" scenes are very pathetic"
    },
    {
      "rating": "3",
      "text": "does anyone ACTUALLY remember this movie lol, total chick flick... PASS. gave it a three because at least it had a little \"something something\" for the guys heh"
    },
    {
      "rating": "8",
      "text": "The special effects and the intense tragedy of the sinking ship are well told, the romantic cut and paste story is cheese. Titanic is a good movie for sure but does show more than any other that its not the best movies that make the most money."
    },
    {
      "rating": "10",
      "text": "Unbelievable movie. I think everybody should go back to when he first watched this movie and no judge after watching it several times . Great love story that cannot be repeated in any other movie!"
    },
    {
      "rating": "8",
      "text": "Titanic , the best romance I saw in my life , but for \" Passengers\" , which DiCaprio and Winslet good boys , but a remembered romance agerridos roamed where a cruise ship was about to sink and those dead passengers by the frozen water of the Atlantic , but I think if you cease to be Chris Pratt and Jennifer Lawrence fail to strike wing romance that will have space and I want to see , but this movie is incredible ."
    },
    {
      "rating": "10",
      "text": "Titanic has stunning visual effects and wonderful acting from the versatile cast. Dicaprio, Winslet, Zane and\rBates give brilliant performances. The movie has action, drama, romance, and suspense. There's nothing\rmore that a filmgoer could ask for."
    },
    {
      "rating": "10",
      "text": "This movie was a good makeing. It really explains true love. But it also makes you think twice before getting on a ship or a boat in the icey waters."
    },
    {
      "rating": "9",
      "text": "A friend asked me, Will the movie look exactly the same as 1997s version? . I spontaneously told him, Well, the ship will still be sinking. Ha ha"
    },
    {
      "rating": "8",
      "text": "It's not that great of a movie, but Titanic caught in the eye-popping excitement during the last bit of minutes of the movie. Sometimes, it may or may not be worth seeing the entire movie."
    },
    {
      "rating": "2",
      "text": "The main reason everybody likes this movie is because of the last 30 minutes where the boat sinks, it's awesome but that means the rest of the movie is irrelevant. Leonardo Di Caprio and Kate Winslet are a terrible couple and the only chemistry is between the ship and the iceberg."
    },
    {
      "rating": "10",
      "text": "to fans of James Cameron, what could possibly go wrong? its an awesome movie of all time."
    },
    {
      "rating": "8",
      "text": "I remember watching this movie on VHS when it first came out and my sisters and I watched it twice in the first day we owned. A must see romance movie and suprisingly rather good."
    },
    {
      "rating": "10",
      "text": "Titanic: an epic masterpiece of cinema to say the least. Not to mention THE MOVIE people love to hate, because for whatever reason pretentious people can't stand the idea that the greatest film can also be the most popular. Titanic is my favorite movie of all time, and in my modest opinion the best movie ever made. The acting regardless of what people say is brilliant. Leo and Kate have excellent chemistry and were both perfect choices for their roles. Billy Zane plays a perfect high class villain. And, who could forget the tender and touching performance of the late Gloria Stuart. The movie is historically accurate to the last detail (up to that point) and if you disagree, you don't know the titanic yourself. James Cameron had the top titanic historians on set at all times, as well as early 20th century etiquette experts training 150 permanent extras on behavior and mannerisms. Not to mention the brilliant set pieces and cinematography! The full sized set of the ship was the icing, and not a dollar of his record breaking budget was misspent. From the eerie opening dive scene, to the sunny days at sea meeting the characters, to the captivating and dramatic sinking scene, and of course the famous ending kiss atop the grand staircase, titanic is an experience. An experience of love, greed, class separation, dreams, loss, and closure: things that the audience can still relate to 100 years after the origina of the film. You aren't human if you didn't shed a tear at this film, because like it or not it's hear wrenching. All in all, this film is beautiful. Despite what you may think, it won 11 Oscars for a reason, and is a must see for film for people of all ages (after all, it's been my favorite film since I was 3)."
    },
    {
      "rating": "10",
      "text": "Titanic is easily James Cameron's best movie, and it earns this with flying colors. The movie is beautifully shot, frame-by-frame, paying careful attention to detail; Leo and Kate's performances are some of cinema's most memorable; and the musical score is mesmerizing. With some of the most memorable lines in cinematic history and true beauty, Titanic deserves its Best Picture Oscar entirely."
    },
    {
      "rating": "10",
      "text": "Titanic is one of those movies that touches you, it is a great romance movie that possibly everyone had a love at first sight, it's has great scenes of action and some 18+ scenes as well. Overall a great movie that is also the 2nd best selling movie and with a witness telling her story"
    },
    {
      "rating": "10",
      "text": "Overall just amazing even today. Really isn't that many movies that captured me like this one. The older you get, the more I feel you enjoy it. Soundtrack, Characters, Story, etc. Worth it. Starts out a little slow but picks up later."
    },
    {
      "rating": "10",
      "text": "\"Based on the tragedy that spawned thousands of heartbreaking true stories, comes this fake one.\"It's time to decide: was it insensitive and somewhat cheap of James Cameron to throw two made-up passengers who fall in love onto the ship? Or did these two characters offer the audience an anchor to hold onto as we are guided through the dreadful events of April 15th, 1912? Without a doubt, the latter. The fictional story of Jack and Rose never distracts from the tragic true story, it cinematically enhances it. We never ever miss the bigger picture.First of all, just look at this film. The resplendent wonder of the film's set design, both interior and exterior, places you right on board. It looks and feels the part. And when the inevitable disaster strikes, Cameron grabs onto you and drags you through each painful moment in striking detail. The sinking of the Titanic is brought to life with exquisite attention to detail and astonishing visual effects. It makes for the greatest disaster scenes in any movie I've seen.However, a Roland Emmerich or Michael Bay film this is not, as Cameron never allows the spectacle to distract us from the agony of it. Watching the Titanic being destroyed is not fun or, in its broadest sense, exciting - it's intensely distressing. Unlike most disaster films, it never feels like we're watching a crowd of extras on a film set flailing around. The lead up to the iceberg strike engages you so convincingly in the period, such that each person in front of the camera has been imbued with rich character. And when the ship sinks, it genuinely shocks you to see them go. For a good part of the sinking, Jack and Rose's fictional plight is quite sensibly placed to one side, giving us time to reflect on the truth and how it would have felt to be aboard the ship that horrifying night.So aside from its sweeping spectacle and moving depiction of real-life tragedy, what does the story of Jack and Rose bring to the table? In spite of how persuasive the film is, one must remember - it's ultimately a work of fiction, not a documentary. Like any period drama, it is an interpretation of how society worked at the time. Jack and Rose, as well as being beautifully played by DiCaprio and Winslet, are incredibly well crafted. They are a window into a much more subtle form of racism, which is still prevalent today. It's called class, and in the latter half of the movie, it becomes a tool with which to decide who lives and who dies.Titanic has pretty much anything you can ask for. It's a romance; it's a disaster movie; it's an action film; it's got a sense of humour and wit; it's a period drama; it's a tragedy. Summed up, Titanic is about as perfect a cinematic experience as you're ever likely to get."
    },
    {
      "rating": "10",
      "text": "This movie is simply beautiful. It was well written and had great actors in it and most of all it captures the audience watching it. It is long, however it's definitely worth every minute of it. I'm likely a little biased since my birthday is April 14, the same day that it crashed, but trying to be as little biased as possible I would have to recommend this movie to anybody looking for a good movie to watch. It's definitely a classic and will go down in history as a great movie."
    },
    {
      "rating": "10",
      "text": "Titanic gives audiences around the nation a hope that love can be found anywhere, even on a sinking ship.  In the film Titanic we follow the love story between two characters who go by the name of Rose and Jack.  The discover love in a place that many people would not think you could.  Their love is tested when the Titanic hits an ice berg.  The director of Titanic is James Cameron and based on his past film you can guess that Titanic will be a film to remember.  Cameron's dedication to the film shows through the finished product of the film.  He studied the Titanic for many months before he started writing this film because he wanted the audience to feel as though they were sailing on the ship with Rose and Jack.  He achieves this goal making audiences feel fully emerged in the whole story.  Titanic is rate PG-13 and I strongly advise children under the age 13 to go to the movie with a parent because there are some nude scenes and fowl language.  This film can be seen by both male and female because it has an adventurous side and a romantic side.  I would strongly advise seeing this movie because it leaves you with a feeling of hope and completion.  I enjoyed the movie and would defiantly go and see it again. James Cameron has once again made a classic movie that will go down in history."
    },
    {
      "rating": "10",
      "text": "A mostly unqualified triumph for James Cameron, who offers a dizzying blend of spectacular visuals and old-fashioned melodrama. It is truly his best film and one of my favorite movies of all time. I'm gonna give Titanic an A+."
    },
    {
      "rating": "10",
      "text": "Absolutely a piece of art. I don't really don't mind why people are going to say this film is the worst ever made etc.. blaming graphics effects.. or the main plot.. while with no doubts it is extremely emotional and full of love.. it's not such common to look at one love story with such emphaty, basically this film won't never die."
    },
    {
      "rating": "10",
      "text": "This was magnificent woooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooow"
    },
    {
      "rating": "10",
      "text": "This is a great movie.. Actually my favorite movie.. After watching this movie my favorite director is James Cameron, my favorite actor is Leonardo Dicaprio, my favorite song is My heart will go on and my favorite singer is Céline Dion.. This is a perfect movie.. Romantic, emotional, dramatic.. Its direction, visual effects, story telling, screenplay, story and cast is great.. This is my all time favorite movie.. Really love it.. I can watch this movie anytime.. in any mood... And one more thing kate Winslet is looking damn gorgeous in this movie..."
    },
    {
      "rating": "9",
      "text": "Titanic is an achievement of incredible practical effects, and it manages to be a three hour long movie that doesn't have much filler or feel its length. The love story may be cliche and the historical accuracy may not be 100%, but the film still has some surprises up its sleve."
    },
    {
      "rating": "9",
      "text": "Titanic is a movie merging two characters coming from completely different social backgrounds on the ill-fated ship. I don't understand why lots of people didn't like this movie. Q: Why is it such a \"sappy\" love story?A: It's a trick used to make us love the main characters, so that when one of them dies, we feel sadness for all the other people that died with the ship.Q: Why such a terrible script?A: Seriously? It's brilliantly written. In fact, it closely has some of the aspects that the blockbuster \"Inception\" contains. You have to look closer than the dialogue and the actions of the story. Writing a screenplay is a very hard job. You have to symbolize with almost everything. You have to feel what the characters are feeling and how they would react to certain situations. Plus, there it has a pretty big plot behind it (you've got the heart of the ocean, the painting, the whistle, the hair pin, etc) that has to be weaved together... and this can be a VERY messy process that takes a LONG time to clean up. It's a slap in the face when someone says your work, in which you worked five years on, is horrible.Q: Why the best picture?A: Come on, it was the 90's. In that decade, picture wasn't that great considering it was VHS. And when they talk about best picture, they don't just talk about how HD the film is. They talk about the colors, the cinematography, the lighting, etc.Q: Why the cheesy dialogue?A: Okay, try writing a play right now. What would you say if you were in water BELOW FREEZING and you knew you were going to die. What would you say to your lover? It's not cheesy, and it's not dumb. It's well thought out. I have to go through my written dialogue many times before it seems right. The dialogue also has to move the story forward, which is what happened in the film. Q: Wow, there's no action before the sinking. Why?A: What if Titanic was written differently? Maybe it introduces a thief on the ship who tries to kill everyone on board, and actually knocked the captain off the ship and drove it into the iceberg? It would be completely stupid. It doesn't follow history. Now, I know Jack and Rose are both fictitious characters, but there were many people on board the ship that had relationships. It's not like they knew the Titanic was going to sink and broke up so that it wasn't as depressing...I'd just like to say that lots of people under-rate Titanic because it's a romance. Come on, there's actually a penis joke during a dinner scene. People are way to picky. You wanted to see a film of a ship sinking, and that's what you got. I give this film a 9/10."
    },
    {
      "rating": "4",
      "text": "A silly unrealistic and inaccurate sappy love story. I never really have understood why it is so critically acclaimed. Luckily critics and people have seen this fact to (with it's scores that dropped on rotten tomatoes after it was re-released in 3D). A lot of people say that this film features a \"classic\" love story but there's nothing \"classic\" about it. Star-crossed lovers that couldn't ever be together due to society and a tragic ending resulting the death of one of them. Sound a bit familiar? it should. No, not every aspect of Titanic is horrible. It's visually amazing for one but that's its sole redeeming quality for me. I'm sorry but this did NOT deserve best picture."
    },
    {
      "rating": "10",
      "text": "What a romantic and sad but bombastic peace of drama this movie is. Sometimes it just all comes together and you are taken away ti a different world by a movie and this is a perfect example of that. Di caprio's best movie for me. He's so perfectly made for the part of young guy who feels true love for the first time and the drama that splashes it all away in the end. The finale of the movie shows us  the most sad image ever shown BY FAR (of 2 old people holding on 2 each other coz they lose the fight with he water first))is just emotional perfection. Awesome peace of history-telling. SEE IT!"
    },
    {
      "rating": "8",
      "text": "A very slightly blandish story. Just slightly, but James Cameron's \"Titanic\" still remains one of his best efforts with the help of some strong film-making."
    },
    {
      "rating": "3",
      "text": "Maybe the most overrated movie ever.  Special effects meet a dopey screenplay and bad acting.  The plot:  Kate Winslet's boyfriend gets her the biggest diamond in the world, and takes her to NYC in the biggest stateroom in the biggest ocean liner in the world.  She pays him back by banging a guy from steerage in front of all his friends.  What a trollop.  The only disappointment is that this cheap whore didn't go down with the boat.  Love story?  Only if you think a cheating tramp is a heroine."
    },
    {
      "rating": "7",
      "text": "James Cameron's 1997 movie epic garnered instant acclaim upon release, grossed over 1 billion dollars at the box office (Avatar would beat this record over a decade later) and was given the dubious honor of being the most expensive production of all time. The plot tells of a poor steerage passenger named Jack Dawson who forms a romantic relationship with first class passenger Rose DeWitt Bukater onboard the \"unsinkable\" RMS Titanic. The film focuses mainly on the relationship between the duo up until the point the great ship strikes an iceberg and sinks rapidly, transforming it into a typical big budget summer blockbuster that tries to be more than just popcorn entertainment. The acting is decent, with Leonardo DiCaprio and Kate Winslet giving dramatic performances that are fueled by the romance between the two. Billy Zane is also good as Cal Hockley, a wealthy tycoon who plans to marry Rose. Overall, the film is good but one major complaint must be addressed. I think that the film uses one of the greatest tragedies in history to its advantage just a bit too much. Of course, Cameron had been on dives to the real wreck of the actual ship himself during filming and was very much moved by it, but his feelings and emotions towards the events are not portrayed very well on film. As is typical with many Hollywood epics, a small proportion of the what happens during the sinking is historically inaccurate but apart from that it leaves an overwhelming sense of grief upon you. Actually, that grief may be the reason why the film has received so much backlash in recent years, because the first time you see it, men and women will get teary-eyed in the end, but after a number of times it just isn't the same and you wish you were seeing it for the first time instead. All in all, a masterpiece as a standalone disaster film but a tad disappointing as a historically accurate Titanic film. If you wish to see a factual version, the 1958 film A Night to Remember may be more your cup of tea."
    },
    {
      "rating": "10",
      "text": "this movie is THE BEST FILM IN THE HISTORY OF MOTION PICTURES. oh and stephen B, feel free to hit me up so i can beat your faggot ass to pieces for disrespecting the best movie of all time. man up or shut the fuck up you faggot nobody."
    },
    {
      "rating": "3",
      "text": "The story of the Titanic is well known and so the backing plot will not come as a surprise. However the Writers thought that they had to MAKE a story to make the film. This consisted in a Terrible Love story, Weak characters and a stupid run time. The performances, cinematography and special effects were good. But the character development was rubbish and I really did not get emotional involved with anyone. There was no real suspense which I know can be done in a film like this if the characters get under your skin. I would have prefered to stay more with the people who were left to die rather than see the film through the eyes of the Gentry aboard the HMS Titanic. The scene with Rose and Jack and the painting... What was the point? did we need to have it other than just to make it news worthy. I cannot believe that this film grossed as much as it did. People went Back to see it. Was there something they missed? Maybe they went back to search for a plot but that went down with the ship."
    },
    {
      "rating": "10",
      "text": "Wonderful."
    },
    {
      "rating": "10",
      "text": "Titanic is considered the best movie of the all time. i see why they have a great titanic, actors, director and a biutiful history of the most biutiful transatlantic ha ever see the world."
    },
    {
      "rating": "10",
      "text": "The 3D doesn't matter. I mean it's the best that your going to get from post conversion but it's nothing special. What's special is this masterpiece back on the big screen where it belongs. If I had the money to blow I could watch this 3 hour picture perfect film over and over again. The sound and the big screen are enough. If you haven't seen it in theaters watch it before it's gone!"
    },
    {
      "rating": "10",
      "text": "A heart throbbing movie with enchanting music and amazing effects. The storyline was near perfect  and was tear-jerking for many of its viewers. James Cameron rarely disappoints his audience."
    },
    {
      "rating": "6",
      "text": "Cameron's disaster-to-come love story is as original as they come but overall is overrated and over hyped. It is visually impressive (Again, James Cameron) but when it comes to love stories, it tends to weigh on after the first hour. Titanic has three hours attached to it. Are they worthwhile? That's up to you as a viewer because everyone's viewpoint is different. For me, this film rests as an above average love story with spectacular visuals."
    },
    {
      "rating": "10",
      "text": "i love james camerons creativity in avatar and  titanic . james cameron makes a movie while finding the real titanic it builds up to an adventure  . and the fact the boat is sinking thats  the best part of all"
    },
    {
      "rating": "5",
      "text": "Okay, now to be honest, this movie is fine but the mistakes or crap were:\r1. Leonardo DiCaprio and Kate Winslet make an awful couple.\r2. Some parts were boring.\rThe only thing I like is the Ship R.M.S. Titanic sinking but I hate to see a lot of people died. The lines were okay. The graphics are great, especially in 3D. The characters were kinda dumb (except for the real people: Captain Smith, Officers, John Jacob Astor, etc.) but dumb cause of awful couple."
    }
  ]
}