{
  "id": 3318,
  "title": "TMNT",
  "starring": [
    "James Arnold Taylor",
    "Mitchell Whitfield"
  ],
  "runtime": 87,
  "genre": [
    "Adventure",
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "After the defeat of their old arch nemesis, The Shredder, the Turtles have grown apart as a family. Struggling to keep them together, their rat sensei, Splinter, becomes worried when strange things begin to brew in New York City.",
  "releaseYear": "2007",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ksguZE9rTtsRJlhTO59WNmPNjOR.jpg",
  "categories": {
    "plot": 7.642857142857143,
    "acting": 7.95,
    "ending": 8.5,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 7.2,
    "funny": 7.916666666666667,
    "action": 7.6923076923076925
  },
  "reviews": [
    {
      "rating": "5",
      "text": "TMNT was almost entertaining movie but little emotion is lost but what the film is about the Ninja Turtles, I will keep this before the sequel in another year comes."
    },
    {
      "rating": "4",
      "text": "TMNT is just not what it should be.\rThe movie begins with an intriguing storyline a fair justice to the original characters and an okay concept all in all. It then takes a turn for the worst when the story turns into garbage."
    },
    {
      "rating": "5",
      "text": "The visual effects chosen for this film were intriguingly fun to watch, but the film never lives up to an exciting storytelling standard and feels normal."
    },
    {
      "rating": "5",
      "text": "Love the fact that they are bringing back the series but I didn't enjoy the plot way too far out there. TMNT is great CG and with voices that bring back the nostalgic memories of the old Turtle movies but the sci-fi storyline just didn't do it for me."
    },
    {
      "rating": "7",
      "text": "this is a really good Ninja Turtle movie it explores the universe of the turtles and their characters really well and is well acted and animated. it may be difficult for newcomers and the plot may not make the greatest sense but i still enjoy it"
    },
    {
      "rating": "5",
      "text": "A rather dull imagining of the turtles. The action is stale, the humor almost non-existant, and the plot is nothing more than generic sci-fi mumbo jumbo about an immortality curse. The whole thing is just boring. Which is a shame considering there are hints in the movie that it's actually the fourth entry in the original movie series, rather than just some one off thing or a tie-in to that TV show.\r There's not enough enjoyable stuff here to make it one that's recommendable for younger audiences. It's moodier tone implies that it's aimed at adult, or at least older, TMNT fans, but the overall laziness of the project will probably turn them off as well. At least the animation is decent (although dated by today's standards). What we get here is a TMNT movie that lacks the qualities that make the series so enjoyable."
    },
    {
      "rating": "10",
      "text": "This movie is exactly what it needed to be for TMNT fans. All the critics hating it don't truly love the TMNT. For those who love the TMNT, this is your movie."
    },
    {
      "rating": "8",
      "text": "A very special movie for me! I grew up on the TMNT series and this movie is really awesome! I would give it a 10/10 but i just missed The Shredder  Also Raph and Leo conflict was really annoying. So my final verdict is 8/10. Highly recommended for all tmnt fans and action animation lovers!"
    },
    {
      "rating": "2",
      "text": "A highly anticipated movie that is destined only to disappoint millions. One of the biggest animation and studio mistakes ever used to Finish off a chapter in comic book history. A shame."
    },
    {
      "rating": "0",
      "text": "In a generation that grew up to these warriors, it is a shame that we have to pay for it with a movie like this. One of the most immature, pathetic, and heartless animated movies to hit the screens in the last decade. Absolutely terrible in nearly every way possible. F"
    },
    {
      "rating": "1",
      "text": "The fact that TNMT was woeful in the first place doesn't put this movie in good stead. I know people love to relive the turtles but it's not a franchise that deserves a full feature-length movie. And soon there's going to be Transformers for gods sake. Has Hollywood run out of good ideas or has it been taken over by lifeless nerds?"
    },
    {
      "rating": "4",
      "text": "Unrealized story."
    },
    {
      "rating": "10",
      "text": "Anyone who says this movie was terrible or did a disservice to their childhood needs a wake-up call: go netflix the old shows and actually try and sit through them. They're painful to watch and one does more eye-rolling than watching the screen. The first TMNT film added a slick, hip quality to the characters we already loved, and it still holds up to this day. This new one is a continuation of that precedent. I'm sorry that so many comic book fans were so disappointed that this film doesn't adhere to the pre-TV stories, but they should realize that neither did the TV show, nor did ANY of the films. The real problem with those who didn't like this movie is that they forgot what Turtles are all about. They're about monstrous villians, internal conflict, teamwork, lighthearted one-liners, and kicking butt. This movie is a marked improvement over part 3, and is a fantastic addition to the phenomenon. It deserves a lot more credit than people are giving. The whole audience in the theater was laughing at the jokes, and there was actually some applause at the end. Shame on those who forgot what it means to be green. Turtle Power."
    },
    {
      "rating": "8",
      "text": "The teenage mutant ninja turtles are great characters and this movie is too!\r I must say the animation is well done, voices: good action: very good.\r Kids will love this film and the action as well."
    },
    {
      "rating": "8",
      "text": "this movie is by far an entertaining CGI treat"
    },
    {
      "rating": "7",
      "text": "Pretty much exactly what I would expect from a TMNT film  more or less. Animation is fantastic. Voice acting is pretty good, the turtles do sound very close to their cartoon counterparts. If anything this version of TMNT is perhaps closer to the comic than it is to the cartoon show. But if I had to criticize, it does tend to pander to the \"mass market\" mentality, and that's a shame.  The movie does have some good moments and some real depth. But they get swept aside for some kind of gratuitous action sequence or needless comic relief. Overall: It has the rough makings of a TMNT film of legend, but falls short simply so it can appeal to the masses. Still, it is highly enjoyable and a must watch for fans of the series."
    },
    {
      "rating": "7",
      "text": "The story is a bit confusing, and I'm not quite sure if it follows the past movies or the 2003 cartoon. Probably the latter. The animation is decent and well done. The voice actors get their job done and it is a very entertaining film."
    },
    {
      "rating": "9",
      "text": "I probably should have give it a 7 or an 8, but my fanboy kicked in just because it's TMNT.  The turtles themselves were beautifully designed and looked great, but the humans were crazy disproportionate and I just plain didn't care for the design of Splinter.  I know it's an art style, it's just one I don't care for.  Otherwise, I think the voice actors did a great job, as well as the story writers and director.  This really is just basically another Turtles side story and on the big screen.  Still, this film was great fun, funny, and action packed!  A great relaxer movie, and good for the kids.  Fun for the whole family!  Just don't forget the 'Za!"
    },
    {
      "rating": "8",
      "text": "For those more \"sophisticated\" fans: I'll be the first to admit that this wasn't as great as the older, live-action TMNT movies from the 90's, but it's not as bad as you think. If you're a fan of the old movies and cartoon, and you haven't seen this new one yet because of some fear that it won't live up to the old, then do yourself a favor and disregard all the critics' reviews and just go see the movie. That's the ONLY way you can says if it's good or bad. -I thought the movie was going to suck and worried about it, but I was surprised that it turned out a lot better than I thought it would. There IS a story here, though it's not as strong as the older ones. There's a nice family dynamic presented and at least the writers tried something new, since the story takes place after all the previous movies. The characters are well-developed (like the older movies, Raph.'s the most believeable of the four brothers), and there are some deeper themes here. The music is pretty good and emphasizes the action well, and the cgi was great (the fight scenes were very well done). It's actually quite funny and even though the ending is pretty predictable, the rest of the story is NOT. The four turtles' voices are perfect and most of the other characters as well, but Splinter sounds comical (not in the good way). -So to sum up, I give this movie a 10 for style, an 8 for jokes, and a 2 for stealth (those who've seen the movie know what I'm talking about)."
    },
    {
      "rating": "3",
      "text": "Thanks for ruining my childhood."
    },
    {
      "rating": "1",
      "text": "The wierd rubber costumes and awesomely cheesy jokes are gone, and everything that made the originals fun are gone with them. A classic for the 80s and early 90s generation has been turned in to a completely unenjoyable kids movie. Hopefully this won't be done again with Transformers this summer, and hopefully Thundercats won't attempt to be revived like it."
    },
    {
      "rating": "9",
      "text": "For the first 1/2 hour the movie made me yearn for the good ole rubber suits and all that it entailed. Watching the rooftop turtle on turtle battle changed my mind, with gorgeous CG raindrops dancing differently on metal and green skin. This movie is escapist fun. Those looking for plot, look elsewhere. I mean, come on, have you ever really watched one of the old cartoons. No plot. Ever. None. Why would the movie be different? The last three of them certainly weren't. If you want a plot go read a book. I suggest The Third Policeman. You'll spend the next three months figuring it out."
    },
    {
      "rating": "9",
      "text": "I can't believe people wanted this to be something like the old 80's cartoons...people, have you watched those cartoons recently? This does homage to all that is teenage mutant ninja turtles and does not fall into a campy feel as the live action movies and original cartoons did. The action scenes, animation and voice acting for the four turtles is top notch bringing a more grown up feel to their relationship with conflicts and bonding. The story may be lacking in complexity as its aimed to be seen by kids too but this does not detract from the movie. Comparing this one to what you felt when you watched the original cartoons when you were a kid is just inexcusable...and it just means you never \"really\" loved them at all."
    },
    {
      "rating": "0",
      "text": "Terrible. One of the worst films ever realized. I hated every minute of it and wish not to talk about it."
    },
    {
      "rating": "10",
      "text": "Get over it people! The 87 toon is a considered a disgrace to the TMNT franchise. The creators wanted this movie to have nothing to do with the 87 show, so stop saying this movie raped your childhood. This is the real TMNT!"
    },
    {
      "rating": "5",
      "text": "Rainy day, had free passes, took the kids...meh. It held their attention for most of it, and the fight scenes were technically competent, but the plot was pretty weak, coming from a non-fan anyway..."
    },
    {
      "rating": "9",
      "text": "If you are willing to take the concept of Mutant Ninja Turtles seriously, you will enjoy this film. Old people and cynics that think of the TMNT as ludicrous before even watching it (like Roeper and the majority of the critics) shouldn't bother trying to review the movie objectively. Actually, they didn't try to review TMNT _objectively_, so good on them... I guess. Simply put, this movie is a landmark in American animation, particularly CG. Done with an unprecedented low budget, and with action and characterization far more mature than virtually any other CGI film, TMNT is something the genre has never attempted before. More of a humorous action-adventure story than family funny, this film defies all preconceived notions. The TMNT aren't a one note farce, the threat they face ties into the general theme of their development through the film, and the many impressive action sequences, in conjunction with the darker character designs reveal a CGI film unlike any other released in the U.S. Whatever formulas this film follows, the funny-animal family fest is not one of them, although character based humor is very present in the film. This movie really appeals to the comic geek demographic: people that are old enough but also eccentric enough (at least in todays world) to take a story about four mutated turtle brothers trained in the martial arts seriously, and to go along for the ride. If you won't, you won't, but TMNT does everything it can to convince those straddling the fence."
    },
    {
      "rating": "7",
      "text": "Not perfect, but damn admirable. The movie itself isn't groundbreaking folks...it's giant, talking ninja-trained turtles, gang. BUT, as a fan since their premiere in the 80's, look, it's worth the ticket price. Newcommer Imagi shows a lot of potential as a strong contender in the animation front. Biggest beef: the story's to BIG for the TMNT. They should be about survival and fighting personal baddies, not saving the world. Try and get it right in the sequel!"
    },
    {
      "rating": "10",
      "text": "I don't know if a lot of people realize it or not, but because of TV animation limitations and the live action limitations of having to wear the suits, but this is the first time we get to see NINJA Turtles actually DO martial arts. Critics don't get this movie, who cares if this isn't the Turtles of your youth. Go watch those old shows they are worse than you remember them. This is how they always should have been!!!! This movie is all action and never stops. Other than a few personal aesthetic choices of April O"
    },
    {
      "rating": "10",
      "text": "This movie was GREAT. As is usually the case for these things, the people who don't like the movie are going for entirely the wrong reasons. Nostalgia is a funny thing, and people who try to pander to it's call are almost always dissapointed. This movie is NOT supposed to make fans of the old cartoon feel like they're 8 again, and thank goodness because that's a stupid goal to achieve. If youa ctually LIKE the Ninja Turtles for what they are, and not what they remind you of, you will LOVE this movie. Everything about the team is realized better than it has every been, and it's clear that the artist are big fans of the material. I mean, I'm not sure people realize this, but this is the first time we've actually gotten to SEE the ninja turtles be ninjas and practice martial arts. The aniamtions is amazing, and for the first time, a lot ofpeople are going to be exposed to some of the more edgy material from the comics. The voices that I thought were going to be annoying, weren't. The jokes that I thought were going to make me groan diddn't. Some even made me laugh. It's important to note two things though. 1) this is an all encompassing version fo the turtles that seems to agknowledge all prevoius versions. Casey Jonea nd April are from the newer cartoon. Raph and the Foot clan are from the old movies. Leonardo seems more from the comic books, and Donatello and Michaelango seem more from the cartoons. Don't be surprised if something isn't just as you remember it. Also, the movie assumes a LOT of time has passed since you last saw the turtles since every adventure you have seen acutally happend. They really did go though time, (the time sceptre thing shows up in the background) THey really did fight shredder, and they probably really did a number of other adventures. So, don't be shocked and mad when characters aren't doing what they did in the first movie. April has moved up from being a reporter, and has apparently learned martial arts from her best friends, which makes sense. Casey and APrila re a couple now, which makes sense. Go see this movie. It's the best version of the Turtles yet."
    },
    {
      "rating": "8",
      "text": "For those more \"sophisticated\" fans: I'll be the first to admit that this wasn't as great as the older, live-action TMNT movies from the 90's, but it's not as bad as you think. If you're a fan of the old movies and cartoon, and you haven't seen this new one yet because of some fear that it won't live up to the old, then do yourself a favor and disregard all the critics' reviews and just go see the movie. That's the ONLY way you can says if it's good or bad. -I thought the movie was going to suck and worried about it, but I was surprised that it turned out a lot better than I thought it would. There IS a story here, though it's not as strong as the older ones. There's a nice family dynamic presented and at least the writers tried something new, since the story takes place after all the previous movies. The characters are well-developed (like the older movies, Raph.'s the most believeable of the four brothers), and there are some deeper themes here. The music is pretty good and emphasizes the action well, and the cgi was great (the fight scenes were very well done). It's actually quite funny and even though the ending is pretty predictable, the rest of the story is NOT. The four turtles' voices are perfect and most of the other characters as well, but Splinter sounds comical (not in the good way). -So to sum up, I give this movie a 10 for style, an 8 for jokes, and a 2 for stealth (those who've seen the movie know what I'm talking about)."
    },
    {
      "rating": "10",
      "text": "This movie was fantastic! I was a huge fan of the old '87 cartoons and I completely felt like I was 7 years old again. At the same time there was enough new material to draw me in. I'm not going to go into detail (everyone else has done a great job of providing examples and plot details); but this is obviously one of those films critics loath and viewers love. I was absolutely satisfied with this new installment to the franchise and look forward to it's inevitable sequel. Cowabunga!"
    },
    {
      "rating": "9",
      "text": "Wow!? This movie was way beyond my expectations! Went to see this movie with my 5 year old son expecting it to be in line with the old cartoon series of my childhood and was completely blown away by what they done to this franchise. If they continue to make TMNT like this I am definitely a fan again!"
    },
    {
      "rating": "10",
      "text": "The negative reviews from the critics betray the fact that none of the critics really \"get\" what the Turtles are about characteristically. The movie absolutely *nails* Raph and Leo's relationship, and brings it to exactly the kind of climax any proper old-school Turtles fan will appreciate. Hey, besides the fact that the guys who made this film actually know what's cool about the Turtles, it has good voice acting, great action, and nice CG animation."
    },
    {
      "rating": "9",
      "text": "I"
    },
    {
      "rating": "10",
      "text": "The story might be a little be off and some of the dialogue is a bit cheesy, but at its heart...it is still the Ninja Turtles. Mikey was as funny as ever and Splinter got in a few jokes (classic!) and this movie served its purpose well. It is meant to be an hour and a half of entertainment for all ages with not a lot of thinking involved. What's even better is that April and Splinter got in on the butt kicking action. I think that the critics have it wrong once again. This shouldn't be rated as if its trying to be a Oscar contender. Yeah, its not completely classic, but it was still a lot of fun. If you can have a sold out midnight premiere of high school, college age, and adult viewers and get the whol audience laughing--You are in good shape. And this movie did that. This is PG at its best. I'm in for the inevitable sequel!"
    },
    {
      "rating": "10",
      "text": "Was there any doubt that any fan of the original would think this movie is anything but total bust? Well as a fan of the original, I thought this movie was great. People have to remember that making a movie is expensive, and those putting out the cash want something that is going to return their investment. Thus meaning, the turtles would have to reach to a new audience in order to get some green. Im suprised that the filmakers added any nostalgia whatsoever. However wherever it was, fans are bound to notice and it and cheer. Pizza, cowabunga, Mikey being a lovable goof, Splinter being wise but getting a little bit of but kicking, April, Kacey, its all there if your just willing to open your mind to new things. Such as you might say...Donnie working as an ITT tech-support guy, a turtle on turtle brawl with Raph against Leonardo (I was shocked and highly entertained). Overall this movie should be an admirable 68 or 70, im giving it a 10 just to counteract the vast amounts of unjust user scores. Other then the absent of Shredder (however this can be counteracted due to the hinting of a next movie with Shredder being in it: AWESOME), I was wanting to hear one quote: \"I love being a turtle!\" and just when I thought I wasnt going to get my fix, the last words that were spoken, sealed the deal for me. I loved this movie, especially for reminding me of my childhood. Go ninja, go ninja, Go!"
    },
    {
      "rating": "10",
      "text": "This was the perfect movie for 6 to 10 year old boys. It's being very unfairly reviewed! I also thought it was fantastically entertaining (and as a turtles fan from my youth was geeking out through most of the film). My 6 year old son LOVED it. I can't begin to understand why the score is so low or critics are being so hard on it (it was 100 times better than Cars, the last Pixar film that my son slept through the first half and then asked to leave when he woke up). It was action packed, fast paced, and (literally) the FIRST cartoon I have taken my son to in 2 years where he wasn't bored and asking to leave. I am really sad the reviews are so low, I think the people who made this movie (especially the animation) deserve a much higher score."
    },
    {
      "rating": "7",
      "text": "Best turtle anything I have seen yet! I am a 36 year old anime freak and I was expecting to be very disappointed. I took my 13 and 15 year old nephews and they liked it too! What war really amazing was that the theater was full of kids and I didn't hear a peep out of one of them during the movie."
    },
    {
      "rating": "9",
      "text": "Fantastic movie, definitely good for kids of all ages whether they're 8 or 80. The battle scenes are fantastic, and the tension between Raph and Leo is excellent. Definitely recommend to anyone, turtle fan or no."
    },
    {
      "rating": "10",
      "text": "the critics forgot that this is primarily a children's movie. Great for adults too though!!!!"
    },
    {
      "rating": "9",
      "text": "As a newcomer to the series (I have never seen any of the 90s live action films) and as an adult, I will genuinely entertained by this movie. I was very taken with the animation, which was produced by the incredible team at Imagi. I'm very excited to see what they do with Astro Boy. I was also very pleased that all the principle characters (the turtles) were voiced by VOICE ACTORS. Nothing annoys me more than Jimmy Fallon or some other untalented voice actor ruining a perfectly good animated movie. Definitely one for the kids, and would strongly recommend for the adults as well."
    },
    {
      "rating": "6",
      "text": "Another one of those movies that is only for fans of the series. It's no more mature or complex than any of the television shows, and even a little below the par of the first live action film. The fight scenes are quite fun and the old lightheartedness is still here, but the creature designs are unimaginative and the morals are retreaded for the hundredth time. Very faithful to previous installments in any of the Turtles' non-comics incarnations, it's bound to entertain people who bring an emotional investment to the movie."
    },
    {
      "rating": "1",
      "text": "Not only is this film one of the worst animated movies I have ever seen, it is one of the worst motion pictures period. It is about 1 hour and 20 minutes and consists of a terrible, immature plot filled with tons of kiddie moments that will give you no real laughter. The action sequences all look the same: choppy, fast, over-produced and very forgettable and the narration is low-notch, cheesy and foolish. The movie is absolute junk and it should be avoided for those above the age of 7."
    },
    {
      "rating": "7",
      "text": "If this had been released at the peak of the original serier' popularity, it would be a monster box office sensation. As it stands, it's a highly entertaining trip down memory lane. Leo, Raph, Donni and Mikey make a welcome return to the world and into th 21st Century. Dudeeee."
    },
    {
      "rating": "8",
      "text": "I was pleasantly surprised when I went to see this film, I was genuinely really entertained, I thought the script was surprisingly well written, it didn't aim to just please kids or nostalgia junkies, it even poked fun of itself at times. Good stuff!"
    },
    {
      "rating": "6",
      "text": "Pretty good TMNT film with decent visuals and fairly good humour. Story has issues."
    },
    {
      "rating": "4",
      "text": "TMNT feels dashed out. (In case of newbie asking what does TMNT stand for, look up the Internet). TMNT also feels odd and poor. Users enjoyed this one, but not me."
    },
    {
      "rating": "5",
      "text": "While tmnt might feature our favourite turtles, this is not the rebbot we have been waiting for. It doesn't have the humor that the original had, the plot is uninteresting, and it just doesn't feel like teenage mutant ninja turtles."
    },
    {
      "rating": "8",
      "text": "This movie was lit, what a bunch of haters. Its like a little bit of a time skip for the turtles"
    }
  ],
  "recommendations": [
    "the_lego_movie",
    "teen_titans_go_to_the_movies",
    "ice_age_dawn_of_the_dinosaurs",
    "free_birds",
    "my_little_pony_the_movie",
    "the_lego_ninjago_movie",
    "hotel_transylvania",
    "ice_age_the_meltdown",
    "the_angry_birds_movie",
    "incredibles_2",
    "minions",
    "hotel_transylvania_2",
    "the_smurfs",
    "sonic_the_hedgehog_2",
    "meet_the_robinsons",
    "speed_racer",
    "minions_the_rise_of_gru",
    "monsters_vs_aliens",
    "paranorman",
    "ice_age_continental_drift",
    "wonder_park",
    "the_spongebob_movie_sponge_out_of_water",
    "despicable_me_2",
    "chicken_little",
    "guardians_of_the_galaxy"
  ]
}