{
  "id": 4318,
  "title": "To the Bone",
  "starring": [
    "Lily Collins",
    "Keanu Reeves"
  ],
  "runtime": 107,
  "genre": [
    "Drama"
  ],
  "description": "A young woman dealing with anorexia meets an unconventional doctor who challenges her to face her condition and embrace life.",
  "releaseYear": "2017",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/pkdxhdB3dRUqazqoy9lzUvhayjc.jpg",
  "categories": {
    "plot": 4.9,
    "acting": 5.285714285714286,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.5,
    "funny": 9.333333333333334,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Yeah. The trailer screwed up. But the movie didn't. I am not saying this is by any means, a perfect movie. It isn't. And I do think in my own personal opinion that this film does sometimes takes a not so right turns as it takes right turns. But, what this film should be admired for is its cast's acting, the way its shot, its direction, and its utmost effort to tackle such a difficult subject matter the best way possible. Give this film a try people, it's an interesting watch. It's made with and from people who suffered eating disorders themselves. It's way better handled than bloody 13 Reasons Why at the least."
    },
    {
      "rating": "8",
      "text": "This movie mentions a pretty dark topic beyond eating disorders, which is also social media, \"pro-ana\" and guilt. It could have went a little further into that topic and kind of dismisses it. But I thought it was a good film and does get a little strange but in an interesting way."
    },
    {
      "rating": "7",
      "text": "At times, this felt like a simple and pretty straightforward film about a real-life and common issue, in this case, anorexia, for many teens and young adults, but at the same time, it also felt rather raw, honest, and even mature with how it handled the subject matter. Lily Collins turns in quite a committed performance both physically and acting-wise. Overall, yes it often times felt like a made-for-TV/Lifetime film (it is a Netflix original after all), but its honest and unflinching portrayal of the subject matter in as mature of a way as possible (although there are still some fun moments to be found throughout here and there to keep things from getting too dark), as well as Lily Collins' more than worthwhile performance makes it worth a watch for those who aren't too easily triggered by some of the depictions of eating disorders found in the film."
    },
    {
      "rating": "7",
      "text": "\"To the bone\" was a very good film, with some very good interpretations, and an issue that touches the youth and the psychology of today, the problem of anorexia and bulimia, this was a moving and inspiring story."
    },
    {
      "rating": "9",
      "text": "I still have not bought an anorexia, but after this movie, I know what all the people with anorexia go through, the film delivers what is seen without towing a story of overcoming and challenges, a Lily Collins could not have delivered is perfectly in this Role, what incredible movie that incredible performances, what a beautiful movie"
    },
    {
      "rating": "9",
      "text": "I thought that it made a harsh topic somehow interesting to watch with the humour from Noxon. It was lough out loud funny at times and also dark and depressing. Collins performance was raw and i could relate to Ellen at some points."
    },
    {
      "rating": "0",
      "text": "**TW** Whether the creators realize it or not, they end up glorifying eating disorders. What's meant to be shock value to scare people away from eating disorders ends up just showing triggering imagery and ends up as \"th*nspo\" edits. It also shows ways people with eating disorders use to lose weight in a manner that comes off as very casual which is triggering. It enables viewers of the movie with eating disorders to do the same without realizing it. It has a terrible portrayal of anorexia, making it seem as if only skinny white girls can have it. There are two characters who suffer from eating disorders who aren't a skinny white girl out of six characters, one of them being a plus sized black woman and the other being a skinny white man. They present Ellen's treatment of pushing her to the brink of death as the only correct way to treat her. They also make it seem like fatness is the issue of the root of all eating disorders when the characters admit that the reason they started disordered eating was so they wouldn't be fat and die at 30 which isn't okay and I shouldn't have to explain why."
    },
    {
      "rating": "6",
      "text": "To whom 'Bon Appetit' is a sin!Another writer, producer turned director. It was her first feature film and she was not bad. The Netflix producing lots of formats like shows, stand-ups, but I'm more interested in in films which they haven't tapped that greatly, yet. I've seen almost all of their films, and I'm quite happy, but in a few occasions, disappointed. This is surely not a disappointment, yet a slight let down.No doubt that it is a wonderful story with a wonderful cast. But did they narrated it properly! I think somewhere, something's not right. One of thing were the sentiments, that made me like it. Otherwise, I would have considered it a below average.A girl with anorexia is further failing to see any success. Her family is so worried, particularly her half sister and stepmother. Could be the family history that affected her to she end up like that. So it explored all sides, giving reasons. With a new programme beginning, a new hope was expected and how this time she ends were revealed with an emotional conclusion.A film with a story like this should have been an Oscar product, especially to see Lily Collins getting the best actress nod. Because her dedication was awesome. But sad to see it got wasted, I mean not being awards' favourite flick. She said it was a very personal film for her. But I thing for me as well for the same reason of hers.A good title, a good poster. Everybody performed well, besides Collins. I know still majority would love it or already loved it, but there are a few like me not that satisfied. Though I won't say it is completely a bad film. That does not stop me from suggesting it to others. Forget the guys like me, as the days to come, I hope it gets its due. Even I to change my stance!6/10"
    },
    {
      "rating": "6",
      "text": "Nice dramatic movie, but it could be better, \"To the Bone\" is really more about finding the self-love rather than about dealing with an eating disorder, precisely nothing useful is said about anorexia, it also doesn't spotlight on the process of recovery. The ending also was little confused where Ellen decided to return to the group home for recovery just after she had a dream about her death!! Actually it must be more detailed and convinced."
    },
    {
      "rating": "8",
      "text": "The subject of eating disorders is approached with all seriousness, without exaggeration or sentimentality, so that it seems almost documented. It is the most that could be appreciated, and especially the performances."
    },
    {
      "rating": "4",
      "text": "To the Bone is a disappointing story that barely scratches the surface of an extremely serious subject, and worse, features painfully simplistic performances that give neither focus, depth, nor graveness to a story that desperately needed it.The moment its director accepted that Lily Collins would have the same expressionless face throughout the film, is when you know that her choice of leading actress was a complete failure.And when you lead character is that flat. The rest will suffer from the same issue."
    },
    {
      "rating": "10",
      "text": "This is by far one the most exceptional films I have ever seen. Although I have never suffered seriously with an eating disorder and cannot vouch if it a accurate representation of a clinic I was enthralled with the journey. It follows a young teenage girl ad her struggles with anorexia nervosa. It tackles love, loss, stigma and misconceptions. Considering it tackles such a sensitive and potentially triggering issue I found it funny and lighthearted throughout and all the deepest parts were handled with care and attention. I feel educated after watching the film and really felt the emotion she was going through. I rarely feel so connected to a character but it was acted and scripted beautifully."
    },
    {
      "rating": "7",
      "text": "\"To the Bone\" é um retrato realista, honesto e, por vezes, incómodo sobre a luta individual contra os distúrbios alimentares e um ótimo estudo da sua protagonista. Collins é uma ótima atriz.7/10"
    }
  ]
}