{
  "id": 4851,
  "title": "Tolkien",
  "starring": [
    "Nicholas Hoult",
    "Lily Collins"
  ],
  "runtime": 112,
  "genre": [
    "War",
    "Drama",
    "Romance"
  ],
  "description": "England, early 20th century. The future writer and philologist John Ronald Reuel Tolkien (1892-1973) and three of his schoolmates create a strong bond between them as they share the same passion for literature and art, a true fellowship that strengthens as they grow up, but the outbreak of World War I threatens to shatter it.",
  "releaseYear": "2019",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/A7eYO3t7oZQdfJj5KlJBI7GhT9H.jpg",
  "categories": {
    "plot": 5.578947368421052,
    "acting": 6.083333333333333,
    "ending": 6.333333333333333,
    "soundtrack": 10.0,
    "cinematography": 7.75,
    "familyFriendly": 5.0,
    "funny": 4.5,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "The main problem with this flick is that despite its title it is not about Tolkien at all. This movie takes some actual facts from Tolkien's biography (like his name or name of his wife) and connects them into the new story in the way that this story has nothing in common with the actual Tolkien, his views and writings. When facts of Tolkien's life aren't feet into the movie's narrative it simply ignores them and invents new \"facts\". You don't have to be Tolkien's scholar or read his complete autobiography to notice this disconnection. It would be enough to read some Tolkien's letters and to be briefly accustomed with Tolkien's life and activities to see that this flick only uses Tolkien's name as a vehicle of propaganda of views and ideas completely alien to the protagonist of the story. So if you want to learn something about Tolkien's life or views you should stay away of this flick as its title is misleading and the story is about someone else - flat and one-demensional character, like all fictional characters in poorly written stories are.The flick itself, though not about Tolkien, at least could have been interesting in its own fictional narrative. But the movie fails here as well. It is boring and unimaginative, the characters are flat and dull. The movie tells about some triggered emasculated boy, \"rebelling against the system\", while being separated from the \"strong independent woman\" (his love) by the \"evil priest\" (it is quite funny if you actually know that Tolkien was a dedicated Catholic, who, as he wrote to his son, did never regret his decision to \"drop\" the love-affair until 21 and married Edith only after she converted to Catholicism from Protestantism, moreover, he was a conservative and convinced monarchist who volunteered to participate in the Great War). The storytelling is melodramatic and pretentious to the extent that you should know nothing about actual Tolkien and should really be into the same ideological pattern with the creators of this flick to enjoy this caricature."
    },
    {
      "rating": "5",
      "text": "A mediocre film at best. But that doesn't bother me. What really bothers me is that it was a film about the early years of Tolkien, the impact that the war had on his life and his writings, and yet SOMEHOW, one third of the movie was dedicated to telling the tale of a gay childhood friend of the main character. Why? Because in modern day Hollywood movies, creators sadly sacrifice the quality of their work on the altar of political correctness. Such a shame..."
    },
    {
      "rating": "0",
      "text": "Completely removed the Christian Faith from JRR Tolkien, when it was an integral part of his life. You can't make a movie about JRRT and pretend that christianty doesn't exists."
    },
    {
      "rating": "3",
      "text": "Doing a movie about Tolkien and leaving out his Christian faith is like making a documentary about Trump and never mentioning his wealth.  An okay movie, but if you think it is anywhere close to accurate than you are an utter fool."
    },
    {
      "rating": "0",
      "text": "When the book was inspired by God and the fact that He was super religious but it never came up once in this movie is why it's Hollywood garbage."
    },
    {
      "rating": "6",
      "text": "An uninspired bio-pic about JRR Tolkein that provides all the facts in pleasant detail without shedding any light on Tolkein’s genius for creating myths that caught the popular imagination and inspired some brilliant films by director Peter Jackson. So, in this sense, the movie was a total failure. On the other hand, the actors were excellent, especially Nicholas Hytner, who was very likable, if not particularly witty or charming or driven. His Tolkein spent very little time actually writing (consider the hundreds of pages JRRT supposedly generated) or thinking about his characters. He is shown in the trenches during the First World War, but he seemed to have spent almost the entire time in a quiet corner with Trench Fever. It was hard to believe he wrote anything, especially inspired novels. For me, the fault was with the script since the cinematography was beautiful, all the actors were excellent, and the direction told the story pleasantly and efficiently. This film should have been a lot more interesting than it was."
    },
    {
      "rating": "4",
      "text": "A period biographical drama made under all the rules of the book which makes it pretty basic and devoid of more interesting stuff.And in spite of having a very decent quality in its manufacture and the solid performances of the cast, there's really nothing special about it.In part, it's a problem because I personally love Tolkien's books but his personal story? Not really, therefore adding the elements this film was completely insubstantial."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)Is it a more didascalic than didactic biopic, like reading a Wikipedia article about the author? Was it right to tell the story of the founder of modern fantasy by using and abusing his style that replaces many biographical truths? Regardless, the film seems to have been shot more for Tolkien's fame than for the objective interest of the young writer's life, in fact quite conventionally Dickensian. Mistreated by critics and audiences for this shareable reason."
    },
    {
      "rating": "4",
      "text": "Does anyone really want to see a biopic about famed author J.R.R. Tolkien? From the almost empty theatre last nite, apparently not. This narrative is a relatively straightforward and decidedly unoriginal approach to the genre, starting with his boyhood, tracking him thru WWI, including the love of his life and ending with his first words of \"The Hobbit.\" Nicholas Hoult does fine in the title role, but the leaden direction and uninspired writing don't add much \"life\" to his life. His experiences weren't that extraordinary and this film offers no real reason to care."
    },
    {
      "rating": "8",
      "text": "I knew nothing about JRR Tolkien's personal life and now I do. I got glimpses in how he used some of it in his writing. I also enjoyed learning about his group of friends and how the relationship with his girlfriend/wife developed."
    },
    {
      "rating": "9",
      "text": "Tolkien was an absolutely touching film, a cinematographic piece of art, and featured superb acting, camera work, and sound track. Though the story itself is relatively slow moving, the outstanding use of special effects and somewhat episodic story line keeps the energy and tension high, and creates a truly moving film. The portrayal of friendship and brotherhood is soul shaking, and moved me and two of my close friends to tears. Tolkien truly is one of the greatest writers the world has ever known and ‘Tolkien’ provides a small glimpse inside his genius mind and provides insight into his life and influences surrounding his iconic works. However, this movie is not just great for fans of Tolkien, but to anyone who can appreciate the genius of story telling that is this film. Everyone should watch Tolkien. A definite must see. 9/10"
    },
    {
      "rating": "10",
      "text": "a very good and absolutely underestimated film, at the end I was struck by a tear"
    },
    {
      "rating": "8",
      "text": "Reading some of these reviews is astonishing: what do we, as a collective modern audience, still bring to films? It's as though some of these professional critics didn't really watch the film (e.g., \"None of the life we see ... illuminates his great works of art\". Really?) and as though some of these amateur film goers simply want it to be a different film (e.g., knocking it because it doesn't shed \"any light on Tolkein’s genius for creating myths that... inspired some brilliant films by director Peter Jackson.\" Holy mackerel. And even worse: \"You can't make a movie about JRRT and pretend that christianity doesn't exists\". Puh-LEEZE).  Clearly, we've devolved to the point where our attention spans are equal to a 3-month old blowfish and our historical sophistication is comparable to a sixth-grader's. If, on the other hand, you were fortunate enough to see the recent Tolkien exhibit at the Morgan Library in NYC, you know that this film beautifully and accurately portrays the essential Tolkien and shows how all his extraordinary skills - as a story-teller, mythologist, philologist and linguist, artist and (I know this is boring, guys, but deal with it) a father - were the raw material for the classic novels he wrote. Highly recommended."
    },
    {
      "rating": "8",
      "text": "We enjoyed it. I can see why, in a world of too much CGI and rehashed tropes, this received mixed reviews. Nevertheless, it was a subtle exploration of the foundations upon which Tolkien's creative persona was built. It helps if you understand that LOTR was never intended to be just a fantasy story. The pacing was a bit odd and the plot had a few obscure goat tracks, but over all it was enjoyable."
    },
    {
      "rating": "7",
      "text": "I like this movie. I don't know much about Tolkien's life besides that he was fighting in the war, but I still think this movie depicts well how war affected people etc. Some things did seem weird for me in the story, but overall was interesting movie."
    },
    {
      "rating": "10",
      "text": "A very moving representation of Tolkiens life and the events that led him to write his epic tales."
    },
    {
      "rating": "10",
      "text": "the best movie t watch about aruthor the hobbit,the great music and the great from hout in toiken is the best thing i seen"
    },
    {
      "rating": "10",
      "text": "Tolkien - for the mature of all ages; is an absolutely beautiful movie. It captures accurately the essence of the period, the characters and their places in it, and the background catalysts’ for one of the most inspirational writers in recent history and for generations to come. The negative critics who have unjustifiably denigrated the movie Tolkien, indicate a lack of sensibility once only attributed to crustaceans.Hard to imagine in the preponderance of schlock Hollywood has turned out in the past few years...that a filmmaker would get even close to the mastery the movie Tolkien achieves.A movie not to be missed.Brian Mitchell"
    },
    {
      "rating": "7",
      "text": "The movie could have used more money spent on it. There was a weird mix between indie-like cinematography and expensive cgi war scenes. Because of this, one was left wondering whether it's a blockbuster or an indie movie. Solid story though and both educational and entertaining."
    },
    {
      "rating": "6",
      "text": "A quite nice, though often boring, sometimes puzzling, sometimes touching biopic on the life of J.R.R. Tolkien. It's decent in both quality and acting but there's nothing really there to make it actally worth seeing."
    },
    {
      "rating": "9",
      "text": "After waisting my time watching Death on the Nile, I was delighted to watch this movie. I don’t think it got enough publicity.loved the movie, superb acting and great CG. Attention to detail and cinematography was brilliant. I recommend."
    },
    {
      "rating": "5",
      "text": "This is very much an average biopic. It has the look and feel of a TV film and the visual effects were alright but nothing special. Its an interesting enough story but it felt a little bland and not entirely memorable.I admire the creative mind that was J.R.R. Tolkien and this film does certainly give an insightful into his life and what may have inspired his writing but overall I don't feel I can entirely rate it as a film. I did think that the ending had a bit of impact and I thought Nicholas Hoult did well in his portrayal of the author but its not a film that will stay with me or that I'd want to watch again, hence my rating. I wouldn't actively recommend it, no."
    }
  ],
  "recommendations": [
    "cloud_atlas",
    "life_of_pi",
    "risen",
    "the_social_network",
    "the_giver",
    "upside_down",
    "amores_perros",
    "perfume_the_story_of_a_murderer",
    "samson",
    "the_fountain",
    "the_great_gatsby",
    "the_book_thief",
    "the_lovely_bones",
    "the_banker",
    "i_can_only_imagine",
    "gattaca",
    "the_green_knight",
    "arrival",
    "the_little_prince",
    "roma",
    "eternals",
    "radioactive",
    "dune",
    "hugo",
    "nocturnal_animals"
  ]
}