{
  "id": 1309,
  "title": "Tomb Raider",
  "starring": [
    "Alicia Vikander",
    "Dominic West"
  ],
  "runtime": 118,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "Lara Croft, the fiercely independent daughter of a missing adventurer, must push herself beyond her limits when she finds herself on the island where her father disappeared.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ePyN2nX9t8SOl70eRW47Q29zUFO.jpg",
  "categories": {
    "plot": 4.894736842105263,
    "acting": 5.057142857142857,
    "ending": 4.0,
    "soundtrack": 3.0,
    "cinematography": 6.0,
    "familyFriendly": 5.5,
    "funny": 6.5,
    "action": 5.3023255813953485
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This is a great film!! Those complaining about it being an origin story really have issues. This really is the best  video game adaptation by far. While the plot isn’t generic and predictable at times, there was enough solid action, unexpected twists, superb performances especially but alicia Vikander who really brought Lara to life. A far more realistic and grounded interpretation than what Jolie played years ago. This is a must see!! There isn’t enough action/adventure films in the sea of superhero films. This was a welcome change. Especially great seeing female action heros which is rare in this industry. My advice to naysayers, keep your expectations low which if they are high, you’re the problem with my video game films will never succeed. The elitist attitudes is the culprit. Just go in and expect a fun action film, nothing more/nothing less"
    },
    {
      "rating": "0",
      "text": "This lady is nothing like Lara Croft. Flat chested, flat rear not intimidating with guns.I loved the video games, specially the last one Shadow of the tomb raider. I liked Angelina's movies as well (especially the first one).This iteration is a disaster everywhere. I recommend to watch only if they pay you 20 bucks to do so. Any of the Resident evil movies is far better."
    },
    {
      "rating": "5",
      "text": "I was interested in seeing this movie when i saw it it was slightly disappointing some parts of the movie didn't make sense at all and there were some cool scenes but it was a mediocre move for me atleast"
    },
    {
      "rating": "5",
      "text": "Tomb Raider is a good attempt to adapt the videogame, but in the end it's just a movie that Alicia Vikander takes behind her back to save her."
    },
    {
      "rating": "3",
      "text": "Making a good movie on the game is difficult, making a good movie on the 2013 Tomb Raider game is very difficult. The original source in quality was below average. Except in the film there is no third of what was in the game. Ultimately, the film slips into a parody altogether, in which it is unclear whether the film originally wanted to be shot as cheaper and easier as possible or whether the film is counted strictly on fans of the series. The main antagonist is devoted to less than 5 minutes of timing, the conflict is not revealed. Judging by the installation, the action of the film unfolds on a small island, where there is nothing except the tomb. And the end of the film, in which the hint of a sequel causes longing. Please, it is not necessary."
    },
    {
      "rating": "3",
      "text": "Boring derivative action movie, nothing special here girlies give it a miss. Why on Earth is Lara Amelia Croft delivering curries at the beginning when she is supposed to be rich. I don't want a poor Lara and neither should you. Absolutely no likable characters in the entire movie. Ridiculous plot that only really involves one mediocre tomb. I'm still upset we were robbed of an even worse sequel though heres to hoping ladies!"
    },
    {
      "rating": "1",
      "text": "sorry it's just a very poor depiction of Lara croft and nothing like the games i grew up on playing during the PS1 era , lazy writing too \"woke\" and the actress can't fill Lara's shoes"
    },
    {
      "rating": "0",
      "text": "Лара Крофт кубинка?Серьезно?Тощая.WB давно прогнулся под ЛГБД и феминиз итд .Декорации в стиле ДС?Мрачно как будто  все после бури пылью засыпано.Да и сюжет полный отстой.Вы сравните Лару Крофт с Анджелиной Джоли декарации и сравните с этим шлаком"
    },
    {
      "rating": "0",
      "text": "based on crystal dynamic and square enix's 2013's tomb raider's third reboot the story rip off the 2013 game to the tee its uninspired, unoriginal, boring and filled with plot holes and plot armor Alicia Vikander can't not act to save her own life she's a bigger crybaby then 2013 reboot lara croft she's annoying and everything is handed to her with a silver platter nothing is earn and that stupid bow arrow from 2013 tr reboot is incredibly lame they try too hard to be empowering and everything feels forced and convenient for the protagonist. GARBAGE!!!"
    },
    {
      "rating": "0",
      "text": "mediocre garbage. Dull, uninspirng, actress feels like a secondary character in her own movie, the plot is generic, predictable and cliche, the movie doesn’t feel like the game because they refuse to use first person shots of the action scenes when it is needed,… etc"
    },
    {
      "rating": "4",
      "text": "Mediocre film that never tries to be anything more than passable, Vikander tries her best but can't do much to help the film rise above bog standard direction and a mediocre script. The film is OK for the first hour and slowly loses the plot in the second hour, but even in that first hour it wastes a lot of time on pointless diversions and elements that have nothing to do with the story as a whole, with a better director and more focused script this could have been genuinely good, but as it is it's vaguely watchable at best."
    },
    {
      "rating": "3",
      "text": "Awful copy game 2013, with the absence of any interesting characters. Despondent CGI.It was attempt to write a story about the formation of Lara as Tob raider, but we got only female сharacter with zero charisma. Very sad because in game (3 after reboot already) we got some kind  change to Lara which we all know ( powerfull, independent, intelligent)"
    },
    {
      "rating": "5",
      "text": "There's always a quote behind these videogame movies:\"This is what you want,this is what you get.\"This is the kind of thing that also tends to happen in here,and maybe a bit worse than I thought. That's not to say that it wasn't bad,but it's also not a good movie.Yes,Tomb Raider is one of those...Let's get the positives out of the way so I'll make room for the cons.Alicia Vikander steals this movie big time,she tries to be a good lead character,and I admire that. The action (just like Justice League) is probably the only thing you'll remember with its excellent set pieces.As for the cons....Yeah,there are a ton of those...You know that I love movie soundtracks,but Junkie XL's score felt like a way to annoy people during the action and the calm moments. (maybe he wanted to finish Justice League,RIGHT WARNER?).Sometimes,the story can feel a little Indiana Jones-y,aand I admire directors (Independent or not) that love stuff like this,but when you love that stuff,you don't need to make a 1000 references during the scenes. And yes,i'm one of those guys that thinks the first 20 Mins could've easily been cut from this movie. To be honest,I had little expectations for this movie,but overall,it was what I expected,and suprisingly,as a 2 Hour movie,it feels like a quick seat with its execution,but in the end,Tomb Raider is another one of those Videogame Movies,and again,that doesn't mean it's completely bad. It's the right kind of Videogame Movie where you can have a Friday Night with your friends,but not in a theater. Still,i'm not stopping you on paying those 10 Dollars for curiosity.In two words: Strongly mediocre."
    },
    {
      "rating": "5",
      "text": "For a \"video-game movie\" it's not all that bad, but it's mostly just Lara jumping, running and fighting. It starts out ok, but towards the end you start wondering why you thought this would be a pretty decent movie. Should have waited for it to be aired on TV. I'm pretty sure I'd have been rather pleasantly surprised then. It just misses that A-movie feeling. (typo corrected)"
    },
    {
      "rating": "6",
      "text": "Alicia Vikander, Oscar winner, stars as Lara Croft who goes to a island off the coast of Japan, following the clues left by her father.  He has been gone, and presumed dead, for seven years after going to try to find the hidden tomb of an evil queen.  Lots of action and adventure follows as Lara follows the clues and finds herself in peril time and again.  The movie is not bad.  My main complaint is that Lara seems more like a super hero, constantly using physical strength, luck her intelligence to get out of life threatening situations.  It doesn’t matter if she is falling off a cliff, falling into a raging river, pulling herself up with one arm.  She never gets more than a scratch.  It was a little much, in my opinion.  However, I did enjoy the movie and the adventure."
    },
    {
      "rating": "6",
      "text": "Back in the 2000s, I used to remember how hilariously awful that the original Tomb Raider was when it had its insanely flawed comedic material being implemented into it, but don’t be afraid though, because the reboot actually clicks! (well sort of…) What made this reboot good for this video game adaptation is that our leading lady Alicia Vikander actually makes things pretty darn entertaining to watch when you see her giving one hell of a kickass performance as Lara Croft. Don’t expect any sexual innuendo in this film because Vikander’s Lara Croft is not like Angelina Jolie’s Croft at all, she literally kicks ass all over in this reboot. To be honest, this film did a good job on maintaining its R-rated-like feeling to this adaptation since the latest Tomb Raider video games are mature as a PG-13 rated movie. It would have been better if Tomb Raider was R-rated so the direction and script would be even better in this movie. The stunts and the camera work are very well timed like any action/adventure film you see, but not everything clicks when this film is having trouble trying to develop its characters and story and the direction is extremely cliché. To be honest, this Tomb Raider reboot is actually pretty decent to watch and way better than most video game adaptation movies that you will ever see in theaters. Sadly, this film does not break that video game adaptation movie curse. [I'm still waiting for Shawn Levy’s so-called Uncharted movie to drop though….]"
    },
    {
      "rating": "6",
      "text": "The movie is not really anything special. It has enough action to keep you interested for the most part, but the story was rather predictable, mostly because it is so similar to the games. With that being said, that IS the point of the movie: to represent the games. I myself have never played a Tomb Raider game, so I can't speak for fans of the series. I am aware that they had a lot of puzzles in them, which this movie had a decent amount of. But for those watching the stand-alone (without any knowledge or playtime with the games), the movie was only okay. If you really want to see it, try to get cheaper tickets."
    },
    {
      "rating": "4",
      "text": "Dont get me wrong i like Alicia Vikander but i dont she is for this kind of movies, Do yourself a favor and play the Tomb Raider reboot of 2013, is a great game , it has a better story and is far better acted..."
    },
    {
      "rating": "0",
      "text": "Wow that was really not good How can you make such an interesting character so boring and canine? The way the movie was written made me forget Lara as an iconic characterIt was a really boring ride with scribbled elements that makes no senseThe worst thing about the movie was Alicia Vikander i don't say that she is not an good actress she just didn't fit for the role at all how the hell she got the role ?Anyway for me this movie was a mess especially this new approach of her"
    },
    {
      "rating": "8",
      "text": "Easily the best Tomb Raider film to date, Alicia does a fantastic job of portraying Lara Croft in a much more grounded way, the action in this film is brilliant and this a great watch, especially for fans of the games. The best video game film adaption to date."
    },
    {
      "rating": "2",
      "text": "It starts out strong, with good character building. I had high hopes at first. But as soon as they get to the island, it flips on you and turns in to \"generic bad action movie\". The pacing gets all wonky, the plot turns to mush, character's motivations are uncertain and action sequences become ridiculous. It's too bad, I wanted to like it, as I like Tomb Raider in general. In the end to me it just felt like a rushed out origin story so they can reboot the franchise... again. Oh, and there's scenes where they clearly are making callbacks to moments in the games. Which felt odd.  I like the games, but I expect more from the movies, not a re-enacted game. Member that one time in that one game?? Yeah, I member! I'd rather have fresh new scripts than member berries, thanks!"
    },
    {
      "rating": "6",
      "text": "Its Ok, But not good by any means. If your expectations were low to start with then it will be no different afterwards. But It is the best out of all the **** movie adaptations of video games. I give it that."
    },
    {
      "rating": "5",
      "text": "Although Tomb Raider 2018 doesn’t exactly break the bad video game to movie adaptation it’s a step in the right direction. Alicia Vikander is Lara Croft and she spends every second on screen kicking ass and jumping and jumping in slow motion, falling with style and jumping some more. Much better than I was expecting, it’s entertaining and enjoyable in the moment so if you’re looking for this weeks popcorn movie then Tomb Raider should be your choice.Lara Croft goes searching for her father who has been missing since she was a teenager. Unable to accept that after seven years his death is a real possibility and it’s time to move on she decides to search for him in his last known destination. A scary island off the coast of Japan. Also featuring a scary mythical tomb and Walton Goggins playing your stereotypical bad guy. A decent and simple story packed full of action. It’s a stream of clichés and ideas you’ve seen before only in better films. By the way Imax 3D and a shaky cam boxing match is perhaps the worst use of 3D I’ve seen in a while. That opening scene was enough to make me sick, there is no reason for this to be in 3D. If you’re one of those people who love seeing 3D movies to have random objects fly out of the screen and into your face well you won’t even get that. It’s a waste of time and money so make sure to see it in 2D. A definite improvement from the older Tomb Raider movies. Vikander has clearly put the effort in to become Lara Croft, dedicated to the role and she looks the part. A strong female lead who has no problem carrying the weight of this film on her shoulders. Recommended."
    },
    {
      "rating": "3",
      "text": "If you are expecting a remake of Lara Croft Tomb Raider you will be disappointed. I have watched my husband play the game and some of the scenes from the movie are similar to scenes from the game. Much of the movie is very badly acted, especially by Vikander and there is no real father daughter chemistry between her and her father, played by Dominic West. I have to say that I was sorely disappointed by the film. The only real bright spot were some of the scenes that involved some kind of action. The music was heavily implemented to carry some of the scenes or at least to give them more of a punch. I can and have been able to suspend any attachment to reality but for this film it was rather difficult as my mind would wander back to certain holes in the story-line.  Over all I'd say it gets a 3 for atmosphere and somewhat decent production values because the story and the acting were terrible."
    },
    {
      "rating": "6",
      "text": "Tomb Raider is a reboot of a franchise from the early 2000s that was based on a series of video games. This reboot also comes out not long after the video game series was rebooted, and it clearly is meant to emulate the newer games. It's directed by Roar Uthaug and stars Alicia Vikander, Dominic West, and Walton Goggins. Story: The story is loosely based on the story of the newer video games, but it's a lot less interesting as they had to water it down quite a bit to fit it into a two-hour movie. The gist of it is that Lara has not been able to accept that her father is dead, and therefore refuses to sign the papers certifying that he's dead. Eventually, though, she is convinced to sign them by her dad's friend and the lawyer who is walking her through the process gives her a puzzle, that she then solves and finds her dad's secret lair. Based on what she finds in his lair, a bunch of research about an island that was supposedly cursed, she decides to set out to the island and find out what happened to her father. Lots of action and craziness ensues. I don't think it'll surprise any of you when I say that the story of this movie is nothing spectacular. They definitely could have cut down on the early movie set up (there's a bike sequence that goes on entirely too long) and given us more of what we actually want: watching her have an adventure on the island. Also, beckoning back to my earlier statement that it was watered down, I'm serious when I said that. The story of this movie is similar to that of the newer video games, but it is very, very loosely connected. Even the way that it ends isn't the same as the video games. In the end, it felt like that I watched a summarized version of the story I wanted to see. I still enjoyed myself for most of the movie, but it definitely had a lot more potential.Script: Yeah, this is by far the weakest part of the movie. The dialogue is extremely weak, and because of that there are some cringe-worthy moments. Luckily, this movie doesn't rely on dialogue too much. Acting: All of the actors involved with this movie give solid performances, but when the script they have to work with isn't super awesome, they don't shine as bright as they could. Cinematography: For the most part, the cinematography was pretty unmemorable. There are no shots that are particularly impressive or outside of the norm for this kind of movie. I will say that there are a couple of action sequences where there is entirely too much cutting, though. Overall: Tomb Raider is an alright popcorn flick to watch and enjoy yourself. Just don't expect strong dialogue and don't expect too much out of the story."
    },
    {
      "rating": "2",
      "text": "I cannot say that Tomb Raider 2018 has much going in its favor. The characters are generally uninteresting and forgettable. This is most notably attributable to main protagonist, Lara, which acts as the typical generic, and bratty kid you can expect to find in most action films. Plot points are not emphasized nearly enough for the typical viewer to bat even a single eye. Though its concept did seem promising throughout the movie's first couple of minutes, the execution of the story was unfortunately very poor. Additionally, due to the overbearing amount of vices presented as opposed to virtues, the concluding resolution felt very fabricated when reached.All in all, Tomb Raider has showcased an impressive blueprint and conceptualization for its plot, though the way said blue print was utilized came out as more or less underwhelming. This film is tough to enjoy, casually or through a critical eye. For a better experience, its best to simply play the video games it is based off of."
    },
    {
      "rating": "6",
      "text": "Most of it sadly didn't rivet me but with my deep connection with her forged by becoming her in the games and admiration for certain women, I of course have a positive light on it. With mostly any movie of this type I always so appreciate the work of it and can't deny the seriousness and convincing effort of vikander and the the rest of the crew. It's my fault I could't really like it. When you've seen and played so much, stories and experiences have to really stand out. Don't think there was nothing I liked about the post London scenes it just didn't have the full effect. I was thinking it was gonna be more like the un-apologetically  surreal rated R violence I imagined(I've written my own stories:)Flat violence doesn't seem real and leaves a mindset of war being acceptable and maybe even one-sided fun(Note I know how enjoyable experiencing fake violence can be, not mentioning the cocaine like rush that veterans report of combat) The perpetrator character has to have a definite reaction to it, could be nearly crying, extreme anger or detached joke making. Thankfully seeing the shots of action and artistic craft the first time in the trailer was great. I really liked the lighting and pacing of the first water scene. The dark light and the waves, the breakage of bark from gunfire and most of the visuals go way beyond the in comparison static parts of the games. Vikander is a great substitute and her version could definitely replace the voice of Camilla, sorry:( Although i think I still prefer the white face and certain hair style of Dynamics Lara compared to her second act sorta pigtail look. With her full hair in the opening and the sleeked back look after getting wet, she looks amazing.  The opening London Scenes were so cute and affecting. I would have loved way more of that. She's so great that now I definitely wanna start riding bikes pell mell around town and engage in the explosive and emotional fights within a padded gym. Not bad. Because of that, I can definitely say that it is a great thing that this all turned out and happened. So if they're open for change for the next snow one, here you are. And another thing I left out in this particular take is to make sure the dialogue is not imitative of so may others and go for unique introspective moments. Her state of suffering and life is something that needs to be shown in a new light. Theirs nothing like this in real life, making it more important to have some spark and care is taken into this interpretation. You shouldn't rely upon other examples of whats acceptable to our minds(I'm aware of how this sounds:) and make sure Lara is able to be her own."
    },
    {
      "rating": "6",
      "text": "The 2018 reboot of the Tomb Raider film franchise is both a serviceable homage to the legendary video game franchise and a workable film. Stylistically, Tomb Raider is a nice throwback to 1990s action/adventure movies. As far as the script goes, it is very bare bones, but Alicia Vikander actually gives a surprisingly human performance. She is a great Lara Croft. While the action scenes are certainly thrilling, there just isn't a whole lot of substance behind the flashiness of it. Overall, it's an ok film if you need to turn your brain off for almost two hours."
    },
    {
      "rating": "5",
      "text": "A pretty boring movie to say the least. I know this is supposed to be an introduction to a new Tomb Raider series and Actress but it is just really underwhelming. Nothing important happens in the first 30 minutes with many moments just feeling like fillers. Even the action sequences feel rushed and slow. She doesn't even user her Bow and Arrow till the end of the movie. It is good for a video game movie but not good for a movie in general."
    },
    {
      "rating": "7",
      "text": "Essentially a female Indiana Jones. While it has some genuinely interesting moments and Vikander epitomizes the Lara Croft character supremely, its weighed down by poor cheesy cliches and honestly a very dull plot ultimately. As far as it adapting to the video game, there are several homages and spot on sequences that represent Tomb Raider quite well. The villain is one of the weakest I've ever seen and shows barely any significance and the cgi is pitiful usually which is flabbergasting for a near 100 mil budget. Some of the acting was just down right mediocre and unconvincing. The Himiko storyline could've been expanded upon and was a missed opportunity that had major potential. Overall enjoyable adaptation that sets up a new franchise rather decently, but will be in need of drastic improvements in some crucial areas. 6.6/10"
    },
    {
      "rating": "6",
      "text": "Roar Uthaug and Alicia Vikander springs \"Tomb Raider\" to life with a quickly paced, action-packed, kinetic, and thrilling, if predictable and forgettable, adaptation of the game."
    },
    {
      "rating": "7",
      "text": "I think I just watched the best video game movie. Alicia Vikander is my favorite actress and I'm so happy she got this part because she's fantastic! The movie is fast paced and actually developes the lead character unlike every other video game movie. The action is great, the visuals are pretty good, and the tomb raiding is great! The movie has a lot of exposition which I found annoying but other than that I loved it. There's no other video game movie that can compete against this fun action/adventure film."
    },
    {
      "rating": "6",
      "text": "Adapt a game in a movie isn't an easy job, we can tell this because all the attempts that were made, mostly of them are bad or didn't reach the expectations from the gamers or even the general public. Much of that, i believe, happens because the games normally have more than 10 hours, and when they try to put it in a 2 hours story movie it gets limited and with missing pieces, they always replace things to make the story flow a little faster and the movie suffers cause of it, another thing that really makes the diference is that when we play a game we ARE the character, feel them and suffer with them because we actually are they, we feel in us the problems of the protagonist.. When this is tranposrted to the cinema, it's different, we need to the script to bring that to us, cause when we don't control the character it kind goes away, is easier for us to care about someone when we are controlling the person. Does Tomb Raider have this well done ?The plot is based on the reboot from the video games, made to tell the origin story of Lara Croft. The father of Lara is considered dead, but she don't accept, once that she find her father's researches that lead to and island, she decides to go there hoping to find him alive.I like how the movie starts, showing us how she gain her fighting skills, the physicality is justified at the 1st act, wich is very good, how they don't just throw she being a badass from nowhere, but on the other hand, they did not showed us how she got so intelligent, during the movie she do stuff and solve things that was just out of nowhere, it have a moment that a character say to her that she is very intelligent, but i actually wanted they to show this, not just say. This could have been fixed with the use of the flashbacks, the movie uses it a bunch of times but it simply repeat and tell the same thing a bunch of times, they could have used to show how interested she was in archeology and stuff, learning with the father. The flashbacks initially works to sustain something, but it gets to repetitive and badly used. Or also use the flashbacks to tell another characters story, it would fill the movie more.The things the movie did to make it close to the game worked partially, it does have moments that Lara is interacting with the ambience and it is done in a very good way, the hole plane sequence works tremendously well, it can give you a sense of dangerousness, the action during the hole scene worked a lot, she trying to survive and struggling for it, that worked because you knew how she get the physicality to do that so, the sequence is pretty took out of the video game and was very good. But, again, on the other hand, there is a scene that she got to solve a puzzle to open a door, that she is really just pushing things for some minutes, and you have no idea what she is doing, they throw at us a nonsense flashback that didn't explained a damn thing, you don't know what she is doing or how she learn how to do so, the sequence is just terrible. It would have been so much better if they actually explained how thoose things worked, and we would be learning with Lara and solving the puzzles together with her, not just the puzzle, that hole ambience, i believe that it would make the movie much better to follow.The cinematoraphy is wasted here, they had a big island with much to explor and show to us, it just have nothing to say neither about the island outside or inside the tomb. One thing that they did here in one moment and i enjoyed a lot, was that they filmed Alicia from behind, giving the impression that you were in the game playing it, it happens for some second, but i found it pretty dope.The best thing in the movie is surely Alicia Vikander, she did everything that she could for portraying Lara at the best possibly way, not just mentioning her body, how strong she got, but the acting in general, much of the stunts that she did you could believe in what you were seing because of her. She have charisma, can pass different expressions and really make us believe that she is an adventurous with skills.The movie is an generic adaptation, doesn't show nothing new, doesn't evolve the genre. It is a fun movie, that unfortunately isn't much memorable, neither for the gamers or the general public. Without great pretensions, the movie worked in some points, it is cool, but could have been so much better, considering how embracing the theme is and how good the acting was, so with a better script and montage the movie could have been great."
    },
    {
      "rating": "8",
      "text": "Alica Vikander is a class Lara Croft. She Plays her role really well. The film itself is very successful and the Trailer delivers what it promises. Action-Fans are properly served here in any case.But the Video-Game I could derive from unfortunately not much. You best buys to even that.Unfortunately I Cloud not take the 3D effect. 2D is compleatly adeqaute.Conclousion: I personally can this movie only recommend, but who are hopes here a Video-Game Adaption will be disapointend. But still look Forward to a second part with Alicia Vikander."
    },
    {
      "rating": "9",
      "text": "Surprisingly decent, especially for a video game movie. Lara set out on her first expedition finding the lost kingdom of Yamatai.The storyline based upon the 2013 reboot of LC, was lauded for revitalizing one of gaming's biggest names and most venerable franchises, and it did it in part by leaning into the narrative side of the medium, with greater depth and characterization for its lead and a clear and compelling story it wanted to tell with her. It surprisingly plays like a throwback to the classic late-'80s/early '90s era of action filmmaking, represented by the likes of \"Cliffhanger,\" \"The Last of the Mohicans. Alicia Vikander did a great job here. She's correctly cast as a woman who's literally to-the-manor-born. More importantly, though, she's an action hero par excellence. Carved like a wood sculpture, and seemingly bereft of body fat, Vikander hurls herself into the film's action sequences. She makes you feel the physicality of this intensely visceral performance, letting out a high-pitched grunt of rage or pain when Lara crashes into a wall or gets slammed on the ground by a brawny foe, and letting sparks of fury flash in her eyes as Lara delivers a coup-de-grace."
    },
    {
      "rating": "7",
      "text": "Having admittedly seeing only bits and pieces of the Angelina Jolie films on TV, I can't really make a fair comparison between them and this film, but I will say that having seen neither of those films in their entirety nor really playing any of the video games growing up, I still really enjoyed and had fun with this film. Alicia Vikander seemed to fit the title role quite well and her and the action sequences were all fun to watch. Overall, the story was rather thin and it certainly wasn't without it's cliches and predictable moments, but Vikander's performance and fun overall tone of the film was enough to make it enjoyable and worthwhile for me."
    },
    {
      "rating": "4",
      "text": "This is a very poor movie, that had potential.The movie itself is dry, when you make a reboot, there's a lot of risks of unoriginality, and wow, this movie has fun with it. Because it's very unoriginal, it's also very predictable, situations that normally would be a shocking reveal, suddenly turn into scenes you think you've seen before.The characters are so uninteresting, Lara Croft is alright i guess, but the surrounding characters are so damn uninteresting that it's just harder to watch. Lara Croft is shown in the beginning of the movie as a very smart and athletic person, the athletic part it is very well exploited in the movie, but the smart part only comes out when it's convenient, with her making some small stupid decisions, that make you think;\"a person that smart would not have done that\".The action is kind of generic, nothing special, nothing bad by any means, some parts are actually good, but most of it it's very generic. I liked the beginning though, it was very fun and interesting.The ending scenes just made it feel like the movie was just a huge expensive set up for the sequel. Which is kind of a shame, because it could have really been a great movie"
    },
    {
      "rating": "10",
      "text": "Just got back from the theatre. Most of the reviews I've seen just say stupid **** like \"they didnt try hard enough\" or \"the video games were better\" but no one actually went into detail. I'm not sure what made the reviews go from 10 to 0 to 10 to 0 it seems like to other people that you either hate it or love it. I am personally a fan of the video games and I think they did an excellent job in storyline, special effects and that kind of action that keeps your heart racing and your mind active. I would highly recommend watching it no matter what the critics say. (btw I personally thought Lara's dad should have amputated and burnt the artery closed with a flare or something.)"
    },
    {
      "rating": "0",
      "text": "My biggest issues would be the film's length and the pacing. This should not have been a 2-hour film, It should have been an hour and 40 minutes at best. The introduction, which took about 40 minutes for her to get on the island and to really start the adventure, was just utter nonsense. There was no real story set up, Just a bunch of poorly written and acted scenes that did nothing to even get you remotely interested in the events to come. And it didn't help that the plot is so freaking generic, You can pretty much predict it from start to finish.Another big issue for me would have to be the heavy reliance on CG. It's painfully obvious that pretty much every action scene is CG and that's such a huge disappointment to me. It doesn't just look painfully obvious but it looks fake and cheesy. I wish they had done a better job with it, Maybe make for a bit more realistic movie rather than a bunch of weak \"action\" scenes made from CG that stick out like sore thumbs.Overall, This isn't even worthy of a rental because there isn't a single redeemable thing about this film. Sorry to put it so bluntly but they need to stop bringing back this franchise, It's never going to be good."
    },
    {
      "rating": "3",
      "text": "all myths are foundations of reality..Tomb RaiderEven though there are stunning graphic visuals (all the water based sequences are beautifully shot), goosefleshing sound effects, brutal action sequences and jaw dropping stunts (hats off to the stuntmen) ironically the choreography; in a feature like this that relies a lot upon such stuff, is petty and questionable which at a certain point turns depressing rather than frustrating. At this stage of cinema, one would assume that the remake or the updated version of any feature or tale would be created with an aim to surpass the predecessor and fulfill the limitations (one is wrong). The premise never had enough potential to bedazzle the audience in the first place but in here the director Roar Uthaug is not even convincing the audience for a second look. Alicia Vikander, at the heart of it is so good and genuine throughout the course of it that it aches you to watch a talent go waste by. Tomb Raider has a shallow script that lacks gripping screenplay, better execution and editing (it ticks for around 2 hours which is way too much considering the material offered to the audience) to hold the audience on any loose thread of it."
    },
    {
      "rating": "9",
      "text": "Exciting & I enjoyed itI don't play the game, but that didn't matter.This movie is a lot of fun, some great acting, Vikander wows, exciting predicaments, over the top physicality"
    },
    {
      "rating": "3",
      "text": "wow this was as **** as the reboot games, how is that even possible. Too bad too because I love Alicia Vikander"
    },
    {
      "rating": "7",
      "text": "A solid action thriller.movie is the adaptation of the video game Tomb Raider (2013). There are several fight sequences throughout the movie, all of which feel very physical and cool. ‏not a fan of the actress that they choose, but she done the job well done. The element of mystery is also handled quite well. But the movie also has its share of flaws:weak villain and a general lack of emotional investment. there are several scenes that makes me thinking \"why she..wait what?!\" etc. It does not make sense and kinda stupid. The story is simple, predictable and cliche.Overall, this movie is worth a watch for its action sequences and performance.7/10good."
    },
    {
      "rating": "10",
      "text": "The movie has a great cast, particularly Alicia Vikander as Lara Croft. The action is great and so is the plot, my only issues are a cliche, but menacing villain portrayed by Walton Goggins, and the pacing was sometimes off, but other than that it is the best video game movie ever created."
    },
    {
      "rating": "0",
      "text": "Expect Social Justice tropes: boys chasing a foxtail on her bike, Lara has now small breasts, she acts like a brat even when she \"finds herself\", and you name it. Vikander is hired to attract the boys and she does it well going by the reviews but that's it. After just over a half an hour the movie turns into a cheap action movie made by a student. She barely can't lift her legs (or even her arms) in fight scenes. Lot's of cuts needed to make a fight coherent. And so on and so on.Conclusion: if you're a seventeen year old boy then you could download this movie and get off on Vikander and b-movie action - don't pay for it - otherwise forget about it and move on."
    },
    {
      "rating": "7",
      "text": "Yeah, there's a plot (and a tomb's involved), but it doesn't really matter. This is all about Lara Croft (Alicia Vikander) leaping, running and fighting her way thru face incredible obstacles. Thanks to Vikander's skills as an actor, she creates an character with depth, which comes in handy for the emotional encounters. She also effectively handles the action sequences, which are evenly sprinkled throughout the film. Even though many of the encounters are well staged, they still have that video game feel. Still, it's refreshing to see a hero who isn't \"super.\" In this origin story, she's vulnerable, yet determined and gutsy. This adventure breaks no new ground, but is competently entertaining."
    },
    {
      "rating": "7",
      "text": "There's nothing all that groundbreaking or memorable about 'Tomb Raider,' but it's a classically made adventure movie with good acting, an effective score, and plenty of suspenseful (and coherent) action scenes. It's not for everyone, but for fans of B movie matinees, it's enough to impress. It's by far the best videogame movie that I've seen, though that's not saying much. 'Tomb Raider' succeeds because it faithfully captures the spirit and the mechanics of the pixelated source material, while never forgetting that it's a live-action movie about flesh and blood characters. Most people probably won't want to spend the money to see this in the theater, but I suspect a lot of people will be pleasantly surprised when they finally watch it on an airplane or catch it on cable."
    },
    {
      "rating": "0",
      "text": "Absolute worst piece of SJW garbage I have ever seen.  This movie is NOT a Tomb Raider movie.  The original with Angelina Jolie opens with Lara Croft battling a robot trying to kill her.  This movie opens with dozens of teenage boys trying to catch a fox tail off the back of Lara's bike while she tries to outrun them in some stupid game.  THIS Lara Croft acts like a spoiled little brat.  No maturity at all.  Women are supposed to want to BE Lara Croft, but what woman wants to actually be like this.  Even towards the end, where Lara is supposed to be finding herself, she still acts like a little girl.  Certainly no tomb raider that's for sure.  Also, you can barely understand the dialogue due to the over emphasis on everyone's accent apparently to try to make the movie more authentic.  Avoid at all cost.  We need to stop supporting movies like this that force a political agenda on the audience.  Enough is Enough."
    },
    {
      "rating": "2",
      "text": "Good acting by Alicia Vikander is pretty much all there is to this movie.Other than that, it's just an incoherent mess of convenient mishaps, and scenes or situations directly ripped off other movies (especially from the Indiana Jones franchise).Some events in this movie are so ludicrous that it completely redefines the expression \"jumping the shark\".On top of that, the script feels like an intern's dissertation project for his Film Studies B.A.Verdict: Get a Real Job"
    },
    {
      "rating": "2",
      "text": "I was interested to see how Alica Viklander did as Lara Croft.  Not very good as it turns out.  Lots of getting the s*** kicked out of her while moaning and groaning.  Way too many stupid decisions like running a boat into a rock.  Not worth the $2 rental."
    }
  ],
  "recommendations": [
    "lara_croft_tomb_raider",
    "bloodshot",
    "hitman_agent_47",
    "maze_runner_the_scorch_trials",
    "wild_card",
    "infinite",
    "rampage",
    "the_last_witch_hunter",
    "hitman",
    "silent_hill_revelation_3d",
    "max_steel",
    "poseidon",
    "kingsman_the_golden_circle",
    "xxx_return_of_xander_cage",
    "jumper",
    "avengers_age_of_ultron",
    "into_the_storm",
    "battleship",
    "transformers_dark_of_the_moon",
    "hardcore_henry",
    "surrogates",
    "bumblebee",
    "furious_7",
    "teenage_mutant_ninja_turtles",
    "monster_hunter"
  ]
}