{
  "id": 3044,
  "title": "Tomorrow Never Dies",
  "starring": [
    "Pierce Brosnan",
    "Michelle Yeoh"
  ],
  "runtime": 119,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "A deranged media mogul is staging international incidents to pit the world's superpowers against each other. Now James Bond must take on this evil mastermind in an adrenaline-charged battle to end his reign of terror and prevent global pandemonium.",
  "releaseYear": "1997",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gZm002w7q9yLOkltxT76TWGfdZX.jpg",
  "categories": {
    "plot": 6.7272727272727275,
    "acting": 6.4,
    "ending": 5.0,
    "soundtrack": 8.0,
    "cinematography": 8.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 6.636363636363637
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The eighteenth James Bond film, and second for Pierce Brosnan as 007. This is also the only Bond film directed by Roger Spottiswoode.When worldwide media magnate Elliot Carver (Jonathan Pryce) instigates international catastrophes across the world, so that his new media company will be the first to report the news, including the sinking of a British navel frigate in Vietnamese territorial waters, supposedly by the Chinese, but instead by his stealth ship, bringing the two superpowers to the brink of nuclear war. 007 must race against time to find out what Carver knows and is planning, before World War III breaks out. Along with Chinese agent Wai Lin (Michelle Yeoh), Bond must follow Carver to his headquarters in Vietnam in order to thwart his plan to monopolize the worldwide news market.Brosnan is perfect as usual as 007, and Michelle Yeoh is very good as his Chinese counterpart. Teri Hatcher is very sexy and displays a lot of chemistry with Brosnan as Carver's wife Paris, a former lover of Bond's, that got too close to him in the past, before he broke her heart. Jonathan Pryce is a strong main villain along with his henchman, Stamper (Gotz Otto, who is very much a throwback to Robert Shaw's Grant in \"From Russia With Love\"). All the regular supporting cast is back, Dame Judi Dench's \"M\", Samantha Bond as Miss Moneypenny, and Joe Don Baker reprising his role as amusing CIA agent Jack Wade. This film also includes a very amusing and memorable villain in Dr. Kaufman (Vincent Schiavelli), a world famous assassin that kills Paris Carver and brags to Bond about his prowess as a murderer and his hobby as a torturer.Overall, this is a very good follow-up to \"GoldedEye\", with exciting action sequences, and great characters."
    },
    {
      "rating": "6",
      "text": "It's such a fun movie! So much great action and a bike and car chase! Pure Bondism. Watch this and feel the same thrills that went through my body when I watched this. The plot is over the top, but it's a Bond movie and damn good one."
    },
    {
      "rating": "7",
      "text": "The eighteenth James Bond movie. I think it is decent to good entry in the franchise with an interesting story, good ideas and solid action for franchise standards. The last movie Goldeneye set a good standard and we were quite interested if they can continue. The intro has James Bond searching for a decoding machine at an airport where illegal arms deals were made. It is decided to use a missile attack to kill all present theorist as it is a unique chance. Unluckily after launching the attack they notice an airplane that was out of sight with a nuclear warhead. After this the actual story starts when a British marine vessel and a Chinese fighter jet were destroyed in Chinese water and this caused a diplomatic conflict that can erupt into a full scale war. James Bond is set to investigate the strange occurrences. The story is relatively well done. It delivered and kept me engaged. The set up of a conflict is well done and you see the perpetrators doing a great job on getting even the details right. The actors did also a good job starting with Pierce Brosnan. He did an excellent job in his first performance and owned his role now. Then we have Michelle Yeoh who I consider a legendary actress as Wai Lin. A really good performance but I think they could have used her better. The villains are enjoyable. Götz Otto as Stamper is a great henchman and Elliot Carver delivers as evil media mogul. However nothing elevates them to the higher ranks in the franchise. This means not that they fail. They are a bit unremarkable after everything is over. Many ranted about Terri Hatcher performance in a small role in the movie. I don't think it is that bad or serious even if her acting reminded me to a bit of a fish out of water.  The action sequences are nice and deliver. There are a few remarkable scenes. Soundtrack wise we get a weaker or unremarkable performance. Overall this is a relatively good movie in the franchise. Sadly it is also not good enough to be in a top ranks and will not be remembered long. Even more sadly the next ones will be worse."
    },
    {
      "rating": "8",
      "text": "I consider GoldenEye the best of the Brosnan Bonds, but this entry isn't half bad either. It has some terrific cinematography and locations, a great score and theme song, a good script and some excellent action. In general the plot is not too bad, the first half was gripping and plausible, however with the transition from Europe to Asia the film loses its way. Also I found Elliot Carver rather nonthreatening and somewhat pathetic as a villain though Jonathan Pryce did well with what he had. That said, Pierce Brosnan is excellent as Bond and Terri Hatcher is a great match for him. And the support of Judi Dench goes down well too. Overall, very good on the whole. 8/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "The second Bond movie with Pierce Brosnan as James Bond has a silly and unbelievable story, but is full of action and fun. The bike scene is especially exciting and the BMW with remote control very funny.\r Brosnan is a very enjoyable Bond with his British charm and witty remarks. Michelle Yeoh is a strong leading lady and together with Bond she makes a perfect team although their sexual chemistry feels a bit unconvincing.\r Teri Hatcher as Carver's wife is nothing more than eye candy.\r Jonathan Pryce as Elliot Carver is not very threatening as a villain, with his little tablet in his hand he looks rather weak and insecure. He is definitely the weakest link in this movie.\r Carver's killerboy Stamper doesn't have much screen time and the end fight with Bond is a bit dull.\r Judi Dench who plays 'M' since the movie Goldeneye is less annoying than usual and this time around even rooting for Bond, but she's still a nagging granny.\r Vincent Schiavelli as the assassin Dr. Kaufman is very amusing indeed. Stamper: \"Sir, they can't get into the car.\" Kaufman: \"Oh you can't be serious, did you call ze autoclub?\""
    },
    {
      "rating": "5",
      "text": "Directed by Roger Spottiswoode and produced by Barbara Broccoli and Michael G. Wilson, has Bruce Feirstein script and is the eighteenth film in the franchise. In this film, Pierce Brosnan plays 007 alongside Michelle Yeoh, in the role of Bond-girl Wai Lin, Teri Hatcher, on the role of Paris Carver and Jonathan Pryce, in the role of Elliot Carver. In this film, James Bond will investigate a mysterious act of war between Britain and China, allying to an agent of the Chinese secret services. Quickly, the two spies will focus their attention on a mysterious and egocentric mogul media, which doesn't look at ways to keep himself at the top of the audience.This is the second movie where Pierce Brosnan gives life to Bond and, as in the first appearance, he failed to surprise the audience. The actor is good and strives but failed to give authenticity to his Bond, even in action scenes, and convincing the public. Not to mention that, increasingly, advertising products will invade the film as if it were a plague. The plot, however, will help getting to forget such problems. In fact, the way the mass media influences the world thinking is still a concern for many people, particularly the anti-mainstream groups. Still, it's sad to see that, as happened with the previous film, this movie also has not sought a drop of inspiration in the novels of Ian Fleming. Another very positive point of this film is the excellent interpretation of Jonathan Pryce, in the villain's role. He managed to become truly relentless. The curious Q-branch gadgets back to deserve a positive note thanks to a BMW, which not only walks alone but also has a female voice. The opening theme of this film, sung by Sheryl Crow is, in my opinion, striking and worthy of being heard and appreciated."
    },
    {
      "rating": "6",
      "text": "ummary: When a media mogul (Jonathan Pryce) pits superpowers against each other to further his own agenda, James Bond must step in to prevent global pandemonium."
    },
    {
      "rating": "7",
      "text": "Was never going to beat goldeneye but it's still very enjoyable and full of action."
    },
    {
      "rating": "10",
      "text": "I wouldn't bother with the critic's ratings, but this had got to be one of the best action adventure movies ever, especially for a Bond movie. With seven non-stop action scenes and limited drama, this movie was a blasting thrill in 1997. No other action movie later than 1997 was as performing, predictable and as great as this one."
    },
    {
      "rating": "8",
      "text": "This James Bond film is truly underrated , There is so much to love about it, the action is fantastic and the acting is quite good. The villain of the film and his henchmen were interesting and was a simple plot to follow. The Q scenes in this film are very memorable and it screams 90's.The soundtrack is excellent, but the Sheryl Crow theme is overrated, most people say Kd Lang's Surrender would fit perfectly, so do I. The plot is pretty simple, but could have been better, overall. The plot simply is about taking down the media mogul who wants world domination and exclusive rights in China. I truly think that critics got it wrong because about 50 minutes of the film was excellent and the other half was good. The one liners are good , but at times cheesy. It's an overall great 007 movie , but with a simple plot to work around."
    },
    {
      "rating": "9",
      "text": "While Die another Day (I gave it an 8) has the latest in tech and the most sophisticated action scenes, Tomorrow Never Dies is more original and satisfying, feeling more like vintage Bond. There's no shortage of great action, though, and paired with some good one-liners, this one's superior to Die Another Day."
    },
    {
      "rating": "9",
      "text": "Surely this movie is better than Goldeneye, somehow the pace was right. I liked also the villain, who was a media master and the story around him. Brosnan as Bond is very good and now even better. I also liked some other characters like Michelle Yeoh as Wai Lin or the character Dr. Kaufman.As usual many action scenes were ridiculous, but some action scenes were great."
    },
    {
      "rating": "6",
      "text": "While it can have some entertaining action sequences, the story lacks- majorly.  There are some good lines in there, but the film relies too much on action to make up for the lacking story, so it falls short.  Plus, none of the characters are very memorable here..."
    },
    {
      "rating": "5",
      "text": "Sadly, Tomorrow Never Dies is a jumbled mess of a Bond; probably the worst of the Brosnan lineup. The plot is so implausible to the point where it's almost not fun anymore, and Hatcher definitely doesn't add anything to the movie. The action scenes are so-so, but overall the movie is a flop."
    },
    {
      "rating": "3",
      "text": "I wouldn't worry if I were Brosnan, the banner is ready to spend and people are ready to chug it all up, makes some more of this wrong universal language.Tomorrow Never DiesSpottiswoode is definitely going to be a guest director. Elevating the loud set pieces with a towering priority in the narration, Roger Spottiswoode, the director, isn't even whispering the equation that enables us a front row ticket to these well choreographed dance. He, himself, is considering the motives or plot point revelations as some jibber jabber, so it would be hypocrisy for him to expect us to listen to these flips and turns let alone nod to it. What annoys me the most to suffer through is the antagonist's evil plan, go through its own journey that will eventually lead to the world domination. How far are they going to get away with this formula, in fact I would even happily accept the other way around.This is how low the expectations have grown, instead of working on creating a complex scene just to place a major stunt in narration, a better content would be appreciated much more. Even the cheesy one liners are turned to 11, and focusing all his energy into pulling off these jokes, Pierce Brosnan is always ready for the known counter attack or even pseudo reaction to huge fight sequences. There is not an ounce of humane like figure in his body which is a double edged sword, for you can only go so far with a photogenic face.Jonathan Pryce gets few monologues to show off his skills while the Bond girl Michelle Yeoh gets her own ground to tap her feet on with probably the best fight of the film; and no the chase sequence doesn't make sense, so drool over all you wish to. Tomorrow Never Dies, I never got the hang of the title, I always took it is a mockery to all the loud background score they play in the first act where we are told to get psyched whether Brosnan will be able to escape a missile zone or not."
    },
    {
      "rating": "5",
      "text": "If the villains weren't complete idiots in every situation this film would be better."
    },
    {
      "rating": "3",
      "text": "I watched all 25 from Dr.No to Spectre (including Never say Never again), I would place Tomorrow Never dies at 22nd (4th worst).This movie can roughly be summarised like this: it's a somewhat decent action flick with some of the worst acting (Brosnan was the worst Bond), dialogues, and storyline of the franchise.Plot:A British ship is in the South China sea, being told by Chinese fighters that it's in Chinese waters. The british ship thinks it's in international waters because its GPS has been hacked by some EEEEVUL force. The EEEEEVUL force then sinks the british ship, and one of the two Chinese fighters.Then, because Britain thinks that China just randomly decided to torpedo one of their ships, they send the entirety of the Royal Navy to China in 48 hours. Nevermind the unrealistic timeframe, Bond has that much time to find what really happened before the war starts.So Bond says \"well, we can ask the Chinese where THEY think that the ship was, and search the sea bed, and if it's there, we've been bamboozled.\"Then the movie ends after they find the ship exactly where the Chinese thought it was.I'm kidding.No instead, Bond, who starts off in London:Goes to Hamburg for a party.Spends the night in Hamburg.Infiltrates a factory.Goes back to his hotel.Has a chase scene.Arrives (somehow) on an aircraft carrier (somewhere).Gets paradropped in the middle of the South China Sea.Finds and searches the British Ship.Gets captured and taken to Vietnam.Escapes and has another chase.Tells a Chinese agent to \"contact both their governments and let them talk it out\" despite having physical proof that there is a ploy.Goes back to the sea in a dinghy and finds the EEEEEVUL ship.Has a big final fight and wins.Now I do not really mind this plot. It's obviously very, very stupid, and there are a ton of ways the entire movie's main thread could unravel at every moment.But it's not the first Bond to have really nonsensical stuff and even if it is pretty bad even for Bond, it's passable.But the dialogues is where this movie crashes and burns beyond words.Scene where Bond is gonna get executed by some goon:\"I must kill you Mr Bond\"*Bond gets the drop on him*\"WAIT, I'M JUST A PROFESSIONAL DOING A JOB!\"- \"Me too\".........what?Did the murderous goon seriously try to save himself by saying \"wait I'm just doing my job to kill you\"?????Scene where Bond is suspicious that the EEEEVUL villain is using GPS hacking to create the crisis:\"Tell me Villain, I was just wondering about your satellites\"- \"They are merely tools for information Mr Bond\"- \"Or disinformation\"\"Say if you wanted to manipulate the course of governments\"\"Or a ship\"I mean at this stage, just walk up to the guy and tell him \"hello i'm the agent sent to find out why your satellite misplaced one of our warships and is starting a war\"!The dialogue is so bad, so forced and nonsensical that I don't think the franchise goes lower than that. Only maybe Thunderball(worst movie), and I'm not even sure.Along with the terrible dialogue, the villain, who is supposed to be a media man, a man of words and manipulation, is one of the most petty, uncharismatic and poor villains of the franchise. No fault of the actor IMHO, simply his dialogue and character were just terrible. I however do have a personal love for his gigantic, Big Brother-style self-portrait in Saigon, that makes the movie drop into so bad it's good territory with gusto. I always burst out laughing at that scene, it's so silly.As a beer-and-chips stupid action flick, it can be an enjoyable time, but it is a movie that I love to hate more than anything. Worth watching drunk, with friends, to laugh it together."
    },
    {
      "rating": "5",
      "text": "WHAT I LIKED: Some very thrilling action sequences and clasic Bond-style dialogue feature heavily here. It's massiveoy cliched - but not in a bad way\rWHAT I DIDN'T LIKE: It is cliched, but also very formulaic, 'Tomorrow never dies' lacks interesting plot, character, pace or depth to keep it engaging. It leaves you kind of bored - and that's not a place you want to be\rVERDICT: A truly forgettable Bond with only the action sequences to redeem this very formulaic Bond adventure."
    },
    {
      "rating": "3",
      "text": "Piss poor follow up to Goldeneye that aged terribly. The first of 3 bad sequels where they made Pierce Brosnan into an Irish Steven Seagal who was also imitating Roger Moore, something that didn’t suit the series or him. Unless you’re doing a marathon or are a solid fan and want to see all the 007 movies, this one is one to skip. Goldeneye is the only one he did worth seeing. He tried, but Pierce Brosnan couldn’t  rise above the increasingly awful scripts and direction the series took before they wisely rebooted with Daniel Craig who’s been the best and most convincing 007 since Sean Connery despite what some fans claim."
    },
    {
      "rating": "8",
      "text": "Tomorrow Never Dies follows in the footsteps of GoldenEye. Again, a luxurious plot with great locations and especially with the amazing Brosnan, which I simply like as a Bond. If you liked GoldenEye, then this is probably a clear choice. Amazing movie that I recommend."
    },
    {
      "rating": "8",
      "text": "Brosnan's second performance as Bond is another great one, and by now he's a little more comfortable in the role. The way the film handles the depiction of media and the news is done so great, and is something many can relate to since the media plays a huge role in all of our lives. The action in this movie is absolutely fantastic, like the remote control car chase and explosive intro. Michelle Yeah is a badass Bond girl who can hold her own, and Jonathan Pryce is so great as a Bond villain, he's diabolical, insane, and a genius mastermind without ever losing himself. The film does stray away from spy and are towards generic action in the third act, but still, it makes for a great film."
    },
    {
      "rating": "8",
      "text": "Brosnan's second entry tops the first with a terrific villain-driven adventure that feels unique yet classic."
    },
    {
      "rating": "6",
      "text": "\"Tomorrow Never Dies\" is filled with some of the worst elements that can be associated with the James Bond franchise: the lazy bricolage, the product placement, the annoying political correctness, the emphasis on action rather than espionage or mystery, while much of what is supposed to be associated with it is frequently absent: the locations are frequently dull or urbane, the cars are uninspiring, and the women are too hard-bodied. It has a glossy, computerised sheen to it; there are almost no plot points and laser shows are sprinkled throughout the encounter."
    },
    {
      "rating": "10",
      "text": "Certainly one of the best 007 Films, with easily the most powerful heroine of all the 007 movies in Michele Yeoh's Wei Lin, who is for once a true equal to Bond. The movie has a nice balance of everything you expect in a 007 film."
    }
  ]
}