{
  "id": 2351,
  "title": "Tomorrowland",
  "starring": [
    "George Clooney",
    "Hugh Laurie"
  ],
  "runtime": 130,
  "genre": [
    "Adventure",
    "Family",
    "Mystery",
    "Science Fiction"
  ],
  "description": "Bound by a shared destiny, a bright, optimistic teen bursting with scientific curiosity and a former boy-genius inventor jaded by disillusionment embark on a danger-filled mission to unearth the secrets of an enigmatic place somewhere in time and space that exists in their collective memory as \"Tomorrowland.\"",
  "releaseYear": "2015",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iHh0nVGVODAFduF6Q6njdSSCEfX.jpg",
  "categories": {
    "plot": 6.5,
    "acting": 6.966666666666667,
    "ending": 6.2,
    "soundtrack": 7.0,
    "cinematography": 7.333333333333333,
    "familyFriendly": 7.7894736842105265,
    "funny": 10.0,
    "action": 8.545454545454545
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A film full of fresh ideas and creativity.  Clooney; Laurie and Robertson were played by an incredibly, lovable Raffey Cassidy to the wall. The refreshing dialogues between Clooney and Cassidy makes it to an experience for the whole family. all combined with a litle action and a litle fun."
    },
    {
      "rating": "4",
      "text": "Often feeling like a modern attempt to rekindle the joy and sense of adventure of 1980s science fiction films, Tomorrowland largely feels like a paltry imitation that has no idea what made those films work. Though capably acted throughout with a compelling premise, Tomorrowland gets too bogged down in the details and forgets to have a good time, instead opting to rush through its conclusion that may have a heart warming message, but really lacks the quality build-up to make it all pay-off. Though fashionable to criticize screenwriter Damon Lindelof for the issues of every film he touches, I have never had that much of a problem with the man. However, Tomorrowland most certainly falters because of its script, though with Brad Bird having a hand in the script and directing the film, the buck stops with him and there are some issues here that should have been stopped from the beginning, ignoring the internal inconsistency that also plagues the film, but could be ignored if the film were better.This major issue is the fact that the film is two-thirds exposition and character introduction. Introducing us to Frank Walker (George Clooney), his love of inventing, and how he arrived in Tomorrowland with the help of a young girl/robot named Athena (Raffey Cassidy) who recruits dreamers to come to Tomorrowland, the film then introduces us to Casey Newton (Britt Robertson). Explaining everything about their lives, showing pointless backstory about how they love science and invention, and then having Athena and Casey race to meet Frank, it takes a while for the film to introduce its central problem. While some could say they introduce it early when Athena says that Casey is needed to fix Tomorrowland because somebody made something they should not have made, that is merely a foreshadow to what the actual problem is. It is not until two-thirds of the way into the film or so that we actually learn what the problem is: the world is ending. Within half an hour, the disaster is averted due to Casey's optimism and ability to help the world stop focusing on the negative and instead refocus the world on the positive sides of things. How does she do this, you ask? Spoiler: (though a spoiler, it is one that can save you 130 minutes of your life, so I do recommend you read it) she blows it up. Yes, that is literally all there is to it. In order to justify going an extra thirty minutes, there is some fighting between our heroes and chief bad guy David Nix (Hugh Laurie), some fuss about a bomb, and sequences of Casey learning the world will end and freaking out about all of it before saving it and then teaming up with Frank to fix everything and repopulate Tomorrowland with a new set of dreamers. Until this largely cliche sequence that is just filler, there is further filler early on with Frank initially being hesitant to help Casey only to be influenced to help her when he sees guard robots from Tomorrowland following her with the mission of killing her. The film largely goes through the beats of any adventure film about somebody tasked with saving the world and needing the help of somebody who came before them and may or may not have had a hand in creating the present situation. It is a film that has been done many times before and will be made again in the future. For a film that has such an inventive premise, it is a shame to see it just slowly wind up becoming highly derivative and never breathing life into anything.The script's internal consistency is also a major issue. For example, David Nix says the machine cannot be turned off. Though it is not turned off, it is blown up, which apparently turns it off. Without any explanation as to how the world is saved and rapidly becomes what it once was where people were optimistic about the future instead of afraid of what was to come, everything is fixed. The machine that caused it having the impact it has similarly makes no sense. Allowing the user to see the past, present, and future around the world, it apparently sends radio waves or something out to other dimensions and its mere presence via these waves - even if not tapped into - caused the world to see a bleak future that was coming true via a self-fulfilling prophecy. Or something like that. With regard to the character of Athena, she is incapable of love, emotion, and having ideas, until she loves Frank, has emotions regarding the end of their time together, and has an idea on how to fix everything. Though just minor examples, these do hint to how much this film alters from its 80 minutes of exposition just out of pure convenience or forgetting the fact that it had been previously defined. The film even contradicts things mere moments after it is introduced, which really makes this one incredibly lazily written and inexcusable."
    },
    {
      "rating": "7",
      "text": "The lead up to go to Tomorrowland was better than when we got there.  All the performances were great.   I just wanted Tomorrowland to be a place that had big ideas and was visually breathtaking. Overall the world itself was just okay and all the early things on earth were the best part.  B+"
    },
    {
      "rating": "9",
      "text": "Underrated Gem, lots of interesting ideas, some great visuals. Unexpected plot turns. Give it a go if you like scifi. Some cool solarpunk vibes at times."
    },
    {
      "rating": "5",
      "text": "The trailers made this movie look great!  But the movie plot seemed to meander about as one adventure led into another.  About half way through, I was getting restless.  Sometimes a script that should have been an hour long TV show gets stretched into a two hour movie; I would put this in that category."
    },
    {
      "rating": "10",
      "text": "Tomorrowland has a great message. I really like the graphics. It has a really cool story line. I love the tech at Tomorrowland. Tomorrowland is my type of movie! :)"
    },
    {
      "rating": "0",
      "text": "Cliche, teen drama heroine, predictable, shallow, bad cast , i could not stand it from the first half and deleted it,it had potential until i saw the cast and what happens after the jump, it's capitalist , so that you have to feel bad before, in and after whatching it,the story is trash."
    },
    {
      "rating": "1",
      "text": "Meeeerde, une chierie à chiards, y a des nabots partout ! y a aussi une jeune pouffe blondasse. C'est Disney, c'est pour les polios du cerveau. C'est mièvre, plein de poésie et d'optimisme béat qui donne envie d'aller en pousser une sur le trône. C'est long, très long aussi, très bavard. Avec de jolis effets spéciaux poétiques trop jolis. Clooney fait le clown, il essaye de faire l'acteur et comme d'habitude, il fait de la peine. Il y a aussi le Docteur Maison (non, pas Bonnemaison !) qu'on a laissé sortir de son hôpital à pognon et qui est toujours aussi con. Mais c'est quand même joli ce Disney qui sauve le monde gnééééé."
    },
    {
      "rating": "9",
      "text": "-À la poursuite de demain- Est un bon film avec George Clooney et Hugh Laurie (Docteur House) ENFIN!!!Enfin la vision de la future d’âpres DISNEY ça fait rêver. Microsoft, Google, Sony ... l’avaient fait, mais la Disney écrase tout.C’est un film qui commence différemment des autres films basiques -> gros méchants, des gentils et terminer.Non dans celui-ci Disney commence par vous faire rêver .... avec c’est deux scènes d’introduction magique. Puis il vous montre qui sont les gentils, vous fait connaître quelque méchant sans importance qui font un petit clin d’oeil a TERMINATOR (au passage), vous rappelle que Star Wars est une licence qui leur appartient et en profite pour faire de la pub (ce qui mon fait plaisir,pourquoi? Car ce n’est pas un panneau publicitaire ...) Puis à la fin le gigantesque méchant.C’est une progression que j’admire de la part du réalisateur. C’est très chouette.Je n’ai pas vu ce film en 3D, mais au vu de toutes les scènes je ne sais pas si c’était vraiment la peine.Des musiques sympathiques qui nous font rentrer dans cet univers de rêve.Bref si vous avez des enfants ce film correspond quasiment à la perfection.Un film que je conseille vivement"
    },
    {
      "rating": "7",
      "text": "First off, the visuals/CGI in this are really good! I found it a very entertaining and enjoyable watch due to the different colourful worlds shown. Its quite engrossing. It definitely has a childlike naivety to it but then it is a Disney film and it seemed like a family friendly film for the most part, so thats ok.I liked the fantasy element of it. The colours are quite vivid, even in scenes set on modern day Earth, so it has a comic book type feel to it visually, aside from the CGI aspect. I felt it was a nice escapist watch - it reminded me somewhat of the Spy Kids films, in terms of the mix of CGI environments and real life scenes, although with better effects of course. I quite like watching the adult (George Clooney, rather than Antonio Banderas like in the Spy Kids films) getting flustered, while the kids seem to know exactly what their doing. There was one scene which made me think of Mr Magorium's Wonder Emporium, if but briefly.However, it does take a rather sombre tone towards the end, which some may criticise it for, as it highlights the worrying future for our planet due to the activity of humans, i.e. the impact of climate change etc.Overall (that aside) this is a fun watch which I'd recommend."
    },
    {
      "rating": "9",
      "text": "Как не странно, но почему то мне нравятся многие фильмы которые проваливаются в прокате в США. Водный мир, Поле битвы Земля, Нечто и т. д. Земля будущего, из этой серии.Даже не знаю с чего начать. Сам фильм увидел только в 2017м году по тв. Досмотрел до первой рекламы и побежал качать Blu-ray версию, ну естественно с торрента.Фильм очень понравился. Весёлый, красивый, не напрягающий фильм. Под него легко расслабиться после работы.Очень понравились актеры, особенно актрисы. Графика тоже на высоте, придраться не к чему.Сюжет развивается логично, в начале есть даже какая то интрига, чем то напомнил первых Детей шпионов. Самый большой недостаток, как мне кажется, вот в чем. Фильму был очень нужен сиквел. И сиквел нужен был с теми же главными героями. Но увы. Чёкнутые американские критики фильм уничтожили (Негров нет, лгбт тоже отсутствует. Ну как такое кино может быть хорошим в сша? ;-( ).Ещё, как мне показалось, у фильма была очень плохая рекламная компания, по крайней мере в России. О фильме я лично ничего не слышал до 2017 года, хотя в кинотеатры хожу.Хотелось было бы увидеть более полную историю того самого мира будущего, что с ним произошло, почему и кто виноват в этом. Длина фильма 2 часа 10 минут и я думаю можно было бы добавить минут 20, что бы раскрыть тайны будущего.А так это прекрасный семейный, приключенческий и фантастический фильм. Всем поклонникам Детей шпионов и Пятых элементов смотреть в обязательном порядке!"
    },
    {
      "rating": "8",
      "text": "Tomorrowland was a bit childish movie but was enjoyable sci-fi tale. This movie can be watched by any age audience and everyone will enjoy it. The story was a bit uneven. The pace was not good at the starting. It takes the movie about 30 minutes to really kick into gear but it will not effect your overall experience. I enjoyed the plot of slowly figuring out what is Tomorrowland and what's the purpose behind it all. Yes, the movie is not a perfect one but it is neither a bad one.I have read quite a lot of negative comments about this movie and even its message and I find that to be slightly odd. The main purpose of this movie was to provide fun and entertainment to the audience and it does fulfill it's purpose.Overall, I will surely recommend this movie to anyone. At least it tried something new in childish and entertaining way. Don't check critics reviews, they wrote more childish reviews than the movie's story."
    },
    {
      "rating": "8",
      "text": "It ended as one of my favorite movies back in 2010s decade. It was an awakening to my mind to think fictionally in science. It was so good for me."
    },
    {
      "rating": "4",
      "text": "While visually stunning at times, this movie falls apart badly with a script that will frustrate adults and kids alike more than it will entertain.Disappointing effort all round."
    },
    {
      "rating": "8",
      "text": "Tomorrowland is a seriously underrated film. It's got great characters, especially Athena, the robot child. People who call this preachy are just lazy. It's a great film, and one of Disney's best."
    },
    {
      "rating": "8",
      "text": "A 60 metascore? It should be an 80. This is another Brad Bird gem, with a good message. Unfortunately, Global Warming deniers seem to think it's \"preachy\".  Don't listen to them. The actress who played Athena was very good, probably better than even George Clooney!  A fantastic film, Walt Disney would have loved this."
    },
    {
      "rating": "7",
      "text": "Brad Bird should be applauded for coming up with a big budget summer blockbuster that is an original idea and not a sequel, prequel or comic book movie, and if he doesn't quite pull it off its not for the want of trying. Clooney is in fine form as the reluctant hero here, even if a lot of his job is exposition that slows the film down, and the production design is stunning, add to that a couple of outstanding action sequences and you should have a hit, but Tomorrowland comes across as a well meaning vegetarian meal when what you really want is a nice juicy hamburger. Its very well meaning, and really wants to educate, it just needed to be that little bit more fun."
    },
    {
      "rating": "7",
      "text": "While it delivers on the visuals and the performances, it is the story, plot twists, characters , disney friendly cliches and message that lack the power of Mr. Bird's previous films. With that being said,I reccomend this movie if you are a true fan of futuristic scenery, the director or perhaps the actors. But come on , Brad Bird has given us so much, lets do him a favour and simply go watch this film."
    },
    {
      "rating": "10",
      "text": "This film has struck up memories, and rekindled the imagination and hope of what I thought would be the not so  distant future. Through the eyes of an idealistic boy, we could see what we all hoped for, an idealistic, and healthy future for ourselves, and everyone. A girl, that is tech savvy and not wearing god awful pink, that is the strong character, that rebels against what she believes is wrong, and doesn't have a preoccupation with her parents. Without spoiling the storyline includes a jetpack...in the sixties, I couldn't wait till the seventies when I could jetpack to school....\rI couldn't wait for this film to come out!\rI brought my son, and we weren't disappointed...and left the movie...saying how can we make this happen?\rThis movie has a positive message, and doesn't succumb to the simplistic doomsday without a fight!\rThere are plenty of inferences to make the movie really interesting....for a change, its not as simple as it may seem...unless you are simple"
    },
    {
      "rating": "10",
      "text": "i really really really love this movie. i like the funny scene that casey get hit the wall and she didn't notice the staircase because of the pin hahaha.. i really really love this movie its a 100% for family.. hope this movie will win a award because i know they deserve it ... :) :). and I can't figure out what the critics (who gave this negative reviews) are thinking!"
    },
    {
      "rating": "10",
      "text": "You know... I went in anticipating just to see how bad this movie was and why it under performed so much.\rAnd now I know... One, Tomorrowland is nothing like the majority of bad reviews it's painted to be.  Reason two, people just weren't ready for a story that doesn't travel from point A to B in fast cars, guns blazing, in a straight line.\r There is much involved in the story, thus the general viewer will be bored, especially when it's a film about imagination and also about being a better person.. If people asked me what this film was about then that's what I would say.\rTomorrowland is film that was given a chance to be created and it just didn't pay off due to no fault of it's own.  So I want to thank the people that made this film possible.  People complain when a film is a rehash yet when something new and refreshing comes along, it's ignored and in this case.. unfairly reviewed.\rIf Studio Ghibli, Miyazaki had made this film and had it animated, then it would have been hailed as a classic and won the animated movie catergory in most awards. It really does feel like a Ghibli movie and I feel if you like Studio Ghibli, then you would like Tomorrowland. It simply does not feel like a normal Hollywood movie, which is why it failed.\r In short, Brad Bird has yet again made an excellent film, well written, well directed and well acted by all involved.  Don't buy into it's box office failure, just give it a go."
    },
    {
      "rating": "8",
      "text": "A fun, lighthearted yet thoughtful look at the reality we experience, how it arises and who is ultimately responsible. Those who \"get it\" when it comes to the film's message will no doubt enjoy this frothy, fun-filled romp. And those who don't probably can't wait for the end credits to roll (and not necessarily those associated with the movie)."
    },
    {
      "rating": "7",
      "text": "Okay, so I went to see this movie with a 14 year old son of a friend.  I was charmed by the retro look of the opening scenes at the 1964 World's Fair (I remember that, and it was pretty close to the remembered reality). One of the best things about the movie is the uncanny resemblance between the actor who plays a young Frank Walker and George Clooney, who plays him as an adult.  As sci-fi movies go, this was pretty tame, although there were a few neat special effects (a particular favorite being the multi-level swimming pools).  The premise behind the movie, that we affect the future by our attitude is something worth thinking about, \"Faux\" news aside. Other than a rather gruesome visit to a hobby shop, there isn't much that is scary in the movie, so it would be okay for younger kids (age 7 and up, I'd say). For adults, well, you have to arrest your analytical mind for a bit to just enjoy the movie at face value (not always easy to do, I admit).  But to share it with a younger person, who finds it charming and exciting and rich with possibilities...?  Well, that made the viewing worthwhile. If you don't have a younger friend to bring with you, you might just want to skip this one. But don't forget the message: we all need to work together to ensure the future of the planet!"
    },
    {
      "rating": "6",
      "text": "Disney's theme park attraction is the inspiration for this sci-fi adventure. A teen (Britt Robertson) gains access to a dazzling future world and teams up to save it with an exiled inventor (George Clooney, whose boyhood character looks confusingly like her young brother). The brief visits to this incredible place are full of eye-popping visuals and cool creative concepts, but most of the movie takes place in the present day. When director Brad Bird switches on the action, it's lots of fun (even though there's a surprising body count for Disney). The disjointed plot sometimes loses focus and momentum, especially near the talky end. There's lots here to spark the imagination, but at 130 minutes it's too long to maintain the magic."
    },
    {
      "rating": "10",
      "text": "This is our favorite type of movie where it not only entertains me and remains optimistic, it makes us think of ways to make the world better. Also, We enjoyed seeing the young girl Athena beat up male adults, as it was a welcome relief to see her type of \"fighting\" instead of fight after continuous fight enhanced by special effects which seems to be what all the other popular movies are about. But we must not be in the majority or this movie would be making as much money as those blockbusters with excessive fighting and pessimism."
    },
    {
      "rating": "7",
      "text": "Only Brad Bird can think of a movie like \"Tomorrowland.\" It is very imaginative and by all means \"futuristic.\" The script could have gone a little further but the visuals are stunning. The casts are wonderful and have great chemistry. The movie is basically a huge PSA for environmental preservation, human rights and world change. It is dreamers and brilliant minds that are able to change the future, all we need is to believe and never give up!"
    },
    {
      "rating": "10",
      "text": "well i was like most people very excited to see this movie and for the most part i was not disapointed full of laughs good action pure excitement loved george and the girls together were jhilarious i say see it take the family good fun for all mild swearing problem but other than that fast high flying fun for all tomorow land is the perfect place for everyone to spend the day u will love it"
    },
    {
      "rating": "7",
      "text": "Although the movie was a bit too long and was a bit of a disappointment compared to The Incredibles and Ratatouille, the movie was still pretty watchable. I walked in with pretty low expectations but was surprised from the beginning to almost the end. Till that point, the movie was very fun, and mysterious. But the ending or \"Third Act\" was a but of a disappointment and it just ended so quickly in a boring way. Still recommend to watch this movie with your family as it is watchable and entertaining in the beginning."
    },
    {
      "rating": "10",
      "text": "I can't figure out what the critics (who gave this negative reviews) are thinking!  This is every bit the imaginative, epic, entertaining film you could ever hope to see in the theater. My wife and I (in our 40s) along with our two kids (age 9 and 12) all absolutely LOVED this film! For a film to equally excite and entertain all members of the family as this one did is truly something special.\rAdd to that the wonderful and welcome positive messages of finding good in yourself and others and being the change you want to see in the world (among others).  This was not only a visual treat, but a delight in every way from the acting to the storytelling.  Look, I can be picky too, but those who are picking on this film must be the ones who didn't get a Tomorrowland pin.  (You'll have to see the movie to find out what that means.)  :-)  ENJOY!"
    },
    {
      "rating": "8",
      "text": "You can't make an omelet without breaking some eggs, and though there are a few shells still left in this one, it looks so tasty, that it's difficult to dislike it even if some of the ingredients are on the edge of spoilage. I had no preconception, no anticipation, and frankly hadn't heard about the film until 2 days prior to release, so I came in with a clean slate.\r Tomorrowland is an abundant, multi-course dinner with a few side-orders of mystery. Unfortunately, some of the mystery is without a real purpose. There ARE many, attractive plates on this table, but you won't have time to taste them all...\r Still, for all its challenges, this movie is magical, and amazing. I couldn't help being charmed by the innocence and magic of Tomorrowland. Raffey Cassidy as Athena is almost a movie unto herself, as she is a point of light that almost outshines the problems with the story. (There is a point where Athena drives offscreen and the movie just deflates). I also liked Britt Robertson's Casey, intelligent, but not full of herself. No princesses in this Disney film. George Clooney is in a good role, but plays in 3rd place behind the 2 females. Hugh Laurie is basically wasted, especially his ultimately ineffectual demise.\r In the end, I enjoyed Tomorrowland as a whole. It is a flight of fancy, and a pretty fancy one at that. Sure, it can be preachy, and shallow, and inexplicable, but it's a heck of a romp! The pure beauty of this unique, though somewhat flawed, gem of a movie is worth seeing, and though I rarely consider seeing movies a 2nd time in the theater, I'm compelled to do just that to get back to Tomorrowland again. I also give it an extra star for both of the female actors. Thank you Brad Bird. Looking forward to the Incredibles 2!"
    },
    {
      "rating": "5",
      "text": "Tommorowland. What a beautiful looking film, arresting in every way possible. But, it is all show, and lacks substance. First of all, Tommorowland is cliched to the max, plot twists are predictable, and the story is peppy and bubbly futuristic vibe. George Clooney gives a masterful performance, and Britt Robinson gives a good perfromance too. The worst part of Tommorowland is that it doesnt live up to the hype that it had. Brad Bird instead gave us a beautiful movie, but had no good film underneath that layer. Tommorowland is inspired by Disney's famous theme park, and there is a slight vibe added to it. There is Hugh Laurie as a maniac though. Sadly, it is a let down, but if you admire creativity, give this a watch."
    },
    {
      "rating": "10",
      "text": "I had decently high expectations for this film. I thought this movie would good fun. It was. I thought it would be well acted. Doubly so. It was far better than I expected.  The two words I think best describing it are optimistic, and engaging. I think that in this day, people don't like optimism so much; they see it as naive. I often see it that way myself. I can be very cynical, and tell myself that is just the way the world is. This movie is very optimistic, but it is not naive. They have an actual, clear point, that I believe is very well made, despite the fact that I can't see the world that way. I think those who say the plot is off, or lacking in substance, simply disagree with the message. One sentence summary of the review: This is an amazing movie, and anyone who has any real interest should definitely see it.\r Onto specifics (this is long):\r Visually, the movie was very appealing. The CGI was not always spectacular (though it was always very good), but it was always on point, serving its purpose very well. The non cgi stuff was very well done, perhaps better than the cgi. The world was bright and colorful when appropriate, and the opposite when that was appropriate.\r The action sequences were very well done, and somewhat more serious than you might expect in a PG Disney movie. There was more weight to them than I expected. Nothing to worry about showing to children, of course, but not dumbed down either.\r Coming into this year, I expected my favorite movie would be the second Avengers movie. That was reinforced when I saw it.  That said, Tomorrowland is a better movie. It has better acting, more of a point, and is more intellectual. It is also a lot more fun. This is coming from a big-time Joss Whedon fanboy.\r My favorite member of the cast was Britt Robertson. She was note perfect the entire time. It wasn't unusual  to have her reaction to what was going on around her cause my own. I've liked her for a while, but she far surpassed my expectations.\r That said, all of the actors and actresses surpassed my expectations considerably. While that probably means I underestimated them, that is also a major credit to the director, Brad Bird. I didn't know his name before the lead up to this movie, but I looked up what he's directed, which includes The Incredibles and a number of other relatively famous movies, and I think this is easily the best thing he's made.\r I would like to make a special note of Raffey Cassidy; most kids can't act. She most definitely can.\r I've described this movie as fun and optimistic, but there is definitely some pathos to it. It doesn't try to pretend things are better than they are. The full spectrum of emotions is there. It shows the world in all of its bleakness. It just isn't willing to write us off.\r If you've read this far, see it. You'll probably love it, but even if you don't, even if you disagree entirely with its message, it is well worth your time. It was well worth mine."
    },
    {
      "rating": "7",
      "text": "Tomorrowland surprised me. I thought it would be a run-of-the-mill Disney movie, which I was pleased about. First of all, the CGI is amazing. It blends in with the environment seamlessly and is the most impressive aspect of this movie. Another good thing is George Clooney's character, Frank. He's the most likeable character in this movie and is acted very well. But, unfortunately, the plot is extremely jumbled, which cripples Tomorrowland from being a \"great movie.\""
    },
    {
      "rating": "7",
      "text": "A very nice movie,  just a little slow at the beginning, and the very  last 5 minutes , gets a little cheesy, but good overall, music effects, acting and a very good story."
    },
    {
      "rating": "7",
      "text": "7 is a good score for most films, but this isn't most films. It's a Brad Bird film which means it should have been a 10+. The Michael Jordan of Film Directors, his previous 3 animated films established him in a class above all others.  In Tomorrowland, it seems Mr. Bird and company were having an off game. I had read the negative reviews by critics and then more positive reviews by fellow film goers. With all that in mind I was prepared to be both entertained and disappointed. But then as the film got rolling I was convinced that the negative reviews were all part of some conspiracy to undermine a wonderful film about dreaming boldly and bravely making those dreams come true. However well into the second hour I realized the proverbial hot air balloon of wonder was quickly loosing altitude. The ride was almost over and we hadn't gotten to the promised land of innovation and inspiration.\r The characters where all very likable, the premise was exciting, but as others have complained there was far too little tomorrowland time or deeper glimpses of what made the supposed special characters special. Ugh. In spite of falling short, did it succeed in inspiring me to dream big and make those dreams happen (maybe making the world a better place)? Maybe, but no more than the 2 minute trailers did. Ok, the scene early in film about the young inventor explaining his jet pack was brilliant, but few further inspired moments followed. Still think the world of Mr. Bird, but as with all heros, realized he is in fact mortal. Maybe next time he'll lose the co-writer and keep it true to his gifted inspired vision."
    },
    {
      "rating": "8",
      "text": "Brad Bird's Tomorrowland while not the spectacle everyone was hoping for, it was however a fun and exhilarating experience. I honestly didn't know what this movie would be like. I went into this movie not knowing the plot, not watching the trailers, and not reading any reviews. I wanted to go into this movie looking for a great story and likeable characters and that is exactly what I got. One of the first things you will notice with this movie is that the film looks beautiful and the cinematography is great. Geroge Clooney and Britt Robertson work together in a way that is unparreled in most of the big budget films today, but Tomorrwland is held down by uneven pacing. I will admit that the first and last twenty minutes are boring but not enough to make you disinterested. Ultimately, Tomorrowland fulfills what it was set out to do, bring us an enjoyable Sci-Fi flick fun for the whole family"
    },
    {
      "rating": "10",
      "text": "This movie was absolutely INCREDIBLE. I had seen Britt Robertson in her starring role on The Secret Circle but this movie made me appreciate her even more. The movie teaches people that you can do anything if you put your mind to it and to help out people in the world. George Clooney is a human rights activist and I think he made that pretty clear in this movie. The scenery in this movie is INCREDIBLE. I HIGHLY recommend it!"
    },
    {
      "rating": "7",
      "text": "This is Pretty good entertainment... and that is what I go to the movies for.... Story line good, special effects good, acting good, I do not think this is an Oscar worthy movie but most certainly worth seeing."
    },
    {
      "rating": "9",
      "text": "Surprisingly good. I didn't expect much from the director of \"The Incredibles\". While the idea - travels to the future is not new, its realization impresses. I liked all major characters, especially cyborg girl and House.MD as main villain :)"
    },
    {
      "rating": "7",
      "text": "Disney have the attention of so many child that it's unpredictable and not a good idea make a movie for people over 12 years and talking about the change of everyone in the future when this should be specially for the kids"
    },
    {
      "rating": "8",
      "text": "Tomorrowland has amazing visuals, ambitious ideas, and marvelous acting, with a good, fun sci-fi plot, sure the villian is really underdeveloped and the movie loses focus, despite that Tomorrowland is fun sci-fi adventure for the whole family"
    },
    {
      "rating": "7",
      "text": "The movie felt beatifully engineered, but its so hard to follow sometimes and some of these characters fall into cliches and the story is overall very meh. The characters, their motivations felt alright most of the time, and the special effects are beautiful. Overall, its a fun movie, but its not without its faults."
    },
    {
      "rating": "8",
      "text": "Think of it more like a poem or an essay.  It's adequate but not remarkable three act structure is most thrown away in favor of many, many wonderful moments, perfectly captured by a masterful director on a labor of love.\r I liked it much more than most critics. The most optimistic movie I can think of since Field of Dreams 25 years ago.  Nlot quite a visionary movie, not quite a spiritual movie, however if you like Brad Bird, see it.  This is great directing in so many ways.  He gets uncanny performances out of Clooney and Raffey Cassidy.  Cassidy is likely to become a star based on the performance Bird gets out of her here.\r The plot features many ironic turns and meta-comments that keep it alive thru most of its run.  At the end the villain delivers what is usually the hero's or heroine's speech and this worked well for me.  The effects are amazing and top-level all around. At $190 million, much of that is up on the screen for sure."
    },
    {
      "rating": "8",
      "text": "I saw this movie without good expectations and I have found a really nice film, original and fresh.\r The evelopment is dynamic and from my point of view it has not seemed bored at all. A very good family movie."
    },
    {
      "rating": "6",
      "text": "I think this film could have been a lot better that it was.  it’s not a bad film by any means, it just doesn’t really hit the mark for me and I think it will be actually quite forgettable in time.  It has good themes and likeable characters and some fairly decent performances, but I would hardly rush to get this on DVD and more recommend it as a rental.  The plot isn’t quite fleshed out enough despite its 2 hour running time and it really needed a better villain.  Those are the biggest problems I had with the film, other than that it’s actually kind of enjoyable and I suspect it will be a success with schools breaking up for half term and may even warrant a sequel that I wouldn’t object to seeing.  Most of the performances are pretty good though Raffey Cassidy is the only stand out performance and I would say there are worse films coming out in the next few weeks, so you could do a lot worse.  Brad Bird, I really like you, but you have made better films!!"
    },
    {
      "rating": "8",
      "text": "Brad Bird manages to once more create a wholly original film that not only is entertaining but ambitious as hell. Tomorrowland doesn't deliver what the trailers promised us, but it' fun, smart and filled with excellent action set pieces. Though it does begin to fall apart toward the third act with an overbearing message and a poor villain, it would be one of the better movies I've seen from 2015."
    },
    {
      "rating": "9",
      "text": "I'm not going to deny that I loved this movie. First of all, the most obvious, it was absolutely beautiful in every way. The special effects were completely perfect and I was just astonished by watching the land called Tomorrowland in the movie. Besides that, the story was very original and interesting. It's nice to watch a different movie once in a while. And there was a pretty good acting.\rThe only thing I disliked very much is one particular cliche at the end, and some things that weren't clear about the story.\rBesides that, this film is great, and everyone has to watch it."
    },
    {
      "rating": "7",
      "text": "I would agree with the current User Score  .....  a few of the negative reviews are too harsh.  The movie is fantasy not a plot driven story. Thus it coming from Disney Studios. Another words it is what it is ... no sense in bashing it for lack of continuity or substance. The actors do a credible job and the cinematography was well done.  So if you are a dreamer & a kid at heart buy a bucket of popcorn and sit back and relax without having to think the movie through"
    },
    {
      "rating": "7",
      "text": "\"Tomorrowland\" was an intriguing concept with stunning visuals but I did feel that the story started to run on fumes near the end. This is a great movie for kids and a great movie for adults looking to find that sense of awe and wonder inside them that they may have forgotten. After a wonderful performance from Charlize Theron in ‘Mad Max: Fury Road’ last week it was great to see two more strong female performances from Britt Robertson and Raffey Cassidy in ‘Tomorrowland’. Sure, Clooney is on the poster and he does a fine job being Clooney, but the most delightful bit for me was the performances of the two young actresses. I recommend ‘Tomorrowland’ for its optimism, its look at what we are capable of, and for its originality as a movie; which is hard to come by these days. That being said if you miss it in the theaters and see it at home in six to nine months that’s ok too."
    },
    {
      "rating": "10",
      "text": "Tomorrowland was not our first movie choice because of its reviews.  But when our first choice was sold out, we went to see Tomorrowland and were not disappointed.  It is Interesting and entertaining and is  very different from how it is presented by many of its critics.  Critics and users have found numerous faults to justify their ratings.  I was expecting a Disney commercial, a sermon, a poorly thought out ending, and there to be other problems with the movie.  I didn't experience any of those things.  What I did find was a movie that was inventive, surprising and engaging.  The movie was fresh in its presentation and the actors were well cast and believable.  The message of choosing to feed hope or despair is thought provoking.  The dichotomy of critic and user reviews seems to mirror that message."
    }
  ]
}