{"id": 2275, "title": "Top Gun", "starring": ["Tom Cruise", "Kelly McGillis"], "runtime": 110, "genre": ["Romance", "Drama", "Action"], "description": "For Lieutenant Pete 'Maverick' Mitchell and his friend and co-pilot Nick 'Goose' Bradshaw, being accepted into an elite training school for fighter pilots is a dream come true. But a tragedy, as well as personal demons, will threaten Pete's dreams of becoming an ace pilot.", "releaseYear": "1986", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/xUuHj3CgmZQ9P2cMaqQs4J0d4Zc.jpg", "categories": {"plot": 6.2, "acting": 6.153846153846154, "ending": 5.0, "soundtrack": 5.285714285714286, "cinematography": 2.0, "familyFriendly": 5.444444444444445, "funny": 2.0, "action": 6.625}, "reviews": [{"rating": "4", "text": "Top Gun is a weirdly homoerotic movie with a great soundtrack, cast and action scenes. However, The story is an absolute mess. The lack of chemistry between Cruise and McGillis is quite obvious and the romance subplot really doesn't blend well with the main story. It honestly felt like I was watching clips the entire time rather than experience a cohesive story.I can understand the cult following that it has but the critics were right. This movie is kind of eh."}, {"rating": "6", "text": "Top Gun had a story which had a lot of potential. The plot is as cheesy as any movie. After you watch the movie for a while, the story will fade but the feel and the mode of the movie is what keeps you interacted. The soundtrack was nice and aircraft scenes were nicely shot. The negative thing about the movie was it's story. It was too simple and over-stretched. It could have been made much better. This is movie which you may enjoy at cinema but not that at home. Overall, you should give this movie a try especially those who love airforce."}, {"rating": "2", "text": "Out of all the films that came out in 1986, why was Top Gun the most popular? Regardless of my own personal opinion of the film (which is quite obviously a low one), I kind of understand the draw. If I had reviewed Top Gun at the time it came out I would have probably been taken aback by the stunning aerial cinematography done during the dogfights. At the time I would have praised the film much more heavily than I am now due to our current ability to do these shots with much more ease than we had before. The film was impressive due to the limitations of the time. A factor that would move it up to a one out of 10 for me if that was all I liked about the film. I have to admit that the film's soundtrack is, for the most part, well done with suiting music for each scene. Kenny Loggins provides the film's main theme with the song \"Danger Zone\" (which would later rise to fame again through the animated show \"Archer\"). But this is where my praise for Top Gun ends.Top Gun is a terrible film when watched as anything other than a two-hour-long advertisement for the US Military, more specifically the air force. The script is a male power fantasy that over-glorifies war. It portrays all women as emotionally weaker than men, even those that hold positions of power over men. Maverick got the girl by not taking no for an answer and being over-confident in himself. The script was terrible to the point where I started laughing halfway through the film because of how forced some of the lines were. There was an overly forced romance between Maverick and his instructor while most of the chemistry was focused on Maverick and Goose to the point where they play what I can only describe as a porn song over a serious scene of the two talking. I thought they were going to get it on because the moment seemed so right for it to happen.There are better military films. There are better military academy films. And there are better actions films. The only reason I'd suggest watching the film is to see what a hilariously terrible blunder it was in the careers of all three Tom Cruise, Val Kilmer, and Tim Robbins"}, {"rating": "3", "text": "boring sappy frustrated gay movie that doubles as a recruitment ad for the Airforce. Some nice songs but it feels so dated cheesy and shallow now. Story is your typical Tom Crud vehical. cocky guy gets life lesson blah blah blah. Ice Man and Maverick have more sexual chemistry than that coma-inducing whore of a flight instructor."}, {"rating": "10", "text": "Top Gun is one of the underrated 1980s movie and still good movie to watch in 2020s."}, {"rating": "6", "text": "Top Gun is an enjoyable bit of corn with some cool music and silly but entertaining dialogue."}, {"rating": "10", "text": "La trama es un poco cursi y convencional para la época actual y bajo ese parámetro no es sobresaliente, pero no se puede negar que es una película muy entretenida y disfrutable y que las secuencias de acción son fabulosas y realistas sin necesidad de un gran presupuesto."}, {"rating": "9", "text": "Besides the fact that Cruise and McGillis had no real romantic chemistry, it's the perfect action film.  Loved the relationship between Skerrit and Cruise, and the flying is incredible."}, {"rating": "10", "text": "One of the Great movies of the 80's. Intense action scenes, and in between great brotherhood between Goose and Maverick. (RIP Goose)"}, {"rating": "10", "text": "My all time favorite movie. Amazing acting by Tom Cruice and rest of the crew. Story is great and for sure, this movie is underrated"}, {"rating": "4", "text": "I watched this film for the first time last night in preparation for its highly anticipated sequel. Now if I were to have seen this grace the big screen back in the 80s I may have a sense of nostalgia or maybe would have gabbed at the high flying spectacle indulged throughout its runtime, however it seems to exist only for the novelty of showcasing the dog fights, which to the films credit are for the most part pretty engaging and are quite impressive considering the limitations of its time. The main shortcoming with this film however is that it chooses to focus to much on the spectacle that it fails to develop most of its cast beyond one or two characteristics. This especially hurts the film when Maverick's co-pilot and friend Goose (Anthony Edwards), tragically perishes in training. For the next good bit of the movie Maverick (Tom Cruise) is in mourning, as he should be, however the audience isn't actively mourning with him. We didn't get to know Goose, or really anyone else at all, beyond service level which makes it nearly impossible to buy into the characters relationships. Maverick does go on a bit of an arc, and there are some nice moments between him and his bitter rival Ice Man (Val Kilmer), following Goose's accident, but even there rivalry felt undeveloped. Likewise the romance between Maverick and his instructor and Pentagon adviser Charlotte (Kelly McGillis) is rushed and only comes to a head only because Maverick is unable to take no for an answer. All in all it isn't a horrible film, but it isn't the classic that others would claim it is either. 4/10"}, {"rating": "10", "text": "Best Military aviation movie ever. Amazing F-14A Tomcat...I cried in some scenes..."}, {"rating": "7", "text": "A bit cheesy, but still a very enjoyable movie with pretty brilliant cinematography, certainly for an 80's movie. Tom Cruise's acting career literally took off with this movie. Nice to watch again, even after all this time."}, {"rating": "8", "text": "80's action cheese done so, so right. Tony Scott's \"Top Gun\" is as well constructed on a technical level as it is from a pop culture standpoint. So many quotes, moments and images seem almost ready-made for cultural reverberation, it's almost not even fair, but I can't say I'm cynical about it. Like Pete Mitchell himself, the film is so unrelentingly sure of itself that, as an audience member, you kind of just acquiesce to the plucky earnestness of it all. It's been a while since I've seen a movie that's this one with its time without feeling dated in any critical ways. It's an 80's time capsule for all of the most evocative and enjoyable reasons (tone, tropes, music, etc.) The cinematography, though, impressed me the most, with so many shots leaving me asking myself, \"they could do that in 1986?\" Genuinely surprised that this one ended up impressing me as much as it did, but the hype is -- in a way -- real."}, {"rating": "8", "text": "Of course this movie is a military propaganda and had a lot of help and influence by the Pentagon. But even if you know that, the movie is good: it shows many beautiful scenes, it is not full of action, but has a story and tries to be a bit above the mainstream. And imagine you are in 1987 and you look at these pictures, respect for that."}, {"rating": "6", "text": "War ganz okay, aber bot jetzt auch nicht sonderlich viel. Für meinen Geschmack bisschen zu viel Liebesdrama und etwas zu wenig spannende Action."}, {"rating": "9", "text": "Top gun is pretty much the perfect cinematic experience. Seminal photography, excellent pacing, with an energising soundtrack bolstered by the fantastic cast. The screenplay is probably the weakest area but it serves to tell the story so efficiently and with such character it just feels charming. In 4k uhd blu ray, Top Gun looks phenomenal in 2020."}, {"rating": "6", "text": "This movie has become a cult class for many. Others like me don't see the appeal. To be fair it has great actors and a compelling story but it goes a bit too much in the Navy advertising direction for me. Also between the highlights I was bored by the movie. Roger Ebert said in his review something like “The good scenes are amazing but the weaker once were unbearable”. It might sound to harsh as the movie is no failure. I see a lot of things that could win me over like showing weakness and overcoming it or character development. After the introduction scene the movie is about the pilot Pete Mitchell nickname Maverick and other remarkable pilots who enter the United States Navy Strike Fighter Tactics Instructor program that is familiar know as TOPGUN. This is in short a real life flight school for aerial combat and tactics. It was developed after the failings in air combat during the Vietnam war were investigate as the US pilots did not gain notable advantages and hundreds of aircraft's were lost. It is about character development, relationships, growth and overcoming hurdles beside flying aircraft's. In this regard it got me hooked but like I said the Navy and military advertisement is to overburdened for me. Also there are some weaker segments I would fast forward or forget. It is like multiple courses of meal but you dislike some in between. Then there are the actors. This movie has a cast of really famous actors. Some at the beginning of their careers or not that famous back then. The main actors Tom Cruise and Kelly Mc Gills fully deliver and I praise both of them. The additional cast works also really well with an excellent Val Kilmer to give credit were credit is deserved. Also Meg Ryan, Anthony Edwards and many others were good. A fine overall performance. The visuals and flight scenes are amazing and I see why it captured so many people. Even I who was not that much into this was impressed. The soundtrack is legendary and the tracks “Danger Zone” and even more “Take my Breath away” became hits and are played even today in the radio from time to time. Overall this is not my taste and I am not seeing it as cult classic like others do. However it is a must see movie as others will be shocked if you did not see the movie. Be warned to not criticize it as other take this as insult even when they agree that some parts are weaker."}, {"rating": "6", "text": "The egotistical hero and his rival could easily have been overly corny, but thankfully they’re downplayed so they don’t become stereotypes. It may be a bit thin on story, but the performances are decent (except for Kelly McGillis), as is the action. Overall, it’s nothing too spectacular, but not bad."}, {"rating": "4", "text": "Propaganda, but a classic American \"action\" film.Although, it's hard to classify as action because nobody fires any shots, and somehow think missile locks are suspenseful... I guess this is what was acceptable for a good action film at the time, but I really don't know.I will give it praise by not identifying the antagonist faction/OPFOR etc."}, {"rating": "8", "text": "O filme sofre de cadência técnica, julgo que seja por causa da tecnologia da época. A história em si é bem simples e direta, mas com um bom ritmo. Um ótimo filme com trilha sonora icônica e marcante."}, {"rating": "8", "text": "It is not a movie that makes history but it is one that appeals to nostalgia for the 80s. The story of a fighter plane pilot who learns the hard way what it is to be number 1 is quite conventional but enough to kill 109 minutes without pain. Shall we wait for the sequel?"}, {"rating": "9", "text": "Terrific 80’s FilmTop Gun is definitely one of my favorites from the 1980’s."}, {"rating": "8", "text": "Top Gun. Ride into the Danger Zone. Quite an interesting movie. You rarely see a movie in which most of the time is flying. The title theme is amazing, the flights are great, Tom Cruise A +."}, {"rating": "7", "text": "Tense action scenes with legit stakes. The romance part was a wee bit rushed. Some heartfelt friendship moments. Ace killer sound track for sure. I think people who like the Village People \"In the Navy\" Song worked on this film?"}, {"rating": "10", "text": "What ever you do, Don't be attacked, This movie is mediocre and hip!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"}, {"rating": "8", "text": "Der größte Schwulenfilm aller Zeiten. Tom Cruise vor Katie Holmes und Kelly McGillis ist heißer wie Lava."}, {"rating": "6", "text": "Su historia es decente, pero las escenas de vuelo y acción son impresionantes."}, {"rating": "7", "text": "I just had to see Top Gun because I'm a fan of the 80s. That's why I liked the movie a lot, because I got what I wanted and that's the 80s atmosphere, which is mainly emphasized by the setting and the music. Take My Breath Away is just delicious. But from the point of view of someone who somehow doesn't like this era, I guess for them it's only a good, maybe even above average film. Story-wise it wasn't anything too special for me, although it wasn't bad. For me, it was mostly the atmosphere that pulled it together, and for me it was a good movie that I would recommend to fans of 80s action movies."}, {"rating": "8", "text": "Let's just started with my main problem or the only problem i have at least mostly with Top Gun is that i don't feel the relationship between Pete and Charlie later on, and what i mean later on is that i'm fine at first but as the time goes i just wanna see Pete flying that damn plane in a very cool way rather than seeing her and once they see each other again i'm not feeling it anymore, the rest of Top Gun is just a great and fun movie that performly well with a very great visual, great music, beautiful shot, and overall it's just a great movie and i like it mostly."}, {"rating": "7", "text": "Makes me think this is an aviation edition of \"The Deer Hunter\", but is a flick that is infested with dexterous editing, moxy in aircraft control, and a cast with enough charisma to make the audience feel like it is on a stray roller coaster ride."}, {"rating": "4", "text": "Parabéns! Fazia um tempo desde que não assistia a um filme tão chato. A história não é interessante, a trilha sonora não é boa, o romance parece que foi só jogado etc. etc. etc...."}, {"rating": "6", "text": "At its best when it focuses on the spectacular air combat scenes instead of the average love story and sequences on the ground."}, {"rating": "6", "text": "a fantastic soundtrack When the phrase \"danger zone\" is spoken, few people from the 1980s do not have their hearts beating. Tom Cruise has a nice performance, but Val Kilmer's is the one that stands out in my mind. The film combines the pleasure of flying with the challenges of military life, as well as the raw emotions of young \"guns.\" These gentlemen remind me of the military men I encountered as a kid: committed to their jobs yet always up for a thrill. The narrative is faithful to the drama and realism of what it is like to be a man in uniform, forgive the old-fashioned term, but the statement represents the spirit of the film."}, {"rating": "6", "text": "good old movie with handsome actors and beautiful actress, and eye candy plots with popcorn"}, {"rating": "8", "text": "A good 80's movie i liked and loved too the effects and everything else about it is amazing i like this movie with its flaws in it too"}, {"rating": "8", "text": "Overall, I'd say this was a fun movie that worked for its time. The goose death scene killed me. But, the sequel was far better."}, {"rating": "8", "text": "When I first watched this movie, I was shocked that it was filmed in the 1980s.It's America's golden age and the eve of the collapse of the Soviet Union. The Navy's support made this film more realistic.But the story is not that good, anyway, it's really enjoyable even in the 2020s."}, {"rating": "3", "text": "new in metacritic all thought ik this is a game rating platfrom for prefreing and a worse version of rt..but still wellnow about movie i didnt like it xd"}, {"rating": "10", "text": "The absolute best aerial footage Ever. Great Chemistry all the way around. #Epic"}, {"rating": "3", "text": "It is ridiculous, how boring this piece of Moviehistory turned Out. Please kill me!"}], "recommendations": ["top_gun_maverick", "creed_ii", "hanna", "avengers_age_of_ultron", "gemini_man", "the_island", "the_magnificent_seven", "king_arthur_legend_of_the_sword", "troy", "pearl_harbor", "rocky", "ford_v_ferrari", "drive", "mad_max_fury_road", "black_widow", "haywire", "the_suicide_squad", "boss_level", "the_harder_they_fall", "blade_of_the_47_ronin", "the_equalizer_2", "bumblebee", "hercules", "armageddon", "thor_the_dark_world"]}