{
  "id": 2505,
  "title": "Top Gun: Maverick",
  "starring": [
    "Tom Cruise",
    "Miles Teller"
  ],
  "runtime": 131,
  "genre": [
    "Action",
    "Drama"
  ],
  "description": "After more than thirty years of service as one of the Navy’s top aviators, and dodging the advancement in rank that would ground him, Pete “Maverick” Mitchell finds himself training a detachment of TOP GUN graduates for a specialized mission the likes of which no living pilot has ever seen.",
  "releaseYear": "2022",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/62HCnUTziyWcpDaBO2i1DX17ljH.jpg",
  "categories": {
    "plot": 8.944444444444445,
    "acting": 9.090909090909092,
    "ending": 8.7,
    "soundtrack": 9.181818181818182,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 8.0,
    "action": 8.866666666666667
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Many times the entertainment that doesn't seek to be complicated tends to be very relaxed and ends up being rather poor and, of course, completely forgettable.Top Gun: Maverick falls into the category of pure entertainment, but it's one that makes the case of how to do it the right way. The story may seem simple yes, I'll give you that, but its strength is the action sequences and the film doesn't lie about it and gives it to you in abundance. Everything that happens with jets in this film is spectacular, especially that beautiful opening sequence with Maverick piloting that hypersonic plane. Does it rely on nostalgia? Of course, especially with that little Val Kilmer appearance, but it never feels like a gratuitous resource within the story. After all the movie makes it clear that it's a sequel, but it's not 100% vital for you to have seen the original.And even if you can question how necessary this sequel was after 36 years, this story proves its functionality in the blockbuster branch that should continue to invest in films like this one. Yes, it's a sequel and stars an ultra-famous name, but there's life for blockbusters outside of superheroes.Of course, that remains to be seen at the box office, after all, even with inflation, the original film cost just over $30 million, Top Gun: Maverick, not counting marketing, cost over $150 million.It sounds repetitive and perhaps for people who prefer streaming they won't even flinch, but as Cruise said it and as he fought for it, films like these are the ones that remind us why the theatrical experience will never be matched. Go see it, and have a good time."
    },
    {
      "rating": "9",
      "text": "Cruise control baby! I think this film is best described as the movie that was made in the 80s and I mean it in the best way possible. Apart from technology that was used to achieve beautiful shots of fighter planes action this film is a classic heroism tale. It's full of heart, badass moments, character drama and romance that's perhaps the only unnecessary part of the film."
    },
    {
      "rating": "10",
      "text": "FANTASTICOOOOOOO, Miglior film dell'annoTom Cruise è lui la CGI, cast favoloso e regia da oscar!!!Consigliato!!!"
    },
    {
      "rating": "9",
      "text": "It is really good I like the actions and the relations between maverick and the students."
    },
    {
      "rating": "9",
      "text": "Just a lot of fun with lots of nostalgic nods to the original. Highly recommended as an action film for some escapism."
    },
    {
      "rating": "7",
      "text": "Much better than expected. Certainly better than the first Top Gun.  My only real complaint was the love story w/Jennifer Connelly.  This is a movie made for the movie theater. I was entertained"
    },
    {
      "rating": "10",
      "text": "A rare sequel - this one is actually better than the original. If this was a stand alone movie it would be a seven/eight of ten. But as a sequel navigating the modern outrage mobs and other cantankerous spoilers and wreckers waiting in the wings to bring anything good down this thing is a solid ten. Tom Cruise doesn't look almost 60, he is in unreal shape for any age, but the work and dieting he must put in to look like this at 59 is nothing short of amazing. There is less cheese than was in the first movie, the music is great, and to see these people grunting and huffing while pulling real g-force maneuvers in real airplanes is so great. Tom Cruise had to take a huge amount of abuse to make this a reality - you can see the actors in planes sweating and suffering tunnel vision and black outs and redouts. One must have a healthy  respect for Tom Cruise for being one of the very very few in hollyweird that actually cares enough about his craft to put in the work. I hope this kicks off a new wave of serious remakes that can even outshine the original if done right and I hope this kicks off a new wave of movies that skip the idiotic computer generated trash and get back to practical effects like this movie. This is basically an 80's movie done right - take all the good music and good looking people, reduce the cheese and come up with an engaging multi-faceted multi-layered plot that develops emotion and take it to eleven on a scale of ten."
    },
    {
      "rating": "10",
      "text": "If you watched TopGun as a kid and loved it, this sequel will bring you to your knees with tears. It brought my entire cinema down in a rollercoaster of HOOOOLY **** and NOOOOO and HELLYEAHHHs. It’s that good. I’m not a Tom Cruise fan, actually the opposite. Have a hard separating his acting and his “religion”. But daaamn, that man brought his A game to this one. Easily the best flick 2022 so far (guess it should earn “best late movie of 2020"
    },
    {
      "rating": "9",
      "text": "Top Gun: Maverick is as good if not better than the original movie from the 80s. The first and third acts keep in glued to the screen in anticipation to what will happen next. The nostalgia music sounds just as good 30 years later. All actors from Tom Cruise to the younger crew do an exceptional job in their acting. The real jet fighter scenes really encapsulate the jaw dropping moments during several parts in the film. The revamped volleyball scene does not disappoint either. And the film ending with Gaga's epic ballad really seals the deal."
    },
    {
      "rating": "10",
      "text": "Epic. Amazing. I've seen it more than once and still want to see it again. Its better than I expected."
    },
    {
      "rating": "8",
      "text": "A great sequel, better than the original easily. Absolutely awesome. Excellent cinematography. Best film I've seen in years!"
    },
    {
      "rating": "9",
      "text": "This is what you want from your entertainment—funny material to watch, without any BS or forced politics.One of the few movies in recent memory that genuinely kept me on the edge of my seat in the theatre, the action was great with either no or very little cgi."
    },
    {
      "rating": "10",
      "text": "One of the best cinema experience in years, It went into my top movie list."
    },
    {
      "rating": "10",
      "text": "What did I just see? A movie respecting established characters. In the woke version, Maverick is a broken hobo called back to teach a team of lesbians who are already perfect in every way and teach him not to be a pathetic loser."
    },
    {
      "rating": "9",
      "text": "Firstly, the flying sequences are breathtaking and this is all because they did it practically. This is especially noticeable in the final act which is one of the best I've seen in recent memory. Additionally, the music score by Harold Faltermeyer, Lady Gaga, Hans Zimmer, & Lorne Balfe is very good. I love how they incorporated those 80s tracks into the film while giving more modern and fitting music as well. Furthermore, their music score during the intense action scenes are well done and helps to make the scenes tenser.Tom Cruise is still great as Maverick even after almost 30 years. He still embodies the character perfectly and does feel like a natural evolution of his character from the first film. I genuinely believe that this is what Maverick would be like in 30 years. Miles Teller is also great as Rooster, Goose's son, and he has great synergy with Tom Cruise in their scenes together. Jennifer Connelly plays the new love interest for Maverick, Penny, and she is also great in her role thanks to her great chemistry with Tom. Glen Powell plays the rival to Miles and he is very good at being this overly cocky, hateable guy. Likewise, Jon Hamm plays the commander that is antagonistic to Maverick and he also does a good job at being hateable as well. Val Kilmer is one of the few actors from the original to return and I was interested to see how they would handle his throat cancer situation in real life. Thankfully, this film handles it respectfully and probably results in one of the most emotional scenes in the film. The rest of the supporting cast, including those who play the recruits, all do a good job as well.Moreover, the story itself is also surprisingly enjoyable. The first Top Gun was a cheesy action flick but this one is a very down to earth, character-driven story. Maverick is a lot wiser now thanks to the character arc he got from the first film when he was a student. However, now he has to be the teacher and this is a great antithesis to the story in the first film. The conflict between Maverick and Rooster is the heart and soul of this film. This family dynamic they have is the most engaging aspect of the story as Maverick now struggles with the possibility of letting the son of his once best friend die. Nevertheless, I do have some minor nitpicks with the film. I do find the dynamic of the recruits never does quite match the dynamic of the recruits from the first film. I never felt as strong of an attachment to the recruits and this is probably due to the film focusing on the teacher Maverick. There is also a romantic subplot with Maverick and Penny that just feels very superfluous. It never felt like the romance part was even connected to anything in the main plot. Heck, you could take this romance subplot and Penny out of the film and the main story is still the same. It just felt like the romance plot just took away screen time from the interesting stuff. I am also a little annoyed that there is no dialogue or line to explain why Maverick isn't with Charlie from the first film anymore. Especially, considering how relevant that character was in the first film.Overall, Top Gun: Maverick is better than the first movie in almost every aspect. It has more amazing action sequences and a more interesting character-driven story. In a world where CGI seems to always be the go-to solution, we then get a rare movie like this where the majority is practical and it is all the better for it. This is not only a worthy sequel but also an amazing accomplishment in movies."
    },
    {
      "rating": "10",
      "text": "Great movie. Ive been there 9 times and may go again over the weekend. Such a relaxing American pie, feel good movie. Wish there were more movies like that."
    },
    {
      "rating": "9",
      "text": "Fantastic movie that takes everything good from the first one and improves on it. I can't fault it."
    },
    {
      "rating": "9",
      "text": "I can NOT believe we got a shirtless and sweaty full on Tom Cruise running moment. And the movie pulled it off semi unironically."
    },
    {
      "rating": "9",
      "text": "One of the best cinema experience in years. Watch it in IMAX, you will not regret it!"
    },
    {
      "rating": "8",
      "text": "The short review: This has the best jet fighter action scenes in a film, EVER. The human drama part, however, falls a bit short. Related media: I have seen the original Top Gun film on TV numerous times. That film likely had the best jet fighter action scenes in a film back then too, and the human drama part also fell a bit short back then too.Positives:1) All the jet fighter scenes are genuinely, top of the class! 2) The sound effects and the special effects are really top notch!3) The excuse used to feature the F-14 fighter in the film in a major way, when no F-14 is allowed to fly anymore, in the military or by the public, is CLEVER.Negatives: 1) (This is hinted at in the trailer, so it’s not spoiler.) It has been some 35 years since the events in the original film. Surely the grief over the death of Goose should be over by now? This part is rather unrealistic. I know there’s more to it, but still…2) The past relationship between Maverick and new flame was hinted at, but not covered much in this film. This coincided with a slow part of the film, thus making this part feel poor.3) The original film had two great original songs. The songs in this film are not great.4) (This is hinted at in the trailer, so it’s not a spoiler.) The top enemy fighter plane is obviously the Russian Su-57 (Felon), yet the film makes all attempts to call it the ‘fifth generation fighter’ rather than its real name, all the time, such that the film distributor can sell the film to the Russian market. That’s silly! Considering the banning of such sales following the Russo-Ukrainian war, that’s all for nought! Pilots would not use so many words to describe the fighter. As with the original Top Gun film, where the enemy fighter was given the fictitious name, Mig-28, here the fighter should also had been given a fictitious name, like ‘Firefox’.Children: Excellent.Teens: Excellent.Young adults: Excellent.Medium-age adults: ExcellentOlder adults: Good.    My rating: 4/5 (no half scores). Definitely watch it in the cinema."
    },
    {
      "rating": "9",
      "text": "Miles better than the original 1986 film and one of my favorite sequels of all time. God this film is just awesome. That’s the best way to describe it; awesome. The flying is awesome, the characters are awesome, the music is awesome, and the action is awesome. Tom Cruise’s dedication to making realistic action films with little to no visual effects has paid off incredibly well here. The flying scenes were filmed practically but they look amazing. Some of if not the best shot sequences of the year so far. I absolutely adore how they look and it’s amazing that the actors were able to act in those conditions. They all do a great job acting. Tom Cruise, Miles Teller, and Glen Powell are all standouts here and their respective characters and journeys were really well done and even compelling at points. Val Kilmer did a great job as well under his own personal circumstances. The film handles Kilmer’s medical condition and character incredibly respectfully. It’s a great handling of his character. The action here is awesome. It’s incredibly well thought out and intense. You could know or predict the outcome of a scene and you could still feel your heart beating out of your chest just because of how well done the action is. It’s genuinely some of the best action in a blockbuster that I’ve seen in a long time. The final action scene itself is probably my favorite action scene of the year. It’s absolutely amazing and so much better than the final fight in the original film because it’s actually set up. The music here from the original Top Gun composer, Lady Gaga, and Hans Zimmer is great! The soundtrack itself isn’t near as good as the original 86 film but it’s still great here. I can’t wait to see how Cruise breaks the mold with action again in the future. This is a must see from me for everyone. This film deserves to break $1 Billion at the box office so go see it now!"
    },
    {
      "rating": "10",
      "text": "It's probably the best movie this year,  better than the first top gun in every point"
    },
    {
      "rating": "9",
      "text": "Outstanding .If you didn't see the first part, see it first before experiencing this one ,this part just does what a sequel should do - which in this case means Doubling down on the Incredible Visuals ,Thrills and Emotions that made the topgun so much Fun!And you just can watch it for one man the maverick himself TomCruise ,he is keep finding ways to entertain to the highest level and this role he just done it with heartwarming emotions !Excellent making and directions and background score is perfect to the story pacing and all cast done terrific job !!"
    },
    {
      "rating": "9",
      "text": "I don't like movies.  I only saw this because I had a free ticket.  I don't care about f18's. I never saw Top Gun.  This was a great movie.  Don't sell short on Tom Cruise getting an Oscar nomination for this.  He pulled everything together very nicely.  The story is superficial, non-stop fun.  It's worth seeing."
    },
    {
      "rating": "10",
      "text": "Outstanding. And I don’t write that lightly. This film really delivers. I wanted to watch it again immediately. Solid but simple story line.Great cast. Amazing flight sequences. Action.  Humour. Sadness. Love. Just a great blockbuster movie . To be honest, I’ve missed this sort of cinematic experience. This all being lead by the unbelievable , incredible Tom Cruise. Who truly puts himself on the line for the film goers. A true artist. One of the last real classic film stars. This film has all that you need. Will it win Oscars? Probably not. But will you get your money worth? Absolutely. In my humble opinion, This is such a better movie than the first, even though I still love that movie. I was gripped within the first opening minutes. My heart did not stop beating at high rates in anticipation of every moment. I was not disappointed. It’s been a long long time since I’ve experienced that rush and enjoyment watching a film.  I recommend anyone to go see this film. You will not leave disappointed. ( I hope). ⭐️⭐️⭐️⭐️⭐️"
    },
    {
      "rating": "8",
      "text": "If 'Top Gun' is about Maverick coming into terms with his sexuality — as Tarantino explained in that hilarious video — then 'Top Gun Maverick' is about Tom Cruise saving the cinematic experience. When Ed Harris' character tells Maverick that \"his kind it's headed for extinction\", Maverick's \"But not today, sir\" is Tom Cruise's war declaration to streaming services. As long as he's alive, no film of his will debut on any platform. Even if you hate the guy, you gotta praise his commitment to the good old habit of going to the cinema."
    },
    {
      "rating": "10",
      "text": "It's very rare for any movie to be worthy of a rating of 10. For an action drama sequel -- this was a 10. It hits all the right notes -- action, suspense, drama, nostalgia, love --and the story is a good one. It's a fun ride. Good way to kick off summer. Bravo to Cruise and team for making a good movie at a time when most everything else is crap."
    },
    {
      "rating": "10",
      "text": "Everything I wanted and more. I knew I was going to see this movie in theatres, but it was spur of the moment to see it tonight. I’m so glad I did. I intend to see it again in IMAX.I was starting to think movies would never be good again but then Everything Everywhere All At Once and Top Gun Maverick back to back. Hell yeah movies are back baby"
    },
    {
      "rating": "9",
      "text": "Honestly, the hype this had coming out of Cannes had me a bit worried. If even that film festival's occasionally-fussy audience members managed to bestow this with near-universal acclaim, then that's a lot of damn pressure on me to like this thing too. Christ alive did I nothing to worry about. Not only is \"Top Gun: Maverick\" at least a worthy companion piece to the seminal 80's classic, it's a disarmingly superior film and quite possibly one of the best sequels to a movie that's about as much of a cultural fixture as movies can get. Joseph Kosinski, Tom Cruise and the screenwriting and stunt teams needs to take a victory lap on this one. Potent emotionality, eminent likability on the part of Cruise and ripping soundtrack aside, the thing I loved the most about this one is how much the stakes and circumstances are ramped up this time around. I remember the set pieces in the original Tony Scott film being engaging and entertaining, but never quite as intense and menacing as they're presented here. There's almost a point in the film where you as an audience member are dreading the moment where this final mission has to take place. The action also scales in such a satisfying way throughout the course of the film, with the finale honestly constituting one of the best action sequences I've seen in a movie in a very, very long time. Doubtful that any summer movie's going to top this in the coming months. Completely floored with how much I absolutely loved nearly every minute of this."
    },
    {
      "rating": "10",
      "text": "Same as Kobra Kai! THIS is how you make a sequel! It's better than the original. Scenes from the first movie are replicated the perfect way and that is how you pass the torch to a younger generation. The movie honors the characters and that's exactly what I wanted. It brings out so many emotions I can't describe...it's a rollercoaster in every way. At some point you think the movie is over, but it keeps going and it only gets better. The original score completes this amazing movie."
    },
    {
      "rating": "8",
      "text": "This movie was solid overall with a good opening and a great ending with a bunch of filler in the middle that hurt the pacing of the movie. All the action scenes are incredible. The romance between Maverick and the bartender didn't work for me at all and all those scenes were bad. Maverick trains all these top gun fighters for a mission that's like something from Ace Combat 7. Ice man was in this too and there's some emotional scenes with him. Movie could have been amazing but it was just missing something in the middle that could have made it a little more interesting or entertaining. Honestly the middle of this movie dragged. If you like the romance stuff maybe you disagree but it didn't work for me. Also Goose's son is in this movie as a fighter pilot and there's a storyline involving him in Maverick that is interesting and it really works well. Some of this movie is incredible and better than the original. But I think in the original the romance worked more. In this one it didn't at all maybe because Tom Cruise is older and the actress playing the bartender is not that good looking and old"
    },
    {
      "rating": "10",
      "text": "Best movie I've seen in recent times, currently there are only bad movies, this one was much better than expected. Congratulations!"
    },
    {
      "rating": "9",
      "text": "One of the best cinema experience i've ever had.Must see on cinemas absolutely."
    },
    {
      "rating": "9",
      "text": "Worth seeing in the theater. The flight scenes will leave you feeling affected."
    },
    {
      "rating": "9",
      "text": "As someone who hasn't even seen the first TOP GUN movie, only knowing a few story details, I can honestly say that TOP GUN: MAVERICK is a very enjoyable and very well done film. The movie is worth watching, even if you haven't seen the first film. This movie may not do anything \"new\", but it does a lot right. I definitely recommend checking this blockbuster out."
    },
    {
      "rating": "9",
      "text": "This movie is just fantastic, the flight scenes are amazing, Tom Cruise is great as always, and the music is top-notch. Also, the use of Danger Zone at the beginning was so great for fans of the song and the original movie."
    },
    {
      "rating": "9",
      "text": "I saw the original when I was 4 years old back in 1986. I cried through the whole opening scene of Maverick. Fast, loud and unapologetic. Pure visual poetry. A true and worthy sequel."
    },
    {
      "rating": "10",
      "text": "Best film I've seen in years and the best cinema experience I've had since The Dark Knight."
    },
    {
      "rating": "9",
      "text": "Top Gun: Maverick is a phenomenal example of modern-age cinematography. The 3-year delay for this movie is justified by the final product we are fortunate to see. It is far too common that Sequels for Standalone films are produced purely for 'nostalgia money' but Top Gun: Maverick is an anomaly of modern-age filmmaking. My respect for the cast and crew was further enhanced by the knowledge that they used practical effects and put the actors in actual Military-grade fighter aircraft. Too often are films quickly made and rushed with the use of CGI and it is incredibly refreshing to see a movie created with sheer passion and commitment to creating this sequel. I was not born to witness the original, but my Mother and her Friend's enjoyment in the cinema proved to me that this movie whilst bringing a new plot, could also pay homage to the feeling of the original.The story is told in a manner that is neither boring nor underplayed, and the return of iconic actors in a realistic way further enhances the respect given to the original. Although there are elements of the plot that are bland, the feeling of the movie suits the narrative. The actors all deserve huge credit, not only for their performance but also for their dedication with flight-training to partake in their roles to the best of their capabilities.This is a great movie in a time of over-saturation and CGI, I am so refreshed to see a movie that does not rely on the use of CGI and soleless storytelling, more like this, please."
    },
    {
      "rating": "9",
      "text": "It's a good movie overall, but the 3rd act is utterly breathtaking in every way and carries it several steps up."
    },
    {
      "rating": "10",
      "text": "Much better than expected. Certainly better than the first Top Gun. My only real complaint was the love story w/Jennifer Connelly. This is a movie made for the movie theater. I was entertained"
    },
    {
      "rating": "9",
      "text": "This movie was impeccably filmed, had great music, awesome sound and an engaging story. It didn't seem to have a slow moment in it.  The military hardware was great to see in motion and everything just \"felt\" right with a lot of throwbacks to the earlier film as well as this one forging its own path.  Fun, poignant and great action. A review score seems almost arbitrary as I'll buy this on 4 k when released. So if you liked the first Top Gun you'll like this one.  9.9/10. Go see it then go and buy it on your favourite format when it's released. 25/5/2022."
    },
    {
      "rating": "10",
      "text": "TG: Maverick es sencillamente impresionante, si te gustó la original, esta te va a encantar. Tenemos a un Tom Cruise entregado al máximo, es sin duda el mejor actor para este tipo de películas sin ser encasillado ni estereotipado. Los efectos especiales son una bestialidad, pero el sonido juega un papel muchísimo mayor, te envuelve y te atrapa de primera, por lo que si quieren pasarla en grande, veanla en el cine, en la mejor sala y butaca posible y no se arrepentirán.Solo tengo un pequeño pero y es que pareciera que el personaje de Charlie nunca existió, porque no es mencionada ni por accidente, sin embargo, su total ausencia es imperceptible.Una secuela colosal y brutal sin necesidad de minimizar a la original."
    },
    {
      "rating": "10",
      "text": "Excellent movie! It honored the work of Tony Scott and even made me remember the good movies of the 80's and 90's."
    },
    {
      "rating": "10",
      "text": "Just created account to rate this movie...Absolutely stunning, simply epic sequel. I'm speechless."
    },
    {
      "rating": "10",
      "text": "This film is a combination of steroids, adrenaline, testosterone, endearing positivity and bottled nostalgia that gave feelings that I haven’t felt since childhood. I left the cinema feeling.. alive.Tom Cruise is spectacular, both on and off screen."
    },
    {
      "rating": "10",
      "text": "I've seen this 3 times. In short, it's a top 5 best I've watched in the theaters in my life. Perfection. Mission accomplished, Tom."
    },
    {
      "rating": "10",
      "text": "Absolutely fantastic movie. Fun story, great characters and incredible in cockpit camera angles."
    },
    {
      "rating": "10",
      "text": "An excellent sequel to a classic. Full of the franchise's signature high octane scenes, the movie nevertheless manages to have many emotional and poignant scenes, especially between Maverick and Rooster. The movie also has an incredibly touching moment paying tribute to Val Kilmer that had everyone in the theater with me tearing up. I definitely recommend it."
    },
    {
      "rating": "8",
      "text": "Top Gun 2 delivers that 80s cheese you want with a striking coat of modern paint.  While I wasn’t moved by the film’s paint-by-number emotional subplots, they were in service of a well rounded story that pays off marvelously in its final stretch.  The last 30 minutes of this film are among the best stretches of any action film I’ve seen.  It becomes a full on roller coaster that deserves to be seen in IMAX."
    }
  ]
}