{"id": 1886, "title": "Total Recall", "starring": ["Colin Farrell", "Kate Beckinsale"], "runtime": 118, "genre": ["Action", "Science Fiction", "Thriller"], "description": "Welcome to Rekall, the company that can turn your dreams into real memories. For a factory worker named Douglas Quaid, even though he's got a beautiful wife who he loves, the mind-trip sounds like the perfect vacation from his frustrating life - real memories of life as a super-spy might be just what he needs. But when the procedure goes horribly wrong, Quaid becomes a hunted man. Finding himself on the run from the police - controlled by Chancellor Cohaagen, the leader of the free world - Quaid teams up with a rebel fighter to find the head of the underground resistance and stop Cohaagen. The line between fantasy and reality gets blurred and the fate of his world hangs in the balance as Quaid discovers his true identity, his true love, and his true fate.", "releaseYear": "2012", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/fucmGeZYM4yzqJUnDTc4pKQNCej.jpg", "categories": {"plot": 7.190476190476191, "acting": 5.833333333333333, "ending": 8.4, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 6.0, "funny": 7.0, "action": 6.666666666666667}, "reviews": [{"rating": "10", "text": "Philip K. Dick is one of the best sci-fi authors in history. In fact almost all his written work has been transposed into great film. Total Recall is one of his best efforts. Again this is a movie that requires a thought process, so if Napoleon Dynamite is your fave, give up and don't watch this movie because you will get lost. The ending is purposely left to your won interpretation... this makes it GREAT!"}, {"rating": "10", "text": "This is arguably a better Arnie film than the two Terminators. Excellent and till remains a classic."}, {"rating": "10", "text": "One of the best science fiction movies ever. Other than seeing Arnold take over the screen with a fantastic performance, Total Recall is witty, fast-paced, action packed, and occasionally humorous."}, {"rating": "10", "text": "Other than Terminator 2 and Predator, this is my goto Schwarzenegger movie. The practical effects still look good almost 30 years later and the infamous ambiguity of the whole movie holds up even more. Arnold is a great hero who not only comes off as an invincible action star but also feels vulnerable at points. the last thing i have to say is that i'm actually depressed that the 2012 version has worse effects than a movie from 1990. but this one is one of my favorite films ever."}, {"rating": "8", "text": "Intelligent and action-packed, Total Recall is one wild ride. The whole project holds an air of mystery and the plot is packed with twists. The effects have held up surprisingly well, helping the film engage viewers with stunning effects and intense action scenes."}, {"rating": "9", "text": "This film is my preferred of Schwarzy with Terminator 2.\rI do not understand the mean scores of the press.\rThe 2012 version is completely missed it."}, {"rating": "10", "text": "An intricate and clever plot, with cinematography that will keep you riveted. Perhaps the most intelligent movie starring Schwarzenegger ever."}, {"rating": "8", "text": "One of the fewest stunning visual environments of Mars that this movie has to offer. While the plot is great, this sci-fi movie keeps you riveted for more. The remake of the same name isn't great that it used to be, because the main theme of this movie is all about Mars and not the future look of Earth."}, {"rating": "7", "text": "Total Recall is a fun movie. The film isn’t deep but it is fun with suspense, action, and twists. The way the future is realized is creative and clever and easily a highlight of the film. Total Recall could’ve been more if the film had embraced the concept of the recall machine and used it to raise moral and ethical questions but instead it just devolves into a straightforward action movie. Asking for more isn’t a huge complaint as the movie is still a blast its just that extra bit of depth could’ve made this something more."}, {"rating": "9", "text": "Wonderful film. True Sci Fi. Unfortunately I think many watch it today and rate it yet forget it was made in in 1990. It has the suspense and great feel any good Sci Fi film should have and it has Arnold! Can't beat that. If you haven't seen it you must check it out."}, {"rating": "10", "text": "Great movie. The story is well written, and you always ask yourself, what is real right now, even in the end. The sci fi setting is perfect and they made mars and the atmosphere great. Arnie is Arnie and has a lot of charisma, Sharon Stone is not only beautiful, but impresses also as a unclear personality. Michael Ironside is a perfect bad guy. The action was fortunately no exaggerated like in some of the movies of Arnie, so I could immerse in the movie better. Also the special effects were great at that time and today you can still watch them. -> Arnie was not so successful because of his body or only because of Terminator. He had some more great movies and Total Recall is one of them."}, {"rating": "7", "text": "â"}, {"rating": "10", "text": "Una de las mejores peliculas de nuestro querido arnold el guion simplemente brutal ya que es muy original y tambien tiene puntos que te hacen reflexionar si en realidad es un sueño que le han puesto o no por que queria tener sueños de que habia estado en marte al principio del fin. Los efectos especiales en general están muy bien hechos para la época, los protagonistas están muy bien desarrollados y el villano tiene motivaciones muy buenas. No usa apenas clichés cosa que le da un toque totalmente propio y el final con la restauración de oxigeno de marte es simplemente cojonudo en resumen una película de ciencia ficción y acción recomendadisima"}, {"rating": "7", "text": "The original Total Recall is a fun sci-fi actioner that sees Schwartzenegger barreling around Mars kicking all sorts of ass. The movie has that classic over-the-top 80's violence to it (massive squibs & grotesque kills) that now feels both nostalgic and hilariously ridiculous. Stuffed with decent special effects and a memorable plot, Total Recall remains fun viewing."}, {"rating": "6", "text": "Total Recall is **** and total fun. Never count it as genius work, but under Paul Verhoeven's direction it never loses its DNA as sci-fi classic."}, {"rating": "6", "text": "his version of Total Recall depicts a universe that has been destroyed by chemical warfare, and has left only two pockets of civilization that are flourishing. The more powerful country, which is called The United Federation of Britain is an  evil government trying to dominate the other populated area, aptly called The Colony, which seems to be located in Australia but looks more like overpopulated sections of Manila or Shanghai with a heavily Asian population. The Federation with its sophisticated technology wants to dominate and enslave the downtrodden Asians. The two populations are connected by a 17-minute train ride that takes them through the core of the earth. Colin Farrell, as Douglas Quaid or agent Carl Hauser, has to be paranoid throughout most of the film, which he does very well. He also has to be confused, disbelieving, and besides questioning the conflicting stories everyone keeps telling him about who he really is, he even has to doubt his own version of reality. He can't trust his own wife, Lori (Kate Beckinsale), an agent who was sent to play his wife after his memory of being a super-agent was wiped out and replaced with the memory of a mediocre factory worker. Kate Beckinsale has only a few brief scenes where she is the sweet and supportive young wife, and then turns into the villainous super-agent whose combat skills match Farrell's. Her transformation from benign to malevolent happens in one minute, and she is extremely convincing for an actress who is mostly known for her beauty. Douglas Quaid's real love from the previous life that he can't remember is Melina, played by Jessica Biel. She looks like Beckinsale and has the same combat skills, but she is humanized and made more fragile by her love for Quaid. Biel also turns in a surprisingly interesting performance; it seems that director Wiseman brings out the best in his actors, even the ones he's not married to.  Bill Nighy's appearance is  welcome but bewilderingly brief. The chase films are breathless and suspenseful, but there are too many of them and not enough cerebral dialogue to contemplate the basic theme of reality versus illusion. The line, \"an illusion, no matter how convincing, is still just an illusion,\" taken from the original story by Philip K. Dick \"We Can Remember It for You Wholesale,\" points to this theme but never takes us there. The film is violent; bystanders and others are killed off thoughtlessly and needlessly, although the violence is part of the plot depicting a Nazi-like regime that wants to subdue and dominate what they perceive to be an inferior race. The invading chancellor, Cohaagen, played by Bryan Cranston, is a British Hitler, and his murderous armies are mostly robots, which preempts any ethical considerations of how you get tens of thousands of troops to do the bidding of one lunatic dictator. The theories about what motivated the sadistic violence of the real Nazis are still being debated"}, {"rating": "4", "text": "The acting was dreadful, the special effects were pathetic, and the action sequences were laughable. Not only that but the mutant stuff was a bit much. Mediocre film at best."}, {"rating": "8", "text": "The original is it a dream or not film, Total Recall is yet another science fiction classic from director Paul Verhoeven. He knows how to make objectively fun films that are essentially the cinematic equivalent of wrestling. Loud, dumb, and obviously scripted, but since both he and the audience are in on the gag, it is fun to watch. Pairing this with a ripped and confused Arnold Schwarzenegger and a story based upon a short story from Philip K. Dick, you just know this is about to be an excellent watch. In many ways, it feels akin to Dune due to the obsession with control here on a distant planet, though in Total Recall it is air. Starring Schwarzenegger as Douglas Quaid, the film shows him as a relatively normal man married to Lori (Sharon Stone). However, as he goes to a company called Rekall, that allows people to pay to have memories implanted in their mind, things go haywire for him. Choosing to go to Mars and to become a secret agent, the route the film takes is ultimately up to the viewer. One side can claim it was all a part of the dream, but one that he began to believe. The other can claim that it is all true. He came to before the memory was implanted and after they had discovered he had his mind wiped due to the secrets he held from his time as a Mars Intelligence Officer that could threaten Vilos Cohaagen's (Ronny Cox) control over the air on Mars.In many ways, Verhoeven reminds me of a more ambitious and unhinged version of David Cronenberg. Both are obsessed with constant depictions of sex and violence in their films, yet take different approaches to them. Verhoeven is more tongue-in-cheek, whereas Cronenberg is more serious. Yet, both share a similarity: inventiveness. From the gadgets in their films to the world they create, their films are always incredibly imaginative and demand further exploration. This is certainly part of the appeal of watching their films as around every corner is something you never imagined being in a film. This is an incredibly fun experience as a viewer as the weaponry, sets, and the world as a whole are so intricately designed that it makes it all seem real. Every detail is accounted for, even when the plot may become a little too odd to bear. This is a world that is always available to be explored and is a fun journey to be on throughout.Yet, what this film thrives on is paranoia. With Douglas constantly told his true identity is Carl Hauser and that this is all a dream, he has no idea how to respond and neither does the audience. It is hard to pin down what is and is not real as things seem to be too finely put together by Hauser to not be a setup and things go too closely to what he signed up for with Rekall. Yet, other moments show that it is definitely not a dream with people turning against him or remembering him. Of course, that may be the very point. Total Recall walks a fine line between both options, but what is clear is the tension and paranoia this balance creates. It is excellent for entertainment purposes and really keeps you on edge as you try to figure out, scene-by-scene, what is really happening or what could be an implant.An area of complaint for this film would definitely be the acting, which always a lot to be desired. Though, it may just be a trait of Paul Verhoeven films at this point. Inherently satirical in tone and style, the acting seems surreal with it simultaneously being unconvincing and overacted. This is a mainstay quality in many Verhoeven films with the actors seemingly in on the satirical tone of the film by playing their characters less than seriously. It is always jarring, especially with Arnold's constant one-liners littered throughout this film also contributing to this general feeling, but somehow thoroughly appealing to watch unfold at all times.In watching Paul Verhoeven's filmography one thing, aside from the violence and sex, becomes immediately clear. Many of his female protagonists are quite similar and what I would like to categorize as the \"Verhoeven Woman\". If Howard Hawks can have his own female cliche, I think Verhoeven definitely deserves some credit for his own cliche. With Lori (Sharon Stone) - Douglas' apparent wife - and Melina (Rachel Ticotin) - Douglas' apparent lover -  Total Recall introduces two Verhoeven women. Both women are overtly sexual and entirely objectified throughout. They ooze sex appeal and the film plays up this sexuality with both wearing greatly revealing clothing and constantly trying to engage Douglas in sex. Yet, this sexuality is always juxtaposed by Verhoeven with complete empowerment. Though these women may be agents forced to sleep with their marks or hookers who both suffer from the male gaze, they are completely capable and able to function on their own. Lori is a ball busting agent in Douglas' world and is more than capable of holding her own. She even skillfully takes down Douglas as any man with her training would be able to do."}, {"rating": "5", "text": "Ordinary fighter of the 90th years. The cast impresses, but this only thing light in this movie. Action boring and tightened, and the cyberpunk is not registered at all and looks comical. In this movie the cyberpunk - all this square and concrete. Except laughter in 2019 this movie does not cause. Expected much more."}, {"rating": "6", "text": "Schwarzynator tourne avec Verhoeven et le résultat est à tout le moins explosif : un film d'action mené tambour battant fait de courses-poursuites, de fusillades et de bastons... et d'explosions. Même les effets spéciaux très élaborés pour l'époque ont fort bien vieilli. Le film est indéniablement spectaculaire, solidement réalisé et bien entendu, Verhoeven oblige, d'une joyeuse violence : le Batave ne lésine en effet jamais sur l'hémoglobine et quelques effets gore... on en rit encore.Paul Verhoeven aime également nous montrer les mutants bizarres et/ou défigurés de Mars via des maquillages très beurks, caricaturant ainsi ce qui constitue d'une certaine manière le fonds de commerce de toute la science-fiction populaire... bref, il ne manque pas d'air ! Cependant, on ne retrouve pas l'ironie plus mordante de ses autres films ici : ce que l'on voit dans Total Recall ressemble plus à du fan service vite emballé et expédié dans la grosse production triple A hollywoodienne. L'adaptation de la nouvelle de Philip K. Dick a subi peu ou prou le même traitement et ne fait que survoler la question de l'identité et des faux-semblants dickiens : elle est devenue un prétexte à un gros -et divertissant certes- film d'action de gros bêta. Rien à voir avec le soin apporté à un Blade Runner...Notons la prestation remarquée d'une blonde sublimement épineuse qui va faire parler d'elle en tout cas : Sharon Stone ! Quant à Schwarzenegger, certainement \"efficace\" pour faire le ménage, la pauvreté de son jeu, ou son absence plutôt, est vraiment pénible à voir et à constater.En fait, si Total Recall est loin d'être mauvais, il n'est pas bon pour autant. Tout y est efficace mais trop superficiel : il y a décidément trop de pop-corn dans ce film."}, {"rating": "7", "text": "Total Recall (1990) is many action and a good story. The twist is good, but not crazy and the ending does suck a little."}, {"rating": "1", "text": "Paul Verhoeven made this movie in 1990 and it stars Arnold Schwarzenegger, Sharon Stone, Marshall Bell, Ronny Cox, Rachel Ticotin and Michael Ironside.... TOTAL RECALL is a sci-fi action thriller and it isn't very good. The main villain who is Cohaagen played by Ronny Cox is about as intimidating as a teletubby. Michael Ironside was okay but not brilliant and Sharon Stone was excellent giving what crap story she had to work with and she looked beautiful. All the mutants were ridiculous, hideous and brought no positivity to the film especially the woman with 3 boobs as that's laughable , disturbing, cheesey and stupid. The action scenes were not great and the only two positive things in the whole movie was Sharon Stone and the blood. The rest of the movie including more or less all the characters, the acting and the action scenes felt awful and so did the fact the mutants drink in a bar on Mars. So laughably unrealistic it's unreal and even Arnold Schwarzenegger wasn't that great so my opinion of Total Recall is I'm afraid weak. Terrible excuse for a film."}, {"rating": "8", "text": "This film is crazy and great. I really love watching it. The story is clever and interesting with some crazy practical special effects. It is violent and stylish. This has to be one of the best futuristic thrillers, it is exciting from beginning to end with lots of charm and well, go watch it now! There are moments reminiscent of The Matrix (1999) with the coloured pills and questions about what is reality. Also Arnold has a similar path to ‘The One’. It’s also very reminiscent of the Red Faction games because of the drilling, the rebellion and the awesome Mars cars! The only real downside is that the fighting is not very good, it’s badly shot and choreographed. A minor issue."}, {"rating": "7", "text": "The plot and concept are brilliant. I could almost say that this was a proto-Matrix. The political themes also seem a bit relevant in today's context, and may forshadow future issues in space colonization, and maybe colonization altogether. Action's nice. Sadly, some effects, once oscar winning, haven't held up over time. If today's FX were available back then, and the disturbing, bio-freaky parts kept to a minimum, this film would be damn near perfect, and it would get a nine. It's a miracle that T2, Arnold's peak, still looks awesome today, FX and all."}, {"rating": "3", "text": "It is clearly well directed and visually, it is still an impressive-looking movie but there is just so much that takes me out of it. There's a lot of filler in this movie tbh, They easily could have cut out 15-20 minutes and really help move things along. The cast also leaves a lot more to be desired as well. Clearly carried by Arnold, The rest of the cast just doesn't match what he is bringing to the table. The lack of a quality villain knocks it back for me as well.Oddly enough, I actually prefer the remake over this."}, {"rating": "6", "text": "They tried to make Philip K. Dick's short story longer and they had some good ideas, like the ambiguity, I like that we can't know for sure whether it was all real or a dream. (Personally I am pretty  sure, it's not real.) However a few things, like the mutants, were ridiculous. The special effects are horrible and I hated that they made the protagonist's girlfriend a whore. She could have been anybody, why a whore?"}, {"rating": "8", "text": "I do not know the original novel on which the film is based but it was to be expected that it is not entirely faithful. What is at least appreciated is that it is an entertaining escapism of about two hours. To see it, just relax and don't take anything seriously. What's the worst that can happen?"}, {"rating": "9", "text": "Total Recall is an incredible film, with special effects that 30 years later are still correct, a plot that will leave you crazy and, ultimately, a very funny film."}, {"rating": "9", "text": "This was, ummm, completely awesome? Put me down firmly in the all a dream camp. Some awesome and unexpected stuff from a mysteriously evil/smirking/winking Arnold."}, {"rating": "9", "text": "To take the setting to the Mars in contrast to Philip K. Dicks original story was a great decision. Its a great action sci-fi movie."}, {"rating": "10", "text": "Get your ass to Mars I remember watching this film in 1991 when I was 10 years old from a pirate tape I brought home from Cyprus. I loved every minute from the hooker with 3 **** till kauto asked Arnie to open his mind till see you at the party Rictor a classic the colin Farrell remake is a turd"}], "recommendations": ["the_league_of_extraordinary_gentlemen", "hellboy_ii_the_golden_army", "hellboy", "upgrade", "ant_man_and_the_wasp_quantumania", "robocop", "300_rise_of_an_empire", "reign_of_fire", "abraham_lincoln_vampire_hunter", "minority_report", "stargate", "constantine", "conan_the_barbarian", "wonder_woman", "thor", "doctor_strange", "the_invasion", "sicario_day_of_the_soldado", "the_fly", "the_matrix", "armageddon", "cold_pursuit", "mortal_engines", "twister", "thor_the_dark_world"]}