{"id": 4864, "title": "Touch of Evil", "starring": ["Charlton Heston", "Janet Leigh"], "runtime": 111, "genre": ["Crime", "Thriller", "Mystery"], "description": "When a car bomb explodes on the American side of the U.S./Mexico border, Mexican drug enforcement agent Miguel Vargas begins his investigation, along with American police captain Hank Quinlan. When Vargas begins to suspect that Quinlan and his shady partner, Menzies, are planting evidence to frame an innocent man, his investigations into their possible corruption quickly put himself and his new bride, Susie, in jeopardy.", "releaseYear": "1958", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/1pvRgmfBaoMczIJBOi9gCOZ4FMC.jpg", "categories": {"plot": 10.0, "acting": 10.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 5.0, "action": 10.0}, "reviews": [{"rating": "10", "text": "Interesting title considering the studio recut it in a fight with Welles that ended in them not wanting to submit it for awards and him never working for a studio again.  Also interesting is that Welles' character mirrored his life at that time.  I saw the 1998 version, reconstructed from Welles' notes.  It is fantastic, his 2nd best movie, just have to get past Charlton Heston as a Mexican."}, {"rating": "10", "text": "An essential from Orson Welles. Police thriller with the well-known ingredents that makes works clockwise: crooked policemen, femmes fatale, an overwhemed atmosphere and intrigue."}, {"rating": "10", "text": "The best, GREATEST thrilling gangster movie ever portrayed! With the best movie character ever portrayed: Orson Welles as Capt. Hank Quinlan! Plus the best movie quote ever spoken: \"He was some kind of a man. What does it matter what you say about people?\" And the best movie score ever composed!"}, {"rating": "6", "text": "Not my favourite Film Noir. Quinlan is so disgusting. And somehow I find this movie was so cheap, many scenes are in the studio with artificial light. There are some very mean scenes, but somehow I just wanted to see the end."}], "recommendations": ["the_godfather", "once_upon_a_time_in_america", "goodfellas", "chinatown", "the_godfather_part_ii", "rear_window", "gladiator", "raging_bull", "blade_runner", "django_unchained", "the_assassination_of_jesse_james_by_the_coward_robert_ford", "the_last_of_the_mohicans", "unforgiven", "braveheart", "casablanca", "north_by_northwest", "kingdom_of_heaven", "amores_perros", "the_lord_of_the_rings_the_return_of_the_king", "the_shawshank_redemption", "victor_frankenstein", "casino", "close_encounters_of_the_third_kind", "the_dark_knight", "million_dollar_baby"]}