{
  "id": 275,
  "title": "Toy Story 4",
  "starring": [
    "Tom Hanks",
    "Tim Allen"
  ],
  "runtime": 100,
  "genre": [
    "Family",
    "Adventure",
    "Animation",
    "Comedy",
    "Fantasy"
  ],
  "description": "Woody has always been confident about his place in the world and that his priority is taking care of his kid, whether that's Andy or Bonnie. But when Bonnie adds a reluctant new toy called \"Forky\" to her room, a road trip adventure alongside old and new friends will show Woody how big the world can be for a toy.",
  "releaseYear": "2019",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/w9kR8qbmQ01HwnvK4alvnQ2ca0L.jpg",
  "categories": {
    "plot": 8.136986301369863,
    "acting": 8.12962962962963,
    "ending": 8.045454545454545,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 8.857142857142858,
    "funny": 8.31578947368421,
    "action": 8.166666666666666
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Toy Story 4 is an immensely fun movie that caps off the series in a perfect way. The detail in the animation is incredible and it feels like a labor of love from Pixar in a way the other two sequels did not. A must see for even the most casual fans. I laughed, cried, smiled, and loved basically every minute of it despite expecting a so-so sequel."
    },
    {
      "rating": "10",
      "text": "The new chapter of the franchise also takes advantage of the chance to expand a character that, until then, was left out. While everyone is distressed or faced with deadlock, Bo Peep is the only one who has complete certainty of who she is and what her goals are. Therefore, it naturally assumes the role of guide of the group, guaranteeing great moments of action and girl power. This posture still creates a fun contrast with the Bunny and the Duckling, who could not be more lunatic. Toy Story 4 proves that, yes, there is still charisma and breath to spare for the franchise. Good. Deep down, no one was ready to say goodbye to these old friends."
    },
    {
      "rating": "8",
      "text": "When Bonnie makes a new toy that goes missing Woody sets out to bring him back. Toy Story 4 never quite hits the consistent heights of previous movies in the franchise but the animation is absolutely fantastic and it’s sure to entertain both children and adults alike."
    },
    {
      "rating": "8",
      "text": "Toy Story 4, though a good film is probably my least favourite of the franchise. Though there is a good message attached, the film's plot felt too familiar and not as heartfelt. Overall though the animation and voice acting is brilliant."
    },
    {
      "rating": "6",
      "text": "+Interesting story concept+Great voice cast+Some interesting set pieces-Felt decidedly 'below average' as a final outing for a pixar franchiseI'm unsure I know what I would want from a 4th Toy Story movie - watching this challenged my perceptions of woody and the gang in ways I didnt expect. Most of the side characters are 'back in the van' for most of this road trip movie so we are spending most of the time with the 'anxiety strickenmid life crisis woody', an 'uncharacteristically overpowered ninja skilled action ready bo peep' and new characters mentally unwell forky and sociopath gabby gabby... Perhaps i'm jaded from all the years of high quality cgi animated movies but I just wasn't as emotionally connected as I felt I was in previous outings, and so things moved along averagely which for a final toy story could be seen as disappointing? I was entertained but not enthralled as one would hope to be. Everything looks....eerily photo real at this level of quality CGI so thats a thing now! Part of me wished they had left the franchise alone and produced something new instead. Definitely worth a look for pixar fans though."
    },
    {
      "rating": "10",
      "text": "Ostia que fue muy divertido y emocionante. Animacion perfecta, otra conclusión muy conmovedora (el 3 sigue superior).Andén rápido a verlo"
    },
    {
      "rating": "9",
      "text": "It was satisfying to watch this 3rd sequel to one of Pixar's best; the story was great, the characters were great, but some of their stories seem a bit unfinished, the emotion is real, and the animation always gets better and better. The only thing that's keeping me from giving this movie a perfect score is said character stories, yet that seems kinda harsh. Still, watch this movie."
    },
    {
      "rating": "10",
      "text": "Heartfelt, warm, and thought-provoking, Toy Story 4 is a fantastic addition to the series."
    },
    {
      "rating": "9",
      "text": "This is the best Pixar animated film. Not just entertaining with extreme funny scenes but they were conscious with details. Characters were so adorable and given much depth with real purpose This is an impeccable work of art."
    },
    {
      "rating": "8",
      "text": "A movie that while good felt pointless. The end of Toy Story 3 really felt like the end of the series, but then Toy Story 4 is coming out 10 years later to continue the story. Also for money. It's definitely enjoyable and probably the funniest of the 4 movies, but they really don't use their characters that well. It bothered me that we didn't get much Buzz, potato head, Rex, etc. The entire movie felt like a long epilogue just to tell us about Woody. Still enjoyable even if I felt it was tacked on and pointless."
    },
    {
      "rating": "8",
      "text": "Less a full fledged sequel than an epilogue, to bring just a little bit more closure to Woody's arc. Like any epilogue, it's ultimately unnecessary. Does it need to exist? No. But is it ok that it does? Absolutely.The parallels to the first film are constant and intentional. Woody must deal with the new toy on the block. Woody loses said new toy and must go on a quest to retrieve it to keep his owner happy, to do the right thing because his moral compass never pointed nowhere but true. He meets scary toys that aren't scary so much as misunderstood. All is well. Except Woody.The circle of life comes full circle. This isn't 4, this is 1 all over again. But how many times can you repeat the same story, the same mistakes, the same resolutions? Woody takes a different exit this time. He loses his voice in life but gains perspective. And by doing so sets himself free, free to help all others, not just those close to him, to infinity and beyond."
    },
    {
      "rating": "8",
      "text": "Toy Story 4 is an outstanding film that succeeds in keeping the Toy Story Franchise one of the best franchises. Here are the few negatives. The character of Forky, as great as he is, is a plot device. He really is only there to move the story forward which kinda sucks. My other issue is that the film does borrow heavily on themes and plot points from the original 3 films. Here are the positives. This film can be very emotional at times. The film starts emotional and doesn’t stop being emotional until the credits roll. The last scene of the film is probably one of the most emotional Pixar moments. The voice acting is very good. Tom Hanks, Tim Allen, and Annie Potts are standouts from the main cast. Each delivers their lines with so much emotion and personality that you can’t help but care about them and their struggles. The returning characters don’t have a lot of screen time but they all do an outstanding job. The new characters are really good also. Keanu Reeves, Jordan Peele, and Keegan-Michael Key’s characters steal the show. Each of their characters are incredibly entertaining and hilarious to watch on the big screen. This leads me to my next point. For a Pixar film, Toy Story 4 is pretty funny. There are a handful of jokes that don’t land well but most of them got a chuckle out of me and one or two got full on laughs from me. The animation for this film is outstanding. It’s incredible to see how far animation has come from the original Toy Story in 1995. There is one shot that showcases the passage of time and it’s incredible. The story is heartwarming and nice even if it does bounce back on ideas from the previous films. The score for this film is pretty good also. It’s not extraordinary but it’s good. The tone for the film remains consistent all the way through and it’s also paced really well. I would highly recommend seeing this in theaters. Overall, Toy Story 4 is another great addition to the Toy Story franchise with outstanding animation, great voice acting, and tons of emotion. I give Toy Story 4 a 9/10."
    },
    {
      "rating": "8",
      "text": "Overall hilarious movie for the family with Keanu Reeves mostly stealing the show"
    },
    {
      "rating": "8",
      "text": "Sin duda una de las mejores películas de pixar, una entrega que nadie pidio pero era muy necesaria para cerrar con broche de oro la saga"
    },
    {
      "rating": "8",
      "text": "If you saw the first 3, you have got to see this one.  Has that true to form Toy Story feel, and as anticipated this will get you in the feels."
    },
    {
      "rating": "9",
      "text": "A real heartwarming film. This movie had a lot to live up. An amazing trilogy that helped define my childhood for sure. I was happy with this film. I definitely did not expect to enjoy this as much as I did, but I walked away loving the CGI, the characters, the voice acting, and an ending that made me almost cry. Almost. Tony Hale steals the show as Forky. A hilarious new addition to the ole' gang. Tom Hanks and Tim Allen are still extremely enjoyable as they fell right back into their role like a pair of broken in shoes."
    },
    {
      "rating": "10",
      "text": "WHen this movie was announced I was very skeptical. But after watching it I was pleased with the quality from Pixar and they really told a story that needed to be told."
    },
    {
      "rating": "10",
      "text": "Honestly, its all about fun and ruining yet another of your disney-sequel-allergy scepticism. This movie succeeds in both tasks. Sadly its the only one that does that in 2019"
    },
    {
      "rating": "9",
      "text": "Toy Story 4 is a truly great movie for all ages. Watch it with your kids, or alone, it does not matter, you will still love seeing Buzz and Woody on the screen together for the last time."
    },
    {
      "rating": "9",
      "text": "As usual Pixar at it best with some touching and some funny moments. I didnt like the feminist elements."
    },
    {
      "rating": "7",
      "text": "Wonderfully inventive for a fourth installment it's not the landmark the original was or as great as the third, but worth the effort (in terms of both the story craft and incredible artistic detail of the animation by the makers, and going out to see it)."
    },
    {
      "rating": "8",
      "text": "A truly bittersweet end for a beloved franchise that's known for its story."
    },
    {
      "rating": "9",
      "text": "While its nowhere near as perfect as Toy Story 1-3 I still enjoyed the hell out of this film. Always been a fan of Toy Story and I'm here if they're willing to make it to Toy Story 40."
    },
    {
      "rating": "9",
      "text": "\"We Belong Together\", the end title piece sung by Randy Newman as the credits rolled following the third installment made it seem that all would be fine for Woody and the gang after they landed safely in the care of Bonnie. However, Toy Story 4 goes against this happy picture we last witnessed, and instead focuses once again on the idea of getting older, growing farther away what we used to know as children, and coming to terms with this new reality. New Pixar creative Josh Cooley leads the cast and script through another timeless entry in the series, filled with colorful set-pieces (as expected) and plenty of emotional moments to make this return to the franchise feel worthwhile, and, surprisingly, necessary. These toys have changed since last seen, especially that of Woody. The amount of focus on the development and growth of Woody is great and surprising, even for a Pixar outing. His story is what drives the plot forward, and makes for a fantastic finale, one that rivals the brilliance of 3's emotional sendoff. However, as mentioned earlier - \"We Belong Together\" - the catchy, Newman helmed song, and the idea behind it, is tested in Toy Story 4. A test that makes for a must watch story, accompanied by a wonderful cast (as always), stellar visuals, and the true emotional moments that Pixar is known for."
    },
    {
      "rating": "8",
      "text": "Still solid after all these years with some flaws alomg the way. Woody Buzz and Bo Peep all seem a little off in this one compared to their characters in the past but still this version was a lot of fun for someone who has grown up with these toys"
    },
    {
      "rating": "9",
      "text": "This is by far the most beautiful Pixar film made yet. The story isn't as strong as Toy Story 2 or 3, and ultimately this probably will end up ranked fourth in the series for me, but it's infinitely re-watchable just like the others."
    },
    {
      "rating": "8",
      "text": "\"I'm not the one who is lost.\".( 81/100 ).Toy Story nació en 1995 y ha crecido junto a su audiencia. Cada una de sus aventuras reitera la formula, esencia y estilo de la saga más identificable del cine. 24 años y una trilogía después, Woody y Buzz Lightyear regresan con una aventura más en la que los juguetes aprenderán nuevas y valiosas lecciones con la que podrán cerrar ciclos y abrir caminos.Bonnie está nerviosa por entrar a la escuela, así que Woody decide apoyarla. En su esfuerzo, Bonnie crea un juguete con materiales desechables que la calma y estimula espiritualmente, pero Forky, el nuevo juguete, tiene una concepción de si mismo que disparará esta nueva aventura.Toy Story 4 tiene un par de problemas para organizar sus moralejas, que son varias y muy valiosas, y pasa gracias a la formula de la saga: abrir con una propuesta \"original\", los personajes se adaptan, pero para ello se hace una burbuja de acción \"inteligente\" en medio del trama que enganche al publico con tensión y abra paso al propósito de la propuesta inicial. Esta técnica le da un ritmo mecánico al film y, aunque no aburre, tampoco logra homogeneizar sus elementos sensibles y de acción. Sin embargo, los momentos sensibles están llenos de conciencia, auto-crítica, valores, percepciones y argumentos que aterrizan al público en el terreno, me atrevería a decir, más humano de la saga, pues destruye la idiosincrasia de los personajes y elimina la presencia del \"enemigo\" a través de un discurso hermoso sobre la consideración, la utilidad y la oportunidad de aprovechar y otorgar segundas oportunidades. Toy Story 4 ya no nos trata como niños, y como adultos tenemos que entender que en la vida no hay enemigos, solo concepciones diferentes que merecen la misma atención y respeto. Quiero remarcar una animación y fotografía con mucha textura que embellece cada locación. La música también contribuye y, en general, las bellezas y el suspenso son de alta calidad que, aunque sean engranes diferentes, fluyen sin problemas.-Toy Story was born in 1995 and has been growing up along with its public. Each one of their adventures reaffirms the formula, essence, and style of the most recognizable saga of cinema. 24 years and a trilogy after, Woody and Buzz Lightyear comes back with one more adventure in which the toys will learn new and valuable lessons with which will be able to close cycles and open roads.Bonnie is nervous about getting into school, so Woody decides to help her. In his effort, Bonnie creates a new toy with disposable materials that calms her and stimulates her spiritually, but Forky, the new toy, has a conception about himself that will trigger this new adventure.Toy Story 4 has some trouble to organize its morals, which are several and very valuable, and that’s thanks to the formula of the saga: open with an \"original\" proposal, the characters have to adapt to it and, therefore, a bubble of \"clever\" action is made in the plot to engage the public with tension and open a way to the porpoise of the initial proposal. This technique gives the film a mechanical rhythm and, if maybe it doesn't bore, neither achieve to homogenize its sensible and action elements. Nevertheless, the sensible moments are full consciousness, self-critique, values, perceptions, and arguments that hold the public to, what I would dare to say, the most humane moment of the saga. This is because it destroys the idiosyncrasy of the characters and eliminates the presence of an \"enemy\" through a beautiful speech about consideration, utility and the opportunity of taking and giving second chances. Toy Story 4 doesn't treat us as kids anymore, and as grown-ups, we must understand that there are no enemies, just different conceptions that deserve the same attention and respect. I just want to stand out the animation and photography with a lot of texture that embellishes each location. The music also contributes and, in general, the beauties and thrills are so high quality that, even though they are different gears, they flow smoothly."
    },
    {
      "rating": "9",
      "text": "For me Toy Story 3 had the better story and characters but Toy Story 4 had the biggest emotional moments and was also entertaining to watch.I've waited for so many years for Toy Story 4 and i can say that it was worth the wait.Very good movie"
    },
    {
      "rating": "8",
      "text": "Si bien creo que es inferior a la tercera película, la franquicia sigue manteniéndose en pie, gracias a una historia madura (de lo que se caracterizo siempre la saga) y una fuerte relación entre personajes. Sin embargo, la personalidad de los mismos es bastante confusa, ya que cambio bastante, en especial Buzz y Bo Beep. Buzz actúa como un idiota toda la pelicula y Bo Beep parece simplemente otro personaje. Aparte de la personalidad confusa y una mala edad recomendada para la película, es casi una obra maestra. Ese toque de película madura me encanta, como en la parte donde Woody y Forky hablan o la relación entre Woody y Bo Beep (a pesar de formar parte también de lo negativo). Siento que debieron de haber puesto a Lotso o a Pete de vuelta. Podrían haberlos puesto en un buen contexto, ya que ellos tenían en parte razón después de todo. Por esos motivos creo que es inferior a la tercera, pero no importa. Totalmente recomendada! 8,5/10"
    },
    {
      "rating": "9",
      "text": "Um filme necessário, tanto para crianças quanto para adultos!Toy Story, como sempre, aborda dilemas importantíssimos e presentes na nossa vida. Seja na infância, quanto na vida adulta.Como, por exemplo, a importância emocional - muitas vezes simbólica - que um \"simples\" boneco pode ter com uma criança quando ela passa por momentos dificeis, como ser excluída por seus colegas de turma - consciente ou inconscientemente -, ou até mesmo pela família, quando a vida adulta parece mais importante. Talvez um Cowboy seja sua única companhia. O filme também leva em consideração - mesmo de forma mínima e não direcionada - quão cruel as crianças podem ser uma com as outras, seja por falta de educação, ou mesmo porque não entendem as coisas.Quanto aos pontos objetivos, a animação nunca esteve melhor. É utilizada uma lente macro que da a impressão que tudo é muito pequeno - como deveria ser -. A paleta de cores é bem viva e presente, que em conjunto com os reflexos e blur, causam uma fotografia linda e deliciosa de se assistir. A OST se mostra presente nos momentos necessários, nada muito a comentar.Enfim, esse filme é um presente para os fans de longa data - como eu - e tambem as crianças que estão começando a acompanhar agora. Super Entretido!"
    },
    {
      "rating": "8",
      "text": "O filme tem uma ótima animação,uma trilha sonora boa,e uma história legal,só que não é o melhor filme,o filme traz um gostinho de infância para quem cresceu assistindo aos outros filmes,o final do filme traz uma das cenas mais tristes da franquia,mais faltou um pouco mais de emoção.foi muito legal ver a personagem da Betty de volta,uma personagem pouco aproveitada nos outros filmes,a vilã Gaby Gaby,e umas das melhores dos filmes da Pixar,ela e doce, mais sombria,por fim o filme e um ótimo filme de férias, para levar as crianças para conhecer o universo de toy story,e também para os mais velhos ver mais uma vez os melhores brinquedos do cinema."
    },
    {
      "rating": "9",
      "text": "I love this movie!!! Toy story just keeps getting better and better!! Keep this franchise going....I always laugh with this franchise."
    },
    {
      "rating": "8",
      "text": "If you thought Toy Story 3 was about moving on and letting go, wait ‘til you see this one. Thank you to the toys that grew up with the late 90s babies. Farewell.Shout out to Pixar for knowing how to craft three-dimensional antagonists that aren’t just evil for evil’s sake."
    },
    {
      "rating": "9",
      "text": "This should not have worked, but it did. While still being probably the weakest of the Toy Story movies,it still manages to be emotional and entertaining."
    },
    {
      "rating": "9",
      "text": "Full of heart, charm and hilarity. Toy Story 4 is a must see. Make sure you stay for the end credit scenes. Kaboom. A"
    },
    {
      "rating": "8",
      "text": "Toy story 4 aunque sea una película innecesaria también es un digno final para estos juguetes"
    },
    {
      "rating": "9",
      "text": "When I first heard they were making a Toy Story 4, I didn’t think it was necessary at all. Toy Story 3 ended the story perfectly, what more could be done with it? Not to mention that it’s a Pixar sequel made in the 2010s, which don’t exactly have a great reputation. Toy Story 3 was great, Cars 2 was bad, Monsters University was okay, Finding Dory was good but forgettable (no pun intended), Cars 3 was okay and Incredibles 2 was a lot of fun but not as memorable as the first movie. It didn’t help that none of the Toy Story 4 trailers impressed me. I walked into this movie cautiously optimistic. I hoped it would be at least as good as Incredibles 2 but I was ready for the possibility of a disappointment. However, after seeing the movie, I can confidently say that they did it again. They made another great Toy Story movie. It has an engaging and emotional story, a lovable and memorable cast of characters, interesting themes and ideas, the most beautiful animation that Pixar has put to screen yet, pitch-perfect voice acting, and really great action and comedy! While Toy Story 3 was the perfect ending, I think Toy Story 4 is a great epilogue. This is probably where the story would go next, whether you like it or not. I do have some criticisms though. Some of the writing and comedic timing felt surprisingly clunky and off a couple of times and the ending does feel a little rushed. The ending of Toy Story 3 was definitely a better finale to the series as a whole, it was more epic and larger in scale, but this is more of a finale to the arcs of the main characters. I can’t think of a more fitting way to end both this story and the 2010s decade of Pixar movies. It came in with a Toy Story movie and it went out with a Toy Story movie, and it looks like this is the last Pixar sequel we’re going to see for a long time. It’s been confirmed that there are no sequels coming out for the foreseeable future and they will be putting their focus on original films only. That sounds good to me! Overall, this is a must-see for any fan of the Toy Story movies. It just might be another instant classic. Highly recommended."
    },
    {
      "rating": "9",
      "text": "Every inch the worthy successor to a stunning trilogy, it reshapes the overarching narrative of the series with heart, humour and a delicately joyful finesse."
    },
    {
      "rating": "9",
      "text": "i saw the trailer for this movie, and honestly after the train wreck that was incredibles 2, i thought this movie was heading down the same path. However toy story 4 not only exceeded my expectations, but it was also better than the previous movie! The Animation is simply outstanding, the opening 10 minutes are beautiful. The storyline is both fun, emotional and even creepy? I was most surprised by ducky and bunny, the 2 new characters that were shown off through out the trailer, i thought these characters were going to be your generic pop-culture comedians, but instead they were the stand outs of the film. Their comedy and timings were hilarious at times, and outside of woody and buzz, were my favourite characters. Forky was also less annoying than id assumed going into the movie, i like his mindset of believing he is trash (maybe a reference to how all those kids who grew up with the first 3 films feel about themselves now) and the scenes of him trying to escape actually made me laugh. Most of the returning cast dont get much of a time to shine, but the new characters and the fantastic story line more than make up for it. 9/10 - the best one since Toy story 2."
    },
    {
      "rating": "8",
      "text": "Toy Story 4 is a heartfelt experience that will leave you emotionally invested in all its story by the end of the film. The film is beautifully animated to the point where specific shots look real. The animation is simply stunning making the film a joy to look at. The film's themes of farther-hood and letting go of the past make the film more relevant and heartfelt as intriguing you watch it. Characters such as Woody and Bo Peep have never been better and new characters like Duke Kaboom and Forky are some of the best side characters the series have ever had. My only flaw with the film is that a vast array of characters really have any time in the spotlight and are pushed aside to make way for other characters and plotlines. Overall the film is an entertaining and heartfelt experience that deserves applause."
    },
    {
      "rating": "6",
      "text": "Toy Story 4 comes across as a really unnecessary sequel. While greatly animated no doubt, there are moments where this film looks absolutely stunning. But in terms of the narrative Toy Story 4 just isn't all that interesting. Woody has an interesting character arc, but I don't buy that Bo Peep is the one to show him this arc, or that he would come to it for the reasons he does in the movie with his new owner. Forky feels like he's there mostly for comedic purposes than anything else. Which is fine, but he plays too much a big part in the story for him not to feel more impactful. Buzz Lightyear is completely wasted in this movie, the jokes with him seem like something he'd go through in a much earlier film, or heck in the first film. The veterans of the series are completely pointless, I don't see why they didn't make Bo Peep the main character and maybe leave the characters from Toy Story 3  where they were at the end of that film. It's perfectly fine movie for kids overall, but I think the older audiences who grew up with the previous films much leave wanting a bit more."
    },
    {
      "rating": "8",
      "text": "All right, I do it in public so I might as well admit to all: most people who know me know I cry in movies and I have never been ashamed of it but to cry in an animated film??? Come on!! Okay I did and I do. I remember years ago crying when Bambi's mother died but until cartoon movies became way more, in technical ways, I didn't during Snow White, Pinocchio or even Fantasia!I saw \"Toy Story 1\" but aside from remembering some of the characters I remember little of the story. I skipped 2 & 3 but not having anything else to see today I decided to see the, supposedly, latest and last story. It is a story about how one feels not being wanted or loved anymore and how to handle the feelings and life changes.In this film we find an old friend Woody, a sheriff, has lost his first owner, Andy, who pushed him aside when Andy went off to college. Woody found consolation with Bonnie who inherited him but now she is off to kindergarten and has made her own toy, Forky, made from trash items like pipe cleaners, a plastic spoon, doll's eyes and considers himself trash but Bonnie loves him. Very shortly after bringing him home she loses him and Woody feels it is his duty to return Forky, now Bonnie's friend who in turn deserts him while at the same time convince Forky he is not just trash.The chase involves some old, and many new characters, in the Toy Story series but bogs down in the chase sequences while at the same time offering a few laughs such as a skunk sort of being a Trojan horse or at least camouflage! The main tug at the emotional strings are the reunion of Bo Peep and Woody with the former having accepted the fact that she no longer serves a purpose just moving here and there.Not having seen the middle stories I am not sure who is new here but Tom Hanks, as always, is very effective and, yes, believable as Woody. Tony Hale, new as Forky, is funny while Tim Allen as Buzz Lightyear gives solid backup to his friends while Annie Potts returns as Bo Peep as a very strong woman and Christina Hendricks as sort of a villainous Gabby Gabby who wants Woody's voice box. One of the newest characters, and definitely the funniest, is Keanu Reeves as Duke Caboom, a Canadian stunt motorcyclist, full of himself and daring to do anything.\"Toy Story 4\" is a film for both children of all ages and adults will, in many cases, enjoy it more! After seeing about a dozen of the 'new' ways films are animated I am still intrigued at how the characters seem alive and, in many cases, you believe in them."
    },
    {
      "rating": "9",
      "text": "Divertido, nostalgico e com um cheirinho de infancia no ar, toy story 4 e tudo que eu queria, fiquei com medo quando anunciaram esse 4, pq o 3 termina de uma forma tao perfeita que pra mim não deveria ter mas nenhum, mas ainda bem que teve esse quarto filme, que e bem emocionante, apesar de nao ter me feito chorar, pra mim o filme so nao e perfeito pq eu nao achei as piadas tao engraçadas assim, mas vale muito a pena assistir, pra mim o primeiro e o melhor, mas nao tem nenhum toy story ruim"
    },
    {
      "rating": "9",
      "text": "Ta chido ta chido,estaria perfecto,si el andy antiguo estaria igual,pero el cambio fue fuerte para mi,pero todo lo demas esta bien."
    },
    {
      "rating": "8",
      "text": "One of the more aggravating and confounding releases of the year, based solely on the fact that it's both a genuinely good movie in its own right and one that I don't necessarily think any of us needed. I definitely won't be alone in saying how perfectly I felt the franchise's third installment seemingly concluded things for Woody, Andy, and the gang, with any mutterings of a potential fourth iteration being met with unadulterated skepticism and even derision on my part. But to be absolutely fair, this movie is terrific for the most part, with a lot of the emotionality really hitting home with me, and the animation pushing the needle even further into the realm of photorealism. This in mind, though,  could I live with the hypothetical threat of someone \"Eternal Sunshine-ing\" this movie from the annals of my memory? Yeah, I'd be okay with it, I suppose. Can I say that for any of the other three installments? Personally, no. That's an issue for me, but to be sure, I understand the overwhelming praise. I just hope \"Toy Story 4's\" success doesn't act as a precedent that studios will use to justify other future exhumations of presumably dead franchises."
    },
    {
      "rating": "8",
      "text": "While I was initially very much against a fourth 'Toy Story' movie being made, as the third capped off everything so perfectly, (along with the fact that I find myself disappointed more often than not with Pixar sequels), I've gotta say that I'm now eating those words, as I found this to be the best sequel out of all of them (nothing's ever gonna top the first for me, but hey, that's childhood for ya!) Everything about this was so satisfying and fun.The voice acting is great from O.G. characters (Tom Hanks and Tim Allen are always perfect as Woody and Buzz respectively), as well as new additions (Keegan-Michael Keye and Jordan Peele voice a couple of stuffed Carnival prize toys, and Keanu Reeves is a riot as a Canadian stuntman toy.) The animation is so unbelievably detailed down to every last frame, image, and character, unsurprisingly making the first film from nearly 25 years ago look quite outdated by comparison. Even the story I was impressed by, as I was convinced that Pixar really had nothing else to explore with these characters, but they managed to take them in some unexpected directions, some nostalgic, and some new and surprising, even ones that tug at the emotions quite a bit, especially towards the end (as has come to be expected from the best of Pixar.) So needless to say, there's something here for all ages to enjoy. Overall, it's a sequel I still feel wasn't completely needed, but in spite of my initial skepticism, it's one I'm very glad we got nonetheless, as it gives us yet another fun time with these toys and characters so many of us have grown up watching for so long now, and they're given yet another satisfying story and ending, one that Pixar would be wise to leave be, for real this time."
    },
    {
      "rating": "8",
      "text": "Although the Toy Story films are full of adventure and comedy, the series always includes a focus on serious, emotional moments. This one includes more drama with a continuous message about the importance of friendship and loyalty. The usual gang is back, although most of the funny supporting characters get scant attention. This one revolves around Woody, Bo and a new toy (a spork voiced by Tony Hale) as they go on an adventure to comfort their new kid/owner. The animation is gorgeous, as expected, and there are some new characters that add some fun. Overall, it's lively, well-paced and enjoyable. Not as unique or special as the first 3, but still higher entertainment value than many animated family films."
    },
    {
      "rating": "9",
      "text": "What can I say? Toy Story 4 is a great movie, but in comparison to its last two installments, it's 'just' a solid 9. Great animation, perfect casting, great all around from the team from Pixar. Yet it's biggest disadvatage: coming of what many consider as a 'perfect trilogy'. This film is an epilogue at best to that storyline, yet after the epic that were Toy Story 2 & 3, it just can't hold a candle to those masterpieces. Is it still one of Pixar's best? Absolutely. Should Disney be inclined to make another sequel? No. As many of the character arcs have reached a satisfying conclusion, and shouldn't be commercialized even further. It's time for Woody and Co. to ride of to the sunset."
    },
    {
      "rating": "7",
      "text": "Good movie, though the 3rd Toy Story is better IMO. It's not bad at all mind you. Duke Caboom is seriously great, the ending and the road leading there is great as well, you just have to wonder if this movie needed to be made. We had the perfect ending in 3, it feels like they're just milking the fanchise for all it's worth. Not that they have no right to do that or even that they're doing a bad job. It's pretty great, just not better than what we already had."
    },
    {
      "rating": "8",
      "text": "Good. The 3rd one I think is better but this is not bad at all, it just doesn't reach that level. It has good emotional moments and several ones of \"knot in the throat\" in which you'll cry. I like the development of the villain (Gaby Gaby), her arc and how she evolves. The initial scene with the rain and how they tell us what happened with Bo Peep 9 years ago is GREAT. The new characters Forky, Ducky and Bunny, Duke Caboom and Giggle McDimples are great. The road that Woody has to travel and how he has to get rid of his past with Andy is very well done. The ending with Woody and Buzz Lightyear is one of the best things I've seen. 3D animation is the biggest thing that Pixar has done, there are times that even it looks real."
    }
  ],
  "recommendations": [
    "toy_story_3",
    "finding_dory",
    "onward",
    "how_to_train_your_dragon_2",
    "rio_2",
    "kung_fu_panda_3",
    "my_little_pony_the_movie",
    "the_secret_life_of_pets_2",
    "big_hero_6",
    "toy_story_2",
    "bumblebee",
    "dumbo",
    "fantastic_beasts_and_where_to_find_them",
    "the_lego_movie_2_the_second_part",
    "incredibles_2",
    "the_nutcracker_and_the_four_realms",
    "the_incredibles",
    "raya_and_the_last_dragon",
    "maleficent_mistress_of_evil",
    "frozen_ii",
    "the_karate_kid_part_ii",
    "meet_the_robinsons",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "hotel_transylvania_3_summer_vacation",
    "super_8"
  ]
}