{
  "id": 337,
  "title": "Toy Story 2",
  "starring": [
    "Tom Hanks",
    "Tim Allen"
  ],
  "runtime": 92,
  "genre": [
    "Animation",
    "Comedy",
    "Family"
  ],
  "description": "Andy heads off to Cowboy Camp, leaving his toys to their own devices. Things shift into high gear when an obsessive toy collector named Al McWhiggen, owner of Al's Toy Barn kidnaps Woody. Andy's toys mount a daring rescue mission, Buzz Lightyear meets his match and Woody has to decide where he and his heart truly belong.",
  "releaseYear": "1999",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2MFIhZAW0CVlEQrFyqwa4U6zqJP.jpg",
  "categories": {
    "plot": 8.8,
    "acting": 8.838709677419354,
    "ending": 9.0,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 8.8,
    "funny": 9.357142857142858,
    "action": 9.333333333333334
  },
  "reviews": [
    {
      "rating": "10",
      "text": "While the first one showed that animated movies can be made completely with cg animation, this one proved that animated sequels can indeed be just as good as their predecessors (Shrek 2 and Toy Story 3 would prove this years later)."
    },
    {
      "rating": "10",
      "text": "Just as good as the first story with a new batch of great characters. Moments for both the adults and the children. It is both timeless and universal just like its predecessor and is one of the few sequels that keeps the legacy of the whole franchise."
    },
    {
      "rating": "10",
      "text": "Toy Story 2 is visually dazzling, heartfelt and just hilarious with amazing voice acting and memorable characters this is a very successful sequel. I give this film 95% of a good movie."
    },
    {
      "rating": "10",
      "text": "While not as good as the original, Toy Story 2 is still one of the best animated movies ever made, in my opinion. It does everything almost as good as the orignal"
    },
    {
      "rating": "10",
      "text": "The second masterpiece from Pixar. While arguably not as good as it's predecessor, it contains many funny jokes, a loving plot and a well written and perfectly performed script. It doesn't age (which is nice) and is still one of the best animated films I have ever seen. Not quite as good as Toy Story 2, but is Pixar's 5th best film."
    },
    {
      "rating": "9",
      "text": "Toy Story 2 is a delight. No matter how old you are, it'll charm you completely. It's an accomplished piece of filmmaking and is virtually flawless. A fantastic achievement."
    },
    {
      "rating": "10",
      "text": "Honestly, this is almost as good as animation gets. Fantastic for the kids, fantastic for the adults. I really cannot fault this movie. Wheezy is adorable."
    },
    {
      "rating": "10",
      "text": "I love the sequel, I love 1, 2 and 3. I love everything from these movies.\r I love how they introduce the new characters and I love the movie\r In some places, there moments which were funny and exciting.\r Brilliant just brilliant."
    },
    {
      "rating": "10",
      "text": "I think Toy Story 2 is better than the original. It is more adventurous than the first one because there is a lot more going on and there are more fun characters."
    },
    {
      "rating": "10",
      "text": "Sequels that attempt to top or even be as good as a brilliant original are hard to come by, but Toy Story 2 manages not only to be as good if not better than the original, but also manages to again find a place in everyones heart on an emotional level that will live on.\rAs owner Andy prepares to go to cowboy camp with Woody, the beloved toy's arm is ripped and must sit out the trip, and he soon is put on the shelf where all the disused toys go, and fears that his days are numbered as a played with toy.\rAfter a yard sale goes disastrously wrong, Woody is captured by a greedy toy collector, who Woody finds out wants to sell him as he is a part of a collection of famous dolls who were on a TV show years before.\rMeanwhile, Buzz and the rest of the gang are on a mission to save Woody and bring him back to his owner before the toy collector, Al, sells him.\rAll our original cast return including Tim Allen as Buzz and Tom Hanks as Woody, with the introduction of new characters including Bullseye the horse, Jesse the cowgirl (Joan Cusack) and Stinky Pete (Kelsey Grammar).\rThe second instalment in the blockbuster animated series continues to deal with real life issues, this time how growing up can affect everyone of all ages, and the film brings back many realisations that we must make difficult decisions as we grow older.\rThe additions of new characters are a welcome expansion to the universe, and offer very funny situations that also mock different films while also delivering a clean and thoroughly enjoyable experience that will again never leave your side..much like the original.\rVisually, the film continues to outshine the original, coming out four years after its predecessor, and it certainly brings a beautiful and more pristine experience and new level of enjoyment to the film.\rPixar continue to surprise and amaze, and with Toy Story 2 this is no different. it truly begs the question of how simple situations can make for the hardest decisions, but which ultimately come down to yourself.\rWith another Randy Newman scored film, its a simply unmissable film that will leave you wanting more and more, and of course one which will perhaps bring a tear to your eye.\rYou should certainly have a friend in Toy Story 2."
    },
    {
      "rating": "10",
      "text": "Toy Story is a true classic, in every sense of the word. So Toy Story 2 had a lot to live up to, to try and even meet the standard of the first film let along exceed it. Luckily Toy Story 2 meets the standard perfectly, however does not exceed the awesomeness of the first film, but instead compliments it.\rSo a few years have passed since the events of the original Toy Story and Andy has now reached his early teens, slowly growing out his toys. When clearing out his room Woody is accidentally thrown out and picked up by a toy collector to be framed for the rest of his life. Buzz and the rest of the gang from the first film go after Woody to rescue him and get him back to Andy before he returns from summer camp. However as Woody starts to learn that it wont be long until Andy no longer needs him and he starts to form new relationships with the collectors current set of toys he becomes reluctant to leave and go back to Andy.\rToy Story 2 takes all of the stuff that made Toy Story awesome and exaggerates it to make a much 'bigger' film without making the first one feel 'small' in comparison. It does nothing new but it delivers a concept we can all relate to and can learn from whilst providing us with an entertaining cast, well animated and generally awesome film."
    },
    {
      "rating": "10",
      "text": "Toy story 2 is an amazing film, with it being better than the first. New and interesting characters, with a good plot. Pixar really showed us what they are made of."
    },
    {
      "rating": "9",
      "text": "Best Toy Story out of the 3. The characters return like Buzz, Woody, and new characters. Like maybe Zurg, Jessie, etc. Tom Hanks is a great actour. He did a great job acting Woody. The storyline and plot were awesome. Woody gets stolen by this fat guy who goes to Tokyo, Japan. (Lived in Tokyo for 2yrs.) At least Woody got repaired. I give this a 9/10 because of the crappy Barbie. She sucks! Well, in her own series. That's for sure. Great movie overall, and if you liked the first one, I totally recommend watching this."
    },
    {
      "rating": "9",
      "text": "In the realm of sequels, “Toy Story 2” is to “Toy Story” what “The Empire Strikes Back” was to its predecessor, a richer, more satisfying film in every respect. The comparison between these two franchises will be pursued no further, given their utter dissimilarity. But John Lasseter and his team, their confidence clearly bolstered by the massive success of their 1995 blockbuster, have conspired to vigorously push the new entry further with fresh characters, broadened scope, boisterous humor and, most of all, a gratifying emotional and thematic depth. Disney and Pixar have an end-of-millennium behemoth here, one that, given its far greater appeal to girls by virtue of its female co-lead, could easily surpass the $362 million grossed by “Toy Story” worldwide.\r The only thing this sparkling picture lacks, by definition, is the shock of the new; four years ago, it was startling to behold the frontier that computer animation had conquered, to see what vast possibilities were now available in the whole field of animation. But there is no sense of complacency or sameness, as the filmmakers get their charges out of the house and into a situation that gives their lives more poignancy and awareness of mortality than, frankly, most characters in live-action films are accorded these days.\r After an overly assaultive outer-space teaser that will nonetheless serve its purpose of getting kids to shut up and pay attention, brisk set-up sees the affable Woody eagerly anticipating being taken to a summer Cowboy Camp by his owner, Andy. But excitement quickly turns to crushing disappointment when a “broken” arm causes Woody to be left behind, with Andy’s mom adding the final sting with the comment, “Toys don’t last forever.”\r Woody’s nightmare of being flung into the trash heap of broken toys comes true when he inadvertently lands in a yard-sale 25¢ bin, from which he’s kidnapped by the greedy Al McWhiggin, owner of the local Al’s Toy Barn, who knows something that Woody himself doesn’t — that Woody was a big TV star back in the ’50s.\r Stashed in a downtown building, Woody meets cowgirl Jessie, Stinky Pete the Prospector and a horse named Bullseye and, in a wonderfully entertaining interlude, learns of his long-ago celebrity on a show called “Woody’s Roundup,” a kids’ favorite in which Woody and his new acquaintances were puppets. Not only that, but a whole line of commercial products revolved around the show, including the cereal Cowboy Crunchies. Al’s impressive collection of Woody memorabilia was incomplete without its centerpiece, but now that Woody is safely in hand, Al plans to cash in by selling the whole set to a museum in Japan.\r Locked in a high-rise room with his torn limb, there is nothing Woody can do to save himself, so it’s up to spaceman Buzz Lightyear and Andy’s other toys, including Rex the dinosaur, Hamm the pig, Mr. Potato Head and Slinky Dog, to mount a rescue expedition. They head first for the Toy Barn, where some Barbies come to delightful life and Buzz is astonished to find hundreds of exact replicas of himself on the shelves — one of whom throws a monkey wrench into the search for Woody by boxing Buzz up and taking his place on the team.\r Back in the building, the normally rambunctious Jessie begins tugging at Woody’s heart — as well as that of the viewer — by pointing out that, unlike Woody, who has enjoyed many years with a loving owner, she has endured a long purgatory in storage, bereft of any life worth living.\r In the film’s main and moving new song, “When She Loved Me,” penned by Randy Newman and sung by Sarah McLachlan, Jessie recalls how she once had an enchanted relationship with a girl, one that she thought could never end, but that after her owner outgrew her, she ended up, like so many other toys, in a donation box. It’s the fate of all toys, she ruefully reflects, to outlive their usefulness, so the prospect of Japan for her at least means that she will provide pleasure again and have some purpose in life.\r Caught up short by this intimation of mortality, Woody suddenly finds himself conflicted, torn between the “blood” family of his old TV cohorts and his closest friends from Andy’s house. Arrival of the rescue party puts his true loyalty to an immediate test, one complicated by Al’s decision to leave at once for Japan. Dynamite action climax, which proceeds through a maze-like roller-coaster ride on airport baggage ramps, into the belly of a jet and out onto the landing gear during takeoff, deftly combines a modern setting with rousing cowboy heroics, while resolution of the main characters’ fates has a sweetly philosophical ring that satisfies while still taking into account the darker issues raised earlier.\r Visually, “Toy Story 2” is entirely of a piece with its predecessor, distinguished by the same endearing character design and reality-nudging peripheral details."
    },
    {
      "rating": "9",
      "text": "Toys charged again. It could be worse than Andy found out who broke her doll Woody and I would not use it but never really is endless friendship , friendship and talking to other characters film debut came in cowboys."
    },
    {
      "rating": "10",
      "text": "I love Toy Story, which I still think is the best Pixar animation to date, but Toy Story 2, not only surpasses its predecessor, ,it also manages to make rock-solid entertainment out of a simple story.The animation is faultless. I could find nothing wrong with that. The script was just as irreverent and witty as the one in the first film, with jokes that adults will enjoy as well as kids. And the song When She Loved Me was beautiful and vital to the story.The voice talents are also faultless. Tom Hanks and Tim Allen are brilliant here as Woody and Buzz, but they were equally brilliant in the first too. Wayne Knight was also fine as Al, who kidnaps Woody to sell him to a museum. Joan Cusack was great as Jessie, though I do agree she has been better. Frasier's Kelsey Grammar is resoundingly entertaining as Stinky Pete(what a great name!). Solid support also from Don Rickles, Wallace Shawn, Jodi Benson(Ariel from little Mermaid)and Annie Potts.All in all, a fantastic film, that has enough visual jokes(like Wallace and Gromit) to satisfy adults and kids alike. Rock- solid entertainment that thoroughly deserves a 10/10. Bethany Cox"
    },
    {
      "rating": "10",
      "text": "One of the rare occasions where the second film is just as good as the first one. It has a whole load of great new characters (Zurg being the best) and an amazing story. One of Pixar's best."
    },
    {
      "rating": "10",
      "text": "The rare sequel that equals the brilliance of the of the original. Toy Story 2 is a great movie that continues the adventures of Woody, Buzz and the gang. It introduces great new characters like Jesse, Zurg and Bullseye to the mix and has great heart just like the first. If you loved the first, you'll love this!"
    },
    {
      "rating": "9",
      "text": "In the realm of sequels, “Toy Story 2” is to “Toy Story” what “The Empire Strikes Back” was to its predecessor, a richer, more satisfying film in every respect. The comparison between these two franchises will be pursued no further, given their utter dissimilarity.\r The only thing this sparkling picture lacks, by definition, is the shock of the new; four years ago, it was startling to behold the frontier that computer animation had conquered, to see what vast possibilities were now available in the whole field of animation. But there is no sense of complacency or sameness, as the filmmakers get their charges out of the house and into a situation that gives their lives more poignancy and awareness of mortality than, frankly, most characters in live-action films are accorded these days.\r After an overly assaultive outer-space teaser that will nonetheless serve its purpose of getting kids to shut up and pay attention, brisk set-up sees the affable Woody eagerly anticipating being taken to a summer Cowboy Camp by his owner, Andy. But excitement quickly turns to crushing disappointment when a “broken” arm causes Woody to be left behind, with Andy’s mom adding the final sting with the comment, “Toys don’t last forever.”\r Woody’s nightmare of being flung into the trash heap of broken toys comes true when he inadvertently lands in a yard-sale 25¢ bin, from which he’s kidnapped by the greedy Al McWhiggin, owner of the local Al’s Toy Barn, who knows something that Woody himself doesn’t — that Woody was a big TV star back in the ’50s.\r Stashed in a downtown building, Woody meets cowgirl Jessie, Stinky Pete the Prospector and a horse named Bullseye and, in a wonderfully entertaining interlude, learns of his long-ago celebrity on a show called “Woody’s Roundup,” a kids’ favorite in which Woody and his new acquaintances were puppets. Not only that, but a whole line of commercial products revolved around the show, including the cereal Cowboy Crunchies. Al’s impressive collection of Woody memorabilia was incomplete without its centerpiece, but now that Woody is safely in hand, Al plans to cash in by selling the whole set to a museum in Japan.\r Locked in a high-rise room with his torn limb, there is nothing Woody can do to save himself, so it’s up to spaceman Buzz Lightyear and Andy’s other toys, including Rex the dinosaur, Hamm the pig, Mr. Potato Head and Slinky Dog, to mount a rescue expedition. They head first for the Toy Barn, where some Barbies come to delightful life and Buzz is astonished to find hundreds of exact replicas of himself on the shelves — one of whom throws a monkey wrench into the search for Woody by boxing Buzz up and taking his place on the team.\r Back in the building, the normally rambunctious Jessie begins tugging at Woody’s heart — as well as that of the viewer — by pointing out that, unlike Woody, who has enjoyed many years with a loving owner, she has endured a long purgatory in storage, bereft of any life worth living.\r In the film’s main and moving new song, “When She Loved Me,” penned by Randy Newman and sung by Sarah McLachlan, Jessie recalls how she once had an enchanted relationship with a girl, one that she thought could never end, but that after her owner outgrew her, she ended up, like so many other toys, in a donation box. It’s the fate of all toys, she ruefully reflects, to outlive their usefulness, so the prospect of Japan for her at least means that she will provide pleasure again and have some purpose in life.\r Caught up short by this intimation of mortality, Woody suddenly finds himself conflicted, torn between the “blood” family of his old TV cohorts and his closest friends from Andy’s house. Arrival of the rescue party puts his true loyalty to an immediate test, one complicated by Al’s decision to leave at once for Japan. Dynamite action climax, which proceeds through a maze-like roller-coaster ride on airport baggage ramps, into the belly of a jet and out onto the landing gear during takeoff, deftly combines a modern setting with rousing cowboy heroics, while resolution of the main characters’ fates has a sweetly philosophical ring that satisfies while still taking into account the darker issues raised earlier.\r Visually, “Toy Story 2” is entirely of a piece with its predecessor, distinguished by the same endearing character design and reality-nudging peripheral details. But the new offering is even more densely packed with rollicking humor than the first, thanks to the addition of more characters and incident; jokey revelation of Buzz’s parentage will bring down the house at every screening. A sense of spirited invention permeates the proceedings from top to bottom, and few films so thoroughly deliver the feeling that everyone connected to it was united in pursuit of a single goal and had matchless fun reaching it."
    },
    {
      "rating": "10",
      "text": "One Of Pixar's BestToy Story 2 Has EVERYTHING That Made The First One A Masterpiece."
    },
    {
      "rating": "9",
      "text": "Toy Story 2 is one of the only sequels that does not crash into the wall. But things do not finish there, this movie is entertaining and the characters are charming and fresh, with a better development and a with new view into the world we have already seen in the first movie. This sequel really worths it's watch."
    },
    {
      "rating": "10",
      "text": "The perfect sequel. Nothing gives joy like toy story 2 just turning it on will mesmerize and you will be ready for 3 in no time"
    },
    {
      "rating": "10",
      "text": "The Toy Story trilogy films are Pixar's only legendary movies ever, the plots are outstanding, the characters puts all emotions to themselves and have great role models and great designs, and the endings are so emotional."
    },
    {
      "rating": "10",
      "text": "The best animation till this day. True classic. Clever storytelling, hysterical jokes and very poignant moments."
    },
    {
      "rating": "9",
      "text": "Semplicemente stupendo.Come sviluppare al meglio storia, personaggi e humor nell'arco di 4 anni, praticamente. Ho amato quasi ogni elemento del film, e sinceramente non ho grosse lamentele da muovere.Consigliato? Assolutamente."
    },
    {
      "rating": "9",
      "text": "Fresher and more innovative, Toy Story 2 is a beautiful movie with a story that no one could forget."
    },
    {
      "rating": "10",
      "text": "a very charming movie with great animation and is extremely better than the original"
    },
    {
      "rating": "9",
      "text": "\"Toy Story 2\", the animation sequel to the masterpiece \"Toy Story\", labels itself as a another masterpiece by continuing the purity and love the first movie had."
    },
    {
      "rating": "10",
      "text": "the reason of why the original was so good is because it needs to be played with sequels and this time this one kicks a** and its my favorite in the series along with the first movie."
    },
    {
      "rating": "10",
      "text": "Toy Story 2 is basically just an improvement over the original and it's still one of the best sequels out there. It's so hard to lower down the score on this movie so it stays at a 10."
    },
    {
      "rating": "9",
      "text": "I always find it so hard to believe that it was made in 1999. It's like it was just released last year! A great movie for anyone."
    },
    {
      "rating": "8",
      "text": "This may not be the best Toy Story but it is still a great movie, the story is a little predictable and some of the new characters aren't as great as the others but it is still a movie I would recommend seeing, it's funny, smart , and ultimately charming, if you enjoyed the first you'll enjoy this one, even if it's not as good."
    },
    {
      "rating": "6",
      "text": "Good follow up to the sensational first film with lots of humour though missing the emotional core of the first film in my opinion."
    },
    {
      "rating": "5",
      "text": "Kind of boring as I remember thinking as a kid when I saw this movie."
    },
    {
      "rating": "3",
      "text": "Toy Story 2 is just another dismal effort with inept characters and an implausible story. Any new characters added this time do nothing to help this franchise."
    },
    {
      "rating": "6",
      "text": "the second toy story movie series is for me the worst film of all the series but still is no bad film,there is some new characters that i didn't like so much."
    },
    {
      "rating": "10",
      "text": "The animation and visuals are just as gorgeous as they were in the first one and were amazing for the time. I loved the incorporation of the new characters Jessie and Bullseye. The writing and screenplay was spectacular just like the first one. The storytelling was even better than the first one. The voice acting was stupendous especially Tim Allen, Tom Hanks, Joan Cusack, Don Rickles, Wallace Shawn, Kelsey Grammer, John Ratzenberger, Jim Varney, and Wayne Knight. The soundtrack and score were also fantastic and I especially loved the song When She Loved Me performed by Sarah McLachlan. I loved this one but I still love the first one more. Toy Story 2 is one of my favorite animated movies of all time."
    },
    {
      "rating": "0",
      "text": "For how much longer. Disney sequels just do not work. Pixar tries harder, but why bother if Disney only cares about the money? Disney should stop making sequels. The movie does have merit in some parts, but why start when you already ended the first movie pretty well?"
    },
    {
      "rating": "10",
      "text": "My favorite all kind movie! I love it so much. The best hit of last Disney-Pixar."
    },
    {
      "rating": "10",
      "text": "Best movie of 1999! Really Woody and Buzz rock!"
    },
    {
      "rating": "10",
      "text": "Just as good as Toy Story, with the best action figure villian... \"Zurg\"."
    },
    {
      "rating": "10",
      "text": "This is the best movie in 1999! It's funny and it's for everyone at any age to enjoy! Disney and Pixar are genuises!"
    },
    {
      "rating": "10",
      "text": "Some many years ago....must have watched this 1000 times LOL!."
    },
    {
      "rating": "10",
      "text": "Even more fun and more adventurous than the first film. Pros: Innovative characters; eye popping animation; hilarious dialog and pop culture references; the best Pixar film to date. Cons: Again, if Toy Story 2 lacked anything, it's because you don't have an eye for animation, period."
    },
    {
      "rating": "8",
      "text": "It could reasonably be argued that the plot for Toy Story 2 is virtually the original's in reverse (this time around Buzz is trying to rescue Woody) but, as with virtually all of Disney Pixar's movies, there are more than enough funny moments to keep anyone entertained."
    },
    {
      "rating": "10",
      "text": "A fantastic sequel to its previous movie. It has sympathy, just like the first movie. Technically, it was amazing. It has great animation, voice acting and a wonderful new cast of characters. Another masterpiece from Pixar I must say......"
    },
    {
      "rating": "9",
      "text": "It's more adventurous than the first with a few more clever pop-culture references, making this the sequel that the first film deserved. Not to mention the introduction of great new characters and would you believe it, no age limit"
    },
    {
      "rating": "10",
      "text": "In my opinion, this is the best Pixar movie, other than Ratatouille and The Incredibles. And I say this only because the movie introduces new character bonds while still strengthening the old ones. (9.7/10)"
    },
    {
      "rating": "10",
      "text": "Like its predecessor, Toy Story 2 is filled with great depth and genuine heart showing us the potential of big budget animation as something that's truly for all ages and the ages."
    },
    {
      "rating": "9",
      "text": "The new characters including Buster (The Dog) are great additions. I love that the old guy from Geri's Game made a cameo. Toy Story 2 is about friendship, just like the first movie, but in a different way. This one is about friends having each others back. The movie goes in depth about the meaning of a toy's life. Great dialogue like the first, only problem I had was Buzz and Woody didn't have enough screen time together like in the first. I love the star wars reference with Zurg being Buzz's dad. I have to say the Toy Story version is better. I absolutely love the sexual reference with Buzz, it's Hilarious."
    }
  ]
}