{
  "id": 69,
  "title": "Toy Story 3",
  "starring": [
    "Tom Hanks",
    "Tim Allen"
  ],
  "runtime": 103,
  "genre": [
    "Animation",
    "Family",
    "Comedy"
  ],
  "description": "Woody, Buzz, and the rest of Andy's toys haven't been played with in years. With Andy about to go to college, the gang find themselves accidentally left at a nefarious day care center. The toys must band together to escape and return home to Andy.",
  "releaseYear": "2010",
  "mpaaRating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jSzisjO4vcE0dxuzfsl979HIwmS.jpg",
  "categories": {
    "plot": 8.645833333333334,
    "acting": 9.071428571428571,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 8.666666666666666,
    "familyFriendly": 8.818181818181818,
    "funny": 9.6,
    "action": 8.75
  },
  "reviews": [
    {
      "rating": "9",
      "text": "15 years has past, and my faith in Pixar did not break; \"Toy Story 3\" shakes the cinema as a groundbreaking masterpiece, a masterpiece pertaining the pure love and joy we rarely see in any kind of movies."
    },
    {
      "rating": "10",
      "text": "This movie is a thing to behold. Don't be turned away from Toy Story 3 because a \"3\" is tacked on the end. This isn't just a movie about toys, it's a movie about genuine human emotions. Its funny, clever, sad, and enlightening. For an animated movie to have all of these characteristics and to surpass most movies I've seen lately is incredible. And tto add to that, the animation is impeccable, the story is great, and the characters are lovable (old and new). A great way to end a great movie series."
    },
    {
      "rating": "9",
      "text": "Disney strikes a 3rd knockout Toy Story picture with Toy Story 3, though seemingly lacking something from the other 2 films, it is still likely to be one of the best films of the new decade."
    },
    {
      "rating": "10",
      "text": "\"Toy Story 3\" knows precisely when to make you laugh and when to make you cry, and is bound to touch the hearts of anyone who has had to put their childhood behind them."
    },
    {
      "rating": "10",
      "text": "Toy Story 3 is one of those movies that you can watch and enjoy for the first minute to the last minute. The animation is superb, we came so far from the original graphically speaking. Kids will just eat this up, and adults will be amused by the older jokes. It is essential to have a copy of this movie, whether on disc or Netflix. I give this movie a 9.5, the score it deserves, because the movie really is wonderful."
    },
    {
      "rating": "10",
      "text": "Have you ever watched a movie that took you back to your childhood and brought back those feelings of innocence you had as a child? It's that kind of movie magic that fills the screen for the entire movie. A truly magnificent work of art."
    },
    {
      "rating": "10",
      "text": "Truly a masterpiece of storytelling and animation. Pixar's triumphant closing title to their landmark trilogy is a metaphor on life, telling us all (especially those of us who grew up with it) to treat each other with kindness respect, even when we are not getting it in return. See it in 2D, 3D is a gimmick and a headache!"
    },
    {
      "rating": "10",
      "text": "Excellent sequel. Another outstanding Pixar movie. Some scenes may be too scary for 6 or under, 7 and up to senior citizens will love this film. Never a wasted moment, scene, or line of dialog; Toy Story 3 is worthy of an Academy Award for Best Movie of the Year award."
    },
    {
      "rating": "10",
      "text": "I don't know why I was even I even get surprised anymore with Pixar. All they make are good to absolute masterpiece movies. Toy Story 3 is not only the best of the trilogy, but quite possibly the best of all the Pixar movies."
    },
    {
      "rating": "10",
      "text": "Fantastic movie - I saw it with my grown children, all veterans of the previous movies and we all enjoyed it immensely. it was inventive, fun, touching, thrilling and poignant. i could see it again right now."
    },
    {
      "rating": "10",
      "text": "A very good film. I was 4 when the first 'Toy Story' came out, and I'm now 19, and about to begin University, so mine and Andy's situations are fairly similar. While I am not nearly as sentimental about my old toys as Andy is-to be honest I barely remember them- I relate to his childhood nostalgia. And to nostalgia for Toy Story, of course. Apparently, one of the major themes of the film is growing up and the impermanence of life; well, I've only really become aware of the passing of time recently, because I'm now at the age where enough time has passed for me to notice the changes since childhood. This movie speaks to my current zeitgeist, and that of quite a few other people I'm sure."
    },
    {
      "rating": "10",
      "text": "This is a really enjoyable movie for everyone in the family. I didn't expect anything less from Pixar."
    },
    {
      "rating": "10",
      "text": "A truly touching movie. I found it made good, fun and original references to the earlier movies. The movie left we the my good memories of all the old toys. The comedy is simple, good, and fresh. I felt like this sequel tooks its time and ended the trilogy in the best way leaving nothing behind, including old characters."
    },
    {
      "rating": "10",
      "text": "Pixar does it again! They are not only the best animation studio but one of the best studio's period in crafting a story and characters people care about; while keeping things fun."
    },
    {
      "rating": "10",
      "text": "Although so many have said it was less inspiring or under par compared to 1 and 2. I would have to say i whole hearted disagree. I loved the first two and how the characters just bought you back to childhood. But I would have to say number 3 delivered more laughs and although more directed towards an older audience it outclassed the originals if only by a small margin."
    },
    {
      "rating": "10",
      "text": "Toy Story 3 was the best sequel compare to the same Toy Story 2 that there are both best sequels ever,since Star Wars Original Trilogy. I love this movie and I really love it to watch this. The images are pretty good to watch and they did a lot of work with the animation and they also did a lot of work with the better story. This is the last trilogy that they made the best animation film ever. The Toy Story saga is complete and we will remember three movies at our hearts."
    },
    {
      "rating": "7",
      "text": "I found myself wondering who this movie was actually made for. Judging by the reviews, I suspect it's for aging baby boomer critics who are nostalgic over their own kids' childhoods. Some scenes seemed kind of tense and scary for little kids . . . but as I imagined taking my own children to this when they were in elementary school, I doubted whether the whole \"going off to college\" theme would have intrigued them. Enchanting visuals, of course. But though I had the obligatory tear in my eye at the end, this was nowhere near as moving as last year's \"Up.\""
    },
    {
      "rating": "10",
      "text": "Quite simply one of the best film Ive seen this year. Packed with that Pixar goodness. surprise cameos and a perfect mix of a lost childhood, showing the situation from different aspects. With creative, loveable and well done characters and animations, Toy Story 3 lives up to the first two films, and even outshines them."
    },
    {
      "rating": "10",
      "text": "Pixar makes yet another great film. Toy Story 3 presents us with the idea of growing up and moving on with life. And this is heartbreaking but you empathise and journey back to your own experiences with growing up. In some ways, itâ"
    },
    {
      "rating": "10",
      "text": "Don't walk away from this movie. it has heart, emotion, slapstick humor, and very lovable characters. Toy Story 3 is a huge hit and its one of the best movies ever made to gain 1 billion dollars (beating Avatar in one shot)."
    },
    {
      "rating": "10",
      "text": "I loved the first and the second. The third one is just hilarious . I was waiting what the plot was going to be like and I just loved it. It was worth waiting eleven years to finally see how toy story ends. The most surprising fact was that I cried like a baby."
    },
    {
      "rating": "9",
      "text": "I have never before been so emotionally invested in a movie before. I've started to sleep with my teddy again, so he never feels like they do. Toy Story 3 is a beautiful story, and while it's not a perfect 10, it's as close as it gets!"
    },
    {
      "rating": "10",
      "text": "This is probably the best movie I ever watched. It was funny and emotional at the same time. I'll miss Toy Story."
    },
    {
      "rating": "7",
      "text": "I enjoyed this one as much as I enjoyed the first 2, great story line, fun characters, voices are done very well, nice action, great family flick.  Put in the popcorn and enjoy!"
    },
    {
      "rating": "7",
      "text": "jeez!!! Why the many 10? Taking a look a toy story 3,it's just not innovative and mind blowing like the first,there's really nothing new to see interms of new characters and the action scenes like the second. So, i do think toy story 3 is a bit overrated (just a tiny bit) but overall it is a fine movie and a fitting closure to a truly wonderful franchise"
    },
    {
      "rating": "10",
      "text": "Pixar has made 11 great films (minus Cars 2) and this is the best by far. Made me cry and made me laugh and was beautifully written and was just lovely to watch. I really have to stand and applaud Pixar for making such an incredible film."
    },
    {
      "rating": "10",
      "text": "This movie is funny, exciting, dramatic (at times) and heartfelt because BOY DID I CRY. It may have been even better than The Social Network and stood up to all heavyweight films of 2010"
    },
    {
      "rating": "10",
      "text": "Toy Story 3 is a heartfelt, highly original and creative family-friendly flick. One of Pixar's best, and a nice send off to a classic trilogy. 4/4 stars."
    },
    {
      "rating": "10",
      "text": "Eleven years and countless rumours later, Toy Story 3 was finally unveiled, and it was undoubtedly worth every last minute of that decade and a year to not only bring us one of the best animated features we have ever seen, but one of the most touching and wipe-your-eyes drama that very few films can do.\rSee the thing is, we have all grown up since Andy's toys first came into our lives, but the people at Pixar have told a story which shows that the toys, and Andy himself, have also grown up, Andy of course with age, but the toys are now in the predicament that they always feared, not being played with.\rMuch like the events of the second film, a curb side accident soon turns the tables from the second film as it is Woody now chasing after his friends.\rThey are heading for Sunnyside daycare, for which at first glance is everything they had hoped it to be, new toys and they will finally be played with after years of isolation. But Woody soon learns the truth about the place, but is whisked out of the centre and must return to help his friends escape the clutches of Lotso (Ned Beatty) and his henchmen.\rThe film invites us all back to enjoy our memories of these simple plastic dolls, and its hard to remember a film like this that makes us feel the way we do, because after fifteen years, its still got it. We have grown up with these toys, and we are reminded just how difficult growing up can be, especially after an imaginative childhood I'm sure most of us had. The cleverness and cunning nature of a child is all within Toy Story 3 and blends perfectly with the diverse set of characters to keep everyone entertained.\rIt is truly wonderful to see how far these visuals have come since the original, with so much more detail and colour that truly put Pixar at the top of the perch in animation and story.\rPerfect can indeed be thrown around, but for Toy Story 3 it rings true for so many reasons. It has the perfect blend of comedy, heart and even action, combined with the original voice cast including Tim Allen and Tom Hanks while also bringing in the likes of Michael Keaton and Timothy Dalton. Pixar really have created a masterful animated adventure that will continue to reach for our inner child.\rWith a perfect ending that will surely turn on the waterworks, its hard to say if there should be another film, simply because of the perfection of this and the first two that have created the perfect trilogy.\rMasterful, emotional, but a truly hilarious and brilliant effort that will continue to surprise and exceed, but a film that will also find a place deservedly among the best."
    },
    {
      "rating": "10",
      "text": "Toy Story 3 is not only hilarious but emotionally resonant as well, you will find yourself crying at many parts in this film and the movie features great voice acting and dazzling animation only push the film to an even higher note. I give this movie a fantastic and very rare 100%."
    },
    {
      "rating": "10",
      "text": "If you are around the age of 20 and have seen Toy Story 1 and 2; I think its impossible to not love this movie.Its beautiful. And its an experience that you can only get if you followed the movie from the start to this, which is a true shame for the future generations."
    },
    {
      "rating": "10",
      "text": "The other 2 toy story's were great but this one takes the cake. Never has a film felt so real with its characters even though they were just toys  an achievement like no other for pixar. the ending is classic and will leave some in tears. one of the best pictures of the year"
    },
    {
      "rating": "10",
      "text": "It is amazing to witness an animated movie that is so powerful. It has a very human connection about it. This was clearly the best of the series. It hit all the right notes and is strikingly emotional."
    },
    {
      "rating": "10",
      "text": "Toy Story 3 is the final chapter of the Toy Story franchise, or for now anyway. With Andy leaving for college, now in his late teens, his mother is urging him to get rid of his old toys before he leaves. When the gang of toys end up being mistakenly taken to a kindergarten play-centre instead of being left in the attic like they should have been they form a plan to get back home as quickly as possible. However they all realise that Andy will never play with them again, he is far to old to love them like he used to and they will just gather dust so staying in the play-centre is the better option. Its not until they are made unwelcome by the current residents of the kindergarten that they decide to put this plan into motion with less than successful results due to a grumpy old toy who was abandoned by their owner years ago.\rToy Story 3 is a great conclusion to the amazing coming of age saga that has been the Toy Story series. The sound and animation is just as great as usual, the old characters are still cool and the new characters are well introduced and likeable. Whether Toy Story still has a future is unknown but for the last 15 years toy story provided us with one of the best animated tales ever created and that by itself is a reason to celebrate."
    },
    {
      "rating": "10",
      "text": "The perfect ending to a perfect trilogy. The ending had me sobbing over toys like a child. I don't think any other movies, besides Star Wars, have shaped my life the way Toy Story has."
    },
    {
      "rating": "10",
      "text": "Adorable animation and a massive amount of truly heart-rending thematic subject matter not only make \"Toy Story 3\" the best of the series, but quite possibly the most earnestly poignant animated film ever made."
    },
    {
      "rating": "9",
      "text": "The perfect way to end a trilogy.  If it wasn't for Inception this would have been my favorite film of 2010.  Just a fun, heart warming, and very fulfilling piece of art."
    },
    {
      "rating": "10",
      "text": "Pixar with \"Toy Story 3\" had its grand zenith. Toy Story trilogy is so: \"Toy Story\" good, \"Toy Story 2\" better and \"Toy Story 3\" best. This film is one of best film ever."
    },
    {
      "rating": "7",
      "text": "Summary Review\r+ Great Visual style\r+ Good story with some interesting parts to it\r+ Good voice acting\r+ Fantastic ending to a great movie franchise\r-Story is predictable and it fairly unoriginal\r-Way too much goes on in this movie\r As a result I would recommend this film because it’s interesting. However I do feel it is a bit over-rated and will hopefully explain why I think this way.\r Full Review\rThe first thing I have to say about the movie, as is a trademark of the Toy Story franchise is that of how the animation within the film is fantastic. There really is a great balance between the creative nature of the design of the locations within the film which are creative enough to be interesting but not so out of this world they feel out of place. Such visuals I feel are enhanced by the lighting which really enhances the contrast between the dark and lighter areas. This is particularly the case with the day care centre that the toys end up in with a great sense of realism and creativity between the playground and the play area within the centre. Of course there are moments that do seem slightly out of place but that can be forgiven given that the overall look of the film is great.\r However for me a good looking film also needs to have and interesting story. I feel the angle that this film takes is quite an interesting one. Put simply Andy grows old and is heading for college, and the Toys end up in a day care centre (apart from Woody). This raises interesting issues about the Toys ‘loyalty’ to their owner. The story is made further when the Toys realise life at the day care centre is not all it is cracked up to be, epically when more is revealed about the ‘ruler’ (if you will) of the toys at day care (Lotso). I won’t spoiler the plot, but overall it is quite interesting. Furthermore as with many Pixar films there are some elements of comedy mixed in with the ‘sad’ moments (in particularly Buzz’s Spanish mode), that help keep the story fresh.\r However the main thing I found great about the film is that of the ending. This is not because I wanted the film to end, but because of how satisfying the movie ended. For sure it is not that original and not very surprising, but the fact that it seems to put the franchise to rest and reunite the toys helps to make the ending of the film really satisfying.\r With all this said, I really do feel this movie is over-rated seeing as how nearly all reviews I have read rate it the film either a 9 or a 10 out of 10, ratings that I really don’t feel the film deserves.  The first major complaint I have with the film is that of the story while it is good, there are some key problems I feel need to be outlined. The first is that of how there is very little character development of the main character as you learn nothing new about them, meaning characters like Woody, Buzz etc. (despite the excellent voice acting) feel the same from the last two movies of the franchise. For sure the film does introduce new characters like Barbie and Ken that arguably help undermine this problem, but they feel under-developed and for the most part pointless. The second issue I have with the story is that of the lack of originality. This can be seen by how for a big section of the film, the story of Toy Story 2 is reused only this time it is Woody trying to find his friends  rather than the other way round. Likewise the whole notion of the toy getting separated from their owner seems a bit too familiar. Such lack of originality I find affects the sub-plots, such as the obvious love story between Barbie and Ken, and the development of Buzz and Jess’ friendship. This lack of originality meant that I found the film to be predictable and not as gripping as it should be. As a result while the story I good, I did not find it as original/interesting as say Monster Inc. University.\r The second major complaint I have with the film is that of how, like Monster Inc. University, I found Pixar tried to cram too much into this film without expanding on the story too much.  This can be seen with how elements like the Toys ending up in the scrap yard, feels more like padding than anything else. Likewise the whole backstory of Lotso, I found was breezed over and did not fully answer all questions. As a result I felt that the writers of the film should have focused more developing the characters and the story on the whole.\r However, although I have criticised the film, don’t get me wrong it is still a great movie, just a movie I do not feel is as good as everyone claims. Hopefully I have explained myself."
    },
    {
      "rating": "9",
      "text": "Toy Story went down each time, and the long hiatus didn't help. I still found all the characters funny, charming, and raucous. 'Toy Story 3' became more childish than the previous two, which relied on a smarter breed of comedy. But its still enjoyable but I hope there's no 4, because without Andy, there's no plot."
    },
    {
      "rating": "9",
      "text": "It's almost as good as the original!  A 9.5 in my books!  I loved the plot too. Andy was old and going to college. The toys were going to the attic. It was really a deep movie and i loved it. However it isn't a perfect 10. My old favorite characters like the drawing board thingy and the soldiers were replaced by new characters which i did not like as much..    (Oh and by the way... Andy how could you!)"
    },
    {
      "rating": "10",
      "text": "In 1995, Pixar released the world's first full-length CGI animation film, Toy Story. Audiences were amazed, not only by the introduction of CGI animation, but also by Toy Story's heartwarming characters and innovative storytelling. CGI is ubiquitous nowadays, largely due to Toy Story's success.\r After nearly 15 years since the last installment, Pixar resurrects Woody and Buzz to create a masterful, heartwarming conclusion that is bound to resonate amongst audiences of all ages. Over the past 20 years, Andy has aged with us, and he is now preparing to leave for college. The toys encounter misfortune and are separated from Andy yet again.\r The film successfully maintains the franchise's outstanding humor and voice acting. Toy Story 3's visual exhibit the best artistic design and technical excellence in the business. Randy Newman provides a memorable score along with a special Gipsy Kings song. Toy Story 3 investigates our attachment to toys, the challenge of becoming an adult, and our relationship with future generations.\r Toy Story 3 is the perfect farewell to Woody, Buzz, and the rest of the gang. It sends a beautiful, heartwarming messages to audiences while helping many relive their childhoods. It has been a wonderful to grow up with this beloved franchise. Toy Story has taken the art of storytelling to infinity and beyond!"
    },
    {
      "rating": "9",
      "text": "After years of being stowed in Andy’s toy chest, the time has finally come for Woody (Hanks), Buzz (Allen) and friends to move on. But after they’re welcomed to Sunnyside Daycare Centre by the kindly Lots-O’-Huggin’ Bear (Beatty) they realise this seeming toy’s paradise is actually something closer to hell...\r Pixar has done it again, extending an amazing streak of successes that stretches all the way back to the original Toy Story, which changed the face of feature length animation when it reached theaters in 1995. Now, 15 years after their original debut and 11 years after the first sequel, Toy Story 2, Woody (voice of Tom Hanks), Buzz (Tim Allen), and their fellow toys have returned to the screen for another adventure. Although aspects of Toy Story 3 echo similar elements from the previous films, making this the least original entry in the trilogy, the movie's final act will resonate deeply with many viewers, making this chapter in many ways the most heartfelt.\r he story, which is simple enough in its essence, affords opportunities for action (the Great Escape), comedy (Ken & Barbie, Buzz's Spanish personality), and pathos. The ending, which is surprisingly affecting, will speak more deeply to adults than children. Those in the latter group will understand the importance of friendship, but older viewers will perceive other, bittersweet things: the fleeting nature of childhood and how all things pass, seemingly in the blink of an eye. Children are only peripherally aware of the passage of time, but adults sometimes recognize little else. There's a moment in Toy Story 3, when Andy experiences an epiphany, that brings this all home. The scene, which may go unnoticed by the core demographic, will bring lumps to the throats and tears to the eyes of some parents. This is the kind of thing Pixar does so effectively, and the reason why their films achieve greater respect than those of their less ambitious competitors.\r From a purely artistic standpoint, Toy Story 3 is superior, although not vastly so, than its predecessors. At the time of their releases, Toy Story and Toy Story 2 were cutting edge, but the bar hasn't moved much in 11 years. The problem with this movie is the 3-D, which is the \"preferred\" format for its screening. The bright rainbow of colors becomes murky and washed out, with grays withering the kaleidoscope of hues. In addition, the 3-D appears to have been employed as an afterthought - there are lengthy sequences in which it either isn't used or is used minimally. I was surprised to find I could take off the 3-D glasses and, for stretches, not be confounded by blurred or double images. In the case of Toy Story 3, 3-D adds nothing except a box office surcharge.\r With most franchises, animated or otherwise, the well has run dry by the time the third episode is under consideration, which explains why so many second sequels fail to meet expectations. In a way, the same may be true of Toy Story 3, but it doesn't strain to be different to the point where it loses sight of its strengths. Instead, it focuses on the reasons for its popularity and amplifies those. Our familiarity with the characters and their interaction becomes an asset, making the action scenes more than displays of pixels zipping across the screen. The writing shows a deftness of touch that provides Toy Story 3 with emotional depth. And director Lee Unkrich, a Pixar fixture who co-directed Toy Story 2 (among other films), shows the same mastery of elements evident in the other Toy Story films, allowing for a seamless continuity. Toy Story 3 enhances the legacy of its brand while providing exceptional entertainment value for viewers of all ages, especially for those who favor the brighter, livelier 2-D iteration over the 3-D gimmick."
    },
    {
      "rating": "10",
      "text": "French review: La première partie du film pose une intrigue de fou, la seconde partie du film va de rebondissement en rebondissement et nous accroche à notre siège avec de la super glue. Je n'ai pas autant aimé les 2 autres premiers films sur ces jouets, d'autant que les personnages manquaient, selon moi, d'un petit quelque chose pouvant les rendre intéressant mais là, dans ce film en particulier et plus que dans les deux autres, ils ont exploités leur capacités en tant que jouet à fond la caisse, les attaques, les tentatives de libération, leur plans pour s'en sortir... tout est génial! Toutes les idées sont bonnes et s'enchainent seconde après seconde, c'est fou, j'ai été bluffé devant tant d'originalité. Bravo!"
    },
    {
      "rating": "10",
      "text": "If Toy Story 3 doesn't make you emotional, I don't know what will. Filled to the brim with nostalgia and references from the previous movies in the franchise, it probably couldn't have been any better than it was. We start out knowing the toys haven't been played with in a while and they miss it. They even go to the trouble of creating an elaborate plan just to get Andy to notice them for one minute. Their plan hardly works, but then Andy needs to pack for college. Has to decide who stays and who goes. Woody is to go to college with him and the rest are to live in the attic, but instead they accidentally go on an adventure none of them will soon forget.\r Andy is leaving for college, so naturally there will be emotion surrounding his family and leaving, but with everything he's leaving behind as well. We can even feel the emotion in the toys. Their owner is leaving them because he's all grown up now and doesn't need them anymore, much like his own family. Throughout the toys' journey, they end up at Sunnyside daycare. It seems a friendly and inviting place at first, but inside it's like a dystopia. I can't help but think this is modeled off of some human society, but portrayed with a social hierarchy in toys instead. This movie doesn't lack on the comedy either. Ken and Barbie feel like they were \"made for each other.\" Guess they never would have guessed that they actually were.\r One of the most significant parts of the movie to me was the soundtrack. It varied immensely for each scene and really did add so much. It evoked the feeling of horror in the times spent in the caterpillar room, and happiness when in the butterfly room. Very skillfully put together and every artistic aspect was nearly perfect. Lotso is also truly an amazing villain. He has a haunting backstory that is eventually revealed, has to personas that he shows off to people depending on the time of day, and he ends the story as still a villain by betraying his friends but really gets what was coming to him by getting attached to that truck.\rOf course all the toys get back safe. This is what everyone wants and is rooting for. But the hard part of the movie is far from over. We see Andy leaving his mother \"I wish I could always be with you.\" \"You will be, mom.\" and his family, as well as his toys. He has to make the difficult decision to let them go because he's moving on as well. When Andy gives his toys away to Bonnie, it's like he's giving us away as well. I grew up with Toy story on VHS at my grandma's house. I grew up with these toys. Like they were my own toys. I'm the same age as Andy is right now, the same time in my life. Although this is probably my 3rd time watching it, I still feel the same way about this bittersweet ending. It's truly beautiful and leaves the toys and Andy both in a great place in their relationship and story that no continuation could ever make it better. An ending that lets us leave the characters on the screen as Andy leaves his toys. Probably the best sequel I have ever seen. Also still love the Totoro cameo by John Lassetter for his boy Hayao Miyazaki."
    },
    {
      "rating": "9",
      "text": "A fabulous way to end one of the best trilogies of all time. A must see if you haven't all ready, like the other Toy Story movies. Definitely one of the best films of all time."
    },
    {
      "rating": "10",
      "text": "This is the best Pixar Movie since 2003. True, Pixar's movies have all been excellent in quality, none of them quite matched up to the Toy Story movies or Nemo. But this movie does!\r This movie makes you laugh and cry at the same time, and, when the toys are in danger, you're actually on the edge of your seat waiting for the outcome of the situation, even though you know they won't die (after all, it's Pixar!).\r This definitely deserved best animated picture, and it is a must see not just for Toy Story fans, not just for Pixar fans, but for regular cinema-goers also!"
    },
    {
      "rating": "9",
      "text": "The first two films in Pixar's animated Toy Story franchise are brilliant bookends, models of technique warmed by humor and imagination. Toy Story 3, coming 11 years after the last one, should have been a letdown. I mean, how hard can you squeeze a golden goose before the bird calls a work stoppage?\r No worries. Toy Story 3, decked out in nifty, non-showy 3-D, is a joy to behold. It hits every button from laughter to tears and lifts you up on waves of visual dazzlement. And you don't need to take a kid along to appreciate it. Jeez, people, we were all kids once. And the way the Pixar wizards re-create a sense of childhood wonder is damn near genius.\r Cowboy Woody (again voiced by Tom Hanks with just the right blend of wit and hardwon wisdom) and astronaut Buzz Lightyear (Tim Allen in playfully scrappy vocal form) are toys in crisis. Andy, the boy who gave these toys a home, is off to college. He's outgrown his playthings, including cowgirl Jessie (Joan Cusack), Hamm (John Ratzenberger), Rex (Wallace Shawn), Barbie (Jodi Benson) and the Potatoheads (Don Rickles and Estelle Harris). Andy plans to put his toys in the attic. Instead, they end up in trash bags and mistakenly kicked to the curb to await the garbage truck. Yikes! Kids and adults with abandonment issues (you know who you are) might want to give this chapter a pass.\r OK, take a breath. The toys make it to the Sunnyside Day Care Center, where they meet new toys, such as bizarro Big Baby, ditzy triceratops Trixie (Kristen Schaal) and Shakespeare-spouting hedgehog Mr. Pricklepants (a plummy Timothy Dalton). And Barbie finally hooks up with Ken, hilariously voiced by Michael Keaton as a closet case who's watched too much Project Runway. I'm kidding, but just barely.\r The prospect of being played with by new kids delights Andy's toys. That is, until Lotso (Ned Beatty), a plush bear with ulterior motives, puts them in a roomful of hyperactive, toybashing tots. That scene is scary-funny. A later scene, in which the toys narrowly escape incineration, is just scary.\r The fun returns in the nick of time. It's impossible not to giggle when Buzz gets his language button switched to Spanish. Still, there's no denying that Toy Story 3, vividly directed by Lee Unkrich from a richly detailed script by Michael Arndt (Little Miss Sunshine), goes darker and emotionally deeper than its predecessors. The sequence in which Andy introduces his  toys to a shy little girl named Bonnie (Emily Hahn) is a heartbreaker. So is the movie. Tag it as one of the year's best."
    },
    {
      "rating": "10",
      "text": "Pixar's Best Sequel To DateToy Story 3 Is EASILY One Of The Top 5 Best Of 2010."
    },
    {
      "rating": "10",
      "text": "THis was a good closed off to the andy trilogy. ANd really was an emotional ending. Not only that but it had a great villain."
    }
  ]
}