{
  "id": 1092,
  "title": "Tracers",
  "starring": [
    "Taylor Lautner",
    "Marie Avgeropoulos"
  ],
  "runtime": 94,
  "genre": [
    "Action"
  ],
  "description": "Wanted by the mafia, a New York City bike messenger escapes into the world of parkour after meeting a beautiful stranger.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2XoazCkD4gRlqkJK7q6TOTUx1ta.jpg",
  "categories": {
    "plot": 5.615384615384615,
    "acting": 5.6,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 6.888888888888889
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Tracers is confident when it leaps through obstacles, but the tiresome screenplay and uninteresting personalities prevent it from reaching any plateau. This is one of rare movies that attempts to mix extreme sport and drama thriller. The odd concept doesn't necessarily deliver a good spectacle, and as expected, Tracers falls short by the same issue. While it boasts well-choreographed freerun sequences and authentic cinematography of the city, its narrative is too convoluted that the movie just feels inorganic despite the best effort from visual department.\r Cam (Taylor Lautner) has a troublesome life, he owes some nasty people a lot of cash. His day job as a bike messenger doesn't nearly cover this debt, so when a chance for better alternative and also romantic involvement arrives, he takes it without hesitation. Cam is a presentable lead character, he deals with real life problems which can be relatable for everyone. Taylor Lautner performs well, he might not possess wide range of acting prowess, but he is physically fit and pretty convincing as Cam.\r However, the poor screenplay as he interacts with other characters make Cam looks one-dimensional. The story tries to be too much and simply overreaches with its premise. There's a hefty amount of time invested for love subplot with Nikki (Marie Avgeropoulos). Unfortunately, Nikki isn't that likeable, she's too trapped in the mysterious love interest type. The script doesn't give her much more than sullen expression. Then there's the crime aspect, the crew of parkour agents undertakes dirty missions to infiltrate highly guarded facilities.\r Even if audiences believe that every rooftops and buildings are accessible for convenience's sake, the movie throws in heist, mafia and secret agency subplots. It gets really arduous half-way through, and none of these complex sidetracks are fully explored. There's barely any build up, some aspects are even thrown in out of nowhere, and they certainly don't wrap up in any coherent manner. It tries to remedy this with sob back stories to justify rooting for the good guys, but audience problem wouldn't care about them at this point.\r It's a shame since the visual design presents the city with grayish gritty tone and a dose of realism. The view can be immersive, this is already an advantage and a good use of parkour gimmick in the urban jungle. The way the cameras work during certain scenes are very good, continuous shots even in tight spaces prove that the film has finesse. It understands the intricacy of the motion and how to translate that into watchable scenes.\r The choppy material weighs it down, it could’ve been much more enjoyable if the film opted for lighter tone. As it stands, Tracers is a decent run through the city, but it loses momentum when the characters stop and exchange banter."
    },
    {
      "rating": "7",
      "text": "Taylor Lautner may always be remembered as Jacob, the annoying werewolf boy from the Twilight Series. People have a hard time seeing him as anything else, but Tracers is the second action film I've seen him star in, and this kid has the perfect make up to be a huge action star. Lautner is more than just another good looking actor, as he can speak several languages, is a martial arts expert, and an avid parkourer, all skills he uses in his latest film, Tracers. Lautner plays Cam, a down on his luck bike messenger, who comes to befriend a group of parkour enthusiasts. What they do fascinates Cam and he wants to join them, but when he does, he realizes that they aren't just clowning around, they use their skills to commit crime, and once he's in, Cam has no way out. Original action films are hard to come by, as most people are satisfied with all the special effects and dead bodies. It's a genre that really doesn't call for originality, that's why when you come across a film like this, it's a breath of fresh air. The stunts and moves you see in this film are nothing short of magic, and it's star Taylor Lautner did them all himself. We are so used to seeing Lautner as the sensitive love interest in some romanticized film, that it's hard to even imagine him as an action star, but that changes 10 minutes into this film. It's the stunts, the attitude, his characters whole personality, that makes his a unique a-typical action star, and it is really something to see. On the surface, Tracers may be nothing more than another story about a group of burglars, but what they can do is extraordinary, and was really fun to watch. This film is original, fast paced, and brings to light a new action star, who isn't in his sixties or the WWE. It may not have all the bodies and explosions normally associated with this type of film, but as I said, It was a lot of fun to watch."
    },
    {
      "rating": "6",
      "text": "Twilight co-star Taylor Lautner stars in 'Tracers,' a film about Parkouring - the art of being able to do leaps and bounds with physical prowess.\r Cam (Lautner) appears to be lost in life. His mother has passed away and his father, who left him a car - which is his only remaining family possession, left only to never come back. Cam makes a living as a bike messenger. He's also in debt to a local Chinese gang to the tune of $15,000 - money he borrowed to help his sick mother before she passed away, now the gang wants it's money back or else.\r While on his messenger job, Nikki (Marie Avgeropoulos) falls on him, literally. She's parkouring (also known as tracing). She feels guilty about causing him to wreck his bike so she buys him a new one. Cam is intrigued, and attracted, to her, and he locates her, and sees that she belongs to a crew of parkours. Cam, who lives with a local woman and her son and is struggling to pay his rent, joins the parkour crew in the hopes of making enough money to pay off his loan and to give his landlady his rent that is in arrears. But the crew don't do parkouring for fun, they actually use their skill to pull off bank heists. Cam shows them that he's able to keep up with them, and they accept him like one of their own. But Cam and Nikki start falling for each other, even though she lives with the crew's leader Miller (Adam Rayner). This causes lots of conflict within the group, and it comes to a boil when a dangerous jewel heist puts Cam in a position that could cost him his life.\r 'Tracers' premise, parkouring, is an interesting one. The actors jump off buildings, hop from car to car, run at a quick pace, and can virtually do anything physical. Lautner, Avgeropoulos, and Rayner more than ably do their jobs. The plot is interesting, and the movie short enough to not lose your interest (94 minutes). 'Tracers' takes place in New York City and shots of the skyline is one of the highlights of the film. The tagline for 'Traders'  is 'Run for your life.' The actors sure do run for their lives, and you might be a little bit exhausted after watching them parkouring and may realize how out of shape you are compared to them.\r 'Tracers' is now available on DVD."
    },
    {
      "rating": "7",
      "text": "A good movie. Tracers is an action movie that moves well when it's moving. The parkour was fun to watch and I liked the characters. Daniel Benmayor gave me exactly what I expected from this film... some lightweight, yet satisfying thrills and action."
    },
    {
      "rating": "0",
      "text": "Awful movie which damages the Parkour community in so many ways. Police/security will be hot on us more now, it doesn't show the true spirit of Parkour too. Little fact - The title is spelt wrong! It's supposed to be spelt \"Traceurs\".\r Just a remake of premier rush for money."
    },
    {
      "rating": "6",
      "text": "Recycled theme with the bike and Parkour stunts.\r I think the first time I saw a movie that had Parkour in it was the 'District B13'. After that plenty of flicks came, among them this one as well. The movie was about a struggling young bike messenger who meets a girl belong to Parkour gang. Later he joins them that changes his fate, but whether he gets the girl or not, that tells with the thrilling story development and some amazing stunts.\r Ever since the 'Twilight' series, I wanted Taylor Lautner to make his foot steady in his acting career. Because I was rooting his werewolves gang in that movie. His last movie I saw was three years ago, 'Abducted' that did not go well. At least this one looked much better, but not enough. Like always I hope he comes back stronger.\r Considering this film, the story was as old as the cinemas. A reused plot, there's nothing new. More like another version of 'Point Break', but everything was under a limit. Adding the Parkour and bike stunts to it, gives somewhat a new flavour. The young actors and fresh faces were highlights. From coming under the B movie category, it is simply a nice entertainer, but appraising from the out of that, definitely a disappointment. In the end everything is how you look it and what you get from it.\r 6/10"
    }
  ],
  "recommendations": [
    "hotel_artemis",
    "breaking_in",
    "no_escape",
    "the_commuter",
    "live_by_night",
    "beirut",
    "3_days_to_kill",
    "everest",
    "skyscraper",
    "downsizing",
    "elysium",
    "the_rhythm_section",
    "allied",
    "cold_pursuit",
    "taken",
    "mortal_engines",
    "nightcrawler",
    "good_people",
    "limitless",
    "the_finest_hours",
    "free_fire",
    "taken_3",
    "the_first_purge",
    "chaos_walking",
    "end_of_watch"
  ]
}