{
  "id": 4022,
  "title": "Trading Places",
  "starring": [
    "Dan Aykroyd",
    "Eddie Murphy"
  ],
  "runtime": 116,
  "genre": [
    "Comedy"
  ],
  "description": "A snobbish investor and a wily street con-artist find their positions reversed as part of a bet by two callous millionaires.",
  "releaseYear": "1983",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8mBuLCOcpWnmYtZc4aqtvDXslv6.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.428571428571429,
    "ending": 5.0,
    "soundtrack": 10.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.333333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "The ease in which the hilarity oozes from this movie obscures its greater achievement, which is the deft way it presents its plot. It takes a broad spectrum of characters and plays them off each other in a merciless mix of outrageousness and serious restriant. This is textbook on how to tell a story. Top drawer comedy."
    },
    {
      "rating": "9",
      "text": "I enjoyed it throughout. The two leads, (Eddie Murphy the standout), make good chemistry as scientific experiments at the whims of two conniving billionaires. The writing flows and the film never ceases to be mundane or bland like many comedies I know. Where has Eddie Murphy gone now? And Dan Akroyd. They were so talented, and this is a prime example of it."
    },
    {
      "rating": "6",
      "text": "A serviceable comedy about morals and social standards which doesn't give away any exhausting laughter but a few admirable chuckles. It's good intentions still are dragged down by it's slow pace and a slight tinge of unsatisfying character arcs."
    },
    {
      "rating": "3",
      "text": "Many of the jokes fail and those that are funny are played out far too long. Nothing is done to make the \"wrongfully accused\" cliche more believable. There are a couple great scenes, and Aykroyd and Murphy both try hard, but their characters almost never interact with each other. Wasted potential."
    },
    {
      "rating": "8",
      "text": "Trading Places is a very successful comedy as well as a very successful drama rolled into one. The comparison between rich and poor and the way the movie portrays it is well-executed. Some moments feel a bit manufactured and manipulative, possibly even overwrought, but the pros outweigh the cons here. It is just high entertainment of the first degree, with great performances from Akroyd and Murphy and smooth transitions in the story."
    },
    {
      "rating": "7",
      "text": "This comedy succeeds where most comedies fail; it has a plot while also providing laughs. Its sole purpose was to not just provide cheap laughs, but to also tell a story. Murphy and Aykroyd were both good in their roles and overall, I enjoyed this movie a lot."
    },
    {
      "rating": "6",
      "text": "The story and dialogues are too simple, to I didnt enjoy the jokes also. Sometimes the scenes are even very unrealistic."
    },
    {
      "rating": "8",
      "text": "A sort of updating of The prince and the pauper with brilliant Dan Ackroyd and Eddie Murphy in his first and best comedies. The intro sequence showing the chiaroscuros of Philadelphia is for anthology. One of best Christmas movies of ever."
    },
    {
      "rating": "10",
      "text": "Brilliant film, all of the characters are in tune and the script and imperial music complete the enjoyment."
    },
    {
      "rating": "10",
      "text": "Trading Places is one of the best Christmas movies of all time. Enough said. Watch it!!!"
    },
    {
      "rating": "10",
      "text": "Un classico incredibile e indimenticabile. Uno spaccato della società non solo dell'epoca trattata ma di tutte quelle a venire.Storia educativa come poche, puramente per adulti, ma educativa, in grado di mostrare quanto un individuo possa essere condizionato dall'ambiente e quanto sia pesante, nella vita di chiunque, l'unica cosa in grado di donare degli effettivi ed assoluti privilegi, la ricchezza. Film tra l'altro realmente sociale e inclusivo, non come le idiozie degli ultimi tempi che si fregiano di chissà quale inclusività nel loro inserire forzatamente (dandogli un peso folle e irrealistico in modo discriminatorio) certe diversità.Questo film mette tutti sotto la stessa bandiera, pone tutti nello stesso piano, insegnando a guardare oltre le apparenze e al ceto sociale nel giudicare un individuo, insegnando il valore dell'aiutarsi e rispettarsi a vicenda senza buonismi sterili.Se non è natalizio e realmente all'avanguardia questo film nessun film lo è.Capolavoro da tramandare come è avvenuto fino ad ora, del resto \"che natale sarebbe senza una poltrona per due?\"."
    },
    {
      "rating": "9",
      "text": "To comedic talents at the top of their game, team up brilliantly for this clash of culture, comedy classic.Arguably Landis' best movie."
    }
  ]
}