{
  "id": 2900,
  "title": "Traffik",
  "starring": [
    "Paula Patton",
    "Omar Epps"
  ],
  "runtime": 96,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A couple off for a romantic weekend in the mountains are accosted by a biker gang. Alone in the mountains, Brea and John must defend themselves against the gang, who will stop at nothing to protect their secrets.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jwsmeU8mYEP6GpxJ2sbCzc2MQmi.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "This is what you expect from lionsgate people expected the next citizen Kane or Shawshank redemption nope traffik is another excuse by lionsgate it is just a generic kidnap movie and of course its lionsgate quality so its very bad"
    },
    {
      "rating": "8",
      "text": "Traffik is a powerful film that details the billion dollar industry of sex trafficking.  The film should spark meaningful discussions for people who take the time to see it.  While highlighting this global issue Traffik also delivers the base criteria for a film which is being something that is entertaining.  Powerful, compelling, and intense Traffik is something that will pleasantly surprise many people if they first can find themselves attempting to watch the movie."
    },
    {
      "rating": "0",
      "text": "Believe the low raters, it's rubbish.I don't understand how a movie like this even gets on the market! I am not gonna write a extended critic, it isn't worth it, and other people already made the effort explaining why in extend. I must admire that, cool seeing the community fighting back against manipulated ratings!"
    },
    {
      "rating": "5",
      "text": "Bland thriller that doesn't know how to be both a message film and deliver exploitative thrills. So it instead mutes both elements leaving a film that is only intermittenly interesting. The cast tries its best and Paula Patton is terrific. But the film takes disturbing subject matter and mutes the message in an attempt to have it appeal to a mainstream audience. A film that is too tame for its own good."
    },
    {
      "rating": "4",
      "text": "Maintains some tension, but it's just a mediocre film, unfortunately. It does highlight, though, a most important issue, that of the global human traffiking of women, and those in positions of power who choose to look the other way or even share in the profiteering."
    }
  ],
  "recommendations": [
    "antebellum",
    "zero_dark_thirty",
    "spree",
    "run_hide_fight",
    "cannibal_holocaust",
    "mainstream",
    "a_clockwork_orange",
    "equilibrium",
    "chappie",
    "the_lobster",
    "songbird",
    "apocalypto",
    "v_for_vendetta",
    "facing_the_giants",
    "dogville",
    "the_first_purge",
    "war_room",
    "antichrist",
    "overcomer",
    "blood_diamond",
    "the_big_short",
    "cloud_atlas",
    "crash",
    "samson",
    "snowden"
  ]
}