{"id": 1311, "title": "Training Day", "starring": ["Denzel Washington", "Ethan Hawke"], "runtime": 122, "genre": ["Action", "Crime", "Drama"], "description": "On his first day on the job as a narcotics officer, a rookie cop works with a rogue detective who isn't what he appears.", "releaseYear": "2001", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/bUeiwBQdupBLQthMCHKV7zv56uv.jpg", "categories": {"plot": 8.470588235294118, "acting": 8.545454545454545, "ending": 8.75, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 9.5, "action": 8.666666666666666}, "reviews": [{"rating": "10", "text": "This is one of the best movies ever. Seriously, Denzel and Ethan Hawke were amazing and the whole concept of the movie was great. The supporting cast took me by surprise when Dr. Dre and Snoop Dogg made appearances and they were actually reasonably good. The action, the one-liners, the immortalized ending, the shady characters, the fact that this was filmed in the real gang areas in LA, and the look into the face of evil (Denzel) really made this movie shine. Amazing, and I recommend this to anyone who doesn't mind a whole lot of cussing."}, {"rating": "10", "text": "Great film! Without a doubt an instant classic that could stand amongst the likes of End of Watch and The Departed as one of the all time great cop thrillers! Also boast one of Denzel Washington's best performances!"}, {"rating": "10", "text": "This movie defines the essence of the thriller genre. The moment Denzel Washington speaks his first few lines to Ethan Hawke immediately grip my entire attention. They govern Training Day and it's definitely a treat to have them as the lead roles. This movie is definitely one of the most enticing, on-edge films of all time. This is a movie that should not be dismissed."}, {"rating": "10", "text": "Training Day is absolutely one of the best gangster movies ever made, from acting to story it's perfect. Denzel and Ethan are both great in this cat and mice chase filled with thrills. The film is totally fresh with absorbing lore in all of its dynamics and suspense. The film targets many perspectives of New York deep down dirty gangs and director Antoine Fuqua has made his subject very detailed. The Best Gangster Film since The Godfather."}, {"rating": "10", "text": "Amazing dark cop drama. One of the best \"corrupt cop\" movies there is. For everyone claiming it is too over the top and unrelalistic.... please look up the LAPD Rampart scandal, which is what inspired the film."}, {"rating": "10", "text": "A tale of danger and crime, Training Day is good at demonstrating cops fighting gangs in Los Angeles. Not only does it teach us the dangers and crime of Los Angeles, it takes arresting criminals seriously. I was disappointed Denzel Washington turned out to be a antagonist despite his impressive performance, but he was even more impressive at his script and dialogue."}, {"rating": "10", "text": "Denzel Washington is amazing with his corrupt cop role. Whole movie he's trying to make Ethan Hawke (and YOU) believe in his truth. In the beginning he's successful and you think that he's not that bad, but in the end you see his true face. Well deserved 10/10 I think."}, {"rating": "9", "text": "Before movies like \"The Departed\" and \"The Town\" comes a riveting and intense cop thriller. This movie blew me away with it's great story and tremendous acting form Ethan Hawke and especially Denzel Washington. Overall, it's a cop thriller that's got the goods. Be sure to check out my YouTube channel \"TheMovieManLife\" for all things movies."}, {"rating": "7", "text": "Denzel Washington is just so smart and charismatic as the cocky macho cop Alonzo Harris, he usually plays good guys but in this material he just is so good as a villain. Ethan Hawke is quietly impressive as the rookie Cop Jake Hoyt. This is Antoine Fuqua's best movie"}, {"rating": "9", "text": "good cop, bad cop, crooked cop. Denzel and Ethan were masterful actors in this movie. yes including snoop dogg. what an incredible storyline and a twist ending. dont ever burn the wrong bridges. watch this before you die."}, {"rating": "10", "text": "inigyfigfuugyfyfguguihhihiihonfytderyutlihiibvjguydtfugugjgufydtdguugugguugugugugugufyft"}, {"rating": "10", "text": "One of my top 5 favorite movies of all time. Awesome story, perfect acting. Denzel Washington is my favorite actor and Hawke did great too. Lots of quotable lines in this movie."}, {"rating": "10", "text": "This movie was absolutely amazing. It was a drama with hints of comedy and an array of action."}, {"rating": "8", "text": "Grit and power in its finest form in a police tale is exemplified in  Antoine Fuqua's  Training Day. Never has the line between right and wrong on the streets of LA been more poetic and  indulging. Denzel Washington is captivating in his role as Alonzo the mesmerising hard faced detective willing to go to unsettling methods to reign in the narcotics line bulging through the drug dominated neighborhoods our protagonists drive through. Ethan Hawke is also perfectly cast and a first day on the job trails for Washington's unit. His upstanding ethos twinned with his Innocent damaged gaze gives the two leads their Shakespearean explosiveness and appeal. Fuqua's real triumph however dwells in his shooting of an authentic  LA. The city being the muse and center of the film. The real people , the culture and the threat of their lives are entangled in our characters story. A massive step forward in film making. You have never seen anything like this before. Enthralling entertainment."}, {"rating": "9", "text": "Easily one of the best cop dramas there is. Denzel eats the screen as the charismatic but unhinged Alonzo Harris and Ethan Hawke as almost parallel of Harris in Jake Hoyt, the wide-eyed rookie who has no idea what he's getting into. A film that tugs at your morality, keen-fully displaying both sides of the moral coin and the presence of deception in the midst of trustworthiness, where justice prevails and injustice fails."}, {"rating": "3", "text": "Although the two central characters can hold the film, the rest falls by the wayside."}, {"rating": "8", "text": "Dang. Brilliantly acted, though the first 30 minutes are slow, but as you get into the film, you see why they were necessary. Not entirely what I expected, but all the same, great entertainment."}, {"rating": "8", "text": "One of the best crime thrillers I've ever seen, Training day would have gotten a 9 from me had it not become somewhat sloppy in the last couple of minutes with a generic cat and mouse chase scene.  Unlike most of his roles Denzel Washington's Alonzo Harris is an absolute monster.  Cruel, violent, deceitful, and downright nasty, he makes other loose cannon cops like John McClane seem like SpongeBob in the episode where he becomes a hall-monitor.  Denzel rightfully earned an Oscar in this role.  Dafoe also does a great job, which earned him an Oscar nomination as well.  This movie is a gritty, exhilarating, and extremely well crafted thrill ride.  There are plot twists and turns you won't expect, as well as lots of memorable dialogue and action.  Corruption and morally ambiguous situations literally stuff the film, which makes it as thought provoking as it is visceral.  Near the ending there is a generic and basically pointless chase scene which took up enough time to force me into giving it an 8 instead of a nine, but don't let this quibble discourage you from seeing it.  Thanks to Training Day, the next time I walk into the DVD store, I know which movie I'm looking for first."}, {"rating": "7", "text": "Training Day Triumphs.\rBetween the crafty, gritty performances of actors Denzel Washington and Ethan Hawke; Training Day is victorious with a blazing plot."}, {"rating": "8", "text": "Training Day is the perfect example of a crime drama done right. Great acting performances, solid action scenes, interesting and engaging story, realistic characters and a perfect ending. If you like police dramas you should definitely check this one out."}, {"rating": "9", "text": "I was really surprised. A truly dark heart-pounder! Excellent direction by Antoine Fuqua. Denzel is a very good bad guy but goes over-the-top a lot! Hawke is great in a simple way. This is a very dark and gritty film that isn't for everyone. Not enough action to please the blood thirsty, to dark and gritty for others, for art film fans, its pretty good. I HIGHLY recommend this film!"}, {"rating": "10", "text": "Denzel was excellent in this movie, this is just to show us how versatile he can be, i take my hat off for his performance. This movie showed us that everything that glitter is not gold, sometimes we are not protected 100% from our law enforcement dept, like the movie, our nation has had it's share of criminal cops."}, {"rating": "8", "text": "Stretches the bounds of credibility but it's still gun-blazing entertaining and in spite of its excesses it still has the ring of truth to it... that there is a lot of BS to being a cop in LA but justice somehow wins its small victories. Reality aint  pretty, justice aint pretty but if you want pretty, you just gotta stay away from ugly."}, {"rating": "7", "text": "Rookie cop has first day on job with \"maverick\", teaches rookie to be streetwise, dodgy methods, rookie gets suspicious.Not as good as I'd heard but still a watchable buddy cop film gone wrong.Denzel Washington is brilliant (is this guy ever rubbish??) & Ethan Hawke comes out ok too. Lot of good cameos including Tom Berenger, Snoop Dogg, Dr Dre & Macy Gray.It did have a familiar feel to it whilst watching it even though I'd never seen it before & I assume because it wasn't all that original."}, {"rating": "10", "text": "Brilliant acting by Denzel Washington and Ethan Hawke in an extremely well written movie. Critics who gave this movie any mark under 90 are certainly living inside a bubble."}, {"rating": "7", "text": "This is not my kind of movie, but this movie is really good and it worth watching, is not just a cliché, really amazing, with good acting and a good script."}, {"rating": "10", "text": "Absolutely loved it. Denzel is a badass. What more do you want? Well, drama, lots of it too. In addition to great acting and drama, all this **** revolves in one day and will have your mind spinning and confused. Fresh, certified by me!"}, {"rating": "10", "text": "This is the kind of movie I hope to watch on a Saturday. This is a must watch for movie lovers! Denzel really digs into the character, showing his rookie partner how to do the job but as a corrupt cop."}, {"rating": "9", "text": "\"Training Day\" is the story of Jake Hoyt (Ethan Hawke), an LAPD rookie who is looking to join a top-notch narcotics squad led by Alonzo Harris (Denzel Washington). Harris gives Hoyt one simple task; accompany him on a one-day ride-along where he must prove himself worthy of enlistment. Now from this point on the movie maintains a steady level of immense entertainment. The most noteworthy aspect of this movie is Denzel Washington's Academy-Award Winning portrayal of Alonzo Harris; the rugged cop that has seemingly blurred the line between what is right and what isn't. His performance is as charismatic and imposing, as it is chilling and antagonizing. Every line that Washington delivered was either intensely funny or incredibly demented (but still funny). Which brings me to the script; \"The Fast And The Furious\" writer, David Ayer, delivers deeply provocative dialogue, as well as a compelling narrative that delves into some very insightful themes. The main theme of the movie, however, seems to be a blend of the \"Crime doesn't pay\""}, {"rating": "10", "text": "I finally saw “Training Day”.  Upon looking it up, I realized that this movie is coming up on 15 years old, but I swear it looks like something that just came out.  This tale is amazing.  I don’t mean to say that it was full of surprises, because if you pay close enough attention and you have a good sense of how film works, you should be able to guess how the story is going to play out, but it still felt so fulfilling getting to experience it as it unfolds.  Yes, it is gritty, and yes, it feels way too much like a template for the modern police brutality that is all over the news today.  Also of note, this is the most stereotypical take on race in America that I have seen since the ‘80s, but if there is any way that you can look past that, it is just so good.  If you don’t mind the violence, then it should be a no brainer to watch “Training Day”, if you haven’t already."}, {"rating": "10", "text": "One of my favourite crime movies with a dense and intelligent story. Also the actors are top."}, {"rating": "10", "text": "Denzel Washington had one of the performances if you ask me.  A lot of people may not agree with that but he won the Academy Award for it.  Ethan Hawke was also a great actor in this film.  Great plot as well with a lot of twists.  This is a must see."}, {"rating": "9", "text": "Training Day is a classic. Denzel Washington is electric in his role as Alonzo Harris, which is one of his best roles ever. He displays such amazing intensity as this character. I was fixed on the screen as soon as I heard Denzel's first line. Washington some of the most memorable quotes in this movie. Perhaps the best police film that was ever released. I could watch this film over and over again and find something new in it each time. Alonzo Harris is so unpredictable and is probably my favorite anti-hero in all of film. Training Day will leave you guessing until the very end, where it concludes just as suddenly as it begins."}, {"rating": "7", "text": "There's no doubt that you can't enjoy Training Day without having someone to enjoy it with you because they're just making you want to enjoy it so you can like the movie. Training Day is another film I would love to make everyone see."}, {"rating": "8", "text": "A film that displays the tug-of-war of morality and the presence of deception in the midst of trustworthiness, where justice prevails and injustice fails."}, {"rating": "7", "text": "Denzel Washington is just so smart and charismatic as the cocky macho cop Alonzo Harris, he usually plays good guys but in this material he just is so good as a villain. Ethan Hawke is quietly impressive as the rookie Cop Jake Hoyt. This is Antoine Fuqua's best movie"}, {"rating": "8", "text": "its not what you know, its what you can prove..Training DayDavid Ayer's anticipated vision communicates straight and crystal clear to the audience where they are instructed to hold on to their seat belt and join the journey of a day along with these amazing lead characters that never fails to surprise. Antonie Fuqua is in his A game and doesn't disappoint at any frame of the feature holding the audience with wide open eyes for 2 complete hours. Danzel Washington and Ethan Hawke have put their soul into these parallel roles to an extent that the performance overpowers its explicit screenplay. Training Day is brutal, raw and dark natured feature that endorses its upcoming events in a subtle way that is unpredictable yet with genuine reasoning and soul that surprisingly has no barring and no rules just like its streets."}, {"rating": "10", "text": "Denzel just doing his thing in this film. Ethan Hawke is incredible as well. Not enough love for this film. Training Day should be in the 80's range. Watch it. You won't regret it."}, {"rating": "8", "text": "Interesting film that I came across by accident. I'm glad I watched it, though. I liked the plot, and that's about all I would highlight. Don't expect any flashy action here. The pace is slower. This is exactly what hit my taste though, as I prefer slower films that climax at the end. As I said, I thought it was an interesting plot and I was even surprised at how it ended. For me, a great film that I can recommend to fans of the crime genre."}, {"rating": "10", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"}, {"rating": "8", "text": "Training Day is a great movie that has Denzel Washington at his peak of villainous roles era."}, {"rating": "9", "text": "Maybe the formative film of corrupt policing and vile street life. A pioneer in the intersection of black and white culture in LA, the movie is an incredible movie to watch. Very entertaining, has the mind blowing elements of a whodunnit, while keeping the gangster feel of other classics. Fantastic film."}], "recommendations": ["heat", "the_fugitive", "black_mass", "street_kings", "the_equalizer", "donnie_brasco", "american_gangster", "man_on_fire", "triple_9", "jack_ryan_shadow_recruit", "gangster_squad", "casino", "inside_man", "breach", "insomnia", "safe_house", "lawless", "rush", "the_foreigner", "black_and_blue", "a_few_good_men", "widows", "shooter", "hell_or_high_water", "american_made"]}