{"id": 1529, "title": "Trainwreck", "starring": ["Amy Schumer", "Bill Hader"], "runtime": 125, "genre": ["Comedy", "Romance"], "description": "Having thought that monogamy was never possible, a commitment-phobic career woman may have to face her fears when she meets a good guy.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/wrY629UTCUAKLJ4CxQXz6DCE7pr.jpg", "categories": {"plot": 3.8285714285714287, "acting": 4.282051282051282, "ending": 3.8, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 3.683333333333333, "action": 3.5}, "reviews": [{"rating": "5", "text": "Meh, when I saw that it has good mark (75 is pretty high) I thought that it's worth to watch. Damn it, I was so wrong.\rThe review must be 150 characters long, that's why I wrote this line."}, {"rating": "0", "text": "Utter garbage. This woman is a one trick pony. \"I'm a chubby girl and I am promiscuous.\" That's all any of her stories are about and it's so damn boring! WE GET IT! Not one bit of cleverness to be found. Comedians are just as lame as Hollywood when it comes to obsessing on the latest shtick."}, {"rating": "0", "text": "One of the worst movies of the last ten years. Stupid and pointless, Schumer simply ins't any good. Her character could have been played by a thousand other women. The only reason she has any career at all is because of some serious family connections. This monstrosity would have been passable if they had cut two hours from the run time...."}, {"rating": "5", "text": "I don't know but I expected something more out of this, maybe it was good as a romantic movie, but as a comedy, it wasn't that funny, aside for some episodes with Lebron or something like that, which wasn't that important to the main plot. Main plot itself actually was quite predictable, I mean like from the start, if you have seen the trailer or read anything about the movie, you know what will happen, that's why I didn't like the movie itself that much, I mean, at least make more funny jokes and make it funnier - it was an ok movie in my opinion. Amy Schumer's acting was better than I expected though, but still, not impressed."}, {"rating": "3", "text": "It's amazing how stupid the plot of this movie is.\rA lost girl who behaves like a jerk (the why being explained by the funniest scene of the movie with the father) falls miraculously in love with a doctor who is :\r- rich\r- nice\r- patient\r- single\r- knows celebrities\r- has big male parts\r- fit and handsome.\r And she decides to hold on to him.\rYeah ok.\r Did the writers realise how much what they wrote is a big joke ? Did the producers ? Did the actors ?\rAs for the rest it is uptight boring Apatow movie for uptight boring people who live in their New York bubble and affiliated."}, {"rating": "3", "text": "Trainwreck is quite a fitting title for this film. When it's not bad, it's bland, and when it's not bland, it's wincingly cringey. Definitely not a good comedy, and way, way too long of a runtime for what it is trying to do. You will suffer through these two hours."}, {"rating": "0", "text": "Bill Hader is fantastic, but he alone can't carry the comedic corpse that is Amy Schumer."}, {"rating": "5", "text": "my safe word is \"pineapple\"..TrainwreckTrainwreck has a lot to offer and certainly has a soul of its own but it definitely isn't fit for 125 minutes even though it may have a satisfactory purpose; it needs better editing, better cast and a tight screenplay."}, {"rating": "4", "text": "Trainwreck is just painful to watch at times. Amu Schumer is NOT a leading lady and it has nothing to do with her looks, which is what feminists will claim. She is, quite frankly, obnoxious. Surprisingly she isn't a bad actress but too often her true personality comes through and, as a protagonist, it destroys much of the film. I think she would be better suited for the obnoxious friend of the main girl. Bill Hader does a solid job but is mostly forgettable. Honestly, the only reason this film is worth watching is for the plethora of celebrity cameos, highlighted by LeBron James. They all play versions of themselves in hilarious skits that fit neatly into the plot. If it wasn't for James, John Cena, Amare Stoudemire, etc. this film would be among the worst comedies I've seen in recent memory."}, {"rating": "2", "text": "o k, this is not the worst movie i've ever seen, but that doesn't stop it from being a total waste of time.  simply put, there is nothing remarkable about this film.  Eddie Murphey launched his film career with 48 hours - a film i laughed all the way through.  Amy launched hers with this \"trainwreck\" of a movie, supposedly a comedy, which i did not laugh once at.  trainwreck is not only it's title, but it's rating as a film too."}, {"rating": "5", "text": "Instead of watching this movie just go watch Amy's stand up.\r I am a fan of Amy Schumer and enjoy both her stand up and her TV show. I had seen generally positive reviews of the movie and my girlfriend and I were both excited to watch it. It seemed like a perfect movie that could have a balance of both comedy and romance.\r The movie follows Amy whose main claim to fame in the movie is that she is a slut. She meets Bill Hader's character, and decides being a slut isn't all that it is cracked up to be. The general plot and final outcome (spoiler they find love!) was never in doubt. I was just hoping that going from points A to B in the movie would be entertaining. It was not. There are points of humor in the film, but that are few and far between. Most of the film is just plodding and drags out. There is a cheer leading scene at the end that makes absolutely no sense and just drags on. There is nothing novel or interesting about the movie."}, {"rating": "5", "text": "The same old romance formula, but a woman's version.\r I never saw the trailer, but I thought it was Rebel Wilson's film, that's who I saw on the poster and decided to go for it. In the movie she never came, then realised I was tricked or I failed to pay attention while choosing the film. So then, who the heck was this actress. Never seen or heard before, Not so romantic or funny, totally boring. I thought She might be Will Ferrell's sister. I'm kind of frustrated because of either the movie or the actors were not excited to keep going with my watch.\r This is the same old story, but instead it's a woman's version. A playgirl loses the someone who loves her sincerely for what she's and later finds the one true love of her life, but it ends in a disaster due to her past. So how everything is going to be fixed is what brings curtain to the narration.\r It might be a well known plot, but a well crafted movie as well by one of the best comedy filmmaker who has given many awesome ones. Despite his effort to make it big it is also his bottom of the list from his filmography. Well, not all the actors were so bad, John Cena was so funny with his gay jokes, but lot like in a guest appearance. The basketball superstar that I don't know him. Definitely better than average only if a quality movie like this would have had a proper lead actress. I think some people would find it hilarious, but not to me and I wanted to like it, but I couldn't.\r 5/10"}, {"rating": "4", "text": "I expected a lot more from this movie. I love Bill Hader, but he couldn't save this movie. It was less of a comedy or even a rom-com, it was just a straight up drama at the end and I think that's where the film fell flat. Half of Amy Schumer's jokes just weren't funny, and it sucks because it had such great potential. On top of that, every character felt flat. Part of this comes from the fact that Amy Schumer plays a character named....Amy. It's hard to feel for such 1-dimensional characters and that hurts when you have such a great cast."}, {"rating": "5", "text": "The comedy is very hit-and-miss, the story wasn't too interesting as a whole and none of these characters are really that likeable or relatable, especially Amy. A few good moments but on the whole, pretty mediocre at best for me"}, {"rating": "3", "text": "It's exactly what it calls itself, a Trainwreck. It's unfunny, boring, and predictable.....comedy. This is aimed at a audience for specific, that it would be pretty boring for anyone else."}, {"rating": "1", "text": "I expected this movie to be interesting and funny considering all of the hype around it. Unfortunately, the movie was rather boring and frankly disgusting. I am not an easy disgusted person, but really, how many lewd sex jokes can you fit into a movie? This brand of comedy isn't for me, I guess. I just wish that the overall movie had been interesting so I could have something to follow along with between the non-existent laughs. It just felt that the movie tried so hard to shock me, but really it fell flat on its face. Maybe it could shock my 70 year old grandmother...."}, {"rating": "5", "text": "Trainwreck is appropriately titled. Amy Schumer who works for a satirical magazine has to do an article about a sports doctor who is played by Bill Hader. Schumer's character is a women in her 30's who doesn't care much about relationships with men. Bill Hader plays her so called love interest in this boring 2 hours comedy. The only real bright spots were cameos of Lebron James and Marv Albert.  Comedies seem to be going completely in the toilet lately and this is one of them."}, {"rating": "2", "text": "In addition to a tiring overload of 'F' bombs in the first 30 min (I lost count), this movie lacks laugh-out-loud moments and believable romance. Maybe because white trash drunks are boring in real life, I found Amy Schumer's character more sad and boring than funny or interesting to watch. Bill Hader's comedic talents are not present in this movie, and his \"doctor\" character goes rapidly from his own boredom with Amy's character to being suddenly and inexplicably ( within minutes) ready to go out for dinner and a drink with her. There's no believable transition into this romance. Poor, sad Amy just didn't have a sports doctor to show her how great life really is? Unh-hunh. okay. We didn't make it through the whole thing....fell asleep as soon as Bill and Amy went out for their first drink."}, {"rating": "0", "text": "While the cast is amazing except Amy Schumer, the film is nothing but worse than mediocre. And even god awful in plenty of moments. Through the story it felt like I'm watching her ego wank. It was a painful experience."}, {"rating": "0", "text": "Wikipedia says that that movie - comedy. Then where I need to laugh?\r2 hours of boring.\rAnd why so many guys want main character? She is ugly as death."}, {"rating": "5", "text": "LOVE Amy S. but the funny parts were just too few and far between.  This movie was plodding and dull when she wasn't doing her humorous lines.  Her boss's character was excellent though, and reminiscent of Meryl Streep playing Anna Wintour, but the rest of the movie and characters were just not that funny.  Hoped for more."}, {"rating": "0", "text": "This MOVIE was a train wreck!!!!!! Amy Schumer is fine but the movie is a b-comedy, one you've seen before a million times. It's astounding how hollywood keeps dishing out crap! I supposed it's because of people like me who waste their money on movies without checking out the AUDIENCE reviews first.  The critic at NY Times must have been throw some serious cash or perks to give this dog a good review! PASS on this!!!!"}, {"rating": "1", "text": "Amy Schumer was A-mazing!! She is brilliant... brilliant expressions, reactions, etc... This movie, however, sucked. It was wayyyy too long and it had the same ridiculous plot that you've seen in cheesy b-movies\rfor decades. Girl afraid to commit, falls in love, pushes guy away, big happy revelation at the end.\rIn between it all... was a lot of nonsense. Again, typical bad comedy crap. The best part of the movie was Amy's performance. She was great... this movie was not. Totally disappointed. Shocked by the favorable reviews the flick received."}, {"rating": "0", "text": "Not a good sign when the funnier lines of the movie are delivered by pro athletes.\r An even worse sign when one of them is a wrestler.\r Amy Schumer isn't funny. Sorry, but you all need to hear it."}, {"rating": "1", "text": "Honestly, I never had heard of Amy, but my girlfriend really wanted to see this film so we went. Right off the bat, it was apparent that the crowd at the movie was made up of big fans of her's. Most people laughed at EVERYTHING she said, at all times. I thought it was really strange, like I was in a psychology experiment. Anyway, the movie was terrible in my opinion, and was just a girl version of a raunchy comedy made for guys. There was a scene with a famous sportscaster that made me cringe harder than anything in a film ever has before, it was just SO terrible. Also, it felt like I was watching this thing prattle on for 4 hours. Skip it."}, {"rating": "2", "text": "Not sure how this garnished a 75.....really makes me doubt Metacritc ratings....I'd give it a solid 20 at best, and that is pushing it. I do love Amy Schumer, but this movie really really stinks"}, {"rating": "4", "text": "Pardon me for not jumping on the Amy Schumer bandwagon, but she is one more example of a supposedly \"daring\" comedian who is actually quite status quo and mainstream. The perfect complement to director Judd Apatow who litters his tales with dirty words and sex but is actually as innocuous as a Kate Hudson rom-com from the last decade. In fact, I would argue that BRIDE WARS has a more cutting and daring message to deliver than TRAINWRECK or any of Schumer's or Apatow's work. Pile on to that, TRAINWRECK is simply too long, lethargic, and just not very funny. And perhaps worse than anything, poor Brie Larson, who is quite the actress, is here relegated to playing the sister/homemaker with no bite or attitude. TRAINWRECK just made me feel sad in an unintentional bad way. Perhaps we will soon get the truly daring female comedian we really need. Otherwise, I'll stick to ROSANNE re-runs."}, {"rating": "1", "text": "What did anyone find funny in this tripe.It was rubbish!!! There were no jokes, and definately no humour.This was over two hours of my life I won't get back. PLEASE  no train wreck 2. Robert P."}, {"rating": "2", "text": "I guess this is what passes for comedy these days, a bunch of skits thrown together with a minimal story. Half of this crap could have been on Inside Amy Schumer. Just not that clever, No farcical climax or uproarious plot development. Just the usual Twitter-style snarkiness which was wearing thin years ago.\rGiving this two stars -- one for a wonderful, unexpected and joyful performance (actual acting!) by Bill Hader. Just great. Also, LeBron was a hoot as the sensitive sidekick, albeit a cheapskate. He gets the other star.\rAmy Schumer? Not so much. I like Amy's show just fine but she'd desperately needs acting lessons if she's going to be on the big screen. It was painful to watch her squinty grimace pass for sad, mad, indifferent, sexy, bored. Maybe even happy.Absolute zero depth to her performance, about the depth needed for stand-up."}, {"rating": "0", "text": "If you are brain dead, like potty mouth sophomoric humor and want to waste 1 1/2 hours, this movie is for you.  If this is the type of movie that young people think is funny, we are definitely on a great social decline. Sad to see so many good reviews of a disgusting movie."}, {"rating": "4", "text": "Though many say it was funny I did not. But for a guy I liked how Amy S. found true love and especially when she tried to be a cheerleader at the end to show she has a heart. Lebron James movie debut was amazing he was a great actor."}, {"rating": "0", "text": "TrainWreck - What an appropriate title. I felt I needed a shower after watching it.\r Guys, while each of us should occasionally take our spouse or significant other to a chick flick, this is one to avoid at all costs. I don't care how much LeBron or other athletes are featured, this is one disgusting trainwreck of a movie.\r It was just not funny... You could hear short bursts of supportive (I guess Amy Scheuer fans) laughter from the same pockets of women in the audience. I realize it was a chick-flick, and I was definitely taking one for the team, but I would have sat through 10 hours of \"Fried Green Tomatoes\" before seeing this disaster again...\r As you watch Amy Schumer and each of her conquests, one just can't help but think that each of these guys would fall head over heels over her, especially when the character she plays would be human petri dish of bacteria and viruses..."}, {"rating": "0", "text": "What a revolting sleazy little film.  So gross. So tasteless. So unfunny…..and all of it carefully packaged in an aggressively  “How dare you not find this hip\" ........ Not so much a film as a kind of desperate \"commodity\" for desperate times, like a series of really bad Saturday Night Live “zany” sketches at their ham-fisted, bottom-feeding worst. I walked out....who needs this garbage !"}, {"rating": "5", "text": "As much as I love everyone involved in this film from Amy Schumer and Bill Hader, to Judd Appatow and even LeBron James, this film felt like a generic rom com. Nothing makes this film very special. It's got fine acting and a fine story, but nothing more. Some jokes fall flat and Amy Schumer isn't her usual self. Also, being a native New Yorker, this film advertises NYC to an extreme (and annoying level) and has a dated reference to Amar'e Stoudemire being on the Knicks. He's been on two teams since. Just shows for a lack of editing. Overall, I was disappointed with this flick, but it isn't a total failure, because of the acting, story, and a few jokes."}, {"rating": "2", "text": "This movie was actually boring and annoying and mostly not at all funny..  Amy may be \"hot\" right now, but she can't act at all. It appears that she is capable of only a single expression on her face.  I really wanted to like this movie, but it wasn't possible.   Also, the gratuitous \"humping\" was about 3 humps too long.  Not that I don't like male posteriors, but how many do we need to see to get the point that she is promiscuous.  LeBron and Tilda did fine jobs and were the highlights of the movie.\rAs a comparison, I thought Ted2 was hilarious!"}, {"rating": "0", "text": "Movie sucks. I am waiting for the day when Amy Schumer is no longer relevant. Can't stand her. I actually don't mind Bill Hader but he wasted her. Can't believe that people actually think this or Schumer is funny. F her"}, {"rating": "5", "text": "“Trainwreck” centers on  Amy Schumer’s character, also called Amy, who was taught by her father (Colin Quin) that monogamy is not realistic or normal and we next meet her 23 later when she is the male version of most leads in romantic comedies such as Jim Carey, Will Farrell and that ilk. She is rude, crude, very promiscuous and doesn’t believe in spending a whole night with any of her tricks. (I did/do identify with the latter!)\r Schumer also wrote the script which is basically ‘boy (Bill Hader as Aaron Conners) meets girl Hollywood cute, boy loses girl so the boy gets girl ending can happen. Whether it is due to Schumer, or the director Judd Apatow, there is a lot of male nudity, mainly full backsides, with one exceptional funny almost frontal nudity, and very little female nudity though Amy is shown in many sex scenes--almost always wearing a bra if not fully clothed.\r Billed as a comedy I will say the audience, consisting of equal men and women, were laughing through most of it. I smiled here and there but didn’t have a really good laugh until 1 hour and 55 minutes into the 2 hour and 2 minute movie. I was also touched in 2 scenes and shook my head in a couple of scenes that seemed to be from another movie.\r This is the first time I have really seen Amy Schumer and I enjoyed her performance but wondered if in real life she only wears too short skirts! I admired Bill Hader in last year’s “The Skeleton Twins” and he has a lot of  chemistry with Schumer. Watching her first serious relationship, and the problems she has with it, makes for a different romantic comedy as does the leads not being pretty picture actors.\r Due to Hader’s profession in the movie, as a sports medicine doctor/surgeon, there are a lot of  cameos by sports names plus, as usual, in any Apatow movies there are cameos by names who don’t get billing until the end credits. Of the sports figures in the movie LeBron James has more than a cameo role playing himself as a skinflint cheap, and concerned friend of the doctor, being naturally funny and has a one on one basketball scene with Hader that cracked the audience up! Also in the film is Brie Larson as Schumer’s sister who is the complete opposite in her relationship of Amy with her husband,  Mike Birbiglia. John Cena’s as Amy’s dumb, muscle bound, everything he says comes out with gay connotations, current friend with benefits and Tilda Swinton as her very strange boss are welcome additions as are Randall Park and Vanessa Bayer as co-workers. Norman Llyod, a 100 year old actor who has been working since 1932, adds some humor as a resident of the old folk’s home where Amy’s father is living.\r Now, in the genre of “Bridesmaids” and “Spy”, “Trainwreck” furthers the reality that women can get as low as men. Is that a good thing?"}, {"rating": "1", "text": "The most glaring problem with this RomCom is that it simply isn't funny.  There are a few one liners that got a chuckle out of me, but no belly laughs.  Amy Schumer's brand of comedy doesn't bother me; hell, I loved \"Ted\" and \"Borat\".  The difference is that both of those were funny movies, not a silly vehicle which really didn't capture Schumer's reported talent.  Instead,  it tried to 'shoehorn' it into an old and tired out formula movie.  Nothing to see here, folks, just move along."}, {"rating": "0", "text": "Intensely boring movie with \"surprise\" ending where an insensitive self-involved woman becomes instantly lovable when she realizes that her nasty personality will ruin her relationship with a decent guy - wouldn't all our lives be significantly different if that ever happened?  It's been said before but never more aptly than here - no talent is not enough."}, {"rating": "1", "text": "This move is really boring. Not funny at all, there is no storyline or chemistry between actors. Amy is not funny at all, the best thing in the movie could be LeBron."}, {"rating": "9", "text": "\"Trainwreck\" stars Amy Schumer in this comedy drama about a single lady acting  more like a single man in today’s dating game with able assists from Bill Hader, Brie Larson and John Cena. Written by Ms. Schumer and directed by Judd Apatow, this film amply displays the acting talents of Ms Schumer as well as her extraordinary writing talents. Deeply moving in the relations Ms. Schumer’s character has with her sister and divorced father, the film is able to generate great pathos and sentiment while at the same time causing us to laugh and appreciate each moment. LeBron James, playing himself, has a significant role in the move and together with other notable NBA figures, gives a degree of authenticity and honesty to the story. Most of all it is Ms. Shcumer’s film for she proves once again that the transition from comedy to drama is easier to achieve for a comic than it is for a dramatic star to do comedy.. This is a thoroughly enjoyable film to watch and to experience great writing as well. I give the film 3 and ½ stars and recommend it to audiences and viewers of all ages."}, {"rating": "5", "text": "This movie had many genuinely funny moments, but it was about a half hour too long - in that extra time the plot meandered and became bloated and confused; also plenty of not so funny stuff got introduced, and all of this - which is clearly the fault of one person, the editor - watered down the humor and spoiled a film that was already suffering from the fact that its protagonist is largely an unlikeable person. Occasionally you hear someone say that having a likable protagonist is not important. They're wrong (and I suspect they are jerks who secretly identify with jerk protagonists). We care about the people we like. If we don't like the protagonist, then we don't much care what happens to her in the movie, which basically means we don't care much about the movie. That was pretty much the case here."}, {"rating": "6", "text": "As a fan of Amy Schumer and her Comedy Central series (where she takes amazing chances, the 12 Angry Men parody was brilliant), I was a bit let down by her big screen debut as star and writer. Of course there is a great difference between writing a 5 minute (or 22 minute) sketch and a full length feature, and perhaps under Judd Apatow's (never met a 90 minute film that can't be padded to over 2-2 1/2 hours) direction and guidance, she didn't tighten the script firmer. There are many, many laughs to be sure. And the supporting cast is crammed with talent. All the talk is about Lebron James, but what about John Cena (hilarious), Colin Quinn, Vanessa Bayer, Randall Park, Jon Glaser, Mike Birbiglia, hell, Tim Meadows absolutely kills in the small cameo he appears in...Although the main character is an mess, the movie follows the standard rom-com formula. Couple meet, fall in like, conflict pulls them apart, they get together after one of them realizes that they DO love them..Some scenes could have been trimmed and one, the intervention with Chris Evert, Mathew Broderick and  Marv Albert (YES!!) could have been cut completely. I will admit whatever faults Apatow has as a director, he does let his cast shine from top to bottom."}, {"rating": "8", "text": "I finally got around to seeing this, due to the fact that I was really on the fence as to whether I wanted to see this one or not, because I really enjoy Judd Apatow and his films, but I also can't stand Amy Schumer. It also doesn't help that I'm generally not a fan of rom-coms. Believe it or not, I was actually pleasantly surprised with this one. Not only did Schumer manage to not annoy the crap out of me (for most of it at least), but it also had a lot of really funny moments, great one-liners, and some fun cameos (John Cena, LeBron James, Method Man, even Daniel Radcliffe and Marisa Tomei!) In addition, it also had a surprising amount of heart to it, which I certainly wasn't expecting. Overall, depending on your tolerance for rom-coms in general, you may or may not enjoy it. On the other hand, if you can get past that and you happen to be a fan of Apatow and his previous films, I'd say it's definitely worth a view."}, {"rating": "4", "text": "My heart goes out to those who died and got injured at the Trainwreck screening shooting in Louisiana cinema.\r The story is about a woman raised to believe monogamy isn't realistic finds her uninhibited lifestyle starting to wear thin. When her magazine job leads her to interview a charming sports doctor, she finds herself falling for him - and maybe finding romance is just what she needs in her life.\r Okay I'm just going to say it, I never was a fan of Amy Schumer. I was never a fan of her work and to be honest I'm not such a big fan of her. I don't know what it is but these just something about her that I just can't put my finger on it. I only say I'm not a fan of her because I don't hate her as a person, because right now as I speak shes taking action on gun control because of the Louisiana cinema shooting that was showing Trainwreck. I'm happy that shes calling out this big issue that's still around and how this gun control problem needs to solved. A simple gun can land into the wrong hands. But all that aside I thought the movie Trainwreck wasn't all that great of a movie.\r The movie wasn't written that well, I mean the jokes in the movie got old after awhile. Some people say that the movie was well written but I must disagree. Amy Schumer did okay in the movie but these a couple of scenes in the movie that she didn't do such a great job, for example when shes at a funeral and she starts crying and the tears didn't look even remotely look like it was brought on by emotions the character was experiencing, it just looked like an actress trying to force whatever emotion to force out.\r While watching the movie I kept saying to myself \"Is this real humor?\" because the audience that I was with only chuckled a couple of times. There are a few gay jokes in the movie and that's mostly with John Cena who would say something and then somehow accidentally imply that he wants to have sex with another man and this joke happens too many times in the movie. That's pretty much the joke, now some many think I got offended by the joke but that's really not the case, I can laugh at many jokes that might be offence to some people who take it too seriously. The problem here is that there was no joke, gay was the joke. These many gay jokes out there that are funny if there's a joke behind it but not on it's own.\r Tilda Swinton was the only one to give a good performance in this movie. She did the best of what she had to work with by poor directing and the terrible script.\r The movie is called Trainwreck which is Amy Schumer character, which the movie keeps referencing about her alcohol and marijuana use but we only see her intoxicated in a couple of moments in the movie but after awhile the movie just tells you about it without Amy Schumer acting like it.\r Bill Hader was good in the movie but he didn't do anything special.\r Overall Trainwreck wasn't all that good to me. A lot of people may easily disagree with me on this one but this is just my honest thoughts on this movie. If you enjoyed the movie good for you."}, {"rating": "3", "text": "After all the good critics and seeing a couple of good comedians I was expecting a good movie, sadly I end up watching a predictable story with story telling problems, couple of fun jokes and lot of bad ones.\rToo predictable, too generic and with too many flaws, an extra point because I love Bill Harder."}, {"rating": "6", "text": "Who: Amy Schumer, Stefon, AND HIS NAME IS JOHN CENA, Lebron \"The Man, The Myth, The Legend\" James, and Harry Potter as a dog walker\rWhat: Judd Apatow's worst movie to date\rWhere: Inside Amy Schumer\rWhen (Can I watch again): Meh\rWhy: With more vulgarity than sentimentality, this movie is a step away from \"The 40 Year Old Virgin\" or \"Knocked Up\" and it's hard to truly appreciate unless you are a huge fan of Amy Schumer"}, {"rating": "3", "text": "In the female fight for buzz of the week —Caitlyn Jenner :\" I am woman hear me roar\" vs. Amy Schumer : \"I am woman watch me whore. \"  With all the hype it feels politically incorrect to say Caitlyn wins as Trainwreck jumps the tracks after 20 minutes. Daddy issues leads Amy into a life of drugs and promiscuity - while her jokes act as a buffer  to  her pain. But it never seems real - and the chemistry between Haden and her is nil. Schumer fans shriek with glee while others in my camp wait and wait and wait for her to sober up.  It’s feels like a 0-0 game forced into overtime. Swinton constantly amazes. Lebron holds his own.  And Schumer was incredibly funny on all the talk shows promoting her pic. Spoiler Alert:  I despise when extras break out in applause as love wins out."}, {"rating": "2", "text": "The title fits the movie. The casting was horrible. It felt as though the actors were trying too hard to be characters from a script they did not understand. The movie progressed awkwardly and ended in a way that felt unfulfilling. But hey, maybe I am not the director's audience."}, {"rating": "0", "text": "Worst movie I've seen in a long time. Can't believe anyone likes this crud. America please make Amy Shumer go away. She has a shiite face and not funny at all. Liked Bill Hader performance"}], "recommendations": ["tammy", "no_strings_attached", "the_change_up", "couples_retreat", "good_luck_chuck", "the_proposal", "what_happens_in_vegas", "hall_pass", "dirty_grandpa", "knocked_up", "forgetting_sarah_marshall", "little_fockers", "this_is_the_end", "dinner_for_schmucks", "bridesmaids", "the_dilemma", "identity_thief", "friends_with_benefits", "that_awkward_moment", "funny_people", "the_wrong_missy", "the_break_up", "a_million_ways_to_die_in_the_west", "bad_teacher", "sandy_wexler"]}