{"id": 2114, "title": "Transformers: Dark of the Moon", "starring": ["Shia LaBeouf", "Rosie Huntington-Whiteley"], "runtime": 154, "genre": ["Action", "Science Fiction", "Adventure"], "description": "The Autobots continue to work for NEST, now no longer in secret. But after discovering a strange artifact during a mission in Chernobyl, it becomes apparent to Optimus Prime that the United States government has been less than forthright with them.", "releaseYear": "2011", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/28YlCLrFhONteYSs9hKjD1Km0Cj.jpg", "categories": {"plot": 8.3, "acting": 8.17142857142857, "ending": 8.166666666666666, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 8.6875, "action": 8.192307692307692}, "reviews": [{"rating": "5", "text": "The movie's CGI is very impressive, i'll tell you that. But the movie lacks strong narration to their overly cliched plot and its overwhelming explosions and flashes will hurt your eyes. However, the movie's main criticism is the British girl from Victoria's Secret; in all that 157minutes, she does nothing but screaming and staring at the Decepticons like a brainless moron. The next thing I would need is a another popcorn and Megan Fox."}, {"rating": "8", "text": "Transformers 3, action action ACTION, forget about the plot, Transformers 3 is the best action movie! Tons of special effects and sci-fi action that you feel guilty if you blink your eyes once!3D will be your main choice seriously, though I still think it's a bit expensive, Transformers 3 really show what 3D effects are capable of!I found some parts are not that logic, otherwise Transformers would have win OSCAR!"}, {"rating": "10", "text": "You better start looking for the red carpet leading to the Oscars because Transformers is sure going to be at it's TECHNICAL end.  Michael Bay, with all his grace, delivers one of his finest peaces of contemporary cinema up to date. You wouldn't believe it without seeing it. Close to the end of the film, my friend sitting next to me turned at me and whispered: \"This is beyond Blockbuster madness\". And it made sens. What Bay and his team have achieved is beyond conventional summer movie making. The crafting here is so perfect and detailed  that it pushes and redefines the boundaries of film making. From the chilling sound design, to the godlike visual effects, and perfect attention to detail from Bay's part when choosing his shots.It's an honest work that re establishes what fun is all about when the lights dim down and the screen springs to life.Just... Have fun and don't pay attention to all those lifeless critics who's conceptual fun is merely based on egocentric shallow intellectual show off and pragmatic dismissing of Bay's work. Criticising his editing and shot compositions which are, to a large extent, unique, but welcome."}, {"rating": "7", "text": "Incredible special effects, the argument of the film as usual is not a big deal, but the sound, the battles and action in general were the things that made this movie interesting."}, {"rating": "9", "text": "My favorite movies are Godfather II, Clockwork Orange, 2001, Good Bad Ugly, Raging Bull, and ROTK. So YES, I am a movie snob. But every once and a while I just want a full-on action movie. And you know what? There is a wierd sorta depth here with man-and-machine ala Term2, and you know what? The acting is actually kinda funny for this series. And you know what? That first ten minutes with the battle in Cybrotron leading to those discoveries on the moon in the 1960's. Youn know what? I feel like watching that right now."}, {"rating": "8", "text": "Just like the other Transformers movies plot takes backseat to the action, but honestly you don't watch these movies for the plot, you watch it to see robots fight and things go boom, and trust me a lot of things go boom, the action is intense and really enjoyable, Shia LaBeouf does another fantastic job as Sam, and they replaced Megan Fox with a far better actress, and the humor is a really nice touch as it shows a more human side of the movie and honestly at times had me rolling on the floor, all in all I had a blast watching this, and if you can forgive the throwaway plot you will too, a great action packed and sometimes hilarious movie that I highly recommend you seeing."}, {"rating": "7", "text": "Great film i must say. Ok it is not a drama filled with great emotions or with extraordinary plot but is well developed and with great visual effect that take your breath away. And that is what i was excepting from T3 a lot of special efects."}, {"rating": "8", "text": "Regardless of what people say about Michael Bay the one thing the man knows to do better than anybody is to deliver an action packed cinematic experience. Transformers: Dark of the Moon is the the third outing of the Transformers franchise and is an imrprovement on the much maligned Revenge of the Fallen. Personally, I thought the negativity towards the second film was extremely harsh it's far from the worst film or sequel for that matter. Dark of the Moon is once again a very long film coming in at over 2hrs 30 mins but it flies by and never seems to drag along. The film this time begins in 1961 with the battle between the Autobots and  Decepticons where a spacecraft known as the Ark is launched carrying an invention capable which is capable of ending the war once and for all however it is shot down and lands of the Earth's moon. In the present day the Sam Witwicky (Shia LaBeaouf) is sturggling to find a job after college as he believes he should be working with the Autobots. The Autobots who once again are working in partnership the US military make a shock discovery whilst tracking down Decepticons in Chernobyl. They find a fuel cell from the Ark and after realising the spacecraft surivived the attack Optimus Prime set off to the moon to retrieve the remaining fuel cells and revive an old friend. A discovery regarding the fuel cells leads the Autobots in a race against time to stop the Decepticons initiating a plan to bring their planet to Earth. The storylines have never been compelling and to be fair hardly logical but they are engaging and is sheer entertainment and do bring around some of the biggest action sequences in the cinema to date as thats were Transformers 3 excels. The visual effects are outstanding and its one of the few films i've found were 3D is actually awesome! There's never a dull moment and the action is always on the go and ofcourse there's always a bit of humour added into the pack. The big question coming into this film was could film debutant Rosie Huntington-Whiteley replace a certain Megan Fox as the eye candy? Well let's just say the way she is introduced in this film won me over straight away its unforgettable and whilst she will no doubt be panned in all honesty the role of Sam's sweetheart is more about how hot they look rather than how good an actress they are. The film is an action blockbuster from start to finish and succeeds in that department in every aspect, no doubt Bay and co will have their haters but the film itself does the talking and given the amount of money it has grossed I find it hard to beleive this is the last time we will see Optimus Prime and co!"}, {"rating": "9", "text": "The Best Transformers yet by far. The action and effects were increased. The replacement of Megan fox wasn't that big of a deal, her replacement couldn't act very well also. The film had great twists that a lot of people didn't see coming. Optimus prime is one of my all time favorite film characters and he totally kicks some more but in Transformers 3. some scenes in this movie were a little over the top and weird but other scenes were hilarious. All action scenes were simply amazing and breath taking. I really enjoyed T3 and think it was a redemption of Revenge of the fallen, which was just ok."}, {"rating": "9", "text": "If you are looking for a story here, you'll be disappointed. But, honestly, this is TRANSFORMERS. What did you expect? Transformers isn't supposed to be about a great story story or character development. It's about insanely awesome visuals, explosions, special effects, and action. That is what this movie delivers. Basically, this movie is all about tying up loose ends, making puzzle pieces from the early films fall together, and making you laugh because your suspicions are becoming reality. Or, that's the beginning of the movie. From about the middle onward, it's pretty much nothing but action, explosions, and gunshots. there are a couple funny parts, but they will soon be lost in the mayhem. This movie is all about the action. If you want a storyline, go home, because that isn't what transformers is about. It's about awesome CGI visuals and non-stop action. Sadly, Megan Fox's replacement was the only thing that kept me from giving this a ten because, let's face it. Some think she's as hot, (me) more think she's less, and very few think she's more. (But believe it or not, the blondie was actually a worse actor than Megan was. I know, right?"}, {"rating": "8", "text": "I saw this movie on a date, and me and her had an awesome time. The movie was great, and a just follow-up the first two Transformers movies. Dark of the Moon had it's heartfelt, funny, and just jaw-dropping awesome moments. While the story was not the strong point at all, you'll push it aside because of the special effects and action sequences. Plus, it has Ken Jeong from the Hangover!"}, {"rating": "9", "text": "I thought that this was an exciting movie, with lots of action...pretty good story line.  I'd watch it again when it comes on DVD.  I didn't see this in 3D, but it was still worth seeing it in a theater.  :)"}, {"rating": "7", "text": "I was quite disappointed after I had watched Transformers 3. It didn't reach up to the quality of the first 2 according to me. It had very funny moments, awesome CGI effects and the awesome actor Shia Labeouf. Even though those things are great for a movie, it lacked a lot of other things. To start with, I can't understand why Michael Bay changed Megan Fox to this new dumb blondie with silicon lips. She isn't sexier, and she is even worse at acting according to me. They also made a very weak ending on Megan's career. A few sentences.    This movie showed off the well-known rule \"Awesome things stops being awesome if you get too much of them\". There were simply too much CGI in this movie. The epic moment where you saw one or more transformers evolve or battle aren't gone, but they are everywhere! And it didn't help that the last battle lasted for one hour.    It is worth watching if you have seen the other Transformers, or if you get turned on by CGI effect."}, {"rating": "8", "text": "I never saw the first 2, but I must say this is an excellent movie! They suck you in right at the beginning. The first scene will have your attention for sure. There is a good amount of action and drama as well. At no point was I bored or checking the time. The only reason I couldn't give this a 10 was simply due to not enough Optimus and not enough Bumblebee. Also, much of the movie is predictable if you ever watched transformers as a kid. 8/10"}, {"rating": "7", "text": "Maybe the second was so bad that anything glows in comparison but in many ways this one is much better. There is less useless action throughout, although the last 40 mins do start dragging after the millionth explosion. What Michael Bay seriously misunderstands is action. Explosions do not equal excitement, it is what's at stake and the investment in the characters that makes sequences exciting. Nonetheless I knew the kind of film that I was going to get going in so I was able to enjoy most of it. The plot is much more easier to understand and I did find myself caring for some of the characters. Although just like the previous films, I can never tell who's who when the robots start fighting. It's just clashing metal. This time is was fun though."}, {"rating": "8", "text": "This movie rarely has a dull moment. there are a lot of twists and turns. Figuring Megan Fox left the cast the transformers movies for sure lost some male viewers. But don't be to afraid men. The new girl is smoking hot! The non stop action happens within 1 hour and 30 minutes into the movie. and once it starts it nearly ever stops! They spend a lot of time in Chicago. And while they are their they have a very tough task to handle. And with the rise of the ultimate transformer. This is for sure a award winning movie."}, {"rating": "8", "text": "Transformers 3 isn't Oscar-material, but it isn't anywhere near a plonker of a movie. The CGI is brilliant and some **** amazing Autobot-Decepticon action sequences are featured throughout, the plot line is really quite simple but it does draw you in quite effectively, with plenty of \"**** **** did not see that coming\" moments and an abundance of 'edge-of-your-seat' anticipation moments that really help get you emotionally connected with the characters (my favourite Autobot died during the first half and a universal favourite...I won't spoil this, but there's certainly a very intense moment with Bumblebee, but I won't tell you how it concludes) the actors are brilliant with plenty of big Hollywood names playing both major and minor roles, good and bad, the dialogue is hilarious and the characters are loveable and engaging. The final showdown is everything that it should be and more (it's not Optimus vs. Megatron, although that does happen) and Sam finally gets some real action, being responsible for the destruction of one of the Decepticon high-ups. I do have three complaints. One-The opening sequence that explains the conspiracy behind the moon-landing, it does drone on for a fair while and features a particularly horrible JFK impersonator. Two- Skids and Mudflap are gone! I know that some people found them offensive, but i found them hilarious, and I think they told the first crude joke that my dad has ever laughed at, which was something of a magical moment for me, the least they could have done was kill them off early on alongside my favourite transformer. Three- The Optimus vs. Megatron showdown takes about ten seconds, granted, the previous battle was the big one that everyone wanted to see by that time, but I guess it all comes down to the fact that since RotF, Megatron has been portrayed as a weak-ass **** and that's one thing that I will not forgive this movie for. Ultimately, this is a must-watch, with a brilliant plot to suck you in coupled with kick-ass moments of **** dude, ****s about to go down, **** **** **** and brilliantly choreographed action sequences. Better than any film in regards to action, but I still prefer the original movie when it comes to plot, but all-in-all, if you're looking for a perfectly balanced mix of Drama, Action, Comedy, Plot and CGI-Epicness, you can't ignore this movie"}, {"rating": "10", "text": "This movie is this summers best of all. This movie includes every robot in the transformers movie except the twins. Good luck transformers universe. If only this great movie got a better review it deserves a 100"}, {"rating": "8", "text": "I thought it was a great action flick, actually the first in the series that really captured the essence of the 80's cartoon series which was where it was all at.  The only reason I didn't give it 10 was because the twist was too predictable and the end felt totally cut off, you sit through 3 hours of movie, only to have the credits start to roll, although that said, it was better than the first movie's \"10 minutes of Optimus Prime Speech\" ending.  All in all a fantastic movie, well worth watching, particularly the special effects are just perfect, I found myself forgetting that Transformer's don't actually exist."}, {"rating": "9", "text": "While this movie had its ups and downs I still believe that this is an extremely exciting movie.I watched it at a movie theatre in 3D and I recommend you do so aswell , not letting yourself watch the 3D explosions , sparks and destruction will be letting yourself down. Without trying to spoil the movie, this movie contains some big surprises, betrayal and over the top action scenes. Even my uncle who is a long time transformers fan said it didnÂ´t betray the novelties set by merchandise and the previous movies in the slightess and said it was true to the transformers formula. They manage to slip in comedy here and here and me and my uncle couldnÂ´t help giggling and looking at each other. Although I want to stress that it is not the best transformers film and the story is somewhat up and down. I recommend watching it at cinemas in 3D, donÂ´t know if I could say the same about DVD."}, {"rating": "8", "text": "Entertaining enough, but with iffy acting and a very long running time. Nevertheless, it's a wondrous bit of fun with incredible special effects that could even merit it an Oscar. But only in that field..."}, {"rating": "7", "text": "This is proberly the best transformers made to date, the action scenes are epic the amount of transformers involed is amazing and the acting is of an okay standard. If you go into this movie expecting movie of the year you will be disapointed, but if your looking for a fun way to kill a few hours then this is a good way to do it. Be warned though there is no Story, its very basic and dosent hold merit. But the voice acting cast do there bit in portraying the Transformers well. Its fun while it lasts."}, {"rating": "7", "text": "This movie was just OK. I found the plot lacking many things, and there was for the most part, poor acting. The only reason why I somewhat liked this movie was the action scenes in the movie. These scenes were incredible and were awesome in 3D."}, {"rating": "7", "text": "After the horrible 2nd installment of Transformers, my hopes were not high for third chapter. Maybe it was my lowered expectations, but I liked this movie a lot more. Special affects are spectacular. It also helps that they finally got rid of megan Fox, THANK GOD. Although she is easily replaced with another forgettable model, she doesn't irritate me the way Fox does. McDormand is too good for this movie and skates by with practiced ease. However, it is a great summer popcorn flick."}, {"rating": "10", "text": "Transformers 3 is an excellent action movie flik. The plot isb easier to follow now because it's more simple. I actually saw this in 2d format because at the time I didn't have enough money for me and my friend. I heard from some people that the 3d was as good as Avatar which I had seen. The 2d though to me wasn't really that bad so I didn't feel like I missed out on much.The plot of NASA keeping a secret about the Apollo 11 1969 landing on the moon was pretty cool start to the movie and also interplaying that with finding a cybertronian ship with Optimus Primes mentor, Sentinal Prime gave it a good mystery to the plot for me. Shia Labeouf again was top notch again as the funny Sam Witwicky. Also Patrick Dempsey for me played his role very well. The comedy to me was toned down to me in ways but the comedy in this one I thought was better than the 2nd one  without it getting to non serious. All of the comedy guys I thought did a good job.  Tyrese Gibson and Josh Duhamel  also played their roles pretty well. All the villians in this movie are great for the most part. Overall the action is done mine blowingly well and the robots look to me quite realistic in all the places and city environments. There's gonna be a lot of wow moments for the audiences especially supposably  in 3d. As far as the pacing I thought it was good for the most part despite it being like a 2 and a half hour movie. Now the negatives are some of the robots and new robots in the film didn't get the character development, as for like Shockwave I don't even think it had a voice actor and it had some cool moments but they didn't really show much of Shockwave. Also some of the new autobots didn't get a lot of character development. Some of the deliberately comedy relief characters didn't bring anything to the plot as the movie unfolded as well s a few others as well I think.  But above the negatives this haves to be not only the best Transformers movie, but it's one of the better action movies of all time. This is definately a much watch. I give this film a rating of 8.9 out of 10 stars*."}, {"rating": "7", "text": "Being a huge fan of Transformers characters and Animation i will see what ever they made . But that doesn't mean im gonna  love whatever they made . The first one was good . The second one ..... well i actually felt asleep while watching . At-least this one kept me awake . this one is really the best of the franchise . i like the story which . this story took me way back to the animation series unlike the first two . but the problem is (i don't know why) Bay always focus on the human characters like Sam and Us Military . sometimes it felt like im watching a movie about a war fighting by Military with their Robots . But  Transformers(animated) was like this . that was so wide and actually focused on the different Transformers and more about them . there are more awesome Transformers out there and lot of awesome fighting techniques which were missing . Now acting...... Rosie Rosie Rosie ! She is one of my favorite VS angels ! i was so excited to see her reprising Fox ! i think she did good(as first time) a lot better then Fox (of course) . Siha was more down then the last film as well as josh(i really like his acting but not in this one) .  Patrick Dempsey was good but John Turturro was awesome . as for the voice actors there's nothing to say they are the best of the best .really like Leonard Nimoy as Sentinel Prime. i actually loved the V.effects and transformations it was much more clear and awesome then the last two . Overall it was the best entry but still i expected more .as i said at fast im a huge fan so i would love to see more films but i want to see a Reboot and with good story about Transformers not some kid and military . [P.S. Rating will show 7 but its actually 6.8 !]"}, {"rating": "10", "text": "Avec Transformers 3, Michael Bay et toute son Ã©quipe ont vraiment mis le paquet! Effets numÃ©riques ahurissants, bruitages exceptionnels, bande originale de qualitÃ©, montage Ã©nergique, scÃ¨nes d'action Ã©blouissantes, acteurs Ã  l'aise dans leur rÃ´le respectif... Le seul plus qui permet Ã  ce troisiÃ¨me opus de surpasser les premiers, c 'est (par miracle!!) le scÃ©nario. Plus sombre et beaucoup plus travaillÃ© que pour les prÃ©cÃ©dents films, il est Ã©tonnant d'exprimer de la compassion pour chaque personnage (mÃªme inhumain) et d'Ãªtre Ã©tonnÃ© par l'histoire elle-mÃªme, qui tient formidablement la route! Certains me critiqueront parce que je suis fan, mais je peux assurer qu'avec Transformers 3, jamais vous ne vivrez une telle expÃ©rience au cinÃ©ma cÃ´tÃ© action et destruction, avec une 3D de qualitÃ© (pour le Grand Rex en tout cas)."}, {"rating": "7", "text": "This is certainly much better than Revenge of the Fallen, but it's not up to scratch with the original.  Its plot is the most intriguing in the series, but it spends over half the movie on thin character development, poor humor and awful acting. Then we get into the good stuff in the last hour, the action will blow your socks off and it's some of the best Bay has done and the 3D is mind blowing! Not the series best, but enough to redeem the series after RotF."}, {"rating": "7", "text": "Hidden on the Moon lies a secret weapon. A weapon used to manipulate time and dark matter, crashed onto the Moonâ"}, {"rating": "8", "text": "Nice movie, except way too much human screen time. 3D effects are great. However, the plot does not seem to agree with what has happened in the first movie, and certain outcomes and events are unexplained. You could tell the robots apart if you watch closely enough. The car chase at D.C. and Mexican Standoff were impressive. Fun to see Buzz Aldrin make an appearance as himself. Also includes some real-life footage of Apollo 11.\r Plot is well written, with some flaws here and there, and may be too loud for certain people. But overall great movie. At the end, I was still hoping it could last longer, and it could, if Michael Bay elaborated on certain details.\r Those who claim that people who like it are either children or stupid. They are wrong. You wont be able to enjoy a movie if you are always seeing flaws everywhere. Children and so-called \"stupid\" people, enjoy the movie because we just sit back and enjoy the movie, not caring about the plot. And those who hate the movie (and most likely Michael Bay also) forgot that Steven Spielberg is the executive producer.\r Don't care what the critics say, if it is really that bad, then Transformers: Dark of the Moon will not have hit  $700 million, let alone 1 billion (which it acheived) and becoming the fifth-highest grossing movie of all time."}, {"rating": "10", "text": "Trust me, TF3 has more than enough story to keep up with the action thrills. There is a good balance between the 2, and thats why I like it. This was the Transformers movie I was waiting for."}, {"rating": "7", "text": "As I played the movie, one things popped in my mind, and that was Megan Fox was not gonna be in the movie. But I knew other than that the battle was gonna be epic. And the movie was Mind-Blowing!!!!! I think this was the best movie Ive ever seen out of the Transformers Movie Series."}, {"rating": "8", "text": "After the last transformers was very poor, they have upped their game and created a fantastic 3rd installment. The special effects are great and the storyline is ok. The actors are good and the girl is so attractive! It wasn't as good as the first one but it wasn't far off. It was a bit predictable at times and the middle dragged on a bit but on the whole it was really good."}, {"rating": "10", "text": "Robocop is history! When you can care about robots feelings and feel their pain...then Mike Bay is a genius. IMAX 3D makes this an awesome experience. Robots may be getting Oscars soon if they get better roles."}, {"rating": "7", "text": "Transformers: the dark of the moon is a pretty darn big improvement on its predecessor, Transformers: revenge of the fallen. It's also an improvement on the first installment of the series: Transformers. Even though it has one very annoying character: Mikaela Banes (I got the name from wiki, I don't think it was said in the actual film). Sometimes, the film awkwardly tries to be funny at points, but very occasionally, you get a very small amount of laughter. The story-line is more thought out, in basic terms: it had a better and more interesting plot. The action was more intense and the dialogue was a bit better than the first and second's. I want to give an eight, but it doesn't quite deserve it, I recommend watching it either if you kind of like the old transformers show and toys or if you like exciting action movies."}, {"rating": "8", "text": "One of the best 3D effects so far (aside from Avatar and Tron Legacy).As they say in the movie:\"Where have you been when they took over the world?\"Like it or hate it Transformers is now part of a worldwide phenomenon. You can't change that. So you can start enjoying it as well."}, {"rating": "9", "text": "As a Transformers fan, I love everything about the franchise. I did however find it difficult to argue with people on how Revenge of the fallen turned out and how disappointing the movie was. But Michael Bay has  been able to turn it around and create a movie that was as good as the first one. The 3D affects were amazing and  the action was excellent. Michael and the writers were able to incorporate an actual story this time around that actually did make sense, even though there were times were it would break away from the story, which didn't disappoint to much as it was interesting to break away from the plot and see what else was going on. I felt that they did an excellent job of bring more emotion into this movie than the others which is great. If I had only one criticism, is the fact that I didn't like the acting of, new to the big screen, Rosie Huntington-Whiteley which I felt struggled with showing her emotions and overall acting as good as Shia LeBueof. Dark of the moon is the best out of the 3 and doesn't disappoint action fans."}, {"rating": "8", "text": "I will admit that this movie started out quite tedious. It started out quite broad and stretched out. Not much happening really; except a simple story being told.  But wow, after it got going... it really got going; Action, explosion, bullets, marines, giant metal machines; all became the sudden reality. Building started toppling, machines started pelting out the artillery. I tell ya, it was intense. I will admit that the story in general didn't hold much depth, but the overall experience and action in this movie is not to be overlooked. One of the best action movies of the year."}, {"rating": "9", "text": "This is a great action movie from Michael Bay, better than Revenge of The Fallen but cant defeat Transformers(2007). But what make it even more awesome this time was the 3d that was really cool, but if you cant watch it in 3d it is enjoyable anyways"}, {"rating": "8", "text": "There's something everyone should know about me when I watch movies. It's that I totally crave into action flicks and rared type of movies that are almost barely understandable. TF3 is one of those movies you'll have to wait for too little to get fully impressed, because if it weren't for the last 40 minute Chicago war scene, the movie would've probably be as **** as Revenge of the Fallen. The best one in the franchise!"}, {"rating": "9", "text": "Gave it a 10 because of the haters out there giving it such a bad score.  Honestly would have given it a 7.8/10.\r Fun: 9/10\rAction: 8.5/10\rCharacter Build: 7.6/10\rPlot: 7.5/10\rSpecial Effects: 9.5/10"}, {"rating": "7", "text": "It could be as good as the first film, but it's stupid love story between Sam and Carly and it's cliché elements couldn't make that possible. But it's still an really entertaining film, with the best visual effects I've ever seen."}, {"rating": "7", "text": "Exellent scene, nice scene. the scene is impressive, but the story is tottaly bad, it's so familiar that i could know the ending. I hope transformer 4 will be so much better"}, {"rating": "7", "text": "Better than 2nd and 4th parts. The movie is quite long, but almost every minute is full of action. If there was no Shael LaBef and Miss Lips With Silicon this movie could be quite good."}, {"rating": "7", "text": "Definitely better than Revenge of the Fallen but still not good enough. The only good part was the last 30-45 minutes with an epic battle. This movie took too long to get going so an average performance from Micheal Bay."}, {"rating": "7", "text": "I was going to give this film a 5, but then I realised they got rid of Megan Fox. That's also probably the only change Bay has made from the first move to this one; otherwise it's just a rehashing of a thinly veiled human plot with a 30 minute robot fight at the end. Am I fine with that? Sure."}, {"rating": "8", "text": "es buena, mejor que la anterior, pero falta algo para llegar al mismo nivel de la primera. banda sonora de Dios como sus entregas anteriores. efectos especiales de maravilla. las actuaciones no son de las mejores pero son aceptables."}, {"rating": "10", "text": "This film is so underrated, It beats The avengers by miles. Its action that keeps you to your seat. Its nothing like back flips and dodging blasts like in The avengers. So much of this film has been used in other films after it and you cant say not to it. It has better scenes then The avengers trust me. Watch where The avengers get their scenes and story from. The story was Ok, The characters were not bad but the special effects were something to remember."}, {"rating": "7", "text": "Transformers: Dark of the moon is still thin on plot, and it doesn't matter. Nevertheless, it is still an entertaining threequel bloated with dumb action sequences."}, {"rating": "10", "text": "an upgrade for the transformers series. LeoBouf is back from the first transformers and the second one now to the transformers 3 without  megan fox an has a new lover on  his back Rosie Huntington Whilteley.  In 2011's Transformers Dark of the moon   the transformers are having the ultimate war trying to save the struggling city with destruction also Shia  LeoBouf returns again to fight with the autobots. Micheal Bay directs the third installment of Transformers  series. let me just say that Bay directs the best film of transformers series ever i know that he basically puts non stop Stereotype characters in Transformer 1, 2,3  but this is the best transformers film i seen. This is the best Transformers film in micheal bays career. Grade A+"}], "recommendations": ["transformers", "avengers_age_of_ultron", "edge_of_tomorrow", "poseidon", "hercules", "underworld_awakening", "bloodshot", "into_the_storm", "bumblebee", "mad_max_fury_road", "furious_7", "thor_the_dark_world", "i_am_number_four", "jack_the_giant_slayer", "underworld_blood_wars", "the_last_witch_hunter", "terminator_genisys", "infinite", "gemini_man", "pirates_of_the_caribbean_on_stranger_tides", "terminator_3_rise_of_the_machines", "teenage_mutant_ninja_turtles", "jumper", "underworld_evolution", "mission_impossible_iii"]}