{
  "id": 2096,
  "title": "Transporter 2",
  "starring": [
    "Jason Statham",
    "Amber Valletta"
  ],
  "runtime": 87,
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "Professional driver Frank Martin is living in Miami, where he is temporarily filling in for a friend as the chauffeur for a government narcotics control policymaker and his family. The young boy in the family is targeted for kidnapping, and Frank immediately becomes involved in protecting the child and exposing the kidnappers.",
  "releaseYear": "2005",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cdm17vK8PxHfTi7ayZf6WKbOgUO.jpg",
  "categories": {
    "plot": 5.173913043478261,
    "acting": 5.461538461538462,
    "ending": 5.666666666666667,
    "soundtrack": 4.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 8.0,
    "action": 6.65625
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This movie is crazy, they need another one but with more action."
    },
    {
      "rating": "5",
      "text": "Man, I have nothing to comment about the movie; its just the same movie as \"Transporter\", only with a 2 on the tail."
    },
    {
      "rating": "6",
      "text": "It's a big difference from the first to the second Transporter    ."
    },
    {
      "rating": "9",
      "text": "............................................................................................................................These guys that say that this film is the worst that even seen is absolutely fool, the movie have good chases, fights and full of adrenaline and the acting is also good"
    },
    {
      "rating": "5",
      "text": "dimitri, you scared me..Transporter 2It's fun with all the clichéd stuffs that an action movie offers but has some unreasonable stunts and a disappointing climax."
    },
    {
      "rating": "5",
      "text": "Transporter 2 is highly disappointing the film has a incoherent plot with actors that look very bored even Jason Statham and (some) good action scenes cant save it."
    },
    {
      "rating": "10",
      "text": "Transporter 2 is even cooler than the first one. The film still blends in with the epic action and deserves Best Picture for the popcorn movie category. It's an excellent movie for the dudes, with high octane action and Statham dialogues. Easily, my favorite action flick this year."
    },
    {
      "rating": "3",
      "text": "I loved the original, but this was just flawed. The story was unoriginal, nearly a complete rip off of the first rush hour. Needed more martial arts fights and less evil kenival-esque driving stunts/shoot outs. No matter how hard I tried to like it, i was very disappointed."
    },
    {
      "rating": "5",
      "text": "Transporter 2 is very much a Brain-in-neutral style popcorn action flick. The plot line is ludicrous and the CGI effects are rubbish. Yet Jason Statham has his usual animal magnetism and the fight scenes are a lot of fun. Still, this only ranks in as a one-watch forgettable beat-em-up."
    },
    {
      "rating": "10",
      "text": "Uma sequência arrasadora agora contando com Amber Valletta incrível como Audrey,com sensacionais cenas de ação,ótimas lutas e uma excelente história mais uma prova que Jason Statham veio para ficar..."
    },
    {
      "rating": "6",
      "text": "Surprisingly, Transporter 2 is only slightly below the height of the thrills the first one took us to. It doesn't move past the first one, but it doesn't lag behind either. Instead, it almost copies it. This could have more positive effects than negative though; kind of like a saving grace to a series so that a second sequel can be made."
    },
    {
      "rating": "10",
      "text": "181 Retardados.................................................................................................................................................................................."
    },
    {
      "rating": "10",
      "text": "These peoples that rated below 4,the negative reviews think that is genius of cinema expert,even the average of critics rated are mixed,here and in RT....."
    },
    {
      "rating": "10",
      "text": "uuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuhuuuuuuuuuuuuuuulllllllll72tretereretardsjnfadjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjjj"
    },
    {
      "rating": "8",
      "text": "Transporter 2 is as fun as the first one but with a little more action.You get to see some fun & cool action scenes but there are some cgi segments that are weak but also some decent ones (overall there is little cgi so don't worry about it). If you like films like commando then this will entertain you as well."
    },
    {
      "rating": "7",
      "text": "Great action, the time flies by. If you liked National Treasure you'll like this movie too ! Of course you have to totally suspend your dis-belief, but if you've seen the trailer you know that. One part Schwarzenegger, one part Jackie Chan, and one part James Bond !"
    },
    {
      "rating": "10",
      "text": "Hell just watch the movie abnd youll love it just dont pay attention to the story."
    },
    {
      "rating": "2",
      "text": "Was anyone actually watching the movie? This movie was absolute crap. The acting was complete garbage, the story was the story from season 3 of 24, and the special effects were worse than anything mainstream I've ever seen. Sure the fighting was good, but it was so ridiculously over the top that the only way to enjoy it is with a group of friends while you make fun of it the whole time you are watching it. If you want to see it that bad, download it."
    },
    {
      "rating": "8",
      "text": "This is a must buy movie!! Love all the action the only thing that I did not like was the car it did not get a scratch on it how dumb is that!"
    },
    {
      "rating": "2",
      "text": "One of the worst movies I have ever seen. The so-called story is totally absurd and far-fetched, the characters are as uninteresting as possible and the stunts may be cool if you like unrealistic action, but they are so ridicoulus that I laughed when seeing several of them. If you are about to buy the DVD, you better put the money in your next meal and eat it, because the movie is as senseless as doing that. At least. But eating money more fun."
    },
    {
      "rating": "1",
      "text": "Horrible...how could this go so wrong. The first movie was fantastic. Well I'll tell you why it was so bad. It's because the first movie was low budget. Just think about it, how many low budget movies have been good. Equilibrium....Follproof. But the second movie...wow....the swimming was even fake. Like common Jason, don't let them do this to you. And for some reason, he can now do anything. He freaking spun his car upside down and knocked of a bomb on the bottom of his car, then landed without a scratch on his car. But one thing that pissed me off the most, was that they didn't have the cool music to set the mood in this movie. The first scene in the first movie compared to the first scene in the second movie....bad. Avoid this movie at all costs."
    },
    {
      "rating": "8",
      "text": "If you liked the first movie and you're coming back, You know what you are coming for and you get what you came for. Transporter2 totally delivers the goods."
    },
    {
      "rating": "8",
      "text": "Ridiculous, but good action movie."
    },
    {
      "rating": "10",
      "text": "Great movie. i was a big fan of transporter1 and now im a huge fan of the sequal. good job!"
    },
    {
      "rating": "6",
      "text": "Better than the orginal. Great summer action movie. A little unrealistic but still lots of fun."
    },
    {
      "rating": "5",
      "text": "For a mediocre action romp, I give it a mediocre score, and a mediocre review."
    },
    {
      "rating": "7",
      "text": "Transporter 2 is one of those movies where you just can't help but laugh at how ridiculous the action stunts are. But if you like action movies and don't need to question the plot, it's a really fun ride. My only gripe with the movie was during a climatic scene and the music used was the title track to SIN CITY. I don't know how the hell you can get away with that, it was more distracting than anything else. Either way, good movie. Worth seeing."
    },
    {
      "rating": "10",
      "text": "i cant believe you people. i know this movie wasn't as good as the original. but still the action was great."
    },
    {
      "rating": "1",
      "text": "Tired bang-em-up, shoot-em-up, bull-crap I've seen this movie like so many times since childhood. Completely unbelivable scenes. Someone wrote this movie on coke."
    },
    {
      "rating": "0",
      "text": "This is the worst film I ever seen, Don't waste your time."
    },
    {
      "rating": "3",
      "text": "I went to this movie expecting the same \"quality\" of the first. But something went horribly wrong. I guess the story could have worked pretty well but some how the loss of Corey Yuen as director and his replacement Louis Leterrier turned this movie into a steaming pile. The sheer ridiculousness of every event in the movie, constantly made itself evident. When a plane flying at altitude crash lands in the water, what do you do to avoid death? Jump backward a few feet, and you'll be miraculously unharmed! I found myself constantly groaning at the manner in which the director attempted to move the plot forward. Skip this one, unless it's free and you can get your hair cut at the same time."
    },
    {
      "rating": "8",
      "text": "So crappy it shines. So filled of garbage, it smells of ambi pur car perfume! So cheezy it melts like sweet butter! So over-the-top, it never hits rock-bottom! So unbelievable, it rocks! So silly the plot, it was destined to be a smart-ass, and not to mention kick-ass piece of total crap! And that's the way to do it, popcorn style!"
    },
    {
      "rating": "0",
      "text": "Two For The Money? How about Two People In The Theater? It was so bad and stupid that I put a bag over my head walking out. Avoid."
    },
    {
      "rating": "2",
      "text": "The Transporter 2 was horrendous illegal use of bullettime - 5 you dont slowdown when you open a door the athleticism of the main character was unbelieveabe its also as if he understood and could use the laws of physics as his own disposal i only give it a 2 because it was so silly and unbelievable it was stupid. Final Verdict: 2."
    },
    {
      "rating": "1",
      "text": "The chase scenes were so poorly done I couldn't believe what I was seeing. It's as if they wanted to remake Ronin with the black Audi. This should have premiered on the USA cable network not a cinema."
    },
    {
      "rating": "4",
      "text": "Very very good fight choreography, which doesn't surprise me knowing Corey Yeung was involved. It also didn't surprise me then that the special effects were absolutely horrible and the plotline not much better. The first Transporter came off with a cool vibe with its music, acting and fight scenes (anyone remember the doorbell ring?). This one just feels cheesy. Just do yourself a favor and rent the first one."
    },
    {
      "rating": "8",
      "text": "This is one of those action films you want to REALLY like, but instead find yourself justifying stupid plot twists and ignoring cheesy stunts. If they went for \"more believable\" instead of \"more explosive\", this Transporter series could be awesome. Keep it more focused on the cars, the job, the rules. btw, the sweet lambo chase needed to be at least 10mins longer. ;)"
    },
    {
      "rating": "10",
      "text": "Sweet moive, there were come cheezy scenes but over all a kick ass movie."
    },
    {
      "rating": "1",
      "text": "What the world really needed was another movie about an unarmed guy who kicks and slugs his way through teams of armed FBI agents and drug Czars. This movie was difficult to endure. Don't waste your time."
    },
    {
      "rating": "9",
      "text": "I can't understand why so many people gave this flim such a bad rating ok so it was over the top even i was shaking my head laughing during the flim but what you have to understand its fantasy its not real this flim was made to entertain and it certainly entertained me!"
    },
    {
      "rating": "7",
      "text": "I saw this movie a few weeks ago in france. the dubbing was well done IMO, who knows, maybe the original voices suck. but the cinematography was pretty sleek, the fight scenes were well done, and the villainess was hot. my only gripes are that the plot was formulaic and predictable and that the main bad guy was a typical generic movie villain."
    },
    {
      "rating": "5",
      "text": "Pretty good yet so bad. The movie is definitely entertaining, but it absolutely requires you to suspend your disbelief, ignore the laws of physics, and accept contrived martial art scenes. That said, I really enjoyed the pure driving scenes, and the great martial arts. I really hated the low end special effects and pointless stunts that should only happen in a spoof of a bad B movie. This movie is a prime example of wasted potential; it was ok but it could have been awesome. Hopefully we will see better roles for Jason Statham. Lastly, I seem to be the only one, but I was really disappointed in the final fight, once again it wasn"
    },
    {
      "rating": "5",
      "text": "no where near as good as the first one but still has an entertaining value to it. it has some great scenes but also has some down-right fake and quality-ruining scenes. Great acting and a decent plot make this film bearable."
    },
    {
      "rating": "7",
      "text": "As Dr. Evil once said, \"Why must I be surrounded by frickin' idiots?\" That is exactly what Frank Martin (Jason Statham) must feel like in Transporter 2. Transporter 2 is the sequel to the 2002 movie about Frank Martin a former Special Ops Agent who is a transporter of sorts who ends up getting involved with people who are in the business of transporting Asian slaves. This time around the child of his temporary employers who was under his care has been kidnapped by a group of people with a need to poison and kill a bunch of leaders evolved in drug enforcement. Just like the first movie, this movie boasts a number of action scenes that range from the insane to the absurd, all of which are completely fun to watch and make the movie completely watchable despite the numerous flaws. Like I said, Frank Martin seems to be surrounded by a host of stupid and incompetent supporting characters minus Audrey Billings (Amber Valletta) and Inspector Tarconi (François Berléand). It is obvious that Frank and Audrey are constantly frustrated by idiocy of the other characters in the movie. Why? How does a poor script and terrible acting suit you as a good reason? The plot is simplistic, the majority of the acting is terrible, and the writing is full of fail. Even Jason Statham is suck with some pretty weak one liners. Overall, the action scenes alone make this movie worth the time. Some people will find most of the scenes overly ridiculous and will most likely be turned off by them. But ff you are willing to turn off your brain for 90 minutes, you will find this movie enjoyable. If you are looking for a masterpiece, you'll probably be disappointed and should look elsewhere."
    },
    {
      "rating": "7",
      "text": "This movie wasn't exactly what I'd call \"hot tamales\" but hey, it's not as bad as the reviews say. Indeed it never touched a close enough base than the first, but c'mon I've seen sequels that were far worse!"
    },
    {
      "rating": "5",
      "text": "It is the same movie as the first one, just worse."
    },
    {
      "rating": "5",
      "text": "Same as first film really, Statham is watchable but film is so-so. Needs to be overhauled by a dynamic director."
    },
    {
      "rating": "7",
      "text": "Once again, we have a Statham movie, where the story isn't the focus and doesn't matter much at all. The allure of this film is the terrific characters created by Luc Besson. The mysterious driver with OCD is back, but is well into his retirement. Instead of helping the bad guys get away, Frank Martin (Statham) is driving rich people around, but he's forced into action when their young son is kidnapped. The story here is somewhat simplistic, but the bad guys are as creative as you will ever see in this type of film. I'm not sure where they found Alessandro Gassman and Amber Valletta, but they were so much fun to watch. He is a self-obsessed drug lord, with ridiculous moves, and big plans, while she is a deadly assassin, whose ability with a gun would put John Wayne and Clint Eastwood to shame. When Statham is added to the mix, you have the perfect formula for one intense movie. Transporter 2 was terrific in that it never stops moving and you will see things you never thought were possible outside of CGI, it was unbelievably entertaining. From the stand point of a film aficionado, while these amazing moves and characters make for a lot of fun, the story and dialogue are severely lacking. This film is not for people looking for a great story or loveable characters, it's made for adrenaline junkies who want to see explosions, long fight scenes, and intense thematic action. If you're all about the action, you won't find much better than this, but if you want there to be some greater purpose, a worth-while cause to fight for, or want to see the world become a better place because of all that happened, you'll be disappointed."
    },
    {
      "rating": "5",
      "text": "transporter 2\rnot as good as the first. too over the top, and unbelievable. too much violence. chase scenes are unrealistic. entertaining, but just a movie to watch once."
    },
    {
      "rating": "7",
      "text": "The Transporter 2 is basically just as action packed as the first one. However, it is a little more over the top. The villains are really cheesy also. Still Jason Statham is just as badass as he was in the first film and some of his stunts are incredible. I would watch Transporter 2 if you enjoyed the first."
    }
  ],
  "recommendations": [
    "xxx_return_of_xander_cage",
    "the_expendables",
    "6_underground",
    "the_transporter_refueled",
    "the_expendables_2",
    "lockout",
    "salt",
    "wanted",
    "death_race",
    "battleship",
    "furious_7",
    "transformers_revenge_of_the_fallen",
    "the_expendables_3",
    "mission_impossible_iii",
    "the_marine",
    "ninja_assassin",
    "bloodshot",
    "teenage_mutant_ninja_turtles",
    "transporter_3",
    "mechanic_resurrection",
    "underworld_evolution",
    "mortal_kombat_annihilation",
    "polar",
    "crank",
    "the_legend_of_hercules"
  ]
}