{
  "id": 332,
  "title": "Transformers: The Last Knight",
  "starring": [
    "Mark Wahlberg",
    "Josh Duhamel"
  ],
  "runtime": 154,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "Autobots and Decepticons are at war, with humans on the sidelines. Optimus Prime is gone. The key to saving our future lies buried in the secrets of the past, in the hidden history of Transformers on Earth.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/s5HQf2Gb3lIO2cRcFwNL9sn1o1o.jpg",
  "categories": {
    "plot": 3.4814814814814814,
    "acting": 2.9642857142857144,
    "ending": 3.0,
    "soundtrack": 6.0,
    "cinematography": 2.0,
    "familyFriendly": 2.4285714285714284,
    "funny": 3.272727272727273,
    "action": 3.55
  },
  "reviews": [
    {
      "rating": "2",
      "text": "Transformers: The Last Knight is 2X MESSIER than Age of Extinction. Every time when Michael Bay directs a Transformers movie, he always add explosions and useless potty humor to make his movie entertaining for his sake. Jesus Christ.. where do I have to start this? Okay, first of all, the visuals and use of CGI were outstanding but at the same time, everything in this movie is ridiculous. Everything from lousy directing, choppy editing, rushed pacing, annoying characters, and the screenplay of this garbage film is cheesier than a Nickelodeon TV movie. Second, HE ADDS WAY MORE EXPLOSIONS!!!! Michael Bay always have a strange fetish using explosions everytime he adds them in every movie he makes. In almost every scene he makes that involve explosions, it does not do anything to make his movies better. Matter of fact, he's making it worser than previous Transformers movies. Lastly, WHY DID HE MAKE THIS MOVIE??!! Bay's motivations is aiming for money and that's pretty much it! The only positive that I can give to Bay is his departure from directing future Transformers movies and that's it. Hey Bay, I can assure you that you will sweep the RAZZIE awards in no time because this movie is a waste of time!"
    },
    {
      "rating": "8",
      "text": "It is a superhero movie and if you expect a very different exciting story then you are expecting wrong. All superhero movies have the same basic concept, but the characterization of the concept of transformers and such marvelous acting, direction, action and cinematic visually appealing excellence is something i can enjoy any day. It is one of the most appealing movies and there being so many negative reviews about this movie is unimaginable. I don't know whats wrong with the critics and movie goers. Its only that i guess their expectations from a movie are wrong and hence they are disappointed"
    },
    {
      "rating": "7",
      "text": "At least the action, CGI, the Steve Jablosnky's Score are pretty good, but the rest are... forgettable, the plot is confusing, the comedy is akward, but the good thing is that Michael Bay is Not going to direct the next movie. At least is not the worst Transformers movie.. cof cof.. Revenge of the Fallen."
    },
    {
      "rating": "10",
      "text": "\"Transformers: The Last Knight\" is a truly wonderful experience with visual effects and a storyline like no other, the bad-ass series continues to reign with Michael Bay's wonderful direction. This is clearly the best Transformers film ever."
    },
    {
      "rating": "1",
      "text": "The last knight easily the worst transformers film. This movie has a very hard to follow plot because it is all over the place. This movie has even hard to follow action scenes. Good thing I watched it once never watching it again. Waste of money"
    },
    {
      "rating": "8",
      "text": "I rated this movie 8/10 because I sort of like it. The older movies are better. In my opinion."
    },
    {
      "rating": "10",
      "text": "one of the best movies of 2017 along with cars 3! but sadly, with bad metascore! but i respect charles p rogers opinion on that movie!"
    },
    {
      "rating": "0",
      "text": "ABSOLUTE NOSENSE, everything in this movie is without any sense and full of plot holes with the previous movies.-Optimus don't remember he destroyed Cybertron in the third movie-Megatron changed body from Galvatron without explanations-The design of Quintessa don't match with the one of the Creators showed in the previous movie, she's robotic instead of organic-Cybertron FLOAT TO THE EARTH!!!!!!!!! In DOTM were needed thousands of ultra-technological pillars invented by the most intelligent transformers ever, on earth and space to bring it near Earth-Quintessa is the only creator to appear, the others well, Bay forgot about.-Decepticons are retarded-Bumblebee in the WW2??? timeline **** upthis movie is stupid, full of cringe stupid scenes without any sense, timeline completly **** up with giant plot holes, it's like Bay forgot all about his work that until the third movie was great."
    },
    {
      "rating": "3",
      "text": "It's just too messy to enjoy. There's no cohesive story, and the scenes just crash into each other without rhythm or flow. The best way to describe the experience is like watching TV commercials for 2.5 hours."
    },
    {
      "rating": "2",
      "text": "Transformers: The Last Knight is hilarious. Not because it's funny, but because it's ridiculous to the point of eliciting laughter. I was honestly shocked at just how stupid this film managed to be sometimes. After Age of Extinction, I thought there was no way these movies could possibly get worse. Unfortunately, I was wrong.The same basic plot we've seen four times before makes a return, but this time, by hugely convoluted means, the film forgoes all logic and upends the franchise's continuity, clearly for the sole purpose of setting up future spinoffs. Sadly, the action isn't even good enough to make up for any of that.This movie was also shot with like seven different cameras, so the aspect ratio is always shifting. It's incredibly annoying. All of the charm this concept once had is gone, and the only hope of getting any of it back is to completely reboot the series, or to prevent Michael Bay from having any creative input moving forward."
    },
    {
      "rating": "2",
      "text": "A visually stunning, turd of a film.  I enjoyed the first 30 minutes of this film minus some dialogue, then came the rest.  This is a giant mess like the last three, there is so much going on that your head will spin and you just care about anything or anyone.  The dialogue is some of the worst in any Transformers movie with good old Bay throwing in useless scene after useless scene.  Mark Wahlberg is fine, Laura Haddock was an upgrade, Isabela Moner was okay but pointless, Josh Duhamel and John Turturro were there because they were in some of the other one but overall wasted, and Anthony Hopkins was out of his mind.  Overall Bay does it again, a beautiful looking movie with no substance and awful dialogue.  D-"
    },
    {
      "rating": "0",
      "text": "While I can say that the Last Knight is a better film than Age of Extinction, with slightly improved CGI and a shorter run time, this film is still a heaping pile of garbage (to put it kindly). The film's writing, story, characters (robot and especially human), and final act/battle are absolutely awful. Even worse, scenes and characters seem ripped out from other films (a chase sequence seems ripped straight from F&F, the little squeaks character is a complete BB-8 type, etc). The action sequences that are there though are so boring and wane in comparison to some of the other films. I pray that viewers don't see this film and give paramount incentive to make more of these embarrassments to blockbuster films and film in general."
    },
    {
      "rating": "3",
      "text": "I went in with low expectations based on the previous films but my childhood love of the cartoon made me want to like it.  The CG was great, they finally slowed down the fight scenes and added more vehicles besides sports cars.  I don't know who the target audience was. The swearing and violence was not for little kids but the humor and dialogue seemed like it was written by a 10 year old.  It had a lot of great (voice) actors saying really bad lines. Hearing Jim Carter (Mr Carson) quoting Ludacris was a disgrace."
    },
    {
      "rating": "2",
      "text": "All the eye candy and fluff in the world couldn't make this film any better. I'm sorry, but I truly tried to keep an open mind. Sadly, I could hardly keep an open eye from boredom. An incoherent plot, pre-school dialogue, irrational characterizations; need I say more. Horrible!"
    },
    {
      "rating": "3",
      "text": "This movie is actually worse than I originally anticipated and I wasn't expecting much. The editing is all over the place, the acting is average at best, the comedy is botched and very unfunny, even cringe worthy at times, the action scenes aren't even that well made and the movie had a lot of plot holes. At least the special effects were really good. If you're into CGI action movies that don't make sense with lots of unnecessary slow motion scenes and ineffective drama , this movie is for you. If not, you're better off watching something else."
    },
    {
      "rating": "7",
      "text": "Much more entertaining than I initially thought it would be. Yes, it's still a Michael Bay movie. Expect explosions, nonsensical storytelling, and takes on the Autobots and Decepticons that are so bland the characters almost completely indistinguishable from one another provided their names aren't Bumblebee and Optimus Prime. However a much needed change in tone from the last movie and the infamous director not taking things seriously in any way make for a more enjoyable movie than one might expect. Just don't come for the plot or anything other than the action and some cheap laughs.There's a surprisingly large cast of familiar faces involved in this ridiculous new take on Transformers lore. Among them is Anthony Hopkins for some reason. Michael Bay clearly enjoyed having the respect actor around to use, and Hopkins himself seemed to be having a blast despite that starring in a movie like this is him just slumming it at this point in his career. While he still ain't no Labeouf, Mark Wahlberg's character is so much more likable this time around. Something that's due to the plot not giving him any extra baggage hanging around in the form of his character's obnoxious daughter and her useless, statutory rapist boyfriend (no, it's cool. There's this one law...). They, along with the material, aren't here to choke out the actor's natural charm. The material is so much lighter than that of the previous film \"Age of Extinction.\" Bay goes for a lot of different kinds of gags and ends up filling the movie with almost wall-to-wall humor. A move that is much appreciated. The plot itself is crazy. It regularly jumps back and forth from different locations and even time periods in an effort to come off as complex. Instead it just feels convoluted. It's easy to lose track of certain characters as they get left behind for large parts of the film only to pop up later. I actually forgot about Cade Yeagers new human cohorts there for a while. Naturally, this isn't the kind of movie you watch for good writing. Michael Bay is known for making movies for teenage boys. Here he really embraces that.The Last Knight is much lighter and surprisingly more diverse than the other Transformers films. You even get some pretty cool action scenes that aren't just explosion fests that rely more on the physicality of the actors. Of course there's also some gorgeous sci-fi scenery. Those underwater scenes are astounding. Ultimately, this is still pretty brainless entertainment. As far as the writing goes, it's the most incoherent Transformers yet. However, by embracing the absurdity and silliness, and just going for jokes and spectacle, Bay crafted what might just be the best Transformers movie yet. For whatever that is worth to you."
    },
    {
      "rating": "10",
      "text": "i loved it, the best one, great story and action set pieces, definitely the best one, i cant describe how amazing this film is, if you have seen the prevoius ones you will have no problem on getting this one, its just amazing, just see it in imax 3D"
    },
    {
      "rating": "0",
      "text": "Simply the worst movie I've ever seen. Michael Bay manages somehow NOT to make the giant transforming robots the center of the movie! What the hell, nothing is really the center of this movie. NOT EVEN OPTIMUS PRIME. Instead, an ensemble of ridiculous and mono-dimensional human characters are confusingly shown during the story. One of the main characters is a 14-years girl awkwardly portrayed as some kind of sexy, post apocalyptic fighter (wtf is wrong with you man?!). Incoherent, frenetic and chaotic storyline that tries to blend together the following themes: giant alien transforming robot, King Arthur and the knights of the round table, dragons, demons, Merlin, a robot god/sorceress, comedy moments, a planet eating other planets, USA marine forces, secret English society....and Anthony Hopkins.Please, Michael Bay, please stop raping my childhood...I'll give you my lunch money..."
    },
    {
      "rating": "10",
      "text": "Well, i loved it, i'm not watching for meaningful experience, but for cool robots kicking and punching other cool robots, its not a intellectual movie by any means and it will never be, but it is one of my favorite franchises EVER"
    },
    {
      "rating": "9",
      "text": "This was a GOOD movie! I really liked the start, the story, Anthony Hopkins, and the new characters introduced who brought some spice and laughs.What I didn't really like was the ending, how they mixed everything up becoming a thunderstorm hard to watch and understand, but I don't agree with A LOT of the critics who rate it so poorly.While it's not a 10, I would put this in the worth watching category for this year, definitely doesn't deserve the bad ratings. Anthony Hopkins doesn't deserve being rated so poorly.."
    },
    {
      "rating": "7",
      "text": "Deutsche Review - Kritik Der folgende Test ist in 5 Kategorien zusammengefasst. Diese 5 Kartegorien ergeben die Gesamtpunktzahl von 0 - 100 Punkten. Um einen passenden Userscore zu geben wird auf oder abgerundet. Bei 84 Punkten ergibt das einen User Score von 8. Bei 86 einen von Userscore von 9. Falls eine 85 kommt entscheide ich ob ich es eher positiv oder negativ nehme. Regeln verstanden? Dann sind hier meine Punkte. Mein persönlicher Score = 72/100 Mein User Score = 7/10"
    },
    {
      "rating": "2",
      "text": "Transformers: The Last Knight is just another pain-to-the-eyes excuse of marketing our beloved Transformers at least near two hours of Michael Bay trying so hard to entertain us all without using already-clichéd ideas from the simpleton past."
    },
    {
      "rating": "0",
      "text": "Horrivel, como de costume, péssimo roteiro, péssima direção e olhe que nem assisti mas ja to deixando aqui o veredito porque ja sei que vou odiar esse lixo tóxico que se tornou desde o terceiro filme"
    },
    {
      "rating": "0",
      "text": "I just watched this movie last night and I cannot, for life of me, remember what exactly was going on or what the main story is. Too many side characters with too many subplots. And the jokes coming out of these children are as terrible as their acting skills."
    },
    {
      "rating": "0",
      "text": "An absolute incoherent, dismal lazy mess with atrocious directing, a bumbling script, uninspired acting, poorly shot, not even blocked or thought out action scenes, insulting dialogue...a typical Micheal Bay movie. Terrible. Just out right bad. You will leave the theater with less braincells than when you came in with, and 2+ hours of your life you will never, ever get back. At best, this movie is total schlock."
    },
    {
      "rating": "0",
      "text": "I didn't think it was possible for Bay to make a Transformers movie worse than the second one. This is a huge, sloppy pile of metallic fecal matter. If this is the kind of brainless movie Americans want to see, it's no wonder they voted Trump into office. In fact, this film does a good job of summing up Trump's America."
    },
    {
      "rating": "2",
      "text": "EDIT(after seeing people writing about this): I will never understand the sentiment of not needing good characters or a good plot. Without those how am I supposed to feel anything about whats happening in a movie? Even basic archetypes can work if well executed(like ID4 and star wars). A good, compeling plot and a good character you can care about are not necessarily oscar worthy masterpieces as long as passion and love for the project is involved. These can tie a movie together. Bay does not seem to care about these at all. Just make the next one and be done with it. Just throw in racist and sexist jokes, some pretentious attempt at diversity(im neither SJW or a feminist), and american army and thats it. All done by the numbers. The movies are not even about transformers! The girl you see in the trailer rivals the boy on the phantom menace. Its there by chance and does nothing. The movie is full of unfunny, juvenile jokes, like that one friend you have that just keeps making fun about anything and saying unfunny jokes. TF5 is just a compilation of CGI demo reels, shameless product placement, and america military pornography. And people keep paying for it!"
    },
    {
      "rating": "1",
      "text": "Wow.... I've watched every single Transformers movie and this is by far the WORST one in the series. I brought my friends to watch it and one of them fell asleep for half the movie while the other ones are just so bored of it.Nothing makes sense for these movies and this is going to a real insane lvl and it really defies logic. It's so hard to even find something good to say about this movie; even when the action scenes seem really cool and in a big scale, I didn't feel the immersion for it like in other movies...The decepticons get nerfed so hard in this movie especially Megatron and the main villian Quintessa doesn't even pose a threat; she led to her to own demise by even holding cybertron at that very spot!The main highlight for this movie was ofc the fight between bumblebee and Optimus; I think that was the only part I was engaged and thought it was alrightIn the end Transformers the Last Knight is horrible... Like really really bad. 1/10 is for the effort they put in but in reality this is really a 0I can't even call this a movie.... Someone pls save the Transformers Franchise xDAnd DO NOT CONTINUE where that post credit scene left off; I rather a see a entire new reboot to the franchise and giving the movie to good hands instead of Michael Bay"
    },
    {
      "rating": "3",
      "text": "If I had to describe the movie in one word it will be \"cliche\". The whole plot is a cliche. The movie was so long and boring, I could've spent those 3 hours much better than this."
    },
    {
      "rating": "0",
      "text": "F@CK THIS FILM!! F@CK MICHAEL BAY!!! IT'S FILM IS NOT BAD! HIS F#CKING HORIBLE!!! THIS FILM DESTROY MY 4 DOLLARS!!! 4 F@CKING DOLLARS!! F@CK YOU, MICHAEL BAY!!!"
    },
    {
      "rating": "2",
      "text": "I am a big Transformers fan, the Michael Bay films have generally appealed to me to a certain degree up until now, but The Last Knight is just pure rubbish. It comes close to Suicide Squad levels of bad.Let's just agree that the first Transformers film was great. Thought Revenge of the Fallen was bad? At least it had Jetfire and the Fallen, it could have been better if it wasn't victim of a Writers Union's strike at the time. Thought Dark of the Moon was crap? At least it had Sentinel Prime, Shockwave, the giant Worm and Cybertron but didn't feature Devastator's metallic balls or the twins. Thought Age of Extinction was a joke? At least it had the cool Dinobots and Cybertronian spaceships with giant magnets. But The Last Knight is even worse. It's the worst Bay-directed Transformers film by far.It's a series of nonsensical character plot arcs which are either forgotten later or thrown in the film in an atrocious way. No spoilers ahead, it's all in the trailers already. If you mix up King Arthur and the Knights of the Round Table, Merlin the Magician, 3-headed Dragons, giant spaceships, a female English Historian who looks for a man, Cade Yeager (Mark Wahlberg's character) who just so happens to be single, a teenage girl, an English Lord and his Transformer butler, a human anti-Transformers paramilitary group named TRF, the Quintessons, and the Transformers, plus Michael Bay, you get The Last Knight.Light spoilers ahead (no, not really). For some reason the TRF decide to make a deal with Megatron who asks for the release of some of his captive Decepticon comrades with laughable names such as Nitro Zeus and Dreadbot, but (unless I missed it) humans asked for nothing in return. The film's Writers even go so far as to make Antony Hopkins' character a member of the ancient, centuries-spanning \"Witwiccan Order\" to make fun of Samuel Witwicky (aka former Transformers lead actor Shia LaBeouf, who was fired just like Megan Fox). End of light spoilers.OK we know the Bayformers film series never had any serious plot, but at least they always had spectacle which WOWed the audience. The Last Knight lacks even that. Sure there are robots bashing each other, but the fights are boring. There are scenes where everyone is firing their guns at the enemies but it seems more like they are shooting at nobody really. Then there is the torn apart Cybertron in all its giant-pile-of-rubbish glory. And there is a scene (as well as in the trailers) where 6 enemy robots place their heads in such a wonderful position for Optimus Prime to effortlessly cut them off in a single sword swing, and he's supposed to look badass but I just thought it was bad cinematography by Bay. Oh, the film even has Hot Rod in it but if you were waiting to see the Rodimus Prime storyline unfold you are wrong. The name of any robot in the Transformers films series means nothing, you could name them anything you wanted to but it's up to Bay as to what to do with them.The only (maybe) positive thing in the whole movie is the Marvel-esque mid credits scene which is a tease for the next Transformers movie.All in all, The Last Knight is a really bad film, even by the Bayformers low standards. There is going to be a 6th film for sure, but I hope Michael Bay stays true to his word and doesn't come back. I 'd rather see a complete Transformers film reboot. Start it all over, get the Transformers mythos right, and pretend the Bayformers films never existed."
    },
    {
      "rating": "3",
      "text": "Transformers: The Last Knight is a movie filled that has no story and no idea what is it trying to be. From the very beginning it was going so fast it wanting to start the movie but it just got boring from then on. I might not be on the right here or where are my facts, well the fact is, the movie is boring, bad, bland and it's just a terrible. \"The last knight\" it's like five seconds of telling who it is but doesn't explain it after that. They probably do, but I wasn't listening because it was so freaking boring. The writers are terrible, who asked seven writers to tell this story. Each will have their own say and just give it to Bay like,\" Hey we just got a new scene to put in the movie can you put it in?\" He do, and then theres all these other writers wanting what they want. It just a mixture of everything that goes nowhere. Megatron is horrible, this part is hilarious though, they tried to make a suicide squad movie in it and it could've been more interesting then the movie that I was watching. Please watch something else if you can, if you like these other kinds of movie, then go ahead this is only my opinion. You might ask, \"Why go watch it if you know it's going to be bad?\" Well  I try to open my eyes and see how things can improve if it doesn't then here I am. Bad movie! Bad directing! Bad acting! Bad editing! Writing and Film in total. Nothing has improve, it's all the same."
    },
    {
      "rating": "0",
      "text": "This might actually be the worst movie I have ever sat through in my life. This is just a product, solely made to make money. You can tell that the filmmakers didn't care about the quality of the movie. It's lazy, formulaic, lacks any kind of tension and just comes off as visual noise. I hate this movie. I hate everything about this movie. The convoluted plot, the atrocious dialogue, bland acting and a jarring aspect ratio made this agonizing to get through."
    },
    {
      "rating": "8",
      "text": "Am I the only one that thinks this film is amazing. I was really worried for this film because I saw things in the trailer that I thought would ruin the film for me and by the low scores. But I was surprised by how good the film really was when I walked out. And it turned out to be 1 of the better films in the Transformers franchise. All I can say is if you liked all the other Transformers films, then you'll like this one too."
    },
    {
      "rating": "10",
      "text": "Вы уж простите, что я пишу на Русском, но я с удовольствием хочу прокомментировать этот ( шедевр) как бы грубо не звучало для многих, Да я фанат этого фильма,  и его первую серию  я смотрел с невероятным  интересом, я не смотрел мультфильмы, я сразу начал смотреть  фильм, и мой дух невероятно захватило, заворожило и т.п я влюбился в это кино, и пересматриваю его по 20-30 раз   запоминаю фразы,  действия. Многие говорят мол нет сценария, мол  актёрская роль плохая, я считаю обратное. По мне это самый интересный фильм про инопланетян( ведь всё-же автоботы не люди, а пришельцы), а так как по пришельцам мало каких фильмов есть, и актёров которые знают толк в этом особо не подберёшь ! НО вы только  посмотрите и подумайте, А КАК БЫ ПОВЁЛ СЕБЯ ??? разве не так бы суетился  как Марк Уолберг? или не так бы старался помочь тем кого вижу 1 раз, но понял что это добро, которое старается защитить землю, жертвуя собой ( как  Шайа Лабаф). А сценарий?? Вот вы представьте на землю упали неопознанные объекты, пусть даже не в США, мир будет волноваться, и выясняется что есть добро и зло, сначала мы поможем добру победить зло, но зло не кончается, а ущерб  городам, не хилый, машины, здания, и даже человеческие жертвы, и САМО собой правительство должно будет  защищать людей, а значит и убивать мирных, те что сражались за людей, не имея понятия что такое быть человеком, а некоторые люди жертвуют собой ради спасения них, так как они видят что эти автоботы спасали их, жертвовали собой ради людей, и само собой так и должно было бы быть! Автоботы уважают своего лидера, Оптимуса Прайма, и только попробуйте сказать что он не достоен уважения, он лидер!! Он смелый, он мужественный, он тот кто готов ответить за свои поступки, которым есть оправдания, ведь он не был виноват! Но, но как не странно люди спасают его  НЕ СМОТРЯ НИ НА ЧТО. Да роботы, да взрывов много! и почему вас это удивляют? Трансформеры это те роботы у которых много оружий в себе( они его трансформируют) от сюда снаряды, от сюда много взрывов при снаряде, прошу вас, не критикуйте так сурово, посмотрите глазами тех людей что на экране, будто это реальность, сколько там мужества и героизма? МНОГО и поэтому я прошу вас уважайте немного это творчество, это не просто такое кино как в России придумают, там очень много спец эффектов, да изображения не меняются с 1 части, меняется немного стиль, НО сами роботы и с 1 части выглядят очень реалистично, одно но то что из небольшой комару или того мерса не маленький такой робот получается, может быть тут я что то не допонимаю, но смущяет только это, НО В целом я даю и буду давать всегда этому фильму 100000000/10 потому что  в нём есть всё что нужно для экшн фильма, спасибо за внимание."
    },
    {
      "rating": "0",
      "text": "If Mark really cared about building his brand... which seems overly important to too many actors; this film would have been better. As a talented guy it seems like he would have cared more about his performance, even if it is a crap movie. My second question is: are these movies HORRENDOUS on purpose? Yes."
    },
    {
      "rating": "3",
      "text": "Story is overblown and convoluted with no true character motivations as most characters flip flop constantly. Focus is more on the humans than the Transformers in this, as a retelling of Arthurian legend and destiny. Evil Optimus, or Nemesis Prime as he was called by the main baddy, is only evil for an 8 minute battle at the end of Act 2 whose climax is basically \"Save Martha.\" While there are the usual explosions, action, and teenage boy humor, it all falls flat. It's best to skip this."
    },
    {
      "rating": "1",
      "text": "VFX: Superb, Cinematography: Chaotic, Story: Why do they always link it to WW2? like wtf, Dialog: Awful (everyone says **** at the same time, it's like going to a parliament meeting), Actors: Anthony Hopkins and Isabela Moner are good, Sounds: nice, but in Imax the explosion becomes too boring, sometimes painful, too loud (I sit in the middle btw), Recommendation: Watch it when you have nothing else to do."
    },
    {
      "rating": "0",
      "text": "Michael Bay has reached rock bottom with this one. Everything about this movie, from the incoherent story to the bland characters, is just plain atrocious. Easily a strong contender for the worst movie of 2017."
    },
    {
      "rating": "3",
      "text": "\"Transformers: The Last Knight\" was a film that was not to everyone's satisfaction, the story was bad, by no means had to do with the title, instead of titling, \"Transformers: The Last Knight\" This movie must be titled \"Transformers: The End of the World\" terrible performances, and excessive use of special effects, which were also lousy, undoubtedly the worst movie of the summer, and one of the worst of the year."
    },
    {
      "rating": "3",
      "text": "I DO NOT GET THIS MOVIE? They advertise that Optimus as an antagonist but it lasts for 5-10 minutes?! What was the point of the little girl as well? Why does the TRF exist now, they want to eliminate the transformers but didn't the CIA want to do that under the books in 4 and now the government is doing it? Also, now they are trying to get Cybertron over to earth again, didn't they try this already?Explain this movie to me please. Gave it a 3 for the cars, effects and all that transformers jazz.. otherwise I get why it's rated so low."
    },
    {
      "rating": "3",
      "text": "At this point, anyone familiar with this dead horse of a franchise should be well aware that they're getting what they pay for with these movies. Loud, mindless action with robots clashing and debris flying everywhere, little to no story, abysmal dialogue (with this film setting a new bar for that standard), and more and more explosions from none other than Michael Bay, who does it better than anyone else! Needless to say, this is exactly more of the same, and I personally found this to be the worst installment thus far! The nonstop action and mindlessness of it all had my restless leg syndrome kicking in full gear not even halfway through the film. The dialogue and corny moments with the characters in the film hasn't felt this absurd since some of the most truly awful moments from the second film, and the talent of all involved is simply wasted, there's no other way around it. It's bad enough that Mark Wahlberg felt the need to involve himself once again with this nonsense, but Sir Anthony Hopkins!? What was he thinking!?!?!? Overall, for those who still somehow enjoy the mindlessness of this franchise, great. For those possibly looking for redemption or getting their hopes up that this is somehow better than the previous installments in any way possible, steer quite clear."
    },
    {
      "rating": "2",
      "text": "After the messy Age of Extinction, I did believe this would be a big step in the right direction. But no... Just a LITTLE bit... BAD character progressions, scenes that are thorn apart by bad editing, feels like 5 different movies, lame humor (they had to destroy Hopkin's character and his butler whit that stupidity) and the story is just idiotic... Some great action, but not good enough to justify this mess."
    },
    {
      "rating": "3",
      "text": "Critics says Transformers is HOT Garbage of the summer and I thought Age of Extinction was boring but this!!! what the heck was Michael Bay thinking and how can people love this,this movie has a 4 user score.. in a nutshell: You can't have a Michael Bay film without Action scenes and EXPLOSIONS and CGI-Crazy pace-Boring Story-Cool Opening-I think I saw a horse did a backflip-The little girl from the trailers was barley in it.-Optimus was Evil for 5-10 Minutes+Cool Cars-TRASH DIALOUGE-Dragged out plot points of the history-Bad/stereotype jokes-Editors were on crack with the Pace of the story-They screwed the Transformers lore of Decepticon with Unicon as Earth-Vivian another Hot Megan Fox that Bay Bang to be in the movie-Makes no sense that Cybertons impact did not Destroyed the earth-Optimus and Bumble Bee's fight was nothing but a backgroundYou will cramp your pants talking about this movie on how bad it is on the end worst movie of 2017"
    },
    {
      "rating": "3",
      "text": "I didn't go to this movie expecting a brilliant story.  What I did expect was to be entertained.  I was not entertained. This movie was an absolute bore and about an hour too long.  I never thought the words boring and action would ever be used together.  But that is exactly what it was \"boring action\".  The story was convoluted, long and drawn out. My 8 year old fell asleep twice and I was actually happy he did. My 9 year old begged to leave early.  This was truly awful. Completely uninteresting."
    },
    {
      "rating": "3",
      "text": "well, I didn't have anything to share about this movie. The reason why I gave 5 before because this movie have a good action scene but I have to take it back to 3 or 4 because the director always giving to the audience the \"Same Movie\". But CGI is not good or not bad either --> (-)mediocre"
    },
    {
      "rating": "3",
      "text": "Transformers the Last Knight is the Transformers franchise going through the motion again, running out of steam.  It has zero continuity between the films, and while seeing the Transformers many years ago was a great novelty, here it is simply a slog to go through. Bay is obviously a talented director, but his tenure in this series is just way past overdue.  He has nothing more to offer.  I simply cannot fathom seeing another installment of this franchise in the cinema again."
    },
    {
      "rating": "6",
      "text": "It is worth watching the movie at least once in the movies or when you arrive at Netflix or a video store. Special effects are excellent, but the story has been kind of confusing and exhausting."
    },
    {
      "rating": "6",
      "text": "Two species which are not at war anymore: film critics and audience.The \"Transformers\" saga has come from more to less. Starting exactly a decade ago, Paramount Pictures broke into Hasbro toys, adapting them into audiovisual products, those metallic giants found on planet earth a provisional protection. Shia LaBeouf's rebellious young role, the eye candy who Megan Fox turned out to be, Michael Bay extravagances idealizing sequences as hilarious as showy and the narrative delusions implanted in a script that is out of touch, all the above imparted the rules by which the following movies would be ruled, without the possibility of an iota of irregularity. It has become evident that complaints about this franchise don't cease, however, the film studio doesn't step down by seeing the answer, ironically, positive at the box office, causing a disagreement of opinions between audience and reviewers. Nevertheless, the movie with the power to converge these two opposite poles in an exact point of embarrassing dejection, describing the most recent installment of Autobots and Decepticons with adjectives as very long, cacophonous, intelligible and sleep-inducing.Navigating more than seven scenarios, the story follows the customary leading role Cade Yeager, accompanied by unusual characters as, nothing more or nothing less, Merlin and the Knights of the Round Table, who are starting point for development of the plot; Vivian Wembley, the only living descendant who can take up his sword; Lennox, military captain who hinders goals of our heroes, Izabella, a girl who cures Autobots introduced to possibly inherit the unlikely franchise or the amount of coming spin-offs; Sir Edmund Burton, faithful sentinel of the genesis of Transformers; and the ideological troubles of two races that are at war in the same world, some humans and other metallics.Openly, the salvable compounds in this sea of nooks are limited, unnecessarily, convoluted and lacking any vestige of attraction, generated by a quartet of writers with highly utopian ambitions, which strive in opposition to a narrative barrier in which no longer keep the same expectations. Such information that slides through Nazi, alien, Mexican, Cuban, European, North American and even medieval settings causes, either from water, air or earth, the feature film feels exaggeratedly longer than the previous outstretched films. Action intervals are inscribed into the plot with decisive rigidity and aren't sufficiently suggestive to pretext the mechanical yawns turning up from the middle of the runtime and is rapidly intensified over longer final climax. As for dialogue, written at six hands by Art Marcum, Matt Holloway and Ken Nolan; It underlines coarse update surrounding the criticized racist misogynist manias of the franchise, which are enhanced by equipping the eye candy with Oxford university titles and doctorates, intellectual glasses and a heady black dress that makes evident that, in fact, nothing has changed. It's enviable the support that Paramount Pictures offers Michael Bay to quench his idealized film dementias, some grandiloquently materialistic and other exaggeratedly pretentious. I said enviable because, personally, I feel a strong connection with this directional kind, also evidenced by Jordan Vogt-Roberts in the recent \"Kong: Skull Island\", of course, referring explicitly to the visual aspect. Propagating with a striking commercial paraphernalia, the fifth installment in the saga is the first to be filmed, entirely, on IMAX 3D cameras, state-of-the-art devices that give majestic images, boasting technical capabilities that embroider the spectacular. Without a doubt, the talent of this director lies in cinematography, the knowledge to fit precise pieces that, here, are harmed by the arrhythmic editing work, emphasizing the variations of aspect ratios that the sequences ache, an unintentional distractor. Fleeting bursts, frantic chases, metal hits, shiny frames and whimsical landscapes file throughout the film, a summer cinema show lacking a good edition work and excitement.Announced in advance, the retirement of Bay and Wahlberg from \"Transformers\" franchise gives an air of hope and faith to restructure the unlikely future installments, since, what has been achieved with \"the Last Knight\", puts the plans of the studio at risk, seeing the unfavourable reception of both critics and audience. However, it cannot be categorized as an absolute film disaster because, although it contains flaws equivalent to the budget in editing, soundtrack and script fields; what the director and his artistic crew do with the scenes deserves enough merit to overlap the yawns and naps attempts in theatres. Yes, this is the only reason to see the movie, you've been warned, experience it in IMAX cinemas, with the largest screen and the most suitable position. Sit down, buckle up and try to enjoy this resounding candy conceived by Bay."
    },
    {
      "rating": "2",
      "text": "This film starts with a flashback scene that wasn't even somewhat needed. Normally a film would follow the tried and true 3 act structure, but Transformers 5 is different. It goes introduction, build-up, climax, build-up and then finally climax again. Another issue is the overlapping stories, at the start, it feels like there are 3 stories, a few minutes in they cross, then they split again but into 2 stories. They cross again at the end but it was so sloppily done that for a while I'd forgot I even had the criticism. This has to be one of the poorest, messiest laziest films I've ever seen."
    }
  ]
}