{"id": 1103, "title": "Transformers: Revenge of the Fallen", "starring": ["Shia LaBeouf", "Megan Fox"], "runtime": 149, "genre": ["Science Fiction", "Action", "Adventure"], "description": "Sam Witwicky leaves the Autobots behind for a normal life. But when his mind is filled with cryptic symbols, the Decepticons target him and he is dragged back into the Transformers' war.", "releaseYear": "2009", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/pLBb0whOzVDtJvyD4DPeQyQNOqp.jpg", "categories": {"plot": 4.3478260869565215, "acting": 4.3076923076923075, "ending": 5.75, "soundtrack": 5.0, "cinematography": 1.0, "familyFriendly": 2.6666666666666665, "funny": 5.090909090909091, "action": 4.714285714285714}, "reviews": [{"rating": "0", "text": "Just read the comments of those who gave it a 10. \"The girls were hot.\" \"Robots blew stuff up.\" \"There were lots of awesome swear words.\" \"The mom ate pot brownies.\" \"The chihuahua was humping a bigger dog (twice).\" If those things sound like something you would be interested in, keep in mind, those were the HIGH points of the movien, then by all means, go for it. I actually liked the first one and the action was actually quite good, but 0 to counteract all those artifical 10s."}, {"rating": "1", "text": "Somehow much worse then the first one. Somehow."}, {"rating": "2", "text": "If you can easily check your brain at the door (after counting out the price of the ticket, of course) then Transformers: Revenge Of The Fallen is for you.\rLoads of special effects, some juvenile \"humor\" and not much else will undoubtedly entertain, unless you tend to want more than a series of explosions with no reason behind them."}, {"rating": "0", "text": "Awful. There is simply nothing to redeem this film. Where do I begin to describe how thoroughly unpleasant an experience it was to watch this movie! From the very beginning one of the biggest problems is Bays inability to keep the camera static for even a second. The worst example of this is in a scene early on in the movie in which Sam and Mikaela are stood talking to each other in a romantic embrace, this had potential to be a romantic and engaging moment in an otherwise emotionally barren film, however Bay has the camera doing 360 degree whirls all over the place, completely ruining the moment. This is also true for the fights between the robots, when metal meets metal it"}, {"rating": "0", "text": "This movie was so bad that it made me enjoy the first one. I thought the first one was a bad movie. But now I can aprreciate the original for this turd of a movie."}, {"rating": "3", "text": "Final Review of Transformers. Overlong, under-plotted, no character development, and the fight scenes were shot badly. Predictable, not even a little bit fun. Only humor was racial stereotyped robots. That got old fast. And more plot holes than i could count. HUGE DISAPPOINTMENT. I loved the first one but this was one movie I considered walking out of."}, {"rating": "1", "text": "Typical Michael Bay tripe. Went because my son wanted to see it on IMAX. Sorry I spent any money on it. No thought required, just excessive overly crafted CGI battle after battle. Loud, obnoxious, pointless. The acting was extremely poor, the story almost impossible to ascertain, the jokes were very tasteless and near racially offensive. As someone who grew up with Transformers during my youth, all I can say is Bay's interpretation of the franchise is a complete travesty. Is this the future of \"blockbusters\"? Films where you pay $10 to shut off your brain at the door and go \"oo, pretty lights\" for two and a half hours? If so, count me out."}, {"rating": "1", "text": "We paid for a movie but"}, {"rating": "2", "text": "I love robots blowing each other up. And Meagan Fox is a huge plus, but this movie is terrible. It really could not have been any worse. The beginning for slightly interesting, then the whole thing after about 45 minutes goes down hill. The last hour is mind numbingly boring."}, {"rating": "0", "text": "Worst movie of the summer. If you are expecting 150 minutes of special effects with no story or characters then you will not be disappointed. Not suitable for young kids as there is animal copulation, foul language and offensive racial stereotypes. For shame Mr Speilberg, you have lost the plot big time."}, {"rating": "0", "text": "There are some movies that get better after you watch it a 2nd time. Maybe you missed a crucial bit of info or didn't understand some scenes. Transformers 2 is not one of those movies. Because I have a child who missed our first sitting, I've been forced back in to see it again, and frankly, I feel like I've been robbed twice!!!"}, {"rating": "0", "text": "All these 9-10 score reviews are probably the same 2 fanboy-losers in their moms basement (hey man! let's go online and keep posting how awesome this movie is!). Just go up the page a bit and look at the reviews. Read any review not written by a 17-year old boy whose testicles just dropped last week, and it is negative because this movie is just terrible. Just awful. If you like this movie, do the world a favor and hide somewhere please. And never speak."}, {"rating": "0", "text": "Quite possibly the worst movie I've seen in years. Racism and ingnorance about drugs aside, the cinematography and writing were terrible. And I actually enjoyed the first one."}, {"rating": "0", "text": "If there was a -10 rating I would give that to this movie. Fiasco of the century."}, {"rating": "0", "text": "Hey film studios lets take a ridiculously crappy actor... Say Shia LaBeuyfe That played in the worst channel that was ever on television... Say Disney. With the most ridiculous roles.... Say He plays a retard in a Disney channel movie and a poor comedy show as well... Wait its coming to me. And put him in everyone's action nostalgia movie. In which he just waters down all the good qualities that this movie can have... Say Transformers. Also, lets make the movie without an interesting/engaging story, so that his role is, in fact, meaningless. Sounds like it will be a hit."}, {"rating": "0", "text": "When my NINE year old nephew looked up at me and said \"This movie is very baaaaad. When will it end?\" You know this is a horrible movie."}, {"rating": "0", "text": "This movie is as dumb as paint."}, {"rating": "3", "text": "This movie looks good, but that's the only achievement it gets. Everything else about it plainly sucks and it is hard to recommend this movie to anyone, even elder kids."}, {"rating": "1", "text": "The first was OK, the second put me to sleep. (literally, my lady friend said I was snoring :P )"}, {"rating": "2", "text": "Plenty of action for a summer movie, the two hour plus movie promises to fill your time with plenty of random explosions and mindless acting. My biggest problem with the movie is the overplayed humping jokes, references to the male genitiles, and language. I would not take a kid under 13 to this movie however plenty of parents brought their 5 and 6 year olds. It disturbing to hear a 4 year old kid laugh at robots calling each other and humans b**ch, using the word p*ssy, and s*it. If you don't care about what morales you kids learn from movies then this is for you. I'm sad because I don't remember the first one being so bad."}, {"rating": "0", "text": "Over two hours of non-stop mayhem, but in a bad way. Michael Bay clearly does not care one bit about story, character or good humour. His only concern is for shiny metal and skin, big bangs and SFX budgets through the roof. The man is a menace to modern cinema. Probably the most mind numbingly dumb film I have seen since Batman & Robin."}, {"rating": "2", "text": "Too long and boring. Megan Fox is nice to look at, but that was about it. Trust the reviews and don't waste your money."}, {"rating": "10", "text": "That's weird, I was expecting the user score to be much lower based on what I heard on the internet. Goes to show this wasn't the worst movie ever, as there are a whole lot of other movies with lower scores (looking at you Twilight movies). Even if some of the guys who worked on this movie weren't happy with it, I still enjoyed it a lot, and hope the third movie will win some fans back."}, {"rating": "8", "text": "HATTERS!!!  POR QUE???!!!! This movie was actually pretty good, if you a enjoyed the first and had EXTREMELY high expectation then maybe this movie deserved a 6 at the lowest. But 2's and 0's really? Megan Fox was not the only extremely sexy reason to watch this movie! The old cast is back along with some new faces, animations are still spot on and killer, and the story wasn't terrible. From an actual human beings opinion, this movie deserves at least an 8.   DEFINITELY  WORTH WATCHING!"}, {"rating": "9", "text": "Great Movie! but the first one rocked . that's it. oh, found a transporter in france :)fun to watch: http://www.lookeen.net/de/352/allgemein/deutsch-e-postbrief-lookeen-stellt-sich-der-herausforderung/"}, {"rating": "7", "text": "It's true, Transformers 2 is a summer flick and people who go to see it shouldn't expect to be blown away by the story. It is part of a genre to be considered as the inverse of art-house cinema: it's not really made for those who \"don't get it.\"The movie outweighs its predecessor in terms of CGI action, which it is made to solely be. It is a movie about toys kids used to play with, this should be seen as some sort of ultra-high budget continuation of the original TV series intended for the children of this decade, only its film format makes it accessible for adults - and pure candy for the grown-ups who played with the toys.A demoscene could have sufficed to showcase the action sequences. If it were that, many critics wouldn't have bothered wasting internet bandwidth spitting all over Bay's face and instead would have focused on the more pretentious releases of summer 2009..."}, {"rating": "8", "text": "I dont really get the low marks over this movie,Or the Micheal Bay hating come to that.He makes great entertaining action films,fact.Sure,this isnt as good as the first movie,but its still very good,with still great characters,action,special effects & humour.Alhough i still think that it would've been better with the original G1 Transformer looks(especially Megatron in Robot form,& Optimus Prime in Vehicle form),& the original Megatrons voice.I found this movie highly entertaining & enjoyable at the end of the day."}, {"rating": "8", "text": "Why the critics and some moviegoers are terribly underrating Transformers 2? The script may be bizarre, but the story is amazing. Michael Bay is a mediocre director, but this film is not very bad; i say the same with Transformers 3, Â¡it's a shame that the critics have underrated that film and is the best of the series! Â¡Fuck the critics!"}, {"rating": "8", "text": "I had a friend a while back that made a good point about action movies; \"More.\"  You can always tell when some producer told a writer to go back and amp it up some more.  When it comes to a Transformers' movie, that's kind of all it takes to make a sequel work.  What idiot is seriously going to be super-upset that the characters lacked depth?  Dude, you're watching a movie about things going boom because big robots that turn into trucks and shoot plasma cannons while talking with James Earl Jones' voices have come to Earth to befriend and protect or enslave us all... Things going boom is the point of the movie.  How can you give it a bad rating when it does exactly what it's supposed to do.  Things went boom.  A lot.  In all kinds of different ways.  It was pretty cool watching things go boom.  Oh and they have like some PG-13 ****tease sexuality on display too, but personally... if you aren't going to go all Conan the Barbarian on that, then I say stick to things going boom."}, {"rating": "9", "text": "An awesome movie with super special Effects and super action, I have seen in 2009.Its better than the 1st one,huge battles and huge action is like the best,I've seen, high energy action and a big story.Michael Bay has really pumped up the action for this movie.I don't care if anyone hated this movie,they're crazy and stupid and don't know action movies.This is like the best movie of 2009,it has huge action set pieces that are so sick and exciting, enough said."}, {"rating": "9", "text": "I really enjoyed watching the movie... From the beginning it was tense and everything was unexpected. I also really enjoyed the special effects because they were very realistic and the fight scenes between the Transformers were done really carefully. The Transformers that were shown in this movie and didn't appear in the original were very amusing. I liked almost everything in this movie but the acting.. Megan Fox didn't give herself to the plot and didn't act as well in the first movie. I liked Shia's performance but the constant noise in the movie didn't really go as well as they taught it would.. After all, I'm still happy there will be a third movie!"}, {"rating": "8", "text": "pretty cool movie. i like most of Michael Bay's movies and the transformer series. But the story is sometimes confusing and bad. But the actions are still pretty good."}, {"rating": "5", "text": "Transformers: Revenge of the Fallen is a typical sequel. There are more explosions and battles. But the plot as it was not so and not. And the second time this is not so impressive. Delirium in history has become even more. The main point in the sequels is to give something new to the story. Adding even more explosions is unlikely to satisfy viewers over 14 years old."}, {"rating": "4", "text": "I really wanted to like this movie just like the first one, but unfortunately it's very boring & there are so many dumb jokes. There is some action in some parts I guess, but most of the time it's just uninteresting dialogue, as if the movie doesn't take itself seriously. The only good thing about this movie is Megan Fox."}, {"rating": "2", "text": "Let me start off by saying I've enjoyed the first for what it was but most of this film made me literally angry, it was so fucking shit. The dialogue/ characters was disastrous, Uwe Boll looks like a genius next to this fucking moron and 90% of the time in the fighting scenes I couldn't even tell WHY there were explosions and it just seemed like a shit load of metal sounds. It's also odd how the robots acted so much like humans in the way they fight/ act/ talk. I didn't pick up on that the first film but I did here, probably because there is much more dialogue scenes and so on which were NOT needed and yeah, just literally pissed me off over how dumb they were. Oh and when an old robot is re-activated he has a beard and a walking cane WHAT THE FUCK!? Fucking ridiculous movie that highlights everything wrong with American culture. The mom character especially. oh.my.fucking.god, she was so fucking terrible, I just wanted to stick a chainsaw in someone's eye. And no you can't say \"lol just go in it and have some fun\", that WAS my attitude before it started pissing me off with scene after scene of absurd idiocy. The humour pisses me off just thinking about it...When the dad slaps the mother's ass, the main douchebag guy says \"hey watch it, this isn't a rap video\"....Yeah...wow. And the way he says it adds to the annoyance. The effects were spectacular, I'd give it that. I loved when robots got sliced you could literally see very inch of metal, wires and whatever come apart and that was about all I've enjoyed along with some of the action scenes. And the overall story was kind of interesting if it was told better but it wasn't and unfortunately the great story that seemed to be in there just couldn't come out under such retarded direction which is a huge shame. 2/10."}, {"rating": "4", "text": "\"Transformers: Revenge of the Fallen\" lacks the mind-blowing blockbuster spirit \"Transformers\" originally had. All you can see is  messy clunky robots fighting with amazingly terrible cinematography followed by a brainlessly written script."}, {"rating": "0", "text": "This is, without exaggeration, the absolute worst movie I have seen in the last ten years. Not only because it's a million kinds of awful, but because of what it represents. Transformers: Revenge of the Fallen symbolizes not just everything condescending, cynical, and soulless in Hollywood, it stands as a testament to sub-crustal standards and the triumph of a strong marketing campaign over effort, talent and vision. Batman and Robin has been dethroned."}, {"rating": "2", "text": "This is not a movie, this is a scene from a video game that ran a half hour too long. Beautiful visuals paired with the lowest common denominator of what is supposed to be a script."}, {"rating": "2", "text": "This movie was pathetic. All it is, is the attempt to glorify the military power of the US, which are basically impotent to what ever battle the transformers are engaged in. I can't believe that the decepticons are so inaccurate with there weapons? and how Sam seems to outrun them every time and never the need for a sip of water? This movie doesn't deserve taking up HD space."}, {"rating": "3", "text": "One of the most worst sequels I've seen in a long time. See it and be bored out of your mind."}, {"rating": "9", "text": "I'm just a 12 year old boy but...EXPLOOOOOOOOOOOOOOOOOOOOSSSIOOOOOOONNNSSSSSS"}, {"rating": "3", "text": "The low point in a lackluster directing career. Transformers: rotf fails on almost... no every level imaginable. Poor acting (slow motion running + screaming random names), terrible design (transformer fights end up looking like scrap metal in a pile rolling), offensive and painful attempts at comedy (haha the hip hop autobots can't read and have gold teeth what a knee slapper.), and a barely there plot all help this 2 hr 27 min dud sink to the bottom of the barrel. If you've seen the trailer you have seen more than enough."}, {"rating": "2", "text": "Why is it that all these 2 1/2 hour long Michael Bay films feel like they're 4 or 5 hours long? It never ends with the and badly edited action scenes full of clunky-CGI , and the terrible humor, the incomprehensible plot, and the shallow characters both human and robot that I could never care much about. It goes on and on and on, and was overstaying it's welcome for me at about the hour mark. There are few amusing moments, some sparks of a decent special effects scene, but for the most part it's just a bunch mindless dribble that serves no purpose I can think of, not even on the basic level of entertainment for anyone above the age of 14 or so."}, {"rating": "0", "text": "Frankly, how bad could it be? Critics rip it to shreds, calling dumb, loud, and stupid, but it's a movie about giant robots smashing each other, so what did you expect? I expect Michael Bay to acknowledge that humans traditionally have brains. That's the problem with Transformers 2. You can complain all you want about the racist robots, the lame dialogue, the annoying human characters, and overstuffed action sequences, but it all comes down to one central problem. Yes, we all expected Transformers 2 to be loud, dumb, and stupid. The problem is that it is simply TOO loud, dumb, and stupid. It is loud, dumb, and stupid to the degree that it actually feels insulting as you watch it. The anger that possessed me during Transformers 2 was almost too much to bear. The idea that Michael Bay actually thinks we as a human race will tolerate something this stupid."}, {"rating": "7", "text": "Transformers: Revenge of the Fallen doesn't improve a thing on its predecessor if not even goes more down the hill. Never the less, you can not despise the fact that it is over the top fun, with visuals still a feast for your eyes!"}, {"rating": "10", "text": "Il secondo capitolo è sicuramente superiore al primo capitolo,con più umani,più autobot,più decepticon e con una trama molto più articolata,lunga ed accattivante."}, {"rating": "8", "text": "Revisada esta segunda parte de la saga \"Transformers\" tengo pocas cosas que añadir con respecto a la primera entrega. Muy buen entretenimiento. Yo me lo paso como un niño pequeño viendo destrucciones, acción y efectos especiales. Es mala, muy mala en cuanto al guión, desarrollo de los personajes, se saca cosas de la manga cada veinte minutos. Pero yo creo que esta película se la toma a risa el propio director, y se ve en muchas fases de la película, muchas veces se rie del americanismo, entre otras cosas.En definitiva, poco que añadir. Muy muy muy entretenida las 2 horas y media se pasan como 1h y 20 minutos, y por lo tanto, lo que yo espero de esta película me lo da con creces y la valoro por lo que \"espero - me da\" que es DIVERSIÓN a raudales."}, {"rating": "8", "text": "Just as good as the original. The story was great, and continued the characters stories very. Of course the acting and CGI are great, and it is even better than the originals. It is funny also, with some gross jokes though. It was enjoyable, and worth a watch."}, {"rating": "7", "text": "This movie has a lot of flaws, from the cringe-worthy dialogue to the lack of screen time for a villain that seemed incredibly promising to the countless annoyingly bad jokes, but I'm not going to nitpick. I had a blast watching this film and the visual were just impeccable."}, {"rating": "10", "text": "I personally love this movie, i can agree some of the parts go over my head a little. But other wise it's an awesome movie. All the characters have some good and bad things about them, like for example the twins Skids and Mudflap they can be funny but the are extremely racist. I also hate that they killed off optimus in the middle, They brought him back too life at the end but its still the fact that they killed off the most iconic character."}], "recommendations": ["teenage_mutant_ninja_turtles", "battleship", "the_mummy_tomb_of_the_dragon_emperor", "transformers_age_of_extinction", "doctor_strange_in_the_multiverse_of_madness", "the_legend_of_hercules", "dragonball_evolution", "legion", "shadow_in_the_cloud", "into_the_storm", "transformers_the_last_knight", "ghost_rider_spirit_of_vengeance", "polar", "gods_of_egypt", "transporter_2", "wonder_woman_1984", "xxx_return_of_xander_cage", "the_darkest_hour", "wanted", "skyline", "gamer", "volcano", "the_matrix_resurrections", "mortal_kombat_annihilation", "the_twilight_saga_breaking_dawn_part_1"]}