{
  "id": 4302,
  "title": "Transformers",
  "starring": [
    "Shia LaBeouf",
    "Megan Fox"
  ],
  "runtime": 143,
  "genre": [
    "Adventure",
    "Science Fiction",
    "Action"
  ],
  "description": "Young teenager Sam Witwicky becomes involved in the ancient struggle between two extraterrestrial factions of transforming robots – the heroic Autobots and the evil Decepticons. Sam holds the clue to unimaginable power and the Decepticons will stop at nothing to retrieve it.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sR2xIEBQUoIVPGZOOfnMrpRcUCV.jpg",
  "categories": {
    "plot": 7.576923076923077,
    "acting": 7.928571428571429,
    "ending": 8.5,
    "soundtrack": 8.5,
    "cinematography": 9.0,
    "familyFriendly": 6.0,
    "funny": 8.0,
    "action": 8.057142857142857
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Unbelievable! Exceeded all expectations! Thrilling, sad, funny, exciting all in one. This one is for old fan and new to be fan!"
    },
    {
      "rating": "7",
      "text": "Transformers is a fun, action packed popcorn flick with excellent visual effects and great comedic pacing, but is flawed with a generic script that lacks a serious tone as well as certain complexities that it should"
    },
    {
      "rating": "7",
      "text": "I think this was a pretty good movie, but i think they should have focused more on the transformers and less on the humans. About 70% of the movie was all about the humans, I mean, come on! Its called transformers, not people. For this I rate it a 7 and not a 9 or 10 which it could have got if showed more interesting content. I also didn't like all of the sexual content. Transformers is a kid thing, so I hate to see it turn into a PG-13 movie. Hopefully Transformers 2 won't be so bad."
    },
    {
      "rating": "8",
      "text": "From the very first speech, it was corny as hell. \"Ooh, save the world from the evil robot!\" And megatron, cybertron and all this other crap was just ridiculous. However, the film blended action and humour to make a great watch. It actually made me laugh out loud, especially the scene in the fat computer hacker's house. The action was fast and exciting, showing the US military as well as giant frickin robots engaging each other. It was kinda obvious from the start what was going on - the \"sound\" wasn't really mysterious or anything."
    },
    {
      "rating": "10",
      "text": "i put this at about a 9.5 but for this review i will give it a 10. This is a must see movie. Its very entertaining and has great actors and actresses. Its one of my favorite movies of the year"
    },
    {
      "rating": "8",
      "text": "This is a fun action movie. Its nothing spacial but I should keep you entertained from start to finish. The acting wasn't bad. Shia Labouff's part was acted very well. This movie shows that he is good for more than just comedy. This does have a descent story but what truly makes this movie enjoyable is the action. Its character development was not perfect but that doesn't mean its bad. It was tolerable it was actually quite easy to bare. Transformations look quite good and safistacated. Infact they were so good that I wanted to rewatch the movie and put it in slow mo just to see those transformations. Its understandable why some people don't like this movie. IF you don't like action than you would hate it. But for those of you who are action fans and you want to see somthing get blown up this movie is a must see."
    },
    {
      "rating": "6",
      "text": "this movie wasn't great, but it wasn't horrible either. Mike Bay could have done more back story but all in all it was pretty good.The effects were awesome and the plot was 10 times better than the lack of a plot in spiderman 3.I'm not saying it should win the best picture Oscar (not that the Oscar is very relevant anymore) but it was at least a fun movie to watch unlike Spiderman 3 which was the most disappointing pile of elephant dung I've ever seen."
    },
    {
      "rating": "7",
      "text": "It's really flashy and the action is non-stop...trademark Bay. But...the shots are too chaotic and the similar design of the Decepticons makes it hard to make out what is going on in the film at times. Instead of resulting in a heightened sense of excitement...it merely induces a serious headache."
    },
    {
      "rating": "10",
      "text": "i guess it's cool to be a hater in '07? guess we can't all be autobots...prime would be disappointed in you guys"
    },
    {
      "rating": "4",
      "text": "Não  grande coisa até que  um filme bom porém muito fraco em muito sentidos, tanto em seu enredo, como em seus personagens mal constrúidos e sua trama fraquíssima proporcionando um filme senso distribuindo mal sua duração ao longo do tempo que  rodado. Transformers não passa de um filme mediano cheio de cascata voando para todo os lado."
    },
    {
      "rating": "8",
      "text": "It is not, you should understand, a film for those who seek the solace of art. It is, however, the most straight-up, brain-on-standby, CG-buffed explosion of out-and-out fun the summer has yet delivered. Another of cinema’s great exponents, Alfred Hitchcock, would often despair of certain cinemagoers’ predilection for plot logic. He would ignore the cry of these ‘Plausibles’ and fiddle his books with rollicking suspense. Michael Bay, too, is no friend of the Plausibles, but his trick is to deafen them with ‘Bayhem’ (def: blowing **** up at sunset). Even amongst the geek-lore of sci-fi he remains more concerned with laying waste to LA than a redoubtable internal logic.\r It shouldn’t startle you to hear that the plot is ludicrous: a box (varying in size from a city block to a handbag — nothing in the movie is capable of sitting still) with the power to reconfigure machines into Transformers (at one witty point a drinks dispenser sprouts mechanoid legs and a cannon that fires cans at people) has ended up on Earth. As, currently, have these opposing gangs of super-robots. First stop is a dumb kid whose great-grandfather’s glasses have\rthe imprint of a map of the box’s location... Oh, forget it. Listen, good robots fight bad ones and we get in the way. The end.\r Bay has done himself a real favour casting LaBeouf as the excitable loser about to discover his first car has a big surprise under the hood. He shares the pop-neurotic jabber of a young Woody Allen with Tom Hanks’ steady charisma, a straightforward-looking guy who still shines like a movie star. A smart, natural comedian, he levels the bluntness of this toy story with an ironic bluster. Quite apart from his car growing legs, he’s been fidgety enough about the legs of classmate Mikaela (Megan Fox). Drunkenly lapped up by Bay’s lascivious camera, she still comes with a steel core (it’s not just the cars who’ve got hidden centres): Mikaela’s a whizz with engines, not that boys can get beyond her windshield. In fact, all the girls of the movie come moulded to a geek ideal: stunning and boyishly practical. In one of the overextended subplots we get Australian beauty Rachael Taylor as an NSA computer dweeb cracking the Decepticons’ code.\r The cast is at its best young: the older actors, notably Jon Voight and John Turturro as governmental stooges as slow on the uptake as many a parent might be, hammily herk and jerk as if undergoing their own internal shake-up. The film is least sure when mustering global peril, testing the waters of inference with an attack on an American military base in . The first suspects are the Iranians, and along the way there’s a few spry digs at the Bush administration, but any politicising is swiftly reduced to a potty super-Secret Service known as Sector Seven who’ve got Megatron in a deep freeze inside the Hoover Dam, and the film gets on with its juvenile doctrine of daft punk.\r As the ’bots show up for a big showdow in humanville, soldiers spilling about like ants, a nonsense/genius tribute to old monster-movies, it’s all about the Sturm und Drang of pure action. It’s a dream-clatter of robot-on-robot war to drive Craig Charles to drugs. On old Orson’s level — “big toys attacking smaller toys” — it truly delivers.\r It’s a shame, then, that Michael Bay can’t help being Michael\r The script may have rubbery legs, but the action is rock-hard. The surprise is the lightness of touch: treat as a comedy for best results."
    },
    {
      "rating": "6",
      "text": "This Transformers is way better than the sequels and it's an only needed installment. What Transformers is lacking is the excitement to keep me from watching the movie."
    },
    {
      "rating": "8",
      "text": "Remember the first time you saw Jurassic Park? Fourteen years ago, it was unlike anything that’d come before it. Special effects had brought prehistory to life, with warmth and wit bonuses amid the scaly carnage. Fast forward to 2021. Pension for some, kids for others, robots for all. You’ll sit there with your super-sleek cyber-phone, call up an old pal and say, “Do you remember the first time we saw Transformers?” Fourteen years on, it will be remembered as 2007’s jaw-dropper. Special effects have brought your childhood to life, humour and humanity bonuses amid the metallic carnage.\r A marriage of bombast and brain – director Michael Bay and exec producer Steven Spielberg – only time will tell how much influence the Beard had over the Bad Boy. An LA street battle, decimation ruling supreme? Pure Bay, as his exhilarating highway chase from The Island is vamped up with office block-sized mechanoids. The family squabbles in the Witwicky home of Sam (Shia LaBeouf), where he hides aliens from his parents? Sheer ET Spielberg. It’s a dichotomy shaping the whole film; one extended vehiclenoid money shot, spliced with a human peril drily summed up by LaBeouf: “I bought a car... turned out to be an alien robot.”\r Plot-wise, just ride with it. Plausibility be damned. The set-up’s brief: “Before time began there was a cube… Some wanted it for good, some for evil,” guffs the opening A–Z voiceover of how the Allspark (that life-giving cube, kids) wound up on Earth. The gist? The Autobots (goodies, on their way) must stop the Decepticons (baddies, already here) before they find it. The key to where the said Allspark is was imprinted on a pair of eyeglasses belonging to Archibald Witwicky who – back in the 1800s – stumbled upon Megatron (a nasty piece of work). The specs are now on eBay, with Archie’s descendent Sam having decided to hock them to buy a car…\r Robots aside LaBeouf is the star, impressing in two very different double acts. First there’s his sentient car Bumblebee, sent to protect Sam from the Decepticons. It’s the sort of car that plays ‘Sexual Healing’ when its owner’s looking to pick up the marvellously bendy Mikaela (Megan Fox, the pic’s hot-panted heroine). Touching in, yep, an ET sort-of-way, man and machine build a believable bond… A bond that LaBeouf’s second sparring partner, Agent Simmons (John Turturro), is eager to break. A member of super-secret agency Sector Seven, Turturro has a ball, spouting increasingly deranged one-liners (“Criminals are hot!”). Taking itself as seriously as any film based on a toy line should, it’s only old favourite Optimus Prime who falls victim to tone, his dull do-gooder struggling next to sidekick Ironhide’s snarl. (“The parents are irritating. Can we take them out?”)\r For every drop of heart and hilarity, though, there’s a giant metal fist, a mid-air shape-shifting skirmish or the cheer-stoking sequence where Autobots arrive in meteors. This is the stuff of pop legend over 20 years in the making, played out by boys on their bedroom floors. This is Bay’s territory and as special effects go, the robots are as “What the…?” as the Jurassic dinos. Flawless. However – peculiarly for a man whose films invariably clock in at the bum-killing mark – you’re left wanting more. The best film Bay’s made, it’s also his second shortest. In a summer of sequels full of worlds we know, the brevity of Transformers’ opening scenes leaves little time to settle, turning sidestories such as that of hacker Maggie (Rachael Taylor) into awkward diversions with many drifting off before saying bye-bye.\r But such complaints are piffle in a film blessed with an extraordinary sense of fun. It’s even possible to forgive the godawful sub-Linkin Park theme seemingly tossed together on a PS2 music generator. What’s more – if you’re looking for it – there’s Spielbergian redemption at play too, a childlike outlook suggesting an extraterrestrial attack is exactly what the world needs to heal our wounds. As the Decepticons strike, the US blames Iran, North Korea… But it’s not our war, it’s something bigger. We are, as Prime tells Megatron while hanging off a crumbling building and changing from a lorry, “a young species, much to learn.” We’re primitive folk in need of a unifying event to help us forget our earthly woes. This will do.\r The sense of occasion is undeniable as Bay, Spielberg, Shia and peerless special effects fashion what should be the hit of the summer. The start flitters, but this is a rare film that leaves you itching for more. Roll on the sequels."
    },
    {
      "rating": "7",
      "text": "While not better than the original series, it still remains a fun and enjoyable movie. I do agree that things need to be improved. Like megan fox\"s acting, why was she in this movie. She was so boring and uninteresting. Why did bumblebee pee, just why. And megatron only being in like 30 minutes of the movie. But what I liked about the movie was that the action is great. Peter cullun as optimus is still a triumph. The humor is sometimes funny. The autobot and decepicon design are a 10 out of 10. Optimus looks badass as a semi truck with flames. Bumblebee looks cool as a camaro, and the others all got great designs. Overall, it's a movie I enjoyed."
    },
    {
      "rating": "6",
      "text": "While Nothing spectacular in terms of script the acting is decent and is Michel bay's only good transformers movie compared to the others. Loads of action a decent story, and  topped off with decent not spectacular but decent acting especially from Sam witwicky who was better than the rest of the human cast makes this a turn your brain off and have fun for a couple hours flick. bumble bee and optimist prime expertly voiced by peter cullins make for a compelling robot duo the only transformers you will need is this one."
    },
    {
      "rating": "7",
      "text": "I had a lot of fun with this movie and it's a shame that every movie after this was horrible,not only is it cool to look at and not only does the action look great,but it's pretty funny which is shocking for a Michael Bay film however the human cast are what ways this movie down and if this was just focused on Transformers it could of been a great film. But if you want to see a Transformers film watch this film and you can probably skip the other ones."
    },
    {
      "rating": "8",
      "text": "Excellently balanced among humanity and complex visuals, Michael Bay's Transformers is a surprisingly efficient (and truly impressive) manner to bring back our classic characters to theaters."
    },
    {
      "rating": "10",
      "text": "One of the best movies I've ever seen. Megan Fox, Shia Labeouf, Josh Duhamel and Tyrese Gibson are jut amazing in this. The plot is outstanding and so much different to all the movies out there."
    },
    {
      "rating": "7",
      "text": "It was a fun, action-packed movie. Bay is an excellent visualist, the movie is packed with jokes. The movie should have focused less on humans and more on Transformers, though. The Autobots stole the show in every scene they appeared in."
    },
    {
      "rating": "10",
      "text": "transfomrers is live action film, it has optimus and is autobots who are live action robots they must find a cube before the murderous megatron, who has vengeance on autobots, watch transformers 2007."
    },
    {
      "rating": "7",
      "text": "Is a decent movie of action you probaly have a great time seeing this movie, and is a good adaptation of the original show. PD:A Autobot dies...cofcofcof Jazz."
    },
    {
      "rating": "8",
      "text": "Filme süresinden giriş yaparak devamını getirmek istiyorum. 2 saat 30 dakikalık süresiyle başta insana \"sonra mı izlesem acaba?\" diye düşündürtmüyor değil. Aksiyon filminde bu kadar süreyle ne yapacağız diye düşünebilirsiniz ki başta bende böyle düşündüm. Yılların geç kalınmışlığıyla birlikte filmi başlattım ve izlemeye koyuldum. Şunu söylemeliyim ki film gerçekten çok iyiydi. Savaş sahneleri çok iyiydi ve görseller muhteşemdi. Karakterlerin hepsi çok iyi iş başarmışlar. Normalde böyle filmlerde, amerikan askeri görmeyi falan sevmem. Hollywood'un saçmalıkları olarak görüyordum ama Hızlı ve Öfkeliden tanıdığım Tyrese Gibson yine çok iyi oyunculuğunu konuşturmuş ve az gözükmesine rağmen, filme mükemmel katkı sağlamış. Megan Fox için diyecek bir şey yok, sadece sussa 2 saat yine Megan Fox'u izleyebilirim. Harika bir detay. Her neyse daha fazla uzatmanın da anlamı yok ama arşivinizde kesinlikle bulunması gereken bir film."
    },
    {
      "rating": "8",
      "text": "A great mix of story, action, and comedy. They started with a great story, funny characters, and great CGI for the Transformers. They held the story for so long, and in a great way. The ending was full of action, but it was hard to focus on what was happening. Overall it was amazing, and worth a watch."
    },
    {
      "rating": "7",
      "text": "A fun, guilty pleasure, which is still the best in the series (which isn't saying much). An enjoyable flick but filled with Michael Bayisms, such as stereotyping and sexualisation."
    },
    {
      "rating": "10",
      "text": "This movie is amazing, loved this movie when i was a kid and still do. This movie has great special effects, a good written story. Everything is perfect with this movie."
    },
    {
      "rating": "8",
      "text": "Its a good way to start the transformers franchise ! but the problem was that they focused on the humans instead of the transformers! also this movie was funnny and exciting."
    },
    {
      "rating": "7",
      "text": "Transformers is in now way a great film. The characters are bland, the acting isn't great, and the story is all over the place. But this film has amazing CGI, great action sequences, great music, and an amazing villain, Megatron, played by the amazing Hugo Weaving."
    },
    {
      "rating": "8",
      "text": "No, it is not a smart movie, or a well written one, but this movie certainly has it's goods, and one can hardly deny it is fairly entertaining.The goods were pretty obvious. Stunning visuals, brilliant editing, mind-blowing set pieces, say about mister Bay what you will, he has always had an eye for the visual. And this is an absolute plus to all his work, basically. But we can also state that Bay's previous work, with a few exception, was nonetheless fairly disappointing. Transformers went further than just the visual shebang.The movie had a good sense of humor too. It was clear that everyone knew that one can hardly take a few car robots seriously, and so no one didn't. Which is a good thing. It made the movie one hell of a lot funnier. The actor's were cool too. Shia LaBouf is a great lead role, John Turturro, John Voight, Anthony Anders and others had really cool side roles, and they made the movie worthwhile.The only downs were the ridiculousness that often crawled onto the screen, of course fault to the slightly preposterous script. Usually I cringe with issues like these, but aforementioned points somehow made the movie awfully amusing. A great watch, especially in the cinemas, but maybe somewhat less entertaining to watch on a TV. be warned"
    },
    {
      "rating": "8",
      "text": "The only transformers film from the franchise that does the characters true justice, the action are unquestionably breath taking but Michael Bay always seem to focus on the VFX rather than the screenplay."
    },
    {
      "rating": "6",
      "text": "They should have stopped it right there. It was not perfect, but enjoyable."
    },
    {
      "rating": "8",
      "text": "The first Transformers movie is one of the best action-movies ever made. It's one of the most American movies I've ever watched, but that doesn't really matter, when there are giant robots fighting each other to death. All that packed into a story of a guy who just wants to get laid and you have a fun and entertaining movie, which I recommend everyone to watch."
    },
    {
      "rating": "9",
      "text": "Michel bay directed this but I love it it’s amazing for the first and I love the transformers"
    },
    {
      "rating": "9",
      "text": "People understandably like to talk smack about this franchise, but this first movie is honestly really good. They actually tried to make the humans interesting and entertaining to watch, the Decepticons all look distinct and are genuinely menacing, the Autobots have some personality, (and the scene where they have a meeting by the observatory is excellent) and the plot doesn't get too confusing. The CGI still holds up, and honestly looks better than a lot of other 2020s blockbusters.Basically, they actually tried with the first movie and it mostly paid off.Too bad the sequels failed to realize what worked about this movie and build up from there, instead never coming close to matching this one's genuine quality and effort."
    },
    {
      "rating": "6",
      "text": "With badass girls and impressive CGI, Transformers is a hell of a ride!"
    },
    {
      "rating": "7",
      "text": "I saw transformers in an Imax theatre, which made the special effects extra special though your neck gets tired of looking back and forth. The movie was relative to the cartoon back in the day but it wasn't completely true to it's roots in a few ways. The original Transformers came out before the internet was invented and in the movie, the alien robots said they used it to get all the information about earth. Shia Labeouf's charector was tracked down through ebay so i'm sure it's not the same plot though I don't remember what the plot was."
    },
    {
      "rating": "7",
      "text": "Michael Bay's Blockbuster \"Transformers\" has everything lock-n-loaded for the summer year; sexy chicks, transforming CGI vehicles, and explosions!!!"
    },
    {
      "rating": "6",
      "text": "Everything you can expect from a Michael Bay film... big, loud, and full of explosions and even more Megan Fox.\r While not an excellent film, Transformers can prove to be quite an interesting flick, although it can be long and confusing at times, also. I'd recommend it to fans of action movies, but any one else might find it too over-the top and too CGI heavy."
    },
    {
      "rating": "9",
      "text": "This live-action adaptation of the TV shows and the toy franchise tells the story about the battle between the autobots and the decepticons as they search for the AllSpark, a device so powerful that can turn mechanics into robots. When it lands on earth, Optimus Prime and the other autobots meet a boy named Sam Witwicky and seeks his help along with his girlfriend Mikaela to find the AllSpark and put an end to the decepticons once and for all.I saw the trailers for this movie, but I have missed my chances of seeing it in theaters. So, I waited to get it on DVD and viola! I now have the movie and I was excited when it met my expectations.Michael Bay did really well on his directing and the storyline was well-paced together. The cinematography and casting were great, even Shia Lebeouf and Megan Fox's performances were so good and they make a great screen couple. The Witwicky parents weren't given enough screen time, but I think they did pretty well with their comedic moments. The actors that voiced the autobots and the decepticons turned out to be great and they are just like the ones from the TV shows.The humor was so hilarious, and the best humor part was the pee joke which I really laughed during the movie.The action scenes were very darn good. I think that Michael Bay was a fan of action scenes from the TV show and did very well at shooting them just to make it look real.The CGI effects from the Industrial Light and Magic company was that good and it fits well for the action sequences.The music score was riveting and very cool and it gave some emotion in the whole movie.I am going to point that there aren't any negative things to say about this movie and the 57% rating is a little bit low for my expectations, so I'm going to give this pretty much a higher rating.4.5/5 stars"
    },
    {
      "rating": "9",
      "text": "Pure escapism, total in-your-face intense action from beginning to end. It is a fantastic movie because it makes you feel like a child with a new toy again."
    },
    {
      "rating": "5",
      "text": "The Special Effects are impressive, but the story and screenplay are as clunky and mechanical as the robots themselves. Not boring in the least,but the onslaught of effects has a mind-numbing affect on the brain. Shouldn't the effects be created to enhance the story, rather than a story created to add to the FX?"
    },
    {
      "rating": "10",
      "text": "Mr. Tea, your IQ's dropping steadily because you rated this film so low! I saw this 2 times and the second time it was as action-packed, entertaining and thrilling as the first time (which by the way was amazing)! Everything you would want in a movie"
    },
    {
      "rating": "9",
      "text": "I loved this movie, it was fun, action packed, adrenaline pumping, it was a blast!!!!  If you want to see a really fun summer action movie, look no further than Transformers!!!"
    },
    {
      "rating": "8",
      "text": "Full of semi-confusing action sequences, a down-to-earth lead, and surprisingly funny. Transformers is one of the most entertaining movies I've seen in a while."
    },
    {
      "rating": "7",
      "text": "Transformers is good movie with amazing special effects and a good cast. I wish the fight between optimus prime and megatron was better thought but, overall good movie."
    },
    {
      "rating": "7",
      "text": "This is a film made by Michael Bay for Michael Bay and does nothing but please people like Michael Bay. Fans will go wild for the robots and action lovers will melt over the dazzling visuals and action scenes. If there is anything wrong with this picture is the fact that it runs a half hour too long and grows rather mindless near the end."
    },
    {
      "rating": "10",
      "text": "This is the movie that introduced me to the amazing world of Transformers. Awesome action scenes and a great sci-fi movie overall. Thank you Michael Bay!"
    },
    {
      "rating": "8",
      "text": "Wow, amazing movie, really, when I watch the trailer of Transformers I think in two things: The first: Amazing effects, with an amazing story. The second: Other old cartoon to appear in the big screen, and the good part is some of the first. The autobots and decepticons are awesome, have much details, and all this explosions, and battles are epic, the characters be good, but some irritant [yes Sam]. The story is really good, not excellent, is good, have some interesting moments. But the rest is normal, any new. Transformers is a good movie, the better of this saga."
    },
    {
      "rating": "7",
      "text": "Nothing to expect from a blockbuster summer movie that people are ups and arms about, except some fun action sequences, with visuals, a feast for your eyes."
    },
    {
      "rating": "8",
      "text": "Transformers is a fun explosions movie.Autobots have never been more likable and the humans for once they seem to work here.I like Sam,and Shia's portrayal of him was awesome.Everything looked amazing with the visuals and while sometimes it does get a little to noisy it still works."
    },
    {
      "rating": "6",
      "text": "It is a wonderful movie robots good argument and an incredible direction of Michael Bay, and who knows also see Megan Fox as sexy as ever, but do not forget an incredible rivalry between Autobots and Decepticons."
    }
  ],
  "recommendations": [
    "transformers_dark_of_the_moon",
    "jack_the_giant_slayer",
    "bloodshot",
    "rampage",
    "hercules",
    "mad_max_fury_road",
    "bumblebee",
    "underworld",
    "the_meg",
    "thor_ragnarok",
    "guardians_of_the_galaxy",
    "the_fate_of_the_furious",
    "xxx_return_of_xander_cage",
    "teenage_mutant_ninja_turtles",
    "angel_has_fallen",
    "kung_fu_panda_2",
    "avengers_age_of_ultron",
    "pacific_rim",
    "the_last_witch_hunter",
    "into_the_storm",
    "san_andreas",
    "lockout",
    "thor_the_dark_world",
    "kong_skull_island",
    "underworld_awakening"
  ]
}