{
  "id": 122,
  "title": "Transformers: Age of Extinction",
  "starring": [
    "Mark Wahlberg",
    "Stanley Tucci"
  ],
  "runtime": 165,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure"
  ],
  "description": "As humanity picks up the pieces, following the conclusion of \"Transformers: Dark of the Moon,\" Autobots and Decepticons have all but vanished from the face of the planet. However, a group of powerful, ingenious businessman and scientists attempt to learn from past Transformer incursions and push the boundaries of technology beyond what they can control - all while an ancient, powerful Transformer menace sets Earth in his cross-hairs.",
  "releaseYear": "2014",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/54HFDOswRfShCr25Tvt7JaLiIaf.jpg",
  "categories": {
    "plot": 1.8444444444444446,
    "acting": 1.8235294117647058,
    "ending": 2.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 2.3333333333333335,
    "funny": 1.2,
    "action": 1.7037037037037037
  },
  "reviews": [
    {
      "rating": "0",
      "text": "One of the worst movies I have ever seen. Bay took a cliche gun and blasted everything in sight. Bad dialogue, wooden acting, terrible science, awful story."
    },
    {
      "rating": "1",
      "text": "Let's put cards on the table, alright? The first Transformers was okay. The second Transformers was, undeniably, a great piece of sh*t. The third Transformers was slightly better than it's predecessor, but it was still a piece of trash. Now, it comes the next installment directed by Michael Bay just to destroy the franchise once and for all (but still the film will, unbelievably, make 1 billion dollars).\r The film show us Cade Yeager trying to get money in order to put his daughter Tessa into college. Oh yes there's no Megan Fox, let's just put the chick from the \"Last Airbender\" into this excrement. And in case if you're wondering, YES, this movie has annoying characters just like the other three movies. Meet Lucas: The most annoying character in the whole film (Thank god he's dead), the guy was so stupid, so stupid that in the beginning of the movie he couldn't catch a ball right in front of his eyes.\r Later, Cade brings an old truck which is by the way, OPTIMUS PRIME!!!! What a happy coincidence!!! I was saying that he brings an old truck to remove and sell the parts (for the reason I already mentioned) and bla bla bla bla, why we need that character development anyway? Meanwhile, the humans try to hunt down the Autobots (even thought that Autobots save the Earth like, 3 times) for a very, very poorly conceived reason that my brain is still processing such an undeveloped plot element.\r When they find that Mr. Yeager hid Optimus in his barn, they go to his little house and the movie introduce us: Titus Welliver, yeah the guy with the sunglasses! Titus send his men to search the whole place in order to find Optimus and then Cade says \"Oh wait! You can't search my farm without an warrant!\", Titus replies \"My face is the warrant!\"\r *Stares in silence*\r *Sighs*\r Okay... I think I'm okay.  Moving on, Titus threats Cade's daughter and in the last second, Optimus shows up and says \"HERE I AM!\" Seriously? He couldn't just ripped off \"Dexter\" and say \"Surprise motherf*cker!!!\"?\r Cade and his daughter are saved by Tessa's boyfriend, oh yeah wait until you read this. Cade, Tessa, Lucas and Shane are running from the police and in the middle of the chase, Cade finds out that his daughter is dating with Shane and instead of just focusing in WHAT'S IMPORTANT, he starts arguing with Tessa!!! Yes, of course! When I'm being chase by dozen of police cars and police choppers, I'll just ask why my girlfriend didn't ate her cornflakes in the morning.\r There's a scene where Cade is fighting with Titus in a building and instead of picking up a knife to stab him in the neck or in the heart, he decides to use an american football. Really? I mean, really???!!!! Meanwhile, in the final battle (because I forgot the confused and meaningless plot, it doesn't matter anyway) Joshua becomes, inexplicably, a comedian. And, can you believe people actually laughed at Michael Bay's stupid comedy?\r After the end of the battle, Tessa realizes that they don't have a place to stay and Joshua says \"I think I might help you with that\". What a stupid miracle! Michael Bay didn't even tried to make a decent ending! For almost 3 f*cking hours, the filmmakers were kidding with my face. The narrative is overstuffed with crazy action sequences (that never end) and nonsensical plot elements, there is no plot, the cast knew the movie was **** but they didn't tried, the dialogues are so f*cking stupid, the run-time is too damn long, there's too much product placement, the character development is completely unnecessary and THE PEOPLE INVOLVED IN THIS SUBSTANDARD AND RETARDED MOVIE DIDN'T GIVE A F*CK ABOUT THE ESSENCE OF A GOOD ACTION MOVIE!\r This movie removes my taste for good movies. I wouldn't recommend it neither to my worst enemy."
    },
    {
      "rating": "2",
      "text": "Even going to this movie with low expectation set and telling yourself \"It's another Michael Bay's film, don't keep high hopes\" wouldn't prepare you for a total train wreck. Mark Walhberg's protagonist, polished actions sequences, shiny new Autobots and badass villian Lockdown,  won't be able to help cover the film's clunky plot, excessive characters and secondary villains, unlikable female lead and her useless boyfriend. Everything about this movie is either about the director's addiction with explosion and destruction or about nothing at all except its existence being another means to make more money for another sequel which we don't need. Either come up with a reboot or pass the license to another director like Guilermo del Toro. Stop making films this way, Mr. Bay."
    },
    {
      "rating": "2",
      "text": "I went into this movie wanting to like it.  I thoroughly enjoyed the first Transformers, I thought Revenge of the Fallen was awful, and Dark of the Moon was decent.  I figured Michael Bay would improve in Age of Extinction after learning from the mistakes from the previous movies.  I was wrong.  The story makes absolutely no sense, the editing is extremely sloppy, and Bay has this strange fascination with making Optimus Prime a bloodthirsty killer.  When it comes to the action and effects, Age is a step down from its predecessors, pure and simple.  Bay also had a very good chance to introduce a new villain who had potential to be so incredibly badass throughout the new series of films, but that hope is quickly washed away.  I can honestly say, this is one of the worst movies I've ever watched."
    },
    {
      "rating": "0",
      "text": "Honestly I can't find a worse way to WASTE 2.5 hours of my life and $12 than watching this. If you love lots of explosion, robots, mindless characters, bad dialog, bad directing, bad humor, too much action scenes and idiotic editing, then this is for you.\r You are better off watching Mythbusters. It has better explosions, smarter robots, better characters, better dialog, better humor, better editing and best of all, it is free."
    },
    {
      "rating": "1",
      "text": "CRAP that is all..... if you love the past 3 transformer movies well you'll probably love this crapfest and clap at the end, and think its a good movie! however everyone else can see that Michael bay has remade the same movie 4 FREAKING TIMES!!!! the same movie! again, crap acting (except wahlberg), crap dialogue, crap writing, crappy everything!!!!! gahhhhhhhhhhhhhh and whats worst is that this movie will surely make a billion dollars again because people are stupid and love to watch crap! you people go watch your crap, i will rewatch X-Men Days Of Future Past again for the 4th time a brilliant film!"
    },
    {
      "rating": "3",
      "text": "Urrrgghhhhh.... plausible storyline? nah. good dialogue? nope. good action scenes? negative. crappy jokes? check. heart felt conversations at the stupidest possible times? yessir."
    },
    {
      "rating": "0",
      "text": "This film is terrible. Much worse than the first and third, and even worse than the second. The action was solid, as I expected, but everything else was soooooooooo freaking bad that I have to give this film a zero. The plot sounded good on paper, but was executed so badly by Bay & co. The acting by almost everyone was so bad, even Kelsey Grammer and Stanley Tucci couldn't save this film. Along with soulless product placements (i.e. Bud Light & Red Bull), there were so many errors on the film set and the film disregards everything (and I mean EVERYTHING, plot and all) from the first three films. I thought the humor would be better in this film with TJ Miller in it, but the same poor humor reigned on from the previous films. However, the biggest problem in my opinion was the length. 2 ½+ **** hours was waaaay too long for a film like this. It's painful to sit there for that long, and if it were shorter, I would give the film more remorse. Lastly, there was such little explanation when it came to the Dinobots', who had a very limited role, and Lockdown's existence. Outside of the generally solid action sequences and good CGI, Transformers: Age of Extinction was a terrible film that I will (and hope i will) never see again. As good as the 1st and 3rd films were in this action-packed series, this series will probably go on the decline after this atrocity. Don't see this, even if you liked the first three films, like me."
    },
    {
      "rating": "2",
      "text": "Transformers age of endorsement! This pile of rubbish has more product placements than regular television. The characters were exciting a wallpaper paste and the visuals were pornographic. This is 165 minutes of Michael bay madness. If you wish to see this, don't think too hard about the plot or you will hurt yourself and make sure you are comfortable."
    },
    {
      "rating": "3",
      "text": "Slightly better than the second, which frankly sucked, and not as good as the third, which was mildly entertaining.  Even with his best heroic effort, Mark Wahlberg could not save this film.  He barely managed to be mildly convincing in his earnestness to save his daughter from all the evil humans and machines.  Admittedly, this in itself could be considered quite a feat given the incredulous stupidity of what constituted a plot.   Family discovers Autobot.  Everyone wants to kill Autobot and family.  They fail.  Autobots save family.  Family saves Autobots.  Rinse and repeat.\r What the first film had, and the third one at times achieved, were Autobots with whom the audience could at least identify.  This movie utterly lacked any semblance of the rapport that Shea LaBeouf had established with Bumblebee in the previous films.  Here Bumblebee was little more than a caricature.  Optimus was dogmatic and stifled.  All the machines, the Autobots most especially, were for the lack of a better word, soulless.  The movie would have been improved by removing all human/machine interactions.  When a Transformers movie would be better without any Transformers in it, then that in itself is sad statement."
    },
    {
      "rating": "0",
      "text": "I loved the first film, the 2nd was bad but it was not that terrible compare to that one. Seriously? No scenario, the acting is really bad, why all people try to save that ugly thin girl? The boyfriend is useless, and the whole story make no sense."
    },
    {
      "rating": "0",
      "text": "What could have ended up being a pretty decent action film is ruined by the overly long run time and poorly put together plot. Very disappointing that Michael Bay was allowed to return, This could have been the film that they \"rebooted\" the series with should they have put another director in his place."
    },
    {
      "rating": "2",
      "text": "Not that great. Felt more emotion out of the Autobots rather than the humans. Stanley Tucci was nice surprise, and so was TJ Miller's character (he's an actual comedian).\rIn summary, maybe rent if nothing else is better, or you like the series, otherwise you can skip this one."
    },
    {
      "rating": "1",
      "text": "Transformers: Age of Extinction is bland, boring, clunky and generic. The 'reboot' of the cast does nothing to shield the inevitable overlong Michael Bay money mayhem"
    },
    {
      "rating": "2",
      "text": "This movie should win a oscar for the worst movie of the year it hardly makes any sense that ratchet got killed by the military and that optimus was killing humans the only good thing about this movie is the last 45 minutes it would've been the best of the series if the story if decepticons and autobots switched like to make ratchet kill the guy who killed him and ksi was making autobots and then the decepticons get jealous and then make a factory then big war blaa blaa blaa the point is the movies rubbish oh yeah and one thing why didn't steven speilberg not direct it?oh yeah and bmaster if your reading this I accidentally pressed disagree when I actually mean I liked it like whoops"
    },
    {
      "rating": "2",
      "text": "Its as bad as I expected, its Michael Bay so what did you expect? There is something wrong with you if you expected a 95 percent movie here.\r The worst thing about this movie is that it took away the ONE thing Bay does well, big special effects loaded action scenes.  The effects looked cheap in this one and there were very few transformers in it.  Say what you will about him, he can do those like nobody else, its like all his talent is bunched up on that one thing.\r There are still many thing I don't understand about the series like why the hell do they shoot bullets and throw physical grenades? They are robots, why don't they shoot lasers like on the show?\r Movie logic issue, if these cheap new transformers turn into flying blocks when they transform then how are they killing them? They are like the T-1000 now so if you smash them can't they turn back into blocks then reform?\r can they drop the whole bumble bee doesn't talk thing? that got old 10 minutes in.\r biggest problem with the movie, the Dinobots... They are in 3 scenes, don't apear until almost the end, there are only 4 and they don't talk."
    },
    {
      "rating": "3",
      "text": "Transformers: Age of Extinction is the king meaningless trash. Unbearable length, endless action sequences, no story at all, way below average acting and a director that simply doesn't understand how to make a film."
    },
    {
      "rating": "2",
      "text": "A 2 hour 45 minute slow motion explosion fest mixed with extremely poor dialogue and as many shots of women in short shorts as possible.  To sum it up a Michael Bay movie.  D"
    },
    {
      "rating": "0",
      "text": "I wasn't even going to bother rating this movie, But people out there have to be warned about this god awful lump of trash.  Michael Bay is better than this."
    },
    {
      "rating": "3",
      "text": "\"Transformers: Age of Extinction\" 10 Scale Rating: 3.5 (Bad) ...\r The Good: The human cast is an improvement over the previous casts. While they were mostly in the way, they were at least mostly tolerable. The story, at least initially, wasn't bad. A black ops mission to kill all Transformers, while convincing the public/government that they are only hunting evil Decepticons, was promising. Kelsey Grammar was excellent as the film's human antagonist. When the Dinobots (finally) show up, it is a pretty amazing spectacle.\r The Bad: First off, the film clocks in at just under THREE HOURS. That is three hours of bombastic Micheal Bay action and at around the 1:15 mark, the decent story falls apart and becomes silly. Revolving around a rare mineral called \"Transformiam\" (I kid you not), we watch as Bay re-creates the first three films with the same scenes, same action sequences, and same silly dialogue. I'll give him credit, the potty humor was gone ... but Bay couldn't help but interject a series of one-liners from every character's mouth regardless of the situation. As in the previous installments, the robot villains are mostly drones devoid of any sort of personality and the overwhelming majority of them are targets that seem to explode on contact. Also, as usual once again, the humans seem invincible and had no problem jumping into a battle involving anywhere from 3 to 20 robots leaving a trail of destruction in their wake. I can suspend belief to an extent, but our heroes survived crashes, long falls, explosions, shrapnel, repeated hails of bullets, and all out attacks from Decepticons. Give me a break. Moderately better than the last two Transformers films, the fourth installment is just as messy, boring, and disappointing as it's predecessors. Bay clearly does not care about the mythology or story behind the Autobots and Decepticons and is simply using the license to make a horrible robot/alien invasion film. Purists and fans of the source material will once again walk away shaking their heads."
    },
    {
      "rating": "3",
      "text": "Michael Bay has officially hit the bottom, even in his standards; watch has he creates the ultimate 3 hour, repeated slow motion, Victoria's secret/ Budweiser/ beats/ Lamborghini/ other crap endorsement-filled, **** cast and their horribly bad acting movie that is \"Transformers: Age of Extinction\"."
    },
    {
      "rating": "3",
      "text": "Another million dollar waste. These Transformer films are all the same, massive budgets and lacklustre revenue. The story is poor, the characters are poor, the idea that a fourth instalment is acceptable is poor. Nothing about it sets it apart from previous instalments convincingly. The use of CGI is incredible, but misplaced, within an unworthwhile production that nobody will even remotely remember."
    },
    {
      "rating": "1",
      "text": "How can a movie about giant transforming robots shooting each other in the face be BORING?! It truly takes a master to fail so bad, that he could make a movie where after what feels like 4 hours of explosions leaves me snoozing in my seat.\rinsanely dull and prolonged. 1/10"
    },
    {
      "rating": "1",
      "text": "Thank god for the robots as the actors with a sub-standard script nearly ruin the movie!\r Bay - you dont have to only use lambos, paganis and other supercars - theres plenty of classics out there without (as an earlier reviewer said) choosing your cars like you choose your female actors - that being purely on looks with no substance!\r The movie dragged on too long to shoehorn pointless scenes in to what is a chaotic plot which struggles to keep coherence.\r Whilst we all accept a but of \"unrealism\" - Motorbike stunts which would leave people with broken limbs, flying vehicles crashing which would leave (unbelted/secured) passengers with a broken neck along with wahlbergs repeated whiney \"i love my daughter you're all that matters to me\" makes getting through the first half of the movie hard work.\r When wahlberg proceeds to use his men-in-black style cricket gun to obliterate enemies that optimus can't seem to dent with his sword I gave up on hoping for the movie to redeem itself.\r Frasier shouldnt have been in the cast - again another character who repeats his mantra, this one being \"ive worked 20years for my country, i have no money now i want to get paid\" - I would have preferred to have seen him killed off half an hour in.\r Stanley Tuccis unfortunate role as an ironic \"poor-mans\" tony stark billionaire attempt - his bipolar switch from greedy millionaire to selfless goofy romantic is really sloppy and non-nonsensical.\r I love good action scenes but the last hour left you with action-fatigue as bay rams in as many locations and city obliterating weapons as he can.\r galvatron was the main threat when his 50+ bots start trashing Hong Kong, but  then we switch to the bounty hunter for the rest of the movie, galvatron must take a coffee break for half an hour because he doesnt seem to get involved until after the autobots deal with the bounty hunter...\r For the next one bay - stick with 95% transformers as your cast or spend a bit more on the script before this franchise drops off a cliff."
    },
    {
      "rating": "1",
      "text": "I joined Metacritic purely so I could rate this latest pile of nonsense from Mr Bay. Even Dark of the Moon had a couple of decent moments during its bum numbing running time but now he has hit a real low. This is by far the worst of his films (I love Armageddon and The Rock). The plot is overblown and the running time far too long. I actually fell asleep at one stage (at about 5.50 pm) Far worst still is the script and I quote Male lead to 17 year old female love interest \"Take hold of the stick (gear stick), she's the best at it\". Stanley Tucci (shame on you Mr Tucci) has replaced Ken Jeong in the annoying slapstick role. Finally the picture quality looked positively Low Definition compared to the Planet of the Apes 3D."
    },
    {
      "rating": "2",
      "text": "I thought this one couldnt get any worse than the first trilogy. It did. I actually liked the first movie, every of the next was absolutely crap. If you want to have the same effect for less money you can watch a 3 hrs TV-AD of all these famous, expensive brands, where everything explodes. Wahlberg was ok, his daughter gorgeous."
    },
    {
      "rating": "2",
      "text": "Michael Bay..... go **** yourself. You think this is \"entertainment.\"  Then I guess ramming my **** in a blender and slamming th puree button is just a BLAST!! This was probably the worst experience I've ever had in a theater. I hated everything about this movie and as this trainwreck tugged along at a GLACIAL pace, my hatred for the people involved with the \"film\" and the people in my audience who were clapping, laughing and cheering grew to the point of pure fury. 2/10 - Abysmal."
    },
    {
      "rating": "2",
      "text": "Otra película de Transformers??? ¿de verdad? analicemos un poco las anteriores\rTransformers: Muy bien hecha, la historia, los efectos y las secuencias de acción son entretenidas y muy bien hechas (la mejor de todas)\rTransformers 2: Es increíble como la primera película es una excelente adaptación, si hubieran respetado el mismo estilo que la primera parte, no hubieran caído tan bajo, repleta de chistes malos, trama aburrida y lo unico que recuerdo es como un robot se follaba la pierna de Megan Fox\rTransformers 3: Mas de lo mismo pero con una duración de casi 3 horas...\rTransformers 4: MAS, MAS MAS Y MAS DE LO MISMO!\rla historia: aburrida, floja, sin chiste, lo unico llamativo son los efectos (Que en esta son cansados hasta morir) muchas explosiones, (Michael explosiones locas Bay) cansan, los chistes son tontos, dan pena, y su duración eterna hacen que sea insoportable."
    },
    {
      "rating": "0",
      "text": "This is a new low even for Michael Bay. This is the worst movie I've seen all year and worst of all, it's NO DIFFERENT THAN THE OTHER THREE. Michael Bay gives us the same exact movie and at this point, stop making these cash grabs! This is a terrible movie!"
    },
    {
      "rating": "1",
      "text": "How do you think this film turned out? Bad. Its not as annoying as the second one but it is a bore nonetheless. It has all the problems that the previous films have had but they are even more prevalent this time around and it doesn’t help that this film is ridiculously long making the whole lot of nothing overstay its welcome even more. This film makes me feel empty and lifeless. The new cast adds nothing to the film since they lack as much character as the characters in the previous films. Unless you are a die-hard Transformers fan and loved the previous films then you should definitely skip this one."
    },
    {
      "rating": "1",
      "text": "As an Michael Bay action movie, nobody could expect a serious story line, but it would be nice if we had at least some resemblance of a story, and that said story made as much sense as it could in context of fighting robots.\rInstead we have characters with no personality, no history, no context and are there merely to give the Transformers a bad guy to kill.\rThe whole concept of the seed makes no sense, and conflicts with the concept of the All Spark from the earlier movies. You don't transformium to make transformers, you just need the all spark.\r So, does the action save this film. No, not really. Nothing outstanding in the action stakes. Completelty forgettable scenes and nothing that stands out.\r All in all, save your money"
    },
    {
      "rating": "3",
      "text": "Watch the Honest trailers and Everything wrong with videos on youtube regarding Transformers Age Of Extinction that's all I can say................Bye"
    },
    {
      "rating": "3",
      "text": "Well the good news is Age of Extinction isn't as offensive as Bay's previous Transformer outings.\rThough the trailers promised something different this time around: more focus on character than bang, Age of Extinction quickly becomes more of the same big screen megalomania we expect from Mr. Bay.\rMass destruction, exceptionally incoherent and punishingly loud and long.\rBest watched in several sittings, Age of Extinction is an exhausting piece of American excess."
    },
    {
      "rating": "0",
      "text": "Ratchet dies.    ."
    },
    {
      "rating": "2",
      "text": "My opinion of this... \"movie\" has only deteriorated over time. The effects are actually WORSE than the previous installments, and the acting is also downright awful. I would give praise to Walberg and Tucci's performances, but they played characters so generic and cliché that it completely undermined their acting talent. In addition, there is an ABSURD amount of obnoxious product placement. It's almost as obnoxious as if you're watching a huge battle scene, and then one of the characters randomly turns to the camera, holds up a Bud Lite, and says some corny line ending in \"Drink Bud Lite!\" In fact, it actually almost does that in once scene. On to the dialog. It is so poorly written that I almost laughed at one point. Optimus is beating the crap out of the massive Dinobot Transformer who is supposedly Grimlock (even though he submits in under a minute) where Optimus yells out, \"We're giving you freedom!\" and then a few seconds later, when he has mounted Grimlock (Yes, mounted), he scrapes his sword against Grimlock's face saying, \"Defend my family, or die.\" Being forced to do something doesn't quite sound like freedom to me. Speaking of, there are Dinobots in this movie... I think. If they are, they're only in it for the last twenty minutes or so with about six minutes of total screen time, and their names are never spoken of once (hence why I said he was supposedly Grimlock; they never even tell you his name in the movie). Not to mention that some don't even look like Dinobots; a few look like botched genetic experiment involving lizards that got a few tons of rusty metal welded onto their bodies. Did I mention the plot is idiotic and a complete copy/paste from the previous installments? My last criticism, is the run time. This movie has all the content you'd expect from a Michael Bay Transformers wet dream (ten explosions per second, battle scenes erupting around random hot girl extras, an UNDERAGE girl for the movie's main hot chick, and a moronic plot), and seemingly has the length of a Lord of the Rings film. Also, don't just look at me and say, \"Oh you're just a guy who jumped on the Michael Bay hate bandwagon\", because I'm not. I'm one of the few people willing to go on record saying that I liked Dark of the Moon. That being said, I hope it carries some considerable weight when I say that this is an awful film.  Lastly, to those defending this garbage and saying that people who dislike it just don't know how to have fun with movies or some other stupid derogatory insult (seriously, I saw this one guy who said people giving this negative reviews should be hung), quit lying to yourself and realize that there are these things called opinions.  In addition, you can't say that this is good if it lived up to your expectations.  If you go in expecting this kind of crap and you get it, that still doesn't make it good.  That just means it was what you were expecting; they're two completely different things.  If it lived up to your expectations of being an explosions-fest with wooden characters you don't care about, you still can't say it's better or even as good as an action movie with good characters, good dialog, good acting, and a good story.  This has none of those.\r Verdict - 2.3/10\rSeriously though, the things some of these 'positive' reviews say just make me lose faith in humanity."
    },
    {
      "rating": "1",
      "text": "I thought the first 3 Transformer movies ranged from \"good\" to \"OK.\"  I had hope for better when I heard there was a new cast and new Transformer designs, but this is far, far worse.  The plot and editing are non-sensical.  I rented this through Netflix and literally stopped watching 2/3 of the way through because it was so terrible.  I have never done that before.  I give it a 1 only for the amazing special effects and I don't believe in giving 0's."
    },
    {
      "rating": "1",
      "text": "Just hit mute and fast forward to the fight scenes. The acting is worse then a B movie terror flick on the Scifi channel. The only redeeming value are the graphics and action"
    },
    {
      "rating": "3",
      "text": "-Pathetically stupid story\r-Laughable acting\r-You would wish all he human characters would just kill themselves\r-Generic Stupid bad guys (cant aim/always hesitate to shoot)\r-Bad guys cooler than autobots but stupid which is sad (as always)\r-Stupid people in movie keep calling giant human robots that speak english and act the same way as humans aliens...(im pretty sure xenomorphs feel insulted)\r-Stupid blonde survives unfortunately despite being incredibly stupid\r-fat autobot calls alien ugly (oh the irony..)\r-Good action\r-Decepticons look awesome as always\r Overall its **** filled with lots of 'WHY THE **** moments from me but still worth watching cause and ONLY cause of the action..and dinobots.....\r Do yourself a favor and just download it for free at torrent or something because its not worth your money and you can skip the **** of a storyline"
    },
    {
      "rating": "4",
      "text": "Mark Wahlberg didn't help at all by replacing Shia LaBeouf as the protagonist. He possibly made the franchise worse. I'm starting to think that it's not the actor, but the writers and director, that should be replaced."
    },
    {
      "rating": "0",
      "text": "Transformers: Age of Extinction is the worst movie I've ever watched. Transformers: Age of Extinction is the most boring movie I've ever watched. Transformers: Age of Extinction is one of the longest movies I've ever watched. It's running time rivals The Lord of the Rings movies. I absolutely hate Transformers: Age of Extinction.The only thing I liked about this movie was seeing Mark Wahlberg act and thinking about how he would make the perfect Nathan Drake. But of course something like that would not get me to budge from a 0/10. Oh, and what makes this movie even worse, is that I saw one of my favourite movies of all time in the next week! Transformers: Age of Extinction will always be my least favourite movie of all time until death!"
    },
    {
      "rating": "3",
      "text": "Michael Bay for sure had blew away more than we can suffer on his table of torturous Ka-Boom!\ran insult to a generation which tends to have you vomiting on your popcorn and choking to the point you won't be talking for days\r Director Michael Bay has returned and has officially ruined the Transformers franchise by taking a much larger tsunami dump into his faltered grade B- trilogy with a solid grade F reboot fourth installment\r the film had more lazy direction that you can notice most of the scenes weren't visually edited, more explosions, domestic violence that will scar your kids for life, more of Bay's signature explosive trademarks, hot girls with no shred of shame or morality, more favorite autobot deaths, gory retribution, new but unimpressingly lame Autobot characters, and probably Mark Wahlberg's biggest mistake since The Happening, starring alongside alongside new Bay girl of the year Nicola Peltz from the much more painful the Last Airbender, the film is so bad they found a lazy excuse to cut the filming and shift the entire remainder of filming to Hong Kong (also in an unedited shot you can see the Chicago Sears Tower WHEN YOUR SUPPOSED TO BE IN HONG KONG!!) a terrible gimmick to get more money at the Box Office by buying foreign nations to buy the film by filming it in their country overseas, that as an average american viewer, you can't stop it from being an elaborate staged box office success\r the franchise has suffered enough by the hands of the f@#% dyne-rector Bay who is probably the only director who gets away"
    },
    {
      "rating": "1",
      "text": "This is the worst film I have seen in years. How someone can turn a film with giant robots, dinosaurs, spaceships into the most drawn out boring rubbish is beyond me. pure dross."
    },
    {
      "rating": "3",
      "text": "Feeling tired when I see this movie. Michael Bay returns with his worn and dull formula, where we only see carcasses flying and explosions and battle scenes poorly made."
    },
    {
      "rating": "4",
      "text": "A marginal improvement on the last movie. Far, far, far too long. Most of the \"human\" element could easily of been cut. Wahlberg, Grammer and Tucci seem to be having fun in their roles and they make the movie a bit more bearable.\r The plot is an interesting one, however is so drawn out it can be little hard to remain vested. A real, real shame how little the Dino-bots are in the movie, but when they are there, they are awesome.\r The Autobots this time are a bit more flushed out and have a bit more personality. Likely because of how few of them there are. The villains on the other hand seem a bit disorganised in the focus. It seems Bay couldn't decide who the main villain should be, but concluded with an obvious tease to a sequel.\r Overall:\rTransformers AOE isn't terrible, even a bit enjoyable at times, but it drags on so damn much that it really makes it hard to even try to like it.\r Note to the Producers:\rIf you make a movie intentionally long, be sure that the screen time is utilized properly. Also, quit making all your female leads look like pin-up hookers. Seriously, WTF? There's a fine line between hot and smut."
    },
    {
      "rating": "3",
      "text": "I was coming into this film with expectations of mildly liking it like \"Revenge of the Fallen\", but I can't give it a higher rating than the red label because of the stunning visual effects and the great action sequences. Other than that, this movie is nothing."
    },
    {
      "rating": "4",
      "text": "Yet another disappointment from a transformers movie. It is just the same explosion after explosion and no story development what so ever. At least the vehicles are cool and Mark Walberg is good in it, other wise it would be a 0 from me."
    },
    {
      "rating": "2",
      "text": "Amidst the too constant explosions this movie is lazy and boring in almost every way possible. This has to have been the worst movie i'v ever seen for the budget used. Crapping on storyline aside(movies have their own take on things thats the way it is) there is little redeeming content to this film. The human protagonists are little more than simple character tropes, the gaps in logic you usually just chalk up to hey its a movie leave you feeling like your stupid or the director thinks your stupid, and the story is little more than action cliches strung together to make kinda sense. Who would have though the only thing keeping this string of farces from being wholly soulless was our shared hate for Shia Labeouf."
    },
    {
      "rating": "3",
      "text": "\" The Best GROUNDBREAKING  Transformers film ever \".  Every generation comes on by then a transformer movie releases and it has impressed me. Its 2014 Transformers get release so far the graphics are a perfection , I think that Erhen Krueger ( Co-Creator of Scream  3 also written the two previous transformers movies). Really made awesome transformers creatures realistic he was not the reason that transformers was not a disappointment). Mark Whalberg as a dad also the girl form the\" last airbender \" Nicola Peltz as the daughter( she was not the reason i wanted to watched the T4 or Whaleberg). I wanted to watch it because i seen the trailer it got me interested in seeing this movie. So far Shia LeoBouf is not returning i do not know what to say he was good in the  Transformers Trilogy also he was in basically in the war with optimus fighting the bad robots ( By the way he will not be returning for Transformers 5).  Mark  Whalberg replaced him which was something that Transformers needed he was outstanding in this film with that weird alien gun and actually fighting with it and doing things that  was able to do in the war his performance was a  great conflict between decipticons , war with the anti Transformers humans. I am glad megan fox was in this film she is not hot she is just a stereotype character who loves motor cycles and stripping  on it. LeBouf well he his performance in Revenge in fallen , Dark Moon and the 2007 Transformers were pretty awesome  which was an A+ performance. There are few stereotypes in this movie were the daughter has a secret boyfriend which the dad never knew about every father and daughter drama movie does that DING DING DING !. also where the girl gets caught in the ship with prime and all she did was scream and bang glass DING DING DING !!!!!!!!!!!! #stereotype. Thats whats Rosie Hunginton Whiteley did in Dark moon. Micheal Bay did it AGAIN !!!!!!!  adds stereotypes to his films. Its  Micheal Bay's fourth time directing the installement to the transformer series. Which he made T4 awesome and good direction and good adventure for bay directing.  i  reconsider directing transformers 5.Grade A+"
    },
    {
      "rating": "4",
      "text": "This movie shows clearly that the Transformers movie series has reached its limits and has nothing else to offer. Same formula as the others with the twist of Autobots and humans now being enemies. The new Autobot's design is very bad and none of them are likeable, I find them all very annoying. Same goes for the human protagonists. A complete lack of charisma."
    },
    {
      "rating": "3",
      "text": "Wow, this movie sucked. I liked Transformers 1 and 3 quite a bit and I was expecting to like this one. For a start the run time is atleast 20 minutes too long for a Transformers movie, the humans are really weak, even worse than Sam. This movie was written by the guy who wrote TF 2 in 2009 and it shows. The writing is **** dredfull.\r3/10 only because some of the action was pretty cool."
    }
  ]
}