{
  "id": 1514,
  "title": "Treasure Planet",
  "starring": [
    "Joseph Gordon-Levitt",
    "Brian Murray"
  ],
  "runtime": 95,
  "genre": [
    "Adventure",
    "Animation",
    "Family",
    "Fantasy",
    "Science Fiction"
  ],
  "description": "When space galleon cabin boy Jim Hawkins discovers a map to an intergalactic \"loot of a thousand worlds,\" a cyborg cook named John Silver teaches him to battle supernovas and space storms on their journey to find treasure.",
  "releaseYear": "2002",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zMKatZ0c0NCoKzfizaCzVUcbKMf.jpg",
  "categories": {
    "plot": 8.710526315789474,
    "acting": 8.3125,
    "ending": 10.0,
    "soundtrack": 9.625,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 9.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I am giving it a 10 out of 10 because it deserves it.\rThe animation was way ahead of it's time, the story was really good and the characters really gave me the feels. The soundtrack was great just like everything else.\rPeople were really narrow minded during the time it came out, they just could not get the meaning behind it.\rIt truly is baffling when you see stuff like Treasure Planet, Road to El Dorado and Sinbad have such bad scores, all of them are so underrated.\r This movie gave me so much feels and by the end I felt so bittersweet, when I saw Silver's face in the clouds...\r10/10 re-watched it a bunch of times already and the soundtrack is replaying in my phone constantly."
    },
    {
      "rating": "8",
      "text": "Treasure Island in space? very amusing for a clever movie."
    },
    {
      "rating": "8",
      "text": "I know Treasure Planet just isn't the animated movie Disney had hoped for, but still the film flopped at the box office and it really hurts. But I haven't seen the movie yet, I've heard it's a good Disney movie and it may not be the best Disney movie just yet, but the animators just did a fantastic job on how the film just took exactly 10 years before the film's release in 2002 and the story looks a little familiar, but the acting is great, the CGI elements are incredible and even though it's still a cult following as of today, I think I might give it a go and buy it on Blu-Ray. Treasure Planet is a must-see. Maybe one of the most underrated movies in Disney history."
    },
    {
      "rating": "9",
      "text": "Treasure Planet has not been greeted with negative reception, by any means. But compared to other Disney films, the response has been lukewarm at best, and Treasure Planet was a major box office flop. But here's the catch: It's really good. Like, really, really good. Treasure Planet is inspired by the Robert Louis Stevenson's classic, Treasure Island. Having not read the book myself, I cannot judge how closely the movie follows the book (my guess is not much due to the fact that this is an outer space adventure), but it provides a wonderfully entertaining yarn anyway. Jim is something of a rebel, but it's mostly his Dad's fault for leaving him and his mother at such a young age. Jim is constantly in trouble with the law, and his mother doesn't know what to do with her nearly-adult son. But when Jim gets a map from a deranged sea captain, Jim hopes to redeem himself and bring back the gold of Treasure Planet. A canine friend named Doppler tag along, as the two sail on a ship with a questionable crew, a cyborg cook named Mr. Silver, the captain named Amelia, and a host of others. The characters are instantly memorable. Yes, we have the stereotype \"cute\" character in the form of a shapeshifting alien named Morph. Yes, we have the stereotype villain in the form of a sneaky spider named Scroop. And yes, we have the stereotype \"humor\" character in the form of a robot named B.E.N. (who I didn't find all that funny at all). But there's a slew of original characters elsewhere. The protagonist, for example, Jim is a slightly different glove than the kind Disney usually likes to wear. Far from perfect with a messed up moral compass, Jim is rebellious, and doesn't like to take orders, but we see him change throughout the movie into a much more respectable chap. Likewise, Mr. Silver, who is the film's primary villain, never really knows if he wants to help Jim, or deploy his villainous plot to take the booty of Treasure Planet for himself. He's an interesting villain, far more interesting than almost any other villain that Disney has brought us so far. The visuals are incredible. Stunning. Really some of Disney's best. The same technology used in Disney's, also gorgeous, Tarzan film has been employed here with even better results. CGI backgrounds and often props mix with traditionally animated characters creating a visually superb film. And of course, Treasure Planet is hilarious. While B.E.N. is more than a tad annoying, he has some redeeming lines, and there are lots of other humorous characters as well. Captain Amelia gets a lot of great lines, and Doctor Doppler is equally funny. The score was unexpectedly wonderful. This is really some of Disney's best work in the music department. Composed by James Newton Howard (a composer I've had mixed feelings about), the score balances emotion and playfulness skillfully, applying enough strong, triumphant tunes as well for some of the more grand scenes. Unfortunately for Treasure Planet, there is a montage that occurs just before the halfway point, that was just screaming for the score to kick in and deliver the musical masterpiece to get it nominated for Best Original Score. Alas, Treasure Planet has decided to insert an incredibly irritating lyrical song instead. The song has an extremely loud and annoying sounding drum section, and an ill-fitting electric guitar. What could've been the centerpiece of the film, turns out to be the worst part, and this really is a shame. Treasure Planet shocked me by delivering one of Disney's best films so far. There's an abundance of memorable characters that you really care about, beautiful animation, and it's naturally hilarious. And while these are all important traits for a film, Treasure Planet also has something even more important: A heart. Treasure Planet doesn't settle for artificial sentimental stuff that so many other films have adopted and use only to attract a broader audience. Treasure Planet brings us a genuinely emotional film that I will not soon forget."
    },
    {
      "rating": "8",
      "text": "It may not be Disney's greatest masterpiece, but I strongly urge every Disney fan to see this movie at least once to support it. This film is beautifully made, it has great visuals for a 2-dimensional animated film and I like the whole concept of it being a space themed version of the classic novel Treasure Island. Unfortunately this film was a flop in the box-office and it's such a shame that not a lot of people gave this movie a chance; so I insist that you to see this film if you haven't already. This is a misunderstood film that you should see."
    },
    {
      "rating": "10",
      "text": "This movie was amazing.\rThe interactions between Jim and Silver felt so natural and heart warming,\rIt's a shame that critics like always - don't understand anything...\rThey rate movies with one-dimensional villains and goody-two-shoes protagonists as masterpieces while this unique gem with utmost quality lives under the shadow of alot of other inferior Disney movies that people refer to them as masterpieces and classics.\rThe animation was jaw-dropping, it holds up extremely well even by today's standards. Imagine this animation back in 2002, what did people think when they saw it? This was so ahead of it's time. Way ahead of a time where people could not recognize a masterpiece under their nose.\rThe music was phenomenal. Goo Goo Dolls outdid themselves with the ''I'm still here'' song."
    },
    {
      "rating": "10",
      "text": "I watched this movie at a young age, i re-watched it and was not disappointed, it has withstood the test of time. My favorite Disney film upset that its not remembered more because it was not advertised well."
    },
    {
      "rating": "8",
      "text": "Treasure Planet is one of Disney best films. Even is not so faithful to the book, the film works very well in animation, characters and script. It is one of the best Disney classics."
    },
    {
      "rating": "9",
      "text": "esta película es mas de lo que creen, una aventura nunca vista, calidad sonora de primera, merece mas de lo que le han dado...una de mis peliculas favoritas de la infancia sin duda alguna."
    },
    {
      "rating": "10",
      "text": "One of the best disney movies ever but not for extremely young kids if you dont approve of slightly adult themes and some minor violence but its basically a pirate movie so that should help you understand how adult it is. Great Story, Great Characters, Amazing Animation even for modern standards and some of the best work disney has ever done"
    },
    {
      "rating": "8",
      "text": "Una de las películas 2D de animación de Diseny más infravaloradas de la historia inmerecidamente. Consigue adaptar perfectamente el clásico \"La Isla del Tesoro\" de Robert Luis Stevenson a una versión animada de ciencia ficción que hará las delicias de niños y adultos. La gente de mi generación creció, entre otras obras de Diseny, con el Planeta del Tesoro, y si en algo coincidimos todos de pequeños es que a esa edad, consiguió robarnos en corazón. Con personajes carismáticos e icónicos, una calidad sin igual y un respeto por la obra original tomándose ciertas libertades para hacerla más dinámica, el Planeta del Tesoro es, en mi opinión, una excelente película animada de aventuras.Además, posee la única canción de Alex Ubago que tolero o que consigo acabar de escuchar sin dormirme, lo cual es un mérito tanto para Disney, como para el cantante, como para mí. Muy recomendada."
    },
    {
      "rating": "10",
      "text": "This is one of those few movies where I don't agree with the critical reception, why the mixed reviews? This movie is one of Disney's hidden gems, a truly underrated animated masterpiece that deserved way more appreciation back when it was released. The story is emotional, heartwarming, exciting, intense, it makes you laugh, cry, feel tension, it's the complete experience. This is an almost flawless movie.The animation is gorgeous, the mix of  heavy use of CGI and the 2D animation holds up surprisingly well even nowadays. Honestly looks better than some totally CGI Disney movies like Frozen.Most of the characters have a well developed personality and the chemistry between Silver and Jim is geniune and heartwarming. There are many characters and most of them are pretty one-dimensional, sure, but the ones that are important to the plot are likable, memorable and charismatic. Jim, the protaginist has an arc, he's a little unlikable at first but his character grows and learns and we see someone completely different once the movie comes to an end. B.E.N. is honestly a little annoying comic relief that ruins the pacing and tone of the movie a little bit but he has very little screentime so I'm okay with that and it doesn't change my opinion of the movie.The score and action sequences are amazing and exciting. The song \"I'm still here\" is one of my favorite Disney songs ever and just like this movie, it's pretty underrated.A movie that was overshadowed by CGI movies that were growing in popularity, I guess it came at the wrong time in animation history, because this is truly an animated masterpiece. One of my favorite Disney movies ever and one of my favorite animated movies of all time."
    },
    {
      "rating": "9",
      "text": "It has the grandeur of a space opera, the ride of Disney at it's best and characters moved me. A Disney classic which deserved much more recognition at the box office."
    },
    {
      "rating": "9",
      "text": "This movie is great when it comes to detail. Even if something is on the screen for less than a couple of seconds, whether it be the whirring of John Silver's cyborg arm or the huge bird things on the moon base thingy, It looks absolutely AMAZING! I liked it, mainly for the visuals, and the idea of Treasure Island In Space."
    },
    {
      "rating": "9",
      "text": "I loved the blend of CGI and 2D animation. An incredible visual masterpiece.  You still have all the old great qualities of the Disney name and some new additions. Some great voice talent from Joseph Gordon Levitt, Martine Short and others. It also happens to be an incredible tear jerker."
    },
    {
      "rating": "10",
      "text": "I'm 14 and this is one of my favourite Disney films, like, EVER!!!!!!!!!!! the music is great (I hum it to myself all the time) and if Jim was real and went to my school none of the girls would ever leave him alone! (I'm not being creepy or anything, I'm just trying to say he looks cool.)"
    },
    {
      "rating": "10",
      "text": "I know that a 10 out of 10 rating might seem a little overzealous, but I honestly believe it deserves it. This is by far one of the best Disney films ever made. It spans both the \"classics\" era and the \"new animation\" era beautifully. It manages to have a level of depth that entices older viewers, while it stays kid friendly by having a basic plot that's easy to follow and humor that they can understand. It has a phenomenal cast and an outstanding soundtrack. I don't understand the reasoning behind the bad reviews this movie gets, but it definitely doesn't deserve it. It's a shame that it managed to slip through the cracks between the other kid movies that came out around the same time, and it deserves much more recognition than it has gotten. This movie is absolutely wonderful and I recommend it to anyone who likes Disney, old or new, enjoys good music, has ever been underestimated, and has dared to follow their dreams and prove themselves."
    },
    {
      "rating": "10",
      "text": "A film with a delicacy for young children, but with a theme that extends out to those not so young. Although a basic plot, this film is full of magic and fantastic music. It's a film to be enjoyed by all."
    },
    {
      "rating": "8",
      "text": "Although the characters could have been stronger this is still a pretty under-rated film."
    },
    {
      "rating": "8",
      "text": "Highly entertaining film with excellent animation, writing and music. Very funny."
    },
    {
      "rating": "8",
      "text": "I utterly adore this movie. While it isn't Disney's best work, it is my personal favorite. I'm a huge fan of anything pirate themed and an even bigger fan of Treasure Island. While it doesn't go anywhere near levels of depth the book had, but for a Disney Sci-fi take on it, it was very good. There is allot in the movie you need to take with a grain of salt, it is an animated movie about space pirates after all. If I had to make one criticism, then it would have to be the robot Ben. Martin Short's performance is just too over the top and it just doesn't feel right in regards to the rest of the characters in the movie. Overall: A great movie, that will always be one of my Disney favorites."
    },
    {
      "rating": "8",
      "text": "Sure it isn't perfect, but then again, few movies are. The visuals are a delight to look at, with a wide range of colours, and the art direction is much better than it is in most direct to video sequels. The music is lovely too, not the best score in the world, but I liked it. However, the story is very overly-familiar and some of the characters aren't quite as convincing as others. Be thankful that the voice talents are so good, like Tony Jay lending his distinguished voice as the narrator. Emma Thompson is lovely as Amelia and makes the most of some witty dialogue, and David Hyde Pierce impresses as well. Martin Short is good as BEN but his character isn't quite as appealing as the others, Morph was one of my favourites. I liked the idea of making Silver a cyborg, and Brian Murray does a respectable job, and Jim, while slightly bland to start with was appealing. All in all, a well done animated film, that is only let down by slightly unoriginal plotting. 8/10 Bethany Cox."
    },
    {
      "rating": "10",
      "text": "I liked the animated film, but the note is intended for games that made me dream of a universe not so clean and yet I feel like at home. Interstellar Piracy is a great movie! The dream is finally can be beyond the stars.J'ai aimé le film d'animation, mais la note est destiné aux jeux qui ma fait rêve d'un univers pas si propre et pourtant je m'y sens comme chez moi. Piraterie interstellaire est un excellent film ! Le rêve est finalement peux être au-delà des étoiles."
    },
    {
      "rating": "9",
      "text": "Great movie and animation, I love this movie, it feels so magical every time I watch it."
    },
    {
      "rating": "8",
      "text": "Fairly UnderratedThough it’s definitely not as good as Lilo And Stitch, Treasure Planet  is still another fun Disney flick."
    },
    {
      "rating": "10",
      "text": "The most inedited movie of Disney, this was to be a classic remembered because it is rich in characters, art and soundtrack, hard to stop watching!"
    },
    {
      "rating": "8",
      "text": "Al igual que la película de Atlantis el imperio perdido, esta película ha sido muy infravalorada y compartido el mismo desastre en cuanto a dinero recaudado. Y si, comparte algunos de los fallos de esta misma como la falta de desarrollo de algunos elementos que la trama introduce o los personajes en cuestión. Sin embargo, si dejas pasar todo esto, la sensación de aventura es espectacular. Los escenarios y la animación también han envejecido increíblemente bien para los estándares actuales, con un uso del 2d/3d impecable que no se nota para nada forzado (lo que explica por que se gasto tanto dinero en desarrollar la película en primer lugar). Y en el caso de la historia, si bien faltan desarrollar varias cosas, me encanta todos los géneros que toca y los personajes están llenos de vida. Son muy memorables y te acordaras de ellos... Muy recomendada. Pudo ser mejor, pero se merecía ser mas valorada por todo lo que hizo."
    },
    {
      "rating": "10",
      "text": "Remember one of the first movies i watched when i was a kid, such a nostalgia, characters, Music, atmosphere all of them are fantastic 10/10"
    },
    {
      "rating": "10",
      "text": "There is a 75 character minimum for reviews. If your review contains spoilers, please check the Spoiler box. Please do not use ALL CAPS. There is no linking or other HTML allowed. Your review may be edited for content."
    },
    {
      "rating": "10",
      "text": "Too many lines of this film are sculpted in my memory: truly a masterpiece, unfortunately not recognized as such"
    },
    {
      "rating": "10",
      "text": "great, underrated movie.  Amazing animation technique, great story and music."
    },
    {
      "rating": "10",
      "text": "One of the most underrated movies of all time. Beautiful animation. Great world building and characters"
    },
    {
      "rating": "10",
      "text": "One of the best and underrated Disney movies ever, a great rivisiting of Treasure Island"
    },
    {
      "rating": "10",
      "text": "Although it hurts to know Treasure Planet was never a financial success, it's still one of those movies that is branded into my brain. Disney might've forgotten about their masterpiece, but Treasure Planet will always be treasure to me."
    },
    {
      "rating": "8",
      "text": "La pelicula no recibió lo que merecía por parte de la critica, pero puedo decir que me encanta El Planeta del Tesoro, la calidad de la animación es fantástica y si bien no es perfecta; es una buena experiencia verla, siempre y cuando estés concentrado, la pasaras muy bien viéndola"
    },
    {
      "rating": "10",
      "text": "This is my favourite Disney movies I have ever seen. The visual content, the charachters, the story and the soundtracks are incredibly great. I don't know, how get bad ratings, but this movie is very UNDERRATING."
    },
    {
      "rating": "8",
      "text": "i think this film has ben severely underrated i really like how the film handles the relationship between John Silver and Jim Hawkins as similar to a father and son and the other characters are pretty decent too with the exception of B.E.N.\r it has it's issues with the design choices but i loved the animation and the voice acting is great, it doesn't change too much from what made treasure island great (apart from the obvious)  and i would love to see the movie get more respect"
    },
    {
      "rating": "8",
      "text": "Treasure Planet is any adventure in space looking for your average treasure. Based on Treasure Island, this one manages to stay true to the book it's based on. Pirates in space as well? Oh boy, better start calling them space pirates because no normal pirate can live in space unless they're willing to put up a fight to get the treasure."
    },
    {
      "rating": "6",
      "text": "Ehhh...Kinda out of the point, but still \"Treasure Planet\" is a well made decent animation you'll survive."
    },
    {
      "rating": "0",
      "text": "Instead of opting for a movie called \"Treasure Island,\" Disney made the ridiculous mistake of making this pile of gimmicky garbage called \"Treasure Planet.\" Personally, I blame this movie for destroying 2-d animated movies in the early 2000s, and I was really disappointed by Ron Clements and John Musker here, considering they've created the masterpieces \"Aladdin\" and \"The Little Mermaid.\" Thankfully, they and Disney were able to redeem themselves by creating \"The Princess and the Frog.\""
    },
    {
      "rating": "6",
      "text": "Although it has great adventure and action with fantastic animation. It is very forgetful, with not memorable characters, lines or a story. I give this movie 56%."
    },
    {
      "rating": "6",
      "text": "The biggest problem I had with this movie is that the characters are very forgettable. This movie had a big problem with the run time. The character needed much more time too develop for you to get really interested in it. Though I must say I found the voice acting really interesting and good. But as I said I believe this movie needed much more time like 2 hours. I have already forgotten most of the characters name. I think however the movie had a interesting plot especially when it comes to creativity. The monsters are very unique and interesting to watch.  Whatsoever I have too give this a lower score, we have to stay true to criticizing. The movie needed a longer time to develop and enhance it's characters."
    },
    {
      "rating": "6",
      "text": "Buena pero no excelente, la historia y personajes son buenos, la animación excelente para la época pero no luce tan bien hoy en día, pese a las cualidades que esta película posee, la encontré muy aburrida la verdad."
    },
    {
      "rating": "8",
      "text": "For a long time this was my favorite Disney film, now I can say it's in my top 10. The animation is fantastic, this is some of my favorite Disney animation and it is really well made. The characters are...meh, I'm not gonna talk about it because I don't want to tick the spoiler box but there's a very stupid scene where Jim is in a barrel. The story is treasure island so I don't need to say much, I'd probably give this film a 7 but...whatever."
    },
    {
      "rating": "6",
      "text": "I love the creativity in characters and creatures for this particular Disney film. The animation is well done and the voice acting fits the characters. The only real issue is the plot. The antagonist has a change of heart and helps the protagonist, but the development isn't shown. The antagonist seems to have a sudden change of heart for absolutely no apparent reason, despite a mysterious alien in the first fifteen minutes of the film warning the protagonist to \"Beware of the cyborg.\" We're aware when we meet the cyborg, that he is the same cyborg that the protagonist is supposed to be afraid of. We never learn WHY we need to beware of the cyborg, or what made him so terrible that an alien gave up his life to hide a treasure map from him, because Disney doesn't bring it up again. It feels like the writers ran out of time and had to cram scenes together."
    },
    {
      "rating": "10",
      "text": "Mi película favorita de Disney sin duda. Me encanta tanto esta película que si pudiera hablaría de todo lo que ha creado esta maravilla. Una lástima que no tuvo el éxito que se merecía"
    },
    {
      "rating": "10",
      "text": "Wonderful. So much underrated and too much overhated.Great soundtracks and awesome characters."
    }
  ]
}