{"id": 3517, "title": "Tremors", "starring": ["Kevin Bacon", "Fred Ward"], "runtime": 96, "genre": ["Horror", "Comedy", "Action", "Science Fiction"], "description": "Hick handymen Val McKee and Earl Bassett can barely eke out a living in the Nevada hamlet of Perfection, so they decide to leave town -- despite an admonition from a shapely seismology coed who's picking up odd readings on her equipment. Before long, Val and Earl discover what's responsible for those readings: 30-foot-long carnivorous worms with a proclivity for sucking their prey underground.", "releaseYear": "1990", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/cA4ggkZ3r1d5r9hOAUWC8x5ul2i.jpg", "categories": {"plot": 7.428571428571429, "acting": 8.333333333333334, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 7.1, "action": 7.6}, "reviews": [{"rating": "10", "text": "Its a monster movie and one of the best. A very unique feel to it and is a genuine horror comedy. I am a fan of the series and was very happy to here that they've done a 5th. It has great pacing, great acting, good story and an identifying theme. There aren't many monster movies that have done 5 in a row all of which are very entertaining. If you like monster movies and haven't seen these yet then do yourself a favor and get them on blu-ray. It's worth it."}, {"rating": "9", "text": "This is such a great movie, its definitely one of my all time favourite movies!"}, {"rating": "2", "text": "Nothing more than a run of the mill bad movie, with an inflated rating due to cult fanboys.  The funny moments in the movie are off-set by terrible acting, corny humor, and a plot Michael Bay would approve of.  All in all, PASS!!!!!"}, {"rating": "0", "text": "Au menu dans ce navet insipide, Kevin Bacon (!) et Fred Ward le monsieur agent du effebi-aille avant qu'il ne devienne agent à plein temps, lorsqu'il était simple plouc avec son pote Kevin. En dehors de sa réalisation à deux balles et de ses effets qui coûtent encore moins cher, en dehors de son scénario mongolo dont on se demande à quel degré il se situe, force est de constater sa non-existence en tant que film puisqu'on ne voit pas de différence avec une heure et demi de parasites ou une heure et demi de l'écran noir d'une télé éteinte. On a vu d'ailleurs des télés se suicider pour moins que ça devant cette débilité de l'espace."}, {"rating": "7", "text": "\"What is your favorite Kevin Bacon movie and why is it Tremors?\" - Internet user\r A noble question that can best be answered by stating: Tremors, though imperfect, is a fun, fact paced take on older science fiction horror films with all of the cheesiness of 1980s/1990s science fiction movies. Though not strictly horror, there are more than a few scenes that play out like horror as the small town tries to expertly evade these giant worms that are terrorizing their town. Though undeniably silly with many, many dumb moments, Tremors is still a thoroughly effective thriller, while also blending it with fun comedy, interesting characters, and some serious suspense.\r First off, Tremors is a clear nod to smalltown America, the working class, and American ingenuity. The choice of Valentine (Kevin Bacon) and his heart-shaped belt buckle as the hero, while also being a handyman and using a CAT as part of his master plan, Tremors certainly is a tribute to blue collar Americans.\r In terms of the humor of the film, Tremors more than often hits. The humor really lightens the mood and feels entirely late 80s/early 90s in its approach to filmmaking. The constant one-liners being the main staple, having been established as pure Americana thanks to 1980s action movies. Here, the jokes hit and contribute to the fun, fast paced atmosphere. If the jokes were anything more than one-liners, it would have killed any of the suspense and turned it into a comedy. Instead, it never interferes with the thrills.\r Director Ron Underwood can largely be credited with this balance, as he never lets the humor take center stage. There is a separation of church and state, so to speak. The thrilling scenes are reserved for thrills. The in-between and build-up can have sprinkles of comedy, but the scenes that imitate Alien are preserved solely for that. And what an imitation it can be (obviously it imitates more than Alien). At times, it left me jumping in my seat trying to get people to run quicker. Underwood creates terrific tension that certainly can place you firmly on the edge of your seat, while also delivering solid action sequences of the town taking on the worms. Though it can be quite silly in this regard, their plans do make sense and could certainly be used if people found themselves in this situation. That said, the plans do feel as if they were taken right out of a 1950s creature feature.\r Though the romance is a bit forced, Tremors does have good character development, even if it is the classic \"immature man turned into a hero/mature by a woman he loves that forces him to change his outlook on life\" trope. The characters, even if cookie cutter, are incredibly likeable and rope you into really enjoying the film as you watch their antics and root for them to escape the clutches of the worm. As for the worm, the approach to the creature is really cool and well done. With reasonable traits that it always stays within, the worms are actually really interesting creatures to watch in the film due to the realistic and borderline scientific approach taken to helping us understand what these beasts are and how they behave.\r Overall, Tremors is cheesy and filled with one-liners. However, the cheese is gooey goodness and the one-liners hit. Plus, they are expertly balanced with true moments of suspense, thrills, and horror by director Ron Underwood who capably keeps the atmosphere and balance of the film while juggling many different genres. Taking inspiration from 1950s creature features, as well as well many 1980s and 1990s science fiction, horror, and action films, Tremors still finds ways to feel fresh and entertaining in spite of the consistent feeling that you had seen this film before."}, {"rating": "8", "text": "\"Tremors\" joins \"Gremlins\" as one of a handful of family friendly creature features. Kevin Bacon and Fred Ward have great chemistry as two bickering handymen in Perfection Nevada, population 14 when an invasion of subterranean \"graboids' (I know, I know ... that sounds ridiculous, but in the context of the movie it clicks).Spawning an abundance of bad sequels, \"Tremors\" solid cast, story and excellent practical effects stands the test of time."}, {"rating": "8", "text": "Tremors is a surprisingly appealing movie and I am not attributing it to the creatures in the film. It starts off giving a westerns vibe and then quickly turns into a survival horror movie with the added novelty of an unknown creature. Being a fan of 'creature features' and having watched most popular films in the genre, Tremors took me aback as it continued to impress me with its casting, plot, and the sheer horror of characters being hunted by a strange-looking mystery. There's just a positive, fun vibe to the film and that works wonders here. Gets all my points for being extremely funny too. Grade A-."}, {"rating": "8", "text": "You won't appreciate Kevin Bacons acting, until you watch the sequels to this movie where he is absent, the movie was well done for it's time I watched it as a kid, this is how Bob Vila would make a horror movie I thought back then lol...    ...the props are okay and the mystery of what the bad guy is, kinda mades the movie memorable, they kept the villain unseen long enough to create some mystery, and the whole movie is well put together, the movie made little money at the box office back in the day, but VHS rentals, and word of mouth, made this movie a sleeper hit of the 90s, there are issues with the movie, it's definitely not a \"citizen cane\" of horror movies or anything, but what it did right makes up for some of the movies short comings, it kinda has comedic value too, I laugh at some of the stuff in this movie, worth a watch."}, {"rating": "8", "text": "The film appeals more to those of monsters that had their moment in the distant 50's, than to Aliens (1986). As a Sabbath entertainment, it manages to take flight as it should be, and that has to be enough. The next time you feel the ground move under your feet, get ready to run!"}, {"rating": "8", "text": "Tremors is still really fun to this day, and the old special effects don’t even take away from the experience"}, {"rating": "7", "text": "Tremors is a good time so as long as you don't watch any sequels you'll like it."}, {"rating": "10", "text": "This is probably the first animal/creatures attacks human movie that all of the characters were not serious and i love it, they are fun, funny, and smart, Tremors is not taking a long time to finish, they didn't kill literally everybody, they're not stupid, they're not dumb, and i have a lot of fun yet very intense experience, we're talking about Ridley Scott's Alien, John McTiernan's Predator, Stephen King's Cujo, Hitchcock's The Birds and all of those animal/creatures attacks human movie, Tremors is the most fun of them all."}], "recommendations": ["gremlins", "guardians_of_the_galaxy", "werewolves_within", "rampage", "the_meg", "krampus", "robocop", "the_return_of_the_living_dead", "crawl", "zombieland", "ready_or_not", "evolution", "love_and_monsters", "army_of_darkness", "jack_the_giant_slayer", "the_lego_ninjago_movie", "riddick", "cooties", "the_wolf_of_snow_hollow", "transformers", "mars_attacks", "malignant", "color_out_of_space", "thor_ragnarok", "dark_skies"]}