{
  "id": 2090,
  "title": "Triple 9",
  "starring": [
    "Chiwetel Ejiofor",
    "Casey Affleck"
  ],
  "runtime": 115,
  "genre": [
    "Action",
    "Thriller",
    "Mystery"
  ],
  "description": "A gang of criminals and corrupt cops plan the murder of a police officer in order to pull off their biggest heist yet across town.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hMW4p1CBF8Q94PqQk8b2EyT4IJk.jpg",
  "categories": {
    "plot": 5.520833333333333,
    "acting": 5.880952380952381,
    "ending": 6.333333333333333,
    "soundtrack": 9.0,
    "cinematography": 6.333333333333333,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "Triple 9 was one of my most anticipated movies of 2016.  The cast was definitely amazing and the trailers did just enough to make it a must see in theaters.  After seeing the movie I thought the movie fell short of what it appeared the trailers suggested and I would think that most critics and movie goers felt the same exact way as I.  Triple 9 came off as a heist thriller movie that was going to deliver a lot of action and thrills based on the trailers.  What we got instead was a very character driven movie with the heist being more of a subplot of the movie.  Character driven is not a bad thing when you consider how strong the cast is.  The acting was amazing enough to have me engaged the entire movie.  It really had the feel of Training Day which landed Denzel Washington an Oscar.  The only problem with that is their was really no one in the movie that was as engaging as Denzel despite the great acting. With that said I was engaged the entire movie as the story itself was interesting enough to keep me locked into the movie.  At the end of the day if you liked Training Day *which I loved) you will enjoy this movie.  Corrupt cops that got caught up to deep in their own corruption.....will they survive or not; finding out was definitely worth the price of admission in my opinion."
    },
    {
      "rating": "6",
      "text": "Grimy and unapologetically brutal, yet a bit too sporadic and fragmented for its own good.\r In the spirit of creating authentic heist movie, \"Triple 9\" incorporates plenty of tactical strategy, gangland shootout and visceral treachery. It opens with rapid pace, and only able to maintain it partially due to too many erratic subplots which barely sync with each other. The actors do a respectable job on creating a sense of urgency, yet most of the characters are one dimensional and not entirely likeable.\r Michael Atwood (Chiwetel Ejiofor) is a former special force forced to do Russian mob's bidding, meanwhile Chris Allen (Casey Affleck) is a detective recently transferred into the town. They will eventually cross path while Jeff Allen (Woody Harrelson), Chris' uncle in investigating a particular heist. The whole scene is bogged down with intricacy and it becomes problematic to tell many perspectives smoothly.\r Actors deliver an intentionally crude depiction of shady or tired men, each of them has relative portion of screen time and they use it well. With the addition of Aaron Paul, Anthony Mackie and Norman Reedus, this is a solid crew, but it sometimes stumbles on the narratives. Direction would wallow too much on certain subplot without creating any investment.\r The problem is their struggles, with the kid, job or family, are not easily approachable, especially since it tries to include multiple backstories and authoritative jargon. There are a few good moments, but these are standalone showcase. The continuity and build up are sketchy, this also includes the main point of views of Michael and Chris, which makes the movie feels lacking in term of the main leads.\r It shines best under stress of gunfire and explosion. The action just feels like they are trained and choreographed with precision, even the bits where characters would stumble or react accordingly in the site. Blood and shot carry their weight nicely. Recent action movies like John Wick or Equalizer tell their stories with style, but this kind of razor blade authenticity is equally refreshing.\r \"Triple 9\" has a raw muddy grit for the action, unfortunately it applies to the narrative as well."
    },
    {
      "rating": "4",
      "text": "Triple 9 has good performances from the whole cast, it's well made and the action sequences are entertaining. However it is really slow and really boring. It wants you to care about our main characters but it doesn't give you enough for you to grasp onto. I liked the opening scene and the end heist, but the long stretch in-between just drags on and on and on to the point of frustration and yawning."
    },
    {
      "rating": "7",
      "text": "Triple 9 is the police officer code for the death of a policeman. It’s also the name of a new film about corruption in the police department.\r Taking place in Atlanta, and with an all-star cast, ‘Triple 9’ focuses on several characters, but it’s Chris Allen’s (Casey Affleck) story. He’s been moved from a zone 2 position (crossing guard) to that of a police detective, serving under his uncle Sergeant Detective Jeffrey Allen (Woody Harrelson). But amongst the rest of Allen’s squad are police officers who don’t exactly follow the rules, some of them in fact break them. And the ones that break them are being blackmailed by the Russian Mafia, led by Irina Vlaslov (Kate Winslet looking extremely unrecognizable). Vlaslov has several of the police officers in the palm of her hand and in her pocket, including Michael Belmont (Chiwetel Ejiofor) and Marcus Atwood (Anthony Mackie). She’s also kidnapped Atwood’s young son born to him by his Russian ex-wife to prove to him that he better finish one last job for her. In an explosive start to the film, Belmont, along with Atwood and Gabe Welch (Aaron Paul) and others pull off a daring heist in an Atlanta downtown bank. It’s a heist that goes smoothly until one of the bags full of money explodes with colored powder, exposing the men on a highway where they have to hijack another car to get away. Meanwhile, local Mexican gangs aren’t too pleased to see the police in their neighborhoods, and the gangs will do whatever it takes to get the cops off their streets. Led by Pinto (Luis Da Silva), his gang deals drugs and kills cops full time. But Detective Allen, who has a wife and young baby at home, doesn’t know that he’s being set up in order for the corrupt cops to pull off the final heist in the Department of Homeland Security’s vault under Vlaslov’s orders. It’s a heist where Allen realizes police corruption is too close to home.\r Tripple 9 is not for the faint at heart. It’s full of severed heads, shootouts, brutal arrests and lots and lots of violence. We see the story through Aflleck’s eyes – a young naive cop caught up in a world he knows nothing about. The star-studded cast all work hard to make Matt Cook’s script as real as possible. Most memorable is Winslet who plays the Russian boss – very cold and calculating who won’t even think twice about killing one of her own. Her Russian accent is very good but starts lilting into English near the end of the film. Director John Hillcoat (who gave us the masterpiece ’The Road) keeps the action coming at us right and left throughout the film, but it’s the predictable ending that doesn’t quite make this film as good as it should’ve been."
    },
    {
      "rating": "5",
      "text": "This is a Heat/Sicario wannabe which misses the mark. The performances are solid, and the concept is intriguing, but the execution is lacking. You never develop any affection for the characters, meaning the moments which are meant to be emotional hits fall flat. This feels slow, in spite of the action, and the cast are under-utilised. A disappointing film. 4.67/10"
    },
    {
      "rating": "7",
      "text": "A wonderfully crafted crime/heist thriller, Triple 9 is a very good and entertaining film. John Hillcoat is a very capable director and showcases once again why that is the case with this film. It is both well-paced and competently handled. The acting is impeccable, especially the performance from Kate Winslet who stole the show. Aaron Paul, Casey Affleck,  Anthony Mackie, and Clifton Collins, were also incredibly strong here. The heist sequences were great and the action was both thrilling and entertaining. I honestly do not understand the mixed response here, as though Triple 9 follows the genre expectations pretty closely, it never truly feels generic. Additionally, it is very well shot and the lighting is fantastic at times. Overall, despite the lukewarm response Triple 9 has received, it is a good crime thriller that may not be an award winner, but is more than worth your time."
    },
    {
      "rating": "6",
      "text": "I'd say the Metascore is pretty close to right on the money for this film.  It's fun, you get to see a bunch of really good actors letting it all hang out in this noir-ish playground. It's not high art, but you'll definitely be entertained.  No idea why Winselt chose this part, but hey, it's a check.  Casey Affleck shows yet again why he's the more talented actor in the family."
    },
    {
      "rating": "7",
      "text": "Nice little crime drama with a great cast. Triple 9 does have its bumps along the way as it doesn't play out as well as a film like The Departed. But if stay tuned in on the story line, which is intriguing, you'll put things together. Solid acting and nice action make this an entertaining flic."
    },
    {
      "rating": "9",
      "text": "With shades of Michael Mann's Heat and a hint of Scorcese's The Departed this movie did not disappoint. Great characters coupled with a twisted plot makes this one of the most watchable movies of the year so far. Lies, deception and corruption are the foundation of this cinematic experience and the back story of each character allows you to engage with all those that appear on screen.\rAn action packed and thrilling conclusion make for a great film, coupled with an A List cast you cannot go wrong with watching this movie.\rCypress Hill and Old Skool Hip-Hop classics add a depth to the movie with an amazing soundtrack further  enhancing the hard hitting gang life of the Atlanta streets."
    },
    {
      "rating": "9",
      "text": "Well, Woody's in it, so it rates an automatic 8 points from me right off the bat! And Casey Affleck is the best actor in the whole big mess this movie is, so it gets one more point. Aaron Paul? He really deserves some lead roles, after his GREAT work in Breaking Bad. All the actors were good, but the two main black guys looked and sounded so similar I was never quite sure which was which. The Mexicans were cool; they had a definite L.A. vibe, though. Are they really like that outside of L.A.? Maybe, huh?"
    },
    {
      "rating": "7",
      "text": "على الرغم من ان جميع الشخصيات غامضة هنا، إلا إن الفيلم يريك عواقب الأفعال والأعمال التي يصعب حلها ( المسببة للمشاكل )، ويريك ايضاً بعض من الـنظرات العنصرية الوحشية المُتعمِدة. لا يوجد شخصيات واضحة يحتذى بها هنا، الشخصيات هي مزيج من أناس سيئة تفعل أشياء سيئة، أناس جيدة تفعل اشياء سيئة، وأناس مضطربة تحاول فعل اشياء جيدة. جاعلا من نفسه كمخرج للأفلام من النوع القاسي، جون هيلكوت يقدم هذه الجريمة المثيرة والمعقدة والمتعددة الأوجه دون إضاعة أي وقت على خلفية الشخصيات وماضيهم، إذ ان الفيلم لا يقدم اي خلفية تفسيرية لماضي الشخصيات وكيف كانوا قبل احداث الفيلم، ولماذا هم مقدمون على هذه الأفعال وكيف التقوا وكيف وكيف وكيف ... ما هو هناك هو هناك، وعليك قبوله وفهمه، وعليك ايضا ان تتعرف على الشخصيات بنفسك وان تقنع نفسك على التعاطف معهم، ولكن من الصعب التعاطف تجاه اي شخصية في هذا الفيلم ( ربما القليل من التعاطف مع الشرطي ) ..! المخرج هيلكوت يقوم بعمل رائع في التلاعب بجميع شخصياته، حتى أولئك الذين يحملون أدوار صغيرة لديهم شخصيات حية. لكن الحبكة المعقدة يمكن أن تقع أحيانا كفريسة لجودة الفيلم، فمن السهل جدا ان تفقد مسار الأحداث ومفهوم الحبكة أحياناً، وتبدأ الاحداث تتشابك معك قليلاً. مشاهد الآكشن كانت جميلة وتحمل بعض الاثارة والترقب من قبل المُشاهد، اذ كانت تحمل نوع من التهور الذي يُحدث ارتباكاً عند المُشاهد. في النهاية لا يسعني القول الا ان الفيلم هو قطعة قوية من العمل الوعر، المتين، والمسلي نوعاً ما، والأسلوب الممتع والكفوء والمصيوغ بقوة كان غالبا يكفي لتحقيق التوازن للعيوب والأخطاء المزعجة الموجودة في الفيلم، ولكن رغم كل هذا، سيتم تناسي الفيلم مع مرور الوقت ..!"
    },
    {
      "rating": "0",
      "text": "It has always been somewhat irritating to me that so many reviewers award zeros to films when, as another user quite correctly pointed out, most films rate between a 3 and an 8. Apart from anything else this rating shows a lack of discernment in movie choices being made. Positive reviews should really dominate a user’s profile. However, after viewing this execrable offering I have no choice but to award a zero myself. There really isn’t that much to say about this unexciting, muddled piece of junk. An un-decipherable story line demonstrates a low level in production values. The photography is so dark that one could start suffering from depression, with the predictable and offensively bad dialogue and script pushing one over the edge. Kate Winslet’s promising baddie adds up to very little ultimately, and very early on the film becomes a confused bore. In a year when lack of diversity has caused controversy at the Oscars, this film ably demonstrates that these issues would be more pertinently directed at the films being made and the studios making them. No serious awards group would ever considering nominating, let alone rewarding, any cast member from this pointless farrago, and nor should they!"
    },
    {
      "rating": "2",
      "text": "Triple 9 is one film that looks promising at the start, but drops quickly and hardly even attempts to redeem itself.\rThe film stars a Triple A cast of Chiwetel Ejiofor, Aaron Paul, Woody Harrelson, Anthony Mackie, Kate Winslet, Norman Reedus, Casey Affleck and Gal Gadot. Great line up right?\rSo why does this film suck?\rThe film starts off with a rather intriguing bank robbery, which is reasonably well paced. Blood starts pumping and you feel like you’re in for a ride. Then, it ends. Sure this is the set up for the story in a way but there was no indication to the fact that they had gotten away until suddenly they’re all in a car park. The premature end really drops you and only sets up for the films self-destructive path ahead.\rThe film proceeds by splitting the characters up to show the different narratives that are happening so that they can all wind up joining together later on. However, transitions between each story are never made and instead it switches from one narrative to another without any real lead in or link between them. The film becomes a cacophonic amount of events that happen that you never really get a grasp on why they happen or what significance they have; they just happen. The film becomes nauseating to watch because of this, and the criticisms don’t stop there.\rThe characters in the film are hardly ever given any real justice to become interesting, relatable or just understandable for their situations, which coordinates itself into making plain characters that you don’t even care for whether they live or die. Aaron Paul gets type-casted as the problematic junkie and Chiwetel is meant to be the driving force of the film but never really comes across as engaging enough for the audience to care about other than the fact that he has a son which no relationship is ever really built between. Gal Gadot gets literally about 5 minutes of screen time and is used with no taste, and Kate Winslet is just a stone-faced stereotypical Russian mob boss we’ve always seen before. Casey Affleck never really comes across as relatable due to his incessant gum chewing and Woody Harrelson gets no real background to know what kind of character he even is; he is more just there in the film the fill screen time and all his scenes seem jumbled and odd. The main actors that stick out are actually Anthony Mackie, who plays one of the crooked cops and Clifton Colin Jr, who plays his role great in seeming so calm whilst being so involved.\rWhere credit is due however is a section in the middle of the film in which the police storm a building with riot shields to track down a criminal, in which tension is built up well and it seems pretty realistic in how police would raid a house potentially carrying firearms.\rOverall, the film is drab, pretty miserable and feels incomplete. Not even a phenomenal cast such as exhibited can save a poorly structured and written film.\rA very unsatisfying and nauseating watch.\r3.4/10"
    },
    {
      "rating": "6",
      "text": "A crew of dirty cops gets caught in a web of threats from the mobster that hired them (led by an almost unrecognizable Kate Winslet). This is one of those gritty, violent. hard-edged films that's more about atmosphere than content. The strong cast (Aaron Paul, Anthony Mackie, Casey Affleck, Chiwetel Ejiofor, Norman Reedus, Woody Harrelson) seems to be enjoying all the tough talk, but the plot does sometimes get murky and predictable. Speaking of...this film is so dark that it's practically shot in silhouette. While nothing about this film is outstanding, it's a solid entry into the genre."
    },
    {
      "rating": "7",
      "text": "The actors were great! But the plot, not so much. Although, I wonder, why John Hillcoat wanna directing \"War on Crime\" drama. I know thats not his thing, but It happends to everysingle scene, soo, It's practically a \"Not bad\" movie..."
    },
    {
      "rating": "7",
      "text": "Not a bad movie however I didn't like that the main character how is black was called a \"Monkey\" by the Jewish mob lady. Well the movie is great but it would be nice to go to the movies without always calling someone black a racial name it gets old and tired.  Other than that, I didn't like the ending at all but over all I think the movie was worth going to see."
    },
    {
      "rating": "5",
      "text": "Money was made to complete Triple 9. Then again, I could give Triple 9 a triple 9, but something's so catchy it fails doing that part. Decently enjoyable at some parts, Tripe 9 should've been better."
    },
    {
      "rating": "9",
      "text": "A seedy crime-thriller that wins you over with one heck on an ensemble cast. Not everyone onscreen is of the usual leading man material, but they're all actors and actresses who have proven themselves to be very talented over the years. The plot soars thanks to director John Hillcoat's experience with making movies with morally gray material. Nothing is black and white in this tale of crooked cops, betrayal, murder, and impossible heists. So much so in fact, that Casey Affleck's very black-and-white minded new cop on the scene feels like the weak link in terms of characterization. Aaron Paul ends up being a close second as he is really just playing Jesse Pinkman again; a drug addict with the most backhanded sense of morals one has ever fabricated for themselves. The entire cast is on point though. It's a film without any real heroes and villains. Yet, you're given cause to root for the characters who are doing most of their living in the middle of the moral spectrum, as they are just doing what they can to survive.The action is quite methodical and meticulously crafted in several exciting set-pieces. It's just as gritty and bloody as Hillcoat's previous works. Whether it's the more calculated heist sequences or the more chaotic bits of gangland warfare, Triple 9 is both taut and exciting. The brutality leans on realism to get the job done. Triple 9 is a dark look at corrupt law enforcement officers who are having their sins catch up with them. Most filmmaker's would kill for a cast like this, where literally everyone onscreen is both dedicated and totally killing it. It doesn't pull any punches as the twists and surprise backstabs just keep coming. The movie has no trouble holding your attention. Especially if you enjoy strong, mature stories where the characters are real and there really aren't any good guys onscreen.9.2/10"
    },
    {
      "rating": "6",
      "text": "Combination of wrong path and untrustworthy troop.\r This should have been the Holywood's bad boys film. I mean the big cast names are expected like the earlier films of QT, or especially like 'The Departed'. There were many who dropped out of it for various reasons prior to the production commence, although this cast did a great job. In my finding I blame for the screenplay. It was a good story, but the first half was not very interesting compared to the next half, which was so brilliant, especially towards the end, mind blowing.\r It was a multi starrer film, only that's much I know, but I kind lazy to count how many were there because I thought it was a modernised and an improvised cop version of the 'Ten Little Indians' theme. There's no evidence to prove that, it is just my theory. But seeing all the deaths and the conclusion, I felt the inspiration to the writer might have been possible.\r From the director of 'Lawless' who aimed for another success, but received backfire from critically and commercially. Mixed response from the audience though. Definitely it will find its own fans in the days and years to come. The ladies had scopeless roles, so they're completely forgettable their existence the narration, except very often just appear to show the faces. But well made crucial parts, in all the action sequences which kind what back the films along with Casey and Harrelson's parts.\r Like there is a saying, 'slow start, but ended strong', this film belongs to the same category. If you hold your patience for nearly 2 hours long, in the end you might feel after all it was not a bad flick. So not recommended to everybody, at a same time not suggested to skip it without properly knowing about it. P.S, the closing credit song, the remix version of 'Pigs' by Cypress Hill was awesome considering the theme of the film, I mean the corrupted cops, but felt the words were strong.\r 6/10"
    },
    {
      "rating": "7",
      "text": "A top notch cast mixed with a talented Director gives us a solid, but unspectacular movie.  All the performances are well done and the film really kept my interest though the second half gets kind of muddled.  In all like I said solid.  B"
    },
    {
      "rating": "7",
      "text": "OK movie, slightly above average, though didn't meet my high expectations. It's a bit longer than what it should've been, found some scenes unnecessary and boring. Classic bad cop vs. good cop movie with some decent twists and good action scenes. Watchable B- movie"
    },
    {
      "rating": "6",
      "text": "Triple 9 is a crime drama directed by John Hillcoat and written by Matt Cook. It surprisingly has some very big well known cast members, like Casey Affleck, Chiwetel Ejiofor, Anthony Mackie, Aaron Paul, Clifton Collins, Jr., Norman Reedus, Teresa Palmer, Michael K. Williams, Gal Gadot, with Woody Harrelson, and Kate Winslet.\rIn TRIPLE 9, a crew of dirty cops is blackmailed by the Russian mob to execute a virtually impossible heist. The only way to pull it off is to manufacture a 999, police code for \"officer down\". Their plan is turned upside down when the unsuspecting rookie they set up to die foils the attack, triggering a breakneck, action-packed finale filled with double-crosses, greed and revenge.\rI'm just going to start the review by saying what anyone who has seen the movie was thinking, (for the most part) it is extremely boring. It has such a convoluted plot that feels so muddled and just, unfortunately, uninteresting.\rThe cast members do a decent job, with the lead Anthony Mackie, who in my opinion was the best in this movie, as far as acting is concerned. Casey Affleck is fine too, but really nobody else brings their A game here as it is obvious as soon as you lay eyes on the movie.\rThe cinematography by Nicolas Karakatsanis is really nice though, I will give it that. But it is just not enough, as the movie fails on so many levels and has so many apparent flaws that just can't be ignored.\rIt has very few action sequences, especially for an \"action\" movie, but those few are actually very well handled by the director John Hillcoat. Especially in the middle of the movie when they're trying to catch a drug dealer of some sort. The ending is a total disappointment, overall I think it is a meh movie that had so much potential but very little to offer."
    },
    {
      "rating": "7",
      "text": "The beginning of the movie was really intense, exciting and action packed. Afterwards it mellowed down a bit, but the movie was still interesting to watch, and basically was how I expected it will be after watching it's trailer. The ending was nice too and overall I really liked it. Even though I might have wanted more out of the second job the crew pulled and more flash and bang there, as it felt quite easy and short, other than that was cool movie."
    },
    {
      "rating": "5",
      "text": "The movie benefits from a lot of very good acting from pretty much everyone. The story wasn't necessarily original but it keeps your interest the majority of the film. But the movie has problems and it kinda feels like your watching two movies at once. The detective/cop aspect and the dirty cops/thugs part of the movie."
    },
    {
      "rating": "6",
      "text": "-Triple 9 is a 2016 American crime thriller drama film directed by John Hillcoat and written by Matt Cook. The film stars an ensemble cast featuring Casey Affleck, Chiwetel Ejiofor, Anthony Mackie, Aaron Paul, Clifton Collins, Jr., Norman Reedus, Teresa Palmer, Michael K. Williams, Gal Gadot, with Woody Harrelson, and Kate Winslet. The film was released on February 26, 2016 in the United States by Open Road Films. In the United Kingdom the film was released by eOne. The film received mixed reviews; its plot was criticised by some critics, but its performances, direction, and cinematography were praised.\r --Filming:\r -Principal photography began on May 28, 2014 in Atlanta, Georgia. On June 5, filming took place the at St. Regis in Buckhead, Atlanta, with Winslet. Filming took place at Centennial Olympic Park Drive, Atlanta from June 23 to June 25, 2014. In early July, filming moved to Decatur, scenes were shot from July 9–12, 2014 in the 200 block of Kings Highway. Additionally stretches of Ansley Street and Kings Highway were also be used as establishing shots. Scenes were also shot on White Street, South East of Westview Cemetery, Atlanta. On July 17, 2014, a scene was shot in Atlanta with real paramedics, SWAT Officers and Police Officers along with the principal cast. Due to heavy rain, some scenes remained unfinished while shooting at Centennial Olympic Park, where filming again took place from August 5 to 6, 2014. After that, filming was wrapped.\r --Critical response:\r -Triple 9 has received mixed reviews from critics. On Rotten Tomatoes, the film has a rating of 53%, based on 133 reviews, with an average rating of 5.8/10. The site's consensus reads, \"Triple 9's pulpy potboiler thrills don't quite live up to the ferocious talents of its cast, but the film's efficient, solidly crafted genre fun is often enough to balance its troublesome flaws.\" Metacritic gives the film a score of 52 out of 100, based on 41 critics, indicating \"mixed or average reviews\". On CinemaScore, audiences gave the film an average grade of \"C+\" on an A+ to F scale.\r -Tom Huddleston of Time Out gave Triple 9 four out of five stars, positively comparing the film to Michael Mann's Heat. Huddleston praised the ensemble cast and concluded that the film is \"carried off with brashness and momentum by a director who genuinely seems to be having a blast.\" Variety's Justin Chang was less receptive towards the film's narrative, but applauded its action sequences and wrote that the \"result is a film that conveys the eerie sense of lying in wait for all its characters, and the paranoia is infectious, with at least two scenes certain to have viewers checking their car backseats upon exiting the theater.\r -In a mixed review, Empire's Ian Freer gave Triple 9 three out of five stars. Freer praised the casts' performance, but criticized the film's screenplay and second half, surmising that \"the interesting world of the film doesn't get the story it deserves.\" While praising Anthony Mackie's performance and Nicholas Karakatsanis' cinematography, Indiewire's Oliver Lyttelton criticized the film's narrative structure as unsatisfying, suggesting that \"perhaps there's a longer cut out there... perhaps that cut led to a film that felt like it was actually about something.\" Alonso Duralde of TheWrap also panned Triple 9, in particular disapproving of the film's screenplay and third act. Duralde writes: \"...(Triple 9) somehow managed to collect an impressively A-list cast on its way toward becoming a cop movie that's not just dumb, it's disastrous.\""
    },
    {
      "rating": "5",
      "text": "\"Triple 9\" is brutally boring and painfully uninteresting. The characters are lame but the actors are great. The story is recycled and does barely anything new."
    },
    {
      "rating": "7",
      "text": "With the exception of some bad dialogue throughout the film, Triple 9 is an impressively made and very well acted crime thriller. John Hilcoat's direction and the performances given by the leads raises this from a mediocre \"Cops vs Crooks\" action movie, to an intense, suspenseful thriller with great action sprinkled throughout the film. The biggest problems I could pin-point was that the narrative itself was mostly unfocused during the first half (and a little bit into the second half) of the film. And, as previously stated, There is quite a bit of dialogue is mediocre if not bad. I wouldn't say that Triple 9 is a great film, but I do think it is very good. Hilcoat's direction is tight and meticulous, the leads have really good chemistry with one another, the score by Atticus Ross is great, and the film almost always has a layer of suspense or tension from scene to scene."
    },
    {
      "rating": "2",
      "text": "Triple 9, which probably defines \"an officer been shot\" is full with known actors. Unfortunately it is not full of good writing or direction.Characters don't behave realistic. They act as if they want to be in Law and Order or Training Day. Deaths happen suddenly, but mostly in an anti-climactic manner. Paranoïd characters suddenly drop their guard, and then die. It is really stupid. The opening scene starts out strong with a clever heist plan. However, one dumb character lets greed get the better of him and immediately infects other characters with his stupidity. Kate Winslet plays the **** with cleavage, and Gal Gadot walks around... and that is the definition of their characters. I fell asleep with this movie multiple times out of sheer boredom. Lots of well known actors, but none of the quality they are known for. It is an epic failure. 2/10."
    }
  ],
  "recommendations": [
    "widows",
    "broken_city",
    "heat",
    "street_kings",
    "no_sudden_move",
    "breach",
    "the_little_things",
    "the_gunman",
    "inside_man",
    "body_of_lies",
    "the_town",
    "a_most_wanted_man",
    "jack_ryan_shadow_recruit",
    "the_accountant",
    "the_equalizer_2",
    "gangster_squad",
    "man_on_fire",
    "donnie_brasco",
    "survivor",
    "the_numbers_station",
    "the_infiltrator",
    "lawless",
    "shooter",
    "the_equalizer",
    "a_walk_among_the_tombstones"
  ]
}