{
  "id": 2527,
  "title": "Triple Frontier",
  "starring": [
    "Ben Affleck",
    "Oscar Isaac"
  ],
  "runtime": 125,
  "genre": [
    "Action",
    "Thriller",
    "Crime",
    "Adventure"
  ],
  "description": "Struggling to make ends meet, former special ops soldiers reunite for a high-stakes heist: stealing $75 million from a South American drug lord.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aBw8zYuAljVM1FeK5bZKITPH8ZD.jpg",
  "categories": {
    "plot": 5.478260869565218,
    "acting": 6.051282051282051,
    "ending": 3.6666666666666665,
    "soundtrack": 5.0,
    "cinematography": 7.25,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.026315789473684
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Five solid cast members.  The plot was at least not a standard issue heist and repercussions.  Silly decisions and terrible tactical maneuvers for so called professionals who get outflanked by a villager with a hunting rifle.  The multiple problems they encounter are necessary I suppose to create conflict for the plot, but they are mostly contrived.  Just an average military \"thriller\"."
    },
    {
      "rating": "5",
      "text": "Glaring plot holes, and suspension of disbelief in major absolutely pure rookie mistakes that led to problems, from a supposedly elite team."
    },
    {
      "rating": "8",
      "text": "+Excellent cast deliver great performances+Decent screenplay/action set pieces+Looks great 4k HDR+Good cinematography+Pacing is great-Timeworn plotTriple frontier exceeded my expectations. J. C. Chandor delivers this decent military themed heist film filled with engaging drama and action from start to finish. Pacing is excellent and the cast do a great job of bringing their characters to the fore of each expertly presented scene. Definitely worth a watch!"
    },
    {
      "rating": "4",
      "text": "If you're bored (I mean seriously bored) it's probably worth a watch. Conclusion: Top notch actors having to deal with a sub-par plot. Let's be honest: This movie is a waste of time."
    },
    {
      "rating": "6",
      "text": "65/100  Okay... I could have seen something much better.  The action scenes are ok, the story is ok, the acting is ok ... pretty much, it's just an ok film, nothing special.  I recommend? Ummm, I do not think so. You can see another movie, you do not lose anything ..."
    },
    {
      "rating": "8",
      "text": "This is an action packed film with some quite gripping moments and a number of scenes with some quite breathtaking camerawork/cinematography. We go from one landscape type to another. I thought it was quite tense and relatively suspenseful and I found myself quite engrossed in it, so overall it was a good film in my books."
    },
    {
      "rating": "8",
      "text": "I was convinced to see Triple Frontier after I saw the big posters scattered around my city. I had high expectations and I was not disappointed. I was really expecting a big action movie (maybe a classical \"commando against narcos\"), but it's more of a classical heist movie and a great one. The first half of the movie is really good: good characters' introductions, everyone with their own specialties, and pretty decent action scenes. The second half is a little more slow but pretty intriguing. It reminds me of an old-fashioned movie, solid, with fast pace, intense and thoughtful. It begins with the action, and then switch to an adventure film, to get to the drama and to end up in the action again. The performance of the entire cast is on point, especially Charlie Hunnam and Garrett Hedlund. The introduction of the character of Oscar Isaac is perfect. The character played by Ben Affleck could be difficult to understand at first. He was supposly the most expert and rational one, he turns out to be the most unprofessional. But it's an interesting and unespected character development. The plot (and the screenplay) could have been more courageous and focus more on the greed and on the \"good guys turn bad\" theme, but it's still a breath of fresh air in nowadays' movie scene. It's really a surprise coming from a Netflix's production. It also has an excellent photography and soundtrack. I really enjoy it. Absolutely recommended, 8/10."
    },
    {
      "rating": "7",
      "text": "Triple Frontier is another fun action flick from Netflix. Nothing outstanding and nothing to strongly dislike...this film is great for a movie night with friends."
    },
    {
      "rating": "8",
      "text": "Mark Boal has written better movies (“Hurt Locker” will remain his masterpiece) but this is a solid heist movie with a good cast and a few good shootout sequences. As good a Netflix movie as one could come to hope for..."
    },
    {
      "rating": "8",
      "text": "Triple Frontier was a movie that I wanted to see. I wasn’t super hype to see it, but I most say it was a pretty good movie. There was just the right amount of action and cohesive story. The acting of Ben Affleck, Pedro Pascal, Oscar Isaac, Charlie Hunnam and Garret Hedlund also was on point. Each actor bought their own style and personality to their role."
    },
    {
      "rating": "8",
      "text": "an interesting film well made and a good story, good cast a well worth film to see . the action scenes were well executed."
    },
    {
      "rating": "8",
      "text": "I didn't know anything about this movie. I was pleasantly surprised by its execution and talent. It felt like a hollywood movie rather than a Netflix original. Along the lines of Lone Survivor or American Sniper. Good Job."
    },
    {
      "rating": "4",
      "text": "Great cast, The movie looks stunning but the story just isn't there. It's predictable and something we have seen many times over and that's a darn shame too. It could have been a lot better than what it was."
    },
    {
      "rating": "5",
      "text": "The Survival Spirit Sparkles Up The Hunt.Triple FrontierChandor is sticking his neck out here. He is shifting on another genre; primarily action, that has never been his forte. And usually it is hard to pull it off, but he has been exploring the borderline issues like such. This is why the action is crisp clean. With a meticulous thorough exploration of a well mapped out and choreographed action sequence, the film starts off with a typical \"in and out\" mission- or so you'd think. The first act that starts smoothly, is your usually convincing 1-0-1 writing method. This is what aches you throughout the course of the film, J. C. Chandor, the co-writer and director, pleads you to go through the whole process that frankly at times might be moot.Like, the first act, where the baggage of all the character comes up with, is your expected hokum of unsatisfactory that would help them shake on this dodgy deal proposed by Pope (Oscar Isaac). After which the film and the characters strikes on their main target, where all the credit goes to Chandor and his execution on creating a tense environment among these characters as they go- almost without any proper preparations- in and finds themselves fighting with each other.Their experience and the build up of their hype of being excellent in their training and work, is perpetually justified when all their aim is directed toward an outer threat. These little things is how Mark Boal- the creator- convinces you to be invested in this group. But all this razzle dazzle barely changes any dime in the game, the crux of the film lies on the aftermath of this mission. Despite of all the training and the experience these buffed up retired military boys have been through, what's fascinating is how easily seduced they are.This fine analysation of human behavior- something that we have earlier seen in Steven Spielberg's Indiana Jones The Last Crusader- is what sparks up viewer's attention. The bickering and smooth familiar slangs used among them is smart of them to keep it alive, the team is left no more a team in its last act, when these characters finally go three dimensional. Isaac, as arguably the leader and schemer of the whole project has done a great work especially when it comes to strike horns head to head with Ben Affleck that is kept under the shades along with other team members.And hence is the reason why Affleck stands alone as he is- against all odds- trying to figure out the math behind the distraction Isaac has constructed. Pedro Pascal, Charlie Hunnam (as the reserved one) and Garrett Hedlund (the hothead and amateur one), unfortunately doesn't have much to offer on terms of the performance. The only major asset of the film is its surprised package, call it the second half or the last act, these macho guys tested by the nature is what justifies the storytelling. Triple Frontier works a marvel as a morality lesson for kids out there, but then they should think about everyone, especially if it dares to go that dark that quick."
    },
    {
      "rating": "3",
      "text": "The plot is extremely thin. There is no back story for any character. The movie never picks up any momentum at all. The ending is the most horrible I’ve ever seen. Netflix please spend some money to come up with better content next time. The only good scene was the helicopter crash. Nothing else is worth while. Thumbs down!"
    },
    {
      "rating": "5",
      "text": "Supposed professional operators go on a rouge mission and perform like ammeters. A contradiction of character for these characters."
    },
    {
      "rating": "6",
      "text": "6.4/10 The trailer made this look like an intense action film with a solid cast, but instead it was really a drama and Affleck was in it maybe for 10 min screen time. Not saying the overall story wasn't good enough, but it was very bare bones and not what the trailer sold it as at all. With a cast like this, it could've and should've been extremely better. Another case of decent at best netflix material using intriguing snippets in trailers to reel people in to watching the middling to decent time killing film."
    },
    {
      "rating": "8",
      "text": "Triple Frontier was so much smarter than I was expecting. I came for the action but got a parable. The acting and cinematography are exceptional. I'm not sure if the last few minutes of the movie are consistent tonally with what comes before but I can live with it. Highly recommend this."
    },
    {
      "rating": "8",
      "text": "debo decir que estaba esperando esta peli principalmente por su cast y no me esperaba mayor cosa pero me lleve una excelente sorpresa, excelentes actuaciones sobretodo oscar isaac, mucha tensión y unos efectos prácticos muy bien logrados. Mi único problema es que estuvieron mas de una semana solos en la selva y en los andes y nunca explicaron que comían o como se hidrataban ese detalle me hizo muchisimo ruido de resto muy buena peli altamente recomendable."
    },
    {
      "rating": "4",
      "text": "I was disappointed, the story takes way too long to get going and in the end fizzled out, I skipped several times ahead. Acting is okay, but story was thin, would not recommend it."
    },
    {
      "rating": "1",
      "text": "This movie suffered several problems. The beginning of it was hard to follow and understand and I just could not get attached to any of the characters. Then the second half when they had to lug all the money on foot was very long and boring. And in the end, it was a failed mission because no one got any money out of it and they lost a man. So the whole thing was pointless. Overall, the movie struggled to hold my attention and there were so many stupid moments that just made me cringe.Overall, this was a waste of time and I would not recommend it."
    },
    {
      "rating": "2",
      "text": "I agree with other comments about extremely foolish actions from a suppossedly experienced crew. I think these actions were forced by writer because he/she wanted plot to go in certain directions, in order to not be classified as another, predictable, formulaic, action movie; it left me with a feeling of being conned to a great extent and I lost interest in what happened to the main characters. Great idea, but handled in a very superficial and immature manner where problems kept appearing and often were self-imposed whenever particular plot twists were needed. The movie-going public has been overwhelmed for decades now with 'former, special ops, buddy' movies where main characters are getting back together for one last big operation. Disappointed in final result for it felt like watching a video game."
    },
    {
      "rating": "2",
      "text": "The Three Kings meet Narcos meet....Lord of the Rings! And I'm not even kidding! The last part across the Andes on the old \"smuggler's path\" I was waiting for Gandalf to save them on his big ass eagle.A typical pop-corn Netflix fare, a money grab for Hollywood actors and writers, with a lazy script, boring dialogues and clichés galore.Netflix understands that the average viewer only wants to see the same thing all over again, just packaged differently. This is a perfect example of it!"
    },
    {
      "rating": "5",
      "text": "A Netflix movie that center on a team skilled \"pros\" that are crtically stupid not once, but three times in a row.  Then the writers have the main characters flip from good to bad and back again, in a sickening series of 180s that leaves you wondering who would think this is at all plausible.  The cinematography may be good, as are three of the performances, but with a mediocre script and directing this is hitting the new average for Netfix movies unfortunately.  I was really hoping with this cast that it would live up to the hype from the early reviewers handing out good scores, but clearly they were watching a different movie."
    },
    {
      "rating": "9",
      "text": "Great movie.  Builds up tension scene by scene.  The first half was amazing.  Second half was slower paced, but still intriguing. The action scenes were very well done and all actors played their parts well.  I like movies where things don't go as planned and this movie definitely fits the bill.  SPOILER: The only thing that annoyed me was how these guys were professionals, but did not account for the weight of the cargo.  They talked about how the money was too heavy, but they loaded it anyway.  Just seems really stupid of them, but I guess it made the movie more interesting.  Solid action movie and Netflix should be proud of this one."
    },
    {
      "rating": "8",
      "text": "Overall, a really good movie. Great acting, great set pieces, and some really well choreographed action scenes. I'd recommend this to anyone who likes action or crime movies."
    },
    {
      "rating": "6",
      "text": "This film sees a decent attempt by Netflix to make their originals more in line with Hollywood ideas. Big names feature in this film which both elevates and hinders the film. The plot is mildly interesting, the originality relies on the characters but then the film has to be successful in making the audience like these characters, which I do not think they have really achieved in full. Mainly by a significantly poor performance by one individual who thankfully doesn't pollute this movie in its entirety, one who ruined a highly respected and successful franchise who in this film tried to ruin a whole genre and whose career seems dedicated to the regression of acting. I will no longer give this actor another chance to waste my time. If you want to watch a film with a cast that is mostly skilled and also has a good script and budget then this isn't bad at all. Credit should be given to Netflix for this film given its inconsistency."
    },
    {
      "rating": "0",
      "text": "A utter waste of what looked like a good movie from the clips. How we go from supposedly crack unit of soldiers pulling off a heist, only to then change into utter morons that are mega greedy and seem to have lost any ounce of common sense is beyond me. It goes with the usual clichés for this genre: \"If it can go wrong, it will go wrong\" + \"crime does not pay\". And to top it all off at the end, they did what they should have in the first few hours of running with the money. i.e. Hide some of it somewhere only they knew about and could go back for later. Which would have made the helicopter ride to freedom and riches much more believable. But no apparently these super talented soldiers would rather crash, trek through the jungle, kill various other people or die as a result of said killing and  apparently never eat and have arguments with each other whilst pissing away everything they stole in various stupid scenarios."
    },
    {
      "rating": "8",
      "text": "The characters are a bit shallow, but the story keeps you interested. Or the journey I should say. It is exactly that. A journey where stuff just keeps happening. Unplanned stuff. Or maybe just stuff they had coming all along. As the movie goes on, you start to realize how naive they, and you as the viewer, were at the beginning of the movie. Everything makes sense at the end. Everything that happened made sense. But somehow each thing that happen is a surprise when it happens. A new layer of naivety being peeled off. A new reality they come to accept.Great movie."
    },
    {
      "rating": "6",
      "text": "I was expecting some decent entertainment from this one, but not only did I not get as near much of that as I was hoping for, but it also turned out to be pretty loud and dumb/brainless. A pretty solid group of actors, who all gave fine performances, felt mostly wasted in this rather clumsy, predictable, and cliche-riddled film. Overall, it's got some cool and explosive moments, but it's not enough to warrant a view if you ask me. And to think that director J.C. Chandor (director of brilliant films such as 'Margin Call' and 'A Most Violent Year') reduced himself to this mindless mess!"
    },
    {
      "rating": "9",
      "text": "Si mas palabras, una pelicula recomendadisima para pasar una buena tarde. Llena de accion y muy buena trama. Sin duda deja las puertas abiertas para una segunda parte. El reparto se adecuo a cada personaje y las locaciones son maravillosas. Ojo es pelicula para adolescentes y adultos."
    },
    {
      "rating": "1",
      "text": "Ben Who. I'm sorry but Ben A. Could not act his way out of a brown shopping bag. He was pudgy, lethargic, and just can't act anymore. The writing was terrible! The acting by almost everyone was awful. The storyline was pathetic. Ben, you should retire and wait for Matt to offer you a role in his next movie. But just a character role, because sorry to say, no one wants to pay money to see you star in a film anymore."
    },
    {
      "rating": "2",
      "text": "Script: Very poor, overwritten ridiculous dialogues that create paper thin characters with caricature motivations.Action: Actually not much is going on worth noting -- very linear movements that after first 10-15 minutes you stop caring about as nothing is believable anyway, you tune out and just look at imagery moving...Cast: That is the exploitative part and a bait -- why this actors accept to be in such a poorly produced flick is a real mystery of this movie.Netflix is a king of B to C movies... At the end many of the Netflix movies are following the same B-movie pattern -- cheap thrills on a limited budget with a clickbait of some kind however the weakest link is always in writing. If screenplays were more credible even a lower production value and less clickbait-worthy 'stars' would be necessary.If Reed Hastings famously said that sleep is there real competition here is a thought for a new revenue stream -- screen savers.Total score: waste of time.:-)"
    },
    {
      "rating": "10",
      "text": "This movie is so bad it's good. Go into it expecting a really bad action movie and revel in its hilarity"
    },
    {
      "rating": "10",
      "text": "all the cinematography for this movie is truly special , it just imerse´s you along side the sound track this movie is good, the acting is preety solid"
    },
    {
      "rating": "10",
      "text": "Best Action movie since john wick best movie of the year love this movie. Netflix did it this time 10/10"
    },
    {
      "rating": "8",
      "text": "A new action film hits Netflix and I think it is really good. This movie has good action scenes, the performances were really good. I really felt the bond between these characters. The positives are that Ben Affleck, Oscar Isaac, Charlie Hunnam, and Garrett Hedlund do an excellent job in convincing me that they were once brothers in arms and that they are hardened badasses. It is more serious than I was expecting but that doesn't take away from this film as an enjoyable action experience. A negative I had with this movie is that there wasn't a whole lot of great action scenes. When they happened it was enjoyable and shot really well, but then the movie slows down a lot and it never really feels like this Cartel is after them.Overall I think this is a good movie with great performances, and I would definitely recommend checking it out."
    },
    {
      "rating": "7",
      "text": "Solid ride through the breathtaking scenery.This action movie might not redefine genre but it is a very good piece of entertainment.It is a heist movie with a very good cast so well done to Netflix for bringing all of them together for this project. I feel that everyone was cast really well.The veil between real and CGI world rarely feels so thin. The transition from CGI to real is smooth and helps immersion. The stunts and action sequences are really well done. All actors behave and look like a real tactical unit would outside movie set. The way they move, hold gun and interact with each another shows that training with live ammunition did pay off. The characters and world they are in are believable. I enjoyed the movie and could recommend it to everyone."
    },
    {
      "rating": "9",
      "text": "A really solid getting the band back together movie about some ex-spec ops guys who want to make a go of it to rip off a drug dealer.Great casting, killer soundtrack, amazing cinematography.Hope to see a sequel."
    },
    {
      "rating": "3",
      "text": "This is one of those films that leave you frustrated and yelling at the screen because of the stupid stupid stupid decisions that were obviously only injected into the story as plot devices. It is established early on that these comrades are supposed to be the best of the best but then at a crucial point, make the most rookiest of mistakes that insults the intelligence of the viewer. Overall, an extremely depressing movie, which seems to only exist in order to pass not so subtle moral commentary which is banal in nature and a rehash of observations that was better communicated in other films in a much better way. Not to mention a ridiculous,\" I too am Spartacus moment at the end which rendered everything that they sacrificed for null and void. Boooooo!!!!"
    },
    {
      "rating": "9",
      "text": "Great movie hope netflix continues to push out original movies such as the likes of these."
    },
    {
      "rating": "7",
      "text": "Enjoyable time killer. It's well shot and well acted -overall the execution of the movie is very good. Throughout the actions of the characters didn't seem realistic. Supposedly the main characters are all professional soldiers (now in private industry) however much of the time they act like a bunch of amateurs i.e. their heist is poorly planned and they do a bad job of resolving issues on the fly, and are ill suited for dealing with the stress of being out in the wilderness for a group of people who supposedly do this for a living. It's subjective but i also didn't much like how the story resolved which is related to the actions of the characters not being entirely believable.Fun but miss-able."
    },
    {
      "rating": "9",
      "text": "very enjoyable movie with a refreshing story with much thrilling moments! Can recommend!"
    },
    {
      "rating": "7",
      "text": "Σύμφωνα με το πρωτότυπο στόρι του Mark Boal (Detroit), πέντε φίλοι και βετεράνοι στρατιωτικοί αποφασίζουν να ενώσουν τις δυνάμεις τους και να ληστέψουν ένα μεγαλέμπορο ναρκωτικών, δημιουργώντας αλυσιδωτές αντιδράσεις..."
    },
    {
      "rating": "6",
      "text": "Beautiful cinematography is the most positive thing to say about TF. Storyline/script is below average. And sometimes these hardened veterand do just plain stupid Things. One never sympathise with the characters, and especially Affleck is not doing a good job."
    },
    {
      "rating": "7",
      "text": "It's a good action film with a slightly unique take on the genre. It's not 2 hours of pure action, the writing could have been a little better, but the great cast and interesting plot keep it going and made me want to keep watching."
    },
    {
      "rating": "8",
      "text": "Triple Frontier is overall, a really good movie. It's far and away one of the best movies Netflix has put out in a long while, at least since \"Mudbound\". A great cast, cool shots and JC Chandor's direction lift the film above it's minor bumps into a rather enjoyable and intense thriller."
    },
    {
      "rating": "2",
      "text": "Very good action scene and cinematography. Very good casting as well. The major problem for me is that you really gotta suspend your disbelief on this one from the beginning. Many plot holes as well that just made me feel like I was wasting my time while watching. Its okay, but not even passable if the small details bother you when watching a movie."
    },
    {
      "rating": "5",
      "text": "A solid cast with a handful of suspenseful scenes that J.C. Chandor directed marvelously.Although the main message the movie presents isn't anything new or special as it thinks it is. The first half is a little bit generic and some music choices felt thrown in because someone really liked that song.It steps into gear when the heist happens, of course."
    },
    {
      "rating": "7",
      "text": "In my opinion was a decent movie. Watched it longer time ago but still remember main events, action was nice and good actors. Maybe only thing I missed is a bit more plot or at least more action, but both lacked a bit as some parts the main characters where just moving from one place to other and not much happened."
    }
  ],
  "recommendations": [
    "project_power",
    "wrath_of_man",
    "the_equalizer_2",
    "contraband",
    "bloodshot",
    "the_italian_job",
    "unstoppable",
    "gemini_man",
    "skyscraper",
    "poseidon",
    "the_commuter",
    "the_accountant",
    "rocknrolla",
    "the_bank_job",
    "infinite",
    "the_equalizer",
    "haywire",
    "the_ice_road",
    "jiu_jitsu",
    "avengers_age_of_ultron",
    "san_andreas",
    "broken_city",
    "angel_has_fallen",
    "the_three_musketeers",
    "man_on_a_ledge"
  ]
}