{
  "id": 622,
  "title": "Trolls World Tour",
  "starring": [
    "Anna Kendrick",
    "Justin Timberlake"
  ],
  "runtime": 90,
  "genre": [
    "Family",
    "Animation",
    "Comedy",
    "Fantasy",
    "Adventure",
    "Music"
  ],
  "description": "Queen Poppy and Branch make a surprising discovery — there are other Troll worlds beyond their own, and their distinct differences create big clashes between these various tribes. When a mysterious threat puts all of the Trolls across the land in danger, Poppy, Branch, and their band of friends must embark on an epic quest to create harmony among the feuding Trolls to unite them against certain doom.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7W0G3YECgDAfnuiHG91r8WqgIOe.jpg",
  "categories": {
    "plot": 6.333333333333333,
    "acting": 6.8,
    "ending": 5.0,
    "soundtrack": 6.466666666666667,
    "cinematography": 6.666666666666667,
    "familyFriendly": 7.3,
    "funny": 7.4,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "This movie is extremely uninspired with a lazy plot that makes absolutely no sense whatsoever. This is something that is very memorable but for all the wrong reasons."
    },
    {
      "rating": "3",
      "text": "This movie is bad. I think it should be first movie and only one. It has interesting theme that could work as one and only movie about trolls. In the last movie they lived in three in the middle of city of bergens, i dont know. But in this movie they have other races. But we saw them occupaing hole three."
    },
    {
      "rating": "7",
      "text": "this movie is fun , I love the music and the color . you have to watch it at home"
    },
    {
      "rating": "7",
      "text": "Trolls World Tour was entertaining but not as good as the first one. The writing was great, it was funny and touching but not as funny as the first one. The animation was phenomenal, I love how colorful and artsy it is. The voice acting was outstanding especially from Anna Kendrick, James Corden, Rachel Bloom, Kelly Clarkson, Ozzy Osbourne, Walt Dohrn, Kevin Michael Richardson, Kenan Thompson, J Balvin, Sam Rockwell, Mary J. Blige, Anderson Paak, Ron Funches, Justin Timberlake, Ester Dean, Charlyne Yi, and Kunal Nayyar. The was overall a really good movie."
    },
    {
      "rating": "10",
      "text": "This movie was very very well organized and I enjoyed it so much that I can not stop watch. I have already watched it 20 times"
    },
    {
      "rating": "7",
      "text": "It's entertaining for the kids, and the music is mostly good. Some good lessons in here for the little ones, too. However, it seems rushed at times, and there are some definite holes in the plot. One of the details of this movie's plot even seems to ignore the previous movie altogether or try to force a new interpretation on it (the main characters' romantic feelings for each other). It seemed in the first movie that Branch had already confessed, but now he's doing it again. In fact, a couple of scenes between the two in the previous movie were interrupted in the same way as more obvious romantic scenes (Gristle and Bridget trying to kiss), which implied that these interactions were romantic as well. However, now Branch is struggling to tell Poppy he loves her, which he already did in the previous movie. It just looks like the creators wanted to backtrack because they actually got a sequel. Unnecessary characters and scenes took away time that could have been spent developing the plot, and one of the characters introduced in here seems to be taking the place of another who goes unmentioned throughout the film. Besides that, there's a stereotype in here that some might find mildly offensive. When Poppy meets the Country Trolls, they're depressing as can be and don't seem to have the ability to look on the bright side at all. In fact, their leader flat out sings that they \"don't hope for making things better.\" While country music can be depressing, there's usually a small amount of hope tucked in the depressing lyrics somewhere if the song is just about life in general, like the one in this movie. That isn't the case in this movie, making country look like the music you listen to if you want to feel bad. It's not the best way to portray it if the idea is that differences are good and should be accepted. Tiny Diamond was an unnecessary character in a movie with an already inflated character list and only took away time that could have been spent developing the plot. In addition, when one of the characters has a change of heart, it seems to come out of nowhere because we don't really see any reasons for why he would suddenly decide to side with Poppy. It wasn't actually in his best interests, after all. Still, despite the rush, it had enough good points to earn a positive review."
    },
    {
      "rating": "9",
      "text": "Have to disagree with ALL the negative reviewsThis movie is Sharp,witty,well animated and has good songsThe message is that being different ok and raises the issue of pop music stealing from other genres and cultures and warring down music for commercial gainLove the different worlds and the imagination injected into this movie"
    },
    {
      "rating": "0",
      "text": "This was just a awful sequel. It does nothing shocking or crazy at all in this movie."
    },
    {
      "rating": "1",
      "text": "Forgettable Soundtrack, Events, Bad Comedy, Characters, And Overall, Bad And Forgettable Movie"
    },
    {
      "rating": "10",
      "text": "I watched this movie at home in 4K with my family  . We had lot of fun .Recommended !!!"
    },
    {
      "rating": "0",
      "text": "Were you guys on drugs? -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_-"
    },
    {
      "rating": "8",
      "text": "I liked this sequel.I admit that this may not be the most ambitious children's film ever made. I remember people complaining that the last film was predictable. I didn't see that. Here though, ... yeah. You get a quest for magical macguffins. You get a whole new brand array of trolls in order to sell merchandise. Plus, there is a formulaic \"guy tries to express his feelings to his love interest but can't quite get it out\" trope going on. However, what the movie lacks in originality, it makes up with presentation.The writers were clearly having fun in this. There are a couple jokes where I laughed out loud. With the trolls traveling across the land meeting more trolls, I felt there was more going on than in the first film. I expecially liked the new villain Barb (voiced by Crazy Ex-Girlfriend's Rachel Bloom). In comparison to the villain in the first film, who was mostly just served to move the plot along, Barb is more morally ambiguous and relatable with some amusing lines.The movie's message about accepting people's differences and different likes and cultures may not be the most original, but it is well done.I admit that due to the busy cast of characters, a couple of characters' storylines don't get a whole lot of conclusion. In particular, the writers didn't really seem to know what to do with Biggie (voiced by James Corden).World Tour continues with the fantastic-looking felt scrapbook look. This is even better looking than the first film. There's even a little visual experimentation in a couple parts.Overall, I think I might rewatch this more than the first Trolls because this is a general pleaser that delivers a lot."
    },
    {
      "rating": "0",
      "text": "This stupidity is synonymous with failure...very bad. This is not a movie, it's rubbish, failure, especially failure ..."
    },
    {
      "rating": "8",
      "text": "I loved the colors and characters but it was missing a major climax. I needed more ... overall entertained music was great just needed to be a bit longer it got to the Rock Kingdom way too fast without a huge climax."
    },
    {
      "rating": "3",
      "text": "Le musiche sono sbagliate e brutte, le canzoni sono tutte mosce e non da festa, non fa ridere e la storia è decisamente fatta male. Speravo meglio, praticamente i personaggi migliori non compaiono (Minuta, Guy Diamante e suo figlio) Se poi lo paragoniamo alla serie che è favolosa..."
    },
    {
      "rating": "0",
      "text": "Almost laughably racist as it makes a parody of and directly mentions white musicians stealing the basis of rock n roll form black musicians. If you are a fan of the Metal genre of music, congratulations, you are EVIL for some reason.  A total miss."
    },
    {
      "rating": "3",
      "text": "It sucked. The concept of “other” types of Trolls doesn’t work at all here. First movie was 100x better."
    },
    {
      "rating": "0",
      "text": "The first movie sucked very much and this silly sequel also sucked very much either."
    },
    {
      "rating": "10",
      "text": "I really like this sequel. It takes it to a next level with an important message that it's okay being different. With beautiful animation and more songs that we know in love"
    },
    {
      "rating": "10",
      "text": "All-round fun movie with a clever concept & well-motivated string of conflicts. Red Velvet are also a good reason why many young people all over the world will love this sequel."
    },
    {
      "rating": "5",
      "text": "This trolls movie is simplistic in it's format with no surprises, maybe one surprise. Overall, it does not stand up against it's predecessor. From an adult perspective, the movie contains too much singing and fast plot development. I wouldn't say it was terrible like other reviews suggest. The cinematography, art-style and colors are vivid.  Worth a watch, not a rent or buy."
    },
    {
      "rating": "10",
      "text": "Watch this!! Highly recommended!! The kpop gang is so cuteeee duh!! and every song especially Just Sing is really eargasm.."
    },
    {
      "rating": "0",
      "text": "0 stars for the mere fact this movie and its greedy, stupid company wants to get rid of the theatrical experience. LONG LIVE MOVIE THEATERS!!!!!!!!!!!!"
    },
    {
      "rating": "4",
      "text": "I can't believe this movie made history by becoming the first movie originally meant to hit cinemas, but went straight to VOD due to COVID.Crazy times indeed.The movie itself isn't anything note worthy to talk about. It's literally one big karaoke-like music video of different songs."
    },
    {
      "rating": "7",
      "text": "Great songs and music. The voice cast is great. I really enjoyed everything!"
    },
    {
      "rating": "8",
      "text": "Fun SequelThough it’s pacing is slightly too fast, Trolls World Tour is a satisfying sequel with great world-building, Catchy music, Likable characters, and Beautiful animation."
    },
    {
      "rating": "4",
      "text": "What a disappointment. What started as a fun take on the Infinity War, but with different music genres/worlds, turns into a critical race theory lesson in **** \"Hey kids, remember how you loved Poppy and her friends singing pop music? Turns out they're all horrible, privileged, white people who stole that music from black people. You're all villains in a game of racial power dynamics. Have fun!\" What a load of **** And just how did white people steal classical music from black peoeple? Stop trying to politicize everything, especially music. You're just pandering to the BLM idiots.Otherwise the animation and performances were fun. Shame. Like pop music, Trolls is more fun when you can just sit back and enjoy it without trying to shame anyone."
    },
    {
      "rating": "7",
      "text": "Welcome all! Stream to Big Screen is here to fill your brain with content. On the eve of the first Presidential debate of 2020, I thought I should watch something uplifting before the debate depresses me even further. So I went to a franchise that's brought me much joy over the last couple years, Trolls. Trolls World Tour is the follow up film to Trolls (2016). In this film, we follow our beloved Queen Poppy and Branch as they discover that they are but one of six different Troll tribes scattered over six different lands devoted to six different kinds of music: Funk, Country, Techno, Classical, Pop and Rock. As their world gets bigger and louder, so must their hearts when Queen Barb tries to take over and destroy music. High stakes for Poppy, Branch, and friends, but let's see if it's worth finding out the result.I'll tell you now that the storyline is predictable and unimportant. THE MESSAGE that we get from the storyline and songs, on the other hand is quite important, especially during this current time of divisive speech, social unrest, and political conflict. Inclusiveness, tolerance, acceptance and sharing are all worthy themes that are found throughout the film. This is a message that our current President, members of Congress, and each individual across the globe need to learn and truly embrace. Ok, enough of the feel good messaging. Trolls World Tour does plenty of that.Let's talk about the rest. The movie feels similar to Trolls, but in a way, it fails to live up to hype. We fell in love with Lady Glittersparkles and the lowly Bergens, but we got none of that magic. The characters we do get in this sequel are great, but there may be too many of them. We have \"yuge\" starpower in this movie. From Kenan Thompson to Kelly Clarkson and Mary J. Blige to Justin Timberlake, Trolls World Tour allows each to hit their moments but, boy, we could've had more. The songs in this movie are heartfelt and charismatic. The jokes are pointed and hard-hitting but there aren't enough. Trolls World Tour could've been purely a song fest with some comic relief, but unfortunately, there is too much chitter chatter. Yes, the chitter chatter furthers the great message but the songs make you feel it much more.Needless to say, Trolls World Tour is meant for teaching our future tolerance, respect, and love for the differences between each of us. This is a message that all leadership needs to endorse and follow. For that, Trolls World Tour is not a must see but I can promise you that you'll enjoy the tunes and laughs. Grab a bowl of popcorn and charge up your karaoke mic because the world tour is ready for you."
    },
    {
      "rating": "7",
      "text": "I really think the sequel is way better than the orignal the plot is decent the charaters are great the music is way way better than the orignal"
    },
    {
      "rating": "8",
      "text": "I just felt down by laughing :D. It was a masterpiece to watch. I highly recommend watching this film. I'll say this film is good, but not that good. I recently managed to build a website where you can download and watch online movies free. Check out https://moviesfd.xyz/And don't forget to give a review :) here.This film is also available. If you have kids in your home then you should probably invite them to watch \"Trolls World Tour\".We all should appreciate all of the creators of this film."
    },
    {
      "rating": "5",
      "text": "A \"road trip sequel\" with current pop music. Being music heavy across multiple genres added to its appeal. The underlining racial themes were surprising but handled very well. It's a pop music movie that was enjoyable, even by my jilted standards."
    },
    {
      "rating": "10",
      "text": "اذا طلبت افنجرز إنفينيتي وار من الزبالة بيطلع لك ذا الجمال فلم صراحتا فلم زبالة بشكل لا يوصف وأتمنى يسوون له ترولجي او جزء ثالث"
    },
    {
      "rating": "7",
      "text": "It was nice family lecture movie especially for growing developing kids. I enjoyed it with my lo."
    },
    {
      "rating": "8",
      "text": "Although the songs are not as good as the first one, Trolls World Tour still has its advantages for its excellent background settings, extremely fun song types, and silly interesting adventures."
    },
    {
      "rating": "5",
      "text": "The film unfortunately does the same thing that the first one did especially the ending where they all turn gray and sing a heartfelt song which makes them all colorful and happy, giving us a disappointing sequel that is not worth the 20 dollar HD rental,"
    },
    {
      "rating": "0",
      "text": "Dieser Film ist so schlecht das sogar mein Vater der Milch holen gegangen ist zurück kommen würde wenn er diesen Mist sieht."
    },
    {
      "rating": "10",
      "text": "I thought this movie was extremely entertaining. Loved the music as usual."
    },
    {
      "rating": "7",
      "text": "Trolls World Tour is a very beautiful and fun animated trip, however it commits sins like many animated sequels."
    },
    {
      "rating": "10",
      "text": "Trolls world tour is very colorful and popy For me the second is better and more musicaly (The strong point of the saga trolls).This movie explore more the univers, the différent cultures and the world of the trolls"
    },
    {
      "rating": "2",
      "text": "Not getting Jack Black / Tenacious D to be the ROCK - obviously logical, obviously a missed opportunity."
    },
    {
      "rating": "8",
      "text": "One of the best movie to watch with your family. Just like how many different kind of trolls living in Trolls Kingdom & how different each one of them even in one village, it's also just the same as us — human beings in real world. We are so different, no one can be the same with us, even our identical brother/sister. But Trolls have found their unifier, and what about human? Do we already have our unifier? And if we already have it, does it already have touch every person in this real world? We should all learn from Trolls in this movie."
    }
  ]
}