{
  "id": 1059,
  "title": "Trolls",
  "starring": [
    "Anna Kendrick",
    "Justin Timberlake"
  ],
  "runtime": 92,
  "genre": [
    "Family",
    "Animation",
    "Fantasy",
    "Adventure",
    "Comedy",
    "Music"
  ],
  "description": "Lovable and friendly, the trolls love to play around. But one day, a mysterious giant shows up to end the party. Poppy, the optimistic leader of the Trolls, and her polar opposite, Branch, must embark on an adventure that takes them far beyond the only world they’ve ever known.",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zKu5MNy9QW1a5ZHgv7iAp3kRZpE.jpg",
  "categories": {
    "plot": 6.093023255813954,
    "acting": 6.185185185185185,
    "ending": 6.8,
    "soundtrack": 7.875,
    "cinematography": 7.166666666666667,
    "familyFriendly": 6.9,
    "funny": 6.888888888888889,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "I actually don't understand why \"Trolls\" received so many low scores. In my opinion it was a pretty fun animation for pretty much all ages. Yes, it is a predictable one, but honestly - nowadays almost all animated movies are. The visuals - great. Nice soundtrack and pretty decent characters. I can't stop the feelin' to give it a 7/10 :D"
    },
    {
      "rating": "10",
      "text": "My girldfriend and me loved this movie, no kidding, We've watched it around 3 times haha I recommend this movie and has totally my approval seal so go and enjoy it :D"
    },
    {
      "rating": "9",
      "text": "This................................................................................................................................................Movie..........................Is...................................Awesome!!!!!!:)"
    },
    {
      "rating": "6",
      "text": "In truth, this film fulfilled every single expectation I had going in. It’s a bright, upbeat and musical adventure that will easily keep kids entertained and smiling for its entire duration. On the one hand, the happy and colourful vibes are a lot of fun, but given the film’s painfully formulaic story, occasionally excessive cheeriness and obnoxious musical numbers, Trolls is often more annoying than the pleasant family affair that it could be.However, let’s start on the bright side, with the incredibly bright colours. If there’s any reason that kids (we’re looking at 8 years and under) are going to like this, it’s because it’s full of colours and joy wherever you look. A perfect merchandising picture, Trolls does the job of being the kaleidoscopic family distraction it needs to, but also goes a little further by usually being happy from the heart, which did bring a smile to my face from time to time.Another positive from this film is the voice cast. It’s an A-list ensemble, and the likes of Anna Kendrick, Justin Timberlake, Zooey Deschanel and Christopher Mintz-Plasse all put in energetic and entertaining performances. The screenplay doesn’t give them much to work with, but in fulfilling the primary objective of being upbeat and enjoyable, you can’t fault the cast here.Despite that, the ultra-happiness of this film is something that’s likely to wear thin for anyone over 8 years old, and unfortunately turn into a more annoying watch than anything. Of course, this film is great for its target audience, but I would definitely warn any parents or anyone else thinking of watching this that it’s going to get boring very quickly, and then get even more irritating.A large part of that is down to the story. The quest to rescue x and y is probably the most overplayed plot formula in kids’ movies. Now, some films have proved that to be a great watch (Finding Nemo for example), but usually by offering a little more depth than simply watching the characters walk through various landscapes and then sing a song at the end.Here, however, there’s very little beneath the surface. Again, it’s bright and colourful, and that’s all young kids need for an enjoyable watch, but the story’s lack of depth and originality becomes painfully apparent very early on, and sets you up for a good hour of totally predictable and uninteresting adventure clichés.All of that’s pretty bad, but if there’s one thing that I really hated about this film, then it’s the music. Heavily advertised as a musical before release, you’d be forgiven for expecting some entertaining melodies here, but that’s not the case. We know how good singers Anna Kendrick, Justin Timberlake and Zooey Deschanel are, but this film just pushes the music way too much.Constantly getting in the way of the plot’s development, the music seems to only be there to get the runtime over 70 minutes, failing to give you the same love for singing as the trolls do. The specific songs are generally classic pop hits, but jukebox musicals only work if the music fits in the film, and it just didn’t come together here, with a weird variety of songs (including The Sound Of Silence by Simon & Garfunkel for some reason) that is yet again for annoying and distracting than entertaining.Overall, whilst it’s definitely an enjoyable watch for young children, given its bright colours, simple plot and upbeat vibes, Trolls is unfortunately a pretty intolerable watch for anyone else. Its shallow and formulaic story is boring, its happy atmosphere gets on your nerves pretty quickly, and the music is intrusive and annoying at every moment."
    },
    {
      "rating": "4",
      "text": "This movie was absolutely awful, I can't even begin to fathom the things that are wrong with this movie. It serves its purpose as a family flick that kids can be occupied by for a couple hours. The soundtrack is easily one of the worst soundtracks in movie history mostly because I don't like this type of music, but then again it's for children who are into that kinda stuff."
    },
    {
      "rating": "7",
      "text": "I enjoyed the characters, story, and music. The music was great, and a lot of singers were voice actors. The story kept getting better as it went on, and the characters helped the story a lot. It was a little short. Worth the watch."
    },
    {
      "rating": "0",
      "text": "I fell asleep i hope this dosen't come back for a sequel -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- -_- BRUH"
    },
    {
      "rating": "4",
      "text": "I'm a big DreamWorks Animation fan myself, but Trolls is their first movie to be for kids and not families. I was disappointed in this movie, the humor is O.K., but it's a DreamWorks movie that really pandered to kids like the Despicable Me franchise and The Secret Life of Pets. If you're looking for a very mature DreamWorks movie, I'd watch the How to Train Your Dragon franchise, that's for older people more."
    },
    {
      "rating": "5",
      "text": "DreamWorks Animation is not, and never will be, Pixar or even near it. Films like this prove my point. They do make great films to watch, but sometimes they slip mistakes like, what I said, this one. Trolls may not be terrible (not even near it) but it's just a jumbled mess that hardly makes any sense whatsoever."
    },
    {
      "rating": "0",
      "text": "Well, this film is basically Strange Magic 2. Similar storyline, similar recycled 70's-now pop songs, similar \"make the sad race happy\" problem. Strange Magic was unoriginal and lackluster, and so is this film."
    },
    {
      "rating": "5",
      "text": "The titular characters enjoy a life of singing, dancing and hugging until the evil Bergens threaten to eat them. There's lots of lively music and an energetic pace that keeps the movie moving, but the characters aren't especially charming and most of the jokes are pretty flat. The story repeats it's simple message endlessly and offers little else (like cute character types or wacky gags). It's colorful and fun, but not especially original or delightful."
    },
    {
      "rating": "1",
      "text": "The big question is though, is Trolls worse than Norm of the North, No.  At least this film felt like it had some effort put into it.  It has the same sort of idea of, do the kids 3D animated kids film formula and stick it out there that Norm of the North had.  This one felt like some effort had been put into it, whereas Norm of the North feels like it was just made to make a buck!  Does that make it a good film, hell NO!!  If it wasn’t for Norm of the North, Trolls would be the worst animated film I have seen this year.  I really didn’t like this film and came out of the cinema extremely annoyed.  The plot is all over the place, the characters were annoying and obnoxious, the voice acting was terrible, the writing is god awful, to such an extent, I didn’t even mention that the world has absolutely no concrete plan, since the writers couldn’t be bothered to think that up and the film has absolutely no climax whatsoever, it literally just ends, it couldn’t be bothered.  The humour is never funny, and it’s just a lot of constant noise and movement, except for one sad moment(if you can even call it that), which was a welcome bit of relief after spending 1hr 30mins watching a film that was constantly on.  I hated this film and I really never want to see it again.  This is just a glorified advert for a terrible Soundtrack and if you want a terrible kid bops version of songs that were mostly awful in the first place, with a couple of exceptions, then you are welcome to it, but frankly, I am out, this film was painful."
    },
    {
      "rating": "5",
      "text": "wow this films is one swift blown to dreamworks simultaneously destroying everybody involved careers seriously,people say shot give kids autism but this will melt there brains, its just bright colors to get attention but lacks a real story with depth."
    },
    {
      "rating": "9",
      "text": "Trolls is a very cute movie and it has a great cast. I don't understand all the hate because everyone of all ages can enjoy this film. I've seen it multiple times and enjoyed it so much. The songs that they sing are super cute and funny in the way they are used. The animation is adorable because it paints some scenes using felt and fabric. The whole concept of \"burgens\" and \"scrapbooking\" is super creative and smart. Trolls is definitely a movie to please all. Highly recommended."
    },
    {
      "rating": "10",
      "text": "a great musical the soundtrack is outstanding and can't stop the feeling is the spotlight can't stop the feeling truly deserves the oscar for best original song this song is GREAT"
    },
    {
      "rating": "8",
      "text": "Feel The Joy, Feel AliveVideo games, documentaries, true stories, songs, theatrical productions, mechanical attractions or books are some of the sources of inspiration for the seventh art to develop a universe full of ideas. Children's films certainly opt for puerile subjects correlated with today; the toy industry its main ally. Rich in genre and style, adaptations have been varied about small and innocuous objects which entertain the kids: \"Ouija\" by Mike Flanagan, \"Lego Movie\" by Phil Lord and Christopher Miller, Michael Bay's \"Transformers\" and clearly \"Toy Story\" by John Lasseter are vast references in the prominent sub-genre. As a demonstration of its infallible success at the box office and acceptance by movie critics, they are mostly franchises willing to continue expanding. It's patent that the plurality of this type of films totally controls child audience, and the latest invention in the subject also does it.From the studio that brought you \"Shrek\", \"Madagascar\" and \"Kung Fu Panda\", comes out a colorful range of characters ( they hope it becomes in a profitable franchise ); with a conception very similar to \"The Smurfs\", \"Trolls\" or «Dam Dolls» (original name) is the most recent work of animation factory, Dreamworks. The Danish fisherman and woodcutter Thomas Dam created in 1959 a doll of excellent quality, featuring sheep wool hair and glass eyes. An error in the copyright made its reputation was biggest due to the manufacture of illegal imitations of minor detail, was so great the commercial impact obtained, that they even harbored superstitions related to the good luck that the consumer will acquire. Nowadays, the popularity of toys is insubstantial, however, its filmic project comes loaded with tons of marketing, ranging from dolls to music discs.What If I told you that you can have the opportunity to experience true and complete happiness, eating a positive small being? \"Trolls\" is about this. These tiny and adorable creatures to live, to hug, to dance, and to sing every day, every hour. Like the Smurfs, these friends share singularities Park and emotional certain designating your color and way of being. Unfortunately, his perennial satisfaction is affected by the despite and hideous Bergens, desirous of a dose of love and joy. Years of abstinence have passed since last joy festival, and now the Chef (Christine Baranski) has located the whereabouts of small enthusiasts. She abducts a good part of them, obliging Poppy (Anna Kendrick) and her pole apart Branch (Justin Timberlake) - something like Joy and Sadness from  \"Inside Out\" -  to rescue their family. An adventure of discoveries, deceptions and union will do the journey a passage full of color, music and teachings.In movies like these is frequent to see great singers, models, actors or characters lend their unmistakable voices in order to give more brilliance and personality to the film. Kendrick, Timberlake, Deschanel, Stefani or Corden are the main team, identifiable by their mere surnames. Seeing the artistic convergence of its leads, \"Trolls\" is the perfect musical for a contingent wave of children's films of such tone, which are to come. Classics of yesteryear and modern classics are put together in each scene in a wonderful way, usually accompanied by an original dance routine and flashing graphics. Earth, Wind and Fire's \"September,\" Lionel Richie's \"Hello,\" rhythmical \"Can't Stop the Feeling\" by Timberlake or the duet on \"Get Back Up Again\" will make you provide a chorus, slightly move your feet or scream wildly with trolls on screen. Obviously, it is not \"Frozen\", but offers a different direction to musical animated movies.Thanks to the development of the story, it is noticeable that screenwriters and artists have been inspired by the big successes of Pixar. The most striking is the template selected from \"Monsters Inc\" and \"Inside Out\" for characters and situations. It conceives memorable characters with difficulty, the same thing naturally attained the Pixar film with all its monsters; \"Trolls\" does the attempt, nonetheless, categorizes its characters in recurring roles, Bridget as Cinderella, Cooper as Rex from \"Toy Story\", Poppy as Joy from \"Inside Out\", and the most obvious: Cloud Guy, comical-periodic role almost copied of all feature films in Pixar.Although it is occasionally cloying, too childish and sickeningly sweet, it enchants with each frame. Visually, the art department, visual effects and animation capture the sensibility of the moment, with thousands of textures such as felt, foamy, glitter, or hundreds of vivid colors with different tonalities, and nuances; the situations get their greater brightness in front of the spectators.For those who manage to touch the ground, sitting in a movie theater seat, \"Trolls\" can be too noisy, colorful or sickly-sweet. For those who have to go the bathroom with dad, \"Trolls\" is an explosion of teachings - joy isn't in the tangible, is within yourself -, music and toys that you will want to buy out of the theater. Being one or the other, \"Trolls\" is a proper continuation of modern musical films, with a powerful soundtrack, irresistible visuals, a concise story and a rebirth for the marketing of the film."
    },
    {
      "rating": "9",
      "text": "Debo admitirlo, Ame esta pelicula.\r Esta pelicula esta basada en una franquicia de juguetes antiguos, los trolls, esos mismos que salen en toy story, pero tanto en dreamworks como en esta pelicula, aqui los rediseñaron, para verse de mas agrado para el publico.\r La historia en si es sencilla, pero la verdad, encaja con esta pelicula, en si no es solo salvarlos y ya, tambien tenia sub tramas, Donde Bridget esta enamorado del Príncipe Gristle Jr y quiere estar con el. esto tiene conexion con la historia? Creo que si.\r La animacion es algo que caracteriza mucho la pelicula, ya que se puede apreciar la gran calidad de colores vivos, parece que estoy viendo stop motion y editado a computadora, no se, como que los trolls parecian muñecos o algodones de azucar xD.\r La comedia es algo que no tengo mucho que decir de ella, ya que no encontre chiste alguno en la pelicula que me diera risa. pero si, tienen un buen sentido del humor.\r El soundtrack o la musica, es excelente ya que estas tienen emocion, i cant stop the feeling, el tema principal de la pelicula, y true colors, son canciones que en mi opinion, son las mas memorables de la pelicula. sin embargo, es mas disfrutable oirlas en ingles, no porque en español este mal traducido o que las voces sean flojas, es que en español cambian algunas palabras para que quepe en el momento justo. Pero bueno, esto es como un musical, estoy mas acostumbrado al español, gracias a dios que no todas las canciones fueron traducidas. Yo digo que las canciones estan muy bien.\r Los personajes son muy carismaticos, cada uno con su personalidad, me senti muy identificado con casi todos los personajes, en especial Ramon/Brench y Bridget, cada uno con sus problemas y emociones. La relacion que tienen los personajes cada uno, tienen momentos divertidos y entretenidos, y otros son motivadores.\r el final me parecio un poco forzado, ya que todos quieren comerce a los trolls, pero luego de 4 minutos derrotan a Cocinero y a creek simplemente lanzandolos en un carrito e incendiandolos. para luego los bergen y los trolls sean felices para siempre. Bueno admito fue un buen final conclusivo, pero fue muy rapido.\r En conclusion, trolls es una de las mejores peliculas animadas del 2016. Tiene todo lo que busco, tramas poco complicadas, momentos de sentimiento y entretenidos, colores realmente vivos y animacion unica, y un soundtrack pegadiso y alegre. Una pelicula que la verdad te entretendra con tu familia.\r Calificacion: 9/10: Excelente."
    },
    {
      "rating": "9",
      "text": "OK this is a movie that you're either gonna love or hate but I for one loved it went to the show by myself and I enjoyed it till the very end I laughed I smiled I was just happy couldn't have asked for better the one I loved the most was poppy she was a total sweetheart and I loved her positive attitude and sweet smile I can't think of a reason not to see the movie take the kids or go by yourself just see it perfect holiday season treat good with a message of happiness and tolerance for any one u may not see eye to eye with on subjects except for a few grumpy attitudes. Warning though parents this is a movie that is full of peril and dangerous situations for our heroes the trolls .you may need to keep reminding sensitive kids that the trolls will be able to make it threw the tough situations. It looks hopeless for our heroes sometimes exspesualy when about to be eaten by giants keep this in mind please parents when taking them to the movie and remember that it's pg for a reason and it shouldn't be ignored when making the choice of taking small kids or sensitive kids just sit back and enjoy the ride"
    },
    {
      "rating": "10",
      "text": "love this movie love the music is the best part the soundtrack is amazing deserves a grammy and can't stop the feeling deserves a oscar for best original song"
    },
    {
      "rating": "10",
      "text": "great animation movie i smile i single the soundtrack is amazing dreamworks work very well justin timberlake songs are amazing deserves the oscar truly"
    },
    {
      "rating": "10",
      "text": "the best animation musical from dreamworks better than prince of egypt the soundtrack is outstanding can't stop the feeling is the SPOTLIGHT great amazing song"
    },
    {
      "rating": "0",
      "text": "Justin Timberlake´s new record could is enough to make Trolls worth a look, but its predictable characters; disgusting story-telling and dull situations are also enough to turn its nice premise into a thin one."
    },
    {
      "rating": "10",
      "text": "Great Dreamworks Movie Animation Great Story Great Music Great Characters Great Actor Great Anna & Justin Do Great Job Teaser Trailer Sucks 2nd Trailer Great 3rd Trailer Great"
    },
    {
      "rating": "7",
      "text": "Though it may seem like yet another attempt at creating a franchise that's based off of a popular toy, Trolls instead grows into something much more meaningful, and adds in some fantastical animation and many clever jokes."
    },
    {
      "rating": "10",
      "text": "the music saves the film the soundtrack is outstanding the best soundtrack of the year and can't stop the feeling is the spotlight and deserves the oscar for best original song"
    },
    {
      "rating": "7",
      "text": "Bright, colorful, energetic, and even sets a new high bar for animation quality. It's rambunctious and often zany sense of humor and plot brimming with optimism are enough to keep the movie going for both kids and adults alike even in the face of some fairly standard writing. I think they kind of messed up the message a bit. Their efforts to teach us that happiness is in all of us is a good choice for a time where depression runs rampant. The goof up occurs when the movie unintentionally(?) tells us that while happiness lives inside all of us, we need to be in a relationship in order to find it. Not exactly the best idea to tell kids true happiness comes from others so they better get to dating.Things move at a mostly solid, but the fun dips off a bit when we are left to follow the \"Bergen\" characters around. I really didn't care for the Cinderella styled romance shoehorned in to extend the running time. Luckily that's only a small part of an otherwise enjoyable movie. The trolls are likable and even the musical numbers aren't bad. I would have preferred more original tunes and less covers, but whatever. I'm more than willing to look the other way thanks to the excellent use of The Sound of Silence. Much better than the Disturbed cover. Oh, and of course it's funny.While it doesn't stand among the best of what DreamWorks has to offer, it still proves to be an enjoyable family movie. Much better than one would expect from a movie based on those ugly dolls that were so popular back in the 70's and 80's. The animation is better than that of even a Pixar feature and the laughs and charm carry viewers through it's less than desirable moments.7.5/10"
    },
    {
      "rating": "7",
      "text": "The message was about teaching the truth behind falsified believes.This is a good film than how it was labelled. At least I enjoyed it, despite being an adult, particularly a male and a bachelor. It looks more a little kids' film than for anyone else. Because the film was based on the famous dolls. Usually film comes first and then follows its dolls to the markets. But this film has a reverse concept and a very much acceptable. Yes, it was not great as Disney's or Pixar's animations, but the DreamWorks animation is always there behind these two, considered the third best and according to that limit, you should expect the film.It's a musical like most of the animations are and one of the tracks made into the 2017 Oscars for best film songs list, but the film did not make into best the animated feature. Directed by the director of one of the sequels of 'Shrek' series. Technically, it sounds awesome with cute character models, colours, songs, music and particularly the voice-overs. The story wise, it's not bad, except the concept of eating trolls makes the real young kids go fright.Good for families and even better if you choose to watch it in digital 3D format. The runtime was good with a fine pace. In the line of smurfs, gnomes, fairies, and now these trolls to add in the list for children to watch growing up. Don't bother watching it if you are an adult and only like and enjoy adult films, other than seeing it neutral, as well as opinioning. Purely an entertaining film and I strongly suggest it for the little ones.7/10"
    },
    {
      "rating": "4",
      "text": "I really  dislike this movie. I knew it was going to be garbage. The story, the characters, the song, the moral and the rest of the jokes. But, it had good things like the animation, the last two songs, the two main characters, some of the jokes and the voice cast. But yeah, is a really wast of time. But honestly, is not Dreamworks Worst film."
    },
    {
      "rating": "2",
      "text": "Ugh. There's too many rap parts in this movie and some songs that seem to be very boring. The lore switches up from saving the Trolls to helping a maid help get her love, and is like a rip-off to the Angry Birds movie (trolls try to save their friends from villains, birds try to save baby eggs from pig villains). Pop and rap are the worst combinations and my friend think that Branch is the only good character. The movie wasn't violent and I was counting on it to be. Most jokes and song memes such as \"The sound of silence\" and \"hello\" are so cruddy and old. And in the movie trailer, where they whipped and naenae'd. That is very old and I hope that flame has died out. Also my friend thinks that every single troll is racist. Definitely a bad movie."
    },
    {
      "rating": "10",
      "text": "Trolls was out of this world, Dreamworks Animation have outdone themselves with very clever animation and effects. Anna Kendrick and Justin Timberlake provided good voice talent to the main characters. James Corden, Kunal Nayyar, Russell Brand and Zooey Deschanel provide the perfect supporting cast. The storyline was the perfect mix of emotions. I am not surprised the film was a success."
    },
    {
      "rating": "5",
      "text": "This latest adaptation of a beloved trinket of yesteryear comes in the form of a mixed bag. For every imaginative musical set piece featuring great animation for all ages to savor, you get a poop joke. For every likable original song, there's a half-baked cover of a classic that just seems shoehorned into the narrative for the sake of a potential audience sing-along. For every few novel narrative devices, there's about a handful of other conveniences that comprise the plot. Don't get me wrong - this is not a wholly bad film at all. In fact, it's much better than any film based on a toy should be. I just wish the filmmakers in question would have tried a bit harder, and employed less tropey and cliched stylistics and thematics in executing this film."
    },
    {
      "rating": "4",
      "text": "Trolls was just your average alright animated movie. The beginning of the movie was the weirdest content I've ever seen in an animated or family film. But some moments did get really emotional for at least a Dreamworks film. The songs were alright I don't think it added or took any of the movie's quality. True Colors was the only good performance but the rest of the moments in the movie did not need any music. But overall it was an ok movie that is watchable."
    },
    {
      "rating": "9",
      "text": "This is probably the best musical to come out of Dreamworks, and looking back at flicks like Road to El Dorado, that's against some STIFF competition. First off, the animation is amazing. I dare say it's probably one of the most colorful movies ever put in theatres. Not to mention that you'll feel like dancing in your seat through nearly every one of the songs, especially Can't Stop the Feeling. However, while it's visually one of the best Dreamworks films, the film isn't exactly perfect. For starters, the supporting cast don't offer much (heck, Gwen Stefani only has one line in the entire movie), and the humor is hit or miss. One time they'll pull off a clever joke, like the talking worm scene, but then Guy Diamond would poop glitter on the screen. But even with that, this film is a very good one, and that is a feeling I certainly can't stop."
    },
    {
      "rating": "10",
      "text": "There are certain animated films — like, say, “Inside Out” — that achieve rarefied levels of feeling, imagination, and head-boggling audacity. In their kid-friendly way, they aim high and sail over the bar of their own ambition. But in our desire to celebrate them, let us not overlook the unadulterated magic of a Day-Glo ride for tots like “Trolls.” On the surface (and what a surface! — it just about pops your eyes open with delight), the new feature from DreamWorks Animation, distributed by 20th Century Fox, may not be the kind of blatantly brainy and profound adult-movie-in-toon-drag we’re accustomed to seeing from Pixar. Yet the enchantment that “Trolls” achieves is all too real and, in its way, quite pure. Kids should adore it, but don’t let that scare you — the movie is every 3D psychedelic inch a fairy tale for adults. It’s another antic pop-culture whirligig, with some of the fast-moving prankishness of “The Lego Movie,” but it has a touching theme that dips into a major issue — namely, what’s the nature of happiness? “Trolls” is the right film to pose that question, because it’s an ecstatically happy movie, a giddy EDM kiddie musical that sends you out on a high.A storybook prologue done in felt colorforms tells us that Trolls are “the happiest creatures the world had ever known.” That makes sense if you think back to your own childhood connection to the iconic Troll Dolls, created in 1959 (as the Good Luck Trolls) by the Danish toymaker Thomas Dam. They had androgynous cherub baby faces with big marble eyes and grins so wide it creased their cheeks, bellies that bulged with just a bit of prominent navel, and, of course, those electroshock billows of cotton-candy hair that seemed to shoot right out of their soft plastic heads. The hair, which came in different wild colors, was their most defining feature, yet what really made the Troll Doll special is that it seemed to be beaming, with an innocent mysterioso knowingness. It’s no accident that the dolls got big in the early ’60s: Away from their outfits, they looked like naked angels reborn as baby hippies. That made them, to a kid back then, the coolest toy in the universe.“Trolls” was produced in cooperation with the Dam Family, but the movie makes no fetish of Troll Doll nostalgia. It’s very much a present-tense Troll movie, and though it’s always light and fun, there’s nothing quaint about its motivating conflict: The Trolls live like blissed-out Hobbits in the middle of a woods, but they also live in fear of their sworn enemy — the Bergens, a tribe of giant dyspeptic ogres who are miserably unhappy but don’t want to be, and the way they’ve devised to become happy is: to eat Trolls. They do it ritualistically, once a year, on the day they call Trollstice."
    },
    {
      "rating": "6",
      "text": "It's a perfectly acceptable barrage of glittery insanity which offers the occasional funny joke. The story feels very formulaic but that is forgivable given the enthusiasm that every line is delivered (whether it be spoken or sung!)."
    },
    {
      "rating": "2",
      "text": "Awful, absolutely awful. The story was predictable, the characters were boring and easily hated and the poor choice of music. Clearly this movie is supposed to target everyone apart from critics. I did like the art style but that doesn't save this movie."
    },
    {
      "rating": "6",
      "text": "animation. Cutesy trolls are threatened by ogres, but all will end well and on the way you can muse on the nature of your own relationships and have the odd laugh."
    },
    {
      "rating": "10",
      "text": "Trolls are happy creatures who have always lived in a happy tree in a happy forest. They have happy bodies. Happy hair. In fact, that's probably why their brightly colored mops seem to be exploding out of the top of their heads. I mean, how do you keep that kind of neon joy combed down?These cute little guys are so blissfully gleeful that they can't keep themselves from breaking out in song at any given moment. They love to hug, too. They hug each other so much that they have to limit it to once an hour just so they can actually get something else done.However, always being that euphorically enthused does have its drawbacks. For one thing, it emphasizes to those less-happy sorts that they're kinda missing out.Take the goblin-like Bergens, for example."
    },
    {
      "rating": "8",
      "text": "Wonderful movie with good mix of old school songs from the 80's along with current hits and originals. Teaches children about the importance of caring, being good to each other and that everyone deserves to be happy. Great for the whole family, found myself on more than one occasion jamming out to the songs, as well as my daughter."
    },
    {
      "rating": "7",
      "text": "I love this movie, but I could understand the hate but so I'll list my reasons why I like it and I hate it.reasons I like it:1. the story is really creative, they somehow mixed the \"eat things for happiness, small things need to escape\" act, then added Cinderella, SOMEHOW!2. the characters are relatable, I found myself relating to Branch the most, I can really relate to the depression you go through when the favourite thing you do, killed your parents, my life isn't THAT dark, but due to my love of video games and my dad and mom stated be unable to put up with it.3. I like the animation style, the felt look on the characters where really fitting!4. the sound track was really fitting to the emotion the characters are in, and how in the song \"true colours\" the song went from happy to sad!the things I dislike are:1. characters come and go WAY to much, I only know Poppy, Branch, The Chef and the prince as a result2. the colours where bright to the point of me thinking I'm on DeviantArt looking at a mary sue3. I WANTED A KISS FOR THE END NOT A HUG!! (this one doesn't count)well, do you agree, I hope you like my opinion!"
    },
    {
      "rating": "10",
      "text": "Trolls is generally amazing movie, on the outside it may look like a sugar coated children's movie, but it has some good messages, like how chef bullys and antagonizes Bridget. Or how Creek betrays his friends. Over all it has a sweet plot and the characters are fabulous! It deserves a spot among some of the greats. P.S Mr Dinkles is adorable!"
    },
    {
      "rating": "9",
      "text": "Can’t Stop The Feeling!With colorful animation, Great voice acting, and catchy music, Trolls is a very fun time."
    },
    {
      "rating": "9",
      "text": "Trolls is a sweet, funny, visually impressive romp: a great lighthearted family film with a contemporary sense of humor and top shelf animation. The lighting and materials are enchanting and the character design is very appealing. It's not life changing or profound or deep, but it really doesn't need to be. To me it seems like Dreamworks set out to make a fun, cute film full of charm and they have very much accomplished that. Oh, and the incorporation of existing pop music in the film is witty and well planned. I'll be watching it many more times with my family and friends."
    },
    {
      "rating": "3",
      "text": "I really honestly hate this movie, the only reason I won’t give it a zero is because the animation was good and as cringey as the leading up to the singing may be, the voice acting was good. Would not recommend to anyone other than a little kid.Rating- 37%"
    },
    {
      "rating": "5",
      "text": "It's a good movie for kids. In terms of being entertaining and funny for them, having a positive message, and its music. There are so many worse movies you could be roped into because of your kids too. But it also is really predictable and familiar. So it's not one of those movies that will outright be a waste of everyone's time. I think it has a target audience and it is good for that audience. But for general viewers, I wouldn't recommend this if they wanted to see an animated movie, a kids movie, or both. There are so many better movies that are much more worth your time but at the same time, there are plenty that are worse than this one."
    },
    {
      "rating": "4",
      "text": "Trolls is the type of film that will dazzle children with beautiful animation and keep them entertained with catchy songs. Unfortunately, this is also the type of film that leaves everyone else sitting through 90 minutes of a Bergen-sized mess with a half-baked plot."
    },
    {
      "rating": "6",
      "text": "A dreamworks nos trouxe um filme muito bonito,musicas ótimas,animação de qualidade como sempre,porém com uma historia inprevisivel,e personagens bem genéricos."
    },
    {
      "rating": "7",
      "text": "\"Trolls\" envolve arco-íris, cores, brilho... Ótimo! A trama, porém, não acompanha o impacto visual, e torna-se limitada. Este filme é inesquecível, mas está longe de ser um clássico.7/10"
    },
    {
      "rating": "2",
      "text": "Worst Dreamworks movie! Stupid characters, awful story and a narrative for kids. Good job at Timberlake and Kendrick but this movie sucks so much."
    },
    {
      "rating": "5",
      "text": "Some of Kendrick's less stellar work. The actually funny and clever humor is constantly washed away by excrement jokes. The story is highly convoluted. This movie is nothing to be happy about."
    }
  ],
  "recommendations": [
    "strange_magic",
    "rio",
    "rio_2",
    "vivo",
    "over_the_moon",
    "my_little_pony_equestria_girls_rainbow_rocks",
    "moana",
    "the_lego_movie_2_the_second_part",
    "rock_dog_2_rock_around_the_park",
    "happy_feet_two",
    "the_croods",
    "sing_2",
    "ratatouille",
    "trolls_world_tour",
    "shark_tale",
    "ferdinand",
    "the_road_to_el_dorado",
    "sing",
    "bolt",
    "winnie_the_pooh_blood_and_honey",
    "jingle_jangle_a_christmas_journey",
    "my_little_pony_the_movie",
    "spirit_stallion_of_the_cimarron",
    "cats",
    "ice_age_the_meltdown"
  ]
}