{"id": 283, "title": "Trollhunters: Rise of the Titans", "starring": ["Emile Hirsch", "Lexi Medrano"], "runtime": 106, "genre": ["Animation", "Fantasy", "Family", "Action", "Adventure"], "description": "The Guardians of Arcadia reunite to battle the nefarious Arcane Order, who've reawakened the primordial Titans.", "releaseYear": "2021", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/zvUNFeTz0Sssb210wSiIiHRjA4W.jpg", "categories": {"plot": 4.0, "acting": 6.0, "ending": 4.2727272727272725, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 7.0, "funny": 5.0, "action": 6.5}, "reviews": [{"rating": "7", "text": "Ok I'll talk about the problem of this movie soon, it's its ending But the beginning and middle are excellent I hope that if there is any continuation they do it with the same quality but with an excellent ending"}, {"rating": "6", "text": "Part of me is very disappointed and the other is more or less happy.Of all the series in Guillermo del Toro's Tales of Arcadia saga, Trollhunters had been the one that I'd enjoyed the most and I really hoped for a more satisfying ending.I think the one they ended up doing was one who chose the easy way out, because when you resurrect those who fell, you minimize their sacrifice and the situations for which they sacrificed themselves.By doing so, everything your characters experienced is erased, and starting all over again feels like a very cheap resource.This movie has the soul, charisma and entertainment that characterized this series, but I'm definitely not happy with its ending.You can't always get what you want."}, {"rating": "6", "text": "While it was a decent movie filled with action and emotion I honestly expected a better ending. I felt like they should’ve just went forward and accepted that Toby died rather than going back in time and doing things different the whole what if scenario just blows in my opinion."}, {"rating": "4", "text": "This movie was fairly entertaining. The plot was decent however the action/fight scenes are, in my opinion, the best part of the movie. My main issue with the movie was the ending. It feels off and unsatisfying that the ending would be to simply reverse everything that's happened from the start of the original show."}, {"rating": "0", "text": "All the Series worth 10, even this movie is a 10 until the last scene.The last scene is the worst, the badest final possible they could done, it completely erase everything we seen in the last 5 years, a total waste of time until now.The badest final ever that ruins the entire seriesBleah!!!"}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "2", "text": "The movie is awful it completely fails to cohisively bring together 3below compared to the other two and its attempt at humor with the steve subplot just makes me uncomfterbul and aja is so much more of a dick than she ever was in 3below also jims arc in the movie is such bs because in trollhunters original he had sacrificed his amulet and was okay with the concequence but now he is  so worried that he would be powerless without it even though he already proved that he was not and the ending is a total copout because it is just \"oh i will go back in time to make things the way i want them\" and it **** sucks because none of the hard decisions and sacrifices he mad along the way are pointless this movie could have been so much more but they failed miserabley"}, {"rating": "0", "text": "You can make it worst even if you try!Lamest ideas ever!!And the pregnancy think was ridiculus and awful.."}, {"rating": "7", "text": "so what to say about this movie it was pretty awesome im not gonna lie with some amazing action set pieces, some scenes that actully bring tears to ones eye, and enough levity even if some jokes are a bit iffy to keep you enjoyinghowever even with all of these their comes a part of this film where you kinda go \"what was even the point\" and more so the ending kinda doesnt make much sense they argue it well and probaly could have worked if they hadnt done it in \"trollhunters\" and shown why such a thing would not end happily (even if the changes are their) its hard to avoid spoiling but thats the best i could dooverall its a fun film and i have no doubt that you would enjoy it, but the ending falls flat for me, but i hope this helps someone decide if they wanna see it or leave themselves with a less bittersweet taste by simply sticking with the wizards ending."}, {"rating": "3", "text": "Caçadores de trolls estava muito bom ate chegar o final do filme. Esse final é horroroso PRIMEIRO: ele destroi toda saga com o desenvolvimento do jim jogaram no lixo ele não sendo mais caçadores de trolls. SEGUNDO: ele tirar o jim como caçador e passa para o bob que não sabe com é ser um ele, ele é para ser um braço direito do jim e não o sendo o principal. TERCEIRO: ele excluiu tudo q aconteceu apaga a memória dos personagens de um jeito horrível e o único que sabe o que aconteceu foi jim. NOTA 3"}], "recommendations": ["the_twilight_saga_breaking_dawn_part_2", "next", "the_final_destination", "how_it_ends", "the_new_mutants", "el_camino_a_breaking_bad_movie", "batman_v_superman_dawn_of_justice", "terminator_genisys", "the_hangover_part_iii", "the_hunger_games_mockingjay_part_1", "knowing", "the_hunger_games_mockingjay_part_2", "wonder_woman_1984", "final_destination_3", "pirates_of_the_caribbean_on_stranger_tides", "bird_box", "paranormal_activity_4", "pirates_of_the_caribbean_dead_men_tell_no_tales", "happy_death_day_2u", "jigsaw", "final_destination_5", "final_destination_2", "shut_in", "furious_7", "glass"]}