{"id": 613, "title": "TRON: Legacy", "starring": ["Jeff Bridges", "Garrett Hedlund"], "runtime": 125, "genre": ["Adventure", "Action", "Science Fiction"], "description": "Sam Flynn, the tech-savvy and daring son of Kevin Flynn, investigates his father's disappearance and is pulled into The Grid. With the help of a mysterious program named Quorra, Sam quests to stop evil dictator Clu from crossing into the real world.", "releaseYear": "2010", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/vuifSABRpSnxCAOxEnWpNbZSXpp.jpg", "categories": {"plot": 8.409090909090908, "acting": 8.846153846153847, "ending": 8.0, "soundtrack": 9.380952380952381, "cinematography": 8.333333333333334, "familyFriendly": 8.0, "funny": 8.5, "action": 8.294117647058824}, "reviews": [{"rating": "10", "text": "An absolutely marvelous film with breathtaking visuals and beautiful art direction.  So much of the spirit of the original film is in this one with references for the fans of the first movie to smile with pride for understanding.  My only complaints are: there is no Bit (loved Bit in the original) and the vintage lightcycle is a great sight and it's built up, but it gets next to no worthwhile screen time.  Regardless of those complaints, it's a fantastic movie with plenty of geek fanfare and love for the fans of the original.  The acting is strong, the writing sharp, and the soundtrack is undeniably awesome.  I cannot recommend this film highly enough.  Go see it!  End of Line."}, {"rating": "6", "text": "When I first saw this movie, I absolutely loved it. But when I saw it again.......eh. I kinda like it, but there's so much wrong with it. The visuals were awesome, the action was cool, Jeff Bridges and Michael Sheen were good, and I loved the soundtrack. But the film's bad script, lazy plot, lack of explanation for most plot devices, mediocre acting asides from the two above (although it would be really hard to be good with this bad dialouge), bad pacing, and the ending kept it from being that good. Now, keep in mind, I'm not trying to be a snobbish critic. I can always love a good dumb popcorn flick. I mean, I love Transformers 2 and I really like Clash of the Titans and the A-Team. But the action, while cool, wasn't good enough to elevate it to that level of dumb popcorn flick, and the movie took itself way too seriously, It thought it was a Matrix or Inception level sci-fi masterpiece and it wasn't. But I do recommend it. Just see at a matinee, and only see it once."}, {"rating": "8", "text": "So um... this is tron. and daft punk created the whole soundtrack...  with that information its got a 10 already. Its the most visually pleasing movie ive ever seen and its all backed up with a daft punk original soundtrack!!!!! now the story isnt all that great, but it isnt bad. If you have no idea what tron actually is that will take away abit from the movie. BUT if u like old videogames, if you like eye candy, if u like daft punk... GO SEE THIS MOVIE"}, {"rating": "10", "text": "This film has been unfairly panned by critics. its only flaw is cramming enough visuals dialog and story elements for two full length films into one. If you can forgive the hurried pace of many scenes then you will find a rare gem in Tron Legacy. The acting and direction outshine the Star Wars prequels so brightly its like comparing coal to a precious gemstone. The score and accompanying soundtrack are subperb, alone making the DVD or Blu-Ray purchase worthwhile."}, {"rating": "9", "text": "Tron: Legacy is a great film that entertains with a good story, nice acting, excellent music and sounds, and with a visual style that keeps your eyes glued to the screen. Overall this is a film full of Sci-Fi entertainment that would have expected since this film's first rumor.This film is a interesting cross between the original Tron and the Matrix and the similarities are hard to miss. The blend is great. While maintaining that \"Tron\" atmosphere the addition of the \"Matrix\"-type world of characters and locations added a nice change of pace from the traditional in-a-data system-feel. It would have been great to see this explored further but where it settled with the plot of the story was fitting and comfortable. The Visuals and Audio was truly amazing. The classic tones of the Tron world enhanced with the Techno beats of Daft Punk was a perfect match with style.The movie itself was strong with Jeff Bridges at the lead. The Computer animated Jeff Bridges needed to go through several more rounds of work but it was a decent attempt that could have just been avoided altogether. Nothing would've been wrong with a human antagonist. Most of the scenes did not look right but at least you could tell where the filmakers were going and that was enough to forgive.The story was very traditional and could have easily been more epic but I gather it will be more for the planned Trilogy rather than during the reintroduction of the franchise in 20 years. Start strong and grow big."}, {"rating": "10", "text": "Underrated! This is the type of film that bulds a strong cult following despite negative reviews. There are some plot holes, but really, nothing that hurts the story and nothing you could think of for an explanation as to why something happened.I wonder why this movie was hated and really the movie itself was made for lovers of Tron. Although the family I saw it with loved it, they were confused as to who was who. Perhaps there is a cultural gap. Either way, there was no major flaw to me in this film. Lovely story, despite all the hatred towards it, a soundtrack worthy of the Oscar but will more than likely not even get the nomination due to the artists who made it, beautiful visuals, as much as people will hate to admit, film is a visual medium and without great cinematography or wonderful art direction, other films risk bleeding into each other, Tron Legacy excels just as it did in the original and will be fondly remembered because of it, and one more thing, the performances. Not a single bad performance in the bunch, everyone delivers in their own way. Director Joseph Kosinski has a great future ahead of him. He might have to make the average drama in order for people to realize it, but the man has great potential in hollywood and I hope he gets the chance to make one more film as it was intended."}, {"rating": "10", "text": "visuals were a billion times better than avatar and the soundtrack was unbelievable. exceeded my expectations in every way. critics are dumb, olivia wilde is a fricken babe, this movie was the best this year."}, {"rating": "9", "text": "Great, Great, Great, Great movie. It's a work for the geeks, and jeff bridges fans. Cool style, actions was fantastic, I was even surprised that the acting wasn't as terrible as I expected! Bottom line is that if you willingly watched the first tron and enjoyed it you'll love this. If your looking for a cool action movie, you'll love this. If your looking for a great work of art or a truly compelling story it will only be meh."}, {"rating": "10", "text": "if you hate this you where expecting to much and was disappointed. and when Disney says 3d it doesn't mean sh*t  poping in your face. it means they are trying to make the movie look like it has depth."}, {"rating": "8", "text": "Entertaining and fun. 3D was weak. Story was not weak at all, quite good for an action / sci-fi movie. I would recommend this to anyone who like sci-fi or hero movies. It's better than most."}, {"rating": "10", "text": "This movie was great. My first \"new generation\" 3D movie and it delivered. Saw it in an IMAX theater and it was quite the experience, visuals were amazing and the story was good, not sure what movie some of the others are watching. It's an adventure flick, plain and simple, setting up a new world/franchise that I hope continues to grow and prosper. I heard a lot of the negative press and have to say I can't imagine why. Just sit back and enjoy the film, it's not a sermon no matter what some critics would have you believe. Who's paying them anyways, most seem to have no touch with what the public is looking for in terms of entertainment."}, {"rating": "10", "text": "This movie is fun, edgy, cool. It won't be a critic's choice, but It's better than typical Hollywood fluff. I hope they make a sequel, the story has been setup well for one. While this film has a good level of closure, there are plenty of options to take things further."}, {"rating": "10", "text": "I'm sorry that many people (and critics) don't understand that the whole point of going to the movies is to be entertained and to escape from reality for a while.  TRON Legacy is wonderfully entertaining, visually stunning, and the story is engaging and plenty full of depth, despite what you may have heard.  Also Jeff Bridges delivers an exceptional performance along side other strong actors.  I will agree that the CGI on young Bridges looks out of place in the \"real\" world, but on the grid as the tragic antagonist CLU, It is entirely convincing that he exists.  The villains are very interesting and at times I found myself rooting for them because of how cool and they are, especially Michael Sheen's fabulously despicable character.  I never saw the first one nor was I born in the eighties, but I still thought this movie was fantastic, it doesn't just appeal to people in their thirties who want some nostalgia.  Also, it's called TRON because the first one was called TRON and because calling it CLU, Light Cycles and Laser Frisbees, or Kevin Flynn and Company's Spacey Adventure on the Grid wouldn't be as catchy.  I would give it a 12 out of 10 if I could because it was just that awesome of a spectacle and story of estrangement, betrayal, political symbolism, and self-sacrifice.  Also, the soundtrack is top notch, I had my doubts at first when I heard Daft Punk was doing all the music, but it has one of the best scores of any movie that I have seen.  Definitely see this movie, you will be surprised at how good it is."}, {"rating": "10", "text": "Ok look you people are idiots, what do you expect when going to a movie entertainment not some deep thought provoking movie that will unravel the meaning of life of course not you go in there to watch a freekin movie. It's a moovie for peat sake. The graphics where amazing the acting was awesome the story line kept true to the tron legacy and the music was perfectly chosen. I sat through the hole two hours and while I was in the theater I completely lost track of time and if a movie can make you feel like that than it's a great movie. So I give tron legacy a million out of a million. And let me tell you people that get a kick out of making people feel bad feel bad for working hard on something well than you can suck my left nut and if you go into a movie theater to look for the meaning of life than you might as well kill yourself because the closet thing you'll ever find to the meaning of life is staring at you straight down the barrel of a gun. So screw you an tron legacy is an amazing movie no matter if you 10 or 100."}, {"rating": "10", "text": "How can anybody not like this movie? If your argument is that it failed the original, revise your argument. This affectionate sequel paid sincere homage to its ground-breaking 80s predecessor, without being spoofy. It was clearly made with love by a director who is a much a fan of the original Tron as Chuck Bartowski is. The 3D is neither gimmicky or showy but serves to pull in the audience like they have been affected by the laser as well. This is complemented by the forwards/ backwards movement in the movie which made the whole thing feel like a fairground ride. Daft Punk's soundtrack was quite simply AWESOME. The electro sound adds to the cleaned-up 80s feel of the movie and it is just so fantastically LOUD that it contributes beautifully to the immersive and disorienting experience. It isn't just the soundtrack itself that makes the movie a musical feast: Kosinski uses sound  wonderfully to frame each movement, scene and mood-change that the movie is reminiscent of his very clever commercials and game trailers. it becomes very clear how he landed this gig. I'm thinking in particular of  the moment, in the club/ fight scene  where Flynn appears looking like a scary Dalai Lama/ Santa Claus accompanied by  a cacophony of spine-tingling techno magic. You have to see it! There are not enough good  words to describe Jeff Bridge's performance as the now world (and grid) weary hacker Kevin Flynn so I will plump for these stellar and so so cool. Relative newcomer Garrett Hedlund is  an excellent young protagonist. I expected him to somewhat irritating (like Hayden Christensen in Attack of the Clones) but he wasn't and brought a Mark Hamil-esque quality to the piece.  I have heard so  much criticism of the CG which brought CLU, Flynn's creation-turned-nemesis, to life. The criticism was that compared to the surrounding characters it didn't look quite right. These people seem to be forgetting that they are comparing CG to REAL PEOPLE. Any graphics that are not quite as good as flesh as blood must be pretty good really. Remember how awesome we all thought Beowulf was.....The overall feel of the movie is irrefutably polished and exciting. It made feel like an 11 year boy (which is an achievement as I'm a woman, so have never been one. ) Those who feel the story should have been more complex should remember this film was brought to you by Disney, the studio responsible for Pirates of Caribbean and Snow White. Any critics who feel that it didn't live up to the original should probably go watch the original again."}, {"rating": "9", "text": "I know the critics are bashing this film and that makes me happy.  That confirms to me mission accomplished by the producers and director.  If they made a critical success that would mean they had dumbed it down to much and not played to the fan base that will truly make this the success it can be.  I think they did it right, it gorgeous, it sticks to canon, and it tells a story."}, {"rating": "9", "text": "As a fan of the first movie I was eager to see Tron legacy, but at the same time afraid that it wouldn't be all that great. Well, I'm happy to say that I was very pleased with what I saw. Ignore the critics; all they want are movies that pull your heartstrings and make you think. Those are good movies, but sometimes, I just want to watch a movie that takes me on a fun flight through imagination, and that's exactly what Tron legacy does."}, {"rating": "10", "text": "Hmmm makes me wonder why some of the reviews are over analyzing this movie. The movie is near perfect in bringing TRON to today's audience. The acting was well done and the visual effects blew me away. I guess my only complaint is that I would of liked to have seen more of TRON (Bruce Boxleitner), but maybe in the next movie. Daft Punk really delivered in the muscial score...I hope this is not the last of Kevin Flynn...\r Me: I have been a loyal fan of TRON since I was a kid, owned both TRON and Discs of TRON arcade machines, attended the 2000 E3 show to help promote TRON 2.0 the PC game with then rumors of Disney looking at scripts for a movie...I'm happy to say that I loved the film and it exceeded my expectations.\r Disney really owes a lot to www.tron-sector.com, who helped keep TRON alive all these years..and here we are ;-)"}, {"rating": "7", "text": "I am suprised that critics hated it so much, It actually was pretty good. The action scenes were good and the acting was ok (I expected better) and the story was true to the series but lets be honest - The story sucked, It wasnt interesting and it ended so poorly that it left me saying \"I watched this movie just for that?\". The story brought it down a lot but the enjoyable moments through out the movie made it worth the watch."}, {"rating": "10", "text": "This movie was awesome!!!\r Disney did a perfect job on the special effects and the fight scenes.\r The music was amazing, Daft Punk are a excellent duo and fit the movie completely.\r I saw it in Imax 3D and I was suprised because the sound is so loud, it made the chairs vibrate I was like \"I felt that!!\"\r Super cool movie!"}, {"rating": "8", "text": "I absolutely loved the movie. The lightcycle races and the disc wars were absolutely spectacular and Jeff Bridges gave his all in a great performance. And Daft Punk is just the cherry on top! Possibly the best family movie I have seen since Monsters VS Aliens."}, {"rating": "10", "text": "The original Tron holds a sentimental value to me, as my father and I watched it early on in my childhood. I was always interested in computers, and from that day on, video games too. The story of Kevin Flynn being trapped in a digital world with no means of escape and to be there for almost 25 years before an aggressive CLU(codified likeness utility) took it upon himself to lure Flynn's son Sam into the machine makes for one HELL of a great story, and it grabbed a hold of me right from the start. Jeff Bridges does a great job of playing himself, young and old, and CLU, the program that ultimately turns on him and drives him into exile.And the movie wouldn't be the same without the TOP-NOTCH soundtrack done exclusively by Daft Punk. They have a rare gem on their hands with this Album, and I'm listening to it now as of this being typed....I can say enough about it: emotionally attaching, great soundtrack, gripping storyline, and a decent job by the actor portraying Sam Flynn, Kevin's son, Garrett Hedlund-all makes for a great movie I can't seem to watch enough."}, {"rating": "10", "text": "I guess I really don't see what the critics see because I saw nothing wrong with this film. The acting was good, the visuals were stunning and the soundtrack was amazing I bought it right after I saw the movie. This movie was great. The only negative thing I have to say about it is their weren't enough games. Their shouldve been way more battles, but other than that the father and son story was great, the sound effects were ecstatic, and like I said before the soundtrack was the best I've heard in a movie in a LONG time, Daft Punk is amazing at what he does. I hope theirs a third. This movie deserves high praise, 10/10."}, {"rating": "9", "text": "This movie did not disappoint, with loads of action, great special effects, and an awesome soundtrack, I spent most of the time with a big grin on my face! Disney have done a very good job here, entertaining for adults but at the same time not too hard for children to understand what was going on (my 5 and 7 year old sons both understood it). Also, there are some very cool nods to the original Tron (no spoilers, you'll just have to watch it) and Jeff Bridges is amazing! Well done Disney, hope there is another on the way."}, {"rating": "10", "text": "Mesmerizing movie, with perfect audiovisual presentation. The visuals and the 3D were breathtaking, incorporating the awesome soundtrack from Daft Punk, = the conclusion is an epic allgasm. I even liked the story, nothing too convulted, a good son and father plot with great references to the original movie. Sure, there are some cheesy dialogues and phrases that would make an expert cringe, but overall it's a complete package."}, {"rating": "10", "text": "Tron: Legacy is an action packed Sci-Fi Fantasy that captures the true potential of the human imagination in the digital world. Jeff Bridges (Kevin Flynn and Clu) goes all out and plays a two-part role in this digital adventure. When Kevin Flynn discovers a portal into the digital world, he replicates himself by creating a program that he named Clu. Together, Flynn and Clu worked to create a Utopia, until Clu betrays Flynn.  Flynn cannot defeat his digital self and therefore goes into hiding in the digital world from Clu. For over 20 years, Kevin Flynn is trapped in the grid, while Clu builds his empire. Cluâ"}, {"rating": "8", "text": "Entertaining. Visually it's more pleasing than Avatar, from my perspective. Story wise it's also much more original - but still lacking. There was room in this TRON universe for more of a complicated story but instead this was a pretty stock storyline. It was still a fair movie though, and the visuals were nothing short of amazing. Would recommend it, you'll be glued to the screen most of the time. Except that at a few times the fast pace of the story and action seems to slow down, and there's corny lines. Other than that it's action packed."}, {"rating": "9", "text": "This is a movie that goes beyond that which the \"professional critics\" expect out of movies. It provides an original (even though it's a sequel) movie-watching experience that does a good job of allowing the viewer to suspend disbelief. It's visuals are stunning, the soundtrack fits perfectly to the theme of the movie (a lot of techno and futuristic music), and the sound effects are enthralling and make you feel like you're really in a virtual and high-tech sci-fi world. There are plenty of action scenes that break up the boredom and monotony from which the original movie suffered. I did not see the movie in 3D (because i don't believe in using 3D tricks and gimmicks to overshadow lack of movie-making abilities). Therefore I have no comment on the quality of the 3D experience. However, knowing Disney's track record with quality movie-making, I'm sure they didn't disappoint (for those who are interested in that sort of thing). The only downside to the amazing visuals was the CGI Jeff Bridges. Though the technology that goes behind recreating human faces and emotions are getting better by the year, they still seem a ways away. The tones and colors of young Jeff Bridges' face were spot on, but he often seemed to lack that emotional and subtle quality that we are all honed in to detect. The story was more enthralling and dramatic than the original, but very predictable. Do yourself a favor and ignore the \"professional critics.\" See this movie if you have an open mind, are a fan of sci-fi, and enjoy stunning visuals and enthralling music and sound effects."}, {"rating": "9", "text": "Really great film. Exciting, interesting, visually appealing, emotionally engaging, nostalgic, and modern. I'm seriously having trouble understanding where such negative reviews are coming from."}, {"rating": "8", "text": "TRON Legacy... well I honestly didn't expect an innovative story like Inception from the trailer, and that's what I got.  Its not garbage, but not anything we haven't seen 100 times already.  Audio is amazing, visuals are good, but 3D is NOT as strong as it should be, I believe they could have at least put a little more effort into it.  My recommendation is to go 2D if you see it.  But all that aside, TRON Legacy is GOOD.  You will get entertainment out of it, and it is worth your attention."}, {"rating": "6", "text": "The visuals are fabulous and are enough for one to see the film. The story isn't much, and many questions are left unanswered. The fight scenes were pretty cool, though, and the cast does a good job - particularly Bridges, who has fun playing two characters."}, {"rating": "8", "text": "I actually thought it was pretty good. Solid acting and good effects as well, Works well in 3D too. The downfalls of it though is the rather long run time, Far too long if you ask me. Also while its entertaining for the most part, Its rather boring at times as well. Overall its still rather good."}, {"rating": "6", "text": "After more than a decade, another TRON movie was released. Did it make the fans happy ? Yes ! But I didn't saw the old TRON Movie (1982) so I was kinda amused. That does mean that you have to see the old one to like this one. The visual effects were outstanding. The disc trowing battle was bad-ass, I wanted to see more of that. Sometimes, especially at the end, it had those moments were it touches you. TRON : Legacy was kinda shallow, but it was a cool, hardcore movie, with hot chicks (Olivia Wilde). Still, this movie may not be for everybody."}, {"rating": "9", "text": "Excellent the CGI is incredible and the soundtrack is pumping not the best film I've seen this year that was a toss up between Scott Pilgrim and Harry Potter but this is a close second if your a fan of the original i would definitely recommend checking this out. if not in the Cinema rent when the Blu-Ray comes out."}, {"rating": "8", "text": "Tron: Legacy is quite a solid film.  The story and setting are so nuanced and quirky it keeps things fresh despite the numerous action scenes.  Solid performances from the actors and a fantastic soundtrack inject meaning into a world crafted via Disney's heavy-handed application of CGI animation.  Of course, the depth and complexity of Tron may not reach the heights of classic dramas but Tron sits comfortably among the other popcorn flicks playing at your local 12-screen and has a ton of fun besting them."}, {"rating": "8", "text": "Amazing visually - I really wish I had the chance to watch this movie in theaters in 3D. I wasn't expecting too much from the plot, but I actually really liked it.  And the score by Daft Punk is really sweet. Overall, I really enjoyed Tron: Legacy."}, {"rating": "9", "text": "I struggled with the score for this movie.  Should I give it a 9 b/c I really liked the movie, or should I give it a 2 because I was felt ripped off by the 3D upcharge that WAS NOT worth it?  I paid $7 extra to see it in 3D, but I was sorely disappointed to find out only a few scenes were actually shot in 3D.  Sadly, there was more exciting 3D 2 minutes of previews before the movie, than in the entire Tron movie.\r Getting past that, I really liked this movie, the themes, and the art/graphics direction of the movie.  Not the highest tech effects, but definitely well done.\r The movie was a little confusing at points(especially, for non-Tron fans and non-Geeks), but overall, I was really happy with the movie and the ending was pretty good."}, {"rating": "9", "text": "Truly spectacular, while I haven't seen the original Tron I really loved this movie, the world is awesome, characters are fantastic, and it just has an amazing atmosphere to it, it's action packed and just a lot of fun to watch, and the special effects and the cool suits they wear are awesome, and the ending has me hoping for another movie, truly a spectacular ride form beginning to end."}, {"rating": "9", "text": "One of the most exciting, entertaining and visually pleasing movies I've ever seen. Along with the solid plot fidelity it's hands down one of the best movies I've seen in years."}, {"rating": "9", "text": "Not sure what the critics are talking about! Great movie, good acting, stunning visuals, fun soundtrack. If you like Avatar, you'll like Tron: Legacy."}, {"rating": "7", "text": "This is no Oscar winning masterpiece, but I still enjoyed it even with it's flaws. The biggest gripe would have to be with the story but even with this it still made for entertaining watching. Very shallow character development and a story that seemed to awkwardly plod along to the start of the entry to the grid were things started to pick up  Action sequences were spectacular and had me engaged through out. Very cool when watching full screen in an IMAX theatre. Jeff Bridges dialog had me cringing occasionally, but other than that I thought it was pretty enjoyable. So much so, I'm going watch it again this weekend."}, {"rating": "10", "text": "This movie really did pay tribute to the original. I have been a fan sense the first one and this one is exactly in the same spirit. It is slow at times, fast paced at others as well as being visually and musically a landscape. The sound and sites are a treat, the story, while not perfect, is, when compared to the first, a perfect sequel. I can't wait to see if this series can ramp it up in following movies, or if it dies do to over critical inter-net snobbery. See the first one again, then go see this. You will not be disappointed and in the end that is why you bought the ticket and took the ride.END OF LINE"}, {"rating": "8", "text": "An absolute spectacle. Breathtaking, cinematic and inspired. The story is fairly weak (but fashionably Disney), and the dialogue a little forced (\"Radical, man\"), but the experience is far from disappointing. The musical score has an undeniably exciting leitmotif, and the fact that it was composed by first-timers Daft Punk really emphasises its brilliance."}, {"rating": "10", "text": "I loved this movie... I want more!  Go see it."}, {"rating": "8", "text": "I was pleasantly surprised by Tron: Legacy.First off, this movie has the best matched soundtrack in a very long time. Daft Punk do/does the music and it figuratively drives the film.The visual effects are very nice and help tell the story as opposed to overshadowing it.The acting was good and it was fun to see Bruce Boxleitner and Jeff Bridges back on The Grid.I also thought it was cool that there was a brief reference to the old MCP.There was plenty in this movie to create new TRON fans and enough bones tossed to old TRON fans to make them (me) feel acknowledged.I give it an 8/10.I think the movie could have been edited down to improve pacing and reduce the overall length of the film."}, {"rating": "7", "text": "Interesing movie, but it's a cliche, it doesnt give us something new and the music i expected more of Daft Punk, the only  really good it's the visual effects but the don't know how to use in its totallity the 3D.... its only a movie that you can see in your room in a borin sunday afternoon. i hope my \"critic\" could help you for make a descicion to see it"}, {"rating": "7", "text": "I'm old enough to have seen the first TRON in the theater so I have to admit, I walked in somewhat jaded and thinking it wouldn't likely be very good. I was actually pleasantly surprised. There was good chemistry with the actors and Olivia Wilde was an excellent addition to the cast. The technology and vehicles were also very well done."}, {"rating": "9", "text": "Tron Legacy is a great movie if you've seen the original. It's great special effects,acting,script,and action. My opinion is that you shouldn't see tron in 3D. It's a GREAT movie!!!!"}, {"rating": "6", "text": "My personal favorite scene in thiz movie is the opening scene, where young Kevin Flynn was telling his son the story of inside The Grid, the digital frontier that expected to become true someday. In that scene, you could see for the first time the figure of young Jeff Bridges was created, the camera angle tried to distract our view by spinning the face direction. Only then when he stood in front of the room door, finally you would be able to see his face in full image. That was awesome. 61-year-old Jeff Bridges just looked like when he was starring in BLOWN AWAY (1994). Afterwards, the story revolves around the grown-up Sam Flynn (Garrett Hedlund) receives a new clue about the disappearance of his father twenty years ago. His investigation ends up dragging himself into cyber-universe of his father computer system creation. Thiz is a sequel from the original movie, TRON in 1982. The Director is unknown Joseph Konsinski, thiz is his first feature film for big screen. I can see some weaknesses around the plot and unnecessary dialogue, particularly in the middle of the movie. However, the high concept of how they build a whole new neon-futuristic universe is fascinating, especially the bike and the car which are very dashing and impressive. I think all Casts look cool, but only in styles, not acting. The sexy skin-tight costumes on Quorra (Olivia Wilde) and Gem (Beau Garrett) are totally jaw-dropping. Michael Sheen transforms into some sort of David Bowie character as Zuse, the charismatic night-club owner, but it is still brief and empty element is attached to the story for overall. Some of the action scenes are boosted with great fusion of electronica tracks by Daft Punk. Do you notice that those French electronic DJ have also appeared in thiz movie? Where are they? In case, if you have missed it, they are the duo masked DJ at Zuse Club. I know that thiz movie is left with tons of unanswered questions, but personally I also enjoy a new whole concept of philosophies (just like in THE MATRIX (1999)). There are so many stuffs to think about. Why do we have to chase for the perfection? While it has already there, right in front of us all these times. Since the long a time ago, I was concerned that many of young people in thiz generation were wasting hundred of hours by playing video games, while there were so many things more worth doing. Kevin Flynn is right! The only way to win thiz game is not to play it. These whole things are not just about User Vs. Program, Tron Vs. Clue, Blue Vs. Orange, or The Evil-side Vs. The Good-side. The movie simply reminds us, the biggest enemy is none others than ourself.\r Visit My Blog on JONNY'S MOVEE: http://jonnyfendi.blogspot.com"}, {"rating": "7", "text": "A bit of a disappointment for me. While visually stunning and with incredible music, the tempo is uneven and the movie is sometimes boring. But at least a few truly incredible parts, bring this movie to 7/10 for me."}], "recommendations": ["alita_battle_angel", "oblivion", "the_adventures_of_tintin", "oz_the_great_and_powerful", "top_gun_maverick", "john_carter", "pan", "aquaman", "the_fifth_element", "the_three_musketeers", "tron", "tomorrowland", "avengers_age_of_ultron", "dredd", "cruella", "edge_of_tomorrow", "kung_fu_panda_2", "jupiter_ascending", "super_8", "hercules", "gemini_man", "shang_chi_and_the_legend_of_the_ten_rings", "blade_of_the_47_ronin", "morbius", "king_arthur_legend_of_the_sword"]}