{
  "id": 3532,
  "title": "Tron",
  "starring": [
    "Jeff Bridges",
    "Bruce Boxleitner"
  ],
  "runtime": 96,
  "genre": [
    "Science Fiction",
    "Action",
    "Adventure"
  ],
  "description": "When brilliant video game maker Flynn hacks the mainframe of his ex-employer, he is beamed inside an astonishing digital world...and becomes part of the very game he is designing. In his mission through cyberspace, Flynn matches wits with a maniacal Master Control Program and teams up with Tron, a security measure created to bring balance to the digital environment.",
  "releaseYear": "1982",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zwSFEczP7AzqugAHHIX3zHniT0t.jpg",
  "categories": {
    "plot": 7.090909090909091,
    "acting": 5.8,
    "ending": 4.666666666666667,
    "soundtrack": 8.0,
    "cinematography": 7.0,
    "familyFriendly": 7.666666666666667,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "This is a classic! The dialogues are not the best, the cinematography is a bit boring and the overall rhythm of the movie is way too slow for today's youngsters, but the technology used was the state of the art back in the day when the movie was filmed.Being a movie released in 1982, the special effects are rudimentary, at times confusing, and somewhat annoying (the colors are too bright), but computer and video game geeks like myself will surely love this movie. The plot is simple as compared to other movies of that era (like \"Star Wars\"), but the concept behind computer stuff is quite complex. And visionary, I might add.I love the song played in the closing credits: \"Only Solutions\", by Journey. Another song by Journey (\"Separate Ways\") is featured in \"Tron: Legacy\", thus giving an idea of continuity.Tron is a must-see for every science fiction fan.Kudos to Steven Lisberger for envisioning a computerized world that still makes us dream."
    },
    {
      "rating": "10",
      "text": "i dind enjoy this film so much, this film have a not really convincing story but the scenes of this film are beautiful with a lot of 80s special effects this film brings you in the story it's a beautiful experience.you should watch this film if you like adventure, videogames and computers.age +7"
    },
    {
      "rating": "6",
      "text": "Visuals look pretty bad now but Bridges is good and there's something quite nostalgic about watching this film."
    },
    {
      "rating": "4",
      "text": "Tron, the movie's got an interesting plot, which is about this lad called Kevin (Jeff Bridges), who's a software programmer.He's later dragged into the virtual world, where he's against an evil software. He ends up taking the help of Tron, which is pretty much this security programme which ends up helping him to defeat the villain.The movie's got some not so good acting from the cast and the dialogue from the characters throughout this movie is very cringey and cheesy.Also, the pacing for the build ups throughout this movie aren't great, certain moments could be built up a little bit better.The light cycle scenes are decent but the visual effects, which are used for them aren't great.Finally, the Visual effects don't hold up very well. All of the effects which are used throughout this movie don't hold up very well and they're very outdated.Overall, Tron has got an interesting plot, not great acting, cheesy dialogue, not great pacing, decent light cycle scenes and lots of very outdated effects."
    },
    {
      "rating": "6",
      "text": "Tron is a good thriller which is fun and thrilling to watch. Movie's on the point and pacing is also good except the climax which was little bit prolonged. The story is ahead of it's time but the visuals were very bad. It may try to ruin your experience but then they have excuse of less budget. Overall, the movie is enough for you to get entertained."
    },
    {
      "rating": "5",
      "text": "Having had his work stolen, computer programmer Kevin Flynn attempts to hack into his former employers system to expose the executive responsible. During his attempts he finds himself transported into the digital world, where he has to help the oppressed programs defeat the imposing Master Control Program. Forty years ago Tron’s computer generated graphics would have been mightily impressive to cinema goers, but these days they just look incredibly dated, and once you strip that away this is a movie that doesn’t have an awful lot going for it. From the outset the script is full of technobabble that does nothing to help the viewer understand what is happening, and any emotional beats are missed as the film does very little to make us actually care about any of these characters. It may have once been at the forefront of movie technology, but it’s a bit of a boring watch."
    },
    {
      "rating": "4",
      "text": "The visuals are still very unique and Bridges carries a relatively weak cast that has to deal with some awkward dialogue throughout the film. The pacing is also pretty bad and it's hard to maintain interest despite what's going on onscreen. Tron is an average movie TBH that really doesn't age well."
    },
    {
      "rating": "7",
      "text": "In my humble opinion, Tron: Legacy is a better film. Mostly because the soundtrack, CGI, and certain aspects of the plot were improved.(eg. the villain) But Tron is definitely a competent, well made, clever film as well. I have zero doubt about that. The attention to detail in the Grid is awesome, the script is good, the effects are well done, and the music, occasionally, improves the film a lot. However, the CGI can look very bad at certain points, and the dialogue can be cheesy and/or awkward at points too. But overall, Tron is a decent, well done film that, despite it's age, you will be glad you saw."
    },
    {
      "rating": "8",
      "text": "I don't know about anybody else but I really quite like this movie. While I did love its concept, I do agree some parts are difficult to comprehend at times and at others there is a slow rhythm making the film not quite as compelling as it would have liked. Regardless, I still like TRON a lot, especially for the superb effects and visuals and unique sound effects, both assets of which are quite ahead of their time. Also the soundtrack is very memorable and fits perfectly, and even with the odd stilted moment the dialogue intrigues. The direction is good enough and serves its purpose well in the more action-packed moments, and I did like the characters and acting. Jeff Bridges is charming and likable with a cool character, while David Warner comes close to stealing the show. All in all, a very intriguing film then and now and ahead of its time. 8/10 Bethany Cox"
    },
    {
      "rating": "8",
      "text": "Ok, quality wise this movies not....great, but as an example of early 80's sci-fi this movie is amazing! the world they set up is awesome and the characters are pretty fun to watch. overall I like this movie, is it perfect? No not even close! but is it cool and fun? Heck yes!"
    },
    {
      "rating": "7",
      "text": "That's a good 80s load. That's exactly what Tron is. You can feel the atmosphere of the game room and the overall computer technology of the time and it's delicious. A wonderful spectacle for the eyes with a good plot. A pretty original idea for me, too. Nowadays a classic and for me a good film that I recommend."
    },
    {
      "rating": "6",
      "text": "Really much ahead of its time. So much so that one of the most incredible stories about this movie is the tragedy surrounding the \"Best Visual Effects\" nomination it didn't receive (more on it in the Special Features of the film or here on IMDb). And it wasn't even that long ago that they seems to have viewed this as the act of a \"witch\" (my conclusion for their strange decision). The Dude plays it very straight aside from that. Although his set storylines (and the console playing while \"getting into character\") are another fascinating tale in and of themselves. The film itself was heavily sci-fi at the time. Even though it never happened, the movie itself has held up rather well."
    },
    {
      "rating": "9",
      "text": "Groundbreaking for its visuals first and foremost, TRON blends classic fantasy with (for the time) new-school tech to create an awe-inspiring science fiction film with a fun action-packed ride and a lovely synth score by Wendy Carlos."
    }
  ],
  "recommendations": [
    "oblivion",
    "tron_legacy",
    "the_three_musketeers",
    "valerian_and_the_city_of_a_thousand_planets",
    "the_fifth_element",
    "the_terminator",
    "jupiter_ascending",
    "oz_the_great_and_powerful",
    "moon",
    "clash_of_the_titans",
    "the_adventures_of_tintin",
    "doctor_strange",
    "9",
    "blade_runner_2049",
    "avengers_age_of_ultron",
    "upgrade",
    "alita_battle_angel",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "blade_of_the_47_ronin",
    "gemini_man",
    "the_last_witch_hunter",
    "pan",
    "the_fly",
    "aquaman",
    "the_harder_they_fall"
  ]
}