{
  "id": 794,
  "title": "Tropic Thunder",
  "starring": [
    "Ben Stiller",
    "Jack Black"
  ],
  "runtime": 107,
  "genre": [
    "Action",
    "Comedy",
    "Adventure",
    "War"
  ],
  "description": "Ben Stiller, Jack Black and Robert Downey Jr. lead an ensemble cast in 'Tropic Thunder,' an action comedy about a group of self-absorbed actors who set out to make the most expensive war film. After ballooning costs force the studio to cancel the movie, the frustrated director refuses to stop shooting, leading his cast into the jungles of Southeast Asia, where they encounter real bad guys.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zAurB9mNxfYRoVrVjAJJwGV3sPg.jpg",
  "categories": {
    "plot": 3.0,
    "acting": 5.25,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.051282051282051,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Hilarious! One of  the funniest films ever for sure.  Cool concept and with an all-star cast of Ben stiller, Jack Black, and more. Will be in my top ten and classified as a classic in my mind for a long time."
    },
    {
      "rating": "10",
      "text": "Instant classic."
    },
    {
      "rating": "6",
      "text": "Downey Jr. is a 10, everything else is hit and miss. Stiller still goes off on weird dope induced tangents that take from the \"tightness\" of the movie--overly silly but not really funny all the time. There are some funny parts, but no way is this movie \"classic\" or a \"10\". A year after the DVD comes out you'll barely remember this except for Tom Cruise's creepy character and Downey's funny linesperformance."
    },
    {
      "rating": "7",
      "text": "It was funny at times but really stupid as others. The cast was solid but Jack Black was not fit for this film at all and was pretty terrible through out. Also it felt a little too dragged on imo. Tom Cruise was excellent in it though and made the film worth watching for his part alone."
    },
    {
      "rating": "7",
      "text": "If you exaggerate the meaning, \"Tropic Thunder\" is a excellent movie with **** good humor. If you look at me eye to eye for my honest opinion, its just a unpredictable movie that has its laughs."
    },
    {
      "rating": "10",
      "text": "Best Film of the year. How did this not win best picture. Comedies deserve more credit. This movie was incredibly intelligent. It is sad that some are not intelligent enough to realize this."
    },
    {
      "rating": "9",
      "text": "acting was superb.  funny as ****   this movie was so funny.   it had me crying in the movie theaters.   Robert downey jr and tom cruise were too funny.   this movie was just funny.  i love it.   it was great.  9 out of 10.  near perfect."
    },
    {
      "rating": "5",
      "text": "A 7? Am I missing something? I know the movie is good .. but it is a bit boring .."
    },
    {
      "rating": "2",
      "text": "gross, offensive, barely a chuckle."
    },
    {
      "rating": "2",
      "text": "I thought this movies was ridiculing those with physical and mental disability i.e 'retard'( i quote form the film). Also there was child abuse involved (throwing the chinese child off the bridge), i thought this was not needed. last of all i thought the film was being homophbic, so what if he's gay, there was no need for the characters to make him uncomfortable about it."
    },
    {
      "rating": "5",
      "text": "This movie was not in the least bit as fnny as it is made out to be. Seriously the only funny thing in the movie is Jack Black's character. That was hilarious. If someone thinks his movie is intelligent then they are insane. I really did not like the lame attempt at laugs, especially Robert Downy Jr.'s character and also Ben Stillers character was incredibly unfunny. Overall is if you want to see a dumb, mostly unfunny comedy then you should watch it, bu why waste your time."
    },
    {
      "rating": "1",
      "text": "The movie was long, with little meaningful plot, and an star studded cast whose talents were wasted on a no-brainer idiotic script. It was insulting that any producer would expect people to find the contrived \"jokes\" funny. A \"1\" for Tom Cruises cameo, because that was indeed worth a chuckle. But, there were little redeeming qualities about this movie and I left the theater feeling cheated."
    },
    {
      "rating": "0",
      "text": "Tropic Thunder was a cheap remake of Galaxy Quest. All they did was go from space to the jungle. Next it will be some actors from Lost getting kidnapped onto a real island full of Gilligan girls and dinosauers and giant apes. If copyright laws were tighter Tropic Thunder would be another infringement case. Goes to show that big shot Hollywood types are not so talented after all."
    },
    {
      "rating": "0",
      "text": "For me, this movie is beyond bad. Granted, I'm don't usually tune in to this kind of weak comedy so I think I saw through it pretty much when steve coogan had that stupid look on his face he now considers his acting masterclass (can you believe this guy used to do 'the day today?!?). I'm just amazed that some of you are giving it 8,9 & 10's. No offense, but some of you saying it was laugh out loud funny for 90 minutes really need to get out more. Film Critic Richard Corliss summed it up perfectly for me with \"The brain gets the joke; the ribs are untickled\""
    },
    {
      "rating": "3",
      "text": "Very bland, boring, and unfunny in long stretches of the film."
    },
    {
      "rating": "4",
      "text": "This was not a good movie. I feel dumber for having seen this."
    },
    {
      "rating": "3",
      "text": "The previews are expertly edited to show the few funny parts in the movie while hinting that this is just a taste of what will be an equally funny movie...this movie is actually boring and tired. Downey's character is the funniest but he has few good lines. A huge disappointment."
    },
    {
      "rating": "0",
      "text": "i wouldn't say 0, I would say 5, but I'm just averaging out the reviews. The movie isn't very good. It's funny, but it's pointless, repulsive and stupid. It' s dumb, dull, and boring. I guess its okay."
    },
    {
      "rating": "0",
      "text": "Absolutely horrible. The constant use of the f word and crude remarks dealing with sexual acts on a man made me walk out during the movie. I was embarrassed to be in the theater. What bothered me most is that there were 6-7 year old kids sitting there watching this garbage."
    },
    {
      "rating": "3",
      "text": "Wow this movie was ridiculously bad, maybe the cut some funny scenes as someone had mentioned earlier, but even then a few scenes couldn't save this movie. The cast was amazing i was really excited to have so many funny people in one movie but they didn't pull it off, Jack Black did ok but Downey and the rest could have taken a much better role and made this 10 year in development film worth while. Most people probably already saw it but i highly recommend you save your maybe anyway."
    },
    {
      "rating": "0",
      "text": "What a bore. The trailer is funny. But this movie isn't. It's repetitive and stupid. I Hate It!"
    },
    {
      "rating": "3",
      "text": "First 10 minutes are funny. The remainder is boring. I had to watch this twice. I fell asleep the first time."
    },
    {
      "rating": "0",
      "text": "The imitation trailer idea was stolen from Tarantino's 'Grindhouse' and they were all stupid anyway. Stiller jus threw down a bunch of jokes for 14 yr olds and retreaded criticsm of the filmaking industry with a parody of the business and Vietnam war movies while he was at it. The product is shallow characters stumbling through an incomprehensible plot distracted by a lot of gasoline explosions making you wonder what the hell is the point. Anyway Stiller gets to fan his vanity and show us he's been working out."
    },
    {
      "rating": "5",
      "text": "I had high expectations, with such high scoring from critics (and raves from my friends, but high schoolers aren't the most trustworthy with films). I never thought it could be good. This movie was a giant let down. It wasn't bad per se, but it could never lived up to the high 71 average. I usually agree with the critics (my favorite films this year all have Metascores that are favorable or UA: 82, 85, 93, 63, 79), but they let me down with this stupidity. I laughed a few times, at the opening commercials, at... it's hard to think of much else. Just don't get excited about this movie, it' nothing special in the least. Entertaining and moderately amusing, but there are much better films to watch or even rewatch (Holy Grail for the hundredth time anyone?) over this."
    },
    {
      "rating": "3",
      "text": "Ok I came into this movie expecting to be crying from laughter, and if anything i was crying because i just wasted 8 bucks. the jokes werent funny, i was forcing myself to laugh the whole time so i could keep myself from falling asleep. i think there was maybe one funny part but for the most part, i kept thinking\"so when is this movie going to get funny like everyone said it was?\" i didnt think tom cruise was funny. he grossed me out, it completely tarnished the little respect i have left for him after the whole katie holmes faze. tom used to be my favorite actor, now he is a joke. i do love ben stiller though, he was the only good part of this film. but overall... huge disappointment."
    },
    {
      "rating": "3",
      "text": "You see the only funny moments in the trailer....a complete waste of time and some talent."
    },
    {
      "rating": "7",
      "text": "When it rarely made me laugh, it made me laugh hard. Everything in this movie, the acting, writing, Special FX, and comedy are all varying wildly in quality. In spite of that I would think this movie was deserving of an 8 just barely falling short of a 9.\r I had to take a point off for the complete lack of women in this movie, and the fact that the casting was so blatantly sexist I have to take a point off for. This movie has only one actress in it, Yvette Nicole Brown, a great comedic actor in her own right if only she was allowed to shine. So many female comedians could have added to this project, and it's a shame that wasn't allowed to happen. No movie can be allowed to get away with that, not even one as good as this."
    },
    {
      "rating": "0",
      "text": "Most unfunny slap-stick piece of junk I've EVER seen in my life. It's pretty sad that the only funny part in this movie is Ben Stiller acting as a retarded kid for mercenaries in a play. yeah."
    },
    {
      "rating": "8",
      "text": "This film is seriously hilarious, i was laughing almost at every scene, the bonus of this film is you get to see Tom Cruise dancing for at least five minutes, his dance moves is just unbelievably funny!!"
    },
    {
      "rating": "10",
      "text": "Lonn C said ZERO because to bruing the average down which defeats the whole purpose of a group average. So I am voting 10 to push Lonn's 0 to 5 which is the score that would have been given. Come on people, do your review based on your opinion, ignore other comments and the group average. The idea is everyone gives their honest and as unbiased as possible opinion and then the group average reflects the users opinions. Giving a much lower score because the current average score does not reflect your opinion is just turning the average score into your opinion which makes it worthless."
    },
    {
      "rating": "9",
      "text": "I just saw an advance screening and must say this movie was awesome. Much more than what I expected."
    },
    {
      "rating": "9",
      "text": "Hilarious movie all around. Robert Downey Jr is absolutely fantastic, and the rest of the cast does a great job as well. This isn't comedy of the summer (Pineapple Express will be hard to surpass), but it's still really good."
    },
    {
      "rating": "2",
      "text": "Terrible movie don't understand all the great reviews the beginning is the only funny part. After that it is just the same jokes over and over, do yourself a favor save $10 and wait for DVD even then pretty weak movie."
    },
    {
      "rating": "5",
      "text": "Funny here and there, I suppose if you like on the nose humor this is your movie."
    },
    {
      "rating": "2",
      "text": "Worst movie I've seen since Date Movie, which was the worst I've ever seen. I get that the movie pokes fun at Hollywood (itself), and that's worth something. But, it isn't nearly enough. This movie just wasn't funny. Tom Cruise was the best part of the whole movie."
    },
    {
      "rating": "10",
      "text": "With apologies to WALL-E and The Dark Knight, this is the best movie of the summer. It works because it's a send-up of Hollywood, not of war movies in general. Like Paul P. said, it had great comedy without going too over the top. Robert Downey Jr. is absolutely amazing, and would be the best thing in the movie were it not for the presence of a big name actor who I won't reveal here (although any movie fan has probably heard about his presence)."
    },
    {
      "rating": "9",
      "text": "This movie was hilarious and smart."
    },
    {
      "rating": "9",
      "text": "I can see why some people didn't like this movie. There were so many obscure hilarious references to movies like apocalypse now and such. You fellas should get out more."
    },
    {
      "rating": "8",
      "text": "This movie is not a 10 or a 9, but I think it's quite good, and worth watching it!"
    },
    {
      "rating": "10",
      "text": "Hilarious and cutting. From the opening psuedo trailers to the closing Tom Cruise dance, this moving poked fun at all those Vietnam films and at the film industry. Two thumbs up."
    },
    {
      "rating": "4",
      "text": "Just not quite funny enough? Lots of the Jokes fall flat but you're left amazed by the amount of money spent on them?"
    },
    {
      "rating": "7",
      "text": "To go \"full-on retard\" or not to go \"full-on retard\", that is the question. Perhaps if I were the parent of a Down's syndrome child I could more easily embrace the objections of those who are, in some cases, understandably offended by the dialogues that occur late in Ben Stiller's take-no-prisoners film industry satire between actors debating whether to use restaint in portraying mentally challenged characters, as Tom Hanks did in Forrest Gump, or to go way over the top like Sean Penn in I Am Sam, and the box office and Academy Award rewards and penalties that potentially go with either approach. Although I can sympathize (if not empathize) with said critics, I think some of them may be too emotionally close to the subject to understand that Tropic Thunder's principals are figures of ridicule and NOT ROLE MODELS--after all, nobody objected when the Nazis in Schindler's List spewed anti-Semitism, did they? Besides, Kirk Lazarus's (Robert Downey Jr., enjoying a movie year that some actors would sell less-loved siblings to have) and Tugg Speedman's (Stiller) observations are dead-on--if anything they don't go far enough. This movie doesn't mention the worst example of all: Cliff Robertson's horrible overacting in 1968's Charly, which netted him an Oscar for a role that he ruthlessly engineered for himself while demolishing Daniel Keyes' fine novel in the process. Tropic Thunder also neglects to discuss how many Little Golden Guys inevitably go to performers who (pardon the expression in advance) go \"full-on gimp\", portraying PHYSICALLY challenged folks (Jane Wyman, Daniel Day-Lewis, Hanks in Philadelphia, etc., etc. It could be said--though not by me--that the only actor to honestly come upon an Oscar this way was Marlee Matlin.) Clearly, the actors and crew of a Vietnam movie-within-a-movie who fall down a real-life rabbit hole that Lewis Carroll never dreamed of think that Konstantin (\"Love art in yourself, not yourself in art\") Stanislavski was a long-deposed Balkan government official; Stiller and cowriter Justin Theroux are ruthless in depicting them, and the result is a movie whose box office success, like that of 2006's Borat, happily disproves the old saw that satire is what closes on Saturday night. Unfortunately, as with Borat, much of Tropic Thunder is funnier on paper than actually on screen (and it never manages to top the magnificent parodies seen in the first five minutes, which among other things should prove beyond all remaining doubt that hacks-from-hell Aaron Seltzer and Jason Friedburg should be shot into outer space). But even though Tropic Thunder is stuffed with insider jokes that will confuse if not outright bore casual moviegoers, it's difficult not to admire its utter mercilessness and lack of sentimentality in depicting EVERYONE in the profession as greedier and more heartless and self-centered than those in Wall Street and Washington combined. (Sadly, this hasn't changed much over the years; if you want proof, read Joseph McBride's disturbing John Ford and Frank Capra biographies. Nor will it: while AMC's brilliant TV series Mad Men delights in exposing the difference between early 1960s Madison Avenue culture and today's--puff, puff--TRopic Thunder could easily be remade 48 years later with very few changes.) But you gotta admire the resourcefulness, caginess and intelligence of A Certain Superstar whose recent couch-jumping antics, overespousal of religious beliefs and willingness to star in Robert Redford's boring Iraq preachathon have subjected him to hard times: his astonishing comeback cameo as a studio slimeball who maybe has taken a sequence in Risky Business a bit too much to heart has, at least for now, restored for Mr. Cruise the mantle of One Of The Smartest Guys In Hollywood."
    },
    {
      "rating": "9",
      "text": "This was a great Action Comedy. It really mixed the production value and effects of a great Vietnam movie with edgy comedy that we don't see very much these days. The actors play the comedy straight, but not in an over the top silly matter that we are used to seeing in other send up movies. There is plenty of movie references throughout, but unlike most parody movies, the viewer can enjoy this movie on it's own merit and without seeing any of the referenced films. I would have to say that this movie really broke new ground in combining comedy and action and I don't think I have ever seen a movie like it; and that's hard to find in today's cinema."
    },
    {
      "rating": "10",
      "text": "I'll give it a 10 just to balance that last gus 0 - can't wait to seet it! Ben Stiller rocks!!!"
    },
    {
      "rating": "9",
      "text": "This will become a comedy classic on the same high level that Stiller's other major directorial outing - Zoolander - currently sits at. Robert Downey Jr. in the role of a lifetime and Tom Cruise in the life-saving role of a lifetime are the highlights, but everything about this movie, from the minutes before it even begins to the credits after it ends, is pure genius. my only very minor quibble is that they provided no closure to the Jay Burachel storyline...I was kinda hoping to see him become a big Hollywood star in the end or something, because he was the only down-to-earth person in the entire movie. :P"
    },
    {
      "rating": "4",
      "text": "Pushed by all the hype I went and Tropic Thunder today. The verdict: extremely over rated. There were a few clever parts and some amusing gags here and there, but mostly it was just silly and dumb. Afterwards I wished I'd gone to see Woody Allen's new movie a man who's humor is a little more developed than fart and \"retard\" jokes."
    },
    {
      "rating": "5",
      "text": "Nice Schmoolie G.....Nice. I didn't see this movie, and probably won't until it comes out for rental. But nice review either way Schmoolie."
    },
    {
      "rating": "9",
      "text": "One of the funniest comedies I have seen recently"
    },
    {
      "rating": "10",
      "text": "I have never laughed harder during a film. I consider it a perfect movie because it did exactly what it set out to do."
    },
    {
      "rating": "0",
      "text": "Ashley and Laura D. I just wonder wher is the joke? worst movie I've ever seen."
    }
  ],
  "recommendations": [
    "norbit",
    "this_is_the_end",
    "one_year_one_night",
    "dinner_for_schmucks",
    "the_dictator",
    "grown_ups",
    "the_ridiculous_6",
    "anchorman_2_the_legend_continues",
    "zack_and_miri_make_a_porno",
    "30_minutes_or_less",
    "movie_43",
    "little_fockers",
    "the_watch",
    "thunder_force",
    "couples_retreat",
    "zoolander_2",
    "a_million_ways_to_die_in_the_west",
    "identity_thief",
    "zoolander",
    "hot_tub_time_machine",
    "hubie_halloween",
    "the_hangover",
    "dumb_and_dumber_to",
    "the_wedding_ringer",
    "wild_hogs"
  ]
}