{
  "id": 1857,
  "title": "Trouble with the Curve",
  "starring": [
    "Clint Eastwood",
    "Amy Adams"
  ],
  "runtime": 111,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "Slowed by age and failing eyesight, crack baseball scout Gus Lobel takes his grown daughter along as he checks out the final prospect of his career. Along the way, the two renew their bond, and she catches the eye of a young player-turned-scout.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zLZQVmxOj5kICbS5Pq7rB1cbPvP.jpg",
  "categories": {
    "plot": 6.428571428571429,
    "acting": 6.393939393939394,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 4.333333333333333,
    "familyFriendly": 6.0,
    "funny": 5.2,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Below average fare.  In the hands of a better writer and director, this could have been quirkier and more fun, but it just plods along.  Clint doesn't pop, and Amy Adams is wasted."
    },
    {
      "rating": "3",
      "text": "We have been Clint fans since his spaghetti western and Rowdy Yates days. Sadly this movie is not worthy of him, or the other fine actors on it. The movie is little more than a series of drab cliches, strung together is a plodding and predictable manner. It limps, coughs , and stutters along, never getting off the ground; and finally ends with \"and everyone lived happily ever after\" that would embarrass the director  of a G (for gooey sweet) movie aimed at a six year old audience level. While Amy Adams, and John Goodman give sophisticated, nuanced, and strong performances, they only serve to show up how very bad the movie is. Justin Timberlake is egregiously miscast to play opposite Amy Adams, and he comes off as a high school drama club reject... when compared against Adam's exceptional performance. I am a long time fan of Clint Eastwood, and wish I could give at least a warm review to this film. However, as I and one other person were the only people sitting in a theater that could accommodate hundreds, this afternoon it is hard to miss the obvious. My advice: skip the popcorn, you'll have more than enough old chestnuts to chew on. Better yet, rent an old Clint Eastwood film, and enjoy him in his glory days."
    },
    {
      "rating": "2",
      "text": "Horrible movie.  I love baseball movies...but it is clear there were no baseball players on the production team.  Not sure how such an amazing cast could push out this garbage."
    },
    {
      "rating": "10",
      "text": "The best movie I've seen of Clint Eastwood."
    },
    {
      "rating": "8",
      "text": "Well made with many baseball references that went well over my head but that didn’t matter. The film isn’t about that, it’s about relationships and as such I found it an engaging watch. Both Clint Eastwood and Amy Adams were excellent in this; I admire them both as actors and they didn’t disappoint. Justin Timberlake gets better each time I see him, I just wish he’d stop making those awful records! (It’s a joke folks). Also worthy of note were Matthew Lillard as Phillip Sanderson, Robert Patrick as Vince and John Goodman as Pete Klein. It’s not a tear-jerker or a heart rending tale but I found it did strike an emotional chord with me. If, like me, you admire Eastwood and Adams then it’s well worth a look.\r SteelMonster’s verdict: RECOMMENDED\r My score: 8.1/10."
    },
    {
      "rating": "10",
      "text": "One of the best show we have seen.  Not sure how anyone could dislike another classic by Clint Eastwood.  Even since Grand Torino, not enough films tell a story and do so so well.    Strong acting, original story and even did not mind Timberlake."
    },
    {
      "rating": "7",
      "text": "Eastwood's performance was powerful ..............................................................................................................................................................................."
    },
    {
      "rating": "5",
      "text": "At one point in Trouble with the Curve, Clint Eastwood's gruff, aging baseball scout tells his daughter (Amy Adams) that he can't change.  It's the only honest moment in a film that is loaded with crowd pleasing resolutions that feel too contrived and an overly simplistic view that the old ways are the best.  None of which would have mattered if the plot was a little more focused or the cast had managed to muster any genuine emotions.  It's the baseball equivalent of a lazy fly ball to center field."
    },
    {
      "rating": "5",
      "text": "I'm a fan of Clint Eastwood, Amy Adams and baseball so I decided to give this movie a shot.  The story was extremely formulaic and predictable, but the actors give a solid performance.  Clint basically plays the same curmudgeon he was in \"Gran Torino\".  The way he treats his daughter is borderline cruel and not believable.  Justin Timberlake is also not believable as an athlete and occasionally his \"rap accent\" is noticeable.  I know he's not a rapper but still he talks like one.  This is the first movie I've seen him in and his acting was passable, but I just didn't believe him as being an ex big league pitcher.  He's too small.  The ending was all tied up neatly in a pretty Hollywood bow.  Every problem was resolved.  Not quite original enough for me to recommend."
    },
    {
      "rating": "7",
      "text": "Okay, lol. Literraly ever single loose end wrapped up perfectly 100% positive in the last 20 minutes of the movie. I actually started laughing out loud at this towards the end and my girlfriend though I was crazy. That single-handedly puts this in the 'family movie category'. Still, watch it with your gf and it's great- you get baseball references and she gets the family stuff."
    },
    {
      "rating": "3",
      "text": "This film pales in comparison to other baseball flicks that have hit the big screen. Being able to determine a prospect's worth by the sound of his bat is silly. Their are so many goofs and cliches. The ending will leave many scratching their head. It tries to be feel good but comes off awkward and silly."
    },
    {
      "rating": "6",
      "text": "While a lot of the movie may be very predictable, I feel that a lot of praise should be given to the actors. Clint Eastwood, Amy Adams, and Justin Timberlake make things really interesting."
    },
    {
      "rating": "5",
      "text": "I do agree that Clint Eastwood is a legend. But Trouble with the Curve doesn't really stray from his usual 'formula' (i.e. grumpy Clint facing a situation that changes his life, etc) It has a strong supporting cast, but it is cliche drama at best. If you are a fan of his, you will enjoy this. Others will simply be bored."
    },
    {
      "rating": "8",
      "text": "Coming from a civilised country which doesn't have baseball as a major sport, (and spells \"civilised\" correctly), I can say that this film is easy on the eye. It's not brilliant but it tells the story well enough and after all, Clint Eastwood is still good to watch."
    },
    {
      "rating": "4",
      "text": "I think what ruined this film was the fact that the plot was so empty. There was no serious back story, No real dialogue between characters, It was just two hours of nothing. It's well acted, I give it that, and it's interesting but it has no depth."
    },
    {
      "rating": "8",
      "text": "Awesome movie, no more."
    },
    {
      "rating": "4",
      "text": "Trouble with the curve is a swing and miss. There were some funny lines throughout but the movie had the most predictable ending,  that you can see coming from a mile away. Nothing special."
    },
    {
      "rating": "5",
      "text": "This movie was pretty uninteresting. It seemed like Clint was mumbling half the time, and Timberake's acting was horrible. It was enjoyable to some degree, but that isn't saying much."
    },
    {
      "rating": "7",
      "text": "It's not a home run like Moneyball, but between the heart and chemistry that Eastwood and Adams share, as well as the obvious passion the filmmakers have for the game, you can't help but enjoy this movie. It's necessarily a great sports film, or even one I'll be quick to watch again, but it's nice to see Eastwood still has it."
    },
    {
      "rating": "10",
      "text": "I give this origional movie a 5 because it shows another side of Clint, not just another gunslinger but someone that can play a depth character. I had the chance to meet with Clint at his resort, Mission Ranch, talk with him and what he wanted to do in his comming years. I had a chance to hear from him what he thought about this project. I give this a total 10, Gary Thanks Clint"
    },
    {
      "rating": "5",
      "text": "Check out these two OLD-school Hollywood veterans and see if they have Trouble with the Curve? They have a fresh perspective and smart, funny take on all things-film.\rhttp://youtu.be/Wfau1CCKo9g"
    },
    {
      "rating": "6",
      "text": "I liked the performances of much of the cast.  The storyline seemed serviceable but very predictable.  Enjoyed the movie overall, but was not overly impressed."
    },
    {
      "rating": "7",
      "text": "Some of the baseball scenes lack in realism, but all in all a good movie.  Clint continues to give his Clint like performance, also Amy Adams and Justin Timberlake add some heart to the story."
    },
    {
      "rating": "10",
      "text": "The typical American drama movie, but still nice. Lovely, sweet and drama, that's made me cry. All over, one of the bests movies from 2012, that must win an OSCAR"
    },
    {
      "rating": "7",
      "text": "Possibly Eastwood's last movie, this could be a solid conclusion of his acting career.\r Trouble with the Curve is a good-at-best baseball drama with a star-studded cast and an interesting story. It succeeds for the most part, but a couple of flaws bring it down from what could've been an Oscar-nominated or -winning drama with Eastwood as its front man.\r The flaws include:  A clunky script and illogical moments.  Clint Eastwood's character almost never redeeming himself.  Repetitive, annoying fights between Adams and Eastwood's characters. and some more.\r Ill say the positives first. The cinematography and shots I this film were up to par: never going beyond, but never going backwards either. The acting was good, setting the standards for a movie of this caliber. The cast had a lot of Hollywood greats such as Clint Eastwood, Amy Adams, John Goodman, and Justin Timberlake. I liked Timberlake the most, the only male character in the film to actually have the where-with-all and be completely sane. ;-)\r That being said, the film lacked many good qualities. The script was clunky and never seemed to fit in at the right moments. Of course, Eastwood had his one liners (\"What are you fellas staring at, I'm not a pole dancer.\"). But there was just constant fighting, and repetitive lines of dialogue between Eastwood and Adams. He would grunt, she would yell at him for not being there for her as a child, blah blah blah. The first time was acceptable, but then it just got plain tedious. And after about a minute of talking to him, she would storm out of the room, and then they would be shown together the next scene like everything was fine and dandy. There was never any redemption of Clint Eastwood's character until the very end, as if the first 45 minutes of the movie were a waste. And Justin Timberlake's character was very good; the guy can act! And even though he was a relief for the whole movie, he didn't get enough screen time to outdo the mess that Eastwood and Adams made throughout the movie.\r Even though it seems like I had a million things to complain about, I still recommend this movie. Why? Because, flaws aside, it meshes together baseball, Clint Eastwood, a good cast, and enough family drama to compete with the Kardashians."
    },
    {
      "rating": "10",
      "text": "Little known Amy Adams whose roles include “The Muppet's” and “The Master” delivers an inspiring role as Mickey in this Clint Eastwood directed classic. I find Amy’s performance as Mickey aspiring as a young woman seeking to balance her life as a lawyer at an Atlanta law firm and spending time with her estranged baseball scout dad “Gus”. Played by Client Eastwood, “Gus” is an aging baseball scout who uses his natural ability to watch, listen, and read a players talent by instinct, not any digital aged devices.\rMickey joins her dad, whose relationship is divided by career paths, to scout the Atlanta Braves next #1 draft pick. Like myself, Amy’s character is a huge baseball fan with knowledge of the game and its history, but since her childhood trauma, Gus had left her with an uncle when she was a young child. It is this time that Mickey’s spends with her dad I find invaluable, but her career begins to suffer as she spends the time with her dad. These strong traits she exhibits are motivating, as one who grows up without her parents to one who is willing to give of herself and work with the stresses from her law firm, are traits to draw inspiration from.\rThis movie has all the ebb and flows of a true to life movie that we as movie goers lose out on in the age of comic book and robotic hero movies.  This movie represents what a strong 10 rating should be, with strong performances by some new and older actors."
    },
    {
      "rating": "4",
      "text": "I can normally watch, basically, any Eastwood movie; both directing, starring, or otherwise involved. But this movie....just...lacks...an identity. It feels ill-formed, the characters merely just reciting lines; and with Eastwood mysteriously losing his sight early in the movie, contrived. If you love Baseball and Eastwood, perhaps this is your movie. For me, I don't care for the Baseball, so it was not worth it."
    },
    {
      "rating": "7",
      "text": "Trouble with the Curve has just the right mix of baseball knowledge, romance, and comedy. As a baseball lover, I was thoroughly impressed with the amount of baseball history that was incorporated into the story line. Trouble with the Curve is an easy watch and triggers enough of an emotional response to want to see a happy ending."
    },
    {
      "rating": "1",
      "text": "Papy Clint nous sert une comédie psychodramatique qu'il n'a pas réalisée mais qu'il aurait pu réaliser tant on reconnaît son style ici, épuré et classique bien qu'un peu plat. Il reprend son rôle de vieux bougon râleur (cf Gran Torino et al.) et de sa relation compliquée avec sa fille unique, avocate surmenée et \"working girl\" au taquet.Cette relation plus ou moins conflictuelle est assez distrayante malgré son côté un brin forcé et outré mais ceci explique cela sans doute. Cette \"Nouvelle Chance\" se déroule dans le milieu du base-ball, car Papy est recruteur à l'extrême bord de la retraite qu'il ne veut pas prendre : d'ailleurs il a l'air d'avoir 90 ans et lorsque sa fille dit en avoir 33 alors qu'elle en paraît 40, on se dit qu'il y a un sérieux problème comptable. A moins qu'il ne l'ait faite au bord de sa pré-retraite bien sûr...Le base-ball, en tout cas, on s'en cogne comme de l'an 40, ce qui ne plaide naturellement pas en faveur du film, lequel commet un autre impair, plus sévère celui-ci, en la présence de la quiche Timberlake : le petit connard couineur fait en effet l'acteur à ses heures perdues pour le plus grand malheur des spectateurs. Aussi, sa présence remarquée ici est-elle particulièrement désagréable et affligeante.Cela n'est que le cadet des soucis de ce petit film léger mais très lourd au visionnage : il est lent, il se perd en longueurs et il est globalement et incroyablement nunuche. Papy peut faire sourire mais son numéro est usé jusqu'à la corde ; Amy Adams est une jolie milf bientôt cougar qui devrait se couper les cheveux : on dirait une putain de pub L'Oréal.Pas de chance donc avec ce film balourd, gnangnan et abrutissant qui m'a rendu presque aussi aigri que Clint."
    },
    {
      "rating": "9",
      "text": "I have seen this movie three times: first in a theater and twice on DVD.  I have enjoyed it immensely each time.  Clint Eastwood and Amy Adams bring to the screen excellent acting chops, which make a somewhat formulaic plot about a reconciliation between an emotionally distant aging father and his emotionally vulnerable young adult daughter engaging and entertaining.  I do not know enough about the intricacies of baseball scouting to be able to assess how realistically the film portrayed the environment in which professional baseball teams search for and evaluate new talent, but I enjoyed the story line a great deal.  The professional movie critics seemed to acknowledge the film's many positive qualities while giving it mediocre ratings, which suggests to me that the critics may be grinding their political axes against Obama critic Eastwood rather than providing an objective assessment of the movie."
    },
    {
      "rating": "3",
      "text": "the title and the last act..Trouble With The CurveTrouble With The Curve is a plot driven sport drama about a bonding between a father and daughter that is resolved through their mutual interest. The structure is familiar, the conversations are cheesy, the writing is sloppy and the execution is daft. Ticking for almost two hours, their barely resides a fifteen minutes of craft worth to explore onto. Not a single thread of the feature allows the audience to root for the characters and even though the stakes gets higher, the tale never lives up to its repercussions that it ought to breed. The chemistry between Adams and Eastwood is uncomfortably itchy whilst hers with Timberlake is flat out annoying. And the primary reason to that would be writing that isn't polished or edited or bred appropriately for it to either respect the sincerity or the crisp of it. Addition to that, the knack for imputing humor forcibly, shucks away the earned integrity and undermines the momentum. The characters are undercooked and walks on benignly projected track that develops on unstable writing material. It falls flatly on technical aspects like background score, editing, cinematography and sound department. The camera work too is imaturely handled with no whatsoever courtesy to at least try to convince the audience. Brown's writing is questionable whilst Lorenz's execution is redundant at points where his conventional bubble bursts before it is even in existent. Adams and Eastwood may try hard but there isn't room enough to chew in the character's perspective while Timberlake on the other hand is flat out one dimensional with Goodman's decent support. The title and the last act are the only high points of this feature. Trouble With The Curve is actually a trouble for the makers, viewers and the actors who all deserved better, a lot better."
    },
    {
      "rating": "7",
      "text": "Ok this is a cliched film - somewhat cheesy? sure. However, its an easy enough watch and it features decent main performances from both Amy Adams and Clint Eastwood and so I enjoyed it and felt it was a reasonably well made film overall. It does have a bit of a feel of a daytime TV (i.e. made for TV) film (cast aside perhaps) but I felt it had good intentions. I was surprised to see Justin Timberlake in a lesser role - I know he's been in a few films (Edison Force I think was one?) but I don't generally expect to see him crop up in films these days. The sorts of films he appears in do tend to be a little 'ok-ish to good at best' sort of thing, if I remember right. I liked this film as there were some amusing moments present, its not all depressing (regarding the main characters fading faculties, shall I say (thats hardly a spoiler, the main story is clearly about an aging sports talent spotter), its faintly amusing too, which is nice - I thought both Adams and Eastwood got on well on screen and so I'd recommend this film. I wouldn't say you absolutely have to be keen on baseball/sports to enjoy the film either, I'm not particularly a fan but I like Clint Eastwood films and I enjoyed this film regardless, so thats always a plus. Its not exactly a big glitzy, exciting film but it has a surprisingly genuine feel to it, so while its not greatly memorable, for what it is, its a good film, hence my (7 out of 10) rating. Good stuff."
    },
    {
      "rating": "7",
      "text": "I enjoyed 'Trouble with the Curve'.There are a few too many moments of cringe for my liking, renditions of 'You Are My Sunshine' included, but as a whole it's a solidly entertaining sports flick - with added love drama.The cast are the film's major plus, with Clint Eastwood - in his first strictly acting role since the early 1990s and last to date of review - and Amy Adams naturally sticking out most. Other cast members include Justin Timberlake, Matthew Lillard, John Goodman and Scott Eastwood - the latter shares a scene with his father, which is nice.A few different choices by the filmmakers and I'd be rating this a tad higher, but as is it's a good film - one that is worth a watch."
    }
  ],
  "recommendations": [
    "american_hustle",
    "true_grit",
    "lawless",
    "legend",
    "moneyball",
    "daredevil",
    "cry_macho",
    "inside_man",
    "the_fighter",
    "mystic_river",
    "burnt",
    "black_mass",
    "changeling",
    "spenser_confidential",
    "alex_cross",
    "lucky_number_slevin",
    "crazy_heart",
    "eddie_the_eagle",
    "the_dilemma",
    "the_town",
    "logan_lucky",
    "silver_linings_playbook",
    "rush",
    "uncut_gems",
    "gran_torino"
  ]
}