{
  "id": 1148,
  "title": "Troy",
  "starring": [
    "Brad Pitt",
    "Orlando Bloom"
  ],
  "runtime": 163,
  "genre": [
    "Adventure",
    "History",
    "War",
    "Action"
  ],
  "description": "In year 1250 B.C. during the late Bronze age, two emerging nations begin to clash. Paris, the Trojan prince, convinces Helen, Queen of Sparta, to leave her husband Menelaus, and sail with him back to Troy. After Menelaus finds out that his wife was taken by the Trojans, he asks his brother Agamemnom to help him get her back. Agamemnon sees this as an opportunity for power. So they set off with 1,000 ships holding 50,000 Greeks to Troy. With the help of Achilles, the Greeks are able to fight the never before defeated Trojans.",
  "releaseYear": "2004",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/a07wLy4ONfpsjnBqMwhlWTJTcm.jpg",
  "categories": {
    "plot": 7.294117647058823,
    "acting": 7.461538461538462,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.26086956521739
  },
  "reviews": [
    {
      "rating": "10",
      "text": "So Achilles wanted his name to be remembered , but no Brad Pitt with is sensational acting and dialogue delivery made a new face in the history books as a demi-god,a hero in true sense.\r The movie is fun to watch with all the actors playing their respective characters beautifully. Eric Bana ,Diane Kruger,Sean Bean,Brian Cox,Brendan Gleeson did great jobs.\r The direction ,cinematography,and specially the score is brilliant for a 2004 movie exciting,fast-paced,\rEpic."
    },
    {
      "rating": "9",
      "text": "Great movie. Last 30 minutes was the best part of the movie, though it was really thrilling from the start. Recommend it. Brad Pitt was also really good in this."
    },
    {
      "rating": "9",
      "text": "I like epic historical movies and you can see the big budget here in every scenes: There are a lot of impressive clothes, buildings and visual effects. Also the actors were great, no only Brad Pitt. In addition I liked, that no one was good or bad, every character and Greek and Troja had some bad sides.Just some of the scenes of the movie were a bit too long."
    },
    {
      "rating": "8",
      "text": "Great movie!The last act was too powerful made me emotional no matter whats the destiny of troy at the end he was remembered!screenplay was good why not its came from david benioff!score was good acting was great!overall a amazing movie!"
    },
    {
      "rating": "9",
      "text": "zxcvbnmmklkjhjlkhfsasdfhuiopouteeqegibiguguftstfugihhhjo⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "10",
      "text": "A+ *************************************************************************"
    },
    {
      "rating": "9",
      "text": "kbfygfyugihugughihoongjihufftfyuggujgfswrwqaszxvbnmlkjgddvnjioojihgjguguhivygufttufhyjvuhuguhufjftseytutigighigi"
    },
    {
      "rating": "9",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡********************************************************"
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$%&%&%&%&%&%&%&%&%&%&%&"
    },
    {
      "rating": "10",
      "text": "The only movie about Troy war that's actually realistic. No gods, no super powers, no **** Great movie, with depth and super-realistic CGI. Can't really find anything negative about this film except that it could be a bit longer. Enjoyed pretty much every minute of it.\r Critics are in their own bubble, they look at movies from the directors perspective and that's why they're always wrong. Movies are nod made for directors but for the world.\r Straight 10"
    },
    {
      "rating": "9",
      "text": "A stunningly gripping study of ancient Greece that is well paced and has the right amounts of every characteristic required by this genre's law."
    },
    {
      "rating": "10",
      "text": "i think troy is such an excellent movie.it is maybe not perfect but come think of it, its inperpection makes it perpect.so far besides gladiator and odyssey ,this troy has made me cry.i think they should watch it.it is realy good.it exceeded my expectations. if they have read iliad they'll realy apreaciate this movie. it even will widen ur knowledge. for me it seems that the great written by homer comes to life."
    },
    {
      "rating": "10",
      "text": "These critics are all idiots! If you don't want to see an action packed movie, go somewhere and read a book. This film rocked! There was a lot of action and fight scenes...but it should have been more gory. This would be ideal for a extended collectors edition. Additional footage a must. Extend the beach battle,battle at Troys wall,battles while Troy was under seige,more Achillies fights,more Ajax fights,more Hector fights,and please more Oddyseus fights. Look at the gore of Braveheart and implement it into extended addition. It would be a movie to die for."
    },
    {
      "rating": "9",
      "text": "It is not just an insane war film. It has an emotional pull too. Just see the scene where O'Toole visits Pitt. Brilliant performances and good direction. Is just a tad bit too violent."
    },
    {
      "rating": "8",
      "text": "\"Troy\" is a terrific piece of entertainment.  When it opened, I'll admit, my companion and I went solely to heap derision and abuse on it but we walked out smiling.  It's pseudo-scholars, not scholars, who whine about deviations from Homer; scholars know that the Troy material has always been altered and adapted by artists, whether by ancient Greek dramatists, medieval poets, or modern historical novelists.  I actually found the film acceptably Homeric, treating the Iliad's main conflict (Agamemnon's insult to Achilles and the resulting disasters), as well as many of its themes, (honor and dishonor in war, e.g.) and strategies (compression, e.g.).  And the decision to take the gods out of the action was a good one; no filmmaker yet has managed to make them look anything but silly.  The biggest surprise in the film is Brad Pitt's Achilles, which I expected to deplore and actually rather liked.  He combines preternatural power and grace, pride, contempt and melancholy into a coherent whole, and, aside from wishing him genuinely berserk (not just p*ssed off) when he goes after Hector, I was impressed.  The film has a lot of smart casting, especially Peter O'Toole, whose dignified, suffering Priam makes the fall of Troy searing, Brian Cox, his greedy, unprincipled counterpart on the Greek side, and Orlando Bloom as Paris (though it was hard to watch Bloom shoot arrows at human, rather than elf, speed).  The only real weak spot is Diane Kruger's insipid Helen, but no actress has yet managed to convince as \"the face that launched a thousand ships,\" and, yes, I'm including Elizabeth Taylor.  They need an Aishwarya Rai: now there's a woman to start a war over.  I also grew weary of self-reflexive portent in the dialogue (\"They'll be talking about this war and the heroes who fought in it for thousands of years\").    But the film has many more strengths, including naval and battle choreography, sets, costumes, and the infamous Trojan Horse, which was perfect."
    },
    {
      "rating": "9",
      "text": "This is one of my all time favourite movies. The fight scenes are epic from start to end. Brad Pitt as Achilles is to date the best character he has ever played. At the beginning he kills this giant man with a dagger to the neck. And the beach scene is one of my favourite fight scenes ever. And his fight against Hector is one of the best fight scenes I have ever seen. All the actors in this movie did a great job. This story was good based on history and myth. This is just a awesome movie overall."
    },
    {
      "rating": "10",
      "text": "This movie strikes many of the right beats to create a classic. While there are some slightly cheesy moments, and I have been told it barely follows the poem it was based off of, the movie manages to create it's own enthralling narrative, and remains gripping from start to finish. This movie's use of music, special effects, and set peaces conveys this sense of scale which many films fail to produce, with all of this Hollywood spectacle however, this movie still has substance. Amidst it's immense run time, no scene is gratuitous, and most the viewer can understand and follow most characters personalities and motives pretty easily. But more importantly the movie raises several interesting moral questions, ranging from the meaning of war, to the importance of one's legacy. The only real issue I have with this movie are that sometimes Brad Pitt's performance is a little wooden, and many scenes which were supposed to be emotionally impactful, I found to be lacking in the sentimental value necessary to really get a reaction. Also, while the film's double narrative was generally well put together, it kind of snubbed certain main characters throughout the second act."
    },
    {
      "rating": "5",
      "text": "Seeing the Illiad recreated is quite enjoyable, but the movie just falls flat on as it doesn't transpire all the great qualities of the poem. It is just a lazy Hollywood movie that was made as a money machine for the producers."
    },
    {
      "rating": "10",
      "text": "This movie was awesome, I think archilles is the greatest heros of greece of all time; Brat Pitt didn't a excellent job, he looked amazing in this movie. The story was great. This movie was romance, action and hot guy all in one. This is my favorite of all times #1 if you vote 1-9 you don't know what are you talking about."
    },
    {
      "rating": "8",
      "text": "This movie has its share of flaws for sure : the ending is rushed, Achilles' love story is awkwardly done, Peter O'Toole looks like he's been poleaxed half the time and the actress who plays Andromache annoyed me mightily. But despite all that (and some other things that I didn't mention), the core story - Homer's story, altered as it is - is so strong, that it carries the movie effortlessly through all its considerable length. The plot is flowing, the characters are recognizable and actions have consequences - that, for me is the best achievement of this movie. That, and Brad Pitt - maybe I'm a little biased, because I had a crush on Achilles since I was 11, but i thought that Pitt was brilliant in the part. The vanity, the tenderness, the arrogance, the mood swings - it was all there for all to see. Poor doomed golden boy... sniff. All the others were adequate to good, with 2 aforementioned exceptions. Good movie, which for all its glamour, does provide a cirious meditations on human condition: actions have consequences. Men a wretched things. On every war, you kill your brothers, and it will never end."
    },
    {
      "rating": "9",
      "text": "Pitt was brilliant. He sold the movie for me. Achilles is bad a$$."
    },
    {
      "rating": "10",
      "text": "An excellent movie. Great cast, engaging plot and fantastic fight choreography. Above all, it's not just a hack-and-slash flick. There are actually some interesting themes and relationships explored here. The dynamic between Agamemnon and Achilles is particularly interesting. In the category of sword-and-sandal movies Troy is almost the equal of The Gladiator."
    },
    {
      "rating": "10",
      "text": "One of the best war movies of our time.The movie sets, costumes, dialogues, actors.Even if you have see LOTR, the action of both the movies are totally different.Highly recommended!"
    },
    {
      "rating": "7",
      "text": "A lot of people are foggy enough about the battle of Troy’s origins to confuse the story laid out in the “Iliad” with history. I’m sure you’ll hear more than one movie-goer comment on the film’s historical accuracy. Last night I heard at least two. But, like Hidalgo, The Passion, or maybe more like Harry Potter, Troy is another ambitious adaptation that only manages as solid entertainment. The idea of taking Homer’s battle poem and turning it into a movie is a good one, since it instantly leans towards the epic and contains plenty of notable and screen worthy characters. It’s also a story strongly ingrained in our cultural consciousness, after centuries of required classroom reading. It has already received some comparison to Gladiator, but where that movie was a surely modern fighting flick, the story of Troy lends itself much more to Hollywood’s golden age, the sort of thing that would have attracted a younger Chuck Heston. As Achilles, Brad Pitt is either naked or fighting. There’s no in between. Achilles is a guy who only wears clothes when he’s killing. I'm not sure what that says about his character. But don’t worry guys, it isn’t real Pitt nudity, just side-nudity. In fact, I don’t think I’ve ever seen so much side-nudity in any film. I now know every intimate inch of Brad Pitt’s naked profile. Troy lacks the courage to show full frontal or even a little bit of ass crack. Odd for any other R-rated movie, but not really for this one which only barelyshows enough carnage to warrant a rated R. It could easily have slipped by as PG-13 and one has to wonder why they bothered at all with an R when the removal of even a thimble-full of blood could have garnered them something lesser. If you’re going to go R, make it worthwhile. Don’t be afraid of women’s breasts. Don’t run away from realistic battle sequences. Hey, throw in a couple of decapitations! This is war, not West Side Story. What the film’s massive battle sequences sometimes lack in ugly realism is made only worse by Director Wolfgang Petersen’s strange propensity to focus in on one on one battles to the exclusion of all else. A hundred-thousand men clash on the field of battle, yet everything falls silent as soldiers form a big school-yard huddle whenever Hector picks up his sword. Should he dispatch a particularly difficult foe, he mutters “that’s enough” and all one-hundred thousand men just seem to wander home. Maybe I’ve been permanently spoiled by Peter Jackson’s groundbreaking siege in The Two Towers, but Troy’s bigger and supposedly badder battles just can’t compare. Troy fails to garner any excitement from its massive scale, but Petersen does have an amazing gift for filming one on one action. The final big battle between Achilles and Hector is engrossing and amazing. That’s due in no small part to both Pitt and Bana’s impressive performances, in which both brilliantly capture the physicality of their respective characters. Still, it is impossible to walk away from Troy completely unsatisfied. Despite some major directing flaws, Petersen does deliver an enjoyably huge (if a little too long) period adventure. Women will no doubt swoon at the legions of male characters clad in thigh revealing leather costumes. Men will go insane over Achilles kicking ass against anything and everything that moves. Troy is big, grandiose, and entertaining. With such a marvelous cast, I wish Petersen had delivered a masterpiece, but I’ll settle for some solid sandal-wearing fun."
    },
    {
      "rating": "8",
      "text": "This movie is really underrated in my opinion. It is a great movie with amazing effects, stunning fight scenes and a fantastic storyline. Lot's of this film is based on true events too. Any Gladiator lover will adore this film. The location and set is great, it is well played by the actors and the director done a great job. I really recommend this movie. A fantastic epic that you need to have on your shelf."
    },
    {
      "rating": "6",
      "text": "Troy features dazzling action, real life set pieces, and just powerful performances from Pitt, Kruger, Bloom and Bana; but sadly the film is completely emotionally dry and it most definitely suffers from that. I give this film 63%."
    },
    {
      "rating": "3",
      "text": "I remember getting free tickets for this film and I came out so disappointed. Its seems so full of itself and its done in a bad carry on Troying way. The death scenes seem to be hammed up and the eptiomy of how cheesy this film is when Brad Pitt says \"Take it, its yours\". I like epic war films, histroical war films. This is bloody awful, and I think it only made money because of the stature of certain actors. Gladiator and Braveheart are brilliant, this one is the complete opposite. The only reason it gets a 3 is because of some of the designs..and thats about it."
    },
    {
      "rating": "4",
      "text": "Iliad Lite. Just too much of a Hollywood feel. Lavish but pointless."
    },
    {
      "rating": "0",
      "text": "This movie is bad. I read the book and the real story is way better. Brad pitt is the worst actor."
    },
    {
      "rating": "5",
      "text": "This movie was just dull. Bad acting,bad story, and bad score. The only reedeming thing was the action but that is not even good enough to save this movie."
    },
    {
      "rating": "8",
      "text": "A fun, epic recreation of the culmination of Homer's Trojan war. It's not going to win too many people over with its imperfect execution with the moments between slashing swords but the action is good enough that you may not care at all."
    },
    {
      "rating": "6",
      "text": "Not that Blockbuster, that i expected. The directors Cut release is improved though."
    },
    {
      "rating": "5",
      "text": "This movie could have been way better, but sadly the makers of this film didn't do their homework on the great trojan war. The main problem i have with this movie is that it isn't accurate to the real events of the trojan war, almost everything got mixed up, and things weren't were they were supposed to be. For instance, Ajax never died in combat like in the movie, in real life Ajax committed suicide, another one is that Agamemnon never died in Troy, but instead he was murdered in Greece, and so on and so forth, this film is filled with more of these mistakes."
    },
    {
      "rating": "6",
      "text": "Pretty epic but pales in comparison to epics of the past. Pitt wasn't a great choice."
    },
    {
      "rating": "4",
      "text": "The entire movie to me was just waiting through the terrible dialogue just to get to the action scenes. Very disapointing. I expected better, Especially with a movie like this."
    },
    {
      "rating": "6",
      "text": "If you watch this movie with the understanding from the beginning that there are going to be no supernatural elements then this is a great film. When this first came out a few friends of mine were really upset that it didn't follow the Iliad very closely, because there was no gods and magic and living rivers or anything like that. I think it's fine to tell a version of the story without any magic to it. There's still interesting characters, and good fighting. If you like \"battle movies\" like Gladiator and Kingdom of Heaven, this is a movie you should see."
    },
    {
      "rating": "3",
      "text": "Extremely long, very boring and tried way too hard. The battle scenes weren't that great. Terrible acting to go around and a script that seem to be made by morons. Just like the Trojans were. Don't be fooled by the spectacle."
    },
    {
      "rating": "8",
      "text": "Some of the Greek mythological elements in \"Troy\" are inaccurate. Still, the visual scale of the film is amazing, as well as the performances by Brad Pitt, Eric Bana, and Orlando Bloom (just to name a few)."
    },
    {
      "rating": "3",
      "text": "The fight scenes were exciting, however, the movie was way too long for my liking. Brad Pitt in the role of Achilles kinda made my eyes cross.  Was it wrong for me to cheer on the killing of Patroclus?"
    },
    {
      "rating": "8",
      "text": "It is really a great movie.For a movie that was made in 2004 it should be considered to be an epic.But, The movie was stretched out a bit and the movie deviated a lot from the original story."
    },
    {
      "rating": "6",
      "text": "The legendary Achilles goes to battle with the Trojans in Wolfgang Petersen's interpretation of 'Troy', loosely based on the story of \"Ilaid\". Brad Pitt possesses the role of the legendary Achilles, who is often seen as the greatest warrior. It seems that he has had some quarrels with King Agamemnon (Brian Cox), the King often feels concerned over Achilles devil-may-care behavior, and his lack of respect for the king bothers himself. Meanwhile, we see two brothers, Prince Hector (Eric Bana) and his younger brother, Paris (Orlando Bloom) negotiating a peace treaty with Menelaus (Brendan Gleeson). But all that peace fades away when Paris is having a secret affair with Menelaus' wife, Helen (Diane Kruger). When Paris informs Hector about this, Hector feels angry and worried that a war is about to come... and that Menelaus will stop at nothing to make Paris suffer to get his wife back. Upon discovering his missing wife, Menelaus turns to his brother, Agamemnon for help. Agamemnon sees this as an opportunity to go to war, and must put all his trust in the talented Achilles to make sure that the war can be easily won. Back at Troy, King Priam (Peter O'Toole) feels concerned when Paris introduces him to Helen, worried that if he is to send her back, Paris would follow her and get killed. He reluctantly decides to let her stay and let events unfold however they can. While the production design of this movie is fascinating, the actors seem to fit the roles that they are cast in - Brad Pitt has the physique for Achilles, Orlando Bloom works as the heart-strung Paris, and Diane Kruger's beauty works for the beauty of Helen - and not forgetting the crafting of the action, it seems that the movie fails to deliver in terms of drama. There is no emotional uphold, no sign of intensity, and no urgency either. It all feels like a typical Hollywood take on one of the greatest legend stories of all time. It's lavish, it's beautiful and it's grand, but underneath all of that lies something somewhat bland. It's not a bad movie, just not a great one. Maybe if the actors were given a chance to act instead of appearing as attractive as possible, it would have worked, and maybe if the dialogue contained more plausibility, it would seem less unintentionally hilarious. Overall, 'Troy' is entertaining, but not gripping."
    },
    {
      "rating": "7",
      "text": "Even though this movie has been bashed a bit by critics in past and some parts of the story are a bit weird to me, plus feels weird to see Brad Pitt in this role and Orlando Bloom also a bit, but overall it is quite a fun movie. I did watch director's cut so maybe that's why it's like intended and better than original?!"
    },
    {
      "rating": "6",
      "text": "\" Troy \" was an acceptable movie , the good points are history, and the death of Achilles , and ultimately, the performance of Brad Pitt , the bad points are that the story felt something long and / or boring, and ultimately the music. but it was deserved 3 Oscar nominations."
    },
    {
      "rating": "5",
      "text": "Fun war movie about Troy and Sparta to watch, but it just gets boring after a while. There's like no excitement part, in my opinion, that comes up after a while of movie time."
    },
    {
      "rating": "6",
      "text": "No me parece que sea la gran cosa, está muy sobrevalorada, tiene sus grandes escenas y tal pero no quedó en mi memoria."
    },
    {
      "rating": "8",
      "text": "The action in Troy is great, but the scenes in between are boring.  The movie is a series of action scenes, then political talking, then another action scene, then more talking.  There are a few times where the acting is cringe-worthy, but overall, the story is interesting.  One mistake was making the war seem so short.  The Trojan War was over a period of 10 years, not a few days!  Lastly, Troy is a very good film with a twist at the end."
    },
    {
      "rating": "6",
      "text": "A great epic with a confused script.This film is an adaptation of Greek myths and legends surrounding the war between Greeks and Trojans. According to legend, Troy was besieged for ten years and only fell when the Greeks deceived them with a wooden horse. The film also tells the mith of Achilles. Directed by Wolfgang Petersen, this epic film has screenplay by David Beniof based on Homer's Iliad, and a good cast with the participation of Brad Pitt (as Achilles), Eric Bana (as Hector), Orlando Bloom (as Paris), Diane Kruger ( as Helen), Brian Cox (as Agamemnon, the Greek king), Brendan Gleeson (as Menelaus, the Spartan king) and Peter O'Toole (as Priam, the Trojan king).This type of epics, whether mythological or biblical, has an important feature: the whole script, scenery and costumes must be carefully written and planned because the audience knows the story beforehand and is waiting for something consistent with what she know. And this film managed to comply with this feature, although its too far from Homer at various moments. Visually, the film is excellent, with great costumes, scenery, photography, sound and visual effects. Some of the performances also surprised by the depth and drama, like Peter O'Toole in the role of Priam. Brad Pitt also performed very well, although his character doesn't leave room for him to show all his talent.The big problem of this movie is the script, which tries to mix various Greek myths with the story of Homer's Iliad, ending up lost and confused by too much information. Consequently, there are characters in the film that have great relevance but hardly appear in the myth (Briseis and Patroclus for example), whereas other characters that mythology values ​​will end up virtually disappeared in the film (Cassandra and Ulysses are obvious examples). Another \"victim\" of this poorly thought out script was Achilles, a central character in the film, beautifully played by Pitt but a shadow of mythological Achilles, which has a much greater depth and psychological wealth, something that the script didn't know or didn't want to explore. I'm sure that Brad Pitt would have been up to the challenge if writer had followed that path. Unfortunately, he chose to value other things, almost creating sub-plots that then kills at birth by not giving them continuity. There are also characters and situations that arise and only those who know the Greek mythology understand why, because the film doesn't give them any explanation or follow-up. For example, the sudden and momentary appearance of Aeneas at the end of the movie... only who knows the mythology will know that Aeneas is one of the names associated with the founding of Rome.This movie is a good movie, with good actors and a good story. It would be an even better movie if script was better but, nevertheless, worth seeing it."
    },
    {
      "rating": "4",
      "text": "Retratação histórica jogada no lixo a troco do que?O filme tem um enfoque muito grande no Aquiles, personagem interpretado por Brad Pitt. E gente... o desenvolvimento do mesmo me dá vergonha alheia. Primeiro temos a forçação de barra quanto a ele. Todo mundo \"pagando pau\", o exaltando - até mesmo o próprio Rei, sendo que o personagem já cuspiu na cara dele em diversos momentos. Toda questão do seu proposito, no dialogo com sua mão, são contraditórios ao ponto de vista que ele tem ao ser questionado sobre a guerra. A sua relação com a Briseis é perigosa e abre mais uma vez a porta para síndrome de Estocolmo. O figurino do personagem não me agradou. É como se o Brad Pitt não pertencesse aquele universo, muito menos intimidasse seus inimigos. O fato de que o Rei não o matou não me desce de jeito nenhum. O seu \"amor\" pela briseis muito menos.Os combates são legais, assim como as batalhas em longa escala. O duelo entre Aquiles e Heitor foi muito bem coreografado. A OST cumpre seu proposito e a fotografia também - se atentando ao gênero.Sean Bean estava bem no filme. Eric Bana também chamou minha atenção, mesmo sendo limitado em alguns momentos."
    },
    {
      "rating": "5",
      "text": "I can't even think of the amount of money spinning around this movie. Famous director, a lot of famous actors, a bunch of extras and special effects. The original artwork is quite respected even if the atmosphere of greek tragedies doesn't match at all with all these american eyes and brains.Brad Pitt's acting is terrible: he always has this kind of angry and dumb face even when he is sorry. I can only salute him for his ability to perform martial choregraphies. He however managed to reduce the overall epicness tone of the movie by attenuating the intensity of the events.It is really hard to have empathy for any of the characters excepted for Priam, Hector and his wife because the others all look like pre-programmed robots. It is not because your story is written that you have to play it like robots come on."
    },
    {
      "rating": "8",
      "text": "purely nostalgia based review. i used to watch this movie about sixty times a month when i was a baby. i still adore this film and watch it at least once a year. now i’ve gotten way more into the world of ancient greek myths and reality and i must say i’m disappointed that they made patroclus and achilles cousins when they were very obviously not. but looking past that i love the performances of the actors and my favourite scene is the fight between hector and achilles."
    }
  ],
  "recommendations": [
    "the_patriot",
    "thor",
    "conan_the_barbarian",
    "top_gun",
    "wonder_woman",
    "body_of_lies",
    "kingdom_of_heaven",
    "gladiator",
    "highlander",
    "backdraft",
    "blade_of_the_47_ronin",
    "pearl_harbor",
    "creed_ii",
    "star_wars_episode_ii_attack_of_the_clones",
    "black_widow",
    "hellboy",
    "the_magnificent_seven",
    "american_gangster",
    "hulk",
    "rocky",
    "ben_hur",
    "braveheart",
    "centurion",
    "master_and_commander_the_far_side_of_the_world",
    "alexander"
  ]
}