{"id": 3310, "title": "True Lies", "starring": ["Arnold Schwarzenegger", "Jamie Lee Curtis"], "runtime": 141, "genre": ["Action", "Thriller"], "description": "A fearless, globe-trotting, terrorist-battling secret agent has his life turned upside down when he discovers his wife might be having an affair with a used car salesman while terrorists smuggle nuclear war heads into the United States.", "releaseYear": "1994", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/pweFTnzzTfGK68woSVkiTgjLzWm.jpg", "categories": {"plot": 7.266666666666667, "acting": 6.666666666666667, "ending": 7.166666666666667, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 7.65, "action": 6.895833333333333}, "reviews": [{"rating": "10", "text": "I had to go back and rank this movie, because it's one of my favourite movies of all time. (Starship Troopers being #1)\r This movie is as relevant and entertaining today as it was... my god... 21 years ago."}, {"rating": "9", "text": "Very entertaining movie, which is not completely stupid. Great action and good humour. James Cameron is the best."}, {"rating": "10", "text": "True Lies is the best action movie ever made. Cameron went on to make chick flicks after this (titanic and avatar) because he had mastered a Genre. My god what a masterpiece."}, {"rating": "8", "text": "Cheesy, stupid, and bombastic, in all of the right ways, James Cameron's True Lies is a quintessential American action from the 1980s/1990s. Loaded to the point of bursting with one-liners, cleavage, and explosions, True Lies is the type of macho insanity that keeps men lining up to watch action films to this very day. Yet, action films of today lack the same whimsical sense of stupid brilliance that films such as True Lies captured so effortlessly. Somewhere in the one-line dropping courtesy of Arnold Schwarzenegger, Cameron turns True Lies into a ballet of testosterone, sexism, and penis envy, that only he can make come off so effortlessly excellent. Without the cruel restraints of telling a serious story found in Cameron's prior action work, he is allowed to fully indulge in explosions and carnage in a way that Michael Bay only wishes he could. Honestly, if Bay did not watch this film and walk home crying, I would be stunned.As an action comedy film, True Lies never takes itself too seriously. Indulging in over-the-top explosions, rescue missions, and absurd plot turns, Cameron lets the audience know from the jump that this is really just male fantasy in film form. Dropping in Arnold Schwarzenegger as the audience surrogate, allowing men in the crowd to feel one with his overtly masculine appearance, we experience his world vicariously through him. Cool, calm, married to Jamie Lee Curtis, and spitting game with Tia Carrere, Arnold's secret agent Harry Tasker is what every man would openly admit to wanting to be. Toss in a few \"cool guys don't look at explosions\" moments to open this film and this becomes a proverbial wet dream for macho men everywhere or wimpy men who wish to be macho. Just watch his cool under the pressure demeanor, casual one-liners as he beats the pulp out of a man just as buff as himself (\"here cool off\"), and rushes to save his wife and daughter from the grasp of international terrorists, and try to deny that every man does not want to be Harry. He saves the day. Looks good doing it and gets every girl around. There is an obvious appeal and Cameron plays it to cartoony perfection, ditching reality in the name of just embracing the cheese. It is a stupid film to be sure, but scenarios where we all dream of being a hero under pressure are undoubtedly just as stupid so it is only natural the film would be the same way.Yet, equally as obvious is how the film would line up with the theories of Yvonne Tasker regarding masculinity in these macho, testosterone-filled films. Torturing the male form from beginning to end, True Lies is loaded with explosions and pain for Arnold. With Harry Tasker getting beat up brutally at every turn, having his clothes ripped, and having to lift himself up off of the brink of certain death, he is a man who seems to have a very low life expectancy. While he may not bleed as much as some of his opponents, this is not an easy mission for him and is one that leads to him having to change his ripped shirts for a different one quite often. With the rips and the action, however, the male physique is constantly turned into spectacle here and the reason why any tickets were sold. In the most intimate action set piece - the bathroom scene - there are no explosions but lots of gunfire and fighting. Pitting Harry Tasker with a man just as big as himself, this spectacle of two men in peak physical condition is undeniable and brought to the forefront.However, the film certainly tortures the men a bit in a different way. Men define themselves by the women they get and their ability to please them, hence male insecurity regarding their privates and jealousy. With Helen Tasker (Curtis) beginning to stray due to the lack of intimacy with Harry, he diverts resources to find out who her mystery man Simon (Bill Paxton) is and makes concerted efforts to track him down. Highlighting male insecurity regarding their spouses and inability to satisfy their urges as they expect they should be able to do, True Lies is a film that both tortures men over this area of weakness and gives great release. Upon finding Simon, beating him up, making him admit to have a \"little dick\", and pee on himself, Harry is able to feel like a bigger man and more secure in his position as the only man in Helen's life. Even if she had strayed with Simon, Harry's presumably better endowment and full masculine confidence in every situation ensures that he could take Simon quite easily if it came down to it. It, like the rest of the film, is a fantasy-driven representation of men's desire to possess their significant others, outperform other men, and fulfill their significant other's every need. It is a competition to the very end in both life and the film."}, {"rating": "8", "text": "Perhaps the most joyously violent and intensely humorous of Cameron's wide ranging filmography, \"True Lies\" is an uncommonly witty and brilliantly staged action-comedy with a hefty amount of enjoyable irony throughout."}, {"rating": "7", "text": "It was just your typical Arnold Schwarzenegger movie. A lot of action, cheesy dialogues, cheesy action scenes and pretty much all the cheese you could expect from a 90s action movie. Having said that, the acting was good, the action scenes were well made and it was pretty entertaining."}, {"rating": "8", "text": "Hollywood budget to the roof - that is what this movie is about. Of course, two decades later, this might not be a big deal, talking about special effects... But this is not what makes the movie good anyway. It is situation after situation of absurdity, fun and Arnold-style over the top action scenes.\rWatching it today, I feel more and more that something went wrong with this type of film during the last 20 years. Today we have many well made action-packed block busters, but the entertainment level that True Lies manages to reach is still hard to beat."}, {"rating": "9", "text": "One of Cameron's best movies, Arnold Schwarzeneggar embracing the the cheese, hilarious and great action throughout. Tom Arnold brings his best comedic performance."}, {"rating": "9", "text": "The Harrier jets attack and expertly evade a shoulder-launched AA missile, then pull around with a glorious \"boom\" across the sky and ocean... it's only a few seconds but it's one of my favorite scenes in all cinema. :)  Besides these superb, vividly realistic military scenes, you get a tongue-in-cheek tall-tale spy story with nukes, snappy dialog between Arnold (S.) and Arnold (Tom), and an underlying subversive sense of humor, and it's all highly entertaining from beginning to end.  A great job all around, at the very top of its genre."}, {"rating": "8", "text": "This movie is set apart from other Schwarzenegger action movies thanks to James Cameron's excellent direction, the humor and Jamie Lee Curtis and Arnold Schwarzenegger's hilarious chemistry.The action is insane.Early on in the movie, there's an incredible horseback chase that may or may not have inspired a similar chase in John Wick 3.This was a total blast."}, {"rating": "7", "text": "This is a great action comedy by Cameron and what a performance by Schwarzenegger that proves he can be a good actor too. The movie is probabily not Cameron's best one but it's entertaining as hell also thanks to a stratosferic performance by Jamie Lee Curtis who is at her best performance of her career here. She is the true star of the movie."}, {"rating": "10", "text": "One of my personal favorite movies. I love how James Cameron made the movie into an Action/Romantic/Comedy movie that is actually good for everyone (I loved it when I was 4 in 2002 and my Grandma loves it as well). I believe the movie has a great cast and very good writing (so what if it's not a Oscar movie). There was a lot of memorable moments in this movie that I quote often and I made all my friends watch it and they love it too. Anyhow, I don't use Netflix but if it is on there go check it out."}, {"rating": "8", "text": "Of all the James Cameron movies I've watched, this was the only movie that I haven't even seen until today, I've finally watched it on video and boy did I love it. Avatar, Terminators 1 and 2 and Titanic were such great hits, so this movie is my favorite Cameron movie as well.\r Arnold Schwarzenegger, Tom Arnold, Jamie Lee-Curtis, Tia Carrere, and Bill Paxton were amazing, The action sequences and the comedy were the best moments, and the \"You're Fired!\" quote was also the best moment in this movie.\r James Cameron, as a huge fan of yours, you are good at everything! True Lies deserves an entertaining 8/10 in my honest opinion for its unique things."}, {"rating": "10", "text": "One of Arnold Swargenneer's greatest action films too date, only Terminator 2: Judgment Day rivals it. Truly a 90s action-packed classic!"}, {"rating": "8", "text": "True Lies is an unbelievably epic action / comedy from James Cameron. The movie has an enormous quota of truly unforgettable action scenes. The laughs are also catered for with both Tom Arnorld and Bill Paxton turning in classic comic performances. True Lies is simply one of the most impressive popcorn action flicks ever made!"}, {"rating": "9", "text": "A loose remake of the 1991 French comedy La Totale, the final collaboration between James Cameron and Arnold Schwarzenegger follows a U.S. government agent named Harry Tasker (Schwarzenegger) as he tries to balance his life as super spy and with his family, who are under the impression that Harry is a boring computer salesman. Arguably better than most of the James Bond and Mission Impossible flicks, TL is one of those films that effortlessly blends action and comedy. It also features great comedic performances from Jamie Lee Curtis and Bill Paxton (RIP) and possibly THE GREATEST VILLAIN DEATH EVER!!!"}, {"rating": "5", "text": "Usual Arnold movie. The aeroplane fight in the end is fantastic. But Arnold has no novel action sequences. All of these are similar to those of Terminator series. But Arnold rocks! Jamie Lee Curtis is good. But the violence is usual. I wonder why it was rated \"R\"."}, {"rating": "7", "text": "None of James Cameron's films are bad, but \"True Lies\" might just be his weakest one yet. Nonetheless, it's funny, action-packed and pretty well-crafted. Cameron really did something unique here, you'll know what I mean if you have seen it."}, {"rating": "3", "text": "James Cameron director of Aliens and The Terminator now makes a film called True Lies.... True Lies is a 1994 action thriller with parts of comedy thrown in to make it seem more enjoyable. Harry Tasker (Arnold Schwarzenegger) is married to Helen Tasker (Jamie Lee Curtis) and she thinks he's in a construction business or something lol. She has no idea he's a secret agent or a spy but when Bill Paxton gets involved with Helen Tasker (Curtis) her husband suspects he maybe sleeping with her or something stupid and becomes a hurt and jealous man. So Arnold Schwarzenegger and Tom Arnold who plays Arnie's secret service buddy kidnap Bill Paxton to understand what's going on and Jamie Lee Curtis who plays Helen Tasker is asked to work for her husband's company but doesn't still know her hubby works there. Meanwhile Harry Tasker is trying to track down some dangerous terrorist and stop him and eventually Harry (Schwarzenegger) and his wife team up for the same job and try to stop the badguys and this so called terrorist. Best scene in this movie for me is not any of the action scenes but Jamie Lee Curtis stripping down to her underwear (bra, panties and heels) and doing a sexy, hot dance and giving us some nice moves and eye candy. Bill Paxton is great in this movie and hilarious, the action scenes are okay some of them but Arnie on a horse chasing a terrorist on a motorbike is incredibly stupid and ridiculous. The action scenes mostly are well done but this movie is bad because the film drags too much and seems a snoozefest at times. Some of the action is stupid also and Arnie's acting isn't great but the tango dances are lovely. Not the best film but watch it only for Bill Paxton and Jamie Lee Curtis otherwise avoid."}, {"rating": "0", "text": "Arnold's worst acting, worst role, with great action being ruined by that."}, {"rating": "6", "text": "One thing! Jamie Lee Curtis's body. DAMN she looked fine in black lingerie. Besides if you do not take it seriously, it is better than most action-comedies. One from Arnie's golden age. An easy and fun movie to watch, but of course no \"serious\" material, but it does not take itself seriously (which is good). I can recommend it for fun!"}, {"rating": "7", "text": "It starts out as a goofy James Bond rip-off, but when the plot kicks off (and it took the entire first act to do so), I realized that the movie actually has a pretty decent premise that's as cool as the innovative camera work and the incredible over-the-top action set-pieces that haven't aged even a tiny bit.However, the first act is actually the part of the movie I enjoyed the most. Mostly, because it's where the silly humour works perfectly. But then again the first act really didn't need to be that long, and it's the main reason this movie is overlong in first place.Although it's where the plot begins to develop, the second act is by far my least favourite part of the movie. It is gratuitously stretched, and hence I found it quite boring.The third act has some of the coolest and most intense action sequences I've seen in a Cameron film. By that I mean they are really as cool and intense as The Terminator's.All in all, I liked True Lies, and I think it's one of the most entertaining, and also one of the weakest, movies has James Cameron ever made despite its notable flaws such as the paper-thin plot.If you don't think this movie is silly enough, try to translate the Arabic lines. I'm sure they will do :)(7/10)"}, {"rating": "8", "text": "Arnie's best movie since The Terminator.Comedy action flick that works in part because of the chemistry between Arnie & Lee Curtis and the direction of James Cameron in what is one of his more consistent efforts."}, {"rating": "8", "text": "Two enjoyable movies in one...high-budget action and the grimmest of romatic comedy, fitting together quite nicely. Its story isn't groundbreaking or deep, but it's so entertaining, it's hard to resist, despite pacing that's a tad bit uneven."}, {"rating": "8", "text": "35mm film print at the Alamo Drafthouse in Tempe. The print was fairly worn - lots of scratches, constant popping, faded colors, the works. And yet, still a fantastic experience. Apparently film is still the only way to show this theatrically. How cool. Makes sense considering the lack of a proper home video release. The wrongly formatted DVD doesn’t count.I forgot how much fun this film is. It’s a broad, mainstream, crowd-pleaser and as good as this stuff gets. The crowd I was with loved it. You wanna groan, but you laugh and cheer instead."}, {"rating": "7", "text": "Secret agent Harry Tasker becomes embroiled in terrorist plot to smuggle nuclear weapons into the US, and the fallout puts the lives of his family at risk.    True Lies veers into absurdity on plenty of occasions, but in large part due to the fun performances of Schwarzenegger, Jamie-Lee Curtis and Bill Paxton it still makes for an entertaining enough action comedy."}, {"rating": "7", "text": "True Lies mixes action and violence with comedy. Arnold isn't the greatest of actors but on certain roles in his career like Terminator he did a really good job. When James Cameron is on his is on"}, {"rating": "8", "text": "It is difficult to find a bigger fan of Schwarzenegger or Cameron than me, but for some reason, I just don't love “True Lies”.  The opening section feels bland and the closing section is full of \"how did they do that\" effects shots, but ultimately isn't interesting.  What I did really appreciate is the middle section, which covers a storyline that I haven't seen anywhere else, and it is done in a really fun way.  I would recommend plenty of other action movies before this one, but if you have seen all of the others, there are some good moments here.  I give it a B, next time you’re in the mood for a movie, this one won’t disappoint."}, {"rating": "6", "text": "True Lies is the most controversial film in James Cameron's directing career. This is definitely the weakest of his films. But is True Lies so bad on its own? Definitely not. It's a good action comedy. Prost did not guess with the main actor. No I respect Arnold Schwarzenegger as an actor and a human being, but he's a one-aplua actor, and looks fancy in True Lies. And the whole film is one big stereotype for everything. Comedy that can be watched as a family, without dirty humor. But still, you expect more from James Cameron. Still, he is one of the strongest directors of the current generation."}, {"rating": "7", "text": "True Lies is a project that few would think was James Cameron's, but it is.The action is awesome, the characters are interesting, the plot is funnny (although a little crazy) and overall, it's a good movie."}, {"rating": "7", "text": "This is one of those films that marked the nineties, and that almost everyone has seen on TV or on VHS/DVD. It was a great success and even today it has admirers who do not let it fall by the wayside. The story of this film couldn't be better, even though it is similar to an older French film, which inspired the producers and director, James Cameron. It starts by introducing us to Harry, a secret agent from a very secret government agency. He does risky, action-packed work, but has never told his wife, who thinks he's just a salesman, and is starting to have an affair with a used car salesman who told him he was a secret agent. When Harry finds out, he decides to use the means of his agency to give his wife a faint scent of his own life, but things get complicated when the terrorists he was following manage to catch both of them.The film starts off really well, with an excellent action sequence that doesn't lag behind many of the best scenes in James Bond or \"Mission Impossible\". Cameron clearly shows what he's coming up with and what he intends to do, and is usually successful in his efforts, though he sometimes overdoses it a little and makes the action scenes histrionic. The film makes good use of situational comedy to spice up the action and give the film a light touch. Of course, the way the action and comedy came together is something that can be discussed and some will say is bad, but I personally never saw any problem with the final result. In fact, and looking at the number of films where the insertion of humor and comedy ruins the final result, this is one of the films where this has been done more effectively and with greater skill.The cast has several well-known names. On the one hand, Arnold Schwarzenegger was living a good moment in his career, in the wake of previous successes, and he presents himself here with great aplomb and commitment. Bill Paxton doesn't come up that often, but he's crucial to the plot and does a very good job of it, as can Tom Arnold, with the exception that he was sometimes very irritating. Tia Carrere was a sexy and very Machiavellian villain, in the best style of some famous \"bondgirl\". Jamie Lee Curtis had, on the other hand, a somewhat uneven performance: she was good as a housewife and even the scenes with her lover were excellent, but it would have been better to see her more confident and confident at the end of the film. Curtis was just the damsel in distress. However, she presents us with one of the most famous striptease and pole dance scenes in the history of cinema. The one who got worse in the film was Art Malik, who used all the clichés and prejudices about Arabs and terrorists to elaborate his character. The result of Malik's self-indulgence (and director Cameron's too, in not giving the actor better material) is a character who is basically a walking stereotype.Technically, the film bets largely on special effects, visual and sound. It's a James Cameron movie, let's face it! There was no way we could expect anything different! Even planes and jet fighters were used in the action scenes, and the fights and chases were electrifying. Good sets, good use of the green screen and excellent costumes, combined with competent cinematography, help the film to be visually elegant and appealing."}, {"rating": "6", "text": "I was tempted to give this a 4 star rating as I enjoyed the action scenes and I realise its intended to be a parody of James Bond style films but the misogyny elements bothered me, with the emphasis on the female characters needing help, being asked about sex etc. it made me feel uncomfortable in a  bad way and I was watching it on my own (not in a creepy way, I hope) (lol). Its a watchable enough film and I enjoyed the scene with Arnies character on a horse, causing mayhem - its pretty chaotic at times but I enjoyed it. Its a fairly entertaining watch, its just a little too cliched for my personal taste."}, {"rating": "9", "text": "Love this move! It has such a great plat and well acted. I wish this was available in 4k and to buy."}], "recommendations": ["demolition_man", "die_hard", "the_foreigner", "gangster_squad", "shooter", "last_action_hero", "angel_has_fallen", "the_equalizer", "the_mechanic", "daredevil", "kingsman_the_secret_service", "homefront", "red", "blood_father", "from_paris_with_love", "2_guns", "boss_level", "iron_man", "american_ultra", "red_2", "sherlock_holmes_a_game_of_shadows", "knight_and_day", "shanghai_knights", "mission_impossible_ghost_protocol", "the_rundown"]}