{"id": 4042, "title": "True Grit", "starring": ["Jeff Bridges", "Hailee Steinfeld"], "runtime": 110, "genre": ["Drama", "Adventure", "Western"], "description": "Following the murder of her father by a hired hand, a 14-year-old farm girl sets out to capture the killer. To aid her, she hires the toughest U.S. Marshal she can find—a man with 'true grit'—Reuben J. 'Rooster' Cogburn.", "releaseYear": "2010", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/tCrB8pcjadZjsDk7rleGJaIv78k.jpg", "categories": {"plot": 6.088235294117647, "acting": 6.745762711864407, "ending": 8.5, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 5.2, "funny": 7.615384615384615, "action": 7.785714285714286}, "reviews": [{"rating": "8", "text": "The best thing about this movie was the acting. Jeff Bridges was fantastic! The film was set in a believable location with long drawn-out silences which added plenty of suspense."}, {"rating": "9", "text": "I haven't read the source novel, but I did see the 1969 movie and am not quite sure which I like better....I'll have to rent that one again.  I did like this movie almost as much as some of my favorite Coen films, such as Fargo and Blood Simple, and much more than No Country For Old Men (to be fair, that movie was very faithful to the novel, which I read, and I felt the movie contained all the same problems as the book).  The crafting of the film is excellent, with my only problem being that the actress portraying the older Mattie looks nothing like 14 year-old Mattie....Scanning the critics' reviews, I see the only one who really didn't like it is Rex Reed, and that is probably because there is no hint of male homosexuality in the movie."}, {"rating": "9", "text": "Even if you struggle to understand what Bridges is saying (you will) it is impossible to deny his and the movie's charm. The movie is filled with great acting and scenes that don't scream HERE TAKE SOME ACTION ACTION ACTION but more rely on great plot and acting, with of course enjoyable action in good dose's. I loved this movie and will no doubt watch it again!"}, {"rating": "10", "text": "This movie was amazing. Going back to old cowboy movie style like the good ol' John Wayne days. Their hasn't been a good cowboy/western movie in quite sometime. True Grit was superb. Jeff Bridges with his successful job as the witty Sheriff performed an Oscar worthy performance. Matt Damon did a great job as the lone Texas ranger, and the always awesome Josh Brolin as Tom Chaney, but the biggest breakout performance was by Hailee Steinfeld as Mattie Ross, she did an amazing job and shouldve won the Oscar, especially for being so young, she has a very promising future. This movie was so good it has to be illegal to give it a bad review, 10/10 without a doubt."}, {"rating": "9", "text": "This movie was a lot of fun to me. None of the characters are overally lickable but you find yourself cheering for them. The scenes are shot very well and the acting is solid throughout including a very strong performance by Hailee Steinfeld who plays Mattie Ross. There are some humorus scenes and they flow well from the plot. It is important to view this movie seperate from its 1969 counter part otherwise you may fall to much on your nostalga and miss a very well done film."}, {"rating": "8", "text": "Solid western that I would easily say is better than the original (sorry, Duke). Fantastic acting all around (Barry Pepper didn't get the credit he deserved) and the Coen's weave poetry in every inch the camera touches. Great film."}, {"rating": "9", "text": "There isn't a remake here so much as there is a retelling of a classic story, someone else's interpretation if you will. Joel and Ethan Coen go down a different path from their unique storytelling and take on a Western, one which John Wayne occupied in the original outing. The Coens take a very toned down approach to what we are accustomed to see in their films, but they still have an eccentric tone to the film when the dialogue comes into place. Hailee Steinfield delivers a confident and mature performance as Mattie Ross, a young girl travelling away from home to see justice take place after a ruthless man murders her father, she is a well read and surely individual, wanting the help of the local bounty hunter, Rooster Cogburn, played with grit and hardened experience by Jeff Bridges, who begrudgingly agrees to help this 14 year old girl track down Tom Chaney (Josh Brolin), the man who committed the murder.\rCogburn is a battle-hardned individual who doesn't care much for the consequences of his actions, he's getting old and doesn't care much for anything anymore, much to the dismay of LaBoeuf, a young ranger who enjoys bragging about his achievements in the wild. The three set out on a long and tiring journey in search of the criminal, facing various obstacles which most of the time is each other. The film has the polished touch of a Coen piece, it has strong accents, eccentric dialogue and exceptionally memorable characters throughout, creating a standalone film that shouldn't really be seen as anything other than a retelling.\rCogburn seemingly takes the place of the father the way the story unfolds, teaching Mattie about the ways of the wild and the decisions he has made, this film is very much about these two individuals, how their characters develop and how they react in each others company, but its also a very good Western through and through, combining the slow paced and character driven moments seen in many of the greats, but also a shoot em' up adventure that never fails to entertain.\rIt certainly has a different touch than the typical Coen picture, but it still brims with excitement, unpredictably and heart, but it also stays true to the classic Westerns of yesteryear to deliver a nostalgic plot with a modern kick to make this an entertaining film fromstart to finish."}, {"rating": "8", "text": "A great movie with some outstanding acting. A simple story that carries great depth. The Coen Brothers really understand how to craft a movie. A western that shines in a genre that is presumably gone. They have reinvented it."}, {"rating": "7", "text": "The Coen Brother's spin on True Grit is a darker tale than the original, with it's own message to tell. The balance of honoring the original film and bringing new things to the table is done quite well here. All of the performances are great. There really is not a weak link in the cast. The cinematography is honestly impeccable. The silence of this film is handled with the utmost care. The only complaint that I have is that the Baroqian take on the language in the film comes off as clunky, and occasionally takes the steam out of an otherwise stirring scene. All in all, this is a great western that does deserve to be watched."}, {"rating": "8", "text": "This is a good remake of this new adaptation of the famous book. I have a slight spot for this over the Hathaway 1969 movie but Coen are amongst my favourite directors ever. It's a great western as Coen brothers are always a safe bet when they make westerns."}, {"rating": "10", "text": "The first decent movie I have seen in years.Matt Damon does his best acting since 'the talented mr ripley' as comedic relief.I liked all of the characters, even the villians.   The film is beautifully shot, perfectly paced, and the final shootout is intense.I've seen the original film and this one must be a 1,000 times better.I almost can't believe there's anyone who didn't like this movie, and then I realize this is America, and it all makes sense.The film is perfect until the fake looking cg rattlesnakes, other than that....."}, {"rating": "8", "text": "The Coen Brothers succeed in crushing the original 1969's and establish their own profound, ethnic translation of the western movie \"True Grit\". They erase the 'exaggeration' in western cinema and rewrites it as \"legend\" with their hands. Followed with the Oscar worthy performances from Damon and Bridges, \"True Grit\" is overall decent (In the standard of the Coens) but a efficient, well made western movie."}, {"rating": "8", "text": "One of the great new westerns. Great directing, a good storyline, and great acting make this movie a worthwhile trip. Jeff Bridges and Hailee Steinfeld were both great in their own different ways, and Matt Damon was good as well. Even better than the classic original!"}, {"rating": "10", "text": "My wife and I are getting up there in years, and it's great that there are still movies that fit our demographic. As for being a \"remake\"  I feel the movie lived up to the hype and then some! All the performances ran circles around the originals, no question. Leaving in the original \"fill your hands\" line intact was a nice (respectful) touch that seems to have flown over more than a few heads.   As for rambling, seemingly inconsequential dialogue from Bridges, get over it! That's how aging people talk. The younger you are, the more bored you are by \"old people\" telling war stories. We ramble....because we have experiences. We are laconic and cynical.....because we earned that right."}, {"rating": "10", "text": "An amazing remake. Even without John Wayne, it is an amazing movie. So nicely down that it was totally worth the money i forked over for it. Cheers to Cowen Brothers. 10/10"}, {"rating": "10", "text": "I seldom give a movie \"10\" because it has to be wonderful in every way that cinema can be exciting and satisfying. This was it. I naively assumed that everyone would love this Coen extravaganza - how could they not? \"True Grit\" proves there is no accounting for taste. Perhaps it is love of the English language that holds this movie together and for people who could care less about language spoken wonderfully, it seems a pretentious Western. But if you haven't seen it, love language, like the Coens, Jeff Bridges, Matt Damon, and young fresh amazingly talented young actors (Mattie), do yourself a favor - put up your spurs, tilt back your Stetson, pour a shot of raw, eye-smarting saloon whiskey, roll up a Bull Durham cigarette, and get ready for a  wonderful treat."}, {"rating": "9", "text": "True Grit is the first western based film presented to us by the Coen brothers. The Coens combine their original and witty dialogue with incredible performances by top notch actors to create a film thats so engrossing that you're taken on a ride back in time with true outlaws. The plot centers on Mattie Ross (Hailee Steinfeld) whose father was shot and killed by a loner named Tom Chaney (Josh Brolin), who also made off with the father's 2 gold pieces. Mattie is determined at all costs to find her father's killer, and hires U.S. Marshal Rooster Cogburn (Jeff Bridges) to do the job. A Texas Ranger named La Boeuf (Matt Damon) arrives on the scene already hot on Chaney's trail over a murder he committed in Texas. The trio set off together in hopes of finding Tom Chaney before anyone else does. The plot delves in deeper than that of course, and it emerges as a true Western flick that actually works. While it doesn't involved all that heavily on action (minus a few great scenes), it's involved mostly on the characters and the experiences that they must face. With the Coen's classic dialogue (equivalent to Fargo) the slower paced scenes are genuinely enjoyable because the most random of conversations will occur and the outcome is either hilarious or heartwarming. Jeff Bridges is flawless and Oscar worthy portraying a Rooster Cogburn so exceptionally well that he completely overshadows John Wayne's portrayal multiple times over. Matt Damon is unrecognizable at first as a desperate Ranger though his times on the big screen are enjoyable especially the many quarrels with Bridges such as arguments on who is the better shot. Hailee Steinfeld is completely flawless as well. Her portrayal of a headstrong 14 year old determined to track one man down is so spot on that I actually tricked myself into thinking I was watching an adult in the same role. The supporting roles of Josh Brolin and Berry Pepper were great as always, although their screen time was dwindled down to only a small percentage, but both of their roles are great. The many different camera angles the Coens use really outlay a vast and open landscape to the many different types of crimes committed there. The pacing is slick and perfect. The many action scenes are great and house outstanding shootouts and they aren't as heavy on the violence as the earlier Coen brothers films. In between the few key action scenes, there are the funny and enjoyable dialogue moments that keep the momentum in place and this style never falls flat. All in all True Grit really delivers a stellar experience that zooms through quick from beginning to end thanks in part to the great action scenes, and the truly flawless characters and dialogue. If you're in to look for a great Western film, this is the one true and great modern experience."}, {"rating": "2", "text": "I know I'm going against the grain... I know this movie is well liked by critics and patrons alike... But after watching this movie, I feel like the enlightened one in a sea of gullible moviegoers! Can anyone else appreciate just how TERRIBLE this movie was? First: the script plays on screen like it was written by a school child. Sure, there's some witty one-liners and laugh-inducing reparte now and then, but in the context of a (supposedly) serious film, these parts of the dialogue transpire with the feel of a cheap David Spade movie... (not that there's anything wrong with David Spade movies, it just doesn't belong here). Second: certain scenes of this move are ABSOLUTE GARBAGE, and do nothing in the way of character development or plot advancement! The man in the tree who Rooster Cogburn \"does not know\"... The painfully awkward, random meeting with the medicine man in the bearskin... the inane, often incomprehensible ramblings of Cogburn... the lame-ass cornbread shooting contest... Do you need another four WORTHLESS scenes from this film? I'd be happy to list them. Third: I think it would be fair to say that this movie *attempts* to portray a special bond between Cogburn and the little girl, Mattie Ross. To steal a line from today's youth: EPIC FAIL. Jeff Bridges is a (usually) great actor, and Hailee Steinfeld seems like a wonderful young actress. But taken together, these two have the chemistry of oil and water... Summary thoughts: This movie is boring, hamstrung by hollywood cliches, rather poorly acted, INCREDIBLY poorly written, has a very uninspiring \"gotcha, bad guy!\" moment, and perhaps shouldn't have even been (re)made in the first place. The 2 points I have awarded are for the (surely unintentional) entertainment value derived from the aforementioned campy one-liners, and overdone, humor-inducing melodrama... Enjoy, but probably if you're over 70."}, {"rating": "5", "text": "When i give this movie a five i am being kind because the absolute stupidity of this movie is unbearable to witness. It combines stupidity and bad acting into what is nothing more than a tart fruitcake"}, {"rating": "10", "text": "Overall Movie: 7 Acting: 9 Storyline: 8. Jeff Bridges brings John Wayne's great performance even greater, and fuels this great western. One of those remakes that is actually better than the original."}, {"rating": "8", "text": "overall a good movie to watch if you like westerns.................................................................................................................................................."}, {"rating": "10", "text": "The Coen Brothers are American and this movie speaks to the culture and value of our country.  They are at the peak of their game and have been for quite a while.  True Grit is about the attempt to be heroic in the face of the realities of life, that is, filled with violence, randomness, personal failings and our questionable chances to control what happens to us.  There are potential traps with this story: if the girl is precious the movie can veer towards sentimentality and life is anything but sentimental.  Each of the characters show the balance that exists in people.  Rooster Cogburn is not heroic in most senses of the word.  He admits that he was a terrible father, he kicks the Indian kids off of the porch, he sets up a plan to help the girl while he pursues his money by attempting to catch the leader villain.  The Texas ranger is quite simply a doofus, and yet miraculously makes the shot with the rifle.  He doesn't re-enter the story.  Finally, the girl devotes her childish mind to revenge, which we should know, offers no reward but ashes.  She finishes as a one armed spinster, she is not cute and she finds solace only in her grit.  For me, I am old enough not to expect perfect heroic people or even a chance to act nobly in many situations, but the film shows perhaps what is the best that we can do.  Finally, the cinematography, much like Fargo or No Country for Old Men, shows the open spaces in a way that immerses the audience and reminds us of the beauty, the physical beauty, of America.  Most seriously considered art deals with the challenges that life presents us with, what to do with our lives, and as an American, I feel uplifted and excited each time I see the Coen Brothers attempt to illustrate the issue with a new filter, whether it be set in very un-Hollywood locations as Texas, Arkansas, Minnesota or North Dakota.  My son suggested that for the United States, the art form that is ours the most (apart of course from Rock and Roll) is film and that the brothers are our true geniuses of that art form."}, {"rating": "10", "text": "This movie is purely amazing. At first thoughts I thought it would be a completely serious movie with absolutely no sense of humor. I was proven wrong as this movie has a good plot, perfect amount of humor, and great acting by Jeff Bridges and Matt Damon. A very good way to end 2010 movies."}, {"rating": "10", "text": "This is by far one of the best westerns in many years. I highly recommend this film to anyone who enjoys classic films with great dialogue. What truly makes this a special movie is the acting of Hailee Steinfeld, she interprets a character that is wise beyond her years, this is a must see."}, {"rating": "7", "text": "Underneath the drawn out tension of the Coen's Brothers remake True Grit, is a subtle and lighthearted emotion led by the break out performance of Hailee Steinfeld. If you are expecting the eccentric storytelling and essential rawness seen in Fargo or No Country For Old Men, True Grit is ultimately uninspiring. But in this effort, the Coen brothers smooth out their usual sharp edges, in order to make a film that is pure and an effective homage to a once prominent genre in film.True Grit as stated earlier, is a remake of John Hathaway's 1969 film starring John Wayne, which led to the legendary actor's only Oscar. After her father's death, we follow Mattie Ross (Hailee Steinfeld) , a precocious 14-year old who seeks retribution on the murderer John Chaney (Josh Brolin). Mattie decides to hire U.S Marshall Rooster Cogburn (Jeff Bridges) because of his merciless manner in dealing with the law. At the beginning of the hunt, Cogburn decides to team up with Texas Ranger LeBeouf (Matt Damon) in this often humorous and gritty journey.While Bridges and Damon both put on respectable performances-with Bridges putting on a different twist to Wayne's character- it is newcomer Hailee Steinfeld who steals the show. Steinfeld's puts intensity and zeal into her character that emphasizes her independence and her presumptuous manner. The Coen brothers put more focus into Steinfeld's character rather than Bridge's Cogburn.  I find this a wise decision as the film is able to blend an affable feeling with the somewhat dark humor reminiscent in Barton Fink or Fargo. While True Grit provides great performances, it is not the action adventure that its advertisements imply that it is.  Rather, the film is extremely talky, which is one of the few film techniques similar to the Coens' previous efforts. This is not necessarily a bad aspect, as most of the lines are derived from the Charles Portis novel that the film is adapting.  In other words, the dialogue still remains humorous and intriguing, but it lacks the action and zest of a contemporary Western. As a result, there is a whole lot of drawn out tension that is only somewhat released by the end. Overall, True Grit is visually beautiful and packs a punch in great acting. But as I have to emphasize again, the film is essentially a disappointing Coen film, but is a solid remake to a classic film."}, {"rating": "9", "text": "The book and the 1969 original set very high standards for this Coen Brothers' Western drama, but as high as the standards were set, the Coen Brothers managed achieve the goals or better yet exceeded them. True Grit is about a drunken US Marshal and a **** Texas Ranger helping a stubborn 14 year-old finding her father's murderer. Rooster (Jeff Bridges) was offered $50 to find the murderer for Mattie, played by newcomer Hailee Steinfeld. Meanwhile, Texas Ranger Le Boeuf (Matt Damon) was offered a reward to find the same guy who also killed a Senator. Conflicting each other on the journey and finally catching the bad guy Tom Chaney (Josh Brolin), the three each developed their character skillfully. Jeff Bridges playing last year Crazy Heart's Bad Blake only with a gun and an eyepatch. Matt Damon used his own personal style to play this **** but humorous Texas Ranger. Hailee Steinfeld played a stubborn 14 year-old who's determined to find Tom Chaney and bring him to hang. Though expected performances from both Jeff Bridges and Matt Damon, newcomer Hailee Stenfeld was as good as her castmates. The one thing I kept in mind while going in this film was that Bridges and Damon are going to give applausable performances and Hailee Steinfeld was getting nominated for some major awards. But when I was finished, I didn't see what all the buzz was about. Sure, Steinfield was good, but compared to Bridges and Damon, she sure didn't have much. I have to say though, beating thousands of other girls for this role is impressive, but I'm sure other Hollywood stars had to do that as well. Even though I find her not as great as I hoped, she still delivered well.\rThe directors are the two and only Coen Brothers. With ten Oscar nominations and four wins for each Joel and Ethan Coen, they are Hollywood's most wanted in directing dark Western dramas. Well known for their lastest work \"A Serious Man\" and \"No Country For Old Men', True Grit is another fine addition to their long and impressive resume. Directed with true grit and impressive performances, True Grit outsmarts the original and simply entertaining.\rOscarBuzz: Best Picture (good chance), Best Director (good chance), Best Actor (Jeff Bridges, better chance), Best Supporting Actor (Matt Damon, a chance at a nod), Best Supporting Actress (Hailee Steinfeld, a chance at a nod), Best Adapted Screenplay (Coen Brothers, better chance)"}, {"rating": "5", "text": "Unfortunately this movie falls short of being worthwhile. Perhaps my expectations were too high--though how could they be \"too high\" with Bridges, the Coens, and the western genre--but True Grit felt bland and uninspiring. It certainly wasn't a bad film but I felt no tingling sensation of mental excitement that I get after movies I really enjoyed like after that first watching of No Country, for instance. The best moments of True Grit are few and far between. Ultimately despite the fact that this film is well shot and (generally) well acted, I left the theatre disappointed. I'm still trying to figure out what or who is to blame for that feeling...because it obviously can't be me:)"}, {"rating": "5", "text": "Being a huge Coen Brothers fan, I was surprised to hear they were remaking True Grit.  I know they were fans of the original, but my experience with them made me believe they were going to take the original and improve it dramatically the Coen Brothers way.  Well...they didn't.  In fact, this was the most un-Coen Brothers movie I've ever seen.  Not to say that is a bad thing, but having just watched the original, I could have not seen this version entirely and not missed anything.  Being fans of the original, they clearly wanted to pay homage to the original.  In fact, dialogue and setting-wise, it was about a 90% carbon copy of the original, down to the shots, the script and the way the characters were portrayed.  The Coen Brothers really didn't do much to put their stamp on the film, except maybe the perfect casting.  Aside from very minor differences throughout the film (such as Mattie covering the chimney to smoke out the first couple of ruffians rather than LaBoeuf and having LaBoeuf interact with Ned Pepper the first time instead of Rooster), the only meaningful change in the script is the last 30 minutes.  I've never read the book, but the compliments given to this version is that it is more like the book.  That must mean the ending.  It is very different, and honestly, better than the original.  However, anyone could have done this film the way it was done.  The Coen Brothers didn't do anything to make this film special, so I'm grading it as an average film.  I hope they enjoyed making it more than I enjoyed watching it and I look forward to them returning to their style soon."}, {"rating": "0", "text": "Infuriatingly bad, it's the worst Oscar bait in years.  The story's essentially a one-act play that's so boring I fell asleep.  Thankfully(?) the characters are so hollow that I didn't care what happened to them.  The dialogue is a mix of poorly delivered olde timey \"urgency\" and inane one-liners.  It wasn't funny, suspenseful, insightful, thrilling, or engaging in any way aside from a few seconds of nice cinematography.  It wasn't snubbed by the HFPA for Golden Globe nominations; they saw that it was a horrible crapfest of a movie totally worthy of zero accolades in exchange for the zero amount of entertainment it contained."}, {"rating": "2", "text": "I'm old enough to have seen the original and its not just an issue of \"why remake a John Wayne movie?\". I have to give Jeff Bridges some credit, he certainly has skill. Matt Damon however seemed to be an odd casting choice and a bit awkward in this kind of movie. Overall, the whole thing moved slow and therefore seemed to drag on. I left the theater feeling like I had wasted an afternoon and that there was no point in remaking this film. The original was excellent and this version brought nothing new."}, {"rating": "4", "text": "What I loved: Matt Damon, the cinematography, the premise. What I liked: Jeff Bridges. What I didn't like: the incredibly slow story and the one-note main character (Mattie Ross). What confuses me: why this movie is getting such rave reviews. I suggest seeing it as a rental."}, {"rating": "4", "text": "I didn't really like this movie. Jeff Bridges voice was annoying (too much groveling in his voice), and the scenery looked pretty bland (no vibrant sky colors or grass colors). The town scenes looked unauthentic and it seems as if some of the background was intentionally a bit off or blurry, so someone wouldn't focus on it I suppose.  The girl, Maggie spoke too sophisticated for a 14 year old, and seemed too rehearsed at times.  The old vigilante cowboys even seemed to speak this way at times, and it came off as unauthentic.  Maggie looked mixed race (white/black) and I'm wondering if this was intentional to appeal to a wider audience?  I definitely don't think that was the \"norm\" in the 1800's.  Whole thing seemed unauthentic and stiff.  Thumbs down on the scenery and acting.  Definitely didn't hold up to the original.  A much better western is The Quick and the Dead with Sharon Stone and Gene Hackman.  Hackman was born to play a cowboy and the scenery is perfect for that era and there was so much put into the visual effects of this movie."}, {"rating": "2", "text": "Man I can't believe this movie is in the running for best picture at this years Oscar!!! This movie was so BORING and un-entertaining! The acting was OK at best. I found that I couldn't Jeff Bridges! The way the movie was filmed was like it was filmed in the early 60's! Nothing in this movie impressed me even the 11 years old girl, whose been given great reviews from the movies critics failed to impress me!When you look at this movie on paper, you just can't wait to watch it. Jeff Bridges, Matt Damon, Josh Brolin stars, Cohen Brothers Direct! Gets your mouth watering! Trust me people this movie was very very boring!"}, {"rating": "8", "text": "Jeff Bridges was a great actor. He really put this movie on his shoulders. Matt Damon was also a great actor in his respective part. The dialogue dragged on a bit in the end but still a good movie in all. Good action scenes (especially when taking quality over quantity). Jeff and Matt for the Oscars!"}, {"rating": "4", "text": "Compared to the John Wayne original, this version was so very ordinary.  Where the original had great scenery, music, acting and scriptwriting, this new version is very dull.  Jeff Bridges and Matt Damon are fine actors but their lines are very wooden and unemotional - a sign of poor direction.  The girl was pretty good but she couldn't save the movie.  Although the original is one of my favorite movies, I truly saw this version with an open mind, and didn't much care for it.  Why is this movie so highly regarded ?  I'm sorry but I think the Coen's are greatly overrated."}, {"rating": "3", "text": "Sucked.  It is over-hyped, badly predictable, easily forgettable, utterly missable.  Don't bother with it._______________________________________________________________________________"}, {"rating": "1", "text": "After reading all the glowing reviews from both critics and users on the website I was really expecting an amazing movie that would keep me entertained throughout. Instead, I was bored out of mind my for about 85% of the movie. The last ten minutes were decent, and that's it. I do not recommend."}, {"rating": "2", "text": "Huge fan of the Coens but this film is an ineffectual copy of the original classic. The story line is barely changed and for the worse i must say. There is no chemistry of kinship between any of the over acting actors who all fall prey to the pitfall of their own stardom or that of the directors."}, {"rating": "1", "text": "You'll need \"true grit\" to get through this one.  In a word - monotone.  Slow pace, too much dialogue (monologues), gratuitous violence, poor editing.  Scenes that should/could have been surprises were simply confusing because the film lacked story development.  We plodded from one ho-hum conversation to the next with a shot of violence dropped in now and then to [try to] break the monotony.  I'm a major Coen brothers fan but afraid they missed the mark here.  Spend your money if you need a  nap."}, {"rating": "1", "text": "You can put frosting on a turd, but it doesn't make it a cupcake.   This movie has no redeeming qualities.  I went in with great expectations and came out shaking my head in disgust.   Everything that made the original great is missing.  Bridges is no John Wayne.   I never knew just how well Kim Darby and Glenn Campbell played their parts until I saw Hailee Steinfeld's and Matt Damon's performances.   I have a collection of over 5,000 movies and there's no way I'd ever buy this turd."}, {"rating": "10", "text": "True Grit was extremely awesome! This western film has everything that is so cool to watch and I really like the action scenes,some cool western dialogue with funny and seriously dark."}, {"rating": "7", "text": "Excellent characters brought to life by skilled actors. They have fun, we have fun. The parts are greater than the whole. With such a simple story, it would be hard for the plot to live up to the likes of Cogburn, LaBoeuf and fourteen-going-on-you're-no-matched-for-me Mattie Ross. Sadly, by the end I was left wanting more."}, {"rating": "10", "text": "Joel and Ethan Coen have done it again!..  This time they take a John Wayne \"oater\" and create a masterpiece study in human character.   The entire cast give a scintillating performance.  The Coen's depict life as it really was.  The good guys and the bad guys were cut from the same bolt of dirty cloth.  The only difference is that one got \"paid\" when they stole a person's possessions; the other got paid when they brought them to justice.  The only one who was clean was Mattie Ross, and she by the force of her righteous will made them all toe the line.  Well done Joel.  Well done Ethan."}, {"rating": "8", "text": "A very good movie. Typical Coen brothers film, great acting, great script and dialogue, laugh out loud moments followed by some dark and edgy monents. A great Western as well, as it shows the \"Old West\" for what it really was, harsh and unforgiving. Bridges, Damon and a brilliant Hailee Steinfeld all work well together and you feel like being on the trail with them. A must see if you like the Coen brothers, westerns or just great acting. However my only negitive point is just don't expect it to live up No Country For Old Men."}, {"rating": "0", "text": "This movie sucked for the first hour!! It was about as exciting and interesting as a heinz ketchup commercial. The last hour was okay. Overall, I'd say skip it.  If you want to see a movie where they put adult words in children's mouths... then go see 'Kick Ass\" instead.  A precocious 14 yr girl just doesn't work. Damon and Brolin are just supporting roles... so don't go for them.  In case you're wondering... I loved 'No Country for Old Men\". This movie was a HUGE disappointment."}, {"rating": "10", "text": "One of my favorite movies of the year. It's not an action movie but rather a dark, western themed comedy-- and more than that, it's an excuse for some very good actors to chew scenery."}, {"rating": "0", "text": "Got to give it a \"one\"  mostly for my errant expectations. Those who are looking for a typical Coen brothers film will be very disapointed. Terrific acting by Jeff Bridges although he does seem to reprising his previous role in \"Crazy Heart.\" Matt Damon is unrecognizable and wasted. Hailie Steinfield is getting rave reviews and it is hard to understand why. She appears to be acting in every scene. Merely a good straight-ahead western. The Coen Brothers should go back to making Coen brothers movies unless they are getting worn out and lacking the true grit necessary for inspiration.."}, {"rating": "1", "text": "This movie was awful.  I am sorry I saw the original with John Wayne but this was a pointless boring piece of trash.  It made absolutely no sense because you knew where this was going 5 minutes into the flick.  The professional criticis raving about this simply blows my mind.  Just a waste of two hours."}, {"rating": "3", "text": "Jeff Bridges and Matt Damon were really great in this movie. However everything else was bad and boring. Characters would talk about things that had nothing to do with the plot or development of the story. When I went into this movie i thought i was there to see an action movie. What i saw was a bunch of cowboys talking about their crappy jobs and money. Even though the acting was good the characters that these great actors were made into were over all bad. The girl was whining the entire movie. And both Matt Damon's and Jeff Bridges characters were both boring and underdeveloped."}, {"rating": "0", "text": "This was a waste of time. The original was a classic western. This was a weak attempt to recreate\rTrue Grit. The characters were forgettable, the story was drawn out, the performances were okay but compared to the classic, in every case this came up short..  This may have been the worst movie I have\rseen in a long time. i usually pride myself on seeing quality movies. Maybe the rent was due......"}], "recommendations": ["lawless", "legend", "american_hustle", "daredevil", "american_gangster", "rush", "the_godfather_part_iii", "creed_ii", "logan_lucky", "creed", "hell_or_high_water", "inside_man", "backdraft", "changeling", "gangster_squad", "lucky_number_slevin", "casino", "body_of_lies", "eddie_the_eagle", "trouble_with_the_curve", "catch_me_if_you_can", "the_magnificent_seven", "snatch", "the_harder_they_fall", "the_irishman"]}