{
  "id": 4126,
  "title": "Tulip Fever",
  "starring": [
    "Alicia Vikander",
    "Dane DeHaan"
  ],
  "runtime": 107,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "An artist falls for a married young woman while he's commissioned to paint her portrait. The two invest in the risky tulip market in hopes to build a future together.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aGBRTDMuYDKCA9g7NTGwtMZBWd.jpg",
  "categories": {
    "plot": 5.117647058823529,
    "acting": 5.153846153846154,
    "ending": 4.5,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "This is an attractively mounted, but oddly flat and uninteresting picture. It bears signs of its extended, reportedly tortured post-production. It feels overly finessed, as if a thousand and one people, from unacknowledged editors to concerned financiers, watched rough cuts, and their every note—\"this part is too long; speed it up,\" \"this scene needs explanatory voice-over\"—was heeded, rendering the final product a lurching beast with no emotional center. There is an enormous amount of plot here, coincidences and confrontations and desires and twists of fate (imagine acts four and five of Romeo and Juliet on steroids), but it whips along without ever being particularly involving, let alone moving. The Attractive Young Wife of an Much Older Merchant and the Intense, Penniless Young Painter fall sordidly in love within the space of a few scenes because of course those characters fall in love in this type of period melodrama, not because the actors have chemistry or because the relationship is in any way well-developed. There a few points worthy of at least modest praise: the recreation of a thronged, unsanitary 17th-century Amsterdam is an impressive feat of art direction, for example, and I was pleased to see Christoph Waltz's character, a deceived husband, never become more than slightly boorish, allowing the actor to play notes other than dastardly. The use of \"tulip mania,\" a historical example of a sensational-then-ruinous speculative bubble, as an overarching context is also novel, if a bit convoluted. Unfortunately, there also points worthy of special criticism: Zach Galifianakis' involvement will be writ large in the annals of egregious miscasting, his every buffoonish scene a pain to endure.At times, I found myself imagining the entire enterprise played as a comedy. Though it is presented as a deadly serious romantic drama, there is a sizable dose of A Midsummer Night's Sex Comedy or Tom Jones (1963) in its DNA, with so many characters rolling around in the sheets and the whose-baby-is-it-anyway? subplot and Judi Dench as an abbess with sass."
    },
    {
      "rating": "5",
      "text": "It’s a timeless tale of love and betrayal and people doing **** things to people who are good to them, based on a 1999’s novel by Deborah Moggach who also wrote a screenplay for this.Once upon a long time ago in Amsterdam: a married woman (Alicia Vikander) begins a passionate affair with an artist (Dane DeHaan) hired to work for her husband (Christoph Waltz). The lovers gamble on hot market for tulips to get the money for escaping together.Also appearing, Judi Dench, Zach Galifianakis, Jack O’Connell, Holliday Grainger, Tom Hollander, Cara Delevingne and others.This must be one of the more hated movies of 2017 I’ve come across: Metacritic score 37 out of 100, Rotten Tomatoes’s 8 out of 100. It’s far from disaster but I can’t say it’s good either.To start with the positive, the movie looks gorgeous, the mid-17th century Amsterdam feels very lively and booming although we don’t see much of it, most events take place inside somewhere. The pictures added here really don’t do the movie justice but I didn’t find a better selection online.The actors make their best of their material, although the characters are so one-note that only screen veterans in supporting roles (Waltz, Dench, Hollander) manage to give really memorable performances.The young stars (Vikander, DeHaan) do adequate work and they have good enough chemistry to offer some steamy love-making scenes… but you can’t really compete with Waltz or Dench in terms of range or sheer presence, can you?Based on acting and how the movie looks, the result would deserve a higher score… but the storytelling really makes a mess of everything.In 107 minutes, there’s so many events and relationships and so little willingness to develop them properly that several major plot points or turns fall entirely flat and lose any believability or dramatic impact.All in all, „Tulip Fever“ is disappointment. It’s certainly watchable if underwhelming… but it could have been good.Still, I like both young stars and look forward to seeing them in other, better realised movies. It’s also interesting to note that Vikander is the new Lara Croft in „Tomb Raider'“ reboot coming in March.The project has an unlucky history which is actually a fair bit more interesting than the final movie itself.The shoots were originally planned in 2004, with Jude Law and Keira Knightley as leads and John Madden („Shakespeare in Love“) as director. However, the production was halted 12 days before the shooting because of changes in tax rules affecting film production in the UK.Dreamworks had already built a massive set of the Amsterdam canals, and planted 12,000 tulips which were dead-headed.The current production was shot in 2014 but the release was postponed for three years due to negative test screenings."
    },
    {
      "rating": "6",
      "text": "'Tulip Fever' is a jangled mess of a film that serves as a classic case of too many creative cooks in the kitchen.  I'd love to know how many times the script was re-written, how many times Harvey Weinstein slashed the budget, and how many times the film was re-cut in post-production.There's plenty to mourn as a result.  One might assume that a cast that includes Alicia Vikander, Dane DeHaan, Jack O'Connell, Zach Galifianakis, Judi Dench, and Christoph Waltz would propel any film into Oscar territory.  Yet 'Tulip Fever' proves that no cast can overcome a muddled script, shoddy sound design, and poor editing.Worst of all, the movie likely ruined any future potential for a better film to be made about the actual historical event known as Tulip Mania that occurred during the 17th-century Dutch Golden Age.  Given such fascinating source material, here's hoping someone at least makes a documentary about it."
    },
    {
      "rating": "7",
      "text": "17th century Amsterdam saw the explosion of the tulip bulb market, which provides the backdrop for this film's amorous intrigue. Alicia Vikander plays a woman who's sold to a rich merchant (Christoph Waltz), but falls for the young artist hired to paint her portrait (Dane DeHaan). The plots lines swirl around each to generate a vortex of dramatic complications that would make Shakespeare proud. As expected, the era allows for some lovely visuals, but also exposes the grittier side of the period. Even through the complex storytelling, the actors create compelling characters and elevate the narrative to a more acceptable level."
    },
    {
      "rating": "7",
      "text": "This film has taken a drubbing in the early reviews, and indeed there are deficient moments in the dialogue...\"You stole my heart.YOU stole MY heart.\"  (Or some such emphasis...)One almost begins to question Tom Stoppard, especially since the script lacks the heady, high-density verbiage you expect from him, but looking instead to the optics, the architecture of the plot, which is where you should look, I think the film's rather spare, simple language serves us better, and that its most egregious failing is not to have presented even one single exploding car.Those drawn to a film with historical setting in the tulip bubble, where a long-standing aesthetic was exaggerated to extreme value, should welcome a long-standing trope, also stretched  beyond comfortable limits.  The cloak trick: leading character fooled by disguise/appearance, not pausing to investigate and confirm, goes off to disaster.  Thus fishmonger abandons pregnant girl friend, negligently discarding a fortune because falsely supposing her unfaithful.  Artist mourns lover's death upon finding her cloak drowned in the canal... or even more extreme error: artist sends drunkard to collect critical parcel with his mind cloaked in ignorance of its contents: a king's ransom tulip bulb.  One cannot help gnashing teeth over the decision who is the greater idiot: drunkard who eats it for an onion, or artist who sent him so unprepared while a hundred better options cried out.The cloak-trick trope, which served Shakespeare over and over, and now appears in this tulip period immediately following his -- perhaps it was so popular because the Renaissance was struggling to finally burst the Medieval ban on empirical science.  Gallileo had recently placed the earth in proper orbit and Newton would soon displace Aristotle's improper notion of gravity.  Question and verify, don't assume because tradition did.  We know this now -- or perhaps we just have a tradition of assuming it -- but modernity may find this cloak-trick extreme extremely uncomfortable.But we should tolerate the anachronism, because it's origin is much older and also closer to us than time can be.  To explain, I have to mention an artist whose name you probably don't know, but should, and that is Veda Vyasa.  This poet has been dated, based on specific astrological references in extant texts, to 3800 BCE.  And if you consider that's ancient history, (and therefore who the hell cares, anyway?) I should also mention that his best-known work is currently in wide circulation and translated into more languages than the Bible.  That would, of course be the Bhagavad Gita.  In its enclosing epic, the enormously extensive Mahabharata, Vyasa shows us Draupadi, the princess in exile, being sexually harassed by a powerful courtier-general.  In desperation, she appoints an assignation, where she promises to submit to him, under a cloak, under cloak of night.  When he actually reaches under the said cloak to possess his delicate victim, the reality is somewhat different: he encounters instead her husband, Bhima, and quickly winds up closely resembling the hamburger special at Costco.  Minus the plastic wrapper.  Almost as good as an exploding car.   Vyasa is all about the relation between this current minute particle of reality and the unreachable extent of the field that underlies it.  I personally think he knows it better than Erwin Schroedinger, who actually wrote the equation for it.  I think Tom Stoppard very consciously intends for us to ponder, and we should, the ineffable effable effandineffable bond and gap between appearance and reality.  What else is art about?  Pyramus killing himself over Thisbe's discarded cloak and Romeo, lost with Lawrence's miscarried letter?  Fortunes won and lost over an errant allele and its phenotypic streak in the tulip petal?  Every moment is a mission to conceal and to uncover eternal transience.  If that seems a bit too \"cosmic,\" your consolation is a happy ending:  our surrogate Romeo and Juliette get a second chance, because Dame Judi is a wiser and ultimately more practical intercessor than Friar Lawrence."
    },
    {
      "rating": "4",
      "text": "Although I don’t think this is an awful movie, it is not very good either. I spent a lot of time trying to put my finger on what exactly was wrong instead of being engrossed in the film, but I guess I ended up like the Weinstein Company and just gave up. The movie was too full of plot and desperately needed to be simplified, but perhaps this is what happens when the author is also one of the screenwriters. Then the film was dark and ugly – and I don’t care if that was what Amsterdam looked like in those days. The actors saved the film, but only because they were interesting to watch, not because they knew what they were supposed to be doing. So much talent wasted."
    },
    {
      "rating": "4",
      "text": "Alicia Vikander is fantastic in this but this film tries to be too smart for its own good. Set in 17th century Amsterdam, the film tries to bury you with its plot twists to make up for its narrative flaws."
    },
    {
      "rating": "3",
      "text": "Well this didn't age well. You will understand when you see who's the producer. A brilliant cast wasted by an uneven film.Has anyone seen Good Time and Blade Runner 2049? I heard it's pretty good. You should check it out before the year is over."
    },
    {
      "rating": "4",
      "text": "Alicia Vikander and Dane DeHaan need to start looking for better agents, especially DeHaan who accumulates his third consecutive failure.This movie is a sleeping pill without direction and without style. I don't usually say this but if you can avoid it, do it."
    },
    {
      "rating": "0",
      "text": "Nothing is good about this movie. Awful. Just awful. It is trying to do too much stuff into one thing"
    },
    {
      "rating": "7",
      "text": "This is a reasonably good period drama. It does feature some fairly raunchy scenes, so it's perhaps not an ideal watch if your with your parents or similar but the story is intriguing and the cast do well in their performances and its somewhat thought provoking too, so not an overly bad film. I quite liked the cinematography too. I would recommend this film, yes."
    },
    {
      "rating": "2",
      "text": "Alicia Vikander is fantastic in this but this film tries to be too smart for its own good to try and make up for it's narrative flaws. Vikander is fantastic in this and the production design is really good, it's just hard to ignore how poorly written this film is."
    }
  ]
}