{
  "id": 3342,
  "title": "Tusk",
  "starring": [
    "Justin Long",
    "Michael Parks"
  ],
  "runtime": 102,
  "genre": [
    "Comedy",
    "Horror"
  ],
  "description": "When his best friend and podcast co-host goes missing in the backwoods of Canada, a young guy joins forces with his friend's girlfriend to search for him.",
  "releaseYear": "2014",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pHghiDnQ63O7MiItD6CaSz2jjnr.jpg",
  "categories": {
    "plot": 6.093023255813954,
    "acting": 5.35,
    "ending": 4.833333333333333,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.022222222222222,
    "action": 3.3333333333333335
  },
  "reviews": [
    {
      "rating": "8",
      "text": "For those of you who enjoy Kevin Smith, as a writer, director, comedian, pot smoker, or just a fat guy, this is the movie for you to watch. If you don't, then this may not be the movie for you, because this is about as Kevin Smith as it gets. If you have no idea where you stand, then watching this movie is certainly what you should do.\rI'm going to be straight with you, this is not a movie for the feint of heart, so if you're on your Disney Frozen bs then DO NOT watch this twisted flick. Tusk is in the horror/comedy section of Smith's work, done similarly to Red State(2011), it gives you that weird twisting uncomfortable feeling in the pit of your stomach durring several of the scenes. This flick follows podcast host (Justin Long) venture up to the great white north of Canada in search of a story to tell his co-host (Haley Joel Osment f***ing 'I see dead people' kid) on their show, he finds himself a story and more than he bargained for. The cast, including Smith's daughter and Johnny Depp's daughter, all do wonderfully in portraying Smiths twisted horror story, but I was blown away to see some downright ridiculously talented acting from Johnny motherf***ing Depp himself. If I were to give a quick overview of this movie I'd probably sum it up with, The Human Centipede meets Kevin Smith meets a Walrus.\rDefinitely worth seeing if you're looking to watch something truly strange, but don't worry, even when it gets horrific, it's still pretty ridiculous, you'll see what I mean."
    },
    {
      "rating": "4",
      "text": "Strange, and not really commercial, an obvious work by Kevin Smith, but it is clear that by far is one of his best projects, I can honestly say that I received more than I expected and that is always a good thing.Tusk is an interesting and bizarre film, with a different plot and something tetric, well carried in certain points achieving to reach good port."
    },
    {
      "rating": "0",
      "text": "FILME LIXO DO KCT, PARECE QUE CAGARAM E FIZERAM ESTA MERDA FEDIDA E LIXOSA. N DEVIAM TER FEITO UMA BOSTA DESSA, PQ MDS É SIMPLESMENTE UM LIXO. QUEM DA NOTA BOA PRA ISSO TEM PROBLEMA MENTAL E FALTA DE BOM GOSTO NA VIDA. PIOR FILME DA HISTORIA, UM LIXO"
    },
    {
      "rating": "0",
      "text": "I have never been angry while watching a comedy movie ever, that being said this movie made me angry"
    },
    {
      "rating": "0",
      "text": "Kevin Smith, whose repeated threats in recent years of permanently exiting the world of filmmaking have taken on the dubious credibility of retirement announcements from, say, most classic rock bands, has apparently found his creative mojo once again with the batsh*t crazy Tusk. Smith's previous film, 2011's Red State, was justifiably poorly received by critics and audiences, souring him even further on the filmmaking process. Then in 2013, a bizarre discussion on an episode of Smith's SModcast podcast hastily inspired him to write and direct Tusk, a high-concept movie (in more ways than one, I'm sure) that can be summarized with one sentence: Los Angeles podcaster visits Manitoba and gets kidnapped by a lunatic who turns him into a walrus. Still with me? Smith, during the film's second TIFF screening I attended after its world premiere the night before, joked that he had reached the point in his career where \"I don't give a fu*k anymore\", but just because Smith has reached a bitter crossroads in his career that's resulted in quite literally one of the worst movie experiences I've ever sat through doesn't mean you should also be subjected to the man's lack of impulse control.\r Two main things drew me to Tusk: 1) I was a modest fan of most of Smith's work (which you probably can't tell from the contempt being leveled at him in this review, but that just speaks to the permanently scarring effects of this abomination) and 2) the film is mostly set in Manitoba and promised plenty of Canadian references and jokes. The humour, like almost everything else in Tusk, never works, however. I can count on one hand the number of times I laughed during the film and I was surprised, frankly, that Smith, a man with both a sharp wit and an extensive knowledge of this country (as he'll gladly point out any chance he gets about the latter), stooped to such lazy and predictable jokes about not loving hockey and the word \"aboot\". Johnny Depp shows up briefly to chew scenery as Guy Lapointe, a quirky Quebec detective constructed entirely of French-Canadian stereotypes that become tiresome very quickly. For further evidence of the film's humour deficiency, the name of the comedy podcast hosted by protagonist Wallace Bryton (played by Justin Long, who goes heavy on the douchebaggery) and his sidekick, Teddy (played by The Sixth Sense's Haley Joel Osment), is \"The Not-See Party\", whose theme finds the hosts making fun of people they've read about or seen on the internet. That kind of half-assed and witless screenwriting also extends to key plot points, like the one that conveniently allows Wallace to contact his friends after being kidnapped by the deranged Howard Howe (played by Michael Parks, who's decent performance is the only thing remotely redeemable about the movie). I could go on about how the supposed big payoff of seeing Wallace transformed into a walrus disappoints mightily with shoddy special effects (the sight of him is slightly disturbing, but not Human Centipede-level disturbing), or how the tease of some much-needed action at the movie's end is practically over before it begins, or how the dreadful final scene provided a fitting end to this turd of a film…but I'm sure you've gotten my point. As I write this, I've gotten six days of distance from watching Tusk and having to revisit it for this review has genuinely made me feel, well, annoyed.\r That annoyance was felt during the screening, too, as a packed audience heavy on Smith fanboys and fangirls at the sizable Bloor Hot Docs Cinema in Toronto inexplicably laughed and cheered throughout the movie. Normally I stick around for festival Q & A sessions, but as the credits rolled and Tusk was met with rapturous applause, I couldn't head for the exits quickly enough to get as far away as possible from Kevin Smith and anyone who thought his latest film was worthy of such adoration. And fair warning: Smith has two more films in the pipeline that'll complete what he's calling his \"True North Trilogy\". Yoga Hosers is currently shooting and centres around the pair of surly teenage girl convenience store clerks (played by Smith's and Depp's daughters) that get about five minutes of forgettable screen time in Tusk, to be followed by a Jaws-inspired movie about a killer moose. God help us all.\r Mediaboymusings.blogspot.ca"
    },
    {
      "rating": "0",
      "text": "I don't mind high-concept films, i don't mind gore, the bizarre films, i don't mind comedy, but unfortunately this film fails (spectacularly) on all of those fronts. Easily the worst film I've been unlucky enough to buy a ticket to for many, many years. A nasty, humorless, adolescent, heavy-handed, badly acted crap-fest that leads one to wonder exactly how the supply-side of the crack trade keeps up with Kevin Smiths evidently Herculean intake. If you are a Smith fan-boy and you are STILL supporting Kevin and his films, it's not too late to shake off your uncritical and blind devotion (he will never write another Clerks) and find something worthwhile to align yourself with."
    },
    {
      "rating": "0",
      "text": "This movie was a piece of trash!!! I love horror films, but this was beyond bad. The premise is ridiculous - something that you'd expect from a bad TV movie made on USA Network or something. There's nothing scary about it - it's a gore flick minus the ... uh gore... and it was an infuriating BORE. Save your money folks. I kept wondering while watching -- WHO approved this film and funded it??!!!"
    },
    {
      "rating": "7",
      "text": "A film that I had really high expectations for (probably too high). I'm a huge fan of the SmodCast show Kevin Smith and Scott Mosier host and when I heard \"The Carpenter & The Walrus\" episode I couldn't wait for them to make this film. The final product is a film which I admire more when thinking about it rather than when I watched it. Individual scenes are great, Michael Parks is great, Justin Long is surprising great and everyone involved all commit to their roles commendably. However, I feel that the whole product is too uneven, and the final scene had me more baffled then amused. Also be warned that listening to that episode of their podcast ruined some of the surprises of the movie for me so just a heads up."
    },
    {
      "rating": "1",
      "text": "Wow! How the mighty have fallen. The movie's trailer looked ok, but once the movie started I was just waiting and waiting for something good to happen. The movie tries to be funny and scary, but is neither. Die hard Kevin Smith fans will enjoy it, but it isn't a good movie at all. The pre-climax scene is disturbing, but that doesn't make it scary at all. It seems more like one of those movies that seemed great on paper, but doesn't look good on the screen at all. The movie is about a podcaster named Wallace Bryton ( (Justin Long) who is a total jerk and has no regard for the audience he talks about in his podcast, but goes to Canada to interview the Kill Bill Kid who had a terrible accident. When the inital meeting doesn't turn out as expected, the podcaster finds a letter written by a mysterious adventurer who lives in the middle of nowhere in Canada. From there, the podcaster arrives to the mansion where the mysterious old man adventurer Howard Howe (Michael Parks)  talks about his stories and how he befriends a walrus. The old man is obsessed with everything about walruses. The podcaster drinks tea with the old man and soon realizes that his tea has been posioned. Then, flashbacks go to the happy days of Wallace and his beautiful girlfriend Ally Leon (Genesis Rodriguez) before all the torture begins. Rodriguez is the only good part of the movie. She plays a really great part.\r From there, the movie borrows everything from Misery to The Human Centipede. Nothing original happens which includes Wallace getting a surgery to get placed in a walrus suit. Wallace's girlfriend, friend Teddy Craft (Haley Joel Osment), and a funny Guy Lapointe homicide detective (Johnny Depp) start to investigate what happened to Wallace after he leaves a voicemail for his girlfriend. The movie switches back and forth between seeing Wallace in a very disturbing walrus suit and being tortured by Howard Howe then to the friend, girlfriend, and detective searching Canada for his last trails.\r The movie isn't enjoyable at all. It has funny parts, but it isn't worth watching. Kevin Smith is now living off of his name. If he wasn't famous, this movie would not be created at all. It is very disappointing. Unfortunately, there are supposed to be two more of these made as sequels. Hopefully, Smith chnages his mind. AVOID AT ALL COSTS! If this movie had been made in the 80s, it would be stratight to VHS and forgotten. Luckily, after this review I will forget about this movie. It didn't stick in my mind at all after I left. I didn't even stay after the movie to watch the live cast of Q&A between Justin Long and Kevin Smith live from Austin.\r Kevin Smith, like many directors before him, have reached a point in their career in which they have lost their creative touch and cannot make good movies anymore. I saw the movie last night and I heard one person clapping and the rest in shock about how bad the movie was."
    },
    {
      "rating": "3",
      "text": "I followed Kevin Smith's work on Tusk very closely as I listen to his pod-cast. I love his stuff, sure the guy has bad movies but most directors that have been in the business as long as he has have made at least one less-than-stellar film. So naturally I was excited to see what Kevin Smith did with this material. When him and Scott came up with the concept, I remember thinking it had potential to be a great horror-comedy if handled right.\r Unfortunately, this film was not handled right. There were numerous times where the film could have used another pair of eyes. And good on Kev for making something really independent, but that turns out to be a really bad thing for this in that Kevin must have missed some of the more major flaws in the film.\r Some of the acting is unbearable. There's one scene when Guy LaPointe and Michael Parks character have an interchange in a flashback and it was one the most annoying things I've seen this year and it felt like it went on forever. It felt like another segment of Movie 43. Like it belonged in that movie. It took a great actor and a great performer and made them absolutely repugnant. I had to leave the theater halfway through the scene and return when I heard it was over. And I know you probably think that I'm just the one guy who didn't think it was funny, but we had more walk outs in that scene that anything else I sat through this year.\r The pacing of the film was strange. It went from being incredibly interesting in the first 30 mins to a complete dead stop at Genesis Rodriguez's monologue. Good on the director for telling us what the back story is instead of showing us. The monologue goes on for a good 3-5 minutes and it's unbearably slow. She's a great actor, we get it. But we didn't need that long of a break from the main story.\r This movie suffers from something that a lot of horror movies suffer from now and I don't think people realize it's happening. Justin Long's character was not a great guy. He was kind of a jerk. So when he inevitably gets put in a walrus suit, guess who cared... No one. We were all kinda like...well good.\r On top of all that, the walrus suit is one of the most laughably bad designs I've seen in awhile. Props to Kevin for taking the practical route with it but it looked like a cheap Don Post Halloween mask only all over Justin Long's body. There's a moment near the end where Michael Parks hits Justin Longs walrus face and one of the tusks moves across his face as if it was attached to the suit and not his face. This was the only time I laughed in the film. Not to mention my laugh was the only laugh in the whole theater for the whole movie.\r I felt compelled to ask other audience members what they thought and as expected, there were tons of Kevin Smith fans in the audience. They all used the word disappointed. We were all sad. It's not just that the movie does things poorly intentionally but that it seems to not notice how horribly it was put together. It needed another edit, some shots needed re-shot, and it needed another draft badly. I'm very disappointed and I feel bad for hating this film. I wanted so bad to love it. I feel bad for Kevin. Good for him making the movie he wanted to make, but unfortunately that movie was a 3/10."
    },
    {
      "rating": "4",
      "text": "Oh, A24 Films, why did you do this to us? You pamper us with amazing and unique movies like Locke, Spring Breakers, Enemy, and Under the Skin, and then you give us this? Not only is this movie unoriginal and lazy, being derivative of The Human Centipede (which if that’s your starting off point, then you’re already kind of screwed), but it’s also tonally inconsistent and boring.\rIt starts out okay and has some kind of funny jabs at the Internet, and Justin Long is good (until he’s mutilated to no end) and the other members of the cast are okay. However, it’s so all over the place that it seems like Kevin Smith only did this movie because people on the Internet told him to. There’s nothing interesting happening, you don’t care what happens, and once you get past the 40-minute mark, it has such a jarring drop-off from being just okay to being awful, and from that point its only purpose is to be progressively more obnoxious, unfunny, disgusting, mean-spirited, and incoherent.\rIronically, the wacky “let’s do crazy stuff and then almost say how dumb it is” aspect is counterintuitive and makes the humor come off as cold and further adds to the tonal inconsistencies. The characters are archetypes and don’t really do anything interesting. The script is all over the place and only has enough material to fill 22 minutes, but the final results drags on for 102 minutes. The direction is lazy and annoying; there’s a scene that should honestly last for literally 30 seconds, but it instead goes on for five whole minutes just so they can fill time and say that they have Johnny Depp in their movie, who also does nothing and is totally wasted. There’s even a part where they cut back to a scene from earlier in the film and it isn’t even the exact same scene. It’s edited differently and has different sound mixing, and the result is slightly anachronistic.\rThe jokes about Canada work once and that’s within the first five minutes or so, and then they keep milking it over and over and over. This honestly began as a joke on Smith’s podcast, and you can totally tell because the filmmakers have no idea what the hell they’re doing or where they’re going. They have stopped caring, which is even further evident in the schlock (and shock) value, despite the fact that it’ll make you want to leave the theater.\rThey show the big visual reveal (this isn’t a spoiler because it’s be basis of the movie) which is Justin Long mutilated into a crudely-stitched walrus, and that’s all that the movie is building up to, and then it won’t end. They’re running on empty fuel. #WalrusYes should be been #WalrusHellNo, and we can only hope that the potential spin-off of this hot-ass mess doesn’t happen, because this one wasn’t funny, nor was it scary.\r3.8/10, really bad, two thumbs down, far below average, etc."
    },
    {
      "rating": "3",
      "text": "This film is a highlight of Kevin Smith's inability to direct a coherent movie from a singular, stupid idea. Smith's dark brand of humor is a tempting bait that fails to develop into a full fledged meal.\rThe movie begins on an aggravating note as Justin Long is established as the unlikable **** setting the foundation of the audience's apathy as his journey into Canada falls into disarray. His character remains undeveloped and unlikable throughout his short duration on the screen before being mitigated to a wordless roll. It is a pity, double fold, as he delivered a wonderful performance interplaying between an insufferable douchebag at the beginning of the film and a desperate and broken soul by the middle. The inverse and same can be said of Michael Parks who begins his screen time with an impeccable noir air and brilliant performance, only to fall into the black pit of poor writing and mitigated screen time.\rThe only \"character development\" occurs in prolonged depositions monologged to the audience without any action or exposition occurring between them. Each one of the these scenes will begin on an interesting note only to continue ad nauseam until the audience and actors have lost interest, and then they continue just a bit longer. The few scenes in which anything does occur are far and few between, and so often poorly executed as to wish for the terrible character deposition “conversations” anyway.\rAnd none of this is to address the terrible ending, the flat jokes, or the idiocy of the movie itself. I will end on this: I love movies with a twist, or ones that are willing to get weird, and this film does get weird, but when you are going to go all out - when you are going to put that dial on 11 - make sure it is not just white noise."
    },
    {
      "rating": "10",
      "text": "Ones and zeros?  Give me a break.  This movie was hilarious.  It's a perfect send-up of all the torture porn/gore flicks that we've been inundated with.  Perhaps this has gone over the heads of the reviewers here?  \"Now, we'll finally get the answer to the question that's been burning ever since we crawled out of the surf: Is man actually a walrus at heart?\"  If you go into this movie looking for anything other than Clerks/Dogma satire and subversion, just stay home.  It's more like an 8/10, but I'm attempting to balance two ridiculously pedantic reviews."
    },
    {
      "rating": "9",
      "text": "One of the most consistently funny movies throughout its entirety that has released in some time. The humour isn't dictated by gags or literal jokes but the actors reactions to situations. In addition, the universe of the film in more, if you will, rooted in the real world more so than most comedic films. What I mean by this is that despite its absolutely insane concept, generally everything about this movie is a \"serious\" world rather than, say the universe \"This Is The End\" takes place in. This contrast makes for a really interesting movie. You'd never know the budget is low as the dialogue takes it through the few sets perfectly.\r The writing is surprisingly great full of stellar monologues. The monologues were so solid that I was almost hoping for a Shakespearean aside at one moment (but never happened).\r I'd rate this an 8.5 which I rounded to a 9. A very refreshing and unique film. Do not expect any typical Hollywood plot tropes, especially when the ending comes."
    },
    {
      "rating": "4",
      "text": "While watching this movie, I couldn't figure it out: starts as a creepy thriller (with nods to \"Human Centipede), tosses in campy elements and features several extremely verbose rants (featuring an uncredited Johnny Depp in heavy disguise…again).  Then I discovered it was written/directed by Kevin Smith, which explains a lot. Justin Long plays a podcaster who travels to Manitoba and discovers a man with eloquent stories, only to find himself captive and turned into a walrus. This bizarre curiosity offers some fun, but lots of head-scratching. Ultimately, it's too self-indulgently talky and downright silly. NOTE: Stay thru the credits to hear Smith in the actual podcast that served as the inspiration AND to see Depp in one final gag."
    },
    {
      "rating": "7",
      "text": "One of Kevin Smith's best! Michael Parks was brilliant! I was really into it until the very end. That ending......I walked out kind of in disappointment, but then as my buddy and I started to digest it, it started growing on me. When you think of the ending in these terms: Kevin Smith was likely just sitting around planning this movie and I can envision him saying...\"How do we end this? You know what would be funny...?\" It is beautifully filmed as well. I'm stuck between a 7 and 8 out of 10...probably a 7, but the guilty pleasure side of me wants to scream EIGHT!"
    },
    {
      "rating": "7",
      "text": "This horror comedy works even when it goes to the absurd.  I am a Kevin Smith fan (minus Cop Out but I even like Jersey Girl) and this film has many of his normal traits.  I can see why this might not work for some especially after the big cameo, but I kind of dug this film even the big fight scene.  B+"
    },
    {
      "rating": "9",
      "text": "Kevin Smith's black comedy horror is a sly dig at torture porn and all the better for it. Genuinely unsettling, \"Tusk\" is a film that will stay with you for days. Highly effective and well worth watching.\r-1 for a dreadful Johnny Depp in a misguided cameo as an Inspector Clouseau/Lt Columbo mash up that almost derails the entire film."
    },
    {
      "rating": "10",
      "text": "An interesting coincidence occurred on the drive home from seeing this movie. I was listening to my local rock station, and the song “More Human than Human” by Rob Zombie came on. As I listened, I couldn’t help but feel the song was all too appropriate for the experience I’d just been through. Both pieces of work were twisted, unique, and contained a dark comic edge. Not to mention the incredibly apt title of the song, poignantly reflecting a central point of the film. It caused me to appreciate even more what was already an incredible and chilling experience brought on by one of my all-time favorite directors, the one and only Kevin Smith.\r Tusk follows the story of Wallace Bryton (Justin Long), who hosts the comedy podcast The Not-See Party with his best friend Teddy (Haley Joel Osment), in which they discuss weird and unique people. Wallace gets the ultimate opportunity when on a trip to Canada, he discovers an ad from a mysterious old man named Howard Howe (Michael Parks) offering free lodging in exchange for household chores, and promising to share stories of his wearied life. Wallace takes him up on the offer, but soon comes to discover that Howard is more than he appears. Before long, Wallace finds himself trapped and at the mercy of a man whose obsessions range from old-timey alcohol to…oh, let’s say, walruses.\r I find myself having to be rather elusive with my descriptions here, and it is for one simple reason: this is not a film to spoil. As I mentioned before, I am a big fan of Kevin Smith’s directing style. Clerks is one of my favorite films of all time due to its simplicity, its rejection of cinematic conventions, and its excellent script. These are all elements which Smith has mastered over the years with his comedies. Unfortunately, his previous horror outing, Red State, although heavily saturated with Smith’s various tropes, failed to draw me in thanks to lack of any sense of focus and a shameful waste of a very intriguing premise. When it came to Tusk, Smith vowed to fix the mistakes he made with Red State and create a proper, satisfying horror experience. Thankfully, he remained true to his word.\r I intentionally refused any trailers for this film before its release. I had heard the story of its conception, stemming from an ad Smith and longtime friend Scott Mosier had heard about and discussed on their show, SModcast, and which immediately sparked an idea for a film based on the ad. To me, this was enough exposition. I tend to avoid trailers in general nowadays, so that I can go into the film with a more open mind and give myself an element of surprise at things I otherwise may not have seen coming.\r With Tusk, I absolutely feel that this was the correct choice, as this is a film built entirely around tension. There is a phenomenal extended sequence early on in the film in which Howard, living up to his promises, is telling Wallace stories of his life, including a friendship with Ernest Hemingway. Michael Parks wears Kevin Smith’s dialogue like a champion and gives a delightful performance as he is relating these tales for what is probably five to ten minutes of screen time. The scene is just the two characters sitting in a room talking, accompanied by the occasional flashback; a simple premise, yet extremely effective. Then Howard begins to tell a story of being stranded at sea and being saved by, of all things, a walrus. This is when the tension kicks in, and after a good ten minutes at this point of hearing these two converse, it is a welcome addition to the emotion that has already built up. It is an expertly crafted scene to lead into the insanity that follows.\r Unfortunately, the best aspects of the film, I am choosing not to discuss in very much detail. All I can say is throughout the film, it is very heavily implied what climax the events are headed toward, and the final product does not disappoint one bit. The second half of this film shocked and disturbed me to my core. I sat in the theater, mouth agape, attempting to absorb what was being presented to me, and feeling as though I was failing. As previously mentioned, this is thanks to some of the best tension building I’ve seen in a film in quite some time. This is not to mention the terrific cast. Michael Parks, who was one of the only redeeming qualities regarding Red State, can go from a wise, wearied old man to a psychotic then back again instantaneously, as well as anything in between. The range is incredible. I am not normally a fan of Justin Long as an actor, and he does grate a bit early on, however he, too, shows a surprising amount of range and depth in this role. The supporting cast is commendable as well, including the out-of-left-field addition of Johnny Depp, of all people, as the film approaches its third act. At first Depp seems like an almost random insertion, but he immediately proves that he belongs with the rest of this twisted movie.\r Depp provides a comedic angle, something else this film does very well. It is classified as a horror-comedy, and although it leans far more toward horror, there is certainly a good amount of dark humor thrown into this. This allows Kevin Smith’s comedic tropes to shine through once again, although this time with a much more demented edge, which is simply wonderful.\r I cannot stress enough that there is a very good reason for me being so discreet with my descriptions of Tusk.  This was by far the most unique and unforgettable experience I’ve had thus far in a theater in 2014. I walked away from the film thoroughly disturbed, somewhat shivering, at the sights and emotions this film brings to life. This is a film that I believe will stick with me long after the fact, and may even enter the ranks of my favorite films ever made. To mix the Kevin Smith writing standards with one of the most twisted premises that could have been conjured up…the result is something purely one of a kind. I cannot recommend the film enough, although I must urge caution, as it is remarkably gruesome and graphic in its second half. For me, however, this was a haunting experience for which I thank Mr. Smith very much.\r Thanks for reading!"
    },
    {
      "rating": "10",
      "text": "This film is just, amazing. I think it is one of the best films I've seen in a long time, it has something most films don't. It doesn't take itself seriously, whilst it may appear this way to someone who doesn't know anything about Kevin Smith, but this is just amazing. After watching this film, I have decided that I do in fact, want to be turned into a walrus man, this film is going to help me live my dream"
    },
    {
      "rating": "9",
      "text": "This movie isn't for everyone. Though If you are a Kevin Smith fan or into B rated horror movies then you are in for an amazing treat. Kevin Smith spins a wonderful story of a man wanting to relive the one true friendship in his life that just so happened to be with a walrus.\r When you get down to it this movie was made because Kevin Smith fans wanted it. People are tired of seeing the same old Hollywood rehashes and remakes that they shove down our throats. Kevin Smith gives us something original a new idea in a see of the same old **** Yes the movie is ridiculous full of camp and satire. Yes it mocks horror tropes and heavily satires the internet culture. Yes you are going to see what Kevin Smith does best and brings the best out of actors.\r To all the people bashing this movie it was not made for you. You were not the audience and really have no right to judge it."
    },
    {
      "rating": "10",
      "text": "I thought that it was a funny, yet horrific torture movie, that will leave me terrified of walruses forever. With great acting and an original plot, Tusk brings out the best of Kevin Smith..in my opinion..."
    },
    {
      "rating": "8",
      "text": "There's some surprising depth underneath this weird as hell horror-comedy. Themes about humanity being the real monster and human cruelty can be found throughout. It can be hard to pick up on them though. Most of the time you're too busy being baffled by everything else that's happening onscreen.\r There are a lot of laughs to be had here. Some brought on by the genuine comedic bits, others are born out of the fact that all you can do is laugh at the insane crap happening. Laugh or get grossed out. There are a few bits of gross-out horror to be found here. The rest is about the human monster.\r It's a weird vision. One that isn't going to hook everyone. Given how easy it is to overlook the deeper themes running in the background, it's one that probably holds up better on a second watch. The first watch though, is still a crazy, entertaining ride. A ride that succeeds thanks to craziness and originality."
    },
    {
      "rating": "7",
      "text": "A true oddity if ever there was one. A young podcast presenter visits Canada and ends up talking to an old man that says he has stories that the guy will find hard to believe. One involves his encounter with a walrus and his wish to rekindle the friendship. What happens next is funny, horrific and original. Maybe too talky for some looking for all out horror, but for those looking for something miles away from the mainstream this is right up your street"
    },
    {
      "rating": "8",
      "text": "I have such mixed feelings, the internal conflicts still clash, hours later. I intensely disliked the main character, in equal parts for his character and him being such an awful actor. Maybe it's just the strange place I'm in myself. In spite of it's flaws, I quite liked it."
    },
    {
      "rating": "8",
      "text": "I don't pretend to be a film critic, but I will give a layman's review of how I reacted to the movie.  Overall I liked the movie and was entertained by it. It was a smart movie. It succeeds at being both funny and scary...up to a point. Michael Parks was GREAT. He basically made the movie an 8. Without giving anything away, at the point when we see Mr. Parks' finished masterpiece the movie lost steam for me.  I loved it until that point, when it went from being horror to absurdity. Unfortunately I was also aware that the inspector was being played by Johnny Depp, so that was distracting - I would have liked to have seen somebody in that role as entertaining as Mr. Parks was in his."
    },
    {
      "rating": "2",
      "text": "I like Kevin Smith, I like most of his movies, and horror is my favorite genre.  That's the only reason I gave this a 2 instead of a 0.  It is easily one of the worst movies I have seen in the last couple years.  The kevin smith fan boys that will never say anyting bad about him will try and tell you all kinds of BS about how this is a tongue in cheek jab at horror/torture porn and how subtle and witty it is.  It is none of that, it is simply a poorly executed movie in every way.\rKevin Smith has clearly lost his touch, he is becoming like an old punch drunk boxer still looking for a payday years past his prime.  Avoid this movie!!!!!!!"
    },
    {
      "rating": "8",
      "text": "I didn't had expectations when the movie started.The story is original and weird the makeup for the walrus are amazing and he acting is really good.The movie is disturbing only when Justin Long's character start to change.Unfortunately the movie is not so funny and the main theme is stupid,plus it's a pretty slow movie."
    },
    {
      "rating": "5",
      "text": "its an ok movie. i think some scenes dragged on, and typically this would have been better as a short. the script was great, justin longs character was ok. the makeup was ok too. glad to hear fleetwood macs song in the film."
    },
    {
      "rating": "7",
      "text": "It is terrific, and it is absolutely one of the scariest and one of the most disturbing movies of 2014. \"Tusk\", directed by Kevin Smith (Red State), is a must see for horror fans."
    },
    {
      "rating": "10",
      "text": "This is one of the most unique films you'll come across, how it started is so cool on Smodcast #259 on June 25, 2013, and being a Kevin Smith fan since Clerks led me to this podcast that introduced Tusk's plot synopsis (in which of course was a rant/joke). And now it's on of my favourite Kevin Smith films to date after 2011's Red State also with Michael Parks, he is one of those actors that can entice you very easily by telling a story. Props to Kevin Smith and the Crew! Also Johnny Depp is amazing as always, i absolutely loved his character!"
    },
    {
      "rating": "3",
      "text": "Tusk was a disturbing mess, started clean with an intriguing first act, I set my hopes high. Boy was I in for disappointment, the film eventually faded into a dark comedy with vile humor and desperate search for story, Tusk had me thinking to myself what in the world have I just seen. If the film-makers were serious about creating an uncomfortable plot so full of disgust they should have left it to Tom Six. Sorry Kevin Smith."
    },
    {
      "rating": "2",
      "text": "Jaw-droppingly bad, which is kind of surprising because there are many ways that it could have been at least decent. An engrossing performance by Michael Parks is wasted."
    },
    {
      "rating": "3",
      "text": "This movie is just weird. It's overwritten, overacted and full of offensive Canadian stereotypes. It does have its funny moments, but one can't help but think that Kevin Smith totally missed the mark with this one. Even Johnny Depp, who gives a bizarre interpretation of a French Canadian detective doesn't use his name in the credits. It's just a disappointing film all the way around. It does have good make-up effects though."
    },
    {
      "rating": "10",
      "text": "If you didn't like the movie, you may just not be clever enough. it was a strange ride down through this mountain of Black-comedic-gold that left me wondering if what I saw was genius or stupidity with a hint of clout.\rThis movie impressed me for several reasons most Kevin Smith is now the bravest man in Hollywood and all of you will benefit from having such an individual in the mainstream, it means...WE CAN LIKE MOVIES AGAIN!!!! it means that imagination isn't being put on the back-burner it means...\rI'm proud to live in the era of Kevin Smith."
    },
    {
      "rating": "0",
      "text": "Esta película es un verdadero asco, no porque la historia sea mala o esté mal actuada, sino por lo grotesca y bizarra que resulta a la vista, primera y última vez que la veo."
    },
    {
      "rating": "8",
      "text": "Tusk: This isn't Smith's best, but it is definitely on the right track. Starring: Michael Lewis. Justin Long.  Haley Joel Osment. Directed by Kevin Smith. By Blake Patterson. 80/100.    Fans of Kevin Smith, like myself, probably watched or recoiled from his horror comedy, \"Tusk.\"  \"Tusk\" is the strangest film of the century, and that's a compliment to Smith. Smith created a film that is fantastic at being eerie; it's more peculiar than Tim Burton's adaptation of \"Miss Peregrine's Home for Peculiar Children.\" The motion picture follows an egotistical podcaster, Justin Long achieves a different kind of role, that travels to Canada, and gets in contact with a bombastic senior citizen, the late Michael Parks is creepily hilarious, that is hiding morbidly bizarre secrets. People might know this film as the story about the guy that is transformed into a walrus; the sight of it will make viewers gasp.  This movie steals elements from \"Misery,\" \"Frankenstein,\" and other films. For the humor, the jokes are hits and misses, but the hits benefit some audience members.  By the way, I should mention that a famous actor portrays an unsophisticated detective named Guy Lapointe; the actor's initials are \"JD.\" In conclusion, Kevin Smith's talent isn't gone."
    },
    {
      "rating": "5",
      "text": "This movie was actually pretty interesting, up until Johnny Depp shows up. I'm not certain why they had to introduce him, and it seems like he was high or drunk the entire time. Unfortunately he probably had a contract that required they use him and make him an integral character, which is too bad, because all of the other actors far outshine him, and the other characters are much more interesting than his. I might have been willing to recommend this movie if it wasn't for him. As it is, I'd say only check this out if you have the same morbid curiosity that I did, because it is a decent horror movie otherwise."
    },
    {
      "rating": "6",
      "text": "Tusk is frankly just ... weird. Slightly less disturbing than The Human Centipede, it is the oddest movie made by Kevin Smith, and he's made some real odd ones (mostly in comedy). Part satire, party body horror, and part philosophical introspective on ... I'm honestly not sure ... as when it goes the way of the walrus, all bets are off."
    },
    {
      "rating": "4",
      "text": "Odd...disturbing...so so acting...had to force myself to stay.\r I saw this movie listed...and gave it second look because 1) Kevin Smith directed and I generally really enjoy his stuff and 2) I saw one of those preview shows on tv and watching the actors talk about...got me more interested.\r Overall, I couldn't recommend this movie to anyone.  The acting is wooden.  Even the lead who played in Kill Bill was dull.  Script was flowery...words I could see would be killer if delivered the right way..but was just boring to me.  I wouldn't call it a horror movie...because my reaction was not \"scared\"...but disturbed.  And not by the message or story...but the images.  I got physically ill at some points.\r Still I stuck it out...wanted to see how it ended up.  Second half did pick up my interest. And in my seat.\r So I\"m not panning it...or saying he did a bad job.  Any film is a massive undertaking...and the other reviewers saw some things I didn't.\r So it  1) Made an impression...but not a good one.  And 2) If you like Smith, might be worth seeing.\r But overall I wish I never went to it.  Only because the final scenes burned images into my brain I hope go away.  That part worked.\r Thanks Kevin!"
    },
    {
      "rating": "5",
      "text": "The movie is ridiculous in all aspects but it's not meant to be taken seriously. The actors all put on good performances and even in the most sinister and sickly situations, they still manage to bring humor out of it. The movie manages to pull jokes throughout but they're far between, and most of it is in the first half. All-around, just a silly movie that brings some laughs and evokes some gags.\r If you're a fan of Kevin Smith, or silly horrors, I guess I would suggest this film for a rent. Otherwise, I think its worth passing up."
    },
    {
      "rating": "5",
      "text": "Wallace Bryton: \"I don't wanna die in Canada!\".\r The story to Tusk is about a young man goes searching for his best friend, and podcast co-host, after he goes missing in the backwoods of Canada, along with his friend's girlfriend.\r Tusk was a movie that I never heard of until last week when I got a chance to watch it. But before seeing it I heard a lot of mix reviews for this movie, some people say it's like a guilty pleasure to them and they had a good time with the film, but with other people who said the movie is laughably bad and nothing to it.\r In my opinion Tusk is a okay movie and I was actually surprised that I didn't laugh as much as I thought I would, but there are some scenes that made me laugh a little bit like Justin Long character (Wallace) start's to scream for help and the mad man who's turning Wallace into a Walrus played by Michael Parks, he start's to make a weird but funny scream while pulling a mad face, that scene was pretty funny.\r Kevin Smith as a film director can make good, okay and really bad movies during his career. Dogma was brilliant, Zack and Miri Make a Porno was descent flick and Tusk falls into the okay pile.\r Justin Long's did a good job in this movie, not fantastic, just good. His character is supposed to be a big douche bag, but even a douche bag in real life wouldn't be like this guy, because Justin Long made his character so unlikable and so stuck up at the beginning that I truly didn't care for him, until the end where I didn't hate him as much and I think that's what the movie was going for.\r Michael Parks did great in this film playing the insane person who's obsessed with walrus, and he got all the craziness and the comfortableness in just one character. Haley Joel Osment also was good in the movie, just like Justin not great just good.\r The movie itself and I'm not joking around here but it's actually pretty enjoyable, you don't see much of the gore just the after math, like one of his body part will have been removed and judging by the way it's been cut off or removed it looks extremely painfully and a lot of hard work.\r The movie has a lot of problems like the film is trying to be it's so bad that it's funny but it really didn't work for me, because the writing is amazingly mix for me and it's very usual for me to say that. The comedy wasn't funny at all and it just left me into silence, until that weird but funny scream while pulling a mad face scene was pretty funny. The all movie should have been a shock fest kind of film and I normally don't request a horror movie to do that, but a story like this is like a shock fest film that never got the big picture.\r Johnny Depp french accident in this movie was just god awful and to be honest he should have been cut out of the film. I like Johnny Depp as a person and as a actor but this wasn't his movie to shine in.\r Overall Tusk is okay film, but I wouldn't really recommend it but if you're the kind of person who likes to watch stupid horror flicks like this then go ahead."
    },
    {
      "rating": "4",
      "text": "The slowest movie I've ever seen, so many long meaningless conversations that make you feel sleepy. Actually I like the story and it could be a great movie if only written and directed professionally."
    },
    {
      "rating": "3",
      "text": "This movie is absolute unwatchable **** It is the most self indulgent piece of **** I've ever seen. In my opinion Kevin Smith was never really some master visionary and director but, Tusk really re-enforces my stance. The first 30 minutes of this movie were completely fine. Nothing really exceptionally good, they were kind of annoying but, relatively inoffensive on a film making sense. After the first flashback the movie devolves into trash. It has maybe 35~40 minutes of actual story and about 1 hour of nonsense. All of the acting is terrible, the writing sucks, it all sucks. Had it not been for the first 30 minutes of mediocrity, I would've given this movie a 1/10. If it hadn't been for the 60 minutes of bull****, I would've given this movie a 5/10, so I figure I should meet somewhere in the middle."
    },
    {
      "rating": "0",
      "text": "Ez a film borzalmas és szomorú, hogy elkészült. Kb. 3500 filmet láttam eddig, de ezt kár volt megnéznem. Ha végignézed a filmet, akkor csak egy kérdésed van: \"MIÉRT?\""
    },
    {
      "rating": "1",
      "text": "When I decided to watch this movie I was very curious. I thought it was a horror movie or a thriller, but I was very disappointed in what I saw. The film is original, even bizarre, but it cannot in fact be considered a horror movie, and anyone who does it must be deeply easy to scare. It doesn't scare anyone, although its provocative and has strong scenes. The script is based on a podcaster's trip to Canada, where he meets an old sailor who is actually a psychopath obsessed with walruses. But the biggest problem is that the film seems only interested in provoking, not in accomplishing something. It's not a comedy, it's not a horror movie, it could never be a thriller because we can predict everything that will happen with great ease... I just don't know how to rate this movie.Kevin Smith is far from a good director and this film only served to solidify the certainty that he doesn't deserve to be taken seriously. The construction of the script fails in many ways, none of the characters goes beyond the caricature, the performance of the actors is also a caricature of themselves. The only exception is Michael Parks who, with a generally good and somewhat serious interpretation, prevented the film from completely sinking in the mud and didn't allowed me to give up watching it. About Johnny Depp ... I'm just not surprised to see him here because he's gotten used to expecting anything from him."
    },
    {
      "rating": "5",
      "text": "i want to love this movie but the problem is that there are a lot of scenes where it appears like no one was trying, but also there are pretty great scenes so this is just frustrating for me"
    },
    {
      "rating": "2",
      "text": "Not funny, not scary, and the gore part was so stupid and silly it wasn't gore.  Canadians should be angry for being connected to this film in any way.  I gave this movie a 2 because I watched it through for some reason.  Kevin Smith shouldn't be allowed to create anymore movies, yet he somehow created a trilogy from this movie?"
    },
    {
      "rating": "1",
      "text": "What a shame that a talented artist like Kevin Smith sometimes writes bad films.If the idea can be interesting for an episode of a series, it is not for a whole movie.Everything is extremely sad: dialogues, performance, photography.Johnny Depp... what happened to Johnny Depp?"
    },
    {
      "rating": "0",
      "text": "This is by far the worst film I've ever seen. AI went into this film hopeful, as I do like kevin smith. I was subsequently disappointed and then revolted at what I watched. It was as if someone made a movie about a terrible inside joke. Which is actually pretty much what happened. I have lost most of my respect for kevin smith. Dont watch this movie."
    }
  ],
  "recommendations": [
    "the_hangover_part_ii",
    "burn_after_reading",
    "thor_love_and_thunder",
    "seven_psychopaths",
    "hancock",
    "logan_lucky",
    "inherent_vice",
    "the_hangover_part_iii",
    "lucky_number_slevin",
    "next",
    "baywatch",
    "the_cobbler",
    "this_is_the_end",
    "old",
    "awake",
    "the_babysitter",
    "night_at_the_museum_battle_of_the_smithsonian",
    "terminator_genisys",
    "the_guardian",
    "house_at_the_end_of_the_street",
    "identity_thief",
    "venom_let_there_be_carnage",
    "the_number_23",
    "the_loft",
    "kingsman_the_golden_circle"
  ]
}