{"id": 2379, "title": "Twelve Monkeys", "starring": ["Bruce Willis", "Madeleine Stowe"], "runtime": 129, "genre": ["Science Fiction", "Thriller", "Mystery"], "description": "In the year 2035, convict James Cole reluctantly volunteers to be sent back in time to discover the origin of a deadly virus that wiped out nearly all of the earth's population and forced the survivors into underground communities. But when Cole is mistakenly sent to 1990 instead of 1996, he's arrested and locked up in a mental hospital. There he meets psychiatrist Dr. Kathryn Railly, and patient Jeffrey Goines, the son of a famous virus expert, who may hold the key to the mysterious rogue group, the Army of the 12 Monkeys, thought to be responsible for unleashing the killer disease.", "releaseYear": "1995", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/gt3iyguaCIw8DpQZI1LIN5TohM2.jpg", "categories": {"plot": 8.392857142857142, "acting": 7.625, "ending": 8.3, "soundtrack": 7.0, "cinematography": 6.0, "familyFriendly": 3.0, "funny": 8.5, "action": 5.0}, "reviews": [{"rating": "10", "text": "Since I see most reviews are spot on here, I will simply say \"ditto\".ALSO, another in a long line of my favorite movies that require you to THINK! (A lost concept in movie making).  IT IS BRILLIANT!!!"}, {"rating": "10", "text": "This movie is amazing. It leaves your mind in a twist wondering what happened. Great acting by Bruce Willis. Great directing. But the best part is the story line! Truly original. It shows the flaws in time travel very very well!"}, {"rating": "10", "text": "12 Monkeys is the 2nd best science fiction;  #1 being Bladerunner.  A highly imaginative movie with a heart crushing ending.  This will be around my 6th watching through and you notice something new every time.  For example, this time I noticed that each inmate in the future had plastic pouch stapled to their prisoner uniform shirt, for identification."}, {"rating": "10", "text": "Gilliams best work.  Stow and Willis are awesome as well.  Love the cinematography.  Might take a few viewings to really fully grasp and appreciate it.  One of my favorite movies."}, {"rating": "9", "text": "A very touching and thought-provoking film surprisingly made by Terry Gilliam, one of the people behind Monty Python. The insight and themes surrounding this brilliant science-fiction film have depicted that somehow we ourselves are unsure of what is real and what is not. Each actor has their own creative part to play, and despite what you may think, with all the life-threatening and time-travel twists to get your head around, it will end up having a real impact on you, thinking about the real issues that are actually quite close to home."}, {"rating": "10", "text": "I love this film, its artistic enough to be slightly confusing and has fantastic visuals and eerie music. A note to Max P...if its too confusing then, you just aren't bright enough to understand it. And really, its not hard to understand at all. Not if you watch it all the way through."}, {"rating": "10", "text": "Magnificent work, who initially argued that we can not change the future. Frightening ...\rMagnífica obra, que desde un principio nos plantea que no es posible cambiar el futuro. Atemorizante..."}, {"rating": "9", "text": "This movie is one of Gilliam's best, and it won't leave your brain bored. Brilliant performances by Bruce Willis and one of the best performances of Brad Pitt in his acting career. Great movie."}, {"rating": "9", "text": "This is one thought provoking, disturbing, and ingeniously constructed film.  It may have even inspired Looper, but I found this film both superior in style and plot.  Terry Gilliam always creates strange, disorienting worlds.  When I first saw Brazil I really didn't like it at all, but I might have to watch it again after viewing 12 Monkeys.  The performances are all incredibly convincing and strange.  Willis gives perhaps his most mortal and desperate performance, and Pitt goes full retard as a crazy animal rights activist, showing that he possesses an acting range which I thought he lacked.  I don't want to spoil things, so I'll just say that the plot needs to be paid close attention to at all times and it will definitely keep you on your toes.  If you're a fan of sci-fi or mindbender films at all then you need to see this creepy and unique vision."}, {"rating": "8", "text": "I love this movie so much and I can't even explain why.\r Like, there's so much going on but it's not a mess, it's all in its place.\r All in all, something refreshing."}, {"rating": "10", "text": "\"12 Monkeys\" is a modern classic, inspired loosely by Chris Marker's \"La Jetee,\" but taking the concepts therein to a new level. This is Gilliam's second-best movie, after \"Brazil,\" but it's still head and shoulders above 90% of the stuff out there. A thought-provoking script, fine acting, wonderful visuals ... \"12 Monkeys\" has it all."}, {"rating": "10", "text": "When 12 Monkeys was released, it was hyped as: 'Bruce Willis is in a madhouse! Is he really crazy?' Buzz was mostly negative, but with a few enthusiastic endorsements. Since that is usually the sign of crap-- the rare endorsement almost always a shilly affair-- I stayed away. Well, I just watched this movie because it was a monthly freebie on digital cable. I'm here to say that 12 Monkeys is a fine movie, and I really enjoyed it. Most 'good' thrillers and time-travel films have clues that you need to look for on the second viewing if you want to know what happened, if you really want to find out why the film was 'good'. Or, the 'good' film shows you directly, in a big reveal, so that no explanations are necessary for anyone with an IQ over 80. 12 Monkeys, however, if you are intelligent, puts everything right in front of the (observant) viewer's face and doesn't play any tricks; there's no filmmaker dishonesty or bait and switch involved, which is incredibly refreshing. Willis and Stowe are quite good together; their growing intimacy is convincing, and their relationship becomes the non-cheesy center of a sci-fi time-travel film. (Not to sound too creepy, but the many close-ups of Stowe's lovely face were not at all unpleasant; her transformation from concerned psychiatric professional to a modern Cassandra with her hair down is a real pleasure to watch.) The film's major, glaring flaw is Brad Pitt, who is so over-the-top and verbose in his role as a certifiable ingrate gazillionaire scientist's son, that one wonders how much better a film it would have been without him. His manic and too-clever by-half exposition doesn't seem to disturb Willis, yet Willis (apparently like Gilliam) could not reign him in. Art direction of 'the future' is where 12 Monkeys seems most like a Gilliam film-- the environment of the survivors on a post-apocalyptic Earth looks something like something from Time Bandits, with modern technology apparently cobbled out of chain-link fencing, old TVs, 50s-era medical instruments and the guts of grandfather clocks. Willis' performance is weakest after his transformation (which I won't spoil); he is simply too contrite; a lighter touch would have been much more powerful. Anyway, this review is getting long. If you've always thought of 12 Monkeys as a cheap sci-fi thriller starring Bruce Willis that nobody really remembers or cares much about, I suggest that you watch it. I promise that you will be pleasantly surprised."}, {"rating": "10", "text": "An endlessly entertaining, head-twisting sci-fi time travel tale directed by the great Terry Gilliam so everything is off-kilter.  Bruce Willis' and Brad Pitt's best career performances.  Truly amazing ending.  One of my favorite movies ever."}, {"rating": "10", "text": "Great story with some twists and incredible performance by Brad Pitt as a weirdo."}, {"rating": "9", "text": "Twelve Monkeys was a great movie. Brad Pitt was so great as a psycho, you'd think that's what he is in real life. The movie seemed pretty realistic too. The whole disease scenario spreading worldwide."}, {"rating": "9", "text": "Biohazard sci-fi drama of an futile try for change story and prevent an catastrophe that wipe humanity of earth, all with bitter results. Terry Gilliam knew the best to make Bruce Willis doing a role quite different that used."}, {"rating": "10", "text": "gut ........................................................................................................................................................."}, {"rating": "8", "text": "Twelve Monkey is a very good, albeit kinda surreal and also *very* 90s movie, which I don't generally discredit as being bad, the hilarious vision of the future with dutch angles and evil/genius scientists in transparent robes, robs some the movies' legitimacy, though. I still very much recommend it, though, because its well written, Brad Pitt actually plays a character that isn't just himself for once, and the end also comes together pretty well."}, {"rating": "10", "text": "Ah, I just love a good non-linear film, and 12 Monkeys satisfies that craving to the fullest. Bruce Willis is unsettling and crazy in all the right ways, and Brad Pitt is neurotic in all the best ways. There's no fairytale world in this movie; just a great big messed up fantasy. To decipher what's real, what's fake, what's in the past, what's in the future could take forever, in fact, it might even be impossible. This is the great mystery of this film."}, {"rating": "4", "text": "Maybe if I saw this movie 10 years ago, I would appreciate it more, but the time travel philosophy in this movie was absolutely pointless. Everything was very predictable, nothing intriguing and wow factor that hits you. And when it does in the last 10 min, you realize the absurdity of the movie. It's just another time travel paradox, an endless cycle of trying to change the future, yet whatever you do, that exact future is coming. The movie touches upon parallel universes at least unlike Back To The Future, but the looping cycle is flawed. I really like time travel movies, and so I thought this movie had a complex, fresh, imaginative, thought on time travel, but yet it's nothing you haven't thought about. I did like the psychological part of time travelling however, and the acting was well, mostly by Brad."}, {"rating": "2", "text": "This film was both too confusing and broing and as for the ending, its a joke, pathetic. if you are going to find out who the killer is then make it a big character not some ginger haired idiot.....A failure for Gilliam, on a kinder note the only reason i give this a 2 is for Brad Pitts unbelievable acting, his best peice to date, too bad the movie was rubbish!"}, {"rating": "10", "text": "Thought provoking."}, {"rating": "5", "text": "An impressing achievement of filmmaking for Mr Gilliam, as well as very cool acting by Brad Pitt. there are some people who will find this clever \"complex\" and just totally a good film all around. i am definately not one of them. i found it confusing, sadly boring - and yes - a bit too long. i ended up feeling dizzy with a headache at the end. Despite this, there are some aspects of the film i felt intrigued by, such as in the beginning with Bruce walking around in the suit, or Pitt dressed in the tux in the fancy mansion watching Bruces character run off - it was cool to with the scientist scenes talking to bruce. as the film progresses, i felt it lacked entertainment for my taste. i am completely mixed opinioned on this movie. The Mental Hospital scenes were cool, but Mr Pitts last few scenes dragged in ultra dialogy nonsense that just gave me a headache. Sorry Mr Gilliam, your a good director, but 12 monkeys isn't my cup of tea."}, {"rating": "7", "text": "I loved this movie up until the unsatisfactory ending. It's not bad at all, it's just not what I wanted. Willis' acting is completely natural in this movie for how out-of-place his character is. Brad Pitt is excellent in his role, he nails it perfectly. The music is mainly just reconstructions of the hypnotically enticing theme to the film, but overall is silent aside from a few classic songs. The plot is a bit confusing at times, but if you can get your head wrapped around the idea of it, it's really interesting. I recommend it for people who like Sci-Fi as well as good thrillers. Check it out."}, {"rating": "6", "text": "was a good film really enjoyed it i loved allot of things about it i loved the cinematography and the ending would highly reccomend ''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''''"}, {"rating": "5", "text": "these ratings baffle me all the time, it's like i'm watching a different movie,\rand here i say it, the movie wasn't that good, twist endings and mystery are my favorite genre so i know what i'm talking about.\ryeah it's a movie about time travel but it's doesn't offer a new idea or a new sight or objective, which means it doesn't use the time travel to it's benefit, and the movie doesn't look good, the screen was dark, it was actually too dark that i've seen movies done in the 80's that's better than this.\ryeah the movie keep you guessing and deciphering and offers a questionable ending, i get it ok,\rbut don't overrated any movie because it left you baffled, think about this way, it's not enjoyable, didn't bring a new thing to the table and more importantly the screen was terrible."}, {"rating": "5", "text": "Honestly I was expecting something else. It seemed like a movie more interesting and more exciting. Honestly, I like Sci-Fi movies like, but it disappointed me ... The only thing that I liked are the actors performances ..."}, {"rating": "8", "text": "A busy film designed to make you think whilst also developing the future. Twelve Monkeys is certainly ahead of its time and the influence can be seen on mind bending films today. The usual Gilliam techniques are used on a script that potentially was designed for a very different vision however it is Gilliam's uniqueness that makes this film stand out, let alone the fact that the cast members wanted to work with him whatever the cost. In most cases that was for very little. Gilliam's style combined with the solid a-list cast and performances make the potentially messy plot become overlooked. The absurdity of the narrative makes for intrigue and works with the time-jumping story telling. In hindsight it is definitely the perfect script for a director such as Gilliam. The score can feel out of place, the emotional development of the two leads relationship doesn't feel deep enough and there is a slight lull in the middle however this is a film that must be seen to see classy performances from actors at the start of long careers and a narrative that leaves questions open for you to answer yourself on either a second viewing or in discussion down the local."}, {"rating": "9", "text": "I'm rating this movie a nine because at the time of release, it was definitely one of the cleverest movies made. Yes it was a little too long and over-pedantic, but all the actors put a good shift in. Great movie, Empire magazine also agrees with me."}, {"rating": "10", "text": "Thoroughly enjoyable time travel movie."}, {"rating": "10", "text": "Undoubtably the best time travel film I've ever seen. Highly enjoyable."}, {"rating": "8", "text": "The best time travel movie i have ever seen. very interesting, well acted, and an overall entertaining and good movie. Pick it up."}, {"rating": "10", "text": "Top movie definately in my top 20. Well acted, well directed and an interesting and well told stoy."}, {"rating": "8", "text": "This was science fiction time travel at its best.  I am not a fan of Brad Pitt but he portrayed a mentally ill man very well.  Bruce Willis is also not one of my favorite actors but he also did a great job as a reluctant pawn of scientists.  Great plot."}, {"rating": "10", "text": "As a 56 yr old I really enjoyed this movie when it came out and now.  Clever people making clever movies is a joy to see.  In this day of coming climate change and the very real chance our grandchildren will see a much different world than the sanctuary we presently enjoy this 1996 movie raises interesting dramatic points for the 2011 audiences."}, {"rating": "8", "text": "Following the release of a deadly virus that killed the vast majority of the human race, the few survivors are forced to live underground. Many years later, a prisoner named James Cole is chosen to go back in time to find the original virus and help scientists develop a cure.    Twelve Monkeys can occasionally be a little hard to follow, but the excellent performances, great production design and plot full of twists and turns results in a great sci-fi movie."}, {"rating": "9", "text": "One of my favourite time-travelling based sci-fi movies (Together with \"Back to the future\" being the funny approach); with a very catching end (a \"real\" end, considering many actual movie endings which are more like \"stop filming, because time is up\")"}, {"rating": "8", "text": "just recently had the chance to watch this movie. This was an awesome time travel movie, especially the conclusion. The actors have also done justice to their roles. Altogether a neatly put sci-fi thriller"}, {"rating": "8", "text": "Twelve Monkeys is a little hard to understand at first, but once it got into it, it became a great mind bending science fiction thriller that was complex, sure, but was not overly complicated when it came to figuring out what exactly was happening. The science fiction elements are great and really thought provoking about what we consider to be insanity. In addition, Brad Pitt was absolutely fantastic. He killed his role here and really stole the show, not to say that Madeline Stowe or Bruce Willis were not good, because they were. This one certainly keeps you guessing until the end and really sinks its hooks deep into you and does not let go until the film is over. The only thing about this one is that I saw in some places that it is considered a satire, though I never really found it funny. Sure, Pitt's over the top performance is at times funny, but for the most part, that is about it. But, aside from that small confusion for me, Twelve Monkeys is a very good film that shows Terry Gilliam's mastery of the science fiction genre."}, {"rating": "8", "text": "Good thought-provoking movie that continues to be relevant even after all these years.\rStory is outstanding, Bruce Willis and Brad Pitt amp it up a level. Every other character is forgettable though. I especially love the crazy Brad Pitt scenes. The ending still leaves me questioning what exactly happened, although after a few explanations on IMDB, you can figure out the plot. Reminded me of Memento (style of video) and Fight Club (twisting plot)\rIn summary, rent or watch on Netflix before you buy. I would buy it if you like Sci-Fi and time travel movies. This is Bruce Willis' better time travel movie (Looper being the lesser of the two)."}, {"rating": "6", "text": "Despite its frustratingly disappointing ending, \"Twelve Monkeys\" still holds itself up with some solid twists and aesthetic brilliance all throughout."}, {"rating": "6", "text": "12 monkeys is an average sci-fi time travel plot featuring an exceptional cast. The highly stylised production fails to excel in the over saturated genre with its mediocre screenplay and cinematography. There are some interesting concepts at play, and as much as I liked some of the reality bending stuff this is no vanilla sky. Just as it feels like it's pushing past the boundaries of mediocrity, it trips up on its own heels into 90's silliness instead."}, {"rating": "8", "text": "I really enjoyed this film, like the naive me usualy does, even although it's sad that 5 billion people die at the ending. This review must be longer there you go 150 characters."}, {"rating": "5", "text": "The movie had an interesting original idea with believable characters.The acting was overall pretty good and the movie was well made but,the movie was pretty long for nothing and it gets boring pretty fast."}, {"rating": "10", "text": "This movie is insanely good, and is easily worthy of a crown fit for kings. Before I will try to explain just why this movie is so horribly good I just want to say that I don't often enjoy a movie as much as this one. Movies like Star Wars, The Matrix and Back to the Future pale and shudder in comparison to this heavily underrated star among filmmaking. Those movies were good, certainly, but not executed as flawlessly as this one. For this title alone Terry Gilliam should be raised above and beyond other directors. The only movies I have enjoyed as much as this one have to be Scarface and Pulp Fiction. I honestly don't know why everyone agrees that those movies are masterworks, but doesn't put 12 Monkeys besides them on a pedestal. This movie is more than worth it.\r Why is this movie so damn good? Well first of all it is slow. I like slow movies. When bits go flying from one end of the screen to another you must make sure to have build up a lot of tension before doing so, or the bits flying won't have any impact whatsoever. This movie builds up to a lot. The entire movie is basically build-up, and that's the way I like it. The ending felt appropriately heavy and important.\r The movie is also very smart. The plot is interesting, the little bits and pieces of social commentary scattered around are always welcome, and the overall premise requires attention. Perhaps this is why it isn't on any must-watch list, but for me the amount of intelligence this film needs was perfect. For the entire duration of the movie I was trying to figure out what everything meant and how the story was going to end. It had me completely gripped in thought about this movie, I did not once stop to wonder about anything else. That is sheer brilliance in my book.\r I also loved the way the story changed completely for maybe 4-5 times. It makes sure things stay interesting. The way this movie works with bringing things you have seen before back, but with some more general info, is the best. It just is. It doesn't dumb down to explain things to you either, it expects you to be smart enough to recognize it yourself, and link it back to the story yourself too. The story requires you to pay attention and think about it, an art that is lost in popular movie-making. It is gripping, more so than any film I have ever seen.\r And the general setting of this movie (usually in places with insane people) just works for me. It's a personal preference, but I love this movie for the same reason I love the original Terminator: the setting, both of the future and the present, is completely perfect. And Brad Pitt isn't usually my favourite actor, but he was perfect here. And so was Bruce Willis. Even the casting was top notch.\r Straight out 10 out of 10, could not find a single damn flaw. No-one can ever do this kind of movie better than this."}, {"rating": "9", "text": "12 Monkeys is a great movie of the 1990s. One of Bred Pitts best roles. Great pseudo thriller. The plot really fascinates and has a double end. Good acting and unusual post-apocalypse. I advise everyone to view."}, {"rating": "7", "text": "90s science fiction classic by Terry Gilliam with fantastic performances by Bruce Willis and Brad Pitt. You can't go wrong with that."}, {"rating": "9", "text": "A superb intrigue and well written/executed movie. The actors are shining in this one. But thats the kind of movie you can only really see once when you know the plot. But it's totally worth it.A must see."}, {"rating": "6", "text": "The movie is interesting but also very boring at parts. It was very confusing at parts for me which made it less enjoyable."}, {"rating": "10", "text": "Es una de las mejores películas de ciencia ficción en la historia del cine; es tensa, dramática y la actuación de Bruce Willis es grandiosa."}], "recommendations": ["looper", "the_prestige", "glass", "edge_of_tomorrow", "oblivion", "moon", "tomorrowland", "terminator_genisys", "back_to_the_future_part_ii", "fantastic_beasts_the_secrets_of_dumbledore", "i_am_legend", "avengers_age_of_ultron", "vanilla_sky", "john_carter", "inception", "now_you_see_me", "shutter_island", "inherent_vice", "doctor_strange", "tenet", "eternals", "the_last_witch_hunter", "super_8", "sherlock_holmes", "serenity"]}