{"id": 409, "title": "Twilight", "starring": ["Kristen Stewart", "Robert Pattinson"], "runtime": 122, "genre": ["Fantasy", "Drama", "Romance"], "description": "When Bella Swan moves to a small town in the Pacific Northwest, she falls in love with Edward Cullen, a mysterious classmate who reveals himself to be a 108-year-old vampire. Despite Edward's repeated cautions, Bella can't stay away from him, a fatal move that endangers her own life.", "releaseYear": "2008", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/60IEwC4FaHSRpVEAM6iNpXZ5oSA.jpg", "categories": {"plot": 2.2941176470588234, "acting": 2.074074074074074, "ending": 2.0, "soundtrack": 3.0, "cinematography": 4.0, "familyFriendly": 2.0, "funny": 3.0, "action": 1.5}, "reviews": [{"rating": "4", "text": "The tweenage vampire romance movie \"Twilight\" is one of the worst horror romance films I've seen in years. The actors are all wooden and incoherent in their role, presenting themselves like noobs who memorize the verses word by word with no meaning or emphasis to it. The story contains the cheesiest dialogue made up of \"I love you. (Stare) (kiss) Let's be together\" and other kinds of disgusting crap (Vampires....sparkle?). Most importantly, the movie has no in-depth; the character development is incomplete and baffling as well, resulting to a general \"whatever\" pace of the movie. Oh, and Kristen Stewart? She is one **** spoiled brat we've got there. Overall, like Justin Bieber, \"Twilight\"'s a fad movie that will attract many teenage romance geeks but repel professional movie critics.PS: What the **** is wrong with Robert Pattinson? Why is he so white? Somebody give him some blood or something!"}, {"rating": "0", "text": "I'm not kidding, its like the worstest movie of the year by far. It is so pale, dull and boring. Nothing exciting ever happens. It is emotionless, and you just can't wait for it to end. And the visual effects, they were awful! But most of all, why would you make a movie adapted from the lamest hit chick flick novel out there. And the story: Booooo."}, {"rating": "2", "text": "I am a big fan of the book (and hot vampires) but OMG this movie was awful!! The negative reviews I read beforehand weren't nearly harsh enought to prepare me! The opening scene of one of the Vamps hunting a deer showed promise, but the first 20 minutes of \"dialogue\" (was there actually a script or were they just winging it?) forced me out of the theater somewhere around the \"I'll have a garden burger\" moment. I'm not sure if it was really the acting (hello B-list) or the director trying to jam in insignificant book details rather than taking time to build suspence and character depth. Edward's tempted and tortured moment in biology class just looked like a five-year-old that had to pee?! I had to re-watch Harry Potter to remind myself that he really is a decent actor. I vote 2 - in the event that it got better sometime after I gave up."}, {"rating": "1", "text": "This movie was almost painful to watch. I passion, what passion, and the characters were DULL DULL DULL. There was no chemistry only angst or depression. The only thing decent was the soundtrack that is why I gave it at 1 at least. So disappointing."}, {"rating": "1", "text": "This movie was so boring. I hated it and the acting and the directing was lame. Bella asked the same damn question every three seconds. How did you save me? I will give this film a negative review."}, {"rating": "2", "text": "the movie quite frankly sucked! i wa expecting more... i mean the books r fantastic and then this movie flopped. But some how it is still making millions (which i do not understand) Too many scenes were changed and added. it went to slow and all they did was stare at each other.. no flirting or \"i love you\" moments like in the books. It sucked."}, {"rating": "0", "text": "Worse adaptation i have ever seen. i have read all the cheesy books and i love them but i really really almost cried when i saw this movie. this is by far the biggest literary heartbreak I've had."}, {"rating": "0", "text": "Absolutely terrible. I do not know why this is so popular. I had to leave the theater in the middle of viewing because I couldn't take it anymore."}, {"rating": "3", "text": "Most of you guys are retarded. the first half was decent. her school chums were funny. but as soon as they get into the vampires this movie becomes shockingly cheesy and unintentionally funny. the pacing is way, way off. Too slow at first than way, way 2 fast. the bad guy is introduced way 2 late and the climax is way 2 short. this is one of the worst directed movies ive ever seen and one of the cheesiest."}, {"rating": "0", "text": "I saw this movie and thought it was horrible. Not only was it super gay, the vampires were all glittery and stuff. What the hell?"}, {"rating": "1", "text": "Absolutely crap, I don't know why I'm still wasting my time on this kind of american movies, it's so pathetic, it is boring from the beggining until the end, I have wait to see what could be happen but nothing happens. The only thing that worth is in the radiohead song in the final credits. It's defenely the worse movie that I ever seen in a few years, it's worse than \"The Spirit\" also a great piece of sh*t."}, {"rating": "1", "text": "Undoubtedly one of the single worst films ever made. With a thoroughly uninteresting plot and poorly developed characters, this is an insult to what was actually not a bad book. At least that had some good points. You could go and see this, or you could......well there are too many better thing to list."}, {"rating": "0", "text": "My I.Q. dropped from watching this pointless movie. Horrible story line and effects. This movie was no doubt the worst creation ever to curse this planet."}, {"rating": "2", "text": "I like to think of myself asa movie buf so I decided to give this movie a fair go, I read the book and decided it got a 5 out of 10 because it is not written that well and the same thing goes for this movie. They tried to change a classic horror element, Vampires, like what the remake of dawn of the dead did to zombies but while dawn of the ead was good this failed. Poorly made, little to no prodution values and just a ciomplet lack of what makes a movie good."}, {"rating": "3", "text": "The film is crap rob pattinson is a weirdo. I love the books but the movie was sad and boring ."}, {"rating": "1", "text": "Hey people, get yourself a movie education! This is not even a movie, it's teenagers' fantasies for a guy who has a sex appeal equalling... 0. I gave it a 1 only because I had a good time laughing at it with my friends during the movie. I've rarely seen a movie so bad; oh wait: I already know one... \"Twilight 2\". There's nothing else to add, my comment is as profound as this movie."}, {"rating": "3", "text": "I went with 9 of my friends to see the movie and none of us liked it. We came knowing it would be different from the book but didn't think it'd be that bad. The acting skills of the actors weren't that good, the music didn't fit the scenes, they mixed scenes from the book together....overall it was a big disappointment."}, {"rating": "4", "text": "If you are a girl, teenager, in love or just like to watch bad movies. WATCH IT!"}, {"rating": "2", "text": "One of the dullest movies I've ever seen in my life. If only I could take those 122 minutes back. Here are reasons why this movie sucked. 1. First off, the characters are lifeless. 2. The characters sound like they are reading off paper3. Practically remain blank faced throughout most of the movie4. No chemistry between the two main characters5. Is everybody wearing makeup?If you are a Twilight fan, then I feel sorry for you. Please get some help."}, {"rating": "2", "text": "One of the more foolish movies I've ever seen. It has a poor plot, poor music, poor screenplay and the worst, it ruined the vampire's stories. This movie is really awful. Enjoyable just for teenagers in love. In a way is stupid."}, {"rating": "2", "text": "Twilight is an extremely pathetic movie. A movie so riped of phoniest it is almost laughable. Not only is it dull, pretentious and boring, it has some very wooden acting and poor dialogue."}, {"rating": "0", "text": "Well this whole thing sucks pretty hard. I mean how can this be a Vampire book. i mean seriously what kind of vampires glitter in the sun. everyone that reads this thinks they know vampires but they don't. most of them never even heard of interview with the vampire or even underworld. real vampires don;t fall in love they suduce people to get what they want."}, {"rating": "2", "text": "Nothing more than a confused womans wet dream, with legions of idiotic, pubescant 16 year old fan girls streaming in her wake. The poor story is further degraded by immensely wooden acting and dull script writing. A real fangs-bared yawn accompanied by repulsion at the overall story."}, {"rating": "1", "text": "This whole movie is a a 14 year old girls wet dream with terrible acting! I really don't now what else to say other than this movie destroyed Vampires for me as now if I hear the word Vampire I will think of this terrible piece of crap."}, {"rating": "3", "text": "Bad acting, cheesy moments (super cheesy), lack of chemistry in love scenes and not having the true spirit of a true vampire is all I can say. You would not even classify this as a vampire movie because vampires in this movie are rarely drinking blood and rarely bites people. Overall, the film is boring and bad. They did redeem just a little bit in New Moon and Eclipse (from a score of 3 to 4)."}, {"rating": "0", "text": "One of the worst films ever made. Without a shadow of a doubt. Not only is it dull, pretentious and boring, it has some very wooden acting and poor dialogue. It makes you cringe at the fact that four more installments are on their way..."}, {"rating": "0", "text": "terrible movie, terrible book, this series has officially killed the vampire genre, before this if you said vampire romance, you'd sound crazy, and in my opinion, it still sounds crazy. there 2 different things, vampire, a horror idea, and romance, some lovey dovie move. they don't fit together. another reason i don't like this movie is because it killed the idea of a vampire horror. ever since the original book was made, there has been nothing in the vampire genre besides vampire romances. and any movie that doesn't have them as a part of some relation ship puts them as a small, weak sub enemy. there is no Dracula-like vampires any more. so, in short what im saying is, thanks a lot twilight, i hate you"}, {"rating": "1", "text": "Should be called \"The Stalker's Guide to Getting Chicks.\" I only gave it a 1 and not a 0 because i laughed during a couple of scenes.  The characters were really stupid and I couldn't believe anything that the actors said. My friends and I watched, wondering what all the popularity  was about. All 9 of us are still wondering."}, {"rating": "0", "text": "Worst dramatic/romantic movie I ever seen in my life. Kristen Stewart can't act for **** and everyone who tries to act is stupid and the concept of vampires being in daylight is dumb. Vampires are supposed to kill people not fall in love with them."}, {"rating": "3", "text": "This is a very horrendous move. A pretty predicatble plot, and bad acting and a stupid story (do we need more vampire romances in the world?) I just want to punch the direct in the face."}, {"rating": "0", "text": "The fact that this film was even thought of by Paramount is a mystery to me. The film for me is so offtrack and boring that I can't understand why they accepted another 3 movies. A film about vampires will never be successful, but when they throw romance along side this rubbish and a hint of comedy, it's just a disaster and a waste of money. I feel sorry for the actors whose careers have been ruined by this utter drivel. Dreadful 0/10"}, {"rating": "0", "text": "My wife has made me sit through all of these films. I feel cheated that i will never get those hours of my life back. Don't worry though, I made her sit through the alien films followed by Die Hard 1&2&3&4. that'll teach her!!!"}, {"rating": "0", "text": "This film doesn't even deserve a 1. If you want to see a vampire film, look out for Underworld or Bram Stokers Dracula. Not these teen romances which have stolen everything from every other vampire film or book and made it 'teen friendly' by removing blood. Hello, that's why teens live!"}, {"rating": "3", "text": "It had a few decent moments in it, but overall this movie just bored the hell out of me. The romance wasn't moving at all, that best fight scene mtv awarded battle with edward and that one wolf was 2 minutes of basically epic shoving. why the hell do so many people like this movie? Its like over 2 hours long and it just drags on.......blah blah oh hes a vampire.....blah blah blah of i'm suddenly magically in love with you edward..... i gave it an honest chance, and it made a chuckle here and there, thought it was kinda creative at times but overall im just watching this like, wait a minute? why the **** is this vampire glowing in the sun? Plus Bella should've been hotter. seriously they get a mega pretty boy i guess for the vampire because girls wont shut up about him, but for bella we got an actress whose a 8 of 10 at best. lol."}, {"rating": "6", "text": "I am a guy so natrually, I wanted to see what the big deal about this franchise was so I decided to watch this movie. It actually wasnt as bad as people made it out to be. The cast is ok for the most part and it was interesting to watch. However there were a ton of stupid scenes in the movie that I couldnt help but laugh at (pretty much anything involving the vampires). Also the lead villians were pretty terrible, Really just minor annoyances rather than villians imo. It was an ok movie suprisingly, I'll give the second film a chance."}, {"rating": "1", "text": "This movie was a total borefest. I had no preconceptions about it since back then I not only hadn't read the books, but hadn't even heard about Twilight. All I knew was that it was \"a movie about vampires\". I watched it with my brother and we both agreed that it sucked. Uninspired acting, terrible dialogues, boring story. It failed to evoke any emotions from me."}, {"rating": "1", "text": "I gave this movie a chance. I really did. But it just takes my intelligence, crushes it and stuff a cartload of dung into my brain. It felt like a mixture of cinematic rape, utter boredom and cringeworthy acting/sequences that make this the worst movie I've seen in a very long time. Twilight feels like a B-grade, made for TV movie, only that they managed to get a decent camera for the job. About the only half-decent component is the cinematography. Its definitely well shot. As for the main juice of the movie...you'd be wondering why on earth anyone would make this movie apart from milking the cash out of Tweens and their poor boyfriends. Apart from some supporting characters who have passable acting, the main characters lack the skill and aptitude to produce even an a line of dialogue that wont leave you cringing or in some cases, wishing you were dead so the torture would end. Tweens would defend this pile of excrement to their deaths and I say, feel free. The world can judge. And thankfully, most people who have a conscience would stray clear of this horror. Yes, tweens, there are a lot of females out there who hate/aren't give a fck about Twilight than there are those who would. Get that fact right. I am not even going do a review for the other sequels as I WRITE THIS AS A WARNING TO ALL: This is almost as bad as Batman & Robin and is universally claimed by critics who were not bribed by the producers as the worst movie franchise of the 21st century, if not in all of movie history. I literally felt my IQ drop by spades during the movie. Please, save yourself and avoid this. I saw this out of pure curiosity. Dont even try to do what I did. Its not worth it."}, {"rating": "5", "text": "\"Vampires\" are supposed to be blood thirsty, so why make a movie about a kind vampire who falls in love and because of this he can control himself. Anyway kids are scared of vampires and making a big movie of it doesn't help kids thinking they don't exist! not a bad movie, just a bad idea to make it about a vampire in love!"}, {"rating": "1", "text": "I've read the entire Twilight series, and I have to say that the movie is terrible. That isn't to say the books are any better, but this is just atrocious. All I can say is: you know something is wrong when your audience is laughing in a gothic vampire romance movie."}, {"rating": "3", "text": "It would be a great mistake to call this picture \"vampire movie\". Vampires here are quite phony since they don't drink blood. I don't know if it is bad acting or whether romance is supposed to be so slow and passionless between vegetarian vampire and gloomy girl, but I can't see a single spark between them even when they're kissing. Characters' actions are full of incoherence. How does Edward, according to some girl's evidence quite desired by most of schoolgirls, fall in love with some girl who seems to have dyslexia? I don't believe that his feelings are based on her smell solely. Why on earth evil blood-drinking vampires are so hostile? Smell again? And let alone poorly made supernatural jumps and combat scene. I practically can see strings attached to their bodies."}, {"rating": "7", "text": "The story is interesting, the script is good, but Kristen's performance is very poor and weak. The scenery is beautiful and use of colors is very well done."}, {"rating": "0", "text": "I hated the book, and the movie was no better than the book. I wish this series never existed at all. A vampire that shines? Seriously? What has the world come to?"}, {"rating": "5", "text": "\"You give love a bad name\"-Bon Jovi \"You give vampires a bad name\"-Twilight.Even though I enjoyed the love story and the music of this movie there were so many things that got to my nerves.Kristen Stewart's act would manage to take great reviews if the movie was about zombies and she was one of them.Same face in the whole movie.Also at some parts I thought that Edward was doing  swarovski and vegan commercials.Great love story,awful details on the vampires.5/10"}, {"rating": "0", "text": "God, this movie is awful The acting is horrendous, the dialouge is terrible, the characters are underdeveloped, the directing is lazy, and anything I forgot to mention sucks too."}, {"rating": "4", "text": "Good romance because of the chemistry, but due to its bad performances and dumb premise this should just be a comedy more than a drama/romance. This is the beginning of one of the most embarrassing franchises ever.  I give this film a 42% of a good movie."}, {"rating": "0", "text": "this movie sucks!!! there's nothing good about this movie. i don't know what the **** people like this dumb movie. Only little girls watch stupid movies like twilight"}, {"rating": "3", "text": "Nothing actually happens in this travesty of a film. Gothic romance? You wish! Only 15 yr old girls can find some interest in this boring, banal, undercooked crap with bad acting and laughable dialogues. Oh, at least I laughed out loud in certain points."}, {"rating": "1", "text": "Never before have I seen a more terrible movie than this. Vampires? Maybe. 2 \"hot\" guys that 10 year olds like. Check! A good movie? Yeah right. I like the first minute or two. Before anyone arrives on screen."}, {"rating": "2", "text": "This film just makes you realise that the world is full of camp people,men and women.In the older days when men were men and wanted to do manly things with their pals Vampire Horror was quite enjoyable but these days men just follow their partner anywhere and everywhere!Even going as far as copying the lady habit of dropping their own friends for the partner relationship.Only to try and win their mates back after the relationship goes south and crumbles and shatters to pieces!\rThis film is drowned in camp vampires.....omg if the vamps have gone camp then there really is no hope left for mankind!\rVampire films used to be classed as horror but with drivel like this its no wonder there's no scares left in the genre.......except for 30 days of Night,if you want an up-to date vampire horror go for that as you wont be dissappointed,oh and it has romance but its so thin you know its there but forget it as the horror is so intense."}, {"rating": "10", "text": "First of all, vampires aren't real. So everyone who is saying \"they're not real vampires\", well, obviously. It's just a different take on vampires, which again, I should highlight as some people may be confused, are fictional. Anyway, I think this movie is good for teenage girls. It's focusing on the romance involving a girl who is shy and feels nobody really 'gets her'. As for the action, what more could you want? They smash them to pieces and set them on fire! I think each of these movies are getting better and better and I can't wait to see what Breaking Dawn is going to be like."}], "recommendations": ["the_twilight_saga_eclipse", "the_bye_bye_man", "legion", "the_twilight_saga_breaking_dawn_part_1", "the_twilight_saga_new_moon", "slender_man", "priest", "the_babysitter_killer_queen", "transformers_revenge_of_the_fallen", "the_mummy_tomb_of_the_dragon_emperor", "the_eye", "polar", "i_am_number_four", "ghost_rider_spirit_of_vengeance", "shadow_in_the_cloud", "underworld_blood_wars", "doctor_strange_in_the_multiverse_of_madness", "the_twilight_saga_breaking_dawn_part_2", "the_legend_of_hercules", "underworld_evolution", "wonder_woman_1984", "the_devil_inside", "the_new_mutants", "vampire_academy", "jumper"]}