{"id": 3305, "title": "Twister", "starring": ["Helen Hunt", "Bill Paxton"], "runtime": 113, "genre": ["Action", "Adventure", "Drama"], "description": "An unprecedented series of violent tornadoes is sweeping across Oklahoma. Tornado chasers, headed by Dr. Jo Harding, attempt to release a groundbreaking device that will allow them to track them and create a more advanced warning system. They are joined by Jo's soon to be ex-husband Bill, a former tornado chaser himself, and his girlfriend Melissa.", "releaseYear": "1996", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/6tagtmPVOG4QqraQ4piUFLoqaoj.jpg", "categories": {"plot": 6.387096774193548, "acting": 5.935483870967742, "ending": 8.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 8.0, "action": 7.461538461538462}, "reviews": [{"rating": "5", "text": "Cut out the special effects in this movie and your left with actors who give the most annoying performances of their careers and a preposterously ridiculous predictable plot. This movie may be watchable but people who say its good need to get their heads checked. Twister is mediocre save for the special effects. Pass."}, {"rating": "10", "text": "One of my personal favorites, Twister wows us with it's special effects and great CGI. Yeah, the ending might be a little cheesy, but what do you expect, it's Hollywood! Bill Paxton and Helen Hunt have great chemistry, and the addition of the late Philip Seymour Hoffman in one of his funniest roles make this movie."}, {"rating": "10", "text": "This movie kicks ass from beginning to end. great special effects great action great story, great everything."}, {"rating": "10", "text": "why won't we let God's hand piss us off with a lot of incredible movies including this one. Twister is a neat movie with very rad visuals and very hilarious acting."}, {"rating": "3", "text": "Fairly entertaining film, TWISTER is a kind of disaster, adventure thriller but hard to describe exactly.. it's basically about a tornado or tornadoes and made in 1996 and stars Bill Paxton and Helen Hunt. There's a few parts in the movie when we see people watching a screening of Stanley Kubrick's The Shining before the tornado hits. We see cows and vehicles being swept away because of the tornado, flying through the air are various objects due to the tornado which looks laughably bad. Bill Paxton and Helen Hunt outrun a tornado which is utterly stupid and laughable and some of the film is incredibly bad."}, {"rating": "9", "text": "A great thriller with a bit of romance and plenty of education."}, {"rating": "9", "text": "This is a successful thriller; action packed, well timed, and great acting."}, {"rating": "6", "text": "If you can suspend your disbelief in regards to characters chasing after a tornado and just enjoy it as a dumb disaster movie Twister is fun. The effects on the tornados are really good, some of the action scenes are quite thrilling, and at times the goofyness of the film can be entertaining. At the same time, the film is also quite cheesy from the dialogue to the occasional cartoony voice that requires one to turn off their brains. There is much to get invested in either as the characters in this film are poorly developed and uninteresting. If you go into Twister expecting a thrilling disaster film, you will somewhat get what you want but if you are looking for anything deeper in regards to characters you’ll find this film tasteless."}, {"rating": "5", "text": "Aw the good old Jan de Bont days filed with good special effects and well not much else. First Speed (pretty awesome), then Twister (pretty OK), then Speed: Cruise Control (oh God no), then The Haunting (make it stop!), then finally Lara Croft (I've lost faith in humanity). That pretty much sums it up right there."}, {"rating": "4", "text": "Lots of cliches and suffers from deus ex machina, the only thing that i found enjoyable about this movie is it's special effects, which were great for it's time, other than that, not recommended."}, {"rating": "7", "text": "A great, thrilling piece of film--and the only one of its kind. Films surrounding natural disasters come and go each year, but you'll find yourself always comparing those to Twister. Helen Hunt and Bill Paxton at their best!"}, {"rating": "9", "text": "May well be the best film ever made, everything about it is amazing you love storms or tornadoes then twister is for you! also the special effects in this film are superb outstanding and still show up well today despite the film being made in 1996"}, {"rating": "8", "text": "In 2017, a film such as Twister being made would be pretty inconceivable. It is a big-budget film that basically feels as though it was a film made to just build up anticipation for a future ride at Universal Studios. Yes, it did become a ride at Universal Studios, but it feels more akin to the movie being mere marketing for the ride, rather than the ride coming as a result of the movie. A special effects bonanza, Twister is hardly a good film in the typical sense, but it is a good film in its own way. What saves the film is its sense of purpose and scope. It feels like a blockbuster and one that is unafraid to delve into serious topics in honoring the storm chaser profession with costly special effects. While cliche and derivative, the film powers through them and delivers terrific entertainment that is hardly a mindless blockbuster.Often times, on sites other than Letterboxd, I am accused of hating fun. Big blockbusters are not my thing. Marvel films are hollow parades of predictability and action scenes that exist merely to look cool and show off technology than to actually do anything plot-wise. They are devoid of thrills or entertainment value. The films have just become more like the X Games with guys doing tricks on bikes or the World's Strongest Man re-runs on ESPN with men flexing as they reign in a plane. For those into that, the films are appealing, but it is not my style. Films such as Twister, however, are my style. It special effects, which are tremendous even today, feel built to be experienced first hand. They are a throwback to old school disaster movies with objects flying from every which direction and the characters forced to run to the right and left on a set with real objects, rather than just a green screen. These more stripped down special effects are fun and far more engaging, but also serve a purpose plot-wise. There are no moments where something is thrown in because it looks cool. The twisters are needed. The carnage is needed. Every piece is there because it communicates the scope of these tornadoes and the danger storm chasers find themselves in during the course of their scientific duty. The special effects, therefore, are quite tight and well deployed. This is a film built to impress with great effects, but its effects create well earned tension and thrills that deliver splendid entertainment.The tornadoes, however, are only part of Twister's appeal. It is a blockbuster unafraid to become real. Depicting the real damage of tornadoes, the film develops tremendous stakes. Watching the storm chasers trying to play these sensors into the tornado is given incredible purpose as it would allow them to create a new warning system to give people more time to get to safety. It would be a life saving discovery and, therefore, essential. This is not some \"save the world from whatever\" mission, this is a small increase in warning time, but an essential step for the citizens of the area nonetheless. Thus, while the special effects and tornadoes do look quite \"cool\", they are also weirdly haunting. As they tear across the country side, you can feel the fear and anticipation of the citizens and the storm chasers as it bears down on populated areas throughout Oklahoma. While the film does not develop these random citizens at all (nor should it), the film is blessed with the fact that it is real because it immediately makes the destruction and human suffering feel real. It gives the film great stakes, but also great scope and purpose with the mission these people are on carrying great importance and weight.That said, the film does suffer from its stock characters. From the married couple who used to be partners at work, but are now separated and one having a new spouse who simply does not \"get\" their passion, the film's romantic center is doomed to be cliche. A loud and obnoxious comic relief stock character, a stock supporting character that will clearly wind up in danger, a bad backstory and family tragedy, a useless \"villain\", and a typical cast of unrecognizable character actors in small roles that help to chase storms, accompany the film's poor romantic set-up. In focusing on its special effects, Twister did forget to build worthwhile characters, but fortunately, this problem is helped and not by the special effects. Rather, the stakes. We do not need much to root for them. We root against the villain because he is a bad storm chaser who does not listen to advice or words of wisdom. His device will fail to help the people in tornado alley. If Bill (Bill Paxton) and Jo (Helen Hunt) get in the right position, however, they can help because they know what they are doing. Regardless of how one-dimensional they are, director Jan De Bont's aforementioned inclusion of the damage caused by a tornado helps to alleviate issues with the characterization as it gives the audience a cause and group of people to easily root for."}, {"rating": "7", "text": "The film's special effects are effective, even thrilling, but after a while you start to ask yourself why, with all the debris flying through the air, does hardly anybody even get a scratch? And it does seem a rather cynical movie ploy to posit a series of increasingly violent tornadoes as backdrop to a rather perfunctory marriage reconciliation. Executive produced by Steven Spielberg, and it shows it. But it is a welcome change to build a movie around \"scientists\" as heroes, and even throw in a rival scientific group (the corporate sell-outs) as the bad guys."}, {"rating": "7", "text": "A personal favourite, though I gave it a medium rating. It's just so darn exciting, even with the somewhat wooden performance from Bill Paxton. Some rather convincing special effects for the mid-nineties, too."}, {"rating": "6", "text": "The theme of the movie is surely unique, I never saw a movie about twisters and the visual effects are not bad, maybe even great for 1996. But the story, characters and dialogues are just average. Also some of the scenes were unrealistic."}, {"rating": "7", "text": "\"Twister\" is an immensely entertaining disaster film, even if its breathtaking action and stunning visual effects can't be matched with its one dimensional characters and predictable plot."}, {"rating": "1", "text": "Twister, though it does have decent acting and good intentions, is a completely ignorant movie that makes little to no sense throughout. Though the special effects are good (considering the time it came out), the implementation of these effects are completely ridiculous, making me feel like I am watch a terrible z-movie rather than a serious drama. Also, multiple characters (the main characters included) are supposed to be intelligent weather experts, yet they act on multiple occasions like idiots and make decisions that only common sense would tell anyone are not smart.  Finally, the use of a tornado as a monster like Jason or Michael Myers does not help their cause at all. A tornado is not some serial killer trying to murder people, it is a product of nature that has no complicity to act sadistically. All together, these aspects made Twister nearly unbearable, and only the acting (which, as I said, is not bad) kept me able to watch this movie to its conclusion."}, {"rating": "7", "text": "Its an okay movie with good special effects. The ending is amazing, but I don't understand how they made it without a scratch! Again, the effects are amazing, and I'll watch again!"}, {"rating": "7", "text": "A bit silly and despite being one of late great Bill Paxton's more memorable roles. He has played better characters than a unrealistic tornado chaser who can sense when they are coming. Late Phillip Seymour Hoffman definitely moved on to better roles as well, than a goofball tornado chasing sidekick.However the great effects made the film good. Paxton and Helen Hunt (As Good as It Gets) also had some fine chemistry. There's just so many silly things you could list. Like the competition tornado chasers all driving black trucks. \"Oh no...evil tornado chasers that steal your ideas.\"Who better to play a cocky jerk tornado chaser than Cary Elwes though ?"}, {"rating": "6", "text": "Spectacular visuals combine with adequate acting, but a less than stellar narrative to make this a middle of the road disaster flick more made for TV;"}, {"rating": "7", "text": "Twister provides cool effects but a flat story/characters. The tornado scenes are intense and fun to watch (if at times ludicrous). The human drama element just isn't that interesting though, and we just don't care about these people. It's a terribly average movie, the acting is fine, the script is decent, the story is functional. But when you don't really care about the people in these fire situations, the tension is significantly toned down. This is a fun movie to watch if you have nothing to do. You won't regret seeing it, but you'll step away struggling to remember the details of the plot other than \"a tornado destroys everything\"."}, {"rating": "6", "text": "Twister was a slightly exciting movie , and is much better than \"Into the Storm\" in my opinion , as good work of the cast, the plot well and good visual effects"}, {"rating": "10", "text": "Twister is one of the best disaster films out there. It's fun, it's scary, and it's entertaining. Helen Hunt and Bill Paxton were very good actors in the movie"}, {"rating": "2", "text": "I don't like disaster movies. It's hard for me to find such a good one too. Twister tried and it really tried to interest me, but it failed. You might love it, but not me."}, {"rating": "6", "text": "Don't bother warning Auntie Em to take shelter in the fruit cellar. The tornado ripping through this fiendishly funny farce is more likely to cause psychic than property damage. The setting is contemporary Kansas, and Dorothy would hardly recognize the place; it looks like Oz gone to seed. This Cleveland family resides in a mansion that reflects conspicuous consumerism. There's even a live-in maid (Charlaine Woodard). But inside, everyone seems ready to crumble. Dad (Harry Dean Stanton) has made millions selling soda pop and operating miniature-golf courses; now he's thinking of breeding miniature cows. Mom has long since fled to the comfort of a mental institution. Sonny, played way beyond the hilt by Crispin Glover (Back to the Future), dresses in black and carries a whip; he's trying for \"a total look.\" Daughter (Suzy Amis) is a boozing, tantrum-tossing unwed mother whose advice to her precocious eight-year-old, Violet (Lindsay Christman), runs along the practical lines of \"Get me a beer.\"\r First-time director Michael Almeredya, who adapted the script from Mary Robison's 1981 novel OH!, has etched a disturbingly comic portrait of the nuclear family nuked. Storm clouds loom when Violet's father (Dylan McDermott) returns from Canada to rescue his kid and her mother from these loonies, but he's another of the walking wounded — just less recognizably so. The same is true for Miss Virginia (Lois Chiles, in a knockout performance), a TV-kiddie-show host who's never scarier than when she thinks she's being sane. Still, even Miss Virginia is on target when she tells Dad, her demented suitor, that his family \"has lost the habit of thinking.\"\r Almeredya hasn't. His auspicious debut augurs a stunning future. The film may be blissfully bonkers, but it also speaks tellingly of the dislocation in American life. Part fun house, part chamber of horrors, Twister emerges as outrageous, original entertainment."}, {"rating": "10", "text": "An awesome and enjoyable tornado movie that I still love to this day. Twister gives out great visual effects and memorable scenes to entertain the younger and keep older audiences interested."}, {"rating": "9", "text": "Twister is a fantastic movie about a group of friends obsessed with hunting tornados. The special effects are incredible, really creating a lot of spectacle and suspense for the viewer. The characters however are really great too, as they are all memorable and make it clear why they are obsessed with doing such dangerous things."}, {"rating": "6", "text": "The elements associated with Crichton: the science of storm chasing and the professional love triangle, are simply along for the ride in a script that goes as follows: Storm happens, characters chase storm, characters rest, storm happens again, and repeat."}, {"rating": "8", "text": "This movie is so satisfying to watch! Tornadoes have always been fascinating but here you get a very intimate look at them including the action associated with chasing tornadoes."}, {"rating": "6", "text": "It is one of those cases what happens when special effects plot eaten. In fact, the plot is supported with pins based on boring dialogues and characters lacking personality. It is true that in his year he had his moment of glory but not enough to be a classic."}, {"rating": "5", "text": "Good scenes of destruction, but without any plot to justify them.Disaster films are generally popular but critically slaughtered. This movie was no exception. Released in 1996, it is still popular today and remains popular with movie buffs where the total destruction and death of half the cast is a must. In this case, we follow the vicissitudes of a group of \"tornado hunters\" as they try to debut a revolutionary new sensor called \"Dorothy\" that will give them current readings and information about the inside of a tornado cone.The film is directed by Jan de Bont. Personally, and despite all the flaws, I liked some of his movies, like \"The Haunting\" (ok, I don't consider him terrified). Here, I recognize, he did nothing very good, and Steven Spielberg, who was executive producer, did not help him. But the biggest problem with this movie is that it doesn't have a story. There is a reason why the characters are there and from there we start chasing after tornadoes. I don't understand why that couple, who are in divorce proceedings, suddenly decide to travel in the same car to hunt for tornadoes as in the \"good old days.\" There are also some credibility and likelihood issues, such as the fact that, with so much debris flying dangerously around, the characters are never hit by anything that truly hurts them.Helen Hunt is the actress who dominates the whole movie, and I even liked her here, giving life to an enthusiastic, upbeat and resourceful tornado hunter, but with a traumatic past that makes her permanently in search of danger. Bill Paxton was reasonable, and goes well with Hunt. Some of the most emotional moments of the film are starring the two actors, who make romantic pair here. Jami Gertz doesn't seem to know what she's doing here, and is quickly dismissed by the script; Cary Elwes is effective in giving life to a bastard worthy of a painful death; Philip Seymour Hoffman, Alan Ruck, Scott Thomson, and Todd Field support the main cast well, and help to make some ineffective comedy, but it keeps the movie with some elegance and prevents it from becoming too tense.The best of the movie, I think, is the action-packed, special-effects and green-screen scenes, where tornadoes are violent, can come out of nowhere and take everything you find except the good actors in the movie. Cars, houses, live cows, sharp blades, tractors and whole tankers ... everything flies except two light human beings. Although unlikely, it is good to see and makes the movie worth it."}, {"rating": "10", "text": "Good special effects, memorable characters, super action. That's all I ask from a disaster movie. Twister delivers that."}, {"rating": "10", "text": "I lovely disaster movie, verrrrrrrrrrrrrrrrry enjoyable, talks about a tornado aswell as problems in life at the same time, 10/10"}, {"rating": "10", "text": "Tiene unas asombrosas escenas de destrucción y tiene unos increíbles efectos especiales, es muy entretenida."}, {"rating": "8", "text": "Really good movie, and i use to watch this all the time when I was younger. I remember when I was like 8 and we had a tornado go right past our back ally. It felt like an earth quake. Everything was shaking the house too. Then we had to run in the basement when the kitchen windows starting shattering. I was too niave to understand what was really going on. I thought it was cool."}, {"rating": "9", "text": "Twister is incredible and had good graphics and CGI for the 1990s. The characters are enjoyable and the story keeps you on the edge of your seat for the whole movie. Though if you really care about the science, they didn’t really do well with the actual meteorology part. Awesome movie!"}], "recommendations": ["elysium", "san_andreas", "pompeii", "armageddon", "ant_man_and_the_wasp_quantumania", "transformers", "race_to_witch_mountain", "skyscraper", "independence_day", "the_day_after_tomorrow", "bumblebee", "rampage", "into_the_storm", "poseidon", "super_8", "doctor_strange", "project_power", "upgrade", "creed_ii", "thor", "avengers_age_of_ultron", "transformers_dark_of_the_moon", "hanna", "the_ice_road", "after_earth"]}