{
  "id": 4086,
  "title": "Two Weeks Notice",
  "starring": [
    "Sandra Bullock",
    "Hugh Grant"
  ],
  "runtime": 101,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Dedicated environmental lawyer Lucy Kelson goes to work for billionaire George Wade as part of a deal to preserve a community center. Indecisive and weak-willed George grows dependent on Lucy's guidance on everything from legal matters to clothing. Exasperated, Lucy gives notice and picks Harvard graduate June Carter as her replacement. As Lucy's time at the firm nears an end, she grows jealous of June and has second thoughts about leaving George.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/r18hSGAcxWiUysbX6nFShIZyjjP.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 5.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 3.5,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "This film plays to its two strengths, Bullock and Grant. Their charm and chemistry cause you to look more favourably upon the run-of-the-mill rom-com occurrences going on around them."
    },
    {
      "rating": "5",
      "text": "Romantic comedies are not the kind of film I like the most, but they are not the worst film genre. This film, however, turned to be less interesting than I expected. For me, it's forgettable.The script is simple and quite naive: Lucy, an idealistic and combative lawyer who fights for causes and defends the weak, was unusually hired as a legal advisor by George Wade, just that kind of person Lucy used to fight against. She thought it would be an ideal opportunity to defend her ideas and put corporate funds at the service of social causes. However, this irreverent rich man ends up becoming so dependent on her that he is not able to even choose the colour of his tie without hearing her first. Feeling that her tasks are going far beyond what she was hired for and her personal life was being affected, Lucy delivers a fifteen-day notice of resignation.The film is funny, light and has inspired dialogues, full of irony and British humour. Ultimately, its the ability to create a light and cheerful mood that saves the film, because the story told is based on premises so far-fetched that it ends up simply not being credible. From that point of view, the film starts so badly that it can make many people give up in the first fifteen minutes. However, it improves thanks to the strength and talent of the two main actors and their ability to perform the task they were asked to do. One thing that stands out is that most of the action in the film takes place in that fifteen days, after all the rest of the time has been skillfully condensed into about fifteen minutes.This is another partnership between director/screenwriter Marc Lawrence, an expert on romantic comedies, and actors Sandra Bullock and Hugh Grant. I think its needless to talk about the actors talent, as their career and achievements already say everything that is necessary. Both are regulars in romantic comedy films, are good at making this kind of characters and appear in some of the best films directed/written by Lawrence such as \"Miss Congeniality\", \"Do You Hear About The Morgans?\" and \"Music and Lyrics\". Both Bullock and Grant did the job well, but both seem to have limited themselves to doing more of the same, recycling ideas from other films and characters. Alicia Witt was also an interesting addition to the cast, small but effective.Technically, the film is regular, not to say average. Personally, I would highlight only a discreet cinematography with no noticeable effects, but that uses the urban setting where everything unfolds and leaves space for the actors and history, in addition to an effective soundtrack."
    },
    {
      "rating": "2",
      "text": "Tired, dull and to be honest nothing but pure trash. The wooden dialogue and acting, the complete dearth of anything funny and a lack of anything at all that resembles originality combines to produce this mess."
    },
    {
      "rating": "5",
      "text": "A lawyer decides that she's used too much like a nanny by her boss, so she walks out on him. (5)"
    }
  ],
  "recommendations": [
    "suburbicon",
    "steve_jobs",
    "american_hustle",
    "a_most_wanted_man",
    "the_grand_budapest_hotel",
    "worth",
    "knives_out",
    "burnt",
    "catch_me_if_you_can",
    "all_the_money_in_the_world",
    "the_social_network",
    "body_of_lies",
    "no_sudden_move",
    "casino",
    "the_score",
    "crazy_heart",
    "the_upside",
    "wall_street",
    "widows",
    "hell_or_high_water",
    "the_gunman",
    "arbitrage",
    "the_monuments_men",
    "broken_city",
    "a_most_violent_year"
  ]
}