{
  "id": 3771,
  "title": "U-571",
  "starring": [
    "Matthew McConaughey",
    "Bill Paxton"
  ],
  "runtime": 116,
  "genre": [
    "War",
    "Drama",
    "Action",
    "Thriller"
  ],
  "description": "In the midst of World War II, the battle under the sea rages and the Nazis have the upper hand as the Allies are unable to crack their war codes. However, after a wrecked U-boat sends out an SOS signal, the Allies realise this is their chance to seize the 'enigma coding machine'.",
  "releaseYear": "2000",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yeUhRSrlFcXhsuUai2ozWH6rNnK.jpg",
  "categories": {
    "plot": 6.666666666666667,
    "acting": 7.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Politically incorrect film about American sailors finding the German Enigma Code. What a load of bollocks."
    },
    {
      "rating": "4",
      "text": "Pretty bad movie. Historically it's a load of crap. Watch \"Das Boot\". A much MUCH better German U-Boat movie."
    },
    {
      "rating": "7",
      "text": "An excellent presentation of a Atlantic front in the World War 2. Although the movie has clichés and over-hyped drama it is interesting, intriguing and entertaining."
    },
    {
      "rating": "6",
      "text": "The quite good movie about submariners. The movie has turned out one many better than U-429 of \"In Enemy Hands\". Here have at least shown fight of people and real fritzes. And so a plot totally ludicrous, diluted with the American partiotizm."
    },
    {
      "rating": "3",
      "text": "Les films de sous-marin, c'est un genre assurément difficile et délicat, car après Das Boot (Le Bateau) de Wolfgang Petersen, n'importe quel film qui tente de près ou de loin de s'en approcher ou ne fût-ce qu'effleurer le sujet en règle générale, a l'air d'une endive avariée.Du reste, U-571 a pour lui le prétexte historique, celui de dérober la machine Enigma au nez et à la barbe des Allemands... Et à dire vrai, on y croit volontiers, au moins pendant le premier tiers. La réalisation est de bonne facture, le scénario se déroule avec rigueur et les acteurs font le boulot, malgré Mathieu MacConnard bellâtre incompétent de son triste état.Hélas, passé le premier tiers, le film prend progressivement l'eau de toutes parts, les fissures se transforment en trous béants, puis coule le machin par le fond jusqu'aux abysses insondables du grand guignol et du foutage de gueule. On ne demande certes pas une précision historique de haute volée, juste un minimum de vraisemblance ! mais là avec U-571, c'est beaucoup trop demander, voyez-vous...On a donc des situations de plus en plus ubuesques qui confinent au grotesque, à moins que ce ne soit une caricature plus ou moins involontaire du film de guerre sous-marinier : auquel cas, ce n'est même pas drôle y compris au 40ème degré. Voilà qui est donc fort regrettable..."
    },
    {
      "rating": "9",
      "text": "It will have you captured in the experience and let you on a firm gripp throughout."
    },
    {
      "rating": "7",
      "text": "U-571 has a lot going for it. Now, it may not be the most historically accurate film ever made, but is certainly damn good entertainment. Incredibly tense and thrilling, there is rarely a moment you are not clinging to the edge of your seat for dear life. The tension built by director Jonathan Mostow certainly pays off too, with a great third cast. Additionally, the sound in this film is fantastic. It nearly surrounds you and would be a fantastic film for IMAX nowadays. The cinematography is also very good, as is the cast led by Matthew McConaughey, Harvey Keitel, and Bill Paxton. Now, U-571 certainly is not a groundbreaking film in any way, but that does not mean it is bad. Quite the opposite actually, as it manages to entertain throughout even if the path it takes it quite familiar."
    },
    {
      "rating": "5",
      "text": "jon bon jovi in this film .thats a good dedicate for all army men saler man and ubots mens"
    }
  ]
}