{
  "id": 3793,
  "title": "UglyDolls",
  "starring": [
    "Kelly Clarkson",
    "Nick Jonas"
  ],
  "runtime": 87,
  "genre": [
    "Family",
    "Animation",
    "Music"
  ],
  "description": "In the adorably different town of Uglyville, weirdness is celebrated, strangeness is special and beauty is embraced as more than meets the eye. After traveling to the other side of a mountain, Moxy and her UglyDoll friends discover Perfection -- a town where more conventional dolls receive training before entering the real world to find the love of a child.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/p97LQ1TL95mptVL2AS8Rz1cJCQg.jpg",
  "categories": {
    "plot": 2.5555555555555554,
    "acting": 2.4545454545454546,
    "ending": 5.0,
    "soundtrack": 3.0,
    "cinematography": 5.0,
    "familyFriendly": 3.5555555555555554,
    "funny": 1.0769230769230769,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "A child abuser gets to play the \"free-spirited\" lead character. Please don't tell me there's nothing wrong with that."
    },
    {
      "rating": "5",
      "text": "UglyDolls is cute and sweet with lovely rainbow colours, cheerful voice acting, and lots of fun songs. Remember people, it's aimed at kindergarteners, so it's not supposed to be really deep and groundbreaking, and it isn't. It's very simplistic storytelling with tame jokes. But for its target audience of little tykes who want to see cuddly toys having an adventure, it's fine enough, and teaches a nice lesson for them."
    },
    {
      "rating": "0",
      "text": "This is basically Alibaba Pictures, STX Entertainment, and Reel FX Creative Studios collaborating to make a \"refreshing\" taste of \"Troll Doll.\" Pixar can top this stuff for sure, and I have no interest in seeing it."
    },
    {
      "rating": "1",
      "text": "This movie is not funny and it barely passes as funny at times. Maybe one good song out of the entire movie. I had an adult and a child pass out during the short movie. Just do yourself and your kid a favor and watch any Toy Story again. If you need the musical fix then go watch Frozen. Honestly Frozen teaches better lessons, better songs, and gives you more entertainment."
    },
    {
      "rating": "0",
      "text": "This movie is really bad! Not in a way like foodfight or the room when you could laugh at how bad they. But with this you can't do that. This movie is boring! The character are not entertaining,the joke are painfully unfunny and this is extremely unoriginal. This movie is so unoriginal to the point that you knew what was gonna happen! Also why does lou sound like he's 20+ yet looks like he's 7-12?!?! Lou is just boy angelica. This movie sucks"
    },
    {
      "rating": "4",
      "text": "Uglydolls is a steaming pile of mediocrity with generic pop songs, a bland message, and mediocre if sometimes colorful animation, nothing more."
    },
    {
      "rating": "4",
      "text": "You don't even need to watch the movie to know how darn stupid and pointless this movie is. where have the good animated movies gone? animated movies have been going steadily downhill, and this seems to be one of the lowest points. it wasn't a terrible movie, but it didn't deserve to be in any theatre. I'll be generous and give it a 4 for not being as bad as, say, the Mario Bros Movie. if you haven't watched this movie don't waste your time"
    },
    {
      "rating": "3",
      "text": "Very poor. Did not enjoy. This movie almost feels like there was no effort put into it whatsoever. They did know their audience was young children, and so they made it difficult to understand for mature people like me."
    },
    {
      "rating": "0",
      "text": "Really? The first time I saw that an Uglydolls movie was coming I immediately predicted that it was going to be some movie about \"being who you are\" or \"beauty is on the inside\"...And guess what? It's actually that, who saw that coming?Boring, generic and predictable story, boring characters, boring songs, boring villain, boring everything. You know? I feel sad that when watching this I saw some potential, maybe if this was written by talented people like with The Lego Movie, maybe this could have been good, but no, the script is the pure definition of lazy with jokes that are not funny at all (I only laughed once in the entire movie), corny and generic and even cringeworthy at times, seriously there is no originality in this, they went with the most obvious plot points and dialogue that are seriously lazy.Why is Pitbull in this movie? He's a terrible musician already, do you expect him to deliver a solid voice performance? He doesn't, his characters is supposed to be a comedic relief and nothing he said was funny and one of his \"jokes\" during his third act was the most cringeworthy moment of the entire film. Seriously, why is he here? Do the morons behind this thought that he would sell tickets? To who? Kids? Do kids listen to Pitbull? Oh, well, maybe, kids just listen to pure garbage this days.The villain is completely generic and cliché. He's like that \"perfect boyfriend\" joke from Inside Out, which was funny, except that in that movie, that character had seconds of screentime. Obviously too much of the same joke is annoying and this character is like that \"perfect boyfriend\" joke but for the 80 minutes this movie lasts. However I didn't expect his motivation, which shocked me because that was when \"Ohhhh this movie is finally trying to have some creativity\" and was one of the elements that had potential to be good if the movie was made by people that actually care.I hate, seriously HATE when studios think that a kids movie equals to a stupid movie. Sorry but no. This is also for those who think I'm exaggerating with this review because it's for kids, but just like I've said in other reviews, kids don't deserve such stupidity. There are tons of animated movies targeted towards children that actually have depth in their stories and messages, but this is nothing like that.The animation is Illumination levels of bad, cheap and lazy. Speaking about Illumination, this movie really tries to be like Illumination: Making a movie with the least effort and money possible and expect it to be a hit...But they failed, I'm so happy that this, as of now, has bombed at the box office, just so companies can see that trying to be like Illumination won't mean guaranteed success. The problem isn't that this is based on a toy brand, just look at The Lego Movie, a movie that proofed that movies based on a brand can also be great movies...Only if they have talented people behind them, the problem is that, no one cared in making something creative or original or truly funny and when the movie had some semblance of originality, the people behind this might have told the writers \"Nah, tone that down, we need to make this movie for stupid kids, they won't complaint if the movie is bad\" and that's just horrible."
    },
    {
      "rating": "7",
      "text": "I would say that this movie is for very young children and fans of Kelly Clarkson, Janelle Monae, or Nick Jonas, with apparently has no appeal beyond that. My expectations for this movie were not high. Despite its limits, Ugly Dolls is an oasis in a vast media desert dried of optimism. A welcome break from a draining milieu, this film celebrates hope, non-conformity, and perseverance,and yet despite touting non-conformity, conforms as a film to the very cookie-cutter type mold it critiques, which is quite a fatal flaw."
    },
    {
      "rating": "3",
      "text": "From that one line of toys that was popular in the early 2000s comes the big-screen debut of UglyDolls over 10 years too late! I really didn’t want to see this movie. I’ve seen the trailer way too many times both in front of YouTube videos and movies at the dollar cinema and it just looked bad. However, it showed up on one of the library’s free streaming services recently so I thought I may as well give it a watch and boost the number of 2019 films I’ve seen. Now usually with these reviews I like to let the film sit for a day or two before sitting down and writing a review. However, if I do that with this movie I think I might actually forget everything about it. It’s that kind of movie. Imagine, if you will, a movie that’s basically a mix of Toy Story, The LEGO Movie, Trolls and Shrek. Now think about how that movie would go. You got it? Now add in a bunch of generic-sounding pop songs and bad jokes. There. You’ve seen UglyDolls. It does absolutely nothing new, which on its own I don’t think is a bad thing. I love Star Wars, Avatar and Stranger Things and all of those do absolutely nothing new. I have no idea why I brought that up because this movie is not enjoyable or entertaining despite the story being done before. It’s just so painfully generic and cookie-cutter, which is ironic because the movie is all about being unique. Actually, let’s talk about the moral for a minute. While it isn’t a bad moral, it is waaaaaayyyyyyyyy too heavy-handed, preachy and unsubtle! Like I said before, Shrek pretty much had the exact same moral and did it a million times better, and that was just under 2 decades ago! Also, holy crap Shrek is as old as I am. Anyway, back to the review! The animation, while colourful, just didn’t look quite right to me. Something about the way the characters moved and how they were textured just looked a little off. It’s no Pixar, but it’s above TV-quality animation which I guess is the bare minimum for something like this. Speaking of the characters, they are also very generic. Half of the main characters aren’t even set up or established at all, they just kind of show up! The voice acting also left a lot to be desired. This movie has a cast of celebrities, mostly music artists, and I mostly just saw them in the recording booth and not as their characters. None of the comedy worked for me either. Also, my favourite comedian Gabriel “Fluffy” Iglesias played one of the main characters and I didn’t even notice until the very end! He barely has any lines! He certainly never says anything funny! I have no idea why nobody hires him to do more major roles in animated projects. His whole schtick is telling stories with funny voices, he’s perfect for animation but for some reason nobody uses him correctly. Anyway, this movie was also a musical. It has original songs but, much like The Greatest Showman, they sound so poppy that it may as well be a jukebox musical. While the songs are catchy and performed well, you don’t hire so many artists for an animated movie and don’t have them sing, they are also very forgettable, the lyrics aren’t great and they are all, once again, generic. That’s this movie summed up in one word: generic. Also, one last thing I need to mention is that I really don’t understand how the universe of the film works. It isn’t like in Toy Story where they’re just toys that come to life in the real world. It’s more like The LEGO Movie where it takes place in a parallel toy dimension except it makes a lot less sense. It’s hard to explain but you’d see what I mean if you saw the film, which I really don’t recommend you do. If you need Uncle TV to babysit your kids for an hour and a half, this is fine to throw on (There’s nothing scary and there aren’t any dirty jokes are anything. It’s clearly meant for younger kids.) but something good and more original would also be fine to throw on. Just don’t bother with this movie. You will gain nothing from watching it. Just watch Toy Story or The LEGO Movie or Shrek instead. One last thing. Robert Rodriguez both produced and wrote the story for this movie. I just thought that was interesting. That is all I have to say. UglyDolls leaves me with nothing, which just might be the worst thing a movie can leave you with."
    },
    {
      "rating": "0",
      "text": "Take the emoji movie,make it for 5 year olds, and have it be about uglydolls,and you got the uglydolls movie"
    },
    {
      "rating": "5",
      "text": "Wow, I'm really surprised Uglydolls got a 39 out of 100 on the Metascore. Well, time to review this.First, the voice actors, there are a lot of good ones. Such as Kelly Clarkson, Blake Shelton, Nick Jonas, Wanda Sykes. I feel like Uglydolls is like a combination between Toy Story and Trolls, (yeah, I know, weird combination, fight me) but the movie was stupidly average! The plot is both cliche and really predictable but, the singing! I would've given Uglydolls a score between 3 to 6 if it weren't for the singing. The singing is pretty phenomenal and has a lot of great original songs but around 1 or 2 songs, (or more) kinda sucks and quite cringy but that is my opinion. You can't be mad at how great the singing is.Despite how lots of people either disliked Uglydolls or hated it, the movie was enjoyably average in my perspective. Uglydolls is a movie that kids might/will enjoy, and how teens and adults judge the film is their own perspective and judgment. So, I give Uglydolls a score of 5."
    },
    {
      "rating": "10",
      "text": "HAHAHAHAHAHAHAHAHAHAHA BEST MOVIE EVER HAHAHAHAHAHAHA BETTER THAN JOKER, MATRIX, DARK KNIGHT HAHAHAHAHAHAHAGAGAHAHAHAHAH 10/10/10/10/10/10/10/10/10"
    },
    {
      "rating": "7",
      "text": "I'm not kidding, I honestly like Uglydolls. It has some small issues with its writing, the message does feel slightly hammered in, and it does feel a bit too Disney Channel-ish for something called \"Uglydolls\". But it does offer catchy songs, lovable characters, beautiful animation, a simplistic yet fitting story for the property, chuckle-worthy humor, some strong emotional moments, and a well-executed theme about your body image. It's a very fun movie with a big heart, and I feel like families can get a kick out of this one. Yea, it's corny, but it's the charming kind of corny. Hell, the film is aware of how stupid it is.If you think this movie is Boring, Forgettable, and Annoying, then ok, I respect your opinion. But please for the Love Of God don't use arguments like:-It's a Trolls Ripoff (Just because it has colorful characters and pop songs, doesn't make it a ripoff of Trolls. Both are almost entirely different movies.)-They're not ugly, they're cute (They've always been cute. You can argue they made them a bit too cute, but they've never really changed that much so...)-It copies other animated films (Don't all animated films copy each other? It's nothing new.)-It shows how all Animated Films are terrible now (Not every single film has to have something deep you know. Just let a simple movie be a simple movie. If you're gonna compare this to something like Spider-Verse, then you shouldn't be called a critic. People just bash this movie because it's an easy target, just like Barney's Great Adventure, and it's very tiring. If you're going to critique a silly kids movie, go ahead, but please don't go deep into what it does wrong, because it just seems so childish. This film doesn't represent how animated films are terrible nowadays, it represents how much critics can't find good criticisms for animated movies anymore.)What I'm saying is that, if you dislike it, fine. But please don't be so hard on it.Thank You."
    },
    {
      "rating": "1",
      "text": "This movie would only be enjoyable to small children or those without the brain capacity to remember what just happened in the movie. Plagued by far too long musical sequences that are redundant and add very little to the movie. In addition it is far too predictable, and the plot of the movie is so thin that if one of the children who actually enjoyed this picture were to walk on it, it would shatter into a million pieces. Put it on for your children if you literally don’t care what they watch. Oh and the worst thing about all of it is that the whole purpose of the movie is to obviously sell toys."
    },
    {
      "rating": "1",
      "text": "one of the worst animated movies from 2019 along with playmobil the movie! the animation is stupid! the characters are ugly!"
    }
  ],
  "recommendations": [
    "alvin_and_the_chipmunks_chipwrecked",
    "free_birds",
    "the_smurfs",
    "chicken_little",
    "alvin_and_the_chipmunks",
    "yogi_bear",
    "the_lego_movie",
    "the_cat_in_the_hat",
    "wonder_park",
    "the_boss_baby_family_business",
    "the_spongebob_movie_sponge_out_of_water",
    "dolittle",
    "minions",
    "cloudy_with_a_chance_of_meatballs",
    "planet_51",
    "the_nut_job",
    "the_angry_birds_movie",
    "the_tale_of_despereaux",
    "hotel_transylvania",
    "spy_kids_all_the_time_in_the_world",
    "barnyard",
    "alvin_and_the_chipmunks_the_squeakquel",
    "teen_titans_go_to_the_movies",
    "space_jam_a_new_legacy",
    "the_emoji_movie"
  ]
}