{"id": 2342, "title": "Unbreakable", "starring": ["Bruce Willis", "Samuel L. Jackson"], "runtime": 106, "genre": ["Thriller", "Drama", "Mystery"], "description": "An ordinary man makes an extraordinary discovery when a train accident leaves his fellow passengers dead — and him unscathed. The answer to this mystery could lie with the mysterious Elijah Price, a man who suffers from a disease that renders his bones as fragile as glass.", "releaseYear": "2000", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/mLuehrGLiK5zFCyRmDDOH6gbfPf.jpg", "categories": {"plot": 7.5, "acting": 6.815789473684211, "ending": 7.571428571428571, "soundtrack": 7.0, "cinematography": 8.857142857142858, "familyFriendly": 6.0, "funny": 3.5, "action": 8.0}, "reviews": [{"rating": "10", "text": "This movie has many different elements but boring it's audience is not one of them. After a second viewing of the film one will see the true masterpiece that is unbreakable"}, {"rating": "9", "text": "Very interesting ,,superhero\" movie... I mean the origin of this ,,superhero\""}, {"rating": "9", "text": "People say that this movie is from the director of 'The Sixth Sense'. However, 'Unbreakable' is something more than 'The Sixth Sense'. That camera work and relationship between characters are incredible. The theme that this movie has is well shown during the movie and James Newton Howard's score is very heroic, but also emotional."}, {"rating": "9", "text": "A close 8 but it kept me pretty entertained, plus the twist was good and bad. I don't really know about it, sometimes the cinematography was good, sometimes it wasn't, but it was a original story, with great acting"}, {"rating": "9", "text": "This is a mad underrated movie and is a unique real life take on a superhero origin story. It really does make you think about mental health and health in general. The trilogy is one of the most underrated trilogies of all time"}, {"rating": "10", "text": "A Modern Masterpiece. What if Superman came to Earth and learns that he is more powerful than normal Humans ? Unbreakable is a Origin story that focuses on the Psychological aspect of every Superhero movie. There isn't a Villain that he needs to defeat with is fists. He needs to defeat himself by realizing and accepting that he has powers like the characters in comic books. The movie is a character Study about Superheros and the Person behind these powers in that Movie its David Dunn. If you had Powers like these what would you do ?"}, {"rating": "8", "text": "This is one of the better films by M. Night. Good stuff; compelling idea and great twist. Just overall good acting, plot, and flow. I really hope they make an \"Unbreakable 2\"."}, {"rating": "10", "text": "This movie is amazing. It is a true story of opposites coming together to separate. Great acting by Bruce Willis and Samuel L Jackson, and great directing by Night. The end leaves you thinking why? why? why? This movie is even better than the sixth sense!"}, {"rating": "9", "text": "Having been involved in a terrible train crash David Dunn awakes in hospital to find that, not only is he is the sole survivor, but that he is completely unharmed. He is soon confronted by an odd stranger who has some peculiar claims about why he was able to survive the crash leading David on a journey to fulfil his destiny.\r Making a follow up to the universally acclaimed Sixth Sense was always going to be a difficult task but M. Night Shyamalan fully delivers here. Davids transformation from lowly security guard to something much bigger (I wont spoil what) is both fascinating and yet still believable in part thanks to the understated performance of Bruce Willis in the lead role and Samuel L Jackson is as watchable as ever. This of course would not be an M. Night Shyamalan movie if it didn’t have a twist at the end and, while perhaps not quite as clever as The Sixth Sense, it again certainly comes as a surprise.\r Often unfairly compared to M. Night Shyamalans debut Unbreakable is an excellent film in its own right that will entertain most who watch it."}, {"rating": "8", "text": "Very underrated film and probably M. Night Shymalan's best film (in which, I know is not saying much). The story is very compelling and thought provoking."}, {"rating": "9", "text": "Awesome"}, {"rating": "9", "text": "My favorite M. Night Shyamalan movie.  This film has the same chilling tone as The Sixth Sense with another great performance by Bruce Willis and an equally strong performance by Samuel L. Jackson."}, {"rating": "8", "text": "Classic slow burner with a more believable take on a fantastical premise. A film that has aged well and personally one I love to re-watch again and again over the years."}, {"rating": "9", "text": "M. Night Shyamalan's Unbreakable is one of the best films ever made period. Everything about this film is almost perfect. Bruce Willis is amazing as the character David Dunn, as well as Samuel L. Jackson as Elijah Price/Mr. Glass. The film is also very quiet and slow and takes its time to build up the characters and the tone and pacing are perfect. In the end, this film is almost perfect and is very rewatchable."}, {"rating": "10", "text": "I don’t give out perfect 10’s easily, but Unbreakable is, without a doubt, one of the most underrated movies of all time. It's unfairly compared to M. Night Shyamalan's previous film, The Sixth Sense, when the two films could hardly be more different. The only thing they have in common is their tone and comparing them is an unfair and unproductive thing to do. In my opinion, it's M. Night's best film and one that may not have met audiences's expectations but is far more intelligent and powerful than it gets credit for being.Shyamalan has a particular style to his direction that subtly adds certain aspects to the plot through visual cues. Everything has its purpose in the story. For example, the use of contrasting clothing colours adds to the nature of the characters. Scenes of dialogue are filmed in long, uninterrupted takes that make them so much more engaging because they flow so smoothly and are so well-acted. In every scene, the camera moves to follow its subject in a way that’s seamless—mesmerising, even. The score by James Newton Howard, once again, fits the film like a glove and sent chills down my spine during the climactic final scenes.This film is remarkably well-acted. Bruce Willis gives arguably the best performance of his career, as he and every other character evoke the fullness of possible emotion—sadness, rage, hopelessness, and eventually happiness—in even the most subtle of facial expressions. The actors are aided by a clever script that explores the complexities of power, good and evil, tragedy, love and loss, and what it means to be a hero. It’s ambitious, and it balances its many themes with genius dexterity.I would describe Unbreakable as the smartest superhero movie ever made. It’s twist ending—contrary to popular opinion—is not intended to be a “WHAT?!” moment, but instead it adds another thought-provoking layer to the beautiful character arcs. The film was well ahead of its time, written long before the superhero genre was thought to be full of potential, and it still holds up to this day as a masterfully-told story of ordinary-to-extraordinary.Story: 10Acting: 10Script: 10Visuals/Sound: 10Entertainment Value: 10OVERALL SCORE: 10/10"}, {"rating": "10", "text": "M. Night Shyamalan chnged my life with this movie. Since I saw \"Unbreakable\" my mind changed about everything, especially about movies.  This movie was an enjoyable blast for me. The performances, the story, the long shots, the color work about Dunn and Glass, the mind blowing acores by James Newton Howard... they all made me have a very good time watching this movie.   To be honest, \"Unbreakable\" is obe of the best movies that I've ever seen."}, {"rating": "5", "text": "Everybody likes this movie but I've found its screenplay a little bit banal. I didn't enjoy it at all, Jackson character is not believable as a superhero and the story around him seems just like a pretext to carry on the plot of the movie."}, {"rating": "9", "text": "Saw Split so I decided to give Unbreakable a look to further understand where Split was coming from and from where I stand, Unbreakable is a refreshing take on superheros and the comic book genre."}, {"rating": "9", "text": "Unbreakable is M. Night Shyamalan's often overlooked masterpiece. It stars Bruce Willis is excellent as David Dunn, and an awesome Samuel L. Jackson in my favorite role he's ever done. There is no superhero film more realistic than this one, nor does any other superhero film have such a perfect ending. I don't want to give away any more than I should, but it's hard not to. While it's not perfect, it more than makes up for it's little flaws with it's emotional undercurrent and subtle brilliance. I could not recommend Unbreakable more."}, {"rating": "9", "text": "M.Night Shyamalan's Unbreakable is an inspiring story, the one that glued me to the screen and took a surprising path for a superhero movie. The main protagonist, played by Bruce Willis, is a very well written character, as well as his mysterious friend, played by Samuel L. Jackson."}, {"rating": "8", "text": "God, this movie really got to me. I don't know why but I really, really teared up in the end. \"They called me mr. Glass\". Just wow, amazing performances, well written script and just amazing movie. Must see, even if you don't like comic books [stories]."}, {"rating": "8", "text": "An adult version of super hero movies for those that find Marvel and DC movies childish, but believe in those. Enjoyable story, great character development and hopeful."}, {"rating": "9", "text": "This is a true little gem of a movie and easily M.Nights best movie, it's a real shame about the following movies."}, {"rating": "9", "text": "The character contrast and plot twists are genius. This work of art is not your typical superhero movie, and that's what makes it awe-inspiring. Love it, hate it, everyone is a critic, but this movie is a masterpiece of dialogue and character development."}, {"rating": "9", "text": "This is proof that The Sixth Sense wasn't a fluke and Shyamalan can still make great movies. It really sticks out among Superhero flicks because it's much more of a psychological thriller than an action blockbuster. Bruce Willis was great and Sam L. Jackson was badass as usual. The film was incredibly gripping and tense with some emotional moments. While the ending isn't as impactful as \"The Sixth Sense\" but it was still a great, unexpected twist. One of M. Night's best and a great superhero movie."}, {"rating": "8", "text": "It's not the biggest or longest movie ever, but it wasn't meant to be.  Unbreakable is a very good example of how to make a satisfying movie on a small scale.  It's atmospheric, intriguing, well acted, and directed with skill and patience.  At times it can even be emotionally powerful.  It's twist ending could have been handled a little better, but it's far better than most twist endings.  Even though the movie received mostly positive reviews I still find it to be underrated.  It shows that M Knight Shamalan can make a good movie when he really tries.  I wonder if he will ever return to form."}, {"rating": "8", "text": "Another great M. Night Shayamalan film. Nice to see two great actors at their best on display in this movie. Bruce Willis and Samuel L. Jackson were both brilliant in Unbreakable. This film was very well thought out  and everything comes together in the twist ending. This ones a classic."}, {"rating": "8", "text": "This film is a masterclass of acting and unpredictability. It gives a fresh taste to the superhero genre and gives a good in depth story. Must see"}, {"rating": "8", "text": "Although it was not as good as The Sixth Sense it was still a good movie worthy of me watching it a few times.  The twist was very good."}, {"rating": "6", "text": "Pacing is definitely an issue here as it seems to pick up and then slow down several times throughout the film. The characters were great, The premise original and interesting. The ending is a little cliched, kind of predictable but you can feel it hitting both characters when the truth is finally revealed. Not a great movie but one at least worth checking out."}, {"rating": "7", "text": "Not the typicall superhero movie you think. A great story and good acting from most of the cast, too bad it was ruined by the lack of any action. Also even though the ending was great - i expected more."}, {"rating": "6", "text": "On the one hand this hero movie is realistic and focus on the story. It is interesting how the protagonist slowly develops. Also I liked how the movie sometimes tells his story through little scenes.On the other hand it is a bit boring and has its length."}, {"rating": "8", "text": "The film develops a tense and engaging atmosphere that seizes the attention of its audience. One major quality the film has is the element of unpredictability which in some instances, creates moments of sheer awe. Also, Willis and Jackson give fantastic performances together, partnering five years after doing so in Die Hard With A Vengeance, and this time, in a more serious and collected measure that works to perfection. Unbreakable is an entertaining superhero origin tale and the type of film that director M. Night Shyamalan needs to return back to."}, {"rating": "7", "text": "Very good movie that can touch you and show you that a movie with a hero doesn't have to be dynamic, full of action and CGI with exploding cities. Its very relaxing, smooth and calm with a good ending."}, {"rating": "8", "text": "Atmospheric, suspenseful, and terrifically plotted & acted, M. Night Shyamalan's \"Unbreakable\" is a thrilling original well worth watching."}, {"rating": "7", "text": "Bruce Willis' character left his desires and dreams for love, and he regrets it since. He chose family over individual goals and was dissatisfied with his life years later, which make him and his family unhappy and at the brink of self destruction (well, divorce, I mean). That's my interpretation of the movie. If I got this right then is a 7. If not, I'll consider the movie for the literal meaning: realistic and gritty superhero movie, and at that I got a bit bored so is a 5"}, {"rating": "0", "text": "Unbreakable It is hard to review this film as a motion picture, because it feels more like TV soap opera on mute. The 1 hour and 47 minutes of boring, predictable and foolish sequences of silence in between unbelievably repetitive dialogue easily make this movie one of the most roll-your-eyes producing films I have ever gone threw. Bruce Willis plays the dull and slow-moving David Dunn, a lone and unharmed train wreak survivor who discovers that he is unable to sustain injury. Meanwhile, the emotionally unstable and easily injured Samuel L. Jackson plays the obviously brilliant yet deceiving psycho who thinks comic book heroes walk the earth. The movie unravels from somewhat interesting to boring. It takes most of the movie for what is at hand not to be dealt with, and you find yourself staring at the mysterious situation put forwards simply not breaking through with a much needed common thriller plot twist or breaking point. This is of course, until towards the very end. One central problem with the movie is that it is highly unlikely that one man would go his entire life without tripping or falling and wondering why there was no pain or injury. His mother would not wonder why he never got Chicken Pox? His father would never wonder why his knee did not bleed when he fell on it extremely hard during some catch? His wife would not wonder why when he slipped in the shower and smashed his head on the floor that he did not feel any pain? It just seems so unbelievably silly and impossible for this to happen and for nothing to be realized until a frickin train accident at the age of 40. The movie is essentially unrealistic beyond obvious proportions. The acting performances are easy and have no depth due to the pathetic script handed to the actors only to damage there impressive careers. Put simply, this movie is bad. If you wish to take my advice, avoid it by any means"}, {"rating": "10", "text": "Unbreakable isn't a film, It's an experience. An invitation into the mind of It's unique director that presents to us his vision of a mysterious and strange thriller. Unbreakable will engage your brain and keep you thinking to the end because of the insane plot twists and interesting story. This is another success from visionary filmmaker Shyamalan that serves as both a thriller, and a original work"}, {"rating": "7", "text": "Una película muy entretenida y con personajes super llamativos, un gran final y un guión aceptable. Tiene partes bastante lentas y medio aburridas, no me gusta como está filmada."}, {"rating": "7", "text": "It may not be the best movie from the past eleven years, but for fans of M. Night Shyamalan, this is a very good film.The premise about a man who survived the train accident and learns that a man who likes comic books and heroes is stalking him was spooky, but very good. The story was a very nice concept, but suffered from a weaker ending.The acting was very solid and the chemistry between Bruce Willis and Samuel L. Jackson was well built together and the pacing was very decent.The suspense was chilling and very satisfying it got me interested to want to know what's going on. The soundtrack from James Newton Howard was a lot of fun I want to check it out soon.Unbreakable's weaker ending doesn't cover it up, but like The Sixth Sense and Signs, M. Night Shyamalan did his best to give me some scares.7.3 out of 10"}, {"rating": "0", "text": "This movie is an atrocity. A souless atrocity. Every scene felt stilted and was just mindless readouts of  exposition. There was no pacing. The acting in these completely assaholic scenarios was actually more comedic than dramatic; however, this comes off as pathetic and sad in this case as opposed to actually enjoyable. I don't understand why it has such a high score on here. Were people just like \"Ooh Bruce Willis, Samuel L Jackson and comic books? That was all in my wet dream last night! Hooray!\" I don't get it."}, {"rating": "7", "text": "It lacks the suspense and creepiness that gives 'The Sixth Sense' its captivating thrills, but this is no way a stepdown. I dare to say it almost matches up with 'Sixth Sense'. The pacing is perfect, the eeriness (a trademark technique of M. Night Shyamalan) succeeds in drawing us in, and the subtle yet alluring acting (particularly Samuel L. Jackson) all adds up to be one of smartest of superhero movies."}, {"rating": "7", "text": "If ever a filmmaker vaulted from unknown to lionized status on the basis of one film, it was M. Night Shyamalan with “The Sixth Sense,” a little-anticipated ghost story that became one of the 10 highest grossers of all time. The question of whether this singular writer-director can deliver again will, by itself, guarantee a large turnout for “Unbreakable.” The answer is that he delivers much of the same: Same star, same preoccupation with telepathic and quasi-supernatural/religious powers, same hushed tone and deliberate pace, same sense of absolute control. But there are also serious differences: A weaker story, increased pretentiousness, some ill-advised narrative zigzags and a “surprise” ending that can’t begin to compare with the one in his previous picture. In addition to the draw repped by Shyamalan, Bruce Willis and Samuel L. Jackson, yarn possesses sufficient intrigue to hook audiences and keep them on board much of the way, so despite the ultimate sense of letdown, B.O. prospects are very sturdy.\r Following a mysterious prologue revealing the birth in 1961 Philadelphia of a black boy who enters the world with broken arms and legs, second scene is so good that it raises what are gradually revealed to be unrealistic expectations. David Dun (Willis) is sitting by the window on a train shuttling to Philadelphia from New York, where he’s had a presumably unsuccessful job interview.\r When an attractive young woman, Kelly (Leslie Stefanson), sits down next to him, he discreetly slips off his wedding ring and quietly chats her up, only to see her get up and move when he pushes too far. After putting his ring back on, he stares outside at the onrushing scenery until it becomes apparent that the train is moving too fast, at which point a cut to David’s son (Spencer Treat Clark) flipping TV channels reveals the news of a terrible derailment.\r Brief scene obliquely provides all the exposition the viewer needs to know — the status of David’s marriage, his job uncertainty, his willingness to move to New York — while superbly building a quiet sense of unease. Much of it is shot with an agile hand-held camera positioned behind the seats in front of David and Kelly, the cuts are all significantly timed, and the mix of sounds — the subdued vocal tones, the ambient noise of the train, the sudden whoosh of an oncoming diesel — is wonderfully subtle.\r Such a sequence establishes a sense of total confidence that one is in the hands of a master storyteller and creates an automatic viewer willingness to follow wherever he chooses to go.\r Some viewers will go along with all this, while others, like David himself, will resist. Because the mystery of where the story might be headed is sustained for so long, the film doesn’t go off the tracks all at once. But the superhero angle, which seems a bit odd when introduced, eventually feels all wrong, especially when invested with supernatural and spiritual dimensions that seem like holdovers from “The Sixth Sense.”\r And while the earlier picture cast the sort of spell that would have been disrupted by any comic relief, the presence of pop culture refs via comics makes quite notable the absence of any humor or sense of fun, just as it makes its pretentions to deep meaning and self-importance all the more specious.\r All the same, Shyamalan’s handling of individual sequences is often extremely impressive; he clearly knows exactly what he wants and how to achieve it. This time out, he receives a great assist from lenser Eduardo Serra, whose widescreen work within a subdued color scheme is enormously textured and arrestingly composed.\r Also notable among the uniformly excellent craft contributions are Dylan Tichenor’s precision editing and James Newton Howard’s supple, supportive score.\r In subdued, subtle form, Willis gently conveys the essence of a working-class man seemingly beaten down by life but mostly victimized by his own refusal to realize his true potential. Jackson lends his commanding presence and persuasive dialogue delivery to the odd role of Elijah, which never becomes fully dimensional enough despite its backstory of tragic vulnerability.\r Wright Penn doesn’t do much with the flatly written wife part, and it’s during some of her domestic scenes with Willis a little more than an hour in that pic goes into lowest gear. As the couple’s son, Clark bears more than a passing resemblance to Haley Joel Osment, but the kid plays a decidedly peripheral role in this one."}, {"rating": "8", "text": "M. Knight at his best. The twist is subtle and the story leaves a great taste i your mouth by the end."}, {"rating": "7", "text": "Commendable especially for the well written dialogue and the several long shots throughout. Unbreakable can be slow sometimes, but ultimately is a well acted and performed dramatic thriller."}, {"rating": "3", "text": "Intriguing concept, which was really poorly handled."}, {"rating": "1", "text": "Unbreakable It is hard to review this film as a motion picture, because it feels more like TV soap opera on mute. The 1 hour and 47 minutes of boring, predictable and foolish sequences of silence in between unbelievably repetitive dialogue easily make this movie one of the most roll-your-eyes producing films I have ever gone threw. Bruce Willis plays the dull and slow-moving David Dunn, a lone and unharmed train wreak survivor who discovers that he is unable to sustain injury. Meanwhile, the emotionally unstable and easily injured Samuel L. Jackson plays the obviously brilliant yet deceiving psycho who thinks comic book heroes walk the earth. The movie unravels from somewhat interesting to boring. It takes most of the movie for what is at hand not to be dealt with, and you find yourself staring at the mysterious situation put forwards simply not breaking through with a much needed common thriller plot twist or breaking point. This is of course, until towards the very end. One central problem with the movie is that it is highly unlikely that one man would go his entire life without tripping or falling and wondering why there was no pain or injury. His mother would not wonder why he never got Chicken Pox? His father would never wonder why his knee did not bleed when he fell on it extremely hard during some catch? His wife would not wonder why when he slipped in the shower and smashed his head on the floor that he did not feel any pain? It just seems so unbelievably silly and impossible for this to happen and for nothing to be realized until a frickin train accident at the age of 40. The movie is essentially unrealistic beyond obvious proportions. The acting performances are easy and have no depth due to the pathetic script handed to the actors only to damage there impressive careers. Put simply, this movie is bad. If you wish to take my advice, avoid it by any means"}, {"rating": "8", "text": "i really liked where the plot of this movie went. it gives a realistic approach of typical superhero clichÃ©'s."}, {"rating": "5", "text": "Tries to be a realistic superhero film but is ruined by Samuel L. Jackson's anything but character."}, {"rating": "5", "text": "Unbreakable is the legend of a real life superhero brought to you by M. Night Shyamalan. The idea is profoundly unique and the cast is great, but I really didn't like how it turned out. The first half of the movie was awesome, but as Shyamalan movies tend to do, it got weird, in this case too weird. While I love Samuel L. Jackson, his character was just annoying and I didn't really consider him a threatening villain. Bruce Willis on the other hand was amazing as usual, but his character was kind of bland. Shyamalan wanted to keep the story as real and believable as possible, but a super hero who just can't get hurt and has no other real powers is just kind of dull. I love the uniqueness of the story, but the film just didn't do much for me."}], "recommendations": ["the_prestige", "10_cloverfield_lane", "a_most_wanted_man", "split", "the_devil_all_the_time", "good_time", "bad_times_at_the_el_royale", "the_sixth_sense", "the_accountant", "fantastic_beasts_the_crimes_of_grindelwald", "the_rover", "midnight_special", "ex_machina", "looper", "memento", "inception", "last_night_in_soho", "the_machinist", "the_illusionist", "tenet", "the_place_beyond_the_pines", "reminiscence", "minority_report", "prisoners", "the_invisible_man"]}