{"id": 1104, "title": "Unbroken: Path to Redemption", "starring": ["Samuel Hunt", "Merritt Patterson"], "runtime": 98, "genre": ["Drama"], "description": "Zamperini returns to California where he wound up marrying Cynthia Applewhite while wrestling with untreated PTSD, suffering constant nightmares, angry, bitter and deeply depressed, his wife convinces Zamperini to attend the 1949 Billy Graham Crusade.", "releaseYear": "2018", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/oD5RxDJGdJgpX8X61QMX0qNyYYu.jpg", "categories": {"plot": 7.0, "acting": 4.5, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 4.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "10", "text": "If life has ever made you feel completely broken, this movie offers an inspiring story of hope. It is a great story of faith and inspiration. It shows how God is faithful even in the darkest hour and how God never abandons those with the smallest faith. The movie is a wonderful story of redemption in a real person who survived a most horrendous prison camp experience in World War II."}, {"rating": "3", "text": "just wait till its free its just a huge bust of a movie. Its a **** type of movie just skip it and go see the meg or Predator."}, {"rating": "4", "text": "Path to Redemption attempts to piggyback on the success of a much better movie by continuing the true story of Louis Zamperini. It depicts his struggles with PTSD and alcoholism after WWII. Showing how he was able to overcome both through finding faith in God. I like how faith-based films are beginning to explore darker subject material, but this is an emotionally flat effort that's missing it's predecessor's uplifting nature. This is because Harold Cronk's (of God's Not Dead infamy) poor directing and a largely lifeless cast.There's a good story to be told here. Cronk just didn't know how to tell it. The displays of Zamperini's suffering and the support he got from his family feel phony. Something that cheapens the veteran and former Olympic runner's story and robs the eventual salvation moment of any impact. Of course it also doesn't help that our leads and most of the supporting cast are almost totally unconvincing. Watching the people onscreen flounder through the big emotional moments is painful.Then there's the film's problem with dictating the passage of time. I was literally floored when Zamperini's wife revealed that she was two months pregnant when what felt like barely a few days had gone by since it was revealed that she just found out it happened in the first place. That's because nothing really significant happened to let me know all this time had progressed. The movie apparently takes place over the span of a few years, but it's impossible to know that until you witness Zamperini's daughter go from baby to full-on toddler seemingly out of nowhere.I will give the movie credit for it's PTSD-induced nightmare and hallucination segments. They're the only times where the direction shows any sort of flair. They're quite well done and maybe even a bit scary. It was also a nice touch to get Will Graham to portray his grandfather. Andrew Caldwell is also pretty funny.One of the biggest criticisms faith-based films often receive is that they exist solely to allow Christians to confirm for themselves that they're lifestyle is the right one (as if preaching to the choir is an exclusively religious trait). Saying that about this movie might giving it too much credit however, as I'm pretty sure it doesn't even do that right. Zamperini's surrender to a higher power felt like an afterthought. Every reference to God seems secondary to Cronk's stale recreation of post-WWII America.So stick to the Angelina Jolie film. This doesn't do justice to the tale of an American hero or even the religion it is supposedly representing. This may sound like an insult, but the credits are the best part of this movie. During them they show some real of footage of (a much older) Zamperini talking about what he went through and how he was able to move on, as well as an amusing little anecdote at the very end. These brief scenes after the movie technically ended were more emotional than anything in the actual film itself. It was some genuinely good stuff that we weren't able to get in the roughly hour-and-a-half before hand.4.5/10"}, {"rating": "6", "text": "Though not a particularly well-made film it has decent performances and  a moving story."}, {"rating": "6", "text": "Es una película pasable; la trama es decente y la actuación de Samuel Hunt es buena."}], "recommendations": ["machine_gun_preacher", "exodus_gods_and_kings", "the_road", "into_the_wild", "heaven_is_for_real", "silence", "i_still_believe", "just_mercy", "the_book_thief", "the_boy_who_harnessed_the_wind", "risen", "dark_waters", "lone_survivor", "unbroken", "the_33", "greenland", "miracles_from_heaven", "united_93", "snowden", "sin_nombre", "collateral_beauty", "the_lost_city_of_z", "zero_dark_thirty", "the_hunt", "the_mauritanian"]}