{
  "id": 4051,
  "title": "Uncharted",
  "starring": [
    "Tom Holland",
    "Mark Wahlberg"
  ],
  "runtime": 116,
  "genre": [
    "Action",
    "Adventure"
  ],
  "description": "A young street-smart, Nathan Drake and his wisecracking partner Victor “Sully” Sullivan embark on a dangerous pursuit of “the greatest treasure never found” while also tracking clues that may lead to Nathan’s long-lost brother.",
  "releaseYear": "2022",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rJHC1RUORuUhtfNb4Npclx0xnOf.jpg",
  "categories": {
    "plot": 4.214285714285714,
    "acting": 3.935483870967742,
    "ending": 5.0,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 5.666666666666667,
    "funny": 5.9,
    "action": 6.380952380952381
  },
  "reviews": [
    {
      "rating": "1",
      "text": "The storyline is wrong The actors are casted because of their connections not their skillsThe main roles were given to people that look nothing like the main characters ( looks, behaviour ,age )Acting skills were completely off and not even trying to put an effort into itScript was so whatever not even trying to make good jokes or deep conversationsMovie was too short for an uncharted game based movieIf you were a gamer and you grew up with the franchise you’d hate its gutsOnly good actress and casting was Tati and she was like a character from the gameIf they wanted something different they could’ve made another non related movie cause it was actually just stealing the names without any relation to the real games"
    },
    {
      "rating": "10",
      "text": "I’m a HUGE fan of the Uncharted games, and I LOVED this movie! I was nervous going into it, but I was not disappointed!!! Definitely an amazing movie!"
    },
    {
      "rating": "6",
      "text": "WOKENESS8.0ACTING7.0PLOT/STORY/MESSAGE6.0MUSIC/SOUND5.0DIRECTING/EDITING/VISUALS7.0ADAPTATION6.0"
    },
    {
      "rating": "3",
      "text": "The action scenes are great. This is the only good thing on this movie. The story is terrible and force a lot of bad plot twists. Sulivan isn't a good character and Antônio Banderas is like   a figurant. I hate it"
    },
    {
      "rating": "4",
      "text": "Oof. Barebly watchable. Had a few nice moments, and some nice CGI and EFX, but what a nonsensical plot and dialogue drivel. A waste of some acting talent. It's sort of as if one took the National Treasure franchise to the ultimate extreme of ridiculousness, and then tripled that! National Treasure was a fun romp. This was just silly, nonsensical, and painful to watch (though I forced myself to watch to the end. I'll never get that time back.)"
    },
    {
      "rating": "6",
      "text": "Its a fun movie, I think the story could get away as an Uncharted story. Tom Holland is an ok Nathan Drake, Sophia Ali is a good Chloe but Mark Wahlberg is not sully at all."
    },
    {
      "rating": "5",
      "text": "It could be an average movie if not related to the game. I didn't watch Holland's Spiderman movies so I didn't confuse his role as Nathan Drake with Peter Parker. Yet I couldn't see any resemblance with Nathan Drake himself. This Drake though a young man looks more a troubled and lost teenager. He doesn't do anything that great in the movie that we could see him badass like Nate is in the game. Sully looks more like a new character as well a Chloe. Though the movie picks a lot of eferences and background from other chracaters in the game franchise including the comics. The antagonists are uncharismatic, uninteresting and some of them you easily forgets as the movie goes on. There's nothing really great in the movie"
    },
    {
      "rating": "4",
      "text": "Tom Holland as Drake? Tf? This is literally just the same **** as any other treasure hunt movie ever. Lack of originality."
    },
    {
      "rating": "0",
      "text": "Yet another video game movie we didn't want or need. Tom Holland plays, Tom Holland next to Mark Wahlberg who looks like he'd rather be somewhere else. Horrible casting, generic writing and basically a massive insult to a great series of games."
    },
    {
      "rating": "0",
      "text": "Una de las películas más estúpidas que he visto, el elenco es de los peores, una de las peores adaptaciones de un videojuego."
    },
    {
      "rating": "0",
      "text": "Rafe ruins yet another franchise. First wheel of time, now this. How does this clown keep getting hired?"
    },
    {
      "rating": "6",
      "text": "Well, Tom Holland is great. Mark Wahlberg is abysmal. Nothing of the fatherfigure that Sully is supposed to be for Nate. Bad jokes and some unbelievably bad acting on Wahlbergs part.The story is fine. Some ultra unrealistic moments that are really stupid. Sense of adventure is really great though."
    },
    {
      "rating": "7",
      "text": "Typically video game movies do not have a reputation for making a good movie, this one was pretty decent. I had never heard of the game before, I went in with a fresh perspective and expectations. It had good humor and adventure. I did read in previous reviews that it reminded people a lot of National Treasure and I very much agree. There were moments in the moment that were predictable or made me roll my eyes but come on, it's a video game movie. I expected a number of those. I would recommend seeing this to my friends looking for something fun to watch. Be sure to stay for an after credit or two. Side note, not sure if anyone else noticed Rotten Tomatoes sensors the users scores on this movie. Throttling reviews. Which made me come here instead."
    },
    {
      "rating": "2",
      "text": "Not very interesting, poorly thought out, actors phoning it in, convoluted with plot holes, many scenes in place to just move the movie to the next scene."
    },
    {
      "rating": "6",
      "text": "Based off the hit Playstation video game series, Tom Holland stars as treasure hunter Nathan Drake, who teams up with Victor Sullivan (Mark Wahlberg) to find a lost stash of treasure that Nate's missing brother went searching for, all while trying to outrace a wealthy and powerful businessman (Antonio Banderas) from getting to it first. While I never really played the games at all, I still found myself looking forward to this one, as it appeared to be a pretty fun adventure flick worth passing the time for, and sure enough, it delivers on the entertainment factor just fine, even if it gets a little ridiculous and over-the-top with the action at times. Furthermore, Holland and Wahlberg make for a great and oftentimes witty and amusing duo. Their chemistry and teamwork was easily my favorite part of the film. The action is quite entertaining throughout as well, and storywise, it gets the job done well enough despite being a little cliche and 'been there, done that', as well as having a frustrating cliffhanger of a mid-credits scene. But overall, it's a fun and passable enough action flick, even if you're not too familiar with the games or have never even played them."
    },
    {
      "rating": "2",
      "text": "Kinda cheap looking & entirely forgettable...that's what this movie says to me. For a big treasure chasing adventure movie it actually looks abit cheap & the set piece scenes are underwhelming until they finally do go big & it's just brain dead stupid. Antagonists are incredibly forgettable & leave no mark on the audience whatsoever. If you asked me their names now i couldn't tell you, the antagonists in the movie are one of its weakest points & actually include a plot twist that makes things even worse in that area.However there is no denying Tom Holland's ability as a leading man, he certainly produces charisma in spades which is lucky as Mark Whalberg is a charisma vacuum. Who knows Tom Holland's star power might draw a sequel but all i was left with was a feeling of a missed opportunity of what could of been."
    },
    {
      "rating": "2",
      "text": "Garbage Movie the two points are from the opening PlayStation studio's movie intro and from the Nolan North Cameo."
    },
    {
      "rating": "0",
      "text": "Incredibly bad. I had low expectations, but this was still disappointing. Don't waste your money"
    },
    {
      "rating": "0",
      "text": "This movie absolutely hecking BAD. They just care about money, not audience."
    },
    {
      "rating": "3",
      "text": "Terrible casting, bad writing.. doesn't feel like uncharted ar all. play the game and you'll see."
    },
    {
      "rating": "2",
      "text": "SOOO forgettablefelt like a cutscene not a movieEvery plot point felt so basic and none of the characters had any real personality'sWas just very basic movie and a huge disappointment"
    },
    {
      "rating": "0",
      "text": "I'm at a loss of words.... it was just awful. The movie made no sense whatsoever. I cried while watching it. How can someone ruin an almost perfect story this bad?"
    },
    {
      "rating": "5",
      "text": "Tom Holland teams up with Mark Wahlberg in this adaptation of the titular video game. They're off to recover a lost treasure, while dealing with several people who are also after it with much comic repartee. The chemistry between the 2 leads is passable, but the dialogue never gives them much chance to explore it. Interestingly, Wahlberg was originally supposed to play the younger role, but time took its toll, so Holland shows off his newly-pumped torso 3 times, while Wahlberg dons a tank top. As for the adventure aspects, anyone who's willing to accept the absurdly improbable plot will have lots of action scenes to take their minds off the implausibility of it all (unless you rely on video game logic). The pace never lags and some of the visuals are grand,  but the whole thing feels forced and hokey. NOTE: Stay thru the early credits for one final scene that sets up the sequel."
    },
    {
      "rating": "2",
      "text": "Não gaste o seu dinheiro.Uncharted(2022) é bem pior que Resident Evil Bem-vindo a Raccoon(2021) e Tomb Raider(2018).Historia e personagens: Uma historia genérica de um caça a tesouro qualquer com personagens desinteressantes, Nathan Drake(Tom Holland) sem  carisma com uma motivação fraca e que não faz sentido, Victor Sullivan(Mark Wahlberg) Um personagem bem medíocre,Chloe Frazer (Sophia Ali) Com pouco tempo de tela, ela não sabe o que fazer na vida, fazendo   com que a gente esqueça dela. E os vilões? só esquece. Atuações: Bem já vi piores mas esse é bem mediano, Antônio Banderas, Tati Gabrielle e Tom Holland não fizeram um bom trabalho, Sophia Ali e Mark Wahlberg foram bem medíocre. Direção e Trilha sonora: A direção foi o único ponto \"positivo\" porque as cenas de ação bem ruinzinhas e bobas mas a direção melhora um pouco.A trilha sonora são umas musicas \"populares\" chatas e um remix da musica original.Resumo: o filme de Uncharted não tem o carisma, historia, personagens e atuações que os jogos tem: nota 2,6"
    },
    {
      "rating": "3",
      "text": "La película no tiene nada de parecido a los videojuegos, podría haber tomado cualquier nombre la película pero menos \"Uncharted\".La película contiene escenas de acción muy entretenidas donde Tom Holland (Nathan Drake), hace buen trabajo en las escenas de acción accion, pero está totalmente fuera de lugar como personaje de Nathan Drake."
    },
    {
      "rating": "7",
      "text": "The movie is good, especially for fans of the uncharted saga. It's not perfect and it shows that playstation is learning how to make movies of its games and even so it seemed like a quite enjoyable movie."
    },
    {
      "rating": "6",
      "text": "I enjoyed a smidge more than half the film such as witnessing the arduous visuals, action sequences, and international antagonists that are at the same level as the games that I highly admire.I obviously had some flaws with this flick such as making Nathan Drake and Victor Sullivan look younger, Elena's absence, and some of the jokes that do not make me smirk identically in the games. The one time I most definitely smirked was when a cast member made a cameo. What this film lacks is that in the video games there was always a plot twist in the final chapter/act such as the truth behind Drake's mission and him doing some thinking for his own to put an end to the mutiny, making me nickname Nathan Drake \"Nothin' Muckrake.\" Another flaw that this movie has is the pasting of environments from the games and the movie not originating a set that feels like I'm re-watching a cutscene from one of the games.To top it off, this film is like a summer blockbuster released in February that is enjoyable to sit through but concerned about the story."
    },
    {
      "rating": "1",
      "text": "Sabe aqueles dias que você está sem nada para fazer e quer assistir qualquer porcaria do cinema trash?. Uncharted se enquadra nisso, filme clichê."
    },
    {
      "rating": "3",
      "text": "Il film è prevedibile ma piacevole. I fan tipo Paci lo hanno apprezzato ma non avendo giocato al gioco posso solo valutarlo come un film di avventura senza troppe pretese"
    },
    {
      "rating": "1",
      "text": "The movie brought the map of China's cow's tongue line into the film, losing its quality, losing its image worthy of a star"
    },
    {
      "rating": "0",
      "text": "Una muy mala película, aunque se arruinó más cuando se fue la creadora original"
    },
    {
      "rating": "0",
      "text": "Superficial content, bad acting, use of illegal documents, advocating violations of international law."
    },
    {
      "rating": "1",
      "text": "I didn't know this movie was based off of a video game, so let me start there. I wanted a good treasure hunting Sahara type movie. This movie was TERRIBLE. I mean, so bad that I almost walked out of the theater. ZERO chemistry between any of the actors. There were no funny parts or lines. I mean, you didn't even get me to have one chuckle. The acting was beyond horrible. I had zero empathy for any of the characters. It was like a really really bad kids movie, except kids movies now are better than this. People- save your money and time. Skip this movie."
    },
    {
      "rating": "8",
      "text": "I came into this moving having played precisely 4hrs of Uncharted games - it's probably a good thing as even a basic knowledge of the characters revealed that casting was a bit odd. However, as a fast paced action romp that I could enjoy with my son it was actually pretty good. Pretty much exactly what you'd imagine if someone said \"imagine a globe trotting Indy-lite action film with a half decent cast and budget\""
    },
    {
      "rating": "8",
      "text": "I'm a huge Uncharted fan, so I thought I'd dislike this film, given how long it has been in development and how controversial certain aspects of it have been. But I honestly really enjoyed it. It's not the perfect movie, and we all know some aspects of the casting could've been improved. But regardless of that, the film was lots of fun, and had a really exciting sense of adventure and exploration. The acting was mostly solid, the sets were awesome, the action sequences were exciting, and the story was interesting too - especially in the ways it set up potential sequels. It felt like Uncharted to me, even with different faces than the games. I'm hopeful the movie will perform well, so we can get some sequels, that lean more towards the games!"
    },
    {
      "rating": "10",
      "text": "One best video games movie ever you got to watch it just amazing  ⚘"
    },
    {
      "rating": "10",
      "text": "Uncharted is the craziest and the most amazing thing i've seen this year so far, just a reminder that i was one of the people who never played the game, i did know the name but i have zero knowledge about the story and all that stuff from the game, and as one of those people Uncharted is a complete banger, Uncharted is like Indiana Jones and Pirates Of The Caribbean become one, add with some of the best movie scene i've ever seen, the experience that i have, the tension and there is one particular scene that just literally make my mouth wide open because how intense and how amazing that scene was, and i'm not talking about one scene only, there's a lot, Uncharted also fill with some incredible performances especially Tom Holland, which i think this is his best performance besides Spider-Man, Wahlberg did a fantastic job too and so do all the other cast, the comedy surprisingly works so well, i did laugh a lot on the humourous scene, and it just works perfectly, and of course the best t hing is the choreography, the action scene, add with also an incredible cinematography, all of that was just fascinating and exciting, overall Uncharted is really the best action movie i've seen in a long time and definitely one of if not the best video game movie adaptation i've ever seen, Uncharted is also one of those movie that you must watch with a great sound and biggest screen possible which is on the theaters, watch it there, it's a hell of an experience, Uncharted is already one of the best films of the year."
    },
    {
      "rating": "2",
      "text": "A pretty bad adaptation with no consistency. Scenes that we have in the game are found in the film. Except the film takes place in the past and the games in the future?????The screenplay isn't great, but that's not what we ask of the film, ok, but here the screenplay isn't even a little interesting.The passage with the flying boats is nonsense, we in Uncharted not a film of SF or fantasy. Ok the Uncharted are very exaggerated but not to this point.The actors are good but Tom Holland plays Spiderman at times and making Nate so clumsy and very annoying.The special effects are good but there are a few not-so-great moments.The moment in the city reaches a terrible moment with shots and actions everywhere for several minutes, and people don't react, the police never come, it's totally nonsense.It's a very average movie and even if you take it as an action movie, it's very far from being a good action movie. A film which wanted to make Marvel but which did not succeed because not the same universe, no character known to the general public.And they took Tom Holland for one reason...the girls. There were a lot of girls in the room, at least 70%, who were screaming at certain passages in the film. We can clearly see that the actor was chosen to bring in a female audience. And when you choose an actor for that, it's because you don't trust your film or because you knew that if you didn't, you wouldn't get as many admissions to the cinema."
    },
    {
      "rating": "5",
      "text": "Uncharted benefits quite a lot from the charisma brought by Tom Holland. Which is more than positive considering that he is the face of the film, but it's worth noting that this is basically the most important thing he can offer to this role, mostly because the script doesn't give him elements to prove otherwise. It's too early to say that as an actor he doesn't have much range, but Cherry was not a good showcase for him in that regard, and in The Devil All the Time with only one scene. Robert Pattinson completely devoured him.Uncharted is a film that tries in every way to be fun.It tries to be expansive, it tries to be and feel really big, and even though I really didn't want to mention this, because the film doesn't have to look like the video game, the video game itself has an aura the film simply can't replicate.I think the casting outside of Holland and Mark Wahlberg was pretty bad.Antonio Banderas gets completely squandered as one of the villains, while Tati Gabrielle completely lacks the credits and skills to be the real villain the film required.I was basically watching her do the same thing she did in the Sabrina show for Netflix.Acting cheeky and seductive just doesn't cut it. Even for this story.And Sophia Ali share's no chemistry with Holland. The main strengths of this tale lie in its action sequences, and some of them are pretty great, but they don't quite make up for its biggest gaps. The narrative feels completely made as it goes along, and while it's well known that a film like this doesn't need a big plot, you can't offer something so thin either. The problem here isn't that it doesn't offer entertainment, because it does, and for some people that will more than enough, but to me it felt like a soulless entertainment, that lacks wit, charm and spirit.Uncharted feels empty, despite its visual spectacle. Which upon completion will leave no lasting impression."
    },
    {
      "rating": "7",
      "text": "I love the uncharted games, so I was very excited to see this. At the same exact time, I was worried that it would be hot garbage, so I was hesitant. But I can confidently say that I had a great time watching this movie. It was fun, Tom Holland was charismatic as usual and fit as Nathan Drake better than I thought he would. Mark Walberg was also great, although I get a different vibe from his Sully than the one in the games. Admittedly it could have been better for sure. The villains were a pretty cliche at times, and I wanted to hear more of the uncharted theme music because it's the best. But overall it was great fun, and I'd watch it again. Sort of reminds me of how I view Pirates of the Caribbean. It's super fun to watch, but it can be a bit wonky at times."
    },
    {
      "rating": "0",
      "text": "I don`t understand movie companies these days...Just because one actor is suitable for a particular role and brings millions to the box office, that does not mean put that same actor to play a character he can no way even resemble, let alone be like that character...Actors like Keanu Reeves, Ryan Reynolds, Clint Eastwood... they are suitable for a particular role and same goes for Holland...A complete miscast... It took them years to make this movie happen and they blow it just because they had one successful actor for a movie franchise. And don`t even get me started with Sully..."
    },
    {
      "rating": "8",
      "text": "I went in with very low expectations for the movie. And I left the movie theater and enjoyed it, I thought there was a lot of the game, I bought the idea of ​​Drake and Sully being young, being everything in the beginning. I loved the references, like Nolan North, Nathan's actor in the games, appears, Nathan's clothes in the post credit scene, white and red, would be the clothes he would wear in the first game.I thought the movie was fun, with good action scenes."
    },
    {
      "rating": "10",
      "text": "Great movie, I really love it. Funny movie that will keep you entertain throughout the movie."
    },
    {
      "rating": "1",
      "text": "The pacing is horrible. The acting is typical trash you'd see from Marky Mark. Tom Holland is a gem, but there was nothing he could do with this script other than say the words and collect his pay check.I found myself asking why Nicholas Cage wasn't in this movie. Then found myself realizing that even the Nation Treasure movies told a more cohesive story that obeyed the rules of physics more than this film.The one redeeming quality from this movie is that we've properly identified the niche in which Mark Wahlberg should be acting."
    },
    {
      "rating": "7",
      "text": "A huge fan of the games, having played through all 4 and the spin-off, and I gotta say it a was really enjoyable movie. Tom Holland had an incredible performance as a young Drake. Wahlburg as Sully on the other hand acted nothing (and looked nothing) like the original character but still pulled through a solid performance. I also really liked the actress who played Chloe, she definitely brought the Chloe vibe from the games. The set pieces were great and the action overall was to notch as could be expected from a blockbuster production like this. This definitely could have been better though, and people coming into this expecting a very loyal adaption of the games might leave a bit disappointed. Regardless, I still had a really fun time with it and am looking forward to see where this goes next if they decide to go with a sequel."
    },
    {
      "rating": "0",
      "text": "Disgrace to the game, bad casting, terrible acting, outrageous writing and not even a B action movie. Studios simply think they can show Tom Holland's face and earn money, well he is worst choice for playing Nathan. Simply casted a young guy so they can keep taking this **** franchise for years to come. Movie has nothing to offer. Not even CGI cringefest"
    },
    {
      "rating": "10",
      "text": "I thought uncharted was good and hop for a sequel in the future as the box begins this morning"
    },
    {
      "rating": "8",
      "text": "It is a surprisingly solid movie! Movie makes clear from the start that this is only an adaptation of Uncharted and is separate from the action sequences were reminiscent of the games! Story is okay and it creates this sense of adventure, mystery and discovery like games did.It felt short and I wanted to see more. More action scenes, more time for character development and puzzles but understandably you can’t fit it all in 2 hours. Looking forward to the next chapter"
    },
    {
      "rating": "0",
      "text": "This movie is straight garbage. Tom Holland sucks as per usual. Play the games instead."
    },
    {
      "rating": "1",
      "text": "Mauvais film. Je connais pas les Uncharted. Je connais en tant que licence de jeu mais j'y ai jamais joué. Donc je l'ai prit comme un simple film d'action. Et bien en tant que simple film d'action il est pas très bon. Il y a des moment qui ressemble à des films fantastiques (coucou les bateaux volant), bizarre je pensais le film ce passant dans le réel.Les effets spéciaux sony toujours bien fait et le scénar n'a aucun intérêt en étant clairement mit de coté pour un prétexte à de l'action.L'actrice principale joue très bien. Tom Holland nous fait du Tom Holland. Maladresse, 3 expression différentes et c'est tout. Il joue exactement pareil que dans Spider man. Mark Wahlberg joue bien son rôle même si j'ai bien compris qu'apparemment selon les fans, ce n'était pas un bon choix par rapport au personnage du jeu et que les scénariste on prit quelques liberté.Pas mal de fille adolescente lors de la séance, certainement parce que Tom Holland. D'ailleurs elles parlaient que de lui à la sortie du cinéma. Certainement pour ça qu'ils ont choisi cet acteur.Les décors sont pas mal mais par moment ça fait un peu trop décors de studio comme le bois de vieux bateaux qui font un peu fake par moment."
    }
  ],
  "recommendations": [
    "lara_croft_tomb_raider",
    "tomb_raider",
    "hitman",
    "prince_of_persia_the_sands_of_time",
    "jumanji_the_next_level",
    "bloodshot",
    "the_a_team",
    "aquaman",
    "hercules",
    "mortal_kombat",
    "jumanji_welcome_to_the_jungle",
    "brick_mansions",
    "venom_let_there_be_carnage",
    "the_last_witch_hunter",
    "edge_of_tomorrow",
    "the_three_musketeers",
    "seventh_son",
    "shazam_fury_of_the_gods",
    "sonic_the_hedgehog_2",
    "jumper",
    "poseidon",
    "terminator_genisys",
    "the_suicide_squad",
    "pan",
    "free_guy"
  ]
}