{
  "id": 2132,
  "title": "Uncut Gems",
  "starring": [
    "Adam Sandler",
    "Lakeith Stanfield"
  ],
  "runtime": 136,
  "genre": [
    "Drama",
    "Thriller",
    "Crime"
  ],
  "description": "A charismatic New York City jeweler always on the lookout for the next big score makes a series of high-stakes bets that could lead to the windfall of a lifetime. Howard must perform a precarious high-wire act, balancing business, family, and encroaching adversaries on all sides in his relentless pursuit of the ultimate win.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6XN1vxHc7kUSqNWtaQKN45J5x2v.jpg",
  "categories": {
    "plot": 7.5227272727272725,
    "acting": 8.044444444444444,
    "ending": 8.222222222222221,
    "soundtrack": 8.0,
    "cinematography": 8.333333333333334,
    "familyFriendly": 3.0,
    "funny": 8.5,
    "action": 7.555555555555555
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Didn't find one flaw in this film.  The ending was unexpected and sad, but definitely powerful and real.  The gambling business can be very dangerous and if you watch this film you'll see why.  Must watch movie and one of the best of the year.  Definitely oscar worthy for next year."
    },
    {
      "rating": "9",
      "text": "This movie owns. It’s so intense and immersive and thrilling. I loved it."
    },
    {
      "rating": "9",
      "text": "Acting across the board is 10/10.  The Directors did a great job showing the human emotion with betting on sports.  It's funny, tragic, and exciting.  One of my favorite films in 2019."
    },
    {
      "rating": "9",
      "text": "The Safdie Brothers and Adam Sandler never relent in Uncut Gems. One scene after another, they continue to nurture and grow the building anxiety in the air. As Sandler's character continues to spiral downward in a pit of his own creation, you cannot help but watch and cheer him on to dig deeper. As the final scene concludes it leaves a sense of exhaustion in its wake, but it is not long before that exhaustion is replaced by a hunger for more."
    },
    {
      "rating": "9",
      "text": "HOLY (insert expletive here!!!!) This has got to be the most anxiety-inducing film I've seen in a LONG time! In this film, Adam Sandler plays a charismatic New York jeweler, who finds himself in over his head with several gambling debts he owes to various loan sharks and criminals throughout the city. In order to pay his debts, he must resort to desperate measures, such as pawning or selling various valuables, including a beautiful opal stone, and even betting thousands of dollars on Kevin Garnett in Celtics games. Sandler definitely plays against type in this film, ditching his silly comedy and slapstick humor he's become so associated with (for better or worse.) However, some of his humor and style does squeak in a little here and there, but it takes on a whole new meaning in a more dramatic and tense context, which this film carries in spades! He's never been better and finds a great balance for his character, cheeky and carefree at times, but also no-nonsense in others. Other familiar faces include Idina Menzel as his wife, and Celtics player Kevin Garnett as himself. Storywise, it kept me thoroughly anxious for nearly the whole time, as I constantly kept wondering how he'd be able to get himself out of various situations throughout the film. The pace gradually picks up speed, and my feelings of nervousness and anticipation only increased as the film progressed, while the film's final five minutes or so literally making my jaw drop! Overall, it's dazzling, tense, and doesn't let up until the very end! And what's more, it's undoubtedly a surprising and impressive change of pace and showcase for Sandler, who truly delivers an unforgettable career-best performance!"
    },
    {
      "rating": "7",
      "text": "Uncut Gems could have been cut. While I love the break neck pace, and the unrelenting, constantly building anxiety, there were several story elements that could have been cut to make a more streamlined, tightly focused feature. I am a big fan of Good Time, the first film by the Safdie Brothers, and I honestly think Uncut Gems is just a messier, less focused Good Time.That being said, I was a huge fan of Adam Sandler's performance. It really was one of the best of the year, and he capably carries the movie on his shoulders. Kevin Garnett has a breakout performance that I really enjoyed, and the performances of Lakeith Stanfield and Eric Bogosian were excellent additions to the cast. The score is great, and the cinematography is really well done. I loved how the titular gem in the movie was given such mythical properties by the characters.Overall, Uncut Gems is not a bad movie at all. It just wasn't my favorite of the year."
    },
    {
      "rating": "8",
      "text": "The Safdie brothers nailed it.  You've got high intensity, quick claustrophobic cuts that really bring out the dire situations of Howard (Sandler), who will most justly and most likely pick up some best actor noms as well as some wins elsewhere, and I'd not be surprised to see the screenplay up for awards.  Certainly deserving.  This film knocks on many doors. Not just gambling and gems. There's worldly social commentary, a little bit of Jewish history and modern culture.//  You're a fly on the wall to the method of Howards madness, and no matter how tumultuous, you'll never want to get off his ride, even when you know he's wrong.  Sandler sold it solid, with a great a surprising ensemble cast paving the way for him to shine.  I see a little later-Lumet in this film, and some sprinkling of David O Russell.  But inspirations aside, this film does anything but rip on it, but rather creates a new 21 century film, through unique editing, cuts keep the story always cresting, and one more time, Sandler kills. Knocks em dead. I give it a solid 8/10."
    },
    {
      "rating": "9",
      "text": "Uncut Gems is beautiful chaos, stress-inducing, anxiety triggering manic chaos, I'm still catching my breath from watching it, there isn't one dull second in this film, it's fast-paced storytelling with endless charm and authenticity. Let's talk about the essence of this film, Adam Sandler materializes Howard Ratner with all his baggage, the bad and the good, he embodies this character and brings it to life, I'm really tempted to call this his best work to date, it's a big claim but it deserves it, \"Punch Drunk Love\" was something else but this is just breathtaking, honestly, it just wows.The Safdies brothers really went for it with \"Uncut Gems\", their acid-infused filmmaking is on full display yet again, they shaped the narrative near damn flawlessly and gave Sandler a fantastic story to work with. A power trip that will play with your primal senses, that's the best way to describe it, absolutely great."
    },
    {
      "rating": "10",
      "text": "i’m literally here to clear the air for some of y’all. most reviews i’m seeing are from people that don’t understand the premise of the whole movie.  They complain about it being too anxiety ridden and the ending to be unsatisfactory.  In reality, the purpose of the movie is to make you hate Adam Sandler and to play with the emotion of greed and how that can ultimately get you killed (as he does). everything happened to illustrate that point.  His addiction to gambling getting in the way, him getting **** over at the auction was all a way of setting up the inevitable ending and the greed he has for something that has consumed him and his reality. That’s why at the end the bullet hole is zoomed in on and we see allof the sparkling colors.  This shot was completely ripped from the beginning scene to further drive that point across.  The Gem is HIM he can’t think of anything else. As far as the writing and cinematography is concerned that is perfection in my eyes. It is there to make the watcher feel the intensity of the characters and the situation their in.  The editors and the director want to make you hate Howie and they SUCCEED.  As he keeps digging himself deeper in this hole i found myself just yelling at him to stop."
    },
    {
      "rating": "10",
      "text": "Wonderful shocking new side of Adam Sandler. The film was Everything movies used to be it took you into the story made you fell like you knew the character  and you didn't want it to end but all good things come to an end it respect for the way it ended even though you didn't want it to end that way. was a beautiful performance by Adam Sandler.I almost don't want to see him do comedy's after this. As for supporting actress Julia Fox there's a star in the rise  Bravo on a side note she would make a bad ass Black widow black cat in Spiderman or Catwoman very strong beautiful actress."
    },
    {
      "rating": "8",
      "text": "Tense movie loved it. Made my chest hurt my wife bite her fingers. Just as good as good time if not better. Adam Sandler's performance was amazing."
    },
    {
      "rating": "9",
      "text": "Adam Sandler plays a phenomenal role as a Jewish New Yorker high-end jewelry dealer who has trouble with money and finds himself in a lot of trouble. It is tense and thrilling from start to finish, I had a mild feeling of anxiety the entire time as Adam dug himself deeper and deeper into a hole. The ending is absolutely bonkers on many levels. A24 strikes AGAIN."
    },
    {
      "rating": "10",
      "text": "Absolutely manic and beautifully shot and scored. Performances are an absolute standout, but really no one should be surprised at that."
    },
    {
      "rating": "8",
      "text": "“This is how *I* win.”One of the most stressful movie experiences I’ve had in awhile.This whole movie runs entirely on acid and how the series of events unfold was particularly stressful. People constantly talking or yelling over each other while the brilliant sound work made the space around them feel so tight, but incredibly claustrophobic.While I like ‘Good Time’ a little more, but man what a rush.Adam Sandler is absolutely terrific as the greedy and sleazy Howard Ratner. If he's working with a good director, a strong supporting cast, and an interesting concept, Sandler will thrive. We follow Howard Ratner, a jewelry store owner in New York with a serious gambling problem that makes the hole his standing in deeper and deeper. Despite every terrible decision his character made...I still felt sorry for him. I think it has to do with Sandler's devilish charm that won me over into pitting such a petty crook. He isn’t a loser, he’s a winner who doesn't win. It’s one of his best performance right beside ‘Punch Drunk Love’.Benny and Josh Safdie are such vibrant directors that can inject so much style while also having a harsh look to it, which ties in with the slimy side of business. The Safdie Brothers are building a solid career for themselves. Darius Khondji outstanding cinematography is the glue that holds this high tension of a movie together.I loved the score from Daniel Lopatin, which will often drown out the dialogue as the retro rift comes blasting through. On the other hand, there’s also a slow mystical vibe that Lopatin composes that gave me a surreal feeling of levitating.Kevin Garnett is surprisingly really good in this movie. A professional basketball player actually delivering a solid performance is almost unheard of. It kinda reminds me of Tyler Perry ‘Gone Girl’, in terms of your expectations from them vs what you got. I also couldn’t believe this is Julia Fox first acting debut, because she’s fantastic in the movie.Overall rating: While I’m only two movies into their filmography, Safdie Brothers are upon my favorite working directors.I hope they make another movie like 'Good Time' & 'Uncut Gems', so it can called the LSD trilogy."
    },
    {
      "rating": "5",
      "text": "From the beginning we see a self-destructive guy who in all probability will come to a bad end. He’s got so many plates spinning (jewelry store, 3 kids, mistress, wife, black opal, bookie, prostate, pawned rings, creditors, auction, relatives), and we’re shown over and over that he’s completely incompetent in every area of his life and unlikely to keep any of them afloat. It’s just a question of which plate is going to fall first. We’re left to wonder how this person lacking common sense ever came to own a jewelry store in Manhattan’s prestigious diamond district or what his wife and mistress ever saw in him in the first place. This is a guy who’s willing to make huge risks to get rich quick, so I never believed for a second he would ever take the 5 months necessary to meticulously research the mining industry in Somalia and figure out how to successfully acquire that black opal. And if he is that kind of careful investor he wouldn’t just impulsively loan it out 10 minutes after it arrives! I also didn’t believe this manic reckless adrenaline junkie would ever have the presence of mind to schedule a prostate exam. His death was a forgone conclusion; the only question was how. If the Safdies wanted to really surprise us they should have given us a happy ending where all those plates remain safe due to sheer luck mixed with some previously unseen genius on Howard’s part. As for the relentless intensity, it was mostly without variation and thus felt monotonous, redundant and just noisy. Having said that, there's enough here (mostly Sandler's performance) that warrants 2.5 stars. I know there’s a barrage of critics who loved it; to each his own."
    },
    {
      "rating": "10",
      "text": "Uncut Gems is a dizzying rush from start to finish. Adam Sandler delivers his best performance to date, and reminds the audience that when given the right film, he can really shine. The Safdie Brothers have always been an intriguing pair for me and their last film, Good Time, was one of the best films I saw in 2017, which was packed with incredible performances. Their directing style is very different and off the wall and it shines through here as well. The film is frantically paced (for all the good reasons), and doesn't let the viewer catch their breath for even a minute. LaKeith Stanfield and Julia Fox were very good in their roles as well."
    },
    {
      "rating": "7",
      "text": "Get A Discount On The Uncut GemsThe Stream: Typical storyline and some really bad teethThe Big Screen: An intense film that depicts the dangers of gamblingThe Final Bill: A solid movie that is best watched in a loud environment and with friends-S2SHappy New Year! Your present is a couple gems about Uncut Gems. This movie stars and I do mean stars Adam Sandler in what some may say is his best performance. It’s a mix of classic Sandler with terrible teeth and good acting. Sandler plays a jeweler who constantly finds himself too deep in the situations he’s created. Let’s see if he can dig himself out.The summary above is the most I can give you without ruining the already simple storyline. Strangely enough, the movie is predictable but not ruined by that fact. We’ve seen this plot in many movies before, but it’s the execution and the cast that differentiates this movie. Sandler, LaKeith Stanfield, Julia Fox, others and yes even Kevin Garnett do a really great job in this movie. Sandler’s performance, minus the teeth, was the perfect stereotypical portrayal of this character. When we he is high, we are high. When he is manic, we feel manic. Ultimately, I found myself saying how deep can my man go and get out of, and boy, do we find out.Here are the trouble spots of this movie, which might be controversial. This movie is “too loud” for some viewers. Everything in this movie is loud, over the top and in your face. While I enjoyed most of it, I do realize how this atmosphere/culture displayed could be “annoying or offensive” to certain viewers. I can understand how certain viewers just wouldn’t appreciate the contemporary nature of things occurring in the movie. Some might say it’s too “urban”. *side eyes those people* But truthfully, the movie was on the borderline of being too in someone’s face.Long story short, Uncut Gems is a film that is both super predictable but nevertheless not ruined by its predictability. The intense nature of this film ultimately lends itself to being seen. Now, I leave that up to you all. You absolutely don’t need to see this in the theater, but I will note the nature of the big screen and music could amplify the viewing nature. Your best bet is watching this at home with a few betting friends and make a few drinking game wagers through the film."
    },
    {
      "rating": "10",
      "text": "Howard is everything a likable, believable protagonist should be and he will grab your heart from start to end. This is a thriller unlike any other and it will leave you stricken and would make you rethink life."
    },
    {
      "rating": "7",
      "text": "The last film by the Safdie brothers was Good Time and a lot of that film's milieu and style parallels this one (my review). Adam Sandler plays a frenzied, somewhat obnoxious jeweler in New York City. The big score that drives the narrative is complicated by his side trips into compulsive gambling, the resulting multiple debtors and marital infidelity. Sandler relishes the opportunity to play this oversize character. The Safdie's have crafted the film with an adrenaline-fused style that propels the action with a convincing supporting cast, noisy situations and an energy continually verging on chaos and calamity. In an attempt to tweak the tension even more, they’ve added a rather incongruous soundtrack. Some will find this film (and Sandler's performance) mesmerizing. Although I appreciated what the directors are doing, I never found Sandler's character sympathetic or compelling."
    },
    {
      "rating": "8",
      "text": "7.9/10  I was excited to see Sandler in another versatile role though was somewhat reluctant to believe in another a24 production as they've been mostly pretentious misses in my eyes. This was easily one of the exceptions due mostly to Sandler's dedication he brought into the grimy and slimy character of Howard. The story is straightforward enough, but the constant problematic conundrums that arise at all corners keep the intensity at high levels throughout and you cannot wait to see what unfolds though you know it will be inevitably troublesome. Once everything comes to a head, the story's tension unravels into a shocking finish. If you're a fan of Adam Sandler, you'll need to understand this is a different version that he saves for his most passionate roles, though he's still the same brilliant funnyman we all know in parts. Some of the soundtrack is overwhelming and off putting at times but really that's my only complaint. Otherwise it's a solid dramatic thriller."
    },
    {
      "rating": "7",
      "text": "In 2017, Josh and Benny Safdie let their frenetic, pulse-pounding, morally murky stylings loose with \"Good Time.\" I guess they were really holding out on us, however, because \"Uncut Gems\" takes literally every element that I enjoyed in \"Good Time,\" and ups the ante, for both better and -- in some cases -- for the slightly less better. Things just never feel easy in this movie. There's always some ticking clock, force of pushback, or complication preventing our main character from getting what he wants. It places you in a state of perpetual unease and it's quite well done. And speaking of main characters, one can't possibly opine on \"Uncut Gems\" without discussing Adam Sandler's performance. What else is there to say that hasn't already been said? It's simply sublime, if performances this slimy and disgusting could ever be. Every event and amount of pressure mounted perfectly manifests itself into Sandler's behavior and demeanor, giving you the honest to God impression that this guy's toilet of a life is really starting to overflow. And like \"Good Time,\" this film definitely steers away from the crowd-pleasing ending, though it may do so a bit too drastically for my tastes. Where \"Good Time's\" ending felt bittersweet and apt, this one simply makes you realize what you've really just finished -- a real workout. I'd be shocked if even the most emotionally jacked human beings didn't leave feeling sore."
    },
    {
      "rating": "10",
      "text": "A movie that doesn't rely on the loveable hero or a cliche story, its real and centres around a character who's intentions are generally good but morally questionable, he's not a good guy but not a monster either. You really get a sense that this is what many of us are like when put in a hole trying to solve all our problems by ourselves but sinking further, apart from the sound levels this is a great movie"
    },
    {
      "rating": "10",
      "text": "An absolute travesty that Adam Sandler wasn’t nominated for an Oscar for this"
    },
    {
      "rating": "7",
      "text": "Messy: a broad umbrella term that encapsulates all of what \"Uncut Gems\" is. The film is a two-hour cringefest thanks to its sporadic unsettling visuals (a colonoscopy with no plot relevance, really!?) and a multidirectional plotline laced with interminable violence. The pacing of the film was so rapid-fire that I found myself without any time to catch my breath or process what I had just learned/seen. Having to check my phone to understand who was who and what was going on (seriously), I missed the next detail of the movie. Not to mention that the plotline was met with an abrupt and nonconclusive ending.However, where the film redeems itself is in its engagement by virtue of strong acting performances and character development from Sandler and Menzel. The embodiment of fictional characters as portrayed by these actors develops an emotional bond with the audience, leading to an instantaneous investment in the film's endeavors. Plus, there is something to be said for a messy plot that plays mind games: you seek for answers. Unfortunately, I left the theater unsatisfied with the ambiguity that was both preestablished and unanswered."
    },
    {
      "rating": "7",
      "text": "Uncut Gems may lost itselfs to tell a story, with exessively dirty and dazed atmosphere, but it doesn't be denied that's such a expressive film."
    },
    {
      "rating": "8",
      "text": "This film is so hard to put into words. For its whole entire two hours and fifteen minutes run time, you're overwhelmed with anxiety, but you can't look away. It entangles you in its simple yet deeply complex plot and keeps you begging for more."
    },
    {
      "rating": "3",
      "text": "Very painful and unenjoyable to watch - couldnt make it to the end and stopped after watching maybe 75%. I don't need to watch an obvious trainwreck - maybe if there was some suspense and it started more positive I would be more attached to the character. But I'm not going to feel sorry for a POS."
    },
    {
      "rating": "1",
      "text": "I rarely take the trouble to post reviews here, but this film was SO BAD that I had to say so. Neither my wife nor me could see any redeeming value at all in the endlessly obnoxious, yelling of Sandler's hideous character. For the first time I can remember, we looked at each other about 60% through and agreed, \"Enough of this garbage.\" Can't understand at all the praise for it. Not a single character was the slightest bit likable nor did the plot matter at all. So many good films to spend one's precious time with; this ain't one of them by any measure."
    },
    {
      "rating": "5",
      "text": "Typical Sandler movie. I never liked his humour, so I didnt expect much. And most of the movies with him have a stupid, unrealistic story. Yes, Sandlers performance was very good."
    },
    {
      "rating": "5",
      "text": "Sandler plays the part to perfection (could easily typecast him in this role) but the frenetic pace and unrealistic scenarios made it somewhat boring.  Kevin Garnett was quite a surprise but he really didn't add much."
    },
    {
      "rating": "7",
      "text": "Ok, So this is a good movie but I wouldn't exactly call it a fun movie.  Anyone that has problems with anxiety or heart issues might want to think twice about seeing this flick and I know what i'm talking about because I am a Doctor.  Sandler's character is doing so much crazy, chaotic stuff it is sure to make some boisterous son-of-a-gun get up in their seat and yell \"what in the PETE is he doing?!\"  Sandler is basically a gambling addict who plays with other people's money and makes risky parlay bets that make you think to yourself \"are you serious?\"  I really understand why some people don't like this movie.  Its not because its bad, boring, or the acting is crap-o-la, its because it makes you sick to your stomach with the hectic action and that action doesn't give us as an audience a chance to breath.  Still I liked it and i'm a respected doctor so that has to say something.Bob Lee, MD"
    },
    {
      "rating": "10",
      "text": "This is not your typical movie, and you need to be prepared for high anxiety and non-stop dialogue and changing scenery for the entire 2+ hours.  Not a motion sickness issue, just non-stop drama, poor decisions from main actors, and waiting for someone to jump out and knock some sense into the main characters.  I realized i was so wound up with anxiety during the movie when I checked my phone to look at the time and realized there was another 1+ hours left to go!  Adam Sandler is great, and showed his true acting ability, which was a surprise.  This is no comedy, although some of us laughed nervously at a few points in the show just to release the tension.  Shocking ending that made me gasp out loud, which I never do.  I have minor heart disease, and with about 15 minutes left in the movie, I was overwhelmed and needed to stand up and raise my arms to reduce tension and breathe deeply.  It worked, and I was able to enjoy the ending.  I have to admit, there were times I wanted to leave because of the foolish choices being made, but I was so invested I just couldn't.  Well done movie, and highly recommended.  Just be aware of the anxiety factor and a fast moving flick from start to end."
    },
    {
      "rating": "8",
      "text": "This is the opposite of a feel-good movie. Watch at your own risk. I have to give it props for being nerve-wrackingly exciting. I did not fiddle with my phone once, and that hasn’t happened in a very long time."
    },
    {
      "rating": "9",
      "text": "Great Movie. Sandler is really essential to this film. No one can draw you into a character quite like he can. The chaotic atmosphere is essential to the character and his flaws. I don't like or do spoilers so I will say that it is a must-see movie that took quite a long time to make. It paid off. Indie feel with some real people featured in the movie. As always, please choose a good theater with a good respectable crowd to see any movie of substance. A good or great movie can be tarnished by a bad theater experience."
    },
    {
      "rating": "8",
      "text": "It's very well-acted, well-written and gripping from the beginning till the end. The ending was especially crazy and actually quite depressing. Overall a very intense movie with little to no flaws. I'll give it an 8.7/10"
    },
    {
      "rating": "9",
      "text": "Enjoyed it. Does move at a frantic pace and never seems to slow down, but it works in the end. The music is annoying at times especially in the beginning when it felt like it was never going to end, and it can be loud, but again it works out in the end"
    },
    {
      "rating": "8",
      "text": "This movie was bananas ,Adam Sandler should have gotten at least an Oscar nomination.I would have given 7 but for Julia Fox's fine ass I gave them a grade up."
    },
    {
      "rating": "10",
      "text": "I generally don't like this actor but after this performance I have completely changed my mind. Seriously good."
    },
    {
      "rating": "9",
      "text": "Excellent movie. Adam Sandler does a very good job embodying his character. The looming sense of the eventual collapse of Howard's shoddily built empire is fascinating to watch and you get unavoidably anxious watching it all come crashing down"
    },
    {
      "rating": "7",
      "text": "I can see how critics are raving about this movie, but it was too much of a nervous rush for me. It also makes me wonder about the critics' views these days, as they blasted Joker and loved this one... what is going on?If you love a tense thrill ride, then this is definitely the movie for you. Sandler plays his role incredibly well and the supporting cast is great too. But again - tense, sometimes dragging, but won't let you go."
    },
    {
      "rating": "10",
      "text": "The movie is fantastic due to its unique style.  There is no introduction of the characters and it feels like you are actually watching a real-life scenario.  You get to learn about each character as the movie goes on and understand what is really happening as it starts off extremely fast and never slows down.  It feels like you are always watching the climax."
    },
    {
      "rating": "0",
      "text": "I thought this movie was trash. No likable characters. Chaotic plot with characters who deserve everything that comes to them. Takes 2 hours to really go anywhere and ends in a meaningless fashion. Honestly one of the worst movies I've ever seen and I wish I never spent the time or money."
    },
    {
      "rating": "9",
      "text": "It's one of those films that you think about hours and days after you see it. Sandler always nails the dramatic roles (Punch Drunk Love, Spanglish), and he crushes this one.  Thought Mike Francesa and KG did really nice jobs with their roles."
    },
    {
      "rating": "9",
      "text": "The Safdie Bros's movies are just like nothing else on the big screen. I loved Good Time, and I was anticipated this movie more than anything else this season. It delivers, with just minor drawbacks (which I can't go into - as they're plot spoilers).  As someone who is obsessed with the NBA and the way that it interfaces with sports gambling, I'm, I guess you would say, the target audience.  And Sandler is incredible, as I suspected he would be.  Adel Dazeem is also really good in a smaller role.  However, the big find in this film is Julia Fox as Howard's (Sandler's) girlfriend.  She's the x-factor in this fun, fast-paced, and ultimately frenzied pic.  If there were ever a reason to go see a film on the big screen - (screw all that comic book garbage) - this is it."
    },
    {
      "rating": "5",
      "text": "Adam Sandler plays his part well.  While the chaotic lifestyle may be somewhat realistic it's too much to watch for two hours.  Simple plot that just drags on."
    },
    {
      "rating": "9",
      "text": "It's a very good movie about a bunch of complete degenerates. If that doesn't sound appealing, this probably isn't for you."
    },
    {
      "rating": "10",
      "text": "Might 5 be Sandler’s best performance with the greatness of punch drunk and the funny parts of Sandler, the role fits. It’s pretty cool film that always keeps you paying attention while it goes 1000 every minute"
    },
    {
      "rating": "1",
      "text": "Ok, more than two hours spent watching a movie without content, story, message or whatever a decent movie is supposed to have. Good Adam Sandler but I would never recomend this movie to anyone."
    },
    {
      "rating": "9",
      "text": "This movie is either Adam Sandler yelling **** at people, Adam Sandler being yelled **** at by people, or often both at the same time. And its awesome. Most fun movie of the year, I can watch this over and over again."
    },
    {
      "rating": "9",
      "text": "Very good movie with an excellent lead performance from Adam Sandler. Much has been said about the adrenaline pace and frenetic direction of the Sadfie Brothers. The movie lives up to those claims of it being a shot of adrenaline  and making you feel the anxiety of Sandler's character. I was hooked from the moment it started right up to the end. The movie reminded me at times of Silver Linings Playbook, specifically Robert De Niro's, superstitious gambler character in that movie. Uncut Gems has some hilarious moments where Kevin Garnett and Adam Sandler both get caught up in superstitions and Sandler's character is a gambling addict if there ever was one. The final act of the movie contains the all time crazy bet in movie history with more parlays than one can count. Strongly recommend this movie. For those who are thinking about seeing the movie but are not sure, should check out \"Good Time\" on Amazon Prime. That was the Sadfie's brothers last movie and contains a similar frenetic style."
    }
  ]
}