{
  "id": 1860,
  "title": "Underworld: Rise of the Lycans",
  "starring": [
    "Rhona Mitra",
    "Bill Nighy"
  ],
  "runtime": 92,
  "genre": [
    "Fantasy",
    "Action",
    "Thriller"
  ],
  "description": "A prequel to the first two Underworld films, this fantasy explains the origins of the feud between the Vampires and the Lycans. Aided by his secret love, Sonja, courageous Lucian leads the Lycans in battle against brutal Vampire king Viktor. Determined to break the king's enslavement of his people, Lucian faces off against the Death Dealer army in a bid for Lycan independence.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yW9gF7rGn8EoV8B8rxOx1xjxVZf.jpg",
  "categories": {
    "plot": 6.916666666666667,
    "acting": 7.473684210526316,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 7.583333333333333
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A very good prequel movie. I definitely hope they make a 4th in the series sometime after the events of the 2nd movie. Definitely a must watch movie!"
    },
    {
      "rating": "4",
      "text": "\"Underworld: Rise of the Lycans\" is the same tedious vampire vs werewolf movie. There's nothing new, but its Michael Sheen's brilliant performance that will keep you entertaining."
    },
    {
      "rating": "8",
      "text": "I wish I could actually decide to watch a movie based on a movie critic's review... but yet again they totally got it wrong about this movie. I wasn't expecting much when I went ahead and watched it but actually liked it almost as much as the first Underworld and definitely better than the second in the series. Any fan of this genre should at least see it once just for the epic werewolf (what seems like 1000 werewolves) stampede."
    },
    {
      "rating": "10",
      "text": "Better than Underworld 1 or 2. From Effects to scripts to acting."
    },
    {
      "rating": "4",
      "text": "I'm very disappointed at Underworld: Rise of the Lycans. The script is just not looking too good and I was feeling emptied on why Kate Beckinsale didn't return as the sexy vampire hunter, Seline. I thought the series were going to be dead on arrival, but thanks to her comeback in Awakening, I feel like I'm in heaven for more of that wickedly kick-ass moves and killing more vampires. Nothing new for Lycans, however, Martin Sheen's performance look pretty good, I might say. So in conclusion, Rise of the Lycans, rather safe than sorry, but this is one of the worst sequels in the Underworld series."
    },
    {
      "rating": "5",
      "text": "While nowhere near as bad as the 2nd installment of the Underworld series it is still a toothless, soul sucking experience. The change in setting and time period actually help with the return of menacingly good villain Bill Nighy. The loss of Kate Beckinsale can only be seen as a positive (although she does bookend the film) with a prequel story which knows how to have fun. Rise of the Lycans doesn't take itself seriously which is one of the main reasons its enjoyable. However they have gone from one wooden female lead to another with Rhona Mitra's Sonja being just as useless and tiresome as Beckinsale's Selene. While bringing back Michael Sheen and making it an origins story does add a certain gravitas, it fails to wow or at least entertain mainly due to its clearly reduced budget, wooden female lead and depressingly bleak design. Not awful but nowhere near great."
    },
    {
      "rating": "8",
      "text": "Definitely the best of the bunch (which may change when I re-watch Evolution) but this was more enjoyable to watch than the first two as it was much more involved. You got to learn a lot more about the history and, as the title says, the Rise of the Lycans who turn on their Vampire owners. Beckinsale is absent but is replaced by the equally as stunning Rhona Mitra, and its also great to see Michael Sheen back playing a more likable Lucian. Overall an enjoyable film and fans will be pleased"
    },
    {
      "rating": "10",
      "text": "the entire series was amazing.....the story is intelligent, amazing action sequences and great acting. Fills the gaps of the wanted answers."
    },
    {
      "rating": "7",
      "text": "It's a decent movie and it's nice to know more of the back story to the rest of the Underworld series. I love Rhona Mitra, sexy sexy sexy sexy. Pretty good action in this one."
    },
    {
      "rating": "10",
      "text": "Underworld - Rise of the Lycans is a 2009 horror film directed by Patrick Tatopoulos. The film is about the beginning of the feud between vampires and Lycans Lucian came when he decided to rebel against the tyranny of vampires. The film is the prequel to the first two and could also be considered the best in the Underworld saga. With a great cast, dark atmosphere, great fights and good special effects, the film manages to entertain the audience well and never bored."
    },
    {
      "rating": "9",
      "text": "Altough I'm a little late with the review.. After watching U: Awakening, U:RotL seem's like a treat to the eyes. The era in which it takes place, the story behind the entire UW realm makes this 3rd installment one of the best in the series. UW, was great. U:E was so so. U:RotL rises above the others (including U:A). The acting by Bill Nighy is just amazing, to his character. In most scenes.. There was something to focus on. In Viktors (Bill Nighys), I couldn't overt my eyes from his character for nothing. Those gazing stares, that amazing accent and the over-all UMF he puts in every one of his scenes, was simply awesome. Micheal Sheen held the second best character of Lucian. His acting was flawless as well. You could really tell he put his heart into it, as well as Bill Nighy. Both set the stage for an awesome flick for those die-hard fans of the UW saga. And last but not the least, Rhona Mitra as Sonja was great. She held the character well and did her part to make this an epic addition to the UW series. A must watch and definite see on Blu-Ray!"
    },
    {
      "rating": "7",
      "text": "44? You're kidding right?\r This movie has a clichè plot and story, but its fun anyways, and with stunning performances by Bill Nighy, Michael Sheen and Rhona Mitra, you won't regret watching it. It's a really good prequel to the series, and is definitively recommended to watch. It's maybe not the best movie out there, but it deserves at least 70/100. I mean, c'mon. It's a good werewolf/vampire movie, and definitively the best in the Underworld series so far!"
    },
    {
      "rating": "0",
      "text": "I liked the first one. This one...well...it is SO bad that it really doesn't deserve the words to review it. There is absolutely nothing good to say about this movie. Don't they screen these things before finally releasing it ? Somebody, anybody, must have noticed that it sucks on each and every level. Simply appalling !"
    },
    {
      "rating": "10",
      "text": "I'm a fan of the series and this film was more of the same which as far as I am concerned is the perfect recipe. Complex story, great visuals, action etc. Loved it!!!!!!"
    },
    {
      "rating": "10",
      "text": "Good plot, all of us at the office thinks that is helps explain some of the backstory, although Kate is hotter"
    },
    {
      "rating": "10",
      "text": "Great prequel! It fleshed out some of the characters you had seen from the other two movies better and helped explain the past. I really like it. Underworld was great, Evolution was better, and I think this one was right up there."
    },
    {
      "rating": "3",
      "text": "I was very disappointed in this film!!! I have read some of the views from some of you & my question is, \"If you're such fans of the Underworld series why didn't you get board with the movie???\" I was reading someones comment saying that it asnwered a lot of questions. What kind of questions did it asnwer cause the frist movie told this entire story!!! This movie didn't even go with the first movie!!! It was like it was it's own story not a continuation of the first or second movie. I kept sitting there saying when are we going to get past all of this & jump to the future. It told the majority of the story the same as they told it in the first movie until they got to the end. The way they killed them (lucian & sonya)was different from the first movie cause they had an audiance before but not in this movie & also lucian was supposed to have thought dead (in the first movie viktor thought lucian was dead) not Viktor. So to me the thought of the rise of the lycans would have been the present day lycans comming back agaisnt the vampires & that is how the new daughter of viktor makes her way back to the vampire family since she is an outcast now, There is so much more I was looking for withthis movie but not a story that I already know. It was a good movie for someone that had not seen the first movie cause action wise it is good. But for a huge fan of the first Underworld movie this was a waste of my money. I could have waited till it hit the dollar movie theater or even video."
    },
    {
      "rating": "10",
      "text": "Awesome film. victor is a badass."
    },
    {
      "rating": "3",
      "text": "Cgi was awful, the story overwhelmingly bad. not one good thing to say. underworld 1 & 2 you just cant compare to this trash."
    },
    {
      "rating": "7",
      "text": "Underworld: Rise of the Lycans is a very good prequel that delivers a lot of payoff moments for longtime fans. The movie goes deep into the lore and history of the franchise, imbuing itself with an excellent atmosphere of old-world horror-fantasy. With the emotions fixed center stage (it is ultimately a film about star crossed lovers) and some fantastic performances from the series' staple's Michael Sheen & Bill Nighy, Underworld: Rise of the Lycans is a movie that will delight Underworld fans and entertain most other people as well."
    },
    {
      "rating": "9",
      "text": "I really don't have many bad things to say about this. The fact that this movie was done by a different director but still turned out on par with the first two, to me, is unheard of in the industry. Well DONE!\r - Still, somehow the CGI is unimpressive. (-1)\r - Also, thought that Sonya's death was pretty underwhelming. Not saying I want a gore porn, but I think her prolonged suffering shown viscerally is necessary in these types of films. She cried a bit and then \"oh, wait, she's dead already?\". I might just be kind of a **** up person."
    },
    {
      "rating": "7",
      "text": "First off, this is the first Underworld movie I've watched, and for a medieval vampire movie it's pretty epic, and story-line wise pretty interesting. If you're a first-timer to Underworld movies then the ending will leave you confused, but it also leaves you wanting to watch the previous movies to understand it, which in my book is a plus. Watch it"
    },
    {
      "rating": "7",
      "text": "The story of the prequel was interesting and the result wasn't bad, The acting was good, the practical effects were well made and there was enough action and blood to keep viewers entertained.It's still the weakest out of the three."
    },
    {
      "rating": "10",
      "text": "This is definitely the best one after the first and second \"Underworld\" films. Simply because on the story and the background are more like for werewolves and vampires. While the first and second films they put both of those legendary races fighting with modern weapons, which made them almost powerless on their own but too much rely on the weapons. I am looking forward on the 4th and 5th one."
    },
    {
      "rating": "8",
      "text": "Spartacus with Werewolves and Vampires.Fills in the historical aspects of the series very nicely. Martin Sheen is terrific. (I became of fan after his portrayal of Castor in Tron Legacy)."
    },
    {
      "rating": "7",
      "text": "So what is this? Another sequel to Underworld after Underworld: Evolution? No, actually. It's actually a prequel, with no Kate Beckinsale as Selene! But how is that possible? Well, it's because it's an origin story that is taken place before Selene is hunting for Lycans. Many centuries ago a werewolf battle known as Lycans are at war before Selene was born. And one vampire elder named Viktor had a daughter named Sonja and one adopted son named Lucian. Lucian escapes Viktor's fortress but is being whipped and imprisoned. And Viktor knows all about him and Sonja. Now Lucian has to go and rescue Sonja from Viktor and Lucian and the Lycans are at battle. Yeah, I can see why this is taken place and I can see why this is a prequel. Lucian is actually a bad guy in the first film and Tannis from the second film is the one who help Selene and Michael. Now then, I actually like this one because I kind of liked the idea of where it has sword fights against werewolves and castle fortresses. Don't get me wrong, I did like the Underworld fine despite it's pretnetiousness and I actually think that Underworld and Rise of the Lycans are better than each other now that is saying much. Underworld: Rise of the Lycans is an obscure film to a certain extent much like Underworld. Now that I've got that decent prequel film out of the way I am now ready to do a sequel with Kate Beckinsale returning as Selene. Stay tuned for that!"
    },
    {
      "rating": "8",
      "text": "Underworld: Rise of the Lycans is a great prequel that abandons the modern day setting of the previous movies and instead goes to a medieval style setting for some epic vampire vs werewolf battles"
    },
    {
      "rating": "10",
      "text": "it´s a sequel that tell´s us the beginning of the history and it´s very good enjoyable movie"
    },
    {
      "rating": "9",
      "text": "Very good prequel movie. In my opinion it's as good as the first one and really makes the viewer understand what happened before the first film. It left me wanting more, I recommend it."
    },
    {
      "rating": "7",
      "text": "I've never been a HUGE fan of the Underworld series...always loved the concept but was indifferent with the execution. The films have been a combination of soap opera-like drama and over the top borderline absurd action, but for the most part they were \"fun\". Rise of the Lycans is probably the better film of the series...while the 2nd film was the most polished of the 3, this one has the most \"oomph\" behind it. The action seems a bit bigger and borderline epic...given the material, but it still comes off a bit flat. It tells the story of a Lycan (Lucean is his name, I believe) and how he rose from being a slave to the vampires, to a sort of leader. He dosen't really hate the vampires..at first...just tolerates them, but when its exposed that he is having secret \"meetings\" with one particular female vampire...well...the worst happens, and he quickly becomes veangful and hate-filled. The action is over the top, which is to be expected...the FX are nice one minute and Nintendo 64 graphics the next, which is ALSO to be expected...overall...entertaining as an action film. I've always hated the use of color...these films are like \"Visual Sleeping Medication\"...the use of blacks and blues makes my eye-lids heavy, but its the \"mood\" of these films. In the end...its a worth a look if youre a fan of the series and a buy for the more hardcore. I had my fun with this film...but its nothing im gonna plunk the money down for. Recommended as a RENTAL."
    },
    {
      "rating": "8",
      "text": "This one is by far better than the first two. There were some pretty good characters in it. This also puts a completely new approach on the series will make you actually think about which side you want to win the war. Normaly in movies like this there are the bad guys and the good guys but this with this movie thats just not the case. It is more realistic in the sence of both sides having there rights and there wrongs because in real life people are rarely completely bad and never completely good. So in the end it will just come down to your own opinion. Assuming you saw the first two. But this isn't a bad place to start if you haven't or if you have no other way of watching the others. This one was alot more emotional that the others. Big time. I won't give anything away but by the time your done watching the movie you will definitely notice that. It was good and I'm glad I went to see it. It was worth it. I also liked Rhona Mitra's charicter way more than Kate Beckensale's because it was a ton deeper. The whole series has just gotten a ton deeper thanks to this prequel."
    },
    {
      "rating": "10",
      "text": "a must watch gory prequel to the two amazing underworld movies."
    },
    {
      "rating": "1",
      "text": "I despised this movie on every level. From the incredibly bad overacting of the lead villain to the entire storyline which had nothing novel, nothing to say, and nothing to show. Absolute crap. It insults your intelligence at every level. Give some credit for decent set design but this is the type of movie that they make you watch in hell."
    },
    {
      "rating": "10",
      "text": "I'm not a fan of Underworld, however I enjoyed the first two. And now this prequel, which as many say \"needless\" absolutely completes the first two. One can bragg about how needless it is and how badly it displeased him or her, but one would never tell straight up, that actually they were expecting a \"new story\". Just be honest. However we all knew very well, at least should have known, long before the movie came out in theaters, that it is in fact a prequel. You don't have to be a fan of Underwolds to know that \"Rise of Lycans\" would probably be about the times when warewolves had to rebel against the vampires. Of course when opressed, when else woudl they?! Good job, awsome movie. P.S.: Someone had a good point, but Where in the first two of Underworlds did Viktor say or think that Lycan was dead?!"
    },
    {
      "rating": "10",
      "text": "Most reviews where bad i believe this movie really captures the concept that everyone can get along lol. but the battle between the vampires and the lycans is a good mix."
    },
    {
      "rating": "9",
      "text": "I enjoyed this movie even though I felt the FX could have been a little better. Great job Michael Sheen, Bill Nighy, Rhona Mitra, Steven Mackintosh, and Kevin Grevioux"
    },
    {
      "rating": "7",
      "text": "it could had been better but its really well made with little errors."
    },
    {
      "rating": "10",
      "text": "Great film. kept with the original direction of the other two films. A+ a must see film."
    },
    {
      "rating": "9",
      "text": "This is one of the best vampire/werewolf movies/series visually ever made."
    },
    {
      "rating": "10",
      "text": "Great movie! Best in the series. I hope that they will continue the story from the end of that movie. Loved it. Can't wait for the blu-ray release."
    },
    {
      "rating": "10",
      "text": "I thought the movie was fantastic. even my wife loved it and shes not really a fan of this type of movie. great action, told the story well, i loved it. for sure will buy it when it finally makes it to dvd. If you at all liked the first 2 underworld movies, do yourself a favour and go see this. you won't be disappointed."
    },
    {
      "rating": "9",
      "text": "Very well done. Great plot, good acting, and not corny like the 2nd one!"
    },
    {
      "rating": "8",
      "text": "I thought it was an entertaining flick. Certainly kept my attention more than Benjamin Button!"
    },
    {
      "rating": "10",
      "text": "Very good film. I loved all of the Underworld movies and I think that the third instalment is just as good as the others. Michael Sheen is fantastic as Lucian!! A must for fans of Underworld."
    },
    {
      "rating": "10",
      "text": "This was a fantastic movie. Richard Gere is top notch as the cave troll. Darryl Hannah was incredible as the golden dragon. Of course, we can't forget about the Coen brothers, who both made cameo appearances as the werewolf twins of Oogletville. Finally, Josh Groban was excellent as the vampire who managed to sing a few awesome heart wrenching tunes that destroyed all the lycans. Last but not least was when Ricky Schroeder showed up as the elder vampire and demanded 500 cows be sacrificed in his honor. You have to see this movie. Classic."
    },
    {
      "rating": "9",
      "text": "Very good story, very good acting. Didn't suffer without Kate. Really enjoyed it and hope they continue the series."
    },
    {
      "rating": "4",
      "text": "I didn't care for the other Underworld films, same goes for this unnecessary prequel. All special effects, no substance or real point. Dark dreary and unappealing."
    },
    {
      "rating": "6",
      "text": "All I can say is that this movie was a total surprise ! The first Underworld movies were nothing more than plotless funny trash. But this movie was surprisingly good, with REAL good acting from Bill Nighy and Michael Sheen. And, opposite to the other UW movies, this one has a PLOT. This epic forbidden love tale was really interesting. The action scenes were just more of the same. I'm glad Beckinsale was not part of the cast."
    },
    {
      "rating": "6",
      "text": "If this movie weren't part of a trilogy, it would be a decent standalone fantasy/action movie. As part of a trilogy, it bothers me a little because it sets aside established concepts of how the various creatures compare in power. In this installment, vampires are basically regular people with pale skin and sun sensitivity. They compare equally with regular humans in combat, and are, for the most part, no match for werewolves. That annoyed me, but for the most part, I enjoyed this prequel to the superior and original Underworld, and the horrid Underworld II (Evolutions)."
    },
    {
      "rating": "7",
      "text": "For those who are following the bloodlines, this is a fairly accurate telling of the story we all knew. Sheen and Nighy are excellent actors and held the movie together even with poor dialog and bad acting by the other cast members. A must see for fans, not so for newbies."
    }
  ],
  "recommendations": [
    "underworld_awakening",
    "i_am_number_four",
    "the_last_witch_hunter",
    "the_twilight_saga_breaking_dawn_part_2",
    "underworld_blood_wars",
    "underworld_evolution",
    "the_twilight_saga_eclipse",
    "i_am_legend",
    "the_twilight_saga_new_moon",
    "terminator_genisys",
    "percy_jackson_sea_of_monsters",
    "the_mummy_tomb_of_the_dragon_emperor",
    "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader",
    "hercules",
    "the_thing",
    "riddick",
    "terminator_3_rise_of_the_machines",
    "transformers_dark_of_the_moon",
    "underworld",
    "resident_evil_damnation",
    "edge_of_tomorrow",
    "prince_of_persia_the_sands_of_time",
    "pirates_of_the_caribbean_on_stranger_tides",
    "superman_ii",
    "red_dawn"
  ]
}