{
  "id": 2133,
  "title": "Underworld",
  "starring": [
    "Kate Beckinsale",
    "Scott Speedman"
  ],
  "runtime": 122,
  "genre": [
    "Fantasy",
    "Action",
    "Thriller"
  ],
  "description": "Vampires and werewolves have waged a nocturnal war against each other for centuries. But all bets are off when a female vampire warrior named Selene, who's famous for her strength and werewolf-hunting prowess, becomes smitten with a peace-loving male werewolf, Michael, who wants to end the war.",
  "releaseYear": "2003",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zsnQ41UZ3jo1wEeemF0eA9cAIU0.jpg",
  "categories": {
    "plot": 5.217391304347826,
    "acting": 4.392857142857143,
    "ending": 7.0,
    "soundtrack": 1.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.608695652173913
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I LOVE Kate Beckinsale. She is amazing and the guy who plays Michael was a pretty good choice. As a matter of fact, it seems that all the actors played their characters well. The back story is pretty good and I love the way they filmed it, but I just wish there would have been better choreography and a better final battle."
    },
    {
      "rating": "9",
      "text": "This was a Spectacular movie I liked the action packed scenes and the forever rising climax. I also liked the special effects."
    },
    {
      "rating": "10",
      "text": "Excellent movie."
    },
    {
      "rating": "8",
      "text": "A guilty pleasure.Good vampire films are rare.This one has depth. The mythos around Viktor and the elders was fun."
    },
    {
      "rating": "9",
      "text": "One of the best Underworld movies. In fact it might be the best. You either hate or love these movies. I love them."
    },
    {
      "rating": "9",
      "text": "Really enjoyed this movie till the last second. What's fun about it is that there is no good or bad side. The transformation scenes are really well done for a 2003 film. I recommend it to anyone looking for a good action movie."
    },
    {
      "rating": "9",
      "text": "1st of the Underworld' trilogy.\rNot excellent but close to be one of the best Vampires/Lycans movie ever. A pitty that sometime it decline and can look like a B-movie."
    },
    {
      "rating": "10",
      "text": "Selene is a Greek name. Seleneophile is a name for someone who loves the moon and Selene is the Greek name for the Goddess of the Moon"
    },
    {
      "rating": "9",
      "text": "Not my kind of vampire movie. Especially the fact that they've given them guns. Its not the worst though. It has the action packed thrill to it though."
    },
    {
      "rating": "7",
      "text": "Yea I know this review is a lil' late but I got to tell you, I'd rather watch this film ten times in one ago without breaks then sit through 1 film of the terribly Twilight Saga series. PROS: Kate in cat suit, Good acting, cool character design, an interesting intake in the Vampire vs Werewolf phenomenon and did I mention Kate in cat suit?\rCONS: Forgettable side characters, occasional effy writing especially in filler scenes, anti-climactic looking Hybrid. Seriously I expected something really awesome and cool but no its just a muscular guy with black skin and eyes, pretty simple and lame"
    },
    {
      "rating": "7",
      "text": "Underworld is an excellent horror / monster movie mash-up that makes great use of it's backstory and lore. The devil is in the details and the Underworld series spins a unique web of bloodlines, ancient traditions and old world betrayals. There's a lot in this franchise to sink your teeth into, if you so wish. This first Underworld effort is probably outdone by it's excellent sequel, if only by slim margin. Nether-the-less, the acting is great, the art design and effects are spot on and the action scenes are impressive. The movie has a great balance. Basically speaking, Underworld is the perfect start for a much underrated franchise."
    },
    {
      "rating": "8",
      "text": "This is a good start to what ended up being a great series! The third  fourth stand-out more than the first two, but here's where it all began. Kate Beckinsale leads the way as Selene, a vampire trying to protect a human being hunted by werewolves. There is plenty of Action going on and while it gets a little dull in the slower parts it picks up towards the end. As mentioned, its not the best in the series but a good place to start as all four films are great! Overall well worth a look"
    },
    {
      "rating": "9",
      "text": "The acting was good, the story was different and interesting, it was action packed, it was bloody, the practical effects were really well made and it was very entertaining. What's more to like?"
    },
    {
      "rating": "6",
      "text": "For me I found the film somewhat dull however it delivered great visuals and the odd scene that captured my attention. Also very good voice over narration from the protagonist. It must be set clear that this is not the type of  film that really appeals to me."
    },
    {
      "rating": "5",
      "text": "\"Underworld\" decently presents the raging battle between the monstrous Lycans and blood-craving vampires. It's not scary thanks to its war-focusing plot, but at least the film's decently entertaining."
    },
    {
      "rating": "1",
      "text": "Underworld, more like under\"pants\", this film was awful, for an alleged action film this really was pittiful. For a little over two hours i sat watching this film and the only time my addrenaline rushed was when my mate accidently broke wind. The acting, other than Kate Beckinsale, was appalling, especially head vampire 'Victor'. He was supposed to be a lord of the underworld though... he acted camper than a row of tents. I gave this film 1 because the special effects were good, but if it were for the plot, script, acting or action then this would have recieved nothing, perhaps even a minus if that were possible! oh and as for the comparisons to the matrix, well the only similarities were that they were both shown in a cinema."
    },
    {
      "rating": "1",
      "text": "Atrocious, even for a popcorn flick. The action sequences and \"plot twists\" feel like the fat they cut off the Blade movies. Coincidentally, almost everyone in this world of eternal rainy nighttime dresses like they were expecting a walk-on on Blade II. You can't expect too much creativity from a movie that basically steals vampires, werewolves and leather - but this is still insultingly bad, especially with its generic soundtrack and poor acting."
    },
    {
      "rating": "5",
      "text": "Vampires at war with Werewolves, man with rare blood type, in-fighting, Head Vampire gets awoken, general nonsense.I saw this about four years ago & thought it was ok & the Werewolves were very good. On this re-watch, it's not very good at all. The effects are pretty average, the acting terrible (even with Michael Sheen in it) & Kate Beckinsale spends most of her time pouting, flicking her hair & jumping around in slow motion.Tries so hard to be cult & cool but falls well short of the mark."
    },
    {
      "rating": "2",
      "text": "Underworld is a sloppy example of filmmaking. The acting is as wooden as a bed-side table, with a terrible script and ham-fisted direction by Len Wiseman. The effects and fight scenes might have been decent a few years ago, but they simply don't hold up today. What's more, the film is far too long - the story (what little there is) could have been told in half the time. The only saving graces are Bill Nighy and Michael Sheen, who both have an immense amount of fun as the leaders of the vampires and werewolves respectively, but don't get enough screen time to redeem the film. Underworld plays like it's trying to be somewhere between the Matrix and Blade, but in fact it's a poor imitation of both."
    },
    {
      "rating": "0",
      "text": "I was wrong. After watching Underworld again, I came to realise that not only is it the worst of the series, it has no redeeming features at all. It's garbage in the purest sense of the word. The acting is wooden with the best performances being ones from bit characters like Bill Nighy's Viktor and Michael Sheen's Lucian (probably why Rise of the Lycans is much more enjoyable). Kate Beckinsale lumbers from scene to scene in a sort of daze, spouting words with no semblance of feeling or thought. I can only imagine its because she is having a severe allergic reaction to the amount of leather shes wearing. Scott Speedman is tragically miscast as Michael not because he doesn't fit the character but because he is just a terrible actor. However the acting is just the beginning. Underworld is poorly directed with almost every scene being both poorly shot, framed and edited with them feeling like they are being rammed down your throat instead of neatly wrapped for your enjoyment. The main problem with the direction (by Len Wiseman) is that it is so remarkably unimaginative. It pushes no boundaries and doesn't try which carries over into the editing, sound mixing and everything else related to the film. The man behind the wheel should at least be able to steer. Len Wiseman got into the drivers seat drunk and everyone in the car held on for dear life.Summing up, its just rubbish."
    },
    {
      "rating": "5",
      "text": "The acting was pretty terrible (besides Michael Sheen's performance) and the action sequences sucked really hard. I did enjoy the plot though and it did keep me interested in it but it could have been told in a lot shorter time. I feel the 2+ hours run time pushes it far too much. Still, Underworld simply has something that makes me intersted in it. I was a bit disapointed in this film but I still have hopes for the sequel."
    },
    {
      "rating": "4",
      "text": "It's not that it's a bad movie. There is a ton of potential here for a pretty good series due to the very interesting story. However, the special effects in this film are rather awful, So bad that it's laughable at times. The acting is on the weak side as well despite having an experianced cast. Overall, the potential is there but it's still a below average film."
    },
    {
      "rating": "1",
      "text": "I watched this movie in a hotel room which I believe made it even worse. The movie has terrible acting and the action is dreadful to say the least. The movie was atrocious."
    },
    {
      "rating": "3",
      "text": "It tries to be The Matrix with vampires, but fails to have an actual plot or any coherent characters."
    },
    {
      "rating": "5",
      "text": "Vampire movies exist by the hundreds. I think there is hardly a monster capable of being more seductive and appealing than the vampire. Likewise, there is hardly a rival more suitable for those blood drinkers than the werewolf. This film will explore these and create an alternative story for both monsters that, here, have a common origin and are destined to hate each other.The main character is Selene, a warrior vampire who devoted hundreds of years to an eternal war with werewolves, called Lycans (if anyone knows the difference between a Lycan and a werewolf, please tell me). After a routine mission, she discovers that there is a large group of Lycans who can threaten vampires. Ignored by the vampire leader, she decides to prove that she is right and the danger is real, and wakes up the mighty Viktor, an elder vampire. But Selene's inquiries will prove the threat is more serious than she imagined and all loyalties, inside and outside the vampire clan, are at stake.This film is an action blockbuster loaded with leather, bullets, blood and testosterone, more than suitable for teenagers full of bouncing hormones. For me, it worked well but it is far from being something I would pay to see at the theater. It was directed by Len Wiseman, who we already know from \"Live Free or Die Hard\". He is a satisfactory director and seems to like dark material. I believe he was very inspired by \"Matrix\", if we take into account the leather clothes, hard-rock style and, above all, the opening scene in the subway, with hundreds of bullets fired without injuring anyone but destroying all the station, in a moment of unrealistic and absurd action. Believing that mortals live totally unaware to such blatant immortals is, at the very least, impossible. The story becomes more complex with the revelation of the past of the two clans and the creation of a myth that is never truly well explained, but supports the rest of the film.The cast is full of well-known names and is led by Kate Beckinsale, in a role that places her, more or less, between a Lara Kroft and a porn dominatrix. She's attractive but doesn't give us much more than her own body and a hot voice. Scott Speedman is stupid and doesn't seem to know how he got here, besides there is no chemistry between him and Beckinsale for both of them to be a credible romantic couple. Shane Brolly is fine, but not extraordinary and there are a lot of actors who only show up a little without adding some significant to the film, such as Wentworth Miller, Kevin Grevioux and Sophia Myles (she seems to have been included in the cast just to please the male audience who prefers a blonde over a brunette). But not everything is so decadent! Michael Sheen is excellent, being the most outstanding actor in the film and the one that gives us more solid work. Although I prefer to see him in dramatic films like \"Frost/Nixon\" or \"The Queen\", he is good at this kind of character and would come, years after this film, to do something like this when he play Aro Volturi in \"Twillight\" saga. Likewise, we must see and applaud Bill Nighy's good work, with his unique voice and diction. He gave his character an air of elegant aristocratic sadism.Technically, it is a dark film, loaded with action, bullets, leather, blood and very dark. Without a single scene with the sun or some bright colour, it is truly a dark film... I already said that? Gothic to the core, it has a nebulous and gloomy cinematography that, however, works well. Not being a romantic film, it has some hot scenes that, however, show nothing much. Even Beckinsale's ass always looks in her tights. However, sex is everywhere in the vampire world and that vampire mansion looks almost like a decadent brothel. The scenes of violence are also everywhere, but they sound so fake that even when a head is cut in half, we don't feel anything about it."
    },
    {
      "rating": "3",
      "text": "This is just a copy of Blade (1998) but nowhere near as good. The whole thing is pretty silly in fact. There are a few good story ideas but the whole film is so dull. It really has nothing that makes it worth watching except that it mercifully ends. Save yourself some time and don't watch this borefest."
    },
    {
      "rating": "10",
      "text": "Fun filled romp...enjoyable...dark with do the right thing attitude...Loved it..."
    },
    {
      "rating": "8",
      "text": "Hey this film is good. the script is good and the effects very well done. one of the best vampire/werewolf films i've seen!"
    },
    {
      "rating": "9",
      "text": "Underword is a great mix of action, horror, and good music. Plus, It gets tiring watching old fashioned monster movies where people go \"O My F***ing God it's a Vampire or Werewolf. This movie ditch's that tired style of monster movie and gives you a high tech modern day monster war where vampires and lycans (werewolves) are duking it out in Matrix style fashion. Add to that Kate Becinsale in tigh leather what could be better in this genre?"
    },
    {
      "rating": "7",
      "text": "Certainly stylish, and wears its gothic production well, but the constrained budget limits its potential. Action is good, but could be even better. Story actually is quite interesting. Hope Len Wiseman and Co. can grab a much higher budget for Underworld: Evolution. A 100+ million dollar budget could fix most problems in this series and unleash its full potential."
    },
    {
      "rating": "9",
      "text": "Enticing and absorbing popcorn enterment with a sexy leading lady who puts out a good performance, or at least as good as you can get in the genre."
    },
    {
      "rating": "9",
      "text": "I thought the movie was great! All the costumes and everything. I just wasn't into how the warewolves looked. I kind of have a different perspective on how they look. But all in all they looked pretty good."
    },
    {
      "rating": "4",
      "text": "The plot is too over-the-top, taking it self too seriously. Beckinsale doesn't really act a lot, but Speedman is completely irritating. This is a derivative movie, nothing is really happening, just a bit of fighting and some unespected \"plot twists\". However, is basically a CGI-action movie."
    },
    {
      "rating": "3",
      "text": "Vampires vs. Werewolves. Abbott & Costello? No. Not even. But hey, they're all armed with arsenals of automatic weapons! I thought the point of being a monster was you didn't need any of that crap. But I guess it's cheaper to have cool looking, sexy model types firing off blank rounds harmlessly at each other than doing a complete CGI movie? The only drama here was whether I might throw my vote with the vampires ... or the werewolves. Tough choice. And no apparent reason to back either. Now, if Lon Chaney or Bela Lugosi had been in this ..."
    },
    {
      "rating": "8",
      "text": "OK, Gone With the Wind it's not -- but stylish yet violent supernatural fun it is, in spades!"
    },
    {
      "rating": "7",
      "text": "This is an ambitious, great-looking, adequately acted piece of popcorn entertainment. Sure, it's terribly written, and some of the werewolves look more like Muppets than petrifying flesh-eaters, but 'Underworld' provides loads of fun for both our beer-swilling commonfolk (shit blows up) as well as serious cinemaphiles who are willing to sit back and have a blast with this fun-as-hell B-movie."
    },
    {
      "rating": "9",
      "text": "Very good vampire vs werewolf movie. If you like The Matrix you'll probably like this film."
    },
    {
      "rating": "8",
      "text": "I thoroughly enjoyed this movie. The writing wasn't great, and the acting seemed quite repetitive and rather dull at times, but the style, general story, and lore the movie sets up is simply fantastic. If you're a fan of modern vampire/werewolf mythology, Underworld is certainly worth a watch."
    },
    {
      "rating": "6",
      "text": "Based on her role selections in the 2000s, I feel it is fair to conclude that Kate Beckinsale exclusively sought out roles that had her wearing black spandex while shooting mythical beasts. Underworld certainly fits that bill and really started this trend for Beckinsale. In this film, she is a vampire who kills lycans (werewolves) for a living, as part of the long war between the two factions. Directed by Beckinsale's husband as of 2004, Len Wiseman, and co-starring her partner as of 2003, Michael Sheen, Underworld is cited as the film where she left Sheen for Wiseman. Oddly enough, she was the one who wanted Sheen to be cast in the film. Awkward. That aside, however, Underworld is a thoroughly entertaining fantasy shoot 'em up with great mythology and stylish action sequences that make up for its lesser elements.With great mythology and background to the issues afflicting the vampires and the werewolves in this world, Underworld really takes its time and develops the hatred. Throughout, the film manages to nimbly switch between the two sides and have the audience develop sympathy for both sides. As many critics cited upon its release in 2003, this is really the film's greatest asset. Its success with it is up for debate, but what is not up for debate is the depth and scope of its mythology and how truly intriguing it shapes up to be. By the end of the film, it truly becomes a shame that all of the sequels are seen as being so bad, because spending more time in this world would be a truly captivating exercise.Another strength here is the action. The whole film is seemingly shot through a blue filter, which is actually quite appealing and really does work with these action sequences. Cited as a rip-off of The Matrix by some for its use of trenchcoats and slow motion action scenes, Underworld's action is hardly attractive. It is also quite nonsensical with endless magazines and shootouts in public that hit nobody. This does not mean it is not slick as all get out, however. Very well shot and quite visually appealing, the action's style really hides up its blemishes nicely. In particular, there is a scene where Selene (Kate Beckinsale) spins around and shoots out the floor around her to create a hole in the floor, allowing her to drop down to the next floor. Obviously, this is very stupid. Yet, it does look very good.In terms of acting, it can be quite hammy. However, who does not want to see Beckinsale, Michael Sheen, and Bill Nighy, ham it up? Plus, their characters are actually quite good, allowing them to have a lot to chew on in the roles. In particular, the character of Viktor, played by Nighy, is great. An elder vampire who is awoken by Selene upon the discovery of a conspiracy within their midst, Viktor is a towering figure. Instilling terror and fear wherever he goes, Viktor is a truly menacing vampire and Nighy captures this terrifically. Sheen was also very good in his role as Lucien, a werewolf. The leader of the werewolves, Sheen is both strict, tyrannical, and highly sympathetic in his role, especially once we begin to learn more-and-more about him. Quite well-written, Sheen really makes the most of the role from an emotional standpoint.On the negative, Underworld is simply absurd. As mentioned before, it is quite fantastical with a lot of action movie cliches. With missed shots abounding, the film's mythology saves it from becoming just a run-of-the-mill action movie, but that does mean the film does not still come close to being the furthest thing from original. It compounds this problem with a terrible romance element between Selene and Michael (Scott Speedman). Unconvincing and greatly rushed, the romance merely distracts from the plot, rather than helping advance it. For many Hollywood action movies, this is a problem and it is certainly one in Underworld.Entertaining and easy to digest, Underworld is hardly the most challenging film ever released. However, it is a fun watch with great mythology that proves to be an worthy  diversion and popcorn film."
    },
    {
      "rating": "8",
      "text": "One of my favorite bad movie series.  I like it better than the Resident Evil series.  The story is way to convoluted for the subject matter and the lines are cheesy but man I love my hot women in leather shooting guns and kicking butt.  I think the movie is good ol fun."
    },
    {
      "rating": "9",
      "text": "I don't know why I watched this movie. I've considered watching it many times in the past, but I guess I eventually ran out of stuff I wanted to see, so I hesitantly downloaded this movie.\r Pleasantly surprised. The generic sort of \"war between races\" story turns out to be extremely engaging thanks to amazing characters with unique/interesting motivations and personalities. Many motivations are believable, and genuine, such as why Selena is a death dealer. Victor's insistence in rules but irrational hatred for things he doesn't understand is a great contrast.\r In terms of negative, CGI is pretty bad. I've seen much worse, but this isn't the kind of movie that holds up over the years in terms of its special effects.\r Truly engaging, interesting, stylish and creative film. Why critics hate it so much is beyond me. After reading the critic reviews I still don't get what they found wrong with it."
    },
    {
      "rating": "4",
      "text": "When vampires attack werewolves, the vampires had to prepare themselves for the werewolves' next attack. Sadly, this one (and its sequels) is not it. You'll possibly find another one that's obviously better than this."
    },
    {
      "rating": "7",
      "text": "Now then, I'm going to review something that the fan boys and the fan girls are going to love. This is Underworld. In the underworld of vampires and werewolves, Kate Beckinsale as Selene is a vampire Death Dealer who is hunting Lycans and it turns out that Michael Corvin is who is being targeted by them. After been bitten by a Lycan, Selene must decide whether to do her duty and kill him or go against her clan and save him. Um, okay. Um. To be honest, I'm not a big fan. I mean it was a good film for the franchise but it gets tad boring really fast. Let me get this straight. On my first watch I was thinking that this is a same thing as Blade starring Wesley Snipes where Blade battles the vampires who were sucking blood from people and then I actually find this to be same exact thing with this time with vampires and werewolves and I thought I find it to be good but didn't and today I thought about watching it again to give it another chance and I still finding it tedious and confusing but it's not a bad film by any means. I remember back in the day that Bill Nighy is good in this as Viktor. So after that I'd still find Underworld to be a tedious shoot 'em up action horror film for which I didn't find it to be scary and horrifying. So after me watching the first Underworld I was thinking of watching the second Underworld film thinking that it'll be good as the first but I'm not quite sure so I'll have to wait and see, so stay tuned for that. See ya!"
    },
    {
      "rating": "10",
      "text": "A realy good vampire vs werewolves movie it realy delivers whats is expected for it , fantastic , one of my favourite movies"
    },
    {
      "rating": "3",
      "text": "Stylishly shot but the script and the acting are both so shoddy that it nearly all goes to waste."
    },
    {
      "rating": "7",
      "text": "Watched the director´s cut of the movie which gives you even more story. The movie is awesome i Wish i could love it more."
    },
    {
      "rating": "6",
      "text": "Saw this movie again, it has been a while and rewatching it well the movie is not amazing but, what is amazing is that unique style it portrayed at least from its beginnings it really wanted to set a tone and it did that pretty well what also impressed me is thinking back I saw this when I was a kid and it was all ooh's and ah's I barely felt the 2 hours this movie has and now my eyes were burning up from how long it was but I digress this movie competed with some titans man this is from 2003 were talking about times when Lord of the Rings and The Matrix were around and those were some monster films no pun intended. Underworld has a clear demographic and I think I speak for most people that this led to a lot of fantasies and crazy ideas when we were kids and most adults in that time most people won't like this movie and that is understandable but this movie will remain in my head until I die from its deep lore to its dark setting."
    },
    {
      "rating": "10",
      "text": "This is an outstanding 1A movie of an even better franchise. I only write something here because I can not stand the pseudo critics of newspapers that rate such a movie at 42 %. They shall tell that millions of fans, also of Vampire and Werewolf franchises that one of their most loved franchise of that genre received 42 %. The newspapers shall rethink their policy if they want their name in combination with a sadist who has a schizophrenic cramp addiction for spreading his negativity and worse to others with the intention to ruin state of the art US quality of a franchise expressed in a movie series. I want to visit them at night with fake Vampire teeth, screwing on a silencer and...."
    },
    {
      "rating": "10",
      "text": "Love this movie. Another one of my favorites part 2 as well. They got all kinds of creatures she's battling. Love it!"
    },
    {
      "rating": "8",
      "text": "Solid film for the time. It set out what a typical movies sets out to do and that’s entertain the audience."
    }
  ],
  "recommendations": [
    "van_helsing",
    "underworld_blood_wars",
    "underworld_awakening",
    "the_last_witch_hunter",
    "immortals",
    "kong_skull_island",
    "abraham_lincoln_vampire_hunter",
    "priest",
    "underworld_evolution",
    "the_meg",
    "bloodshot",
    "hercules",
    "transformers",
    "riddick",
    "blade_trinity",
    "predator_2",
    "transformers_dark_of_the_moon",
    "rampage",
    "the_shallows",
    "blade",
    "clash_of_the_titans",
    "daybreakers",
    "kate",
    "300_rise_of_an_empire",
    "resident_evil_apocalypse"
  ]
}