{
  "id": 2008,
  "title": "Underworld: Evolution",
  "starring": [
    "Kate Beckinsale",
    "Scott Speedman"
  ],
  "runtime": 106,
  "genre": [
    "Fantasy",
    "Action",
    "Thriller"
  ],
  "description": "As the war between the vampires and the Lycans rages on, Selene, a former member of the Death Dealers (an elite vampire special forces unit that hunts werewolves), and Michael, the werewolf hybrid, work together in an effort to unlock the secrets of their respective bloodlines.",
  "releaseYear": "2006",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yT1EDKhCzAumcZeBoAxqm0nY2H8.jpg",
  "categories": {
    "plot": 7.176470588235294,
    "acting": 6.0,
    "ending": 6.888888888888889,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 3.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "All i can say: PERFECT! Thank you Len for this masterpiece."
    },
    {
      "rating": "4",
      "text": "\"Underworld: Evolution\" is just annoying. Why are the vampires and Lycans just fighting consistently? No plot twists, witty script, or even chilly scares. It's a movie you'll get to watch and forget in a few moments."
    },
    {
      "rating": "10",
      "text": "why are \"professional critics\" so dense?"
    },
    {
      "rating": "2",
      "text": "How can a movie as bad as Underworld get any worse? That was what I found myself wondering at the end of Underworld Evolution, a film so colossally bad it deserves some kind of award to emphasise the fact its dreadful. It has a terrible script, two wooden leads, a boring supporting cast and some awful set pieces. It's just bad. Really, really bad."
    },
    {
      "rating": "3",
      "text": "Pride? Hubris? If the vampires discharge firearms, why do the lichens constantly put themselves at a disadvantage? Don't they have opposable thumbs, too? Another thing of fascination for me was how the film artfully hides Kate Beckinsale's nipples during her nude love scene. And that she curses twice. You can at least admire \"Underworld: Evolution['s]\" refusal to tone down for a PG-13 rating. But it's boring. And possesses no sense of humor. In the opening scene, a filmmaker with any flair would've given his audience vampiric horses."
    },
    {
      "rating": "7",
      "text": "Firstly, you'll without doubt enjoy this movie far more if you have seen the first Underworld. As a film itself it's definately worth a watch and it has some real class in parts - the lead hero in Selene (Kate Beckinsale) and lead villain Marcus (Tony Curran) are both superb and really add some zing to the film. The first half of it builds nicely, with a great meld of action and plot sequences, and it starts to feel as if an awesome film is in the offing. Sadly, the second half of the film just feels a bit rushed and wishy washy - not bad by any means, but I found myself switching off at times and not as hooked as in the earlier section of the film. The climax doesn't disapoint though and, if you can ignore a few of the plot holes, there's definitely enough to sink your teeth into for it be worth a watch."
    },
    {
      "rating": "8",
      "text": "While the first one had a little more bite to it (lol), this was a decent sequel with just as much Action and Horror Violence in it to keep the fans amused. The main players are back, this time joined by new villain Markus who we briefly met in the last one. It had a few more dull moments I'll admit, but in order to really appreciate the next two films you need to understand what went on beforehand and thats where these come into play. Not the best the genre has to offer, but a decent film!"
    },
    {
      "rating": "8",
      "text": "I enjoyed it, although I admit that Beckinsale was a major drawcard in my decision to go see it in the first place. It was a real comic book movie & fine if you do I did & ignored all the inconsistencies with the first film and enjoyed the ride. Len keeps a decent pace on the plot/action so you don't have too much time to get bogged down thinking anyway. I'm sure no critic will give this higher than a 7 out of 10 at best, as any \"dark\" comic book movie gets universally panned as far as I've ever seen (e.g. the first Underworld, Sin City etc.)"
    },
    {
      "rating": "0",
      "text": "Anyone who sees this movie should be prepared to feel just a little taken advantage of after all is said and done. Clearly it's intended for lower life forms. Although, I think even plankton or jellyfish would be bored slimeless by this pathetic tour de farce. They manage to make Kate Beckinsale in tight leather depressing for God's sake!"
    },
    {
      "rating": "0",
      "text": "This sequel makes even less sense than the mediocre and boring first movie."
    },
    {
      "rating": "10",
      "text": "I thought the movie was great! It was exciting, and it kept you on the edge of your seat the entire time!"
    },
    {
      "rating": "10",
      "text": "Perfect Vampire Movie. Great Action, good CGI Effects, great Score and again a sexy Kate Beckinsale."
    },
    {
      "rating": "9",
      "text": "Wow a lot better than i thought it would be!! Lots of violence, and a good ass kicking all around, i like how they kept it moving so you wouldnt have to endure the crappy acting."
    },
    {
      "rating": "9",
      "text": "I thought this movie was great! Although not as much of a story as in the first one. The ending left a little to be desired."
    },
    {
      "rating": "8",
      "text": "This movie falls off ever so slightly from the the first. There was not as much suspense in this movie. Leaving off from the first movie, you knew exactly what the movie had to do to deliver a quality second movie. This sequel thows in a simple twist that you won't be able to predict from watching the first, but the twist is not so far fetched to be unbelievable. For the most part, you know exactly what the movie's story was going to be about, and it did deliver. If you can get past a few cheesy moments, and you liked the first movie, you'll enjoy this one just as much."
    },
    {
      "rating": "2",
      "text": "The critics are right this is a 2 or 3 out of 10 movies. The fact the user score is 9.1 scares the hell out of me. It's people like that are responsible for hollywood to continue to make these generic, lame, stupid, retread movies."
    },
    {
      "rating": "0",
      "text": "Another waste of time from Beckinsale. First Underworld...then Van Helsing...and now...this mess."
    },
    {
      "rating": "9",
      "text": "It delivered. Much better than the critics said."
    },
    {
      "rating": "9",
      "text": "I would have given it a higher score if we weren't cursing the well place leg hiding the view of Speedman's bootie. Come on, it went so low on Kate's abs, I thought maybe Len was filming a home movie."
    },
    {
      "rating": "10",
      "text": "Perfect Vampire Movie!"
    },
    {
      "rating": "8",
      "text": "Normally I dont go to these sort of films so didnt go in with any expectations, never saw the first one and really enjoyed it... enough said really. The Critic are being far too harsh on this one."
    },
    {
      "rating": "10",
      "text": "Excellent sequel. Anyone who liked the first film will find this one bigger faster and better. People who didn't like the first one will dislike this one even more."
    },
    {
      "rating": "10",
      "text": "This movie did exactly what it was supposed to, entertain me. Sure the critics (and those scattered few) hated it, it didn't make a political statement, break new ground in film making, or inspire us with art and culture, it's a vampire movie. The people who gave this a low rating must not have realized that going into it. What did they expect? If you want good stylish action, and entertainment, go see this movie. If you want compelling film making, then go see Munich."
    },
    {
      "rating": "9",
      "text": "This one was as good if not a tad better then the original. Kate is still HOT sexy on her skin tight outfit and the flying Vampire would kick the crap out of Van Helsing's Dracula any day. Great popcorn flick."
    },
    {
      "rating": "10",
      "text": "Bloody Awesome!"
    },
    {
      "rating": "10",
      "text": "It was incredible.....I liked it more than the first, not to say the first one was bad, but with more gore, action and a story line that did make sense no matter what the boring critics say it was great. I saw it twice in the theatre and my friends loved it too. Its a must see, and i hope they make another one."
    },
    {
      "rating": "1",
      "text": "Crappy movie. What the heck was all the fuzz about? Terrible and even worse dialogue than the first one. Yes, Beckinsale is still looking way hot in latex but that's just not enough. Gorier and bloodier than the first but not better and the first one wasn't that good to start with."
    },
    {
      "rating": "10",
      "text": "Great action packed movie. Great entertainment. Not for those looking for a Syriana or Constant Gardener."
    },
    {
      "rating": "7",
      "text": "Although this movie has some really weird occurences: Why are they in another country and why is a 19 year old [whatever] having sex with a god-who-knows how old vampire. The heli scene at the end of the movie was action at its best. But, I think I can only recommend this movie to people who have seen the first. I look forward to Underworld 3."
    },
    {
      "rating": "7",
      "text": "Good movie overall, but the action far overpowers the plot (which is actually a very good plot, if you can get to it well enough) and Kate's acting is mostly horrible - though she does look good in tight clothing."
    },
    {
      "rating": "9",
      "text": "Great storyline, special effects borderline great, acting was very good. Looking forward to rest of story."
    },
    {
      "rating": "2",
      "text": "I found this movie hilariously bad! The sex scene with Scott Speedman humping Kate Beckinsales abdomen was especially great. The plot was incoherent, the action was kind of boring, and the acting was mediocre. How this has as high a user rating as it does baffles me, but it did give me more laughs than any other movie this year!"
    },
    {
      "rating": "8",
      "text": "Better than the first and better than I expected. They developed the history more which was nice but was still able to be inventive with the action. Overall a good popcorn flick. Don't take it too seriously."
    },
    {
      "rating": "10",
      "text": "Awesome movie loved every minute."
    },
    {
      "rating": "4",
      "text": "Another mediocre entry into the ever growing modern vampire movie list. Like all of its counterparts it strives to bring something \"new and cool\" to the genre but ends up reheating the same leftovers and becomes indistinguishable from the likes of Blade(1, 2, and 3) and Bloodrayne. If you enjoy seeing the same story but with marginally updated effects, this is the movie for you. If you want original and engaging cinema, look away and hope they don"
    },
    {
      "rating": "9",
      "text": "Just finished watching it on the biggest screen with the best surround in the theater. If you like the first one you'll like the second. They go into the family line, flash backs to fill in parts that were missing from the first one. Lots of interesting plot twistst. The make out scene is poorly timed, didn't seem to fit in, but everyone I talked too still liked it. Comparable in timing as Neo & Trinity make out scene in the Matrix. This is a true Vampire / Warewolf action movie and it does have the feel of Matrix and Blade, but unique in and of it's own."
    },
    {
      "rating": "5",
      "text": "There were far too many flash backs in this movie to maintain any fluidity. There were also far too many errors, Lycans and Vampires went from being almost impossible to kill, to being as fragile as mortals. And worst of all the two original brothers were killed with any of the myths holding true."
    },
    {
      "rating": "5",
      "text": "It was o.k. There was long sex scene. I thought it would have meaning to the film i.e. baby hybrid or something. No nothing at all. The brother feud was weak storyline at best. Michael was supposed to get weaker because lack of blood but Selene gives him a few drops here and there he is a stallion. This was almost a complete waste of film."
    },
    {
      "rating": "10",
      "text": "Underworld: Evolution was a continuous of forbidden love. It explored all the elements of protecting that love, something Lucian and Sonja (Viktor's Daughter) weren't granted."
    },
    {
      "rating": "9",
      "text": "Better than the first in evey way. Plus seeing Kate Beckinsale half naked was worth the price of admission in itself."
    },
    {
      "rating": "10",
      "text": "This movie was awesome. The best action movie i have in a long time. As with the first movie don't expect any Oscar's here......but if you go to movies to have a good time check this one out or go see Brokeback Mountain...your choice. Personally i'm sticking with Kate Beckinsale in all of her butt-kicking skin-tight outfit wearing glory!!!"
    },
    {
      "rating": "3",
      "text": "If you like this movie you probably are 10, like movies like The Cave, and will give a movie a score above an 8 if it has nudity in it. Underworld: Evolution is a dreadful movie that is worse than its predescor in every way concievable. The horendous dialogue would be forgivable if the action was intense and thrilling, but alas it is not. And neither is the second installment in the Underworld series."
    },
    {
      "rating": "9",
      "text": "[***SPOILERS***] It is in every way a lot better then the first one, but does lack some simple things. One there wasnt as much suspense as the first one. Even though there was a ton of action and gore, and ruthless violence it lacked that feeling where you didnt know what was going to happen next. I am a huge fan of gore and werewolfs, and this proved a very worthy quincher for my appettite. The story was good, and the effects were great. Now the small thyings that made it a little cheesy. The eneding was a little wierd, we take the whole movie till we see the big bad ass werewolf and boom, he barely does anything, except sit there and get riddeled with bullet after bullet. And then came the helicopter crashing through the roof. Although cool, extremely cheesy, it reminded me of the ending from \"Sudden Impact\" that hockey, terroist Jean Claude-Van Damme movie. All in all it was a great sequel, with one kick ass opening that will sure to be great for years to come. I give great props to the director, to try something new, and if i were him being able to make a huge movie, i as well wouldve have proably crashed a helicopter threw the cieling as well. So if you like gore, violence, and monsters and good looking Lead Actress then def. go see this movie."
    },
    {
      "rating": "10",
      "text": "Great Movie. Marcus is very cool & Kate again sexy. The first one is nice, but to slow. The sequel is fantastic!"
    },
    {
      "rating": "8",
      "text": "More exciting than the first and more interesting, too."
    },
    {
      "rating": "7",
      "text": "I liked it alot. The special effects were awesome."
    },
    {
      "rating": "8",
      "text": "The critics want shakespere, I tell them go watch Interview with a Vampire... I wanted action, seamless cgi, and to see a phenomnialy good looking woman. I also wanted a movie that woke me up and I didn't have to strain to understand the finite details of the plot. If you didn't see the first one, don't complain if some of the elements are lost to you. This movie does well for a sci-fi/horror junkie, despite a few silly dialog choices... -brett"
    },
    {
      "rating": "10",
      "text": "I wasn't a big fan of the first one, and I'm not just giving this a 10 because of my Kate, I believe this movie was EXTREMELY entertaining, and a great sequel at that. I really hope people say screw the critics because this is way different than what they say...they said in the Toronto Start that it made no sense, yet I understood the whole thing, this is no Titanic storyline so give it a rest, it was never supposed to be, see this movie!"
    },
    {
      "rating": "8",
      "text": "Not quite as solid as the original. Story doesn't build as well, and scenes aren't as interesting or fun as the original. But you will love this if you liked the first one. I'd compare Underworld 1 and 2 to Resident Evil 1 and 2. The first one has a better story, develops better and has better overall scenes. The second has more action and more creatures. I'd rate Underworld 1 9/10, I give part 2 8/10. Check this out also if you enjoy the Blade movies (which you should!)."
    },
    {
      "rating": "8",
      "text": "I thought the movie was very entertaining. The effects were awesome. Usually effects like these look so fake, but in Underworld they looked very realistic. I couldn't figure out where the movie was supposed to take place. In the last movie, it seemed like they were in the U.S. Everyone spoke English. This time, all these people were running around speaking some other language and the cops were foreign. I don't know why they tried to make the plot look like it was in a foreign country. I guess because no Europeans lived in the U.S. 500 years ago. They just moved the story somewhere else to make up for it, I guess. Anyway, that really bothered me. I mean, Michael was a med student w/ other people and cops who all spoke english in the first movie and now everyone not associated with the main plot speaks a foreign language. That was kind of lame. I thought it was a wonderful movie for those of us who enjoy the genre (vampire flicks). Very exciting film. I loved the final battle!"
    }
  ],
  "recommendations": [
    "underworld_blood_wars",
    "i_am_number_four",
    "underworld_awakening",
    "the_mummy_tomb_of_the_dragon_emperor",
    "hercules",
    "polar",
    "gods_of_egypt",
    "the_last_witch_hunter",
    "the_twilight_saga_eclipse",
    "bloodshot",
    "the_meg",
    "jumper",
    "underworld",
    "teenage_mutant_ninja_turtles",
    "the_marine",
    "transformers_dark_of_the_moon",
    "into_the_storm",
    "poseidon",
    "van_helsing",
    "the_twilight_saga_new_moon",
    "lockout",
    "the_twilight_saga_breaking_dawn_part_2",
    "eagle_eye",
    "gemini_man",
    "rambo_last_blood"
  ]
}