{
  "id": 1082,
  "title": "Underworld: Blood Wars",
  "starring": [
    "Kate Beckinsale",
    "Theo James"
  ],
  "runtime": 91,
  "genre": [
    "Fantasy",
    "Action",
    "Thriller",
    "Horror"
  ],
  "description": "Vampire death dealer Selene fends off brutal attacks from both the Lycan clan and the Vampire faction that betrayed her. With her only allies, David and his father Thomas, she must stop the eternal war between Lycans and Vampires, even if it means she has to make the ultimate sacrifice.",
  "releaseYear": "2016",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/v1ciDCWMG47gdT4kMyjyQbnLQQn.jpg",
  "categories": {
    "plot": 4.222222222222222,
    "acting": 2.875,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.5675675675675675
  },
  "reviews": [
    {
      "rating": "3",
      "text": "If you know the progression of the underworld franchise there is no need to explain how low this franchise has fallen. After underworld awaken how much can it fall? Well blood war reached a new low. The plot revolves around Selene played by the hot Kate Beckinsale who is trying to find her daughter. Well the problem of the film started right from the start: the continuity from the last one is almost completely ignored and there is no acknowledgement of the fact human knows vampire exist and trying to hunt them. In fact there is almost no human throughout the movie. But this is only the least of the problem.The actions were shot hilariously bad. The choreography feels they are flying on a string and there are moments you can almost see the wire, wow. The editing was also terrible, especially at the start it felt someone saw Bourne movie and said hey this looks good and let's just copy it. They made cuts to almost every single punches and my god it felt oozy. It is still not as bad as the new resident evil movie but that is a really low bar.It also felt like a game of thrones rip off or no literally poor man version of it. Not even kidding. Let's see, Charles Dance and Tobias Menzies, check, Daeneryes look a like check. Random royalties check, unnecessary sex check and a complicated yet ridiculous lists of random betrayals double check. But while game of thrones is engaging and interesting, this just down right stupid. You can add a laugh track and it will become down right silly. Literally there is a random plot twist every 10 minutes but you can see them coming from a mile away and it doesn't have any weight to the movie.One thing I did like is that the film returned to its classic modern gothic roots. Ever since the first and the third film we rarely see that. Some of the sets and costume design looks beautiful. But there are dresses that looks plain weird. Like the dress by the main villain. It felt like she is practically naked just with wraps cover her, you know like the thing from the fifth element but down much poorly.At last we have Selene. Noticed I didn't talk much about her that's because she is not in it as much you hoped. Half way she disappeared and all of sudden she had white hair and can teleport. O yeah forget to mention that, there are white and can teleport. While your franchise comes down to this you know it is getting ridiculous."
    },
    {
      "rating": "2",
      "text": "This was the fifth film in the \"Underworld\" franchise and marks a new disappointment after the film that precedes it has registered a rather relative qualitative improvement. In fact, if the previous film looks less stylized and seems to make a more consistent bet on the cast's work, this film will make a clean slate of it all. In fact, the feeling I had is that the film even makes a clean slate of everything that happened in the film before and pretends that it never existed: in this film, we hardly hear about the Purge or the wars between immortals and humans, and humans virtually disappear.The action takes place years after the events of the previous film, and they seem to copy a lot of material from the first two films: again, we have an escalation of the war between vampires and a resistant clan of lycans that vampires deemed virtually on the verge of extinction. Again, we see Selene running away to save herself and showing up to save the day in the end, being betrayed (again) by vampires she thought she could trust. That is, the script is so similar to the first two films that it appears to have been chewed and pasted.The film was directed by Anna Foerster, in her first cinematographic work of direction (she had directed other works, essentially episodes of TV series). She proved not to be very experienced but that is not a defect. What is very bad is that she consented to the terrible script that Cory Goodman presented to her. He practically plagiarized the first two films.The cast continues to be led by Beckinsale, but she is not doing any more good here. She is an action figure designed to look sexy, and nothing more. She does not move a muscle and does nothing well. But what shocked me the most was the dubious way in which her character reacts to her daughter's absence... on the one hand she cares and seems determined to protect her but, on the other hand, she shows total emotional detachment. Does not make sense. Theo James is the best actor in this film, and even he has gross flaws on several levels. Charles Dance is good but is removed early, Lara Pulver is uninteresting and Tobias Menzies is histrionic and ends up being misused.Technically, it continues to bet on the incredible action scenes, overwhelming CGI and effects. There is virtually nothing positive that this film can rely on. Cinematography is horrible with the undisputed predominance of blue and gray. Its impressive but it does not move us. Death after death, persecution after persecution, everything just seems absurd."
    },
    {
      "rating": "4",
      "text": "The mission Eve has begun!Like any guys from before the 90s, I was too a big fan of Beckinsale. There's no one can match her beauty, even to her age of today. That does not mean all her films are good. She has stopped doing good films a while ago. Every time when her films get released, I was hoping for her comeback like the old days, either a pure drama or an action film. No, not this film. It is what, the fifth in the franchise and the feature film debut for the directress of the television series.As always, worth watching for Kate. The story continued, and it focused on the remaining vampires fighting for their survival against their arch-rival, Lycans. That's where the Selene caught between. But this time, it was about looking for her daughter, Eve, who holds the key to the future of these immortals. So the action begins where everybody clashes, racing towards their destination.The first three were the good ones. This and the previous ones were downgraded the decent series. The makers are already working on the sixth. Definitely not expected, after seeing this particular film. But I hope it comes back to the original course with good story, actions, graphics and all. This was simply based on one liner, and the rest of the film leaned towards the stunt sequences. Okay to watch once, but I'm not sure worth of spending 90 minutes for it. So if you want to, then it is good to keep update to follow when the time comes to try the next ones.4/10"
    },
    {
      "rating": "5",
      "text": "Anna Foerster takes Underworld: Blood Wars back to the basics but the exposition overshadows the action which is all this fifth installment was. Underworld: Blood Wars is not as bad as critics say but not as good as fans were hoping for.Let’s start off with saying Underworld: Blood Wars is a step above its predecessor Underworld: Awakening (though that’s not saying much). In Blood Wars, the focus is once again placed on the war between the Lycans and Vampires throwing Selene (Kate Beckinsale) in the center of the action.Now the Underworld series has always placed action in front of plot and Underworld: Blood Wars is no different. There is tons of unnecessary exposition calling upon the previous film extensively. The film would be better served if it decided to skip this and let the film stand on its own feet rather than having the plot shackled down. Plot holes were also prevalent such as how Selene acquired her new powers of phasing.But back to the action shall we? Underworld: Blood Wars returns the action and visual effects back to practicality unlike the CGI garbage Awakening. The final fight between Marius and Selene allowed for great enjoyment as it was more realistic in terms of CGI but the new phasing power took the sense of anxiety away. The fight between Semira and David was slightly better as it allowed for revenge and an even fight, unlike the aforementioned one."
    },
    {
      "rating": "4",
      "text": "good actors, stiff acting, the plot was interesting but, this movie was the most boring of them all and that is saying something because i liked the boring one's before it. what a shame."
    },
    {
      "rating": "10",
      "text": "This film is one of the best films i ever seen.I realy enjoy see this film, i already was a fan from Underworld movies, so i have high expectations for this film, and it dont let me donw. Maybe i´m saying this because i´m a fan, but i realy don´t know how people don´t like this film. It has realy good fight scenes, good soundtrack, and Kate Beckinsale was Extraordinary in the role as Selene, the same for Theo James as the roll of David.This film starts with a fantastic fight scene with Selene againt´s the Lycans, she faces Marius more than one time and  the fight´s were extraordinary, Selene went to the sacrad world when she \"dies\", and retourns more bad ass, more strong, with more skills... Anna Foerster did a realy good job.I realy enjoy to see, and if you didn´t see the film yet, well you should, it´s amazing."
    },
    {
      "rating": "5",
      "text": "Previously on Underworld, Kate Beckinsale is back once more as Selene and this time she's battling more lycans and it seems as though that her daughter, Eve is missing so Selene has to go find her daughter and kill the lycan leader. As far as the these films go, they're all mediocre and they're all the same thing in the same arse films. The violence whether it is stylistic is so goddamn nasty. Oooohh, nasty! It is as violent and bloody as each other that Underworld: Awakening for the most part. I got nothing more to say about this one and that's all I can say about these films, they're all the same and I'm getting really sick and tired about it and talking about them. They're all mediocre and they all coming to the world of s**t!"
    },
    {
      "rating": "5",
      "text": "bad: story sucks, ending is anti-climactic, editing/cuts are amateurish making it feel like a low budget sequel.  good: it's another underworld movie and Beckinsale kicks ass and still looks hot in her cat suit"
    },
    {
      "rating": "5",
      "text": "Underworld: Blood Wars turns out to be another movie that I consider a general \"meh\".I don't consider that bad, after all the entire series just isn't very good. However, it is traditional that we try and watch this in the theater when we can. We saw the original Underworld 13 years ago when it came out, and it wasn't a masterpiece then. However in our geek subculture we thought it was awesome, a vampire versus werewolf action movie.It turns out that Blood Wars is about the same as the rest of the movies. The plot is full of holes, the acting is poor and not anything really original. It really was a waste of Charles Dance's acting abilities (he was Thomas, the older vampire who died defending his son). You will notice I didn't say Kate Beckinsale because honestly I never found her a good actress and only liked her in the Underworld series.The movie itself was long, boring but had interspersed some decent action scenes. The travel montage itself was probably the worst part of the movie when Selene and her companion vampire traveled north. It is boring, but the part that caught me the most was when they were on the frozen over fjords of the north and they were walking, the very next moment they are riding huge draft horses across the same ice. Where the hell did those come from. I realize they probably filmed it because it \"looked cool\" but dear god give us something believable to assume they found horses on the ice, with no villages around.The Eastern Coven and the total emo/goth dress style did absolutely nothing for me. All Wolsey and I could joke around is that half the budget of the movie (and in the movie world half the cost of the coven) had to be based on the dress style of the coven. Maybe 14 years ago I would have been more impressed (and even more so 25 years ago in the early 90s) but now I just roll my eyes at the all black dress style. That trope just needs to die.Don't even get me started on the weird Salubri crap of the Nordic Coven (white wolf reference). The mysterious \"nice\" vampires who can go to the other world. My biggest problem with them was that they were getting destroyed by the vampires in their coven, but were badasses when they went back to the Eastern Coven. I realize they were surprised at their home, but it was their home, they had the advantage of ground, and supposedly being great warriors, except they weren't. Yet another inconsistency in the movie.I could go on about this, however even with all the inconsistencies I do have to say I still have a fondness for the movies and I will see the next one.The good: I liked the action scenes, even if a bit overdone. I like the subject matter, although I could use with a little updating of the tropes used.The bad: Plot holes I could drive a semi-truck through, bad acting, overdone tropes and can we please stop with the goth/all black look for the vampires."
    },
    {
      "rating": "2",
      "text": "Lousy shameless money grab . This and the resident evil series on the same path to hell. I don't think Beckinsdale can get herself hired for anything else so it was time to shoehorn herself into the leather pants again and make a little cash."
    },
    {
      "rating": "9",
      "text": "i don't know how this has a score of 23 when it's one of the best movies of the year.  it's been so long since a new underworld has been out I almost forgot how good it was.  the best part is that is seems like there will be more to come yay"
    },
    {
      "rating": "2",
      "text": "It's terrible in the most mediocre ways. There are literally no saving graces or possibilities this could have been good if they fixed this or that.To describe this movie series you have to compare it to a car ride, it begins nicely and a smooth ride if a bit awkward, but it is filled with the impossibility for an interesting adventure, then the car blows a tire, then the car flips over and with this movie it falls off a cliff.Beautiful visuals as usual with the Underworld series, but they are the only part of the movie worth giving a score to.The rest is a hot pile of trash, starting with the acting which has fallen so badly.Then we move on to the plot which is nowhere to be found, newfound shoehorned love interest with some weird story shoved down own our throats, but wait there is more to come!White haired vampires and the sacred world, with both sound stupid because they are and make as little sense as you want them to be.Characters are like Superman, as weak or as strong as the \"plot\" wants them to be. The ending is a nightmare and an offense to the first two movies which were decent.I cannot even write a proper review of this because its that bad that I cannot bother."
    },
    {
      "rating": "7",
      "text": "Regardless of what some people have been saying, this is a good movie. It's not a terrific movie, but it also isn't a terrible one. The movie starts quite face paced, and although I would have preferred that the camera lingered a bit more here and there to better display Blood Wars scenarios, landscapes and art craft, it turns out that the main plot develops consistently until it becomes a solid action oriented film.Blood Wars is surely the name this movie deserves. There is a great war between lycans and vampires, and this time around the lycans are closer than they ever have been from ripping the vampires of everything they possess: their entire coven. Personally, I was really thrilled with each action sequence and I think director Anna Foerster did a pretty good job. The only thing I regret is that the Nordic coven was barely introduced and there wasn't much backstory connecting the pieces with the other covens. It left me thinking that they should make a prequel which includes the Nordic coven and the love story between Thomas and Amelia. It would make for a great film, in my opinion.Overall, this is a good action film and a good Underworld movie, but if they ever make a sixth film, I would like that they go all out killing Selene and giving the lycans the upper hand, and maybe finishing the saga with a covenant between the races that stops the war once and for all. Also, a sixth installment could finally include Selene's daughter and give her the means to end the war for good. I hope I can see such closure one day."
    },
    {
      "rating": "7",
      "text": "I don't get a 22% score; obviously its a fantasy genre movie; its not gunning for any oscar nominations;  no different then the previous 4 movies; how is this edition of Ware wolves vs Vampires saga that much less entertaining?  I think you have to judge it for what it is. Mind you this 5th movie plot seemed to be building up to a bigger 6th movie in the franchise; if you never watched any of the previous movies you were not the target audience and make for a lousy meta-critic."
    },
    {
      "rating": "9",
      "text": "Blood Wars was by far since the introduction and beginning of the Underworld movies one of the best I have seen and it definitely does not deserve less than 5 rating at all.So for sure it is recommended to see all other movies in advance, as it is not a movie where you can simply jump in. Maybe that is the problem some reviewers gave it a negative score (or simply because \"haters gonna hate\").Nevertheless I would give this one a decent 8, but +1 because of all the hate-train lovers these days.Summed up: Nice movie in the line of Underworld movies. Kate Beckinsale is still kicking Lycans' butts and what else do I need for an Underworld movie?"
    },
    {
      "rating": "10",
      "text": "wow, i dont know how this has a bad score ! it's one of the best Underworld series ! Kate Beckinsale is just perfect with her role Selene ! i really enjoy the movie !"
    },
    {
      "rating": "4",
      "text": "All flash and no substance. Only without the flash. Underworld's sterile take gothic imagery is no longer stylish like it was back in 2003. The writing and characters are just as stale as the movie's environments. I suppose it's possible to care about Beckinsale and the rest if you followed the previous films, but it doesn't really change the fact that they really aren't doing anything here.The plot just goes through the motions. We've seen these kind of villains before. Lara Pulver is certainly sexy in a Eva Green sort of way, but her character's motives are as generic as they come. To top it all off all the fantasy mumbo-jumbo going on doesn't even make good use of vampire and werewolf lore. Everyone is just content to spend the entire movie talking about blood. But let's be honest, these movies were never really popular for their story. It was mostly for the vampire vs. werewolf action. It's kind of a lot of fun to watch monsters go toe-to-toe, so I can understand the original appeal. Plus it looked like some actual effort went into the originals. Blood Wars can't even deliver much on an action front either. I appreciate the movie's liberal use of gore. However this all by the numbers and plagued by cheap, dated special effects.It's clear not much effort went into this. The budget either wasn't big or was severely misappropriated. It's content to have a half-hearted, very generic plot and subpar action. It does nothing to actually move the series forward. I imagine those who actually still follow the series could skip Blood Wars and just wait for the next one and miss absolutely nothing. Essentially it's a generic filler chapter that feels like it was meant to test the waters in order to see if these movies can still pull in money before bothering to make a decent follow up. My advice? Don't waste your time."
    },
    {
      "rating": "0",
      "text": "There were so many ways to take this installment of the Underworld franchise but this was not it!!!!! Very disappointed and angry because I loved these movies until now! Get better writers for next one please. Need a love triangle: Michael, Selene, David. Develop Eve's character too. Have her start seeing through Michael eyes she goes to her grieving mother who firmly believes Michael's dead. And why are there no female Lycans? A conniving love interest of Michael's​ from his captivity which will lead to drama and mayhem when Selene/Michael come face to face. Then more of the viewers desire for forbidden Love as Selene has taken David as a lover in her grief. There definitely needs more script development of the hybrid species: hybrid+lycan =?  Or Hybrid+vampire this would lead to the violent fighting as each species tries to dominate and or accept each other's existence. That's my 2 cents. Let's face it anything would be better than this crap which everyone is blaming only on director but what about the script writer? No imagination at all!"
    },
    {
      "rating": "2",
      "text": "First Off, HUGE FAN OF THE SERIES! I like these movies, and I know that after the first two, I had to shut my brain off and just enjoy some good old fashioned violence. I even liked the last film! I went to this one with that same mindset, expect a stupid story, and enjoy watching people rip each other apart. This was the first movie I have walked out of in as long as I can remember. SO BORING! They just kept adding lore and Silly unneeded story! Horrible acting, Terrible fight scenes, and again, as a fan, I couldn't follow all of the story. Who the hell is this guy she is with at the beginning? I feel like Kate Beckinsale (super love her) was smirking through the whole film, just counting her salary in her head. Please god, do not let this director get into any other films that I enjoy. The story was so murky and stupid I couldn't take it anymore. They kept adding this stupid lore that they pulled out of their butts. Whats with these peaceful vampires? And this guy from left field who fills in as selene's love interest is the son of Amelia? For those who don't remember, she had a couple seconds of screen time in the first or second movie before she was killed in a train car, but they made it a huge Reveal as if anyone remembered her or gave a crap! I really can't stress enough how bad this is. I only gave it a 2 so it wouldn't be considered troll post. It deserves a 0."
    },
    {
      "rating": "8",
      "text": "I have always been a fan of the Underworld series. I must say this film is a good effort to continue the franchise.The setting for the movie is really beautiful, with the dark gothic buildings you have come to love from the Underworld series. What makes this film stands out is its relatively complicated plots and twists. Relationships between the important characters are somewhat complex. A lot of mysteries and betrayals intertwined. The pacing is excellent. There is not a dull moment. Good story and lots of well choreographed actions. The ending of the film is satisfying and prepares the story for the next film in the franchise.This is a must watch for Underworld fans, and fans of vampires films alike."
    },
    {
      "rating": "3",
      "text": "Underworld: Blood Wars was a film that I was excited for but that excitement was wasted when I saw it. Of course, no film is terrible the only thing great about it is that it had lots of action in the film for my taste. You will only like the film if you are a big fan of the movie film franchise."
    },
    {
      "rating": "2",
      "text": "If I had a dollar to every time a person on this planet wants to see every Underworld film from the first to this, I'd have a small loan of a million dollars. Guess what I would want to do with that small loan? Laugh it up to the millions of failures upon these people that have expected these films to be great and tell them not to watch another Underworld film ever again."
    },
    {
      "rating": "10",
      "text": "Well I am writing this in response to all the lightbrained people who wrote reviews on this without watching it out of sheer prejudice. Yes it's a wearwolf vs vampire movie, don't watch it if you feel strongly against it. I am not expecting much simply because the original director has long gone and given the fan base to guarantee box office filmakers usual put effort to a minimum. Still I will definately watch it, at home, that is."
    },
    {
      "rating": "0",
      "text": "Underworld: Blood Wars is about as good as you like the other films. Liked the other ones it's still right up your ally if not, it's bit more frustrating this go round. The world and interesting premise exists like the first, but the spontaneous plot, poor directed action sequences, and laughable acting by most of the cast won't turn anyone back to the series. I quit caring since the 2nd film, and will remain like that till I'm dead."
    },
    {
      "rating": "3",
      "text": "I love the underworld series of movies but...the action was so horrible in this one and for a movie that has had amazing moments in the past this was the most disappointing thing I've ever seen. Aren't things suppose to get better over time? One gun scene was so bad they moved the camera and you can clearly see with (no effects) they aren't hitting anything at all. It even looks like they are just shooting blanks it's so bad. Some other action scenes were amazing though. Even the ones that were good were extremely short like 1-3 mins. The story about the lycans was minimal. I think it was much cooler with Victor & Lucian around. The Rise of Lycans I have to say so far is still my favorite by a long shot. It went so well with the first movie. This didn't have a deep story to it. It's like they just wanted to make a quick buck."
    },
    {
      "rating": "0",
      "text": "The only good thing about this movie is Charles Dance. You could put him in anything and he'd still be freaking amazing so props to him. Aside from that, It's total garbage and just as bad as Awakening, If not worst. Weak action, Terrible story and acting by the cast (aside from Dance). It sucks to see a once promising series fade away but then again, It hasn't been good since Rise of the Lycans."
    },
    {
      "rating": "5",
      "text": "I always liked the style    of the Underwold    movies and they're all watchable films. Light 90min entertainment x5"
    },
    {
      "rating": "6",
      "text": "I enjoy this series and know it has limitations in script quality and acting so i call it a guilty pleasure. But, despite it's weaknesses, I would rather watch this a dozen times than suffer through another JJ film like SW7/8/9. So, in context, this film had replay value that many billion-dollar films do not have. And based on how stupid the average American is, popular opinion means nothing to me. This is a mediocre film that i will watch again some day. It is on par with 30 Days and Daybreakers, but not as good as Only Lovers."
    },
    {
      "rating": "6",
      "text": "It's Underworld. I thought it was just as good as any of the other ones.  Same \"turn off brain, eat popcorn, take it for what it is\" action flick you have come to expect.  Some comments say there is not enough humor in it??  Have you ever seen Underworld??  Yep, not a comedy folks."
    },
    {
      "rating": "4",
      "text": "I always found underwold movie saga very interesting and this one is good, however there's not action on most of the movie and that's not bad but sometimes it starts getting boring because the characters development takes too much time to reach the right point, regard of this this movie is good not quite perfect but just enjoyable, however i can promise you that as always Underworld Blood Wars is using the same Underworld Classic Style and it works correctly, it almost make you feel like you watched Underworld Awakening just a couple of days ago, last 30 minutes of movie are pure action and blood, but the end is not as good as i expected, it will make you wait for the next movie, Underworld Blood Wars has an open end for another movie, but who knows if we'll be able to see what happen next."
    },
    {
      "rating": "10",
      "text": "Im giving this movie a 10/10 not because I believe it's that good but because it doesn't deserve all the hate it gets. Its not a great movie but its still one I enjoy watching. I love Kate Beckinsale as Selene. And the one action scene where she has a sword is awesome. I love these Underworld movies. It doesn't try to be woke. They just show Selene kicking butt without taking away her sexuality. It's ok to have both.. This movie is probably my favorite Underworld movie. It gives you a satisfying ending although I still want more."
    },
    {
      "rating": "7",
      "text": "I actually liked the whole Underworld thing when it first came out.  By this point I find it lacks the thrills of the first.  The acting keeps you going, as well as the action."
    },
    {
      "rating": "6",
      "text": "Good action, ok characters, some good fight scenes, but the actual storyline was so simple and mostly predictable. Could've been much better if something more was added to the story"
    },
    {
      "rating": "7",
      "text": "The thing about the Underworld series to me and the reason I can enjoy it instead of scuffing is that it's always felt as a good Fan Fiction movie to me. It always had that feel, and I attributed to the funky directing, but it's charming in that way. Please don't expect the best movie of the century, but just as a Vampire/Werewolf Action flick. Not a horror film that should scare you like the idiot critics who after 5 films still judge it as a jumpy horror flick. The acting is subpar and the male lead is just another pretty boy. A lot of the dialogue is just exposition, but again this has always been there and you should expect it. Do yourself a favor if you want to watch this and just enjoy the fan-fiction-esque movie without too high of an expectation."
    },
    {
      "rating": "3",
      "text": "Better than the prequel but still very bad. At this point they just seem like they don´t know what to do anymore."
    },
    {
      "rating": "1",
      "text": "Absolutely horrible garbage! Why do so many people like these stupid movies? None of the Underworld movies are any good and this one is the absolute worst of the bad bunch. This movie was so boring I fell asleep on it. The acting is terrible (which is no surprise at all considering the acting has always been terrible and stiff in the Underworld movies). All of the characters suck. The story is confusing and forgettable. Even the action was boring and shot terribly. The editing was god-awful and there were far too many quick cuts during action scenes. Kate Beckinsale is such an overrated actress and puts no emotion in her wooden performance in these films. The Underworld franchise and the Resident Evil film franchise are both hot garbage. This movie also made no sense whatsoever. So Selene having a taste of someone else's blood makes her see their most recent memories? After Selene is severely wounded, beaten, bleeding, and left for dead on ice above frozen water freezing in the cold night she comes back like an hour later healthy as a horse with white streaks in her hair on her head and suddenly has superhuman speed? That is so illogical that it is absurd."
    },
    {
      "rating": "7",
      "text": "Hey it's not that bad, lot of action, blood, guns + a strong story behind this movie"
    },
    {
      "rating": "5",
      "text": "\"Selene? Yes... that was what they used to call me. Selene the Death Dealer. That was my name. I am Selene the White. And I come back to you now, at the turn of the tide\".Ngl, although I enjoyed this one, I feel like this one was more \"King Arthur\" and \"Lord of the Rings\" than it was a Vampire vs Werewolves movie. Still fun, but I feel like it lost the series identity the other films established.Also, I thought they did my boy Michael dirty in Awakening…but man, Blood Wars was like, “hold my beer”"
    }
  ],
  "recommendations": [
    "underworld_awakening",
    "priest",
    "underworld_evolution",
    "underworld",
    "the_twilight_saga_breaking_dawn_part_2",
    "i_am_number_four",
    "the_twilight_saga_eclipse",
    "immortals",
    "riddick",
    "world_war_z",
    "doomsday",
    "red_dawn",
    "teenage_mutant_ninja_turtles",
    "war_of_the_worlds",
    "infinite",
    "transformers_age_of_extinction",
    "army_of_the_dead",
    "transformers_dark_of_the_moon",
    "the_darkest_hour",
    "the_mummy_tomb_of_the_dragon_emperor",
    "transformers_the_last_knight",
    "indiana_jones_and_the_kingdom_of_the_crystal_skull",
    "the_meg",
    "battleship",
    "polar"
  ]
}