{
  "id": 2068,
  "title": "Unfaithful",
  "starring": [
    "Richard Gere",
    "Diane Lane"
  ],
  "runtime": 124,
  "genre": [
    "Thriller",
    "Drama"
  ],
  "description": "Connie is a wife and mother whose 11-year marriage to Edward has lost its sexual spark. When Connie literally runs into handsome book collector Paul, he sweeps her into an all-consuming affair. But Edward soon becomes suspicious and decides to confront the other man.",
  "releaseYear": "2002",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bjiHEhuiwhIygzjczbTPAA07cGc.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.0,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I'm partial to thrillers that focus on couples, and enjoyed this a great deal. The acting is perfect. The story didn't know if it wanted to be straight drama, or a thriller. It's about a woman who has an affair and the growing suspicion of her husband. I wish the traditional thriller qualities had entered the story a lot sooner, so much more could have been done with that. But just the same, I was totally involved from the start all the way through to the end. Though I would have handled the ending differently. This is not a spoiler because this does not happen in the movie. But at the end the main characters - the married couple - is in a car at night. They are having a very significant moment. There is a train crossing just ahead. That much IS in the movie. For my money - given the shady activities they have both been engaged in - I would have had them drive across the tracks only to get whacked and obliterated by a high speed train. Then black screen and credits while the train whistle blows. But that didn't happen. The actual ending is good, though. Just not as good as that. While it's true that the movie has intense sex scenes, in the end you realize - other than toplessness - they really don't show anything you wouldn't see on the average beach, and all those scenes combined occupy maybe 4 minutes of screen time out of two hours. So reviewers who are calling this porn are just factually incorrect."
    },
    {
      "rating": "10",
      "text": "The subject was so similar to another movie by Lyne, but this one was much more exciting. If you like drama, you have to watch it. It makes everyone think more about having sex out of marriage.\rI don't know why but I think there are many similarities between this and the novel The Scarlet Letter by Hawthorne."
    },
    {
      "rating": "5",
      "text": "Infidèle est le remake amerloque du film franchouillard \"La femme infidèle\" de Claude Chabrol en 1969 avec Stéphane Audran dans le rôle de la femme adultère et l'excellent Michel Bouquet dans celui du cocu...Ici cependant, Richard Gere en homme trompé ne s'avère pas très à l'aise : il semble éloigné de son personnage, voire carrément absent par moments : il faut dire que Bouquet avait placé la barre très haut dans l'intensité et la douleur contenue du mari trahi en dépit de la mise en scène de somnifère de l'endormi Chabrol.Par contre, Diane Lane se révèle totalement dans son personnage de femme victime d'une passion inextinguible... pour un étalon plus jeune qu'elle, en l'occurrence (afin de plaire au public américain) un \"french lover\" et un vrai parisien émigré.. joué par l'acteur français Olivier Martinez passé en coup de vent dans moult productions hollywoodiennes de cette période : il est un peu cave, beau gosse mais surtout un cliché ambulant...Le film d'Adrian Lyne reste en tout cas fidèle dans les grandes lignes à l'original, y compris jusqu'à la même fin ambigüe mais a développé la relation entre l'épouse infidèle et son amant, une partie injustement escamotée du film français. Le film américain a également ajouté un chiard de 9 ans, une tronche à baffes insupportable de débilité dont les parents sont complètement gagas et abrutis (ils mériteraient des baffes eux aussi, on dirait des vieux séniles avec leur clébard).La mise en scène n'a rien à voir avec le film lymphatique de Chabrol, ce qui ne signifie pas qu'il est exempt de longueurs hélas, surtout au début et à la fin... mais après la purge chabrolienne, on a presque l'impression de voir un film d'action ! d'autant que la belle Diane donne de sa personne même si le film suggère bien plus qu'il ne montre.Finalement, l'histoire d'origine certainement intéressante n'a pas débouché sur quelque chose de satisfaisant : le remake est lent et manque de profondeur (même avec Diane...) et à part Diane justement, les comédiens sont à la masse ; a contrario les acteurs français étaient brillants (même Maurice ronet dans le rôle de l'amant !) mais noyés dans la réalisation laxative et l'ambiance de téléfilm de Chabrol.A tout prendre, le remake Infidèle l'emporte certes haut la main mais n'en reste pas moins.. trop moyen pour convaincre."
    },
    {
      "rating": "7",
      "text": "Decent movie but I'm not into infidelity. It just proves no matter how well you think you can hide an affair, the spouse always knows. You stop doing the things you used to. Even when you don't realize it. At least the that guy deserved what he got."
    }
  ],
  "recommendations": [
    "live_by_night",
    "fifty_shades_freed",
    "the_lincoln_lawyer",
    "jane_got_a_gun",
    "bonnie_and_clyde",
    "the_next_three_days",
    "basic_instinct",
    "allied",
    "prisoners",
    "the_town",
    "widows",
    "unforgettable",
    "secret_window",
    "gone_baby_gone",
    "cold_pursuit",
    "the_marksman",
    "elle",
    "the_call",
    "savages",
    "cruel_intentions",
    "the_longest_ride",
    "a_hologram_for_the_king",
    "fracture",
    "reasonable_doubt",
    "greta"
  ]
}