{
  "id": 2517,
  "title": "Unforgettable",
  "starring": [
    "Rosario Dawson",
    "Katherine Heigl"
  ],
  "runtime": 100,
  "genre": [
    "Drama",
    "Thriller"
  ],
  "description": "Julia moves in with her fiancé, David, but his ex-wife and her own haunting past join forces to rock her quiet suburban existence.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/jKyjJu3N0bcF9TzcyGLb0Nn6Uqq.jpg",
  "categories": {
    "plot": 3.1666666666666665,
    "acting": 4.0,
    "ending": 3.6666666666666665,
    "soundtrack": 3.25,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Sometimes I want to go see a trashy movie that doesn’t make sense but makes you forget what is going on in your world. In other words spending 2 hours just having fun at what ludicrous situations you are seeing on the screen and after reading a few things about “Unforgettable” I decided that was the movie I was going to see. To my surprise it was a lot better than I expected.I am not, and have never been, a fan of Katherine Heigl and since she plays the very hissable villainess that brought a sort of fun to watching what was in play. She also made rooting for Rosario Dawson very easy.The set up is slow and plodding because we have seen it dozens of times before but when the two women get into the climatic fight you are completely drawn in. It was if the director Denise Di Novi told the actresses to show the ‘boys’ how a fight should really be done and not to hold back.With the female director, Di Novi, and a female screenwriter, Christina Hodson, I was sort of surprised, and disappointed, that it really didn’t make a difference, or was smarter, in the approach to both sexes. As always the men are brutal, controlling, while the women are complacent and have backgrounds involving violence.Tessa (Heigl) is the ex-wife and quickly establishes through her perfect, not a hair out of place, look and actions that she is deranged. She is bringing up her daughter Lily (Isabella Kai Rice) to be the perfect child. It isn’t long before we meet Tessa’s mother Helen (Cheryl Ladd) and see where the pattern of constantly criticizing the child comes from though grandmother is as sweet as can be to Lily.When we first meet Julia (Dawson) it is the opening of the picture, her face is bloody and she is in a police station being questioned about the murder of her ex-boyfriend (Simon Kassianides) and we go back six months when she has left San Francisco to move to Southern California to live with her fiancé David (Geoff Stults) and get to know his daughter Lily. Almost immediately Tessa gets involved with the new set up claiming her right as the daughter’s mother.Talking about mothers Cherl Ladd is the mother of all mothers and would be the villain of the piece if Tessa wasn’t so perfect in her craziness and how she sets up Julia from the beginning. Talking about that, computer smarts is becoming more and more involved in movies and though I didn’t quite understand how Tessa manipulated the computer to do what she does it is frightening how unsafe we are in today’s world.The last 40 minutes of the movie are sit up in your seat and hold your breath time, making this movie a lot of fun though with some very visible violence. Oh, yes, the last minute is a great payoff which I really didn’t see coming though it makes perfect sense.“Unforgettable” is a trashy movie, really forgettable, but a lot of fun while watching it with good performances by the two female leads."
    },
    {
      "rating": "4",
      "text": "Jealousy has been taken up to another level: Is it a pathology or an exaggerated affection?The Greeks gather the abstraction of love in four appropriate areas, which contain affection types that empirical beings can hand over: Eros (sexual passion and chief propensity of the current romantic- erotic cinema, which inclines to express true love with abrupt lewd interruptions), Storge (linked to the filial and perpetuity), Philia (concord, friendship and appreciation towards others) and Agápe (the purest, chaste and loyal love). There is no doubt that jealousy and love are intimately linked to the loved one. The \"green-eyed monster\", in suitable proportions, is quite salutary, however, when it batters the limits can lead to unhealthy and pernicious triggers of an inhuman Golgotha. Jealousy and love keep one of the most complex, analyzed, multidimensional, amorphous and worst relationships in the extension of their variables in modern cinematography: from mother to child, marital, engagements, betrayals, love triangles, futile ones, passing loves, between siblings, co-workers, older adults, individuals of the same sex and even inanimate beings.\"Unforgettable\", from the producer turned into filmmaker Denise Di Novi, is the latest audiovisual work in joining the vade mecum of the vacuous, blinded, implausible and\u0097although its scriptwriter and director are female- contradictorily misogynist romantic feature films of the 21st century.Julia (Rosario Dawson), a successful and helpful businesswoman, is recovering from a tortuous affair awash with violence, outrage, and abuse. Now she has met David (Geoff Stults), with whom moved to Malibu in order to heal the scars generated by his former abuser. However, David's ex-wife, Tessa (Katherine Heigl), resides with her young daughter in the same locality, where the contact between these two girls will be unavoidable. Julia will take on the most optimal attitude to deal with the megalomaniac and perfectionist behaviors of the good-looking woman. Nevertheless, when Tessa hears that her beloved man is going to marry with her Latina opponent, madness will take shape of an unregenerate blonde with little moderation and insatiable appetite for revenge.No one would think that gender-based violence would be one of the components in an audiovisual production head by women, although this is an apparent trifle and serves as a paradigm of evolution, and it's even less plausible that the scriptwriter, the filmmaker and the cast of talented actresses were to collaborate on the story of two women struggling for the affection of a man. Will it contribute to show that females can be declared free from the yoke of male chauvinism? Of course not, and that's where avidity for light and clearly hollow entertainment comes up. In addition to hide us what we intuit in advance that happens behind the exhibited narrative thread, trying to build a suspense and intrigue point with which to follow the story, they assign to each frame, in the beginning, timing and editing interest is at rock bottom, for later, to grant it a music video clip touch that accentuates, staggeringly, the atrophy in exposition.Di Novi and screenwriter Christina Hodson flaunt their unskilledness in the romantic thriller field with a messy assortment of words and determinations misdirecting the story, even sometimes caressing the absence narrative zone. Long ago I saw no really gratuitous twists and cliffhangers in a real atmosphere, it is assumed that the movie is a dramatic love tale, not a seesaw of stupid vengeance with the antagonist's mother as a sign of redemption.Dawson is the only one who gets out safely of this libidinous congestion, portraying the woman who can perform as a hero as a villain. Heigl demonstrates a high record in the situations of tension and in circumstances where sanity shines by its absence, leaving, as a result, a female duo that is the only thing standing out. \"Unforgettable\" simply squanders the limited potential it conserved; I thought it would deliver a much better motion picture, nevertheless, I come across with a residual puddle of ideas and powerful motives. The typical and pitiful Hollywood audiovisual production that benefits from a contemporary soundtrack, a modern photography and an alleged message of fair treatment in order to connect with the most naive/ignorant people who still have faith in witnessing an absolute rupture of the stereotypes of love in cinema."
    },
    {
      "rating": "0",
      "text": "The worst movie I've seen in a long time... Good idea of ​​script, very badly executed. I never left the cinema wanting to make a review on Metacritic or IMDB, this movie did it. I found it predictable and annoying..."
    },
    {
      "rating": "4",
      "text": "UNfortunately-FORGETTABLE film!Directional debut for a producer. I think she did well. But the film had a major issue. The film was decent with nice performances and production quality. Though it came at a wrong era. Came in too late, at least two decades late. If you had watched a decent number of films in your life, probably you have already seen plenty of similar film. And most of those would have come from the late last century. As what the title says, it was totally opposite of meaning that unfortunately a forgettable film. All the above, they have kept open ending, hinting a sequel could come. I already feel that is a bad idea!Since it was very familiar, easy to predict the scenes and dialogues. Particularly the climax was a let down. I expected something better than usual. The clues, twist, all were ordinary. Though the actors were decent. That does not mean it is worth watching for them. Definitely won't work, unless you are a big fan of anyone of them. Something for sure that it looks like they ran out of the ideas. Why would someone want to make the same old film with a new cast. Why not call it a remake or a reboot! Anyway, don't think it is worth a watch, unless you haven't seen many films in your life or born yesterday.4/10"
    },
    {
      "rating": "2",
      "text": "\"You're not on Facebook or Twitter; you basically don't exist.\"So...\"Unforgettable\"I can easily make a joke about this, but you already did. It's a fact.Oh and I can't believe the 'Lifetime Channel Cinematic Universe' actually exist now. This is cinema."
    },
    {
      "rating": "3",
      "text": "90% of this movie is Katherine Heigl staring at various people and/or things while ominous music increases in the background gradually becoming more and more menacing just to let you know oh yes she’s the evil one, just look at the way she’s staring at her computer screen while the scary music is being scary. I’m so glad the music came on to let me know she’s evil, otherwise I would have been terribly confused. This movie treats the audience like they’re stupid and as a result you get a lazy, rushed together movie that honestly doesn’t deserve your time. The other 10% of the movie is one dimensional characters with failed attempts at character development doing absolutely everything wrong it eventually becomes laughable. If you’re watching this hoping it will eventually pull itself together into a decent little thriller you’ll be left waiting. Not recommended, it’s bland, uninspired and oh what’s the word I’m looking for, oh yes it’s completely forgettable."
    },
    {
      "rating": "2",
      "text": "I saw this movie in a sneak preview, so I did not know anything beforehand about this movie.As the movie uses a single word as its title, I want to use a single word to describe the movie: predictable. Because of the slow pacing and the chosen plot, everything that happens in this movie is (almost painfully) predictable.To be perfectly honest, at no time during the 100 min of the movie did I feel anything that even resembled tension. The biggest problem this results in is that at some point, the glaring plot holes became more and more apparent (which I cannot mention because I don't want to give spoilers). During the climax of the movie, the part which I suppose was meant to keep you at the edge of your seat, my only thought was \"hopefully this movie is over soon\".In summary, the description promises a high-tension movie, but falls short because of the slow pacing, predictable story and numerous plot holes."
    },
    {
      "rating": "0",
      "text": "Unforgettable is a extremely poor example of a thriller… straight up Netflix bottom of the barrel film.So much as if.. smd moments… just this movie really triggered me…I give this movie a straight up 0.1 out of 10.And don’t even get me started on that cop… Sargent idiot and a half… also the script feels like a 5 year old wrote it.. if NPCs could talk this movie is what it’ll look like.Ps: highlighter makes for a really poor blood choice."
    }
  ]
}