{"id": 2523, "title": "Unfriended", "starring": ["Shelley Hennig", "Heather Sossaman"], "runtime": 82, "genre": ["Horror", "Thriller", "Mystery"], "description": "While video chatting one night, six high school friends receive a Skype message from a classmate who killed herself exactly one year ago. At first they think it's a prank, but when the girl starts revealing the friends' darkest secrets, they realize they are dealing with something out of this world, something that wants them dead.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/8byPxREr3BqBNyyij5WHVSOVtYk.jpg", "categories": {"plot": 4.837209302325581, "acting": 5.147058823529412, "ending": 5.0, "soundtrack": 5.0, "cinematography": 0.0, "familyFriendly": 3.0, "funny": 6.416666666666667, "action": 5.0}, "reviews": [{"rating": "6", "text": "\"Unfriended\", like \"Paranormal Activity\", explores and discovers a whole different method of bringing refreshing scares to the audience, which, despite the shallow plot, is pretty enjoyable to watch."}, {"rating": "6", "text": "Who: Shelley Hennig, and a whole bunch of mediocre actors who are probably in tons of MTV shows\rWhat: A surprisingly fun and originally horror romp that can only be enjoyed once\rWhere: The Internet\rWhen (Can I watch again): I defer you to my \"what\" category above\rWhy: If you like teen slashers or are just getting into the genre, this is an adequate film that delivers the genuinely okay time it promises"}, {"rating": "0", "text": "one of the worst and boring films ive ever watched . nothing redeemable . the characters are unlikable and the death scene are so quick if you blink you miss it"}, {"rating": "1", "text": "Firstly, Unfriended is one of the worst films I have ever experienced. It's worse than the Paranormal Activity Franchise. The actors in unfriended are terrible, it feels as if they are just reading their words off a script that is in front of them. People are saying that the video call format for the film is creative. No. It isn't creative, it is because the film is low budget. Also, half the film is a mouse moving around the screen and clicking on random crap. If I wanted to spend half an hour watching a mouse move around a screen I would give my grandma a computer and watch her try to work it for half the film. The story plot is OK until you realise that the thing killing all the friends is actually the ghost of Laura. She committed suicide because of a video of her passed out on the floor with poo on her leg. Another thing I want to complain about is the unoriginality of the film. 'Lets play a game', I wonder what film we have heard that quote in... People that are saying that it's tense and scary properly get scared of their own shadow. Overall, the film is a waste of time and I don't recommend it to anyone under the age of 10."}, {"rating": "1", "text": "I gave it a 1 for effort but this movie is just awful honestly. It wouldn't be bad but you're literally watching 5 people talk on skype and type messages on facebook for however long this movie is. On top of that the story line is completely predictable at every turn. Skip this movie if you value your time."}, {"rating": "1", "text": "I'm not sure, but i think i hurt my eyes by watching this meaningless movie."}, {"rating": "0", "text": "---MAJOR SPOILERS ALERT!!!----\rSo I absolutely hated the movie....\rIt was so damn cheesy.\rThey stole the \"You shouldn't of done that\" Line from Ben Drowned (A very well written and renowned creepypasta) And the ending was so predictable; Everyone dies. The movie was glitchy and sometimes I felt like it froze. I felt like getting mad because I felt like it was MY computer freezing, and not Blair's. (The main characters name is Blair)\rAlso, the deaths were f***ing stupid. Jess gets a hair curler shoved down her throat, The fat dude gets his face shoved in a blender, Adam shoots himself in the face, Blair gets killed by demon (Laura Burns, the girl who killed herself because of a embarrassing video) Mitch stabs himself in the face with a giant knife (WHY THE F*** DOES HE HAVE A GIANT KNIFE BY HIS BED IN THE FIRST PLACE?!?!??!) And Val dies of major seizure. At one point, the characters get notes (Blair gets one that says \"If you reveal this note, Adam will die\" And Adam gets a note saying \"If you reveal this note, Blair will die\") And then Blair shows it and Adam dies. Wow. Great job, b*tch. You just killed your BEST F***ING FRIEND. God, these characters are IDIOTS.\rI really hated it. Very much so. None of it made sense AT ALL! HOW THE HELL DOES A DEMON GHOST THING OPERATE A COMPUTER?! WHY DIDNT THEY JUST CLOSE SKYPE?! THE DEMONS TORMENTING THEM THROUGH SKYPE, SO ITS ONLY LOGICAL TO CLOSE SKYPE, FACEBOOK, ETC. WHY NOT JUST TERMINATE YOUR SKYPE AND FACEBOOK ACCOUNTS SO DEMON CANT TORMENT YOU ANYMORE???? OH, BECAUSE IN THEIR WORLD THAT DOESNT WORK BECAUSE THEIR F***ING STUPID!!!!"}, {"rating": "0", "text": "from start till the end you're watching bunch of teenagers chat use facebook, youtube so on and FOR GOD SAKE messaging, If i wanna watch people typing on the computer I will sit at my own home and surf the internet myself, DO NOT BOTHER WASTING YOUR MONEY TO THE CINEMA, I feel like punching everyone and everything since I left the cinema, never in my life I watched such movie, wait what did I just say \"movie\"? no omg I dont even know how to describe this terrible ****"}, {"rating": "0", "text": "This was an awful movie. I left the theater 45 minutes into the movie. The movie was literally 45 minutes of talking and then 10 seconds of a death scene, and the dialogue was not interesting. Any buffoon with a computer could have made this movie for free, and likely even better than what it was. I had such high hopes for this movie, as it seemed like it could be cinematically intriguing, but it wore off, and the rest was just god awful. I would have demanded a refund had I left 15 minutes earlier, and I should have. Good luck if you go to see this because it is the worst movie that I have ever seen. I repeat, this is the worst movie that I have ever seen."}, {"rating": "2", "text": "With the idea of moving a horror film into social media and the internet, it gives you an opportunity to watch a film in a more realistic way. In fact, you can give it an even more realistic feeling in the comfort of your own home!\r All you need is 5 other friends, and 5 laptops. Have you and 4 of your friends Skype each other while the 6th friend goes around and screws with everybody's computers, killing the other players one at a time with items you can find around the house! If you're the last one to die, then you've successfully watched the entire movie. Now all you need is 4 new friends and you can watch it again! It would be more exciting and scary to do that then sit and stare at a tv screen of a computer screen."}, {"rating": "2", "text": "I really can't say I blame the naysayer reviews for this movie.  There is a long list of movie elements missing from this, and caused me a great deal of disappointment.  Literally, there's 6 or 7 main characters.  Anyone with a PalTalk, YouTube, Skype, Facebook, and understanding of QuickTime could have made this movie.  There's zero talent there.  The plot of the movie leaves a lot of predictability for the end outcome, right from the first few minutes!  Probably worse than anything else is that I was hoping this might actually be a believable thriller about social media and internet technology that might teach a few people a good lesson.  On this front, it failed miserably.  This is total fiction.  Unless you believe that ghosts are computer-savvy, or that people using social media could be talented enough to form a collective group of 6 individuals networking to coincidentally knock off 6 people that had something to do with the death of a teenager on the date of her anniversary, this is a waste of time.  Sadly, the characters in this movie were compelled not to shut down their browsers and simply meet in person?  Holes, holes, holes.  Not only was I not scared in the least by this \"video\", I wasn't entertained, enlightened, fascinated or even marginally impressed.  I couldn't wait for it to be over."}, {"rating": "5", "text": "This is the latest variation on revenge thrillers: 6 high school friends are chatting online, when a former classmate (who recently killed herself) joins their conversation to seek payback. What makes this concept so unique is the point of view: one girl's computer screen. All the action takes place via Skype, YouTube, Facebook, Google, other popular internet-based apps, even Spotify for the soundtrack. That's interesting, but then you have to put up with the teens who constantly over-dramatize, freak out and scream a lot. The murder moments are just that, quick brutal forced suicides…even too short for today's abbreviated attention spans. It's pretty much a clever one-note notion without any surprises or suspense."}, {"rating": "0", "text": "1 83 minute group Skype call where teens are scared enough of a troll that enters the chat to call 911 but apparently are incapable of leaving their bedrooms for any reasons whatsoever and apparently none of these teens have any family living in their homes as no mentions of brothers, sisters or parents, just 6 kids sitting on their asses in their own bedrooms on a Skype call , not once does the camera leave the computer screen of this chat , at some point someone's screen glitches and freezes up and well assume they are dead , I hardly consider this a Slasher film as far as these death scenes go or should I say images of a death scene since every death scene glitches up and freezes. It was fun for a bit watching the teen drama unfold as they dish out each others dirty laundry but the cattiness gets annoying quick enough. IMO it's more for reality TV Junkies that like their cattiness and verbal fights where everyone is calling everyone %$#@ or %#$@^and using the the f word"}, {"rating": "0", "text": "This movie did not cost more then 500.00 bucks to make and could have been made in a day. Heck I'm thinking of making my own movie and spend 600.00 and two days to make it. Im a horror freak and this is and never will be a horror movie. Anyone that said this is scary is probability afraid of a dead ant on there computer monitor. Do not waste you money on this movie. They should be arrested for putting this movie out ."}, {"rating": "0", "text": "Don't waste your time. It's not scary. Don't think: *Maybe fun to watch because it's a bad movie and could therefore be entertaining.* Well if you just happen to have a heavily security-guarded cinema filled with people raging about the stupidity of this film be welcome to somehow enjoy part of the movie but by no means think you won't feel disappointed in the end.\rRead the *Spoiler* reviews to know what exactly is wrong with the film and go on with your life,\r PS: Yes, I registered an account just to rage about the film and I feel better now, thanks!"}, {"rating": "5", "text": "If you're looking for a good time for your weekend than. Try Unfriended. It's not the perfect horror but it's actually a pretty good idea. Every scene you expected something to make you sweaty and it actually did it. The reason why I give this movie a (5) is because of the cheesiness. Like for some reason I found Unfriended quite funny. But it is a good time and you sure will have fun."}, {"rating": "5", "text": "Silly movie, but it has a message.  Things you do on the internet stay there forever. Acting is pretty crummy and pretty predictable.  Don't expect much from this except a message."}, {"rating": "1", "text": "iSwear iHated iMac Unfriended - one hour and twenty insufferable interactive minutes online with a bunch of kids in their terrible teens . A disconnect between a good message - anti cyber bullying - and a bad horror flick. A Blair Witch upgrade with not a scare on the big screen on the small screen - not a care of what comes next- and a googled explanation to boot. I kept wishing for a North Korean hacker to make it go away. Likes: 0."}, {"rating": "8", "text": "Wow! This movie is absolutely incredible! It was fun and fascinating. The whole movie is done in real time. The characters are intriguing and the suspense builds from beginning to end. This movie has its flaws, therefore it's not a 9 or a 10 but for what it is, it does well. It's obviously an anti-bulling message. The whole movie is basically sharing the screen with the protagonist. You see her messages, ims, skypes, etc. That was a very neat concept and I praise that aspect infinitely. However, the cliches are also very obvious and the killer talks in the way that a mother would text, which kinda took away from the zing. However, the story was neat and the acting was awesome! There is also a lot of comedy thrown into the mix. It's a little bit of everything. You'll laugh your butt off and you'll also feel the dread building. Personally I'll say this is a very innovative horror movie and could've totally been a 10 but fell into too many cliches. See it if you're interested; I'm sure you'll enjoy. But it kinda sucks to know how great of a movie this could've been had it not done some of the things it did. The ending is absolutely incredible; it is one of the greatest endings to a horror movie I've seen in a while."}, {"rating": "8", "text": "Unfriended nails it. It's been a great season for horror fans with It Follows and now Unfriended in the lineup. (Though I'm not looking forward to much of the rest of the samey, occulty crap the industry has in the pipeline.  Vatican Papers?  Ugh.)  It fallows is more classic, retro horror, but Unfriended is horror for the new tech-savvy generation. It's a bit of a fable, really. I love the use of technology and the rules that define the action. In the same way that Blair Witch introduced the found footage element to horror, Unfriended does the Skype/YouTube thing perfectly.  Shelley Henning as Blair holds down the sympathetic lead role extremely effectively.  She's always been an underrated actress who has played the supporting role in such teen fare as Teen Wolf, Secret Circle, and Zach Stone is Gonna Be Famous, and I'm hoping that her exposure in this movie puts her into that category of actor who is considered for leads. Speaking of acting, all of the young actors in Unfriended bring a level of authenticity to the proceedings - they simply feel real. The film's only drawback - and this is something that bugs me about many horror flicks such as the Paranormals - is the excessive reliance on demons or spirits of the dead. It's almost a cop out - how does a spirit use Skype?  Oh well, don't worry about it, it's a leap!  I suppose I'm yearning for a bit more tangible reality in my horror such as the raw, depraved humanity of Rutger Hauer in The Hitcher.  But that's just nitpicking, I suppose.  If your'e looking for intensity and a horror flick with a moral message to it (\"don't bully!\"), this one will work for you."}, {"rating": "4", "text": "Most of Unfriended is uninteresting and sappy. But the few ideas it chucks at it do click. The story plays out like MTV's Catfish meets a really bad horror movie. The first half of the movie is not horror, it's young brats' Facebook and Twitters being shown, family photos, scam websites, so basically it's a teaching of the Internet plus a stupid teen love story you know you are gonna hate. The other 80 minutes is where the sh*t hits the fan, and it is... Pretty fun. Really, the jump scares and high octane thrills are well timed and just there and provide us with a better side of this already bad movie. It is a pretty good idea though, a psychopathic killer hunts down the people who shot an embarrassing video of her and she committed suicide, turns out is she alive? The thrill is nice but it could have been placed in a better movie than what we have here. I could have recommended it just for the thrills, but I review on the whole movie, and it isn't good. Unfriended is an awesome idea gone rotten."}, {"rating": "0", "text": "Nobody in this film knows how to use a toaster let alone a computer if you like this movie I have to wonder how the **** you logged into this site. Did you use tech support they are actually hackers please delete system 32."}, {"rating": "7", "text": "Unfriended is different and deserves credit for that.\r - Spot on Tension and cheesy jump scares is what it relies heavy on to scare the audience. However its mysterious enough to leave questions that really play with your mind."}, {"rating": "8", "text": "I actually really liked this movie, they really did something most 'horror movies' didn't do and that was make me laugh. they added so many parts that were funny and that most teenagers can relate with, honestly the only problem i had was how fast this movie was! it was like 82 minutes, and to confirm anyones guess, yes it is 100 percent a pure skype call the whole time, not once do are we actually in any of the people's bedrooms with them, actually another problem would be that there really isn't any character development at all, other than that the ending is amazing and it's also kinda sad, i recommend this movie but don't go in taking it too seriously, just sit back relax and enjoy 82 minutes of this film."}, {"rating": "1", "text": "This movie sucked and I hated it!!  The characters were terrible.  The plot is contrived and boring.  So poorly shot, so poorly directed and so poorly written and it didn’t have to be any of those.  This film has been billed as the next ‘Blair Witch’ or ‘Paranormal Activity’ but those films didn’t aim to be phenomenon’s they were more accidental and based on word of mouth.  This film is clearly trying too hard and I think it will be forgotten when the new ‘Paranormal Activity’ movie comes out later this year.\r It’s another example of why found footage really doesn’t work as a sub-genre of horror and I would really like it to go away for a while and come back with some better ideas.  The film leaves no room open for a sequel so hopefully that means we won’t be seeing another one this time next year!  One of the few positives points I can say about this film is that is didn’t go with it’s dumber original title of ‘Cyber Natural’, Man that sounds stupid!!\r There wasn’t a moment I was enjoying this film.  I was bored from start to finish and judging by the people who were in the cinema with me, I don’t think I was alone in that.  The only moment I enjoyed was when they played ‘How you Lie, Lie, Lie’ by Connie Conway after one of the characters secrets is revealed on the internet by the thing that is going after them.  I was in hysterics!  Much to the annoyance of the people around me!  Seriously, skip this one, and if you must see it, see it as a rental and get as many of your friends around so they don’t spend money on this rubbish film either."}, {"rating": "0", "text": "Sorry but thats really really bad, i dont know why i go to see this movie...\rjust a movie who all time are writing and talking **** and you can know all before you see all the movie. Pls dont waste your money rly"}, {"rating": "6", "text": "Being a huge sucker for found-footage movies, of course I was gonna check this one out, given its unique concept of the whole thing taking place on a laptop screen. And while I wouldn't call it scary by any means, it definitely was unique just like I'd hoped. I really enjoyed some of the creative things they came up with in the film during the Skype chats. Too bad the whole point of the film was for it to be scary though, which, like I said, it wasn't really. But overall, it was just a dumb but somewhat fun film to kill an hour and a half, and also the film's unique concept and some of the clever things and ideas that were in it saved it from being as disappointing as the last horror film I saw (the highly overrated It Follows.) Personally, I'd go see this film again over that any day."}, {"rating": "5", "text": "Unfriended is so far the best comedy of the year, I mean how can anyone watch this movie and take it seriously. It's just a bunch of stupid white teenage's that are to stupid to leave they Skype chat when some one is trying to hack them, you know turn off your computer or quickly report them, that's what most people do.\r The character's in the movie are all the cliche stereotypes that it's really hard to care for them when I couldn't care less if they made it out life or not. Oh and another thing they deaths in the movie are too funny to put into words, I mean how can anyone find a fat kid getting attack by some unknown spirit, puts he's own he's own hand in a blender while he makes a funny noise and then he puts he's own chin in as well. Oh my freaking god I laughed my ass off when that scene happened and it's in the trailer for the movie. I know a lot of you think I'm sick for laughing at stuff like that and normally I'm the kind of guy who doesn't laugh at those stuff, but you got to see the movie yourself to understand what I'm saying and see what I mean.\r The acting wasn't that great, the story I got to admit is very interesting and kind of creepy when you think about it but even that get's overshadowed by it's hilarious sick sense of humor...which I think it's just me.\r I know people want a full detail review that I always do but not for this one as there's nothing there to think deep about and really go into detail, and yes some people may go into deep detail and might find something worth talking about, I did that but couldn't find anything. Maybe these a better movie hidden is this sh*t movie. Agree or disagree this is my open honest review and what I personal think of the film and it's modern day horror ark. I didn't find it scary, but you might, who knows."}, {"rating": "8", "text": "It's almost jarring to see SEGA finally deliver on their generation-old promises that SEGA \"does what Nintendon't.\" They have finally re-purposed Sonic as a platforming mascot that is, for the first time in ages, wildly definable by its own merits instead of trying to play catch up, tagalong or sorority sister with its mustachio partner in crime. Instead, Sonic Generations decides to ditch the plight of spending decades chasing Mario's happy go lucky hop and bop, vacational romps through paradise in favor of a vigorously fast and unforgiving speed drive through dystopia that honors expertise over bubbly luck."}, {"rating": "7", "text": "Ill keep this short, this movie is having an out of body experience whilst masturbating to MIlf porn. The story was genuinely creepy, and innovative! Ive never seen a horror film take a spin on internet horror as this film does. The entire thing is presented via a desktop setting, which sounds crap but amazingly, works. Apart from the obvious jump scare crap and rather horrendous ending, this movie is definitely worth seeing once. The second i went home i was fapping away (Quite vigorously) when a pop up almost scared the **** out of me. It will be a while before i recover. Anyway, go see this movie. Its not crap!"}, {"rating": "10", "text": "It Follows may have been classier, but Unfriended is by far one of the scariest and most intense movies since Paranormal Activity. The film relies on so much effective tension and well-timed jump scares that the entire movie is intense and often disturbing throughout its 82 minute running time. Buffering and slow download speeds have never been more terrifying. Unfriended is so realistic that you feel like you're in the conversation the entire movie. Whenever the characters are yelling and arguing with each other, you feel uncomfortable as if you're caught in the middle of it, and a sadistic game of Never Have I Ever will make you never want to play the party game again. The actors talk to each other exactly how teenagers would in real life, and the fears of your biggest secrets being irreversibly exposed online are all too real in this movie. There were a lot of scenes in this where I was deeply uncomfortable because of those real-world fears. You might miss some of the more disturbing aspects of the film if you're not from this technology-obsessed generation, but Unfriended is an extremely scary and disturbing film that you won't want to press ctrl-alt-del on."}, {"rating": "7", "text": "Unfriended is a very gripping movie it knows how to create tension and atmosphere, Unfriended is easily one of the best horror movies of the last few years"}, {"rating": "7", "text": "Clever ideas and new twists make for a surprisingly original mainstream horror movie. The all too familiar jump scares and cheap theatrics the usual generic, teenage date night, cash-grab horror flicks use aren't found here. What we get here is a creative revenge story with some cool ideas that manages to be enjoyable even if it doesn't quite nail the horror aspect.\r Everything takes place on a computer screen. Skype, Facebook, Google, messaging, you'll watch this group of teens use it all to interact with one another and the vengeful spirit while they play \"Never Have I Ever.\" This movie is really an anti-bullying message meant for this technology obsessed generation.\r It's remarkably entertaining to watch these teens turn on each other as their darkest secrets are being revealed. They are a remarkably convincing group of youngish actors who react just like they should when betrayals among each other are revealed, as well as reveals in the larger plot of what roles they all played in the bullying (both cyber and other) of their now deceased tormentor. Even more impressive is how everything touches on the lifestyle of teens nowadays.\r Sex, drinking, the fact that they all talk crap about each other even though their \"friends,\" all these things that modern teens wouldn't want revealed are portrayed here and brought to life. This is going to be a gut punch of a horror movie to the right crowd. They'll react just as horrified as the characters onscreen do. Older audiences though just might not get it.\r To be honest, it's not a scary movie. Things are dark and some weird stuff is happening, but the real horror comes from the message. Not the crap the ghost is doing. If you don't know much about how younger people are spending their lives, this won't hit you in the same way. Those of us who are apart of the new technological age can eat up all it's little insights into our worlds. I particularly enjoyed the sadistic use of memes.\r Even as someone apart of this new always online generation, the movie still didn't scare me. It even amused me at some points. The at times unintentionally goofy ways it tries to build tension by not having someone message another character back immediately and the ominous Facebook is supposed to be creepy. It's not. There are some cool things going on here, but some awkward execution leads to more chuckles than screams.\r It's a movie that does a good job at delivering it's ideas and message, but is less effective with the actual horror part. While it will only really affect a certain audience, those looking for a truly unique horror film should still be able to appreciate the movie. With some good messages and an all around creative scenario it's still enjoyable even if it isn't scary.\r I give \"Unfriended\" a 7.5/10."}, {"rating": "6", "text": "Better in theory than execution. It's pretty creepy for a while, but becomes ridiculous and somewhat grating. The actors do what they can in the scenes of high intensity, though they're best early on playing regular teenagers wondering who the creeper is on the other end of the Skype call. In the end, it has something to say about cyber bullying and that's enough."}, {"rating": "10", "text": "Honestly the best horror movie I've seen in decades. The characters\rWe're well developed and the story was well written. They didn't drag it out instead they went straight to the point. This will be a horror movie that will be talked about for a long time."}, {"rating": "7", "text": "Essentially \"The Blair Witch Project\" redone in 2015 with elements of cyber bulling, teen drama and revenge. Shelley Hennig is the clear acting standout here in this simple but effective horror film."}, {"rating": "8", "text": "Cool movie with great premise. At 1. hr. 23 min., the movie is still a bit too long. It isn't as scary as people say it is and there weren't any real jump scares. Some character developments were really weak, but overall it was watchable."}, {"rating": "10", "text": "Another criminally underrated horror movie. I don't understand why more people liked Krampus than Unfriended. Unfriended isn't scary, but it's still captivating, and it's a good morality lesson for older teenagers."}, {"rating": "2", "text": "Unfriended explores the average lives of teenagers in the most boring way possible that this horror film could not even be called horrifying when it gets boring. The most ironic thing I have ever seen from this movie is that even YouTube is involved in majority of the movie and yet this still feels like a low-budget YouTube video. Never have I seen a horror movie so boring I wanted to stop the movie before it could even end. If I was in this movie, this movie would have been over in a second because I am at least not as idiotic as our main characters for the plot's sake."}, {"rating": "1", "text": "I think desktop films are a very interesting storytelling technique for the 21st Century however this was not a good one. The first act sets up an interesting premise that quickly dissolves into an uninteresting horror movie. What a waste. The characters are all annoying and the only real good part of the movie is hoping they all die painful deaths. There is way too much showing found on in the desktop. Most people use at least a few keyboard shortcuts from time to time which would also help the place of the film. We know you are copy and pasting something we don't need to see you click the buttons that say that."}, {"rating": "0", "text": "F***ing really ? You gotta be kidding me.Even after watching the damn trailer my eyes and head hurt.A horror movie can`t be something that is happening in front of a f***ing computer on Skype ! Just pull the plug and load the credits!This is the worst,cringiest \"horror\" movie of all time."}, {"rating": "6", "text": "It's the kind of movie that's so bad it's good in my opinion. I enjoyed watching this movie, it's nothing great but i like the way the movie is made with Skype."}, {"rating": "4", "text": "The story of five teens being terrorised by an unseen force on social media is a good concept, and for the first half hour works fairly well, but the novelty of watching a whole film via laptop screens soon wears thin. Plot holes abound and the general stupidity of the kids soon starts to grate. Kudos to the filmmakers for trying to do something new with the found footage film, but the problems that exist within that genre just seem to be magnified here"}, {"rating": "5", "text": "Unfriended is a completely new concept in the genre, and it does well for what it is, however I'd argue that some parts feel a bit too empty and characters are generally undeveloped."}, {"rating": "6", "text": "Unfriended is Paranormal Activity meets MTV's Catfish over a group Skype call.\rNot a bore, Scary in parts but It was pretty enjoyable to watch them die :D"}, {"rating": "7", "text": "In this viral going social media era, our actions must be very cautious!\r A new age cinema. I don't know how it was put under 'found footage' subgenre film, since the webcams involved I think it is very much valid. There are lots of interesting stats for this like it is a $1m film, 80 minutes long, shot within the 16 days, but made to look like a single shot film in real time. This is a story of friends gang whose friend was recently committed suicide. Like usual one day, they are all hanging out on the Skype for a group chat, finds a stranger contact live among them who claims she's their dead friend. So the quest begins to find who really it is and what is the purpose behind such a pose.\r This story is very familiar. Like a gang was put together in a room and revealing each others secret to bring total chaos. Take for example 'Cube'. What follows is we all know which is actually a famous cliché in a thriller like this. So I thought similar way for this and it was, but only in a digital format where the current world trend stands. So this film can be enjoyed by youngsters and those who are familiar which internet forums like facebook, skype, google, email et cetera. In the entire film, all you would see is the computer screen. So you have to quick where mousing is moving and text was composed and concentrating the audio comments. Something like sitting next to a friend's computer and looking what he's doing.\r I think it was a good film, keeps us guessing till the final minute. I'm watching it a bit late, but very happy I did not miss it after all and there is already a second film getting ready which is due this year's end. But I doubt the film won't get anywhere near to this one. The franchise might end up like 'Paranormal Activity' if sequels keeping coming. The actors were good though. I thought one of them was Jennifer Carpenter where one of the film posters resembles 'Quarantine', but during the watch I realised it was a different actress.\r Despite the familiar theme, the setting makes all the difference and pretty entertaining. The end scene was a surprise, because until that point I was not aware of this film genre. Definitely worth a watch for modernising the old storyline with lots of suspense.\r 7/10"}, {"rating": "5", "text": "Give credit where credit is do the concept works for the most part.  I wasn't expecting much and I got a film that at least kept me interested in a game of Never have I ever. C+"}, {"rating": "7", "text": "Although Unfriended isn't very scary (it sells itself as a thriller/horror movie), it manages to be innovative. It is done in real time on a Mac computer screen, and we only see the narrator (Blaire's) point of view the whole film. This same technique was done on an episode of Modern Family, so maybe the creators of this \"movie-in-a-computer\" setting are on to something.\r As for the movie itself, it's not great. The characters are all stereotypes, and the story is pretty passive, leading to a predictable conclusion. However, it is only the beginning of film mastery in this new medium."}, {"rating": "4", "text": "Unfriended doesn't entirely capitalize on its #cool premise through its lack of scares, but still delivers a reasonably fun horror movie that its specific target audience will enjoy."}, {"rating": "5", "text": "Yep, this is the \"Skype horror movie\".\r It's a novel idea, making a movie that takes place entirely on a teenager's laptop screen, with all of the characters communicating via Skype video chat.\r A fun and interesting twist on the found-footage genre, although not a found footage film per se it undeniably takes its inspiration from those movies.\r As interesting as the concept for this movie is, it is also restrictive. The characters are one dimensional and aren't the most likable bunch which leads me to not care for their fates.\r All in all it's a neat little movie that has some flaws namely being lapses in logic or common sense on the characters' behalf. If I were them I would have hung up on the Skype call: \"peace out **** I'm going to sleep\", and then would have shut down my laptop and have gone to sleep. Another little grievance of mine is: they're teenagers, where the hell are all of their parents? I'm just supposed to believe that all of them are alone in the house and are part of an only child club? Come on.\r It's an obvious cautionary tale about the dangers of cyber bulling, the moral of which is: don't be a dick! (also don't talk to people on Skype, that **** is haunted!)\r Unfriended is a Blair Witch Project for the Facebook generation. Take that statement whatever way you want."}], "recommendations": ["paranormal_activity_the_marked_ones", "unfriended_dark_web", "chernobyl_diaries", "paranormal_activity_4", "the_devil_inside", "paranormal_activity_2", "the_strangers", "the_curse_of_la_llorona", "the_haunting_in_connecticut", "stay_alive", "countdown", "would_you_rather", "paranormal_activity_3", "better_watch_out", "splice", "the_blair_witch_project", "brightburn", "dark_skies", "the_bye_bye_man", "bird_box", "the_purge", "host", "devil", "the_possession", "slender_man"]}