{"id": 2596, "title": "Unfriended: Dark Web", "starring": ["Colin Woodell", "Betty Gabriel"], "runtime": 93, "genre": ["Horror", "Thriller", "Mystery"], "description": "​When a 20-something finds a cache of hidden files on his new laptop, he and his friends are unwittingly thrust into the depths of the dark web. They soon discover someone has been watching their every move and will go to unimaginable lengths to protect the dark web.", "releaseYear": "2018", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/nOXuOeD07nZPT29IgiGT0S8PZH.jpg", "categories": {"plot": 4.166666666666667, "acting": 3.611111111111111, "ending": 6.0, "soundtrack": 1.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 2.6666666666666665, "action": 5.0}, "reviews": [{"rating": "7", "text": "I thought this film was very interesting, complex, and suspenseful, but don’t see it in a megaplex if you can avoid it. The big problem is that you cannot read the screens properly, and sometimes you have to. I had on my driving glasses, which allow me to see everything clearly at a distance, and although I could make the words out (more or less) on the computer screens, it was too much effort and too much of a distraction. I also go to a small theater where they show more serious films and foreign films, and I think this film would have worked better if shown there. Sadly, the producers had a good idea and fairly good execution, but decided to go after big audiences in big theaters, and this film is not enjoyable without exceptionally good prints and/or projection. You don't have to read every word, but sometimes being able to make out the text is critical."}, {"rating": "5", "text": "While the narrative method of the previous film remains, at least they changed the story and its semantics and gave it a realistic, rather than supernatural touch, but at times you cannot help but laugh at the improbability of a lot of the situations depicted on screen.It doesn't reinvent anything but for me it was a significant improvement over the first one. Just as a comment, they should stop here. This does not need to be a franchise."}, {"rating": "0", "text": "It is so unbelievable how these movies get made today. They must have some real imbeciles working at the studios... 20somethings who think that anything scary or involving the internet will sell. UGH! The first 20 minutes -- SKIP. Nothing happens and SPOILER the entire movie is a ANNOYING computer screen simulation... just what audiences want to see when they go to the movies... another screen top. UGH. Due to this constraining vehicle, you never get to know or care about any of the characters and like the internet experience itself, the audience feels DETACHED, thus NOTHING is scary or frightening ,except the fact that you can't turn this screen off. Walking OUT is required. ONLY SAVING GRACE -- I didn't pay to see this movie. I paid to see \"Equalizer 2\" but didn't like the seat, so so this piece of trash instead.  If I could track down the director, I'd personally take a leak on his shoe. The movie could have played \"somewhat\" better had they cut away from the god darn computer screen."}, {"rating": "5", "text": "The format that shouldn’t work still kind of does with this anthology-esque sequel. Being locked to a computer screen creates a sense of unknown and claustrophobia even if it isn’t visually exciting. But the rest...The characters are annoying and the dialogue cringe inducing at times. Story tries to be a bit too twisted and clever for its own good. It’s ok."}, {"rating": "1", "text": "What a horrific attempt at entertainment. It's honestly been a decent while since I've seen a movie with such unbridled contempt for its characters and audience. And I know what you're thinking, \"well, horror movies aren't supposed to be uplifting.\" First off, \"The Exorcist\" exists and it's one of the greatest horror movie of all time, so that's just patently untrue. But, secondly, if you're going to kill your characters, at least either do it to make a point or do it to a character who we couldn't care less about. If I wanted to spend time with some characters only to watch them all get killed for no reason other than to make the audience feel like complete garbage, I'd stupidly subject myself to some of the disgusting **** you can find on \"r/watchpeopledie.\" What a bunch of vile, sadistic bull****."}, {"rating": "1", "text": "Remember Unfriended? No? Oh sure you do, it came out in 2014 about a group of friends being haunted by their dead friend's Facebook account. I mean how could you forget something like that. Now here's a sequel anyway because believe it or not Unfriended, that horror movie no one saw or even remembers made a huge profit so we've been given the gift of a sequel. Horay. Matias buys a secondhand laptop online and starts game night with his friends via Skype but he quickly realises that something is not quite right with his new laptop and scary ghostly computer glitchy things start to happen. I never did trust apple. Now if like me you're unfortunate enough to have seen the first Unfriended then you'll know that the entire film takes place on computer screens. An idea that didn't work the first time and it sure doesn't work now. Maybe it's possible to create an interesting movie this way and get the scare factor but as of yet I haven't seen it. You don't exactly go into a film like this expecting much more than a couple of jump scares and a bit of entertainment but it couldn't even do that. Although Unfriended 2 is based a little more in reality that its predecessor it's still absolutely awful from start to finish. You'll be happy to know that Unfriended: Dark Web has also made a profit so we can expect this horror movie franchise to continue into never-ending sequel territory because something's gotta pay the bills and why shouldn't it be a horror movie theme based on technology. If we keep seeing them then they'll keep making them so there's only one thing to make it stop and I promise I'm done now. I never want to see or hear of another Unfriended movie again. You don't need me to tell you to avoid this because half of you probably haven't heard of Unfriended: Dark Web and it won't be in cinemas much longer but I'll take the time to warn you anyway. I took one for the team and saw this rubbish so you don't have to. Not recommended. Avoid."}, {"rating": "2", "text": "Why? What's the point of having another Unfriended movie when the first one is already a huge borefest from my point of view? Like the first one I just watched, I could literally care less about that worthless plot (it's even dumber than the first one too) and its jump scares are more to bring antagonizing laughs than surprising scares. If we keep getting more Unfriended movies that just don't even make the slightest sense, I know who to blame for this unstoppable line of stupid horror sequels."}, {"rating": "7", "text": "Definitely enjoyed this one - though perhaps not quite as much as the original. They're VERY different. And I have no clue why the critics were so averse to the ending?  SPOILER ALERT - it was a shock, sure, but the idea that a group of online baddies might be playing with this dude and his friends, setting up scenarios that they could bet on, take polls about, etc. - it's not any less plausible than the rest of the film. A good way to spend an evening - definitely not just another superhero flick."}, {"rating": "8", "text": "It's consistently entertaining and highly original. It's a fun way to get into a story. I would think this sort of approach would be appealing to people who are into escape rooms and other non-linear, experiential forms of entertainment."}, {"rating": "6", "text": "If you can forgive a handful of implausibilities then it's decent, almost a waste of time but not quite. But if you're all about \"why would he do that?\", \"only an idiot would do that\", and \"that makes no sense\" then you're going to feel this is a waste of your valuable time. The core of the story is interesting but their execution of it had its problems. Normally, I'd have dropped it but I had nothing else going on for a lazy Sunday a'noon."}, {"rating": "6", "text": "First off, I was pleasantly surprised by the change in antagonists. It's obvious now that the hallmark of the Unfriended movies is not so much a supernatural bent (like the 1st one,) but simply that the whole story is told from the POV of a computer screen. Which is good, because this movie gets to go off on its own tangent instead of rehashing the first movie's ghostly plot.The first act is always a bit of a bore, trying to establish the characters and set the scene with limited narrative resources... but once again, when the story picks up steam, the watchability goes way up. This one is all real-world shadow cult type stuff, and it does manage to tell a serviceable story. Most of it boils down to existing \"they know who/where we are\" fare, but there is some stuff in there that stands out. AJ's death was a nice, spicy meatball. The big finish was a bit of a cop-out, but it does wrap up the movie.I didn't absolutely love it, but I do think it has its place. It wasn't bad for what it is, and as long as the inevitable next Unfriended movie is as anthological as the first two, I'm okay with these. It's just that this new screen-capture horror subgenre isn't for everybody, hence the bad reviews."}, {"rating": "9", "text": "great movie! one of the most unexpected i've watched.. it will make u high all thw time, great plots as well!"}, {"rating": "6", "text": "While it's not a bad movie, it's not a very good one either. The acting is okay, the story is fine, the deaths are weak and the ending is average at best. It's just a very average movie. At least it was pretty entertaining."}, {"rating": "1", "text": "Detestable pathetic garbage trash **** youIf the first godawful ****friended had anything going for it, it was maybe the consistent enough computer UI and all that other spunk. This garbage not only has none of that but is just an overall cumshow. The acting is so bad, so pathetic, so worthless. The characters are so ****ing stupid that they deserved to die. The hacker character's able to cover himself up on the webcams by turning into some ****ing pixel-spunk-diarrhea combination with muffled audio for some reason too. He can also just come into everyone's house like he hacked the **** door open or something??? Or maybe the characters just left their doors open because they're already **** dumbasses.The consistency from the first Unfukable is just completely gone in favor of this movie using tension \"building\" music as if it ****ing does a goddamn thing which it doesn't, and pretending like it can happen with the movie still following that computer screen gimmick which is already a ****ing hate crime. The script is worse than sex with me. The plot is warm garbage with two garbage alternative endings because we thought we'd get away with just one, and as if two endings ****ing mattered when the whole movie is executives pretending like they didn't just **** themselves.Seriously how is this not a porno? Inexcusable pathetic scrotum. **** you, seriously just **** you. ****ing Dog****: Dark Web"}, {"rating": "2", "text": "\"Dude, this is dark web!\"One of the most boring horror movies I've seen in awhile. There's no suspense, no atmosphere, no thrills, and nothing to hold my interest. All the characters are either annoying or unlikable, but it's much worst when you're struck with them.Honestly, if I wanted to watch 93 minutes of blank pieces of wood staring into webcams, then I will just go on Zoom."}, {"rating": "8", "text": "I really liked that part. In the second part, even the idea of the film is more real than in the first part.This time I liked the acting.Some of the characters are really cute. And the idea of a \"DarkNet\" is good."}, {"rating": "6", "text": "I found it better than the previous one but nevertheless towards the end it loses strength."}, {"rating": "7", "text": "First film was very authentic and original. Like Paranormal Activity, Unfriended started a new way of film making. Seraching one of them in this year. For that, first film is very important for me beacause of perspective. But first Unfriended's theme was paranormal. It was very scary but you could be like \"meeeh\". But second one's is about hacking. And if you love secret things like illuminati or hacking everything like pro, Unfriended 2 is a hacking movie with suspense souce. Glitches, demonic names, pro hacking, secret death tribes and lot of things. P.S: I like Betty Gabriel since Election Year."}, {"rating": "5", "text": "The movie has a very interesting concept, and even though much of it seems like it was written by someone who doesn't know how computers work or how the dark web works, it still is entertaining. However, the main character was written in such a way that made it almost unbearable to watch at times. the main character is smart enough to code a program, but makes the most basic mistakes that are to be expected from people who have barely touched a computer in their life. It would've been nicer is the main character was smarter and it would've been a battle of wits, or would he been written as your casual everyday user that too would've made all of it just a better movie with realistic character reactions. It's a fun movie to watch when you're bored, but this movie just throws away all their potential within the first ten minutes of the movie, which is such a shame."}, {"rating": "6", "text": "Higher than is predecessor, but lower respect at the horror movies come out this year."}, {"rating": "0", "text": "This movie is doooooooooooooooooooooooooooooooooooooooooooooooooooooooodeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee"}, {"rating": "10", "text": "Unexpected good twists, well executed and very interesting. I did not know anything about this movie before I found it on Netflix. Pleasantly surprised by this gem"}, {"rating": "5", "text": "Internet café guy steals computer from the lost and found but then gets hunted by internet baddies and gets his deaf girlfriend killed."}, {"rating": "6", "text": "Unfriended: Dark Web is the follow-up to 2014's Unfriended and tells the story of Matias, a man who finds a laptop without an owner and starts receiving strange messages from anonymous people. When the real owner of the laptop contacts Matias, he reveals that he is part of a dangerous cyber hacking group who are willing to kill to get their property back. Matias and his friends are drawn into a deadly game of cat-and-mouse as the group holds his deaf girlfriend, Amaya, as an unwitting hostage.The movie explores the darker side of the internet, with the threat being rooted in the real world. The characters are confined to their own rooms, appearing on a group Skype call, which adds to the realism of the story. The performances are solid and the initial mystery element is strong, but the rushed and generic ending undermines the good work established in the movie. Although it's not entirely scary, the realism of the story can be unsettling. Overall, it's an improvement over the first Unfriended movie, but the final act falls short._______________________________________Unfriended: Dark Web es la continuación de Unfriended de 2014 y cuenta la historia de Matías, un hombre que encuentra una computadora portátil sin dueño y comienza a recibir mensajes extraños de personas anónimas. Cuando el verdadero propietario de la computadora portátil contacta a Matías, le revela que es parte de un peligroso grupo de piratas cibernéticos que está dispuesto a matar para recuperar su propiedad. Matías y sus amigos se ven envueltos en un juego mortal del gato y el ratón mientras el grupo retiene a su novia sorda, Amaya, como rehén involuntario.La película explora el lado más oscuro de Internet, con la amenaza arraigada en el mundo real. Los personajes están confinados en sus propias habitaciones y aparecen en una llamada grupal de Skype, lo que aumenta el realismo de la historia. Las actuaciones son sólidas y el elemento de misterio inicial es fuerte, pero el final apresurado y genérico socava el buen trabajo establecido en la película. Aunque no es del todo aterrador, el realismo de la historia puede ser inquietante. En general, es una mejora con respecto a la primera película de Unfriended, pero el acto final se queda corto."}], "recommendations": ["unfriended", "bird_box", "paranormal_activity_the_marked_ones", "chernobyl_diaries", "escape_room", "paranormal_activity_4", "paranormal_activity_2", "the_new_mutants", "would_you_rather", "the_purge", "shut_in", "the_devil_inside", "better_watch_out", "devil", "the_strangers", "stay_alive", "the_curse_of_la_llorona", "brightburn", "old", "the_maze_runner", "countdown", "the_haunting_in_connecticut", "saw_iv", "paranormal_activity_the_ghost_dimension", "frozen"]}