{"id": 3038, "title": "Unhinged", "starring": ["Russell Crowe", "Caren Pistorius"], "runtime": 90, "genre": ["Action", "Thriller"], "description": "A divorced mother honks impatiently at a deranged middle-aged stranger at a red light while running late on her way to work. His road rage escalates to horrifyingly psychotic proportions as he becomes single-mindedly determined to teach her a deadly lesson for provoking him.", "releaseYear": "2020", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/6WC3cIhuaLZSq3SbtdOp2ZTSTe.jpg", "categories": {"plot": 3.15, "acting": 4.620689655172414, "ending": 4.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 3.0, "action": 6.6}, "reviews": [{"rating": "7", "text": "Well, now I'm afraid to honk my horn in case Russell Crowe follows me and whups my ass!"}, {"rating": "7", "text": "Damn, I thought this was a pretty good movie. I winced many times, which is good, and it made me on edge many times. Some scenes didn't make sense or I thought would be just super unrealistic, but other than that it was very interesting and fun to watch. Russell Crowe did amazing, wow. Also, shoutout to Caren Pistorius. Her performance was pretty good. It was a solid movie I'd more than likely watch again or revisit."}, {"rating": "8", "text": "The movie is super intense and very gruesome which I didn't expect. Russell crow plays a crazy person really well and all the others actors are great. I really enjoyed this."}, {"rating": "7", "text": "It is not the best movie you'll ever find but it is actually worth a watch.Russell Crowe delivers a good performance as a mad guy who had a bad day and just takes it against our main character giving her a hell of a bad day.The premise is ok, a mentally unstable guy can start stalking you for the simplest of reasons like \"a car honk\" instead of a \"Courtesy tap\".The movie keeps you in suspense the whole 87 minutes of its extent but to be honest, you have to shut your mind to reality and logic during some of the scenes in which a 120 KG guy can dissappear quickly and unnoticed from inside of a flipped over car or just the stupid police which knowing the face, the name, the car and everything about the guy do not chase him while he destroys half the city crashing cars everywhere he goes.In short, this is a good movie to watch and enjoy, just remember, this is a movie and does not have to follow the rules of reality."}, {"rating": "10", "text": "An epic movie. Action thru almost the whole movie. Russell Crowe was phenomenal."}, {"rating": "7", "text": "There is nothing wrong with a dumb movie. Sometimes it's nice to just sit back and unhook your brain and watch Russell Crowe chuck a Nicolas Cage. Gave me a \"Falling Down\" vibe if William had been cut off in traffic instead of been given a burger that didn't look like the picture. High tension and plenty of cruelty."}, {"rating": "10", "text": "Great film where it takes most of its canon and suspense in phone calls and cars and DOES IT RIGHT. Please watch it!"}, {"rating": "6", "text": "Look, it’s dumb. But it has some bonkers kills, and Russell Crowe makes for a pretty fun bad guy. Worth checking out at the drive-in"}, {"rating": "8", "text": "Russell Crowe stars in the new Thriller “Unhinged” and gives an intense performance which has become a staple of his career. Playing a man who has lost it after the loss of his job and marriage, The Man kills his ex and her partner before burning down their home and vanishing into the night.Rachel (Caren Pistorius) is a woman who is seeing her world slowly crumble around her. She is in the midst of a contentious divorce, has just lost her best client, and is struggling to take care of her son while dealing with her brother in financing moving in with her so she can afford to pay for a needed care home for a family member.As one thing after another mounts for Rachel and dealing with heavy traffic as she tries to get her son to school to avoid a detention for being tardy; she honks and makes and aggressive turn in front of the Man. He takes offense to this and drives alongside Rachel and demands a since apology for her actions. Rachel has long since lost any sense of caring and does not provide a sufficient response which further triggers the Man.As some very aggressive road rage follows; Rachel believes she has put it behind her and drops her son off at his school. While filling up her gas tank Rachel sees that the Man is following her and when her efforts to diffuse the situation further trigger the Man she sees just how dangerous and highly unstable individual he is.What follows is a deadly game of cat and mouse as the Man taunts Rachel while exacting his revenge on those in her life all the while preparing for his next encounter with her.Crowe is fantastic and gives a very intense performance without ever going too far over the top and becoming campy with his performance which is often the case in films of this type. He is a compelling adversary who commands the attention of the viewer and one can see that he is an individual who has simply snapped from the pressures and reality of life and believes his actions are justified.While I was able to predict one of the big moments near the end of the film; it was delivered In a slightly different way which was refreshing. The film was intense and compelling and Director Derrick Borte keeps things from become too over the top especially in the last part of the film where Hollywood standards for the genre did tend to come in the play.The film wisely relies on the strength of Crowe and the supporting performances and provides a welcome return to cinematic features for viewers as long as they are willing to overlook some minor things and focus on the intense story and compelling performances."}, {"rating": "0", "text": "oh no oh no, a fat gladiator is chasing me in his carriage, the best thing to do is to ride through half the city and get no help"}, {"rating": "8", "text": "He can happen to you is the tag line, and it’s true. This movie is great. The performance of Russell Crowe was fantastic. There was good action, good story, and it wasn’t overly corny. Definitely check this out."}, {"rating": "3", "text": "A waste of a fun premise. A very stupid protagonist who constantly makes ridiculously bad decisions provides more frustration than suspense. This film is overly violent and way too light on character or story. There's not a single scare in this entire movie. It's just sadism and cruelty for no reason. A rushed, tacked on ending caps off this unintelligent venture into cliches."}, {"rating": "10", "text": "Road rage is taken its most violent route in this downright gripping thriller. A woman (Caren Pistorius) is having a bad day, which is made worse (much worse) when she has an altercation with a very upset and yes, unhinged driver (Russell Crowe). What could have been avoided with a simple apology turns into a non-stop series of malicious encounters, including several spectacular car crashes. To make a movie like this effective, you need a good villain and Crowe brings all of his talent to create this extremely bad guy. Director Derrick Borte has staged every scene with assured power and continual tension. This is one of those sure-fire audience pleasers that would have the viewers screaming at the screen (if only we could have crowds)."}, {"rating": "9", "text": "I'll make this short. The premise is simple. A man had road rage against a woman and her son. The acting is good. Russell Crowe sells a maniac. He steals the show. The action was a lot better scripted than I expected. The cinematography was done splendidly with certain angles for the chases. Realistic in some aspects for sure. Final thing is that after watching this movie you will think twice about being a jerk to your fellow driver. Solid thriller."}, {"rating": "3", "text": "Unhinged was a movie that somehow released in theatres in these covid times. The premise is \"that a mother who leans on her horn at the wrong time, to the wrong guy. \"Road rage\" doesn't begin to describe what he's about to do to her and everyone she knows\". It's a very silly premise but feels very 2020-like. My interest in this movie was mostly the fact that I got to see Russell Crowe as a villain which is not something you get to see often. However, was the movie a sweet ride or did it make me \"Unhinged\".Firstly, Russell Crowe in this movie is fun to watch. He plays Tom Cooper who is a mentally unstable individual who causes chaos for our protagonist Rachel Flynn (Caren Pistorius). There isn't much depth to his character or anything and for the most part, Russell Crowe just gives an exaggerated angry performance but it's still very entertaining. Caren does a relatively good job as the Rachel and Gabriel Bateman likewise as her son Kyle. They give good performances and do a good job in conveying the fear of this \"road rage\" of Tom. Apart from that, the movie is just extremely silly. You have to REALLY shut your brain to enjoy this movie. Our main character makes some choices that feel really dumb and questionable. You also wonder why she wouldn't do certain things that would be more obvious to do. Likewise, the cops in this movie are absolutely terrible which doesn't feel believable whatsoever. They somehow struggle to catch a killer whos car and face are visible while knowing his objective of terrorising Rachel. They don't hack the phone this killer is contacting her from or have someone protect her and her son. They don't ever maintain contact with her or go on a huge manhunt for this killer is ridiculous. This movie wouldn't have lasted 90 minutes if the cops in this movie were remotely capable. The movie has a lot of questionable logic so if you start questioning everything then the movie becomes very difficult to enjoy.The action scenes are not impressive or anything either. Most of the car chase is just generic looking car chases. I actually laugh during some of these car chases because it can come off as really silly. There is a scene where Tom repeated rams into Rachel's car from behind and it just looks visually quite funny. Also during this scene, none of the other drivers reacts whatsoever. Something I also found funny in this movie is that it seems none of the other civilian drivers knows what a \"brake\" is because they always end up being the one to cause massive damage. During the third act, it becomes a very silly fist fight and it feels very 90's especially since Rachel gives a cheesy one-liner. During the fight, both Rachel and Tom are somehow to able to stealth without making a sound which is such a cliche from old action movies. The movie also ends in a cheesy way with a very silly message of \"don't road rage cause they might kill your family\". Overall, the movie is dumb. There isn't really anything impressive about the movie and I really wonder why they thought it was a good idea to put in theatre around the \"Tenet\" release date. Nothing really makes sense in this movie and its, not like the cinematography or the score is good. However, there is some fun to have in this movie because it borderline is \"so bad it's good\". Seeing Russell Crowe play a crazy guy in a short 90-minute movie is not the worst thing you can be watching."}, {"rating": "4", "text": "It’s always good to see Russell Crowe channel his inner demons and deliver a brutish character and Unhinged does just that. As man at the end of his rope Crowe is certainly a formidable presence but really that’s all this B-movie schlock has going for it. It begins well and the basic premise keeps you watching but it soon succumbs to every formulaic device at its disposal and quickly becomes tiresome and preposterous. As good as Crowe is, this material is very much beneath him."}, {"rating": "2", "text": "Unhinged – Un-Everything Any logical viewer could not be blamed for thinking we’ve had enough of this so-called ‘entertainment’ – there’s no intelligence on display here, it’s all over-the-top carnage.  As road rage goes, this ugliness is equal to a war zone of ultra-nasty smash-ups and brutality. All this from a moviemaker simply looking for new ways to horrifically kill off as many humans - as can be fitted into 93mins of appalling writing. Russel Crow must have entered his golden years to even think of allowing himself to be cast as this grotesque loser (or is it simply uncaring greed)No one emerges from this mess with any credibility except maybe young Gabriel Bateman. He hopefully may soon be given some sort of significant character to play, in something more worthy of his youthful talent.  Basically, this type of movie demonstrates the manifest irresponsibility of movie production and distribution, being inflicted on the sick and sorry world of today.  Many who went out to see this woeful movie might be tempted to join lock-down again."}, {"rating": "0", "text": "Easily the worst movie Russell Crowe has ever made. The premise is terrible, the execution is worse. Avoid at all costs."}, {"rating": "1", "text": "(Mauro Lanari)Nothing to do either with the metaphysical truck of \"Duel\" (Spielberg's debut in 1971), or with the explosion of sociopathic anger in \"Falling Down\" (Schumacher 1993). Borte is content to show us scenes of violence starting from two spouses devastated by their personal failure and engaged in a road rage rampage: she stressed and inept, he obese and with a single facial expression (Bell's palsy?)."}, {"rating": "1", "text": "Ridiculously bad, plot holes aplenty, very little character development or back story (Crowe in particular), and disturbingly violent.Worst movie I’ve seen in years.Avoid. If you must, watch it on ‘on demand’."}, {"rating": "0", "text": "**** terrible, **** plot armor. A 10 year old could write this movie. I mean never in my life have I seen A movie that you can guess the next 10 scenes in 2 min of screen time."}, {"rating": "2", "text": "An insult to movies everywhere, Unhinged is a trope filled pile of nonsense."}, {"rating": "0", "text": "Literally in a realm of absent minded people with no brains. Plot holes every s8ngle step scene and apparently only cops carry guns. Literally the worst movie made ever. Derrick and Carl need to re-think their life goals. They are not very good at making a realistic thriller. Further more the acting is C rated at best."}, {"rating": "3", "text": "Every character (especially the entire police force in this city) is so infuriatingly useless at stoping Russel Crow's maniacal road rage. The subtle errors add up quick. I yelled at the TV for an hour straight."}, {"rating": "4", "text": "Unhinged is just Crow playing bumper cars but it’s just the R-rated version"}, {"rating": "5", "text": "Unhinged:  A strong, independent single-mom experiences consequences for the first time and the entire world falls apart.  It's an OK watch, if it's in the background."}, {"rating": "6", "text": "Beyond the clumsy setup and occasionally cringe-inducing dialogue, there's actually pretty effective thriller DNA flowing through \"Unhinged.\" Putting the audience in a situation that could honestly happen to anyone is a tried and true tactic for the genre, sure, but even premise alone isn't enough to sell a movie. In conjunction with some really satisfying vehicular-based set pieces, it's the snarling, electric performance from Russell Crowe that you really came here to see. And, man is it fun to see him in this type of role. It's a fleeting, thematically impotent experience, to be sure, but not one I necessarily regret sitting through by any stretch."}, {"rating": "5", "text": "Russell Crowe dials up his inner Rutger Hauer (\"The Hitcher) and Michael Douglas (\"Falling Down\") to reap terror on a boy and his mom who don't give him a courtesy honk. Skip this \"meh\" road rage thriller and check out the aforementioned titles instead."}, {"rating": "4", "text": "Unhinged is a barebones thriller that fails to innovate in its overcrowded genre. The camerawork and colour grading look very 2007 esque. The movie tries to make a metaphoric statement on entitled negative attitude but it falls flat here. The performances are ok but there is just nothing substantial happening with the psychology of the lead antagonist to make his rampage find any weight (apart from crowes literal weight!)."}, {"rating": "6", "text": "I found it ok. Nothing that impressive overall, Russel Crowe was great in the movie portraying the bad guy but overall it was ok movie but doesn't tick in memory as something so great."}, {"rating": "5", "text": "Nothing says welcome back to the cinemas better than a deranged and demented Russell Crowe driving around the city in a rage-induced rampage.Rachel’s (Caren Pistorius) already stressful day gets a whole lot worse after a confrontation with a highly unstable man at an intersection. Enter manic Russell Crowe and his roaring pickup truck. Rachel quickly becomes his target and spends the rest of this crime fuelled thriller trying to escape a severely unhinged man. Buckle up for a movie that’s not quite Duel and not quite Falling Down but somewhere in between. Keeps its foot on the pedal from the get-go and doesn’t let up till the credits roll. Stressful to say the least, but it does the job. It’s not the most original or memorable film you’ll ever see and honestly without Crowe Unhinged probably wouldn’t be on anyone’s radar. Yet he makes a great villain with a very menacing onscreen presence. It’s tense, entertaining, and may cause some paranoia the next time you get in your car.Unhinged is the fun and immersive cinematic experience we need right now and after 157 days without seeing a single movie in the cinema I can tell you nothing felt better than losing myself in the big screen and forgetting all the other madness for 90 minutes. So if you’re itching to get back to the cinemas again and looking for something distracting and entertaining, Unhinged is waiting for you. Recommended."}, {"rating": "3", "text": "Russell Crowe is about the only highlight of this film. I mean but come on the plot holes are completely ridiculous for obvious reasons. So much it leaves you as infuriated as the main protagonist."}, {"rating": "6", "text": "Mais si ce thriller fait penser à Duel, il s’oriente davantage vers Hitcher en fin de compte, le fameux Hitcher des années 80… mais sans parvenir à l’égaler, loin de là même… en effet, plus il avance, plus le film perd de son originalité ; il se conforme alors très banalement aux critères du thriller de base, ce qui inclut le final grand guignol et pas mal d’incohérences, pour ne pas dire de raccourcis faciles ici et là.On ne s’y ennuie pas en tout cas et la réalisation est clairement de bonne facture. Malgré la performance de Crow, Enragé reste donc dans les clous de l’honnête divertissement hollywoodien, bien fichu mais sans envergure."}, {"rating": "4", "text": "When this film was released, Russell Crowe asked the public to risk going to theaters to see his new work, and although he can say that he tried to do enough to make his role adequately visible, the truth is that this film wasn't worth the risk. At all."}, {"rating": "6", "text": "2020 thriller movie. The man, whom the accumulated anger turned into a psychopath because he was not valued, is now darkening the lives of those who treat him rudely. Even though there are a lot of illogical scenes in the movie, Russell Crowe, who I always believed to be a great actor, is making him hate himself this time with his excellent acting. The only thing I regret is that the weight he gained made him lose his charisma.There is no nudity or sexuality in the movie."}, {"rating": "3", "text": "YOU WILL HATE THIS MOVIE.This movie is truly another kind of terrible, but ironically Russel Crowe's character, while legitimately psychotic, is absolutely correct about the selfish character of the female lead and her lawyer 'friend' at the restaurant.  LOL This movie is just one bad decision to the next followed by terribly illogical moments that make no sense.  This movie will have you groaning and shouting at the screen for all its illogical nonsense and frustration and you'll want to slap the protagonist around for being so incredibly annoying, frail, stupid, selfish, and unlikeable while also laughing at how ridiculous and unbelievable Russel Crowe's character is and everything he does.Seriously...who writes this crap?"}, {"rating": "8", "text": "I really enjoyed this, as a fan of fast paced action thrillers but more specifically as a fan of fast car chases. Ok so some plot elements don't entirely work or make complete sense but its a tense and engrossing watch, once the pace speedens up within the first 20 minutes or so. I was also surprised by how Russell Crowe looked in the film - has he been bulking up or was he wearing a fat suit? I don't know and the accent was perhaps mildly cringey but in any case, he plays a pretty sinister character. Its a reasonably short film at just under an hour and a half long but I felt quite gripped to the screen and there are some decent special effects present. Its maybe not the most amazing or original of films but if your looking for a fast paced/high octane thriller you can switch off and enjoy, this is a good bet. Yes, I'd recommend this film."}, {"rating": "1", "text": "Steaming pile of garbage.We watched the movie, expecting to be entertained. Our expectations were low, but holy hell. Little did we know our minds were about to be blown, but not in a good way. The plot just straight-up died around minute 10, and the movie quickly deteriorated into a fever dream. As Murphy's Law dictates: \"Everything that can go wrong, will go wrong.\" Nosedive #1:The plot took its first serious hit, when the antagonist proceeded to smash Andy into a pulp in front of a packed restaurant, while nobody seemed to care a murder was happening in front of them. Nosedive #2:We were on the \"peak cringe\" as we discovered that the master plan to defeating the driver was a goddamn FORTNITE strategy that was mentioned early on by Kyle. It is especially cringy, when you consider that the writers \"foreshadowed\" the takedown during a telephone call between Kyle and his father. Nosedive #3:How in the world does an actor like Russell Crowe come even a mile close to this movie? It becomes clear that Crowe is in some serious financial trouble, no self-respecting actor would ever agree to participate in such a load of Bullcrap. This has got to be the lowest point in Crowe's acting career, let alone any actor's career.Nosedive #4:The script is too whack to comprehend. Not once does the police even give a **** about a mother and son being chased by a crazy lunatic. The excuses were so far-fetched that you'd be more successful finding a hot single in your area than coming up with those. \"We were busy\", bruh, they're the police force and they couldn't dispatch EVEN ONE car to help them. Jesus christ, this just speaks of how lazy the writers were. At times, the dialogue feels like an out of season April fools joke. We could name all the instances where the movie dialogue shriveled up and died, but we'd be able to write a 40-page paper. The plot feels like a script bought off of fiverr for 10 bucks. The movie continues to commit cardinal sins every 2 minutes, but going into detail would bore you to death. The script reads like your local methhead's hallucenogenic diary. The dialogue feels like a slap to your face and an insult to your intelligence. All in all, this movie is 90 minutes too long and should never have seen the light of day. It should've been incinerated straight away and it still blows me away that anybody said \"Hell yea, let's make this\". To enjoy this movie, you'll have to be on serious drugs and/or alcohol. On a more positive note, the average viewer of this movie will experience the 8th wonder of Humanity, namely its destructive tendency to make absolute garbage when given millions of dollars of budget.It is truly amazing that there are people in this world, who pretend to see a deeper meaning behind this plot, especially when the last scene reduces the message of the movie to \"Honking bad\". The movie is destroying itself by the minute and we're all grateful that \"the trash bin can be emptied\", with a clear conscience."}, {"rating": "4", "text": "I hate movies far apart from any logic or expected behavior. I mean this guy is killing one after another in public and no-one bats an eye."}, {"rating": "6", "text": "Stupidly fun enough with some decent car chases. Russel Crowe is pretty good and while it lacks any sort of depth it's fun and enjoyable enough to be worth watching."}], "recommendations": ["those_who_wish_me_dead", "jolt", "knock_at_the_cabin", "taken", "3_days_to_kill", "no_escape", "olympus_has_fallen", "honest_thief", "cellular", "the_commuter", "the_mechanic", "man_on_a_ledge", "limitless", "the_ice_road", "47_meters_down", "mile_22", "miami_vice", "flightplan", "infinite", "colombiana", "furious_7", "salt", "robocop_2", "the_call", "snitch"]}