{"id": 4515, "title": "United 93", "starring": ["Trieste Kelly Dunn", "Starla Benford"], "runtime": 111, "genre": ["Drama", "History", "Crime", "Thriller", "Action"], "description": "A real-time account of the events on United Flight 93, one of the planes hijacked on 9/11 that crashed near Shanksville, Pennsylvania when passengers foiled the terrorist plot.", "releaseYear": "2006", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/aahr1uIPrEej8q4baE1RYXOXwFB.jpg", "categories": {"plot": 6.7, "acting": 7.388888888888889, "ending": 7.0, "soundtrack": 5.0, "cinematography": 3.0, "familyFriendly": 3.0, "funny": 5.0, "action": 7.5}, "reviews": [{"rating": "10", "text": "Paul Greengrass, acclaimed director of 'Bloody Sunday' and 'The Bourne Supremacy,' provides this film with intensity beyond climax; tautly and intoxicating retelling the events of the ill-fated journey of United Airlines flight 93, which would cease its travel in a field near Shanksville, Pennsylvania. Breaching my personal list of the \"100 Greatest Movies Ever Made,\" Greengrass' '93' is easily the most emotionally strenuous film in a decade, leaving its viewers shocked and still and utterly silenced in horror by its conclusion, which, despite being a film of unparalleled quality, couldn"}, {"rating": "6", "text": "This movie is ok. When the film goes to the people in the United 93 airplane is really good. But when it shows what happens down it's really boring and it ruins the whole movie. In the ground the story is solid and seriously when the events happened it's like nobody really cared. But when we see the characters in the plane there is action and suspense"}, {"rating": "10", "text": "This film deserves to be seen. and i can't imagine it being executed any better than it was. it's both beautiful and important."}, {"rating": "9", "text": "I just saw the movie. I doubt that a \" box office smash hit\" was the producer's primary motive for making the film. If it was to be a money maker he would have appealed to the larger audience and given them what they wanted; whatever that exaggeration may have been. Also, 10% of the ticket price is going to the families of UAL93 till today ( at least in this area). I heard one of the family members on the radio this morning and they were very pleased with how accurate and respectful the movie was to the subject. It was more a documentary than a movie. There was no need to dramatize this subject. It was a look into how the events of 9/11 as well as UAL 93, threw the passengers, the crew, the Air Traffic Control, and the military, (and much the world) into shock, confusion, fear, anger and action. It gave a perspective of those involved. It showed how we were unprepared for such an attack. We have hopefully learned and will not let something like this happen again. I found the Documentary by the two French Brothers \"9/11\" to be much more \"disturbing\" since it was all real footage of the event... I'm glad though that the producer did ask many of the families their opinion about making this movie. What I found beneficial about this movie was that it has (will) give an opportunity for those who want to know, the probable story that unfolded relative to flight 93. I know that I always think of the twin towers and the pentagon but not UAL 93. I won't over look it any more. Who knows what may have happened if this aircraft completed its goal? There are those who want to remember and those that do not. People will remember in their own ways. I personally am glad I saw this movie. I feel we are letting down our guard when we become complacent. We are foolishly opening ourselves up for another strike. I want to make them work very hard for their next one. And I do believe it is coming. Maybe that is the question. Who believes the threat of 9/11 still remains? Are those the people who are going to see this movie? I know we all wish it was a simple situation and had a even more simple solution: But it does not. We are at war. I feel for the families and passangers of UAL 93. This movie honors them well."}, {"rating": "10", "text": "Unbelievable. No film has nailed me to my seat for five minutes after the end credits started rolling. I didn't think it was possible to make movies like this."}, {"rating": "10", "text": "Alan P. gave it a2:\rA film I left with the feeling I had been cheated. There could be no involvement with any character, the situation or activity. A film made to cash in on the desire for emotional self flagellation over an event few really understand or comprehend. I was was left with the question why bother making such a film.\r Whoever wrote this is a frickin idiot.  I know that sounds harsh, but it's the truth.  No character development...I wonder why...maybe because that was the point!\r Here's a message for you Alan P., When you're giving a film a 2 and you're surrounded by 9s and 10s, either you've proved hundreds of people wrong or you're too intellectually shallow to comprehend even a minute of this masterpiece."}, {"rating": "10", "text": "Paul Greengrass does it again with the most powerful, gutwrenching film I've ever seen! The film was incredibly realistic and brilliant. It leaves you thinking about the hurt and the paim caused by Sept. 11 for weeks after you see it. One of the things so impressive about it was how he portrayed the terrorists. He didn't create them to be evil goons who were out to destroy the world; he showed how emotional they became and also showed how they prayed and conversed with their Muslim Gods. They strongly believed that they were doing the right thing. It was a mentally draining film, but one of the greatest triumphs in movie-making history."}, {"rating": "10", "text": "An inspiring and beautiful film, a moving tribute to the victims of 9/11. I was really surprised how interesting this film was."}, {"rating": "10", "text": "An amazing movie. Difficult to describe, everyone should see this masterpiece."}, {"rating": "9", "text": "United 93 recreates the events of 9/11 in a movie that is marked by seriousness and sincerity. Even when the outcome is already known,  it is still extremely tense and emotionally wrenching. Kudos to the actors/actresses too."}, {"rating": "1", "text": "Oh please! NO one survived! How does anyone really know what happened or what was said? Sure let's make believe but no one actually knows! Right down to the hair and makeup? Really? This was factual?  NOPE!"}, {"rating": "2", "text": "This movie should have been a tribute to the heroes who gave their lives to save so many others on 9/11. Instead, they are portrayed as vigilantes who killed themselves. All they had to go on was the black boxes and the phone calls made from the plane, the rest is conjecture and, in my humble opinion, complete and absolute bull  Nothing like this happened on that plane. They took a tragic story and hollywoodized it until it became a mockery. I was not impressed."}, {"rating": "4", "text": "First off i would like to point out that i mean no disrespect to anyone in this review, because i'm here to review the movie not the events that it based on.\rthe movie isn't about the united airline 93 until 55 long minutes, the movie is loud and the camera work was down right terrible and that's coming from the director of the wonderful captain Phillips and the Bourne trilogy, and i do realize it should be a movie inside an airplane, but i felt dizzy watching this.\rand the movie isn't informative at all, i've seen a documentary called \"ZERO An Investigation Into 9-11\" that almost as long as this movie and it explained everything that happened that day.\rfor instance, the whole air traffic noise and buzz was absolutely useless, all what we learned is that the guys were doing their job, the president is the only person who can issue a military strike on possible hijacked airplanes and the military didn't do anything even after the president gave it a GO.\rfor me i would like to see the details including the fact that every airplane was forced to land immediately and how they closed their air space without any accidents, but i didn't get to see that.\ralso the movie did so little on characters, it's not memorable at all, and the only reason that it is critically acclaimed is the fact that it remind us of a tragedy, but the movie was terrible and could have been way better than this."}, {"rating": "10", "text": "I watched this one last night and I wasn't impressed. What's the point of the film? What is the message of the film? Perhaps the point is to be a historical document in which case a message isn't necessarily appropriate. But if it's a historical document, (and I found myself thinking this during it) how much of it is actually historical? Was hot water really used as a weapon? Why, in a film supposedly about Flight 93, does more than half of it deal with the WTC? If the writer had simply accepted that his movie was not a documentary, he might've felt more liberated to engage in exploration of the some the rivettingly interesting dynamics that another director (like Oliver Stone) would be glad to have the opportunity to use to say something. As it is, we are left with a film that has either a completely distinct location from any film ever shot or a film with no location at all. Frankly, after watching it, I don't care which. I remember 9/11 and it hurt me. Watching this film at times allowed me to remember that pain, but not to deal with it, not to understand it in a different way, and not to feel it more deeply than I originally had, so I say phooey. Well, now we know that tragedy plus time plus a bad writer/director equals boring."}, {"rating": "0", "text": "Faux News...\r \"Riveting propaganda at its finest...\" - Time\r \"4 Stars....\" - Newsweek\r \"This type of propaganda shouldn't be shown on the big screen, but should be shown on the lawn of the whitehouse\"\r - Entertainment Weekly\r \"\"Explosive. Almost like a missle just blew it out of the sky...\"   \r- Variety \r\r\"You would laugh if it were true... \" - The New York Times"}, {"rating": "2", "text": "Propaganda at its best, compelling but so full of bull it make Bush look intelligent! I reckon most of the 10/10 posters are the same people who cheered on CBS midweek, when they showed pictures of dead muslims. Its so sad that so many people are so brain dead/washed, that they only see the world from an Western view point. Next time you fill up your GMC, ask yourself how many Eastern people died just to get your gas in that tank? And I bet many of you don't care, as American blood is worth more than the world put together! You, are truly the oppressed ones!"}, {"rating": "2", "text": "This movie left me with the feeling that America does anything for cash, a media whore who will take advantage of ANY situation for money. The acting and script left me with an empty feeling since the exact events are not known and to fill in the gaps to make money seems so Hollywood. I went into it will a bad feeling and tried to make the best of it but it was just a bad movie that was made way too soon. After watching the movie and seeing all the 100s in the scrore it leads me to believe that less than half of the reviewers were unbiased. Maybe a rental or better yet wait for regular cable."}, {"rating": "5", "text": "Good."}, {"rating": "0", "text": "More Hollywood propaganda to keep the lies alive. This plane was shot out of the air with a missile, the debris was scattered over several miles which is not conducive in the slightest to a plane crashing in one place. Watch this film if you want to continue to be duped into believing that there are hairy terrorists out to get us all, rather than our own government. This movie has been 'okayed' by all the agitprop govt dept's so watch at your own risk."}, {"rating": "2", "text": "I just saw a press screening of this movie. I didn't like it at all. It plays off the emotions of the day and you see everything from an American piont of view. It never gets into why the event actually took place or why the terrorists were doing what they were doing. It brings nothing to society, it just takes us deeper into the Arab-American-hating hole. Terrible."}, {"rating": "1", "text": "Give me a break!  This pathetic attempt at government propaganda was just stomach-churning for those of us who know what REALLY happened that day.....that plane was shot down, which is why there were pieces of the plane up to 8 MILES from the crash site.  This flight, and the rest of the flights, were CONTROLLED BY REMOTE BEACON, NOT HI-JACKED by \"Muslims\" (why are 8 of the 19 \"hi-jackers\" STILL ALIVE, and why are their names NOT on the final flight compliments of any of the airliners?  Hmmmm?).  They're trying to convince you that the people's cellphones actually WORKED at that altitude?  Pleeeease.  Oh, and a bunch of passengers charged the \"Muslim Hi-jackers\" with \"box-cutters\"?  Riiiiiiiight.  This movie was so factually inaccurate it was almost hilarious.  Many will scream that I am \"dishonoring the memories of the victims\" by writing this.  On the contrary, I'm honoring them by asking some very disturbing questions and seeking answers.  \"United 93\" is a LIE, people.  Get the facts before you make an emotional judgement."}, {"rating": "3", "text": "Very \"respectful\", but ultimately I don't know what this movie accomplished. Rhetorically, it seems it has nothing to say. No viewpoint, no politics, no real moral. Artistically, it also accomplished very little. Yes, it was directed with a great deal of research and skill, but the final product feels more like the work of a great recreatist or archivist, not an artist and certainly not an entertainer. I left feeling like the movie was exactly what I expected, yet also realizing that MetaCritic scores made me think what I expected would be worth seeing. I can't say I would recommend this to anyone, even if I respect the craft Paul Greengrass used to bring it to fruition."}, {"rating": "10", "text": "This is the most powerful movie I have ever seen.  It kept me fidgeting and on the edge of my seat the whole movie.  I appreciate the fact that it was not politically driven.  I felt more knowledgable about 911 after seeing this film.  I highly recomend it.\r THIS MOVIE SHOULD BE SHOWN IN ALL HISTORY CLASSES IN PUBLIC SCHOOLS FROM NOW UNTIL THE END OF TIME."}, {"rating": "2", "text": "I don't know if official raters were scared of giving a bad rating in case of being shunned by the public. Don't get me wrong i still think that 911 was a terrible tragedy, but hollywood have exploited this fear and turned it into a film that in no way corresponds with what actually happened. They never made it into the cockpit, There was one less terroist. They insult muslims and turn them into a sterotype of lunatics who want to kill americans. I live in Dubai and all muslims are kind and just want peace . No offence to any families but they make these guys heros. They make the guys heros. All they did was try and save themselves. This movie was made to make money, upset people and generally give a bad name to muslims. Why the two, the scenes were realisic enough and some details were correct."}, {"rating": "5", "text": "Absolutely Boring the first 60 minutes of the film. The last 30 minutes make up for most of the film."}, {"rating": "10", "text": "Absolutely brilliant movie. Greengrass made all the right choices, I think, from the documentary feel to the casting of unknowns (not allowing us the comfort of \"make believe\" that stars might have provided). Besides the subject matter, the movie is so disturbing because it feels so raw and real, a power that may have been drained if Greengrass had gone for the more traditional Hollywood storytelling ideas like \"character development,\" which for me is a dicey term anyway. And the movie's final image is so haunting I still can't shake it. The rare movie that is both smart and tremendously moving without trying too hard to be either one."}, {"rating": "2", "text": "A film I left with the feeling I had been cheated. There could be no involvement with any character, the situation or activity. A film made to cash in on the desire for emotional self flagellation over an event few really understand or comprehend. I was was left with the question why bother making such a film."}, {"rating": "10", "text": "One of the most terrifying movies I've ever seen, but also one of the best...not easy to watch, but an absolute must-see nonetheless."}, {"rating": "10", "text": "I think it is a great movie. It is also a great tribute. I don't care if the events on the actual flight a fictionalized. As told in the movie, they represented how I feel about the people on board. I agree with the viewer who states that if the producers made this movie with hope of raking in the dough they who have made a completely different movie. For those who don't like this movie only because it is too soon, I really have no doubt if they view this same movie 10 years from now, they will discover a new appreciation for it."}, {"rating": "10", "text": "What's especially painful about \"United 93\" is the optimism that the passengers manage to convey in the midst of such dire circumstances. If the mutiny was a successful one, we learn, \"United 93\" could've turned into the best \"Airport\" movie ever. Of course, there was no Hollywood ending, and the filmmaker knows this, which is best exemplified by not overselling the \"let's roll\" utterance into a sort of Arnold-ism. The highlight of \"United 93\" is when events are at an obvious impasse and both sides engage in duelin' prayers. Personally, I felt a little less ultra-liberal walking out of the theater."}, {"rating": "7", "text": "Not like the TV A & E movie-- better for the families to watch this one....and a lot was about the Air Traffic controllers and no names were really mentioned on the plane of who was who- but you know them if you've followed the story. I did not cry at this but did on Flight 93.  Very respectful movie."}, {"rating": "10", "text": "An absolutely riveting, involving film. No other motion picture I have seen this year is as strong as this one. Even-handed to the end, it will raise strong emotions that you cannot surpress."}, {"rating": "10", "text": "This is NOT a Hollywood-like production. Weather fact or fiction, this movie portrays a very real, life or death struggle between men. United 93 demonstrates the crude, human emotion that drives us to live"}, {"rating": "10", "text": "Best of the year, no lie. i can't believe others rated it lower. What do you think is good? Pirates of the Caribbean?"}, {"rating": "4", "text": "I give it a 4 for it's portrayl of humanity.  However, the facts are so unclear of what actually happened that I consider this an irresponsible film for anyone to make.  An event of this magnitude and relevance to the world should only be made into a documentary at most, otherwise it could be looked back upon in the future as propoganda or careless film making.  If you haven't seen \"Loose Change\" you should, to get hard facts that support a very different, but at least equally plausible portrayl of what happened to this flight."}, {"rating": "8", "text": "No character development, and key elements of plot development for a well-told story are also lacking. But it's not a documentary either. It's more like a scene from a play where the viewer provides what came before and after. But it must rate well from an emotional viewpoint. It puts us dead center in the eye of the storm where we have no idea what is happening or will happen next. And for that, though the film proceeds more & more into conjecture, is probably as close to the truth as we are likely to see captured on film. It honors the dead by totally refraining from the melodramatic elements of their situations, so the movie is more about them than what the film makers would like us to feel about them."}, {"rating": "9", "text": "Fantastic and real."}, {"rating": "10", "text": "You know.. I wasn't about this film..\rI really was not sure.\r Greengrass has always been on my radar, his 'Bloody Sunday' was one of the most powerful films I've ever sat through. It was the definition of riviting.. \r\rThis film is no different. There's so much respect and care. This isn't a patriotic RAH-RAH american crap-fest. This is truely one emotional event and realistically portrayed in every way possible.\r Greengrass might be one of the most intelligent film directors out there. He doesn't sugarcoat things, and presents them intelligently; and very emotionally.\r For those of you who are screaming 'too soon!'\rThen, it's you're choice not to see it. But I will say, this is powerful filmmaking. It can't be denied.\r 10/10"}, {"rating": "9", "text": "Very good film. Solid acting from unknowns. Very intense and emotional. It also shows what it was actually like on Sept-11 watching the News and not knowning what had happened. Nice attention to detail in scenes. But a few complaints - the continual \"call you back\" and phone conversations get repetitous, and why do the terrorists just let them all talk amongst themselves at the back? Why do there need to be 3 guys in the cockpit? Otherwise very good."}, {"rating": "10", "text": "Apparently, the movie-going public is not as in need of coddling as some had declared. This is an important film, and while painful to watch, it reminds us that freedom is never free."}, {"rating": "10", "text": "MS. S. is an unsympathetic scumbag cuz its not just a movie u clown and it is good because it is based on true events. If u knew anything about film u would know how well made this movie is and it is never boring. How could u say this movie was boring I was on the edge of my seat throughout. Keep your comments to yourself if that's what u were going to say."}, {"rating": "5", "text": "I'm sorry, but good intentions doth not a good movie make. Leaning so far backward to be unexploitive, this movie is virtually without dramatic value other than being a true story we're all close to. And, hey, acting is a profession for a reason. Not just anybody can do it. Apart from reliving the events of that day, watching the real life people from the control room improvise their own dialog is downright grim."}, {"rating": "10", "text": "Considering that there were only scraps of information available regarding the innocent passengers and the venemous islamo-fascist killers, the movie turned out to be very well made.  I recommend it highly to anyone unclear about the events of 9/11, or anyone who needs a refresher about the kind of scum that hates America.  Tasteful, powerful."}, {"rating": "2", "text": "This movie sucks!! I mean I feel for what happened on Sept 11 but that doesnt make for good entertainment....The camera was so shaky it made me sick, I was so bored throughout the whole thing....I hope this movie bombs....Its already heading in that direction, at the multiplex where I went to see it (on the first Sat it came out) it was showing at the way back of the theater...Which is usually reserved for garbage or for movies that have been out for weeks .There were less then ten people in the theater!!! I only went to see it bcuz it was my girlfriends choice...Although I hated it I could see why it was made and why it will affect people the way it does...Trust me watch it on dvd and save your money for popcorn movies like mission impossible or the davinci code."}, {"rating": "10", "text": "I read Ms. S review and respectfully agree to disagree with her. Unfortunately, we all the know the horror and tragic ending before we enter the theater. Ms. S decided not to allow herself to be seated on that plane as most of us do whenever we watch a movie. If she wasn't herself in that seat then she could sit back disinterested and tear the movie apart as she has done. It's very easy to be a critic when you can become dispassionate about what you are watching because the subject matter is too painful to watch. The truth be told from the director to all the actors you feel their raw emotions as well as the realization as to what must be done at the point of no return. It is simply masterful and captivating. Kudo's to all those involved for making such a great film. And yes, Ms. S as American's we should never forget the events of 9-11 nor should we bury our heads in the sand in the hope that it never happens again. God Bless America!"}, {"rating": "10", "text": "Omg this movie was one of the best movies i have seen.. it touched me ... it made me think a lot diffrent about 9-11 too.. i never really got it till i saw this movie.. it was really good."}, {"rating": "10", "text": "I'm awarding this film a 10. Not a 10 in the sense that 'it was entertaining and I want to watch it over and over', but a 10 for what was simply a job well done. I think the subject matter was extremely difficult to tackle without cliches and 'drama for drama's sake' creeping in, and despite the challenges, the cast and crew succeeded admirably in this endeavor. I found the film endlessly taut and gripping, yet respectful and profound throughout its execution. My hat's off to Greengrass and crew for doing things right without resorting to the tired trappings of Hollywood. Utilizing a cast with little to no name equity was precisely the right thing to do. As I said, this is not a film I feel compelled to watch over and over again, as that implies being entertained...and entertainment was not my reason for going in the first place. I went to remember...and remember I did. I could tell this film connected with me personally after leaving the theater because it's been a very long time since I felt the numbness of 9/11. In witnessing this film's non-manipulative handling of that fateful day, much of that numbness returned to me, and I think that more than anything else indicates this film was a moving and worthy effort."}, {"rating": "8", "text": "I left outragged at the lack of coordination and decision making of everyone except the head traffic control leader. Where were all of the military aircraft? Where were our leaders when we needed a fast decision? I expected the ending verbage to say \"we have fixed our system of command and control so this won't happen again\""}, {"rating": "10", "text": "Outstanding movie on a difficult topic. One can't exactly have a happy ending. Also, all the main characters, of course, die. This was a movie about the heroism of the passengers on one flight. Some of them were more important than others in the action, but nothing was contrived, nobody was larger than life. Even the sound track was good, as were the special effects (though this was not a \"special effects movie\"). Signficantly, a number of the participants on the ground acted their real-life parts."}, {"rating": "10", "text": "This was the most powerful movie i have ever seen very good and is going to win movie of the year never forget the bravery of flight United 93."}], "recommendations": ["zero_dark_thirty", "the_hurt_locker", "lone_survivor", "children_of_men", "antebellum", "13_hours_the_secret_soldiers_of_benghazi", "the_butterfly_effect", "war_room", "babel", "the_lobster", "crash", "apocalypto", "greenland", "cartel_land", "courageous", "source_code", "vivarium", "the_forever_purge", "noah", "contagion", "the_tree_of_life", "the_hunger_games_mockingjay_part_1", "heaven_is_for_real", "unbroken", "slumdog_millionaire"]}