{
  "id": 4620,
  "title": "Universal Soldier: Day of Reckoning",
  "starring": [
    "Jean-Claude Van Damme",
    "Scott Adkins"
  ],
  "runtime": 114,
  "genre": [
    "Action",
    "Science Fiction",
    "Thriller"
  ],
  "description": "After his wife and daughter are murdered in a home invasion, a widower named John now finds himself up against an army of Universal Soldiers in relentless pursuit, led by a mysterious leader who promises to set UniSols free from their conditioning.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/AjJdy7RdVkPm5yCK5apBJKCXf49.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 10.0,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "The result is a very different kind of Universal Soldier movie, but one that at least has the balls to try something new. It may not always be successful, but in an age when filmmakers seem happy to churn out the same movie over-and-over again, credit should go to Hyams for mixing up the tried-and-tested formula. And with the film's finale somewhat open-ended, here's hoping he gets the opportunity to further explore the Unisol universe. An entertaining Universal Soldier movie that dares to try something different."
    },
    {
      "rating": "10",
      "text": "Director John Hyams navigates Adkins in his top form, through layers and themes of Identity, illusions, power and family in a way that is bold, fresh and constantly intriguing. Imagine a classy detective story where clues lead to more clues and more and more and more, thinking that the answer to your question is just around the corner, upon finding out what lurks around the corner, you are not only disgusted and wishing you'd never found it, you get even more questions, till an answers slams you from your own reflection and reveals parts of the truth. So many times the character of John is having to look himself in the mirror and realize that the demons he seeks to confront are not the only enemies he's facing and that the revelation lies both within and without. It is a rich, Sci-fi noir that is not afraid to ask and question the very things we find enjoyable in an action film, why is extreme violence so entertaining ? the answer to that is delivered efficiently in a beat down scene that describes the savagery of soldiers gone mad, and that it's only fun from the side of the perpetrator but not from the victim's pov and Hyams seems to want the audience to experience both sides and understand what it inquires. Why should one trust the savior ? why should one hate the \"villain\" ? what's the difference between a man and a machine ? what's the difference between an order and a choice ? and should one remain in a beautiful illusion or face the horrific reality ? The story isn't delivered as much through dialogue as much as it is through visuals, but even more so through simple thinking, the plot cajoles the viewer into thinking about its basic subject matters and coming up with answers of their own to questions of morality and ethics, while the film provides satisfying resolutions to its contrivances.Aesthetically the film crosses genres between mostly action and horror, before crossing into territories of mystery and genuine drama. It also helps that the soundtrack, this eerie sort of static ambiance that pulsates throughout the rest of the film perfectly portrays not only what must be happening in John's head, but in other Unisols as well, highlighting their inhumanity and attempts made by some to hold onto to something they don't completely believe to be true but believe to be human, it is this great exploration of Identity and self-discovery along the lines of David Lynch, Gaspar Noe and Nicholas Winding Refn that is what's most engaging about Universal Soldier: Day of Reckoning. Of course the film offers the brutal, meticulously choreographed fight sequences, chases and shootouts, something the series is synonymous with, the combination of martial arts, gunplay and car chases, has never looked more slick, kinetic and energizing, with some of the best talent being right there in the cast, Adkins, Van Damme, Lundgren and even the mute Russian MMA fighter Andrei \"Pitbull\" Arlovski show off some truly badass skills as merciless killing machines, almost numb to pain and high on wanting to deal pain. The fights are diverse and enthralling, with some really creative or at the very least, at all times clear and steady framing of punches, kicks, spin-kicks and all the glorious martial arts pizzazz you've come to expect from the stars. Yaron Levy's cinematography is crisp and sharp, Hyams' editing is lean, mean and spare, drawing attention to hardest of hits, without having to rely on slow-motion, that effect is used to punctuate the little breathing room these soldiers have before the assault of their next prey. One of Scott Adkins' best action sequences is in this film, a single-take three minute tunnel fight, that mixes gunplay, fisticuffs and suave footwork, almost as well as the higher-budget John Wick films, yet on a more cerebral and grimy level. The standout from the film has to be the throwdown between Arlovski and Adkins in a sporting goods store, where bats, baskets, and other equipment are used to a gleeful insane level, with a finisher straight out of Mortal Kombat, Hyams and the crew make sure to sprinkle the many upon many action sequences in way that doesn't hinder the plot, but even more surprisingly(especially for a DTV film) ENHANCES the narrative, develops the characters and seduces the audience into thinking that what they're watching is mindless, ultra-violence and then reminding them that it's precisely this violence that drives the film forward.Universal Soldier: Day of Reckoning, is a triumph, a modern action cult classic, that I'm sure fans of the series or the genre will grow to appreciate more in the coming years, with its twisted plot and mechanics, to its sickening displays of brutality and hunger for power, to the more down and low-key scenes of clarity and feeling towards something one feels strongly about, while delivering on the excitement and anticipation of blood-hungry action fans with bullets, fists and broken bones galore."
    }
  ]
}