{
  "id": 2254,
  "title": "Universal Soldier",
  "starring": [
    "Jean-Claude Van Damme",
    "Dolph Lundgren"
  ],
  "runtime": 102,
  "genre": [
    "Thriller",
    "Action",
    "Science Fiction",
    "Crime"
  ],
  "description": "An American soldier who had been killed during the Vietnam War is revived 25 years later by the military as a semi-android, UniSols, a high-tech soldier of the future. After the failure of the initiative to erase all the soldier's memories, he begins to experience flashbacks that are forcing him to recall his past.",
  "releaseYear": "1992",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fp0mWrHl1SW9PhP8QcsgYPoVYFc.jpg",
  "categories": {
    "plot": 7.75,
    "acting": 5.5,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 7.0,
    "action": 6.428571428571429
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Estupidamente subestimado pela crítica.Excelente história ok é quase a mesma do Exterminador do futuro mas é quase é diferente. E Brilhantemente executado. Ally Walker é linda e brilhante como a repórter ousada Veronica Roberts,Jean Claude Van Damme e Dolph Lundgren são brilhantes como Luc Deveraux / GR44 e Andrew Scott / GR13 respectivamente,Roland Emmerich é ótimo na direção. Um filme muito divertido."
    },
    {
      "rating": "4",
      "text": "Typical lunkheaded Roland Emmerich/Dean Devlin stupidity. Dolph Lundgren is such a bad actor that you can't take his supposedly psychotic solider seriously for a second."
    },
    {
      "rating": "4",
      "text": "On the one side the basic idea of the movie is not bad and some of the action scenes are looking great. But the story and especially the actors are not good, even the fighting scenes are looking so artificial. Van Damme can convince sometimes and you can get pity for his character. Lundgren is just a bad actor."
    },
    {
      "rating": "8",
      "text": "A true 90's action sci fi film which is up there with The Matrix & T2: Judgment Day, Well not as good as those films but still a fun action packed adventure with bad ass super soldiers with guns and explosions."
    },
    {
      "rating": "7",
      "text": "Universal Soldier is a sci-fi kind of action film which also introduces an excuse for Jean Claude Van Damme to use his martial art skills to kick some butt... More of an action film than anything else, made in 1992 by Roland Emmerich and stars Van Damme and Dolph Lundgren... Full of violence, gory moments, funny moments, cheesey moments and bad language... Dolph Lundgren wears a necklace made out of ears and says cheesey things with a macho and fearless image and Van Damme also is macho in the film and both are fighting against each other and Dolph Lundgren throws grenades at the vehicle Van Damme is in and shouts  \"Are we having fun yet?\" lol.. A woman or reporter teams up with Van Damme too. The acting from Dolph Lundgren is pretty badass but Van Damme isn't impressive in my opinion and some can argue Lundgren and Van Damme were both bad and that maybe true but I liked Dolph Lundgren's character even though I'm not a fan of his.  Not the best film but Universal Soldier was better than any of it's sequels. Also stars Ed O'Ross."
    },
    {
      "rating": "10",
      "text": "the cast is pretty good the plot is a bit like terminator in fact this whole review was supposed to be the whole plot"
    }
  ]
}