{"id": 392, "title": "Unknown", "starring": ["Liam Neeson", "Diane Kruger"], "runtime": 113, "genre": ["Action", "Mystery", "Thriller"], "description": "A man awakens from a coma, only to discover that someone has taken on his identity and that no one, (not even his wife), believes him. With the help of a young woman, he sets out to prove who he is.", "releaseYear": "2011", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/aXBQD515okXQZmYA89ntXMvSJSd.jpg", "categories": {"plot": 7.0, "acting": 6.0, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "This movie was really cool, not only because of it's terrific cast, but also for the way the story is done. At many points this film seems familiar, mainly because it has similar pieces to similar movies all put together into one original story. A group of people wake up locked in a warehouse with no memory of who they are or how they got there. Only one thing becomes immediately clear, if they don't discover the truth and how to escape, they'll all be dead soon. Its not the strongest story or ending, but the way this film was done was just pure genius. Defiantly worth seeing!"}, {"rating": "10", "text": "I loved it. Witty and exciting. Great script, great twists."}, {"rating": "7", "text": "Solid acting by the cast and interesting story. The side plot involving the cops really takes away from the main plot and was sort of unneeded. The twist ending certainly helped end the film on a high note. Overall, It was actually quite good and I'd recommend watching."}, {"rating": "5", "text": "Not great, but really not bad. Cool concept and good cast, but lacked something... Can't quite place what.Maybe it would be better if it kept to the 'one-room film' formula. The scenes on the outside with the cops were distracting and not really necessary for the plot..."}, {"rating": "5", "text": "this movie could have been really awesome but from the beginning you get taken out of immersion because of all the illogical events and dumb character decisions."}, {"rating": "6", "text": "Love movies like this, but it was so expected for me. Can't say it was interesting and have point in the end, but nothing so special."}], "recommendations": ["flight_of_the_phoenix", "the_good_liar", "marauders", "now_you_see_me", "man_on_a_ledge", "a_perfect_getaway", "now_you_see_me_2", "the_loft", "the_maze_runner", "the_number_23", "i_see_you", "marrowbone", "gone_girl", "army_of_thieves", "the_prestige", "shutter_island", "pirates_of_the_caribbean_on_stranger_tides", "grudge", "the_mountain_between_us", "the_bank_job", "bad_times_at_the_el_royale", "the_usual_suspects", "taking_lives", "wrath_of_man", "rocknrolla"]}