{
  "id": 4379,
  "title": "Unlocked",
  "starring": [
    "Noomi Rapace",
    "Orlando Bloom"
  ],
  "runtime": 98,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "After failing to apprehend the terrorist behind a Paris attack that claimed dozens of lives, CIA agent Alice Racine is forced to live in London as a caseworker. Her mentor unexpectedly calls her back into action when the CIA discovers that another attack is imminent. Alice soon learns that the classified information she's uncovered has been compromised...",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fBDLdEraxCBKGmOPb6pJPYiDQh1.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 4.0,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 4.0,
    "action": 7.5
  },
  "reviews": [
    {
      "rating": "4",
      "text": "While the topical British thriller “Unlocked” is neither as entertaining nor as evenly paced as other films in the espionage genre, it makes up some ground with a story that is absorbing and twisty."
    },
    {
      "rating": "4",
      "text": "Unlocked is your run-of-the-mill let’s save the city with one second left on the clock popcorn movie. Predictable to say the least, it ticks all the boxes under terrorist/conspiracy/biological attack etc, etc. Could not be more generic even if it tried. The plot is so unimaginative you’re always two steps ahead of everything that’s happening. This is not helped by every single bad guy completely bursting with a shady presence and practically glaring through the camera directly at you. Noomi Rapace is better than this, Orlando Bloom is lucky to even be here and as for Michael Douglas and John Malkovich well they’re just here for the paycheque. Not the worst thing you’ll ever watch but it drifts in and out of a boring story you’ll find the end can’t come quick enough.Not recommended unless you really have nothing better to do with your time. I’d like to think I’m providing a public service by watching these bad movies so you don’t have to. You’re welcome."
    },
    {
      "rating": "7",
      "text": "While it's certainly cliched and somewhat slow at times Noomi Rapace shows once again that she can act. Story was interesting enough with some nice twists and turns and there are some truly superb action sequences."
    },
    {
      "rating": "6",
      "text": "Unlocked makes use of an excellent cast in this interesting if predictable spy thriller. Rapace in particular had me engaged from the get go, but Unlocked failed to capture my imagination in the same way as other better examples of the genre. Worth a watch for sure!"
    },
    {
      "rating": "8",
      "text": "Pleasantly surprised by this thriller starring Noomi Rapace. Kept me engaged throughout with its well presented and non-stop action scenes. Would recommend as a really good escape flick."
    },
    {
      "rating": "10",
      "text": "Great movie.  I want to finish watching it. I watched about 20 minutes of it on encore."
    },
    {
      "rating": "4",
      "text": "Dull and predictable scenario with very poor and tiring editing. Great actors in a bad criminal movie which are common lately. It is a pity that such poor film with five leading actors appeared in theaters."
    },
    {
      "rating": "7",
      "text": "Trailer gives away a bit too much, I watched without remembering what happened in the trailer and it was a bit more interesting to me, the first half of the movie in my opinion was quite intereesting and there were no problems with pace for me, but the second part and the conclusion was just so messy and it felt like they resolved everything the easiest and most predictable way possible. Still, in my opinion a good movie."
    },
    {
      "rating": "1",
      "text": "Noomi Rapace en tourne des films et on est bien content pour elle, car nous l'apprécions tout-à-fait... mais elle tourne quand même un peu trop de merdes et j'ai comme l'impression qu'elle devient un Statham au féminin.Pourtant, ce \"Conspiracy\" commençait bien, comme un film typique d'une chasse aux islamo-terros (toujours en train de comploter des saloperies) avec Noomi sur le coup ainsi que son mentor, Papy Douglas (eh oui, déjà...) et Malkovich qui cabotine le minimum syndical (mais un vieux, faut que ça mange...). Mais Papy ne dure pas très longtemps, car la conspiration sévit à plein régime... sauf qu'on n'y pige rien à ce foutoir.Le MI5 et la CIA semblent se tirer la bourre (de façon carrément violente... lol ?) tandis qu'un méchant terroriste blanc (et converti, soit) veut empoisonner le monde... d'un autre côté, l'Imam est un gars tout gentil, la main sur le coeur et tout et tout... On dirait bien un film de gauchistes qui nous prend pour des cons mais surtout un film qui n'a aucune idée de ce qu'il est en train de faire : la confusion qui couche avec l'invraisemblable et se conjugue au grand n'importe quoi : Tom Clancy dans les cordes !Putain mais quelle daube, ce truc !"
    }
  ]
}