{
  "id": 3017,
  "title": "Unstoppable",
  "starring": [
    "Denzel Washington",
    "Chris Pine"
  ],
  "runtime": 98,
  "genre": [
    "Action",
    "Thriller"
  ],
  "description": "A runaway train, transporting deadly, toxic chemicals, is barreling down on Stanton, Pennsylvania,  and proves to be unstoppable until a veteran engineer and young conductor risk their lives to try and stop it with a switch engine.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zKvHwL0GqLOear8rTnUPSTRYY0r.jpg",
  "categories": {
    "plot": 7.628571428571429,
    "acting": 7.71875,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 7.6,
    "familyFriendly": 6.0,
    "funny": 8.4,
    "action": 7.7407407407407405
  },
  "reviews": [
    {
      "rating": "8",
      "text": "In Tony Scott's third straight feature starring Denzel Washington, he takes a look at an incident that occurred 3 years prior in Ohio. The event was nowhere near the magnitude seen in Unstoppable, but it defiantly put lives at risk, and put people to the test. The story follows an incident with a runaway train and the two men who risk everything to save lives from it's dangerous cargo. Washington is terrific as always, thriving in these unsung hero roles. Chris Pine, the virtual newcomer who  plays the rookie, on his first day of work, is also really good and shows the potential for a strong film career. While it's not going to surprise or shock anyone, Unstoppable was fast paced, visually impactful, and very entertaining."
    },
    {
      "rating": "7",
      "text": "Definitely a movie worth watching, especially for the casting and the cinematography, but the film does have some plot credibility issues.\r(You should also see it because it won't have a sequel, and thus won't be ruined over time.)"
    },
    {
      "rating": "8",
      "text": "It's no work of art, but it's great fun from start to finish. Denzel is absolutely perfect for the part, and Chris Pine's part is very well-written, and well executed.  I also have to say that Rosario Dawson does an incredibly good job in her role - why she isn't an A-list star these days is beyond me. Also, the guy who plays the lead welder is a revelation.  He needs larger parts."
    },
    {
      "rating": "8",
      "text": "Good movie, does the action movie justice. It has class to it, not the normal mindless action films that have came out recently. Over dramatized from the actual real life story which the movie is based on, but this makes it more fast paced and interesting."
    },
    {
      "rating": "7",
      "text": "Script: a runaway train named 777 is heading at a rapid speed towards the city of Stanton. Meanwhile as it goes on, two persons frank and will are undertaking a locomotive named 1206. As they come to know about the unstoppable , frank devises a plan through which there are chances of stopping it. What is the plan frank devises ? how they stop the train is the movie about!\rExecution: the two questions are been effectively answered. The movie ran for 92 minutes with perfect execution without any boring scenes. Right from the start till the end , the movie had adrenaline rush. Thanks for the crisp editing for the thrill to keep alive at regular intervals. Direction and screenplay: tony scott had done a commendable job. Though the script is in one line , the movie is definitely a catchy one. Screenplay is very fast without any slowness.\rCasting: densel Washington and chris pine are the main characters of the movie. They have done a good job. An equal support by Rosario dawson and galvin gives the movie equal benefit. Rest characters fit well.\rBackground score: the rustling train sounds right from the start till the stopping of the engine , the train roars. Set in a perfect soundscape , the train 777 will rustle and roar in the cinema halls. A perfect movie for home theatres also. The score is soothing , scintillating and sometimes picks up at right intervals. The sound editing is awesome.  Editing: the editing of the movie is crisp and standard. The movie ran for 90 minutes and it seemed that the runtime was still far better. But due to crisp editing , the movie was perfectly driven with the train on board and 2 people on its way.\rCinematography: the visuals in the movie are good. But cannot say they are awesome. The train moves and the surrounding scenaries of various towns across pensylvennia are captured. Nice view from the helicopters. It looked decent.\rVFX: the visual effects in the movie are not there to that extent. Few crashes and explosions are there. It moves off very quickly. But anyway , the scenes had good visual effects.\rAction episodes : there are 3-4 action episodes and stunt scenes performed by the lead cast. Not in terms of bashing of goons , but in terms of jumping onto the train. They are good enough. Camera zooming is good and the thrill during jumping , is intense.\rProduction values: the movie has a good budget. Nicely taken and it deserves\rEntertainment value: the movie is entertaining. It is a perfect adrenaline rush movie. The viewers are hooked to the seats right from the title and the start of the 777. Till the climax scene everyone are hooked and this is a perfect treat for the weekend night along with the family. Rating: 3.5/5.0\rFinal word: unstoppable is well packed action entertainer. It is a good movie. A sure hit. It deserves 4 stars but , due to lack of startling graphics and interesting cast , the movie stays with 3 Â½ stars."
    },
    {
      "rating": "9",
      "text": "this was intense! I was on the edge of my seat throughout. I was amazed. It was a little slow at the beginning and it took a little while to get going, but once it got going, it was GOING! And throughout this intense action, they added in some comedy that was funny and it worked. This movie deserves your money. If you're seeing skyline, forget about skyline, Unstoppable is where its at! This script is solid! The acting is phenominal! the visuals, dear lord they are awesome. Although a slow, and somewhat long start, this movie is great fun!"
    },
    {
      "rating": "8",
      "text": "We live in a world where, unless someone sucks it up and makes a sad, tradgedy, you will be able to predict what will happen. Therefore, it's the stuff that happens in the middle that really matters. And Unstoppable does a good job with that. The characters are all dealing with their personal problems (except for the guy in the pickup truck) and little personality tugs (except, once again, for the guy in the pickup truck). Most of the plot holes were filled except for: why not just keep chasing the train down in a pickup truck instead of a bunch of crazy other options. And of course, I wish it was a sadder story. Probably wouldn't even have picked it up the shelf ifit wasn't. I mean, why would there be a train with toxic chemicals running off and crashing into things!? They explained that nicely with the fat guy that ended up in the fast food industry. And I think the school children should have died. But it was still one of the best movies I've ever seen (and it's competing with The Dark Knight, Inception, Gladiator, Lord of the Rings, Batman Begins, and IRobot (at least one of these names has to mean something to you)). And to criticmike: the train that was \"unstoppable\" was going to fast to sidetrack."
    },
    {
      "rating": "8",
      "text": "The best popcorn thriller of the year - I was on the edge of my seat for the duration.  The direction and pacing is tight, the plot is kept to a minimum, and the cinematography (although exactly the same as all other recent Tony Scott films) keeps the momentum and tension on track.  Much of the credit has to go to Washington and Pine for their easy chemistry and considerable everyman charm (and their bravery in tackling the stunts).  Rosario Dawson too, is perfect and fresh in her role, effectively representing the voice of reason.  All three are likeable despite very little backstory and demand real empathy from the audience.  The only downside is that some minor characters are underwhelming and their reactions at times are insufficient (particularly when their loved ones are in serious peril).  In saying that, simplicity is the key to this films success, and all aspects result in a fun frenetic experience."
    },
    {
      "rating": "8",
      "text": "\"As Implausible the film maybe its still an entertaining truly original edge of your seatl non-stop thrill ride that never lets up. With outstanding lead performances from Denzel Washington and Chris Pine , this just may well be Tony Scott's best film in years!\" .. B+"
    },
    {
      "rating": "9",
      "text": "It starts as another day in the locomotive for Denzel Washington and Chris Pine, but  when an unmanned runaway train is on a collision course with disaster, it's their mission to stop it. There's nothing unpredictable about this solid script, just a nonstop level of nail-biting tension (I lost 2 nails). Thanks to director Tony Scott's dazzling direction and spectacular setups, this is they type of slick entertainment that Hollywood does best."
    },
    {
      "rating": "7",
      "text": "Despite its simple plot, Tony Scott managed to make this into a full length feature film and resulted in probably making one of his best films in over the past ten years. Certainly there were some glitches but in the end this film resulted in something that is worth-while entertainment."
    },
    {
      "rating": "7",
      "text": "Unstoppable is a pretty good movie.\r The first half is slow and boring but in the second half it was great.\r There were actually a few little jokes in there as well.\r Great action movie."
    },
    {
      "rating": "9",
      "text": "This considerably short movie, that zips through its length even though it's short, is very amusing. It is quite suspenseful & you are never waiting for something to happen, because it is never dragging. Denzel Washington also is great for the part that he has, & with a little humor added in, you won't want to miss this one."
    },
    {
      "rating": "10",
      "text": "I'd prefer to give it a 94 or 95.  This isn't without its flaws in the grand scheme of movies.  But as an action film, I can't recall anything recent that comes close to this kind of perfection:  engrossing and suspenseful, effortless, and memorable only because it's an hour and a half of something awesome."
    },
    {
      "rating": "8",
      "text": "As always, part of the movie experieince is the mood or attitude you bring as a viewer.  For whatever reason my mood was perfect for enjoying Unstoppable.  It started as can be expected, a train that can't be stopped, wooh, how will it end.  But at some point in the first hour you suddenly realize that the director isn't phoning it in.  Every smart idea you can think of to stop that train, they actually try, and everything fails.  The director does a great job of staying one step ahead of the audience which allows control freaks like me to relax and just follow.  At one point when things started getting particularly heroic, I had an emotional flash back to 9/11 and felt like chanting, \"AMERICA!\"Great job guys, well worth our time and dime."
    },
    {
      "rating": "8",
      "text": "I'll admit I know less about the railways and railroading than Keanu Reeves and Sandra Bullock combined! So whether this was factually or technically accurate in reflecting the true nuances of railroading, I will never know and neither do I give a hoot. And it is probably for those reasons that I enjoyed this film.Denzel was his usual  wily, knowledgeable character who plays the underdog who comes out smelling like champagne and roses.Chris Pine is proving himself to be an actor of class who brings a believable feel to his character.Beyond the obligatory America-centric fist pumping and show of corporate negligence, the film rolls on at a consistently fast pace with some novel ideas.This is no Speed - because it is better due to credible actors keeping this \"on track\" and making it a very enjoyable few hours of entertainment."
    },
    {
      "rating": "8",
      "text": "Finally a 21st century Tony Scott film that I really loved watching! None of that false-colour, jumping-camera stuff he did in Domino, Deja Vu, Man on Fire and other movies. The story isn't that deep but extremely effective. Chris Pine does a solid job, as does Rosario Dawson. Denzel is, well, Denzel. The film picks up early and doesn't let up until the closing scenes. Well done on all fronts."
    },
    {
      "rating": "8",
      "text": "Unstoppable is inevitably one of those films that will be undervalued because it is so succinctly a solid film with very little fluff.The premise is very simple: there is a runaway freight train carrying hazardous chemicals set to derail in a heavily populated area and create a catastrophe. If you have seen the trailer, you have also met the three characters who play the largest roles--Frank (Denzel Washington), Will (Chris Pine), and Connie (Rosario Dawson). What you do not realize from the trailer is that these characters are fillers, they are superfluous--they are not even credited with having last names! (When was the last time that happened to leading characters in a November release?) The real star of the show is the TENSION, which is simple and doesn't pretend to have any kind of outrageous complexity to it, which also makes it feel much more real.\"Unstoppable\" is succinct, and that is also the real beauty and what people will no doubt dislike about the film. The film quite literally starts off ("
    },
    {
      "rating": "8",
      "text": "Good movie!! The movie does take a bit to get up to speed, like the train, but then it takes off.  I really enjoyed the visual ride of this film.  The camera technique emphasizes the feeling of movement and speed and adds to the feeling of tension.  The acting is solid and well-done, a pleasure to watch.  Glad I saw it and will be recommending it to friends who watch more than girly movies."
    },
    {
      "rating": "8",
      "text": "As a slam-bang exciting film, this is great.  But anyone familiar with railroads will notice many errors. Just a few:  the engineer of No. 1206 states that it has 5000 HP.  But it is an SD-40, 3000 HP.  A central figure is described as a\" Yardmaster\", yet she appears to control the entire subdivision.  Only a Superintendent or Trainmaster would have that responsibility, especially in an emergency.  A minor sub-plot, that the engineer has been involuntarily retired with \"half benefits\" is blatantly illegal and simply does not happen under modern law.  Speed-limit signs (visible on a bridge) are not in use on any railroad--they seem to be like highway signs. Anyhow, see it (8.5)!!"
    },
    {
      "rating": "9",
      "text": "Well acted, highly entertaining, intense and well shot.  Better dialogue and character development than one typically expects from the genre.  Best action movie I've seen in a long time.  The personification of the train as antagonist reminded me of \"Duel\" and \"Backdraft\" - very hard to do but very cool when it works!"
    },
    {
      "rating": "8",
      "text": "From the same director who brought you \"The Taking of Pelham 123\" last year, his next train oriented thriller stays on track (pun intended). The script, above anything in the film, was well written. The audience knows what is going to happen, why not make it the most interesting from the audiences predictions? Tony Scott knows how to make a thriller, and leave out any extra cargo (pun intended). From edge of your seat thrills, to a story that's not as corny as Hollywood usually makes it, puts \"Unstoppable\" as one of the highlight action films of 2010."
    },
    {
      "rating": "8",
      "text": "The acting is near perfect, and the film has an uncanny ability to suck you in and downright entertain. Unlike other thrillers, it's very unpredictable maybe because not many people are like this one. Despite some semi-noticeable gaps in plausibility, or maybe it's me being an analytical college student, this move is scarily realistic. Definitely a worthwhile $10."
    },
    {
      "rating": "7",
      "text": "well, this really surprised me. i wasn't expecting to see a good film with it's cheesy name but it sure gave me entertainment for a hour and a half..but Denzel should not act in such movies any more. he can do better than this. for sure!"
    },
    {
      "rating": "9",
      "text": "I thoroughly enjoyed this film.  Although the SNL spoof of the trailer was hilarious, the actual movie was very gripping and suspenseful.  This is not to say that it was a perfect movie, but it was very good in general.  Definitely should see it if you're into action, but not gory, films."
    },
    {
      "rating": "8",
      "text": "This movie was incredibly dumb, but was great fun all the same. Denzel Washington is wonderful as always and Chris Pine not bad himself. Rosario Dawson was great as well. This movie was truely nothing special, but it had some awesome visuals and action scenes. If you're looking for a good action flick go see this movie."
    },
    {
      "rating": "8",
      "text": "The film lacks a certain amount of emotion, and maybe that's because it's so harsh (especially around the middle of the picture), but it sure does satisfy. Unstoppable is funny when it wants to be, has a great attention to detail and old-school, edge-of-your-seat action. Chris Pine and Denzel Washington shine as a duo. Due to the great cinematography and sound (not Academy Award worthy, however), the audience gets the feel of the immense power of the train which provides consistency throughout the film. Overall, this movie brings back the classic intensity and fun that brings back memories of 'Speed' with Keanu Reeves."
    },
    {
      "rating": "7",
      "text": "The movie is nice... It's a TV movie and nothing else. Denzel Washington was nice but not great. It's good that the story is true and that the actors are known, but the film is only OK."
    },
    {
      "rating": "7",
      "text": "A film about a runaway train based on a true story and laden with over produced cliches at every turn? That certainly is an accurate description of this piece of Scott hokum. What it fails to mention is the genius casting of Pine and Washington in the central roles. The genius of their pairing sneaks up on you and by the mid way point you find yourself thoroughly invested in the events that unfold. What should be a pointless film turns out to be possibly the years most entertaining. This is one train nobody should miss."
    },
    {
      "rating": "7",
      "text": "Denzel again! Tony Scott again! And Train again? Tony Scott (Director) must be so curious about thiz Train thing. Just last year, Scott urged Denzel Washington into the train robbery for THE TAKING OF PELHAM 1 2 3, with John Travolta. Now, he brought up a true event in 2001, when unmanned raging train that carrying tons of toxic chemical sliding wildly out of control without air brake and it is totally unstoppable. I have to say, thiz movie is in a very good story-telling. It reminds me of how old-time action movies pump up our adrenaline where the event is occurring only in a few hours long, like in: DIE HARD (1988) or SPEED (1994). Tony Scott who is the brother of Ridley Scott (also Director) always knows how to make a precise recipe of good Action Movies. If you want to search for drama, Ridley is the man. But if you want to experience some good actions, you find Tony, like what he did in TOP GUN (1986) and my favorite TRUE ROMANCE (1993). It starts slow with problematic introduction, and then, as the Train goes faster, the tension goes greater as well. Scott pins down a suitable direction for each of its technical aspects. The sounds are so rich and realistic, you can actually feel the threaten train is chugging and rushing in front of your seat. And the hand -shake camera simply drags you into the center of situation, and forces you to think along how to solve the complication. The camera work and movement is really effective and outstanding. In the same direction, all Casts are in good shape. Everyone can deliver a believable working-class presentation. The costume and make-up support that completely.  It seems to me, it is a piece of cake for Denzel, to merge into thiz kind of movie. And our Star Trek new Capt. Kirk, Chris Pine can eventually bring balance into their interaction. Rosario Dawson also shows significant existence of her supporting role. Maybe the story has been exaggerated and dramatized to make it more interesting. Like it or not, Scott has created one great vessel of effective high-octane action with his own way. Like on the movie, the train company executive once said, It is my train! It is my decision!\r Visit My Blog on JONNY'S MOVEE: http://jonnyfendi.blogspot.com"
    },
    {
      "rating": "8",
      "text": "I was surprised that this film was actually good. The first 5 or 10 minutes for me was pretty boring but the rest was really awesome. The acting of the most characters were really good (the acting of the daughters and Darcy wasn't that good). This is probably the best train-disaster film in recent years. The film made me believe that the characters were real (yeah only the unmanned train part of the film is based on a true story). This film is really interesting and awesome."
    },
    {
      "rating": "7",
      "text": "Well... this is, as many said before, and the end is already known. I mean, are you thinking a gore film with Delzel Washington? Come on! Anyway it started as it were ending, because it was predictable more than unstoppable but the characters are good enough to catch you in there own past and lives... maybe it was kinda forced in somehow... but I cannot say it was bad... then I only though the train was gonna lose one track and that's was all... but the curve part impressed me, was not predictable in that part... also we can add other few but good characters: The poor old guy who died (I think they didn't want expectators to see just death and death, maybe because the movie was not about death but the risk and the lack of responsability, and if it isn't enough... also the tension of watch such a big monster going that fast with ''chances'' of big disasters in the middle) and the genius sort of cowboy... that guy talking about precission or something else... anyway that was cool! is not the best of Chris Pine or Denzel, but no one can deny it keeps you watching and grabing your seat the whole movie... respectable."
    },
    {
      "rating": "8",
      "text": "Denzel and Scott are always good for an above average action/suspense flick and Unstoppable continues that trend. You can never go wrong with Zel but Scott could a bit more to make his movies better. The drama is good but isn't really built up to make you want things to work out for the protagonists, and so the movie just didn't hit on all cylindars like an instant classic should have been."
    },
    {
      "rating": "7",
      "text": "A decent film at the least.  Unstoppable will keep you from going on restroom, snack, and smoke breaks.  Another worthy movie with Denzel that won't fail to please."
    },
    {
      "rating": "6",
      "text": "I'm sure that many people have watched this movie based solely on its surprisingly high scores on critic aggregate sites, and now I can count myself among their ranks. Of course, my expectations going in were still low enough that there was no real danger of being disappointed. I knew to expect shallow action, and that's exactly what it delivered, with a side of the good old blue collar workers as protagonists/white collar workers as antagonists dynamic thrown in for good measure. There was no more than token interest given to developing the characters, instead pretty much every scene was designed to increase the tension and excitement, and the movie was definitely both tense and exciting as a result. (http://diversionary-tactics.blogspot.com)"
    },
    {
      "rating": "8",
      "text": "I was actually completely taken by surprise with this movie. I went into the theaters expecting this to be boring, as it is a movie about stopping a train. I stand corrected as the acting was superb and the editing kept things fresh and I liked how they gave the perspective of the news, and then the perspective of the people involved. I found it to definitely be worth the price of admission and I would recommend a rental if you have the time!"
    },
    {
      "rating": "7",
      "text": "I wouldn't go so far as to call it a mindless action thriller but it did meet my low expectations. It's a great movie to watch when there's nothing better to do and you're totally bored, other than that not really worth buying the DVD."
    },
    {
      "rating": "9",
      "text": "Aunque ya sabes lo qué vas a ver, te pone los pelos de punta, mantiene la adrenalina activada y una vez más demuestra que las personas normales pueden ser los verdaderos héroes."
    },
    {
      "rating": "7",
      "text": "Unstoppable had one job to do and that is be a thrilling with nail biting intensity and passed that with flying colors. This is the sequel to \"Speed\" that we should've gotten."
    },
    {
      "rating": "8",
      "text": "Featuring some solid acting from Chris Pine and Denzel Washington, \"Unstoppable\" is an almost relentless thrill ride from its humble start to its grand finish."
    },
    {
      "rating": "7",
      "text": "Unstoppable is a popcorn movie deluxe. It moves with a brisk pace thanks to Scott's efficient directing, and features some great acting from Pine and Washington. Yes, it's implausible as hell; yes, there is little character development or even a brain among any of the characters; but the thrills are there."
    },
    {
      "rating": "8",
      "text": "The plot was simple, but it was very tense as we watched to see how things would turn out.  Chris Pine's character kind of seemed like an unstable stalker, but on the plus side, he was dedicated to protecting his town. It was a fun movie! I would recommend it for most people."
    },
    {
      "rating": "7",
      "text": "Unstoppable is unstoppable. Beware... Unstoppable can be stopped due to several flaws from a ridiculous amount of scenes this movie has and it's not pretty at all."
    },
    {
      "rating": "8",
      "text": "A realistic, adrenaline-pumping film made up of normal characters who go through some seriously rapid development. Their relationships brew and cultivate in the crisis they find themselves in. It's nervy, it's compelling and quite simply a very good film."
    },
    {
      "rating": "7",
      "text": "The movie \"Unstoppable\" is a train itself. It frantically speeds up with a powerful pace and a active engine. Its......Unstoppable."
    },
    {
      "rating": "4",
      "text": "Predictable and cheesy acting. Almost feels like a bad 80's movie. The movie, moreover, had it's moments of suspense."
    },
    {
      "rating": "1",
      "text": "How this movie gets an average that pushes it into the green scores from the 'professional' critics makes me question exactly how corrupt they are; more than I thought, apparently.  Swag must be good.I agree with JamesL that \"Denzel has quit acting\".  I hope he gave his salary to charity.  A-listers are responsible for what projects they choose, period.  He's the most powerful person on this project, it's his fault.Stupid movies make everyone stupider, and our eye-holes are chock-full of them since I don't know when.Critics, I hope you soon join politicians and lawyers and wall street pirates as the most despised professionals, 'cause most of you are dirt."
    },
    {
      "rating": "5",
      "text": "Denzel has quit acting and this was a thriller without thrills. There was minimal character development and you knew how it was going to end. I got nothing new out of this film and no sense of satisfaction. I just kept wondering why Denzel keeps taking these easy roles. Isn't that what Nicholas Cage is for?."
    },
    {
      "rating": "9",
      "text": "This is a movie I walked in thinking hey, good actors, good director, and a ok plot. Half way into the film I was like who I am kidding, this is the BEST plot ever. It had way better action scenes than I expected, plus It had amazing acting from Denzel and the young Chris Pine. It will leave you sweating and on the edge of your seat for the whole movie! It was so good I might have to see a second time with my friends."
    },
    {
      "rating": "9",
      "text": "An amazing flick with lots of action and even some comedy. Recommended to everyone, young or old, this is a future legend... it's unstoppable!!!!!!!!!"
    }
  ]
}