{
  "id": 588,
  "title": "Up",
  "starring": [
    "Ed Asner",
    "Christopher Plummer"
  ],
  "runtime": 96,
  "genre": [
    "Animation",
    "Comedy",
    "Family",
    "Adventure"
  ],
  "description": "Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life.",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/mFvoEwSfLqbcWwFsDjQebn9bzFe.jpg",
  "categories": {
    "plot": 9.242424242424242,
    "acting": 5.9375,
    "ending": 6.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 7.555555555555555,
    "funny": 7.962962962962963,
    "action": 9.75
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Charming, emotional, hilarious, just some of the words that can be used to describe Disney/Pixar's Up. The opening of the film is the saddest thing I've ever seen in anything, and that's coming from a family film. Pixar continue to produce the best."
    },
    {
      "rating": "10",
      "text": "A splendid film. I'm 67yrs old and me and the wife took our grandkids to see it earlier tonight and we had a wonderful time. A great film that besides the funny jokes and fast action, actually had a message that my grandkids (4, 6, and 9 yrs old) picked up on while we talked about it over dinner afterwards. At first I thought this would be another one of those nonsensical cartoons like that monsters vs aliens film we took them to a month ago, which was typical bubblegum. Up is a wonderful experience for all of us and I cannot commend the filmmakers enough for creating this feature."
    },
    {
      "rating": "10",
      "text": "This movie is seriously one of pixars best! The story and emotion to it were amazing! If you are a fan of Toy Story, Monsters Inc, or Finding Nemo, you will find this movie amazing! It is MUCH better than Wall-e, Cars, Ratatui, and The Incredibles. PIXAR IS BACK!!! I rank this movie in the top 3 pixars. GO SEE IT! Some people were crying in the movie!"
    },
    {
      "rating": "10",
      "text": "Up was easily one of the most entertaining films I have seen in the past 5 years. I am a 19 year old in the Army and along with my like-aged friends, we all found it to be cute, funny and just a great film. It is easy for people of all ages to find comedy in the film from quick gags to actual adult humor that disney and pixar have a nice way of throwing in. To those that remarked on how the story was a little deep for younger viewers, never once did the film go deeper into sadness than a view scenes left more for the viewer to fill in their own interpretations. My friends and I found Up to be a great film and easily a new Disney classic."
    },
    {
      "rating": "9",
      "text": "breathtaking, frequently hilarious, practically life-affirming."
    },
    {
      "rating": "10",
      "text": "Brilliant film by Pixar- clearly the masters of animation. Must see film of the year- it is unfortunate that we have people rating this film on its 3D capabilities or on the fact that they believe the film was sad- not all films should produce perfect hollywood closure- it is those who cannot appreciate this concept that are truly missing out. i would advise against listening to anyone who compares anything to Monsters Vs Aliens period."
    },
    {
      "rating": "10",
      "text": "Funny and heartwarming. A great movie is always first and last about a great story, the amazing animation just happens to be the vehicle. Fabulous!"
    },
    {
      "rating": "9",
      "text": "While I don't think that it is nearly as humourous as WALL-E or Monsters vs Aliens 3D, I think that this movie is fantastic in it's own right.  The trailers seem to imply that it's another another funny movie in the vein as previous productions, but it isn't  There is humour, but there's far more romanticism than in any recent animated movies.  It's touching, and some of the themes such as promises, loss and family may be lost on a younger (i.e. < 10) crowd, but that doesn't make this a bad movie."
    },
    {
      "rating": "10",
      "text": "Hilarious and Heartwarming. It's Pixars most poignant and human story yet. Loved it!!!"
    },
    {
      "rating": "10",
      "text": "Best movie I've ever seen, ever."
    },
    {
      "rating": "10",
      "text": "Exellent. Touching, funny, and thoroughly entertaining. Great score also."
    },
    {
      "rating": "10",
      "text": "Once again Pixar manages to explore themes that will soar above children's heads. At times moving Pixar manages to tell a story that transcends the genre of animation. One must wonder if children can enjoy such sad stories, yet it begs the question, should we care if children enjoy it, Pixar does not make children's films anymore. Their films speak to the human experience and I would guess are more enjoyable for adults. The film is truly extraordinary in its ability to mesh seemingly incongruous elements, one would not think that all the elements of this movie would fit together, and yet they do. It is a movie that leaves you so completely emotionally satisfied that your only recourse is to see it again."
    },
    {
      "rating": "9",
      "text": "Another triumph for Pixar. A beautiful and romantic tale. Great characters. It was so refreshing to have a elderly hero from a modest station express so much that is wonderful about the human experience. Despite the uplifting vibe, the presence of loss and longing saved the movie from the mediocrity of typical Disney factory drivel. The movie was very funny. The 3D certainly enhanced the experience and was seldom distracting. Despite the PG rating I found it to be appropriate for my 3 year old, who did get a little bored due to the relaxed pacing of the film and a mild cold. After 3 unbelievable home runs with Ratatoille, Wall-E and now UP, I am a little disappointed that Pixar will return next year with Toy Story 3. These are some of the greatest family films made. Every new and original story is a treasure."
    },
    {
      "rating": "10",
      "text": "Fantastic film, very heartfelt and sweet, perfect for children and adults, disney/pixar can no do wrong!"
    },
    {
      "rating": "10",
      "text": "Up was a terrific film through and through. The Story is the show here as the entire cast of characters are so endearing and relatable. It was touching, melancholy, hilarious, and uplifting (no pun intended), all rolled into a sure to be timeless film. The 3D was used in an immersive way which is to show scope and depth, which is refreshing since all 3D movies lately go for the cheap gimmicks of things pointing at you and coming at you at every frame. My entire family loved it. Heck, I thought some themes will sail over my 3 yr old daughter and 5 yr old son's heads, but they were riveted the entire time. We'll definitely be seeing this again. I commend Pixar for being brave and willing to incorporate difficult themes along with fun and happy themes, because that's what life really is."
    },
    {
      "rating": "10",
      "text": "A fantastic movie in every aspect! We as movie-goers should support Pixar for what they are achieving because it is high-quality family entertainment! Highly recommended."
    },
    {
      "rating": "10",
      "text": "Stupendous amazing funny spectacular there was a smile on my face the whole movie."
    },
    {
      "rating": "10",
      "text": "WOW ! I once again bow at you Pixar. The entire family enjoyed it, and my kids really got something about the movie besides the laughs and gags. They talked about taking care of parents/grandparents, spending time with them, how the simple things in life can be just as fun and memorable, and the like. We'll definitely see this again this summer."
    },
    {
      "rating": "10",
      "text": "This movie is not only heartwarming from beginning to end, but you will be wetting your pants throughout with the hilarious jokes sprinkled in. I'll admit that I doubted Pixar when I heard about the off-the-wall plot line, but I will never doubt them again. Pixar has once again proven that they are at the front line of animation development in the modern day."
    },
    {
      "rating": "10",
      "text": "A wonderful movie. A human story that captivates both the young and old. I like how they did not use 3D in a gimmicky way like what was in Monsters v.s. Aliens. The 3D here did not resort to throwing and pointing things at you incessantly. The 3D was utilized more to convey the scope and depth of the mountains, cliffs, and the airborne scenes, so much so it felt like you were up in the air yourself. This was a movie filmed in 3D, not a 3D movie. The story is the star of the film by far, and you'll be wowed whether you see it in 2D or 3D. A magnificent addition to the Pixar library. We can all argue til we are blue about which Pixar is the best (my vote still belongs to Wall-E at this point) .But UP stands alone as Pixars most human story."
    },
    {
      "rating": "10",
      "text": "This is definitely one of Pixar's best animated features.The story is so lovely that one cannot but find one's eyes watering while watching the first 20 minutes of the film and getting to see two people in love living their lives. It is just so moving that one cannot resist falling in love with it immediately.The Academy Award winning score is definitely one of the highlights of the film, due to its ability to give depth to our perception of the scenes and of the film in general.Surely, it is not Wall-E and it does not have such a \"great idea\" behind it as environmentalism and the future of humanity. But, in a way, it does more so: it is about the very basis of humanity - peoples ability to love beyond what is required of them and the realisation of love's importance in our lives. Maybe, after all, it is like Wall-E... or even better so, since through an ordinary person's story it can create a whole new world without having to make much effort. That's greatness."
    },
    {
      "rating": "9",
      "text": "A brilliant, unique movie. One of the best children's movie I watched."
    },
    {
      "rating": "9",
      "text": "Though it is not the best Pixar film (for me, Ratatouille takes that spot), it is still a great movie. I love the fact that this this movie is very diverse, it has comedy moments, dramatic moments, action moments and a lot more. The flow of the story is brilliant, from start to finish, making the plot of the movie clear and understandable. And I appreciate that they make this more of an animation movie (which we all know that these movies are mostly for kids), where adults can relate. Yet again, Pixar has again produced an amazing movie and I am looking forward for more Pixar movies in the future..."
    },
    {
      "rating": "9",
      "text": "Another great Pixar movie that has characters that you can connect with.  Especially Ed Asner's character, you really feel the love he had for his wife and the pain he goes through when she dies.  Also the other characters including Doug the dog and Kevin the snipe make for the fun adventure."
    },
    {
      "rating": "9",
      "text": "Up es una replica a seguir de como hacer y aprovechar una pelicula teniendo en cuenta los sentimientos y valores que hay que dar en este tipo de peliculas, una excelente muestra del amor en todo sentido y una pelicula mas que adorar de entre otras de Pixar"
    },
    {
      "rating": "10",
      "text": "\"Okay, this is it! Everyone said that WALL-E was one of the greatest films of all time, no way can Pixar follow up with something amazing!\"Or so you think. \"Up,\" Pixar's 10th feature film, is truly an amazing film that has a little bit of everything: it's funny, it's exciting, it's emotional, it's sad, it's happy, it's beautifully-animated, wonderfully-written, and superbly-acted. Pixar may no longer be on the same dominant winning streak in 2016 as they were in 2009 (not to say they've been bad. Far from it, in fact), but at least \"Up\" wasn't the film to end the winning streak. If you enjoy quality films, make it a point to watch \"Up\" at some point: you'll thank me later."
    },
    {
      "rating": "10",
      "text": "Touching, hilarious, and really funny, not to mention that the opening part is so sad and heart-warming. This is a film that you need to see. It tells a great love story, has memorable characters, and is nothing but a great adventure."
    },
    {
      "rating": "10",
      "text": "Up is a film that touches your heart emotionally with its great animation, touching story and loveable characters. A must watch for anyone, even the people who don't like animation need to experience this movie."
    },
    {
      "rating": "10",
      "text": "Pixar always makes the best movies that touch us, such as Toy Story, Cars, Finding Nemo, and The Incredibles. This movie made me cry and laugh. Every great movie gives you both. Another outstanding story made by Pixar, about always going for your dreams, the limits are endless for adventure."
    },
    {
      "rating": "1",
      "text": "Completely haphazard plot. Nice characters but a storyline that stems from a derailed brainstorming session."
    },
    {
      "rating": "10",
      "text": "Up truly embodies the spirit of Pixar, or rather the spirit of adventure. What life throws at us is not always expected, and only through the charming characters of Carl and Russell do we truly see what it means to to go on an adventure. There's something ethereal and magical about Up, and even if animation isn't someone's cup of tea, this movie should be.\r \"Paradise Falls, a land lost in time.\" Carl and Ellie have always wanted to visit Paradise Falls but just never got the chance. As we see through an enchanting and heartbreaking montage, it's up to Carl to fulfill this dream on his own. Or with some unexpected companions. The intricate details and complex storylines lead us to realizations throughout, not just about childhood dreams, but about life. This movie can be taken so many different ways, and I think that's really the beauty of it.\r The imagination portrayed throughout is just as if a child dreamed it up. Which they did, several yeares ago. Now, being somewhat older and wiser, it's up to Russell to carry out this role.\r I've watched this movie in theaters, I've watched it in my middle school and high school classrooms. I can't even remember how many times I've seen it. But one thing I can remember is how my feelings towards it have changed. I've always loved it, but the first time I saw it I distinctly remember wincing every time the house and his belongings got hurt and wondering why he let it go at the end. But now, having grown up, it's like Carl and I have both realized the value of experiences and of people over material items. That's a lesson that takes time, and I think also a sign of a good movie. It grows as you do.\r The most substantial relationship we see is that of Carl and Russell. In a way, they support each other and learn to be more caring and more wise. They even share the boring moments together. \"That might sound boring, But I think the boring stuff is the stuff we remember the most.\" That also eases the burden on Carl's shoulder for never actually taking Ellie there to Paradise Falls. The house may almost represent the weight of that unfilled promises, and a series of events eventually lets him let go, knowing that Ellie had her own adventure, and no matter what she's always going to be there with him. Even if our childhood heroes turn out to actually be villains, a dream is important to have."
    },
    {
      "rating": "10",
      "text": "An absolute joy to watch. Up, although harrowing and touching, is also action packed and adventurous. One of, if not the best Pixar film to date. If you haven't seen this, you're definitely missing out."
    },
    {
      "rating": "9",
      "text": "Animation giant Pixar walks into 2009 with their new animation \"Up\". The movie is so organized and amazing, all I could suggest to you is to just shut up and watch the movie."
    },
    {
      "rating": "10",
      "text": "After viewing this film, I found it very well made. It was dark, even by the standards of a mainstream childrens film. It has a serious storyline which deals with a wife unable to bear children and a man who sees his home as if his wife's soul remains there each day. There were comical moments throughout the film which were done well including a sequence in which a dog which speaks through a collar to other dogs speaks in a funny voice, which when fixed sounds like an evil scientist from a 1930's serial. The final thirty minutes are not only action filled, but comical and heartwarming. The characters were well-designed with unique characteristics which added to the enjoyment and allowed for the people viewing the film to connect with the characters. Very-well made film and one of the best Disney films of the first decade of the 21st century..."
    },
    {
      "rating": "9",
      "text": "I cried, I laughed and I am 19....good movie.\r The worst part though was that there was a little sitting in front of me and when it was over she turned to her mother and said \"that movie SUCKED!\" and I was still wiping a tear out of my eye while chuckling"
    },
    {
      "rating": "8",
      "text": "hilariously uplifting adventure"
    },
    {
      "rating": "10",
      "text": "It's a true adventure made by Pixar. I love Dug so much from the movie and it'll be as exciting as you wanted it to be and it'll be an adventure in progress."
    },
    {
      "rating": "6",
      "text": "Up isn't a very funny movie, don't get me wrong it has it's funny moments, but I don't believe they were trying to go for the funniest movie out there, they try to get emotion in there, and for the most part they succeeded, it's nice to see a movie for kids that tries to teach them something, but it could have been more interesting, it can get pretty boring at certain points, but this is a movie I can recommend, just don't expect a comedy that will keep you laughing through the entire time."
    },
    {
      "rating": "5",
      "text": "The opening of this movie is amazing, and one of the strongest things Pixar has ever done.\r The rest of the movie is not nearly as good. There's a few good moments in there, but frankly, it never recaptures the magic of the start for more than a few moments, and a lot of it is just kind of lackluster."
    },
    {
      "rating": "10",
      "text": "Pixar at it's finest, showing that an animated film doesn't have to rely only on humour but also can be quite emotional. Within the first 10 minutes of the movie you automatically feel for the main character and become emotionally involved in the film, that alone got me really impressed, Great animation backed up with great characters ( as any dog owner would agree ) , very funny movie that also pulls at your heart strings. A Must see.. A classic."
    },
    {
      "rating": "9",
      "text": "Wonderful animation with powerful charm. Deserves 100% this high score, both by critics and users. You won't regret watching it and probably would want to watch it again."
    },
    {
      "rating": "10",
      "text": "Up was PIXAR's masterpiece. I mean this movie was absolutely perfect. The characters were hilarious and you could relate to them very well. Doug the dog was the best comic relief ever in an animated film. The plot was extremely original it's not funny. That doesn't mean the movie's not humorous though. It's freaking hilarious and it's also possibly the best movie I've ever seen. The overall movie is 11/10 and it is just - GORGEOUS!\r The movie definitely proves \"Adventure is out there!\" Well there definitely is. Also this movie is also the first I cried while watching. The first 5 minutes and the bit where Carl is flicking through Ellie's photo album/adventure book. PIXAR has done it again and they're still yet to make a dud. Cars was the closest thing to a dud. Up is so much better than any other animated movie this year. Coraline is pretty damn close to Up and so is Mary and Max. Anyone hear heard of Harvie Krumpet? Well Mary and Max was made by the same guy. Up is the animated king of 2009."
    },
    {
      "rating": "5",
      "text": "After one of the best takeoffs I ever seen, the movie goes straight to hell in an incomprehensible series of scenes in the middle of nowhere with an incredible (even for an animated film) agile old old man, jumping up and down all over the place, and a hero that went mad."
    },
    {
      "rating": "10",
      "text": "Tells one of the greatest love stories in cinematic history in a brisk eight minutes. That, as is the film itself, is a wonderful, awe aspiring work of genius."
    },
    {
      "rating": "5",
      "text": "After the first 20 minutes or so, the film just falls apart. Enjoy the beautiful beginning because its really the only noteworthy part of this very overrated spectacle. I don't understand why animated films don't need to follow the same common guidelines to making good entertainment other films, but apparently they do. Definitely not Pixar's best."
    },
    {
      "rating": "0",
      "text": "This could arguably be Pixars greatest work, the first five minutes is without a doubt the greatest opening in cinema, getting all emotional scenes from evry film in history and putting them into one beautifully told and stunning scenes. If the film had lived up to this it would un deniably be in the top 10 greatest films in history, but it turns into adventure that is so admirable. Pixar again creates gorgeous visuals and a setting that is truly stunning, its charming and funny throughout. Performances are top notch and laughs are real laugh out loud ones, its every thing you could hope for in a film in one. The storytelling is stunning, creating morals, excitement and is very emotional at places. The film does not try to be this forced emotion present in most films, but is just there and is some of the most emotional scenes in film history. Undeniably good, the film needs to be watched to be understoof how the snese of adventure, memories, emotion and simply letting go create one of the greatest films ever. But what did you expect from Pixar?"
    },
    {
      "rating": "4",
      "text": "Although the movie technically is beautifully made, and there are some really funny scenes, I didn't like it at all. It left me with a kind of cold, uneasy feeling. Not a film I'd like to see a second time."
    },
    {
      "rating": "0",
      "text": "This movie was terrible from beginning to end you might like it if you were 1 years old i mean every was in the movie theater was booing and throwing popcorn."
    },
    {
      "rating": "3",
      "text": "Perhaps if I had had a seven year old with me, I could have watched HIM enjoy UP The DOGS were nice, however."
    },
    {
      "rating": "4",
      "text": "I feel as though I watched a different movie as everyone else in the theater. \"Up\" is kind of a ludicrous tale, one that I simply could not get into, and I never felt a connection with ANY of the characters. This does not even come close to movies like Wall-E, which are visually stunning and far out there... in a good way. I cannot possibly recommend this movie to anyone, as it was forgettable even to my son."
    }
  ]
}