{
  "id": 3848,
  "title": "Up in the Air",
  "starring": [
    "George Clooney",
    "Vera Farmiga"
  ],
  "runtime": 110,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "Corporate downsizing expert Ryan Bingham spends his life in planes, airports, and hotels, but just as he’s about to reach a milestone of ten million frequent flyer miles, he meets a woman who causes him to rethink his transient life.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wZRNEkDxVDNNVaCPN7jKziMHmk5.jpg",
  "categories": {
    "plot": 5.25,
    "acting": 4.696969696969697,
    "ending": 5.75,
    "soundtrack": 0.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 8.6,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "One of my favorite films ever, is amazing, incedible, emotive. And the better... the cast, Anna Kendrick, Vera Farmiga, George Clooney, are amazing. The story can be sad, but the film is fantastic. Up in the Air is a classic."
    },
    {
      "rating": "9",
      "text": "A great movie of a solitary life. Everything in this movie makes me sad and I find it beautiful. George Clooney is back again and he is amazing. The writing is sharp and witty with a fun story about what it's like in the modern society."
    },
    {
      "rating": "8",
      "text": "I loved this movie. Ryan's character is so much like myself. That's not the reason I love it, it's just a very well-put together film. =)"
    },
    {
      "rating": "8",
      "text": "A really entertaining, good film that definitely make you wonder about the American lifestyle and how good and rewarding (or unrewarding) it actually is. With great direction, screenplay and some really good performances, \"Up in the Air\" manages to make one laugh as well as feel the desperation of Clooney's character. Definitely a film worth watching!"
    },
    {
      "rating": "9",
      "text": "Jason Reitman's tale of corporate downsizing is bound to strike a chord with moviegoers in our modern recession and was released at the perfect time. However, unlike most topical films, which tend to slide into obscurity after their time in the limelight, I feel 'Up in the Air' will be remembered as a timeless classic which can really reach out to anyone. All three leads (George Clooney, Vera Farmiga and Anna Kendrick) are breathtaking in their character roles, each carrying a sense of enigma affixed with their own goals and expectations for love and life, and as always each is compromised along the way. The relationship between Clooney and Farmiga has incredible chemistry, and Kendrick's conjunction of professionalism and idealism was handled perfectly (I smell Oscars here....) Though most of the dialogue is infused with the quick wit you can always expect from Reitman films, this movie is really one of the most devastating and heavy films of the year. It perfectly embodies the journey of middle-age angst just as 'Juno' represented the indifference of smart-ass teenagers, but like 'Juno', it may appeal more to the age group it is depicting."
    },
    {
      "rating": "10",
      "text": "Sorry for the traslation, is mechanical.\r Sense of belonging.\r There is a man who can rightfully share the record with the eagle winged space. This man is accustomed to \"take flight\". What can it mean, \"take flight\".  Travel with your mind? Going straight down the stairs? Seek freedom? Or ... escape, disappear, vanish? Or maybe, and why not, a call to the enterprise? I try to proceed in an orderly and point my eye, but not random gossip on a man. This man, able to defend themselves from the threat of a nature that loves to challenge those who dream and strives to make real and concrete objects of their desire, is ready for anything. Throughout his life, sooner or later happen to face painful events. The death of a loved one, our dog, a love story ended, a financial investment bankruptcy, dismissal. Mr. Ryan is interested in layoffs. The dismissal, for the sufferer, it can cause serious, serious mental disorders. The pain caused by it, can turn into anxiety, existential closure too often, the next step and \"extreme\" is suicide. All these \"inner beatings, mental\" can be turned into disruptive forces in new psychic energy, in increasing self-esteem, desire to relive. Ryan Bingham (G. Clooney) offers his skills to those companies that have to lay off people. Travels the skies of the U.S.A. far and wide. Thousands talks \"motivational\" making, not to mention those covered. The plane is his first house and this house is tastefully furnished and mentally occupied with pleasure. His travels take place in a frequent flyer program of American Airlines. Its status is excellent. The goal is that at heart is to reach ten million miles. Incredible ten million miles. Many people who meet during the various movements. One of them, Alex (Vera Farmiga), fascinates him, trapping him, his travels thus become a bit 'less instrumental and a bit' more human. A relationship develops between the two. Third stage entrance. A young graduate, Natalie Keener (Anna Kendric) is supporting so vehemently, a project that allows her dismissal \"from the ground\" in the sense that, the unfortunate party, sitting in front of the monitor gets the sack over the internet. Ryan is forced to return home. Witnessing a demonstration and exposes all its perplexities. Miss Natalie claims that did not mind that this type of profession needs a \"human linguistic semantics\" and not \"computerized management of human feelings.\" But you know, when you can save millions of dollars at the expense of the mental health ... do not think twice. Indeed, we do not think so. Ryan suggests to his boss to entrust Natalie, so will the \"field\" whether his theories deserve to be reviewed. Begins with Natalie unprecedented adventure, learn the rhythms and techniques of flight, initial approaches are not happy. The novel taste flyer on his body the marks they leave the informal words, without the bon-ton human relationships. The boyfriend download by SMS. I stop here to not remove the viewer the pleasure of discovery. ... The plot is nice and full bodied. Love, economic welfare, psychological and physical discomfort, maturity and youth, experience and novitiate, certainties and uncertainties, isolation and companionship, joy and sadness there is something for everyone. These themes are presented with such elegance and sobriety. Almost in a whisper. When you reach a goal achieved with sacrifice \"flights\" growing up.  Whether this objective tell you that you have reached when you are \"on\" How do you feel?  Ryan feels like the end of his journey? For miles routes, will add a few meters? Ulysses was a flyer, in a sense, returned to Ithaca, he finds his wife and son. Throughout his travels, he has never forgotten the ultimate goal. The return home. His house, his suffering, emotional stability. See, in conclusion, what he left. Its origins. Even Ryan there are traces of Odysseus. I think.\r Welcome aboard and good trip."
    },
    {
      "rating": "8",
      "text": "Generally funny, and heartwarming. Up in the Air proves to be Jason Reitman's best since Juno. George Clooney is brilliant as the cut-throat businessman being grounded by his company, while his co-stars Farmiga and Kendrick are also outstanding. The story was definitely interesting and proves to be one of the best films of last year."
    },
    {
      "rating": "10",
      "text": "Great movie. I was really pulling for Clooney to win the Oscar but I guess Jeff Bridges finally deserved one. I was pleasantly surprised by Anna Kendrick's performance. I had no idea that anyone from Twilight could actually act but she did a great job. In a way this was a very sad but real movie."
    },
    {
      "rating": "8",
      "text": "One of the best new movies I've seen in a long time. It met all my expectations. With the charm and comedic sensibilities of Broadcast News, the brutal realism of Glengarry Glen Ross and the humanity of Planes, Trains and Automobiles, this movie is a must-see."
    },
    {
      "rating": "1",
      "text": "How is this movie so well liked? George Clooney and Vera Farmiga's characters are just completey unlikable and the story almost literally goes nowhere. The most interesting character was Zach Galifianakis' character who appears for less then a minute."
    },
    {
      "rating": "8",
      "text": "While not a perfect movie, Up in the Air truly left me breathless. The story of transition and isolation and facing your fears and finding a place in the world, and then the little barb of maybe it won't work out, culminates beautifully in a message about being yourself even in the uncertain times. Anxiety about the future also features prominently, and every moment from the first shot to the closing credits seeps with this theme. Jason Reitman and Sheldon Turner's script is far and away the best aspect of this movie.George Clooney's performance is spectacular. He is all at once charming, unflappable, sardonic, and helplessly vulnerable. Anna Kendrick and Vera Farmiga are fantastic, and a perfect supporting cast. The direction is solid, and the soundtrack, while subtle, is beautifully emotional. I don't know if everyone will appreciate this film as much as I did, but I can't recommend this quirky seriocomedy enough."
    },
    {
      "rating": "8",
      "text": "What \"Up in the Air\" wants us to do is not to watch in boredom equipped with popcorn, but to understand the emotion and the characters the movie has to present to us."
    },
    {
      "rating": "4",
      "text": "If you want to see 'George Clooney' play 'George Clooney' then good for you, you'll love this! If you don't want to feel like an unsophisticated plebian while watching these 2 incredibly smug people seeing who has the best comeback I'd recommend a pass, watch Lost in Translation instead, it's much better. Also the feel of this film is like pretentious wannabee Oscar material. in fact pretentious basically sums this movie up. For Smug, high Class idiots really."
    },
    {
      "rating": "4",
      "text": "Seriously? This movie was humorous and all, but the ending was really stupid, I mean, Ryan finally finds a woman, but then it turns out that she was married w/ children?! That's just sad. I was disappointed that I spent, like, 5 dollars on this on VOD on Buckeye, and it sucked! Don't see this movie if you haven't yet..."
    },
    {
      "rating": "3",
      "text": "Am I the only one who was restless (bored) by this movie? Clooney saved it-just barely-and even he was getting on my nerves."
    },
    {
      "rating": "3",
      "text": "Up In The Air should not be up for Best Picture. An exceptional performance from Clooney can't save a pretentious, overreaching and ultimately elusive screenplay on the modern condition that ends up being as cold and removed as it's protagonist(antagonist depending on how you view it.) One of the worst feelings a moviegoer can experience is the feeling of uncomfortablity and uneasiness with what you're watching unfold onscreen. This movie can be likened to that. It made me feel ashamed of myself and I felt kind of cheapened afterwards. I wanted to get up and out of the theater. Not a pleasant viewing experience by any stretch of ... See Morethe imagination and apparently not by any stretch of the director's imagination, either. It ended up glorifying and at the same time vilifying what it created. I knew I was going to have problems when Mr. Clooney exchanges rapid fire, ultra hip modernist technolouge with Ms. Fermiga about all the different kinds of credit cards they have and use. It felt like foreign language too me. And this was supposed to be a scene showing off the sexy chemistry and banter between the lead male and supporting female costar. Give me a break. Basically, the movie is a generic modern romantic dramedy souped up for disguise with a \"bigger\" or \"deeper\" message about capitalism and corporate robots and alienation in the digital age etc etc that gets lost somewhere in the clouds, or, perhaps in the screenplay that dragged me kicking and screaming into its final half hour ( all the while I was praying silently for some genuine heartfelt flimmaking) to some vapid moral swamp where youre supposed to feel cosy at a film that exploits rather than empathizes with all the people whose lives have been ruined by the economy. Miraculous character turnaround aside, Clooney's performance is genuine, heartfelt and exceptional for what it's worth. No matter where this movie takes his character, I always felt he was trying to be believable. It isnt his fault, it's the screenplay. He is the best thing about this strange and unsatisfying film. But didnt you know that it's all about wholesome values like real connections with family, friends, love and smug little voice over narration? Please dont insult my feelings or intelligence Mr. Reitman. I'll let you get away with Juno because that's about a smarmy teenage girl with a heart of gold. But with Up In The Air, I dont know what's worse, that it wasnt honest with its characters, or that it wasnt honest with us, the audience?"
    },
    {
      "rating": "0",
      "text": "Can't believe I wasted $11.75 on this steaming pile of garbage. Clooney doesn't so much act as play himself at his most annoyingly charming. The young woman who plays his co-worker is also terrible, her performance reminiscent of a college theater production. The characters are not believable at all. The 'plot' such as it is, is boring, predictable, and childishly sentimental. If you found this film moving or meaningful, I feeI sorry for you. I could go on but you get the idea. Wish I had paid attention to the user reviews over the critics on this one. If you are a gullible moron who loves, Clooney, you might enjoy this film."
    },
    {
      "rating": "0",
      "text": "I would like to address the comment by Jason M. What does he mean that some critics aren't bought and paid for and then says some are? Which is it? I saw this movie with 3 other couples and everyone hated it. It was depressing with awful casting. George Clooney is so overated by the liberal critics that they kiss his keester no matter what he does. If a movie about flight miles, time management, and being needed to fire people you don't know is your cup of tea then go watch this moss growing on a rock. And for two mismatched people one handsome and the other a bow wow having an affair it was as ludicrous as the dog giving him her home address. This movie was a total contradiction to the first 2 acts and disintergrates before your very eyes. All you need do is look at the box office revenue to know that this drek is being panned by the movie going public. You have been warned."
    },
    {
      "rating": "2",
      "text": "I don't understand why so many people I have talked to have really enjoyed this movie. Besides the lack of insight and any real felt moments, it makes me question how our society is eroding into this obvious \"Real World\" fake unmoving robot. With all the thematic epiphanies that one enjoys seeking and later pondering on any good thought out movie, well, this had none. Too obvious and also completely void of sympathy or empathy with the main characters, it left me far more angry and removed. True, there are 1 percent that hold 95 percent of the wealth currently in our country, but they are too busy currently covering up financial corporate scandals. How can I be empathetic with someone like this? A classic story but too far a divide for me to feel comfortable even considering. I can let go of my suitcase handle in a much bigger way and hope, pray, that they remove this movie from consideration of best film. What? Because all these worthless remakes and garbage like Knocked Up comes out and this movie has a life message it's supposed to be good? Current? For whom? Why don't we show we this to all the General Motor Workers? A moment for Cher in Clueless who pinned it right \" I don't think so...\"."
    },
    {
      "rating": "6",
      "text": "This movie is way overrated. It was sort of fun to watch, had some clever bits of dialogue, but is in no way as good as the critics make it out to be. It is very superficial."
    },
    {
      "rating": "0",
      "text": "Critically acclaimed by the bought and paid for professional critics. Universally panned by the movie going public. Depressing and nonbelievable. The casting is awful. And the movie disintergrates in the third act. Avoid."
    },
    {
      "rating": "2",
      "text": "A two-minute scene featuring the great J.K. Simmons is all the character depth you are going to find in this one. The rest is about as enjoyable as being cramped in coach with whiny people you cannot stand. It never even got off the ground. I was not expecting greatness from it, but I was not expecting it to be an abomination either."
    },
    {
      "rating": "1",
      "text": "An unreal plot, full of holes in its logic. I saw it with 5 other people and all agreed that apart from George Clooney's charisma it has NOTHING going for it!"
    },
    {
      "rating": "0",
      "text": "WORST MOVIE EVER MADE (next to The Godfather and Angels in America) JUST horrible, depressing, stupid, George Clooney, Anna Kendrick was SOOO ANNOYING! \"wah!wah!\" i almost did that crying scene that Anna Kendrick did when the movie was over! RAZZIE AWARD WINNER IN MY OPIONION way overrated!"
    },
    {
      "rating": "5",
      "text": "The casting was poorly chosen, moments that were too contrived, which ultimately ruined the film."
    },
    {
      "rating": "3",
      "text": "Sappy. Some laughs. Too much of cute smiles, two pretty/handsome leads showing teeth, dimples, raised eyebrows, practiced, hip expressions. Too clever, by half. All story, no worthwhile plot. Got better at the end."
    },
    {
      "rating": "3",
      "text": "If you haven"
    },
    {
      "rating": "3",
      "text": "Has nothing that impressed me,...from the anticlimatic acting from Clooney to a storyline that never seems to go anywhere. It was all pointless."
    },
    {
      "rating": "5",
      "text": "Overrated and overhyped. If some people trash the room when they get fired, what will they do when they get fired over the internet? Why wouldn't they just trash computer? No many laughs, either. I"
    },
    {
      "rating": "3",
      "text": "Character development?"
    },
    {
      "rating": "5",
      "text": "Overhyped and overrated. Ultimately a conservative, sententious piece, which is a pity as it didn't start out that way. Clooney's casting, which seemed masterful given his real life rejection of moral 'essentials' like marriage, in the end became jarringly contradictory. Imagine Charlie Sheen playing the Pope, or Amy Winehouse playing Anne Frank. The shallowist 'deep' film I've seen."
    },
    {
      "rating": "0",
      "text": "Couldn't wait to see this highly praised movie. About 30 minutes into the film I knew I had been had. Just awful with characters that you hate, poor dialogue, and a movie that meanders nowhere. So depressing in this economy and to be released at Christmas? What were they thinking. Word of mouth will doom this terrible work."
    },
    {
      "rating": "3",
      "text": "Ho Ho Ho go see the wonderful movie about firing people for a living just in time for the holiday. Clooney plays an out of touch pathetic loser more interested in flight miles and maximizing his time than people. And then he lets his guard down and gets his just dessert. Awful!"
    },
    {
      "rating": "3",
      "text": "Terrible. I thought maybe this was going to be a satire. Unfortunately I stayed until the depressing end."
    },
    {
      "rating": "5",
      "text": "It was a well done movie, but I was bored in the middle of it, so I've left. I watched the other half few days later so. I don't know. It didn't keep my attention. I wouldn't say it was predictable. I thought that George and Vera's character will hook up and get married but it wasn't so. I also like Anna's character and that's all. All together, it was boring. Fans of George Clooney are gonna love it."
    },
    {
      "rating": "10",
      "text": "This is one of my favorite movies.  George Clooney is an amazing actor, and should have gotten the Oscar.  In fact, this movie should have gotten the Oscar over the Hurt Locker.  It's such a beautiful look into what love and relationships are, without taking a side either way."
    },
    {
      "rating": "10",
      "text": "The best part of Up in the Air isn't the excellent performances or even the pitch-perfect script, it's how real the movie is, and that comes from Reitman's careful direction."
    },
    {
      "rating": "8",
      "text": "This film was entertaining - it kept me completely engaged until the end, BUT... I was so disappointed by the ending. It felt as though the film was viewed by a 'test audience' and the George Clooney character was required to suffer for disconnected lifestyle and thus became cliche. For me, it was a shame that the mid American character had to become -well... so stereotypically mid-American."
    },
    {
      "rating": "6",
      "text": "Film is going well until Detroit. Then it deflates into cheap propaganda. The 'existential' ending makes no sense. Nothing gained from watching this. Ryan is who we thought he was!"
    },
    {
      "rating": "5",
      "text": "The critics hype is disproportional to the substance. The Users have this one pegged!"
    },
    {
      "rating": "9",
      "text": "Relatively few films capture the zeitgeist of an age, or even a brief moment in time. This film does. There is an existential doubt, a grim nihilism floating in the background, as well as a hope for better things present throughout this film. How many films achieve that? Hardly any. Fantastic film that has incredible depth below the surface. It reminds me of Garden State, but for grown ups. If the film would have worked out perfectly, or happy, then it would have sucked. The fact that things are left messy, disordered, yet still hope remains for something in the future...that alone makes this a fantastic film. I don't give a flying crap about awards, or even mentioning if the actors did an amazing job...actors get paid to act...that IS their job. The question is: does the film capture something special. Answer: Yes, this film captures much that is NOW."
    },
    {
      "rating": "7",
      "text": "George Clooney, thanks to an absence of his frequent irritatingly cutesy charm, gives as good a performance as he did in \"The Perfect Storm.\" With considerable help from Vera Farmiga and Anna Hendrik, this turns out to be one of 2009's better films.'"
    },
    {
      "rating": "0",
      "text": "No movie I've seen in the last year has more infuriated me than this boring, bourgeois fluff-piece about Ivy League Grinches having their poor little hearts suddenly grow three sizes and just BURST out their chests. It tells the unremittingly boring tale of a mostly despicable guy who has a despicable and confused affair with an equally confused and despicably adulterous woman, an affair rife with despicably vacuous, wannabe suave banter. In the course of carrying out his despicable job working alongside and for other despicable people firing other despicable people who just can't FATHOM how to pick up the pieces of their lives after losing out on all the sweet Grand Cherokee-filled promise of their entitled, upper middle class 60-90+k salaries. And Anna Kendrick's performance is most offensive of all. Not a shred of authentic type-A female humanity in her performance, a truly disgustingly low-quality acting performance. People who think Anna Kendrick is worth her salt IN THE LEAST in this performance HORRIFY me. I was APPALLED to see that she was nominated for a Golden Globe for this. Was nobody else moved to vomit by her ridiculously phony parody of an emotional breakdown in the airport with Clooney? Pure broadway bull. All I can imagine on this score is that aging people with ink to spill have ATROCIOUS taste in young actors. And that ridiculous hip hop concert scene with everyone dancing? Yeah, that would have already been a cheesy, condescending appeal to a younger generation back in like 1997. . .it's 2010, you freaking troglodytic wannabe pop-cultural savants. I CAN NOT BELIEVE the praise with which this tripe has been lavished. . .although I CAN imagine that the FILM CRITICS of the world would just ADORE a meditation on a soulless, promiscuously single middle aged man's anomic descent into an emotional isolation of his own creation until at last. . .he has become so estranged from his baby sister that she asks their UNCLE to walk her down the aisle instead of her big brother GEORGE CLOONEY! Can you just IMAGINE?! (who, incidentally, I deeply respect and love in almost everything. I also enjoy Jason Bateman and Danny McBride. I decided the three of them must have lost some bet to get dragged into this unmitigatedly stupid, shlocky and downright sociologically reprehensible movie whose almost boundless crappiness is keenly augmented by a soundtrack straight out of the eighth circle of hell) And for those who think this total piece of crap is somehow \"uplifting\" or \"deeply relevant in light of recent economic blah blah blah\", I rebut that the over-arching \"oh, our poor down economy\" theme smacks revoltingly of noblesse oblige. You know who this \"down economy\" has hit particularly hard? People who worked for LEHMAN BROTHERS and other types who watch tickers and used to read the Wall Street Journal before they started using it as toilet paper last year because they aren't QUITE SO RICH ANYMORE, you bunch of stupids. You get away with this as a special interest-sponsored Special Presentation on Watching Your Dollar TV on the freaking MONEY Channel. This movie can bite me. Critics of America, your response to this piece of trash means class warfare. You're on."
    },
    {
      "rating": "6",
      "text": "Good acting and dialogues make up for the airy plot that's a bit bumpy once it hit the ground that's not the airports. The ending is rather nice but feels tacked on."
    },
    {
      "rating": "10",
      "text": "This is an adult movie, watching the pains and seductions of now without blinking. It's a romance, a comedy and a tragedy, on point at every moment. The concept is straight out of the existential mindset: life is absurd, and its absence of coherence and reliable meaning is a void at the edge of even the most upbeat moment. We see the stark, documentary-style suffering of people suddenly fired and cut loose from their moorings for no good reason, intercut with scenes of delight in the mating ritual of practiced pleasure seekers, circled by everybody's inescapable isolation and amplified by a young woman's confusion at the unspooling of values in these modern times. Contrasts: The writing is witty in the telling of somber events; penetrating observation is conveyed in the idiom of farce; an ugly business is packaged as a nimble growth industry. Clooney's acting is spotless and his luminous leading lady stays with him step for step like Ginger Rogers with Fred Astaire. The nerdy young woman who accompanies them is a full equal partner. This is sociology, philosophy and entertainment wrapped tightly together in a package you don't want to let go of."
    },
    {
      "rating": "7",
      "text": "Clooney does his role well, very well, in this enjoyable mature movie. It"
    },
    {
      "rating": "9",
      "text": "im a single man and a lot of the time at my job i have to break the bad news to clients about stuff that's really beyond my control. Makes me feel like the meat in the sandwich. looking at Clooney in this movie, it was like i was looking at myself."
    },
    {
      "rating": "10",
      "text": "\"Up in the Air\" is a nuanced, grown-up romantic comedy that is firmly rooted in the what-is, not the make-believe. Anyone who has spent any time in an airport lounge, dined on rubber steaks in hotel restaurants, crashed another company's pep rally party, charged a cable movie to an expense account, kept a suitcase on the living room floor and not in the closet or been downsized will get it. George Clooney gives a superb and subtle performance that is certain to be overlooked by those handing out awards. Mark J."
    },
    {
      "rating": "9",
      "text": "Laugh-out-loud funny in places, good playing from the leads, gorgeous formailty in the photography, witty script, human characters, with an ending that, whilst a bit fuzzy, does not draw obvious conclusions. Some here obviously missed the point that 'traditional values' are no more preferable than 'modern life.' What matters is not marriage and family life, but 'only connect.'"
    },
    {
      "rating": "9",
      "text": "Up in the Air is a very realistic interpretation of reality. I find that George Clooney's character in this film was one for having an elegant way of life that few dare choose. I thought that the narration and the early part of the film really dragged me into the narrative. The only subtle weakness is that it does drag on a bit but I thought the messages and values that the film presents are quite endearing to the purpose of life."
    }
  ],
  "recommendations": [
    "the_descendants",
    "her",
    "manchester_by_the_sea",
    "collateral_beauty",
    "revolutionary_road",
    "into_the_wild",
    "me_before_you",
    "the_intern",
    "captain_fantastic",
    "blue_valentine",
    "downsizing",
    "greenberg",
    "the_florida_project",
    "promising_young_woman",
    "crash",
    "the_hunt",
    "seeking_a_friend_for_the_end_of_the_world",
    "closer",
    "the_help",
    "hereafter",
    "five_feet_apart",
    "the_pursuit_of_happyness",
    "marriage_story",
    "slumdog_millionaire",
    "the_lobster"
  ]
}