{
  "id": 3013,
  "title": "Upgrade",
  "starring": [
    "Logan Marshall-Green",
    "Betty Gabriel"
  ],
  "runtime": 100,
  "genre": [
    "Action",
    "Thriller",
    "Science Fiction"
  ],
  "description": "A brutal mugging leaves Grey Trace paralyzed in the hospital and his beloved wife dead. A billionaire inventor soon offers Trace a cure — an artificial intelligence implant called STEM that will enhance his body. Now able to walk, Grey finds that he also has superhuman strength and agility — skills he uses to seek revenge against the thugs who destroyed his life.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5f28TXtvHioXirX2n1XH8EJ314v.jpg",
  "categories": {
    "plot": 8.264705882352942,
    "acting": 7.826086956521739,
    "ending": 8.0625,
    "soundtrack": 8.0,
    "cinematography": 8.25,
    "familyFriendly": 3.0,
    "funny": 7.166666666666667,
    "action": 8.03125
  },
  "reviews": [
    {
      "rating": "10",
      "text": "I like smaller budget future movies, this was in the vein of Terminator and Escape From New York.  Not too much cgi, some conventional effects, excellent camera work, good acting and a really good script with some good plot twists. All in all, most fun I've had at a movie in a while."
    },
    {
      "rating": "9",
      "text": "I want to point out, because it might not be obvious from the promotional material, this is a CYBERPUNK action-thriller! And it's a good one, convincingly depicting ghettoes filled with the disgruntled lower class juxtaposed with futuristic tech like automation, holographics, AI, and robotic prosthetics. That last one in particular is an important theme in Upgrade, which should thrill those who've played the newer Deus Ex titles because this movie does it better. It's impressive worldbuilding that makes me want a sequel. The bad part about this movie: It's twisty in ways that are easy to predict, and it's not that deep despite being a convincing world. However it is very fun and worth watching."
    },
    {
      "rating": "9",
      "text": "One of the best low budget movies I have seen for years. Storytelling is tight, effects are limited but great. If you want to see a movie \"with a voice inside your head\" this is much better than Venom.Loved the talking start credits."
    },
    {
      "rating": "7",
      "text": "Upgrade is a refreshing movie with a clear story it wants to tell. The story wasn't to ambitious which resulted in a very streamlined, smooth story, which allowed for sufficient character development. It featured charm as well as competent acting. Not gut wrenching but leaves you satisified with the realistic portrayal of disastifaction of an age where emotions are replaced with technology. I was surprised to find it so original providing the amount of attempts at this genre including blade runner and elysium but its reserve pays off providing an impression of a world not so distant from now. Logan Marshall Green deserves more opportunities to fine tune his abilities, and I hope this allows him to be seen as a unique talent."
    },
    {
      "rating": "9",
      "text": "This movie was freaking awesome!!! If I could describe this movie, I would say it’s Blade Runner meets 2001: A Space Odyssey meets Venom. It takes place in a gritty lived-in cyberpunk universe, it is about the dangers of artificial intelligence, and one of the central characters is the main character’s alter ego. However, unlike Venom, Upgrade takes it all the way with all the violence and cursing that you’d want out of a mature-rated action-science fiction film! There’s no cutting away from people’s heads being bitten off to get a PG-13 rating here! It has a very interesting story, the performances are great, and the action and effects are excellent! I highly recommend this one, it’s a lot of fun!"
    },
    {
      "rating": "8",
      "text": "A visionary film that well tells the pervasiveness of technology in everyday life, a mixture of contrasting feelings and emotions that will bring the protagonist to a real rebirth!"
    },
    {
      "rating": "10",
      "text": "A masterpiece. Who needs a big budget when you have a director who is a master screenwriter?  Twists within twists.  I bet Nolan would enjoy it ;)"
    },
    {
      "rating": "8",
      "text": "Upgrade is Blumhouse's first entry into science fiction and it is outstanding. Disturbing twists, fast-paced action (on speed), cool sci-fi technology, and an outstanding performance by Logan Marshall-Green, the unlucky visitor on Prometheus and in The Invitation"
    },
    {
      "rating": "10",
      "text": "First off, a lot of movies have the dumbest \"twists\" at the end that they add just for the sake of adding twists and it's dumb. But this film, the kind of twist at the end was purposeful. The story felt real, despite being futuristic, the characters, the love, loss and pain of the protagonist felt real. The action scenes were well done and looked realistic, quite entertaining. The best film I have seen in a long time."
    },
    {
      "rating": "8",
      "text": "A rather unusual combination of science fiction and action, with twists that bet on the horror genre and with a climax and final act that provoke chills and makes one wonder if this is the future of artificial intelligence. As Roger Waters said: there is someone in my head, but it is not me."
    },
    {
      "rating": "8",
      "text": "It's so nice seeing a director with a unique style that doesn't distract from the pure fun of the film."
    },
    {
      "rating": "9",
      "text": "Cyberpunk and so much more, this movie really surprised me it just gets better and better as it progres."
    },
    {
      "rating": "7",
      "text": "Cool concept. Pretty well executed. The juxtaposition of cinematography between perspectives is very cool."
    },
    {
      "rating": "8",
      "text": "More than just an action movie with hard hitting moments and story with twists and turns."
    },
    {
      "rating": "9",
      "text": "Man paralysed in an attack that killed his wife, gets experimental technology to help him walk but instead, he uses it to track down the killers but it turns out, the technology itself put all of these events into motion."
    },
    {
      "rating": "8",
      "text": "Хороший фильм с интересным повествованием и неожиданным сюжетным поворотом. Советую к ознакомлению"
    },
    {
      "rating": "7",
      "text": "The world building was good. The lead actor was great, the rest of the acting was decent. The action was awesome. The story was interesting. The ending was unsatisfying. All in all the movie was very original and very entertaining. I will probably go see it again."
    },
    {
      "rating": "7",
      "text": "Upgrade is a film that went beyond my expectations. Great fight scenes that supported a solid, although overused, plot. The ending was quite the surprise also."
    },
    {
      "rating": "10",
      "text": "Loved this movie! Non over the top sci fi thriller taking place in the near future. Concept of it involves augmentation following crippling injury, very well put together action sequences that are fantastically gory, yet very realistic. Even includes heart felt moments for the protagonist as he struggles to accept that he has lost use of his body for the rest of his life. And a surprising twist in the end."
    },
    {
      "rating": "10",
      "text": "Smart, interesting, high-tech, action, good and handsome actor, so on movie."
    },
    {
      "rating": "10",
      "text": "WOW just WOW!best sci-fi in 2018 so far. Much better then terminator/robocop movies. I want to see more."
    },
    {
      "rating": "9",
      "text": "A great a sci-fi/thriller with a very believable setting and technology. Great action especially the incredible looking fight scenes which remind me of John wick. The story and characters were also really good and the story has some unexpected Revelations that had me gasp hard. Definitely worth a watch I loved everything about it. I hope if there is a sequel it continues on the critically acclaimed path because this could turn out to be an amazing series. 9/10"
    },
    {
      "rating": "9",
      "text": "This movie rocks! The action scenes, the plot, the acting, the graphic visuals, everything. Only reason I dont give it a 10 is because 10 is perfect and nothing is perfect. But 9.8 for sure."
    },
    {
      "rating": "10",
      "text": "Its Like, Origin of \"The Matrix\" Film,and the Matrix was my top 1 level best and favorite film,This films contains a tremendous, amazing, great story and also stunning actions and VFX etc everything is stunningI would say its kind of a  film which's  story you  can't forget for whole life, True Great Sci-fi + High Fantasy + Philosophical Films.I loved the film, A Must Watch FilmBest Regards"
    },
    {
      "rating": "10",
      "text": "Smart movie, very smart. I didn't expected it before. And It has the strong messages about how human intelligence could kills humans trough artificial intelligence only if we can't control this world improvement.  One thing from this movie that should be solved, what's Jamie(the hacker) mean when she's said \"I can't let them win?\". Tell your opinion."
    },
    {
      "rating": "9",
      "text": "Well execute new take on the next gen human story. I like the dynamic of the movie a whole lot, even though it has a few moments that are somewhat cliche."
    },
    {
      "rating": "8",
      "text": "This film is basically \"Robocop\" meets \"Death Wish\", with less satire than the former and more humor than the latter. And it's a B movie blast. An unrelenting pace, fantastic fight choreography that doesn't skimp on the gleeful blood and gore, and never not fun or interesting to look at. Yeah some of the one-liner dialogue as delivered by Logan Marshall-Green feels a bit forced and the plot isn't exactly clever or unique, but damn it, it all works and it makes it's own beautiful alchemy out of a bunch of borrowed parts. This is cheap genre filmmaking done damn right."
    },
    {
      "rating": "8",
      "text": "In a future world where autonomous vehicles are common, one mechanic (Logan Marshall Green) still restores classic cars. When his wife is brutally murdered and he's left a quadriplegic, a tech inventor implants a chip that gives him extensive cyber abilities. Heard that before, but this film offers a different take. Sure, technology is taking over, but the revenge element brings a more personal approach with some violent encounters. While the writing isn't especially original. the concept and it's execution make for a compelling futuristic adventure."
    },
    {
      "rating": "8",
      "text": "A unique visual aesthetic combined with some astonishingly visceral violence makes for a compelling action film that is both fun and disturbing. Whilst the pacing is more tempered than I was expecting, the set design and cinematography are accomplished, and the performances are solid all round. An enjoyable science fiction bloodbath well worth your time. 8.55/10"
    },
    {
      "rating": "7",
      "text": "It wasn't until it was getting close to the end that the story finally came together.  In the first half I found myself tearing the picture apart with what I thought were blaring holes in the plot.  The hand to hand action combat was really well done, and entertaining. The story s a typical revenge tale."
    },
    {
      "rating": "8",
      "text": "The commericals made Upgrade look like merely a sci-fi action/revenge flick, which it kind of is, but there was more to it than I expected. I'm glad I saw this.The film contains tight directing, acting, and music as well as some creative kills. I was very impressed with some of the futuristic decor in this. The plot is fluid and competently handled. Though some parts are predictable, the movie really did play against expectations in one part I won't give away, and overall the film does a good job of surprising.The film does get darker than I expected, but I understand where the filmmakers were going and credit them for taking risks."
    },
    {
      "rating": "8",
      "text": "I love the premise, Whannell kills it as the director (making this low budget flick seem a lot more costly) and Logan plays a great lead role with a solid supporting cast. The movie does enough to keep you interested from start to finish with plenty of fun fight scenes and a solid plot. While it's not the most original story ever told, Upgrade has so much originality and good things going for it that you can overlook its shortcomings (abrupt ending, predictable plot). It's definitely worth the watch and I hope it makes a killing on home video, Where I'm sure it's bound to be a cult classic."
    },
    {
      "rating": "8",
      "text": "This was a fantastic movie with an original story that had awesome action scenes that didn't treat you like a child and let you see the bloody reality of gun fights. When other movies look away when someone gets their head blown off this movie shows the pulpy details and it put a smile on my face. The story is also fantastic with a great morale tale to tell that I won't spoil. Enjoy the movie."
    },
    {
      "rating": "6",
      "text": "It's like Venom, but upgraded.This is Leigh Whannell second movie he directed and it's pretty solid. Cheesy and poorly written, but enjoyable with some cool practical deaths. Logan Marshall-Green, in-spite of his uncanny replica to Tom Hardy, was pretty good, especially with his reaction to tense situations made it even more entertaining."
    },
    {
      "rating": "9",
      "text": "I loved this film. It's an absolute gem. Stop reading the reviews and watch it."
    },
    {
      "rating": "7",
      "text": "Surprised by this interesting and well-executed mix of genres. The truth is that I did not expect something so well done considering it's only Leigh Whannell's second film in the director's chair and his debut wasn't the most graceful and also he's not a really good screenwriter, but hey, there's always the opportunity to grow and to make good things and ''Upgrade'' comes along to confirm it.The story is not the most original and is also predictable but there are good pretty good action sequences and enough humor to cope with those problems.Logan Marshall-Green is also not the most charismatic protagonist in the world but he does things well enough to carry out the film.I wasn't quite happy with the ending, that is perhaps my biggest complaint alongside the generic music score but beyond that I can really recommend this work."
    },
    {
      "rating": "7",
      "text": "We live in a day in age that generations past would only be able to dream of thanks to the wonders of modern technology. If someone had told a younger version your grandparents that in their lifetime we’d have self-driving cars and computers that fit into the palm of your hand, they probably would’ve had them committed to the nuthouse. These are ideas that have been part of science fiction for decades and have since become a reality. Knowing that, the premise of the futuristic film Upgrade doesn’t sound too far off, with its cybernetic-enhanced human beings.The film follows Grey Trace, played by Logan Marshall-Green, a self-described technophobe that rebuilds classic cars for a living. After dropping off his newest masterpiece to a wealthy PC mogul, Grey and his wife are involved in a car accident turned murder that seems to be due to foul play on the part of the couple’s highly advanced self-driving car. This leaves Grey powerless as a quadriplegic and his wife dead. The previously mentioned mogul, Jeff Hadley played by Steve Danielsen, is the developer of the STEM microchip. Hadley claims that this device can learn and adapt to anything, organic or PC based, and improve on its basic structure.Hadley offers Grey a once in a lifetime opportunity to repair his broken body by allowing him to have STEM inserted into his severed spinal cord, under one condition – he can tell no one about the procedure, as this isn’t approved by the FDA or whatever government division the film alludes too. The process is a success, and gives Grey the ability to walk again, with a strange side effect- STEM begins talking to him (voiced wonderfully by Simon Maiden), forcing his ear drums to vibrate at a frequency only he can hear. When given full control of his body, STEM turns Grey in to a super soldier, with lightning fast reflexes and a fighting ability that would give Neo a run for his money. Against Hadley’s request to lay low and keep quiet, Grey sets off on a path to solve the who’s and why’s behind his wife’s murder with his newfound friend.The acting itself is respectable, with the majority of the cast bringing their best effort, but it feels as if the film would’ve been a bigger hit had more noteworthy actors (with better acting chops) stood in. Marshall-Green brings a decent performance; delivering a number of smartass one liners with so much ease he could give Deadpool a run for his money. The thing is, he doesn’t have the presence nor build that the lead character should bring to the table, looking more like a stunt double for Tom Hardy. Throughout the film I kept thinking that this would’ve been elevated from an epic straight to video title to a decent blockbuster film had they used a bigger name in his place. I’m only assuming that Hardy turned down the role because he wouldn’t have to hide his face.The film provides some noteworthy action scenes, but sadly, not enough of them. I found myself losing interest with a few of the subplots, such as the police being hot on the trail of Grey after failing to solve his wife’s murder while the lowlifes in the area start dropping, or Grey’s life post-accident/pre STEM. The latter of these is simply depressing for long periods of time. Writer/Director Leigh Whannell tries to balance this with some comedy, primarily with the previously mentioned mid-fight quips and frequent jokes between Grey and STEM, which often work but fall back on STEM not getting sarcasm a little too often. The saving grace is Whannell’s background in horror which brings some nice thematic elements, particularly the chilling ending, that other director’s may have taken a pass on. There’s a fair amount of gore, with most of the battles ending in at least one uber-violent yet creative death scene.The overall plot is fairly predictable, as I was able to pick apart the majority of it minutes into the film. At the end of the day, the movie comes across as a technologically upgraded version of Death Wish, with touches of many popular Sci-Fi films sprinkled in for good measure. The majority of the twists and turns end up being overly obvious way before they should have made an impact on the viewer. The single exception to this is the finale, which paints a spine tingling picture of where we may be headed as a society as well as setting up for a sequel or franchise.Upgrade is by no means a bad film; had this been released as a straight to video title, it would likely (and may possibly) reach a cult status in no time. Even with its shortcomings, I look forward to seeing Whannell’s next effort, be it STEM and Grey related or otherwise."
    },
    {
      "rating": "8",
      "text": "Quite standard revenge movie where you can guess who the real villain is. But do you really?"
    },
    {
      "rating": "9",
      "text": "This movie reminded me of watching movies as a kid where you were just along for the ride and enjoying the trip. It's not breaking any new ground but it's not trying to.  I was thoroughly entertained."
    },
    {
      "rating": "7",
      "text": "La historia se sitúa en un futuro no muy lejano, en donde la mayoría de personas tienen alguna mejora tecnológica en sus cuerpos, Gray Trace es un de los pocos que no acepta esta idea. El es un mecánico casado con una trabajadora de una de las empresas que ofrecen estas mejoras al cuerpo.Blumhouse es la productora encargada de traer está película. Esta productora es conocida por financiar cintas de terror, la mayoría no de muy buena calidad, pero si hay algunas que sorprendieron, como Huye o la primera de Insidious. Leigh Whannell se encarga de dirigir esta cinta de ciencia ficción muy cargada de referencias a diversas cintas del género y a la literatura de ciencia ficción, especialmente a los libros Philip K. Dick. La historia comienza cuando luego de un desafortunado suceso, Gray se ve obligado a usar un implante de una inteligencia artificial que le ayudara. El dilema  de las inevitables consecuencias de la tecnología se plantea desde inicio de la película y va tomando forma a medida que esta avanza, mostrando que no es una película de ciencia ficción más sino que además ofrece algo más.La película se va convirtiendo en un cyberpunk, con una textura similar a la de Blade Runner u otras cintas del género, además es innegable el homenaje a Matrix en las escenas de acción, que por ciertos están muy bien filmadas. Leigh Whannell con esta cinta pone otra vez en discusión el controversial tema de la des-humanización de la tecnología en una cinta de ciencia ficción bien trabajada."
    },
    {
      "rating": "8",
      "text": "I did not know much going into this movie and what a great surprise it turned out to be. Its amazing what the creative team behind this movie pulls off with what is a relatively small budget.The special effects are simple but work great. The action scenes are great fun to watch. The acting overall ranges from decent to good, and its good to see a movie with actors that are relatively unknown (at least to me).Overall its a great action, revenge movie, with a great twist at the end, and may be one of the best movies of the cyberpunk genre that I can remember from the last few years (don't forget to check out Hardcore Henry for more cyberpunk style fun).Definitely highly recommended."
    },
    {
      "rating": "10",
      "text": "Best movie of 2018. Great cyberpunk storyline. Very good pace. Best battle scenes in a long time, with no wobbling camera."
    },
    {
      "rating": "9",
      "text": "9.4/10 A massively original, intelligent, and futuristic sci/fi that puts 90% of big budget films to shame. Considering this was made for humble 5 million with Whannell teaming up with Blumhouse, its visuals look near flawless and the story is incredibly captivating. The Realistic futurism in the props, set pieces, vehicles, and all of the other vastly complex technology is astounding. Whannell's color schemes and sleek lighting patterns flourish with impeccable camerawork and the action is brutally clever and intensifies at lightning speed. The story is insanely well written and utterly engrossing with Logan Marshall Green showing his extremely underrated acting versatility once again and when the ending hits, it hits hard and effectively out of left field. The soundtrack was perfectly bizarre and matched the futuristic theme incredibly maybe even more than Blade Runner 2049. Leigh Whannell proves once again his writing and directing is vibrantly detailed with outstanding striking visuals, and thoroughly engrossing storylines that defy hollywood standards with sheer experimental genius and ambition. He is going to finally get some deserved recognition for this amazing accomplishment, and I predict this will become a film that many will remember for its visceral smart tech sci fi approach, and might be a spot on prediction of what's to come with our increased smart tech society. If we aren't careful stem/technology will take over the world and this film portrays that immaculately with style and substance to the highest degree."
    },
    {
      "rating": "8",
      "text": "Aside from its slightly misguided ending, I had an absolute blast with writer/ditector Leigh Whannell's \"Upgrade,\" a ruthless, grimy, and thought-provoking sci-fi actioner with a terrifically multifaceted lead performance from Logan Marshall Green. For a film with such a small budget, Whannell pinches those pennies as effectively as one would hope, especially for a film set in the -- presumably -- distant future. The production design, the cinematography, the fight choreography; all of it is top notch. I mean the first action scene alone is worth the price of admission. What a welcomed surprise from everyone involved."
    },
    {
      "rating": "10",
      "text": "I didn't have so much fun watching a fight scene in a long time. Watch it now!"
    },
    {
      "rating": "7",
      "text": "'Upgrade' is a hybrid action/comedy/horror flick written and directed by Leigh Whannell, who previously brought us the highly successful 'Saw' and 'Insidious' franchises.It stars Logan Marshall-Green, who shall forever be known as Tom Hardy's doppelganger (seriously--compare photos), opposite Betty Gabriel, a rising star famous for her turn in the breakout hit 'Get Out.'While the acting and overall concept are both quite remarkable, there's an unmistakable clunkiness to the film, alternating between the dialogue, blocking, and editing.  However, the cinematography is superb, especially on such a low budget, and the action sequences when the bio-mechanical aspect of the film are fully utilized simply aren't to be missed."
    },
    {
      "rating": "9",
      "text": "Have you even wondered what James O'Barr's \"The Crow\" would be like if it traded in it's gothic poerty for a copy of William Gibson's Neuromancer? In my opinion it would be Leigh Whannell's UPGRADE. While the first 15 minutes of the movies slow pace and seemingly scattershot plot points may have you running for the door, those that stick with the film are rewarded with a visually striking film that carefully balances a timely socially conscious cyber punk narrative with a gritty tale of revenge. At the heart of the film is a debate about what we're willing to give up as a society for the coveinence afforded to us by articficial inteligence. Our present see's us concerned how much personal privacy we're willing to exchange for the convenience of gps guidance, social networking, predictive texting, and automated scheduling. Upgrade's future asks what paraplegic Grey Trace might have to sacrifice to an AI for a functional body, and a chance for revenge. His Privacy? Almost certainly. His humanity and free will? Quite possibly."
    },
    {
      "rating": "9",
      "text": "It's nice to see cyber punk making somewhat of a comeback. This was pretty much the previews in a good way. The film tells a story and does not get off track. The only real problem is this did not really have a budget."
    },
    {
      "rating": "8",
      "text": "After seeing Upgrade on the big screen, it’s safe to say that this sci-fi film totally kicks ass all around! There’s not much to say about this film, but this film is the dystopian future version of John Wick and Blade Runner combined. Nonetheless, it could be a sci-fi body horror neo-noire cult classic in the future."
    },
    {
      "rating": "7",
      "text": "I've just finished watching it as I write this. It's a very dark film, and the early scenes, where the protagonist is reduced to a quadraplegic, are genuinely grim. It's pretty gory, and the fight scenes are fairly frequent, but while a lot of the reviews make it sound like the Matrix or similarly elegant films, the hand-to-hand combat is instead robotically efficient and deeply visceral, as during extreme moments the hero cedes control of his neocortex to an onboard computer chip, STEM, that acts as the protagonist's onboard, hyperviolent Alexa.  Those fight scenes have a creepy, lurching quality as our hero is effectively puppeteered by STEM and with their jarring switches of camera angle throughout they're not entirely enjoyable to watch. What makes it hard to look away is the spectacle of a human being operating completely unconstrained by normal reaction times or the slowness of thought that makes human beings graceful but ineffective fighters. Seeing two humans both operated by STEM-like systems, going at one another full-tilt, is the film's high-point. It's genuinely unsettling, not for the violence but for the mathematical precision of it all. (If that's what proxy wars between countries will look like, with AI soldiers fighting each other instead of humans, it might end up being even scarier than warfare as it stands today.) It's a bit of a grindfest, with little light or humour, and the future world in which the film takes place is a little claustrophobic, probably due to budget constraints, but what elevates it above other films in the revenge genre is the brutal, ugly efficiency of the fight scenes and, more than that, the sinuous plot. It's got a kind of momentum that only increases as the film goes on, while the effectively minimal score throbs underneath. The aesthetic is like a very cheap Bladerunner but it conveys something of the griminess of what takes place. It's a grubby film all told, and it's not washed clean with a happy ending. There are no likeable characters, no-one really to root for beyond the protagonist, an actor from something I can't put my finger on, and who is instantly unlikeable but grows on you very mildly as you watch. So you're not going to skip out of the cinema afterwards. As I've said, it's the narrative that ends up elevating it. It keeps you guessing throughout, propels the hero forward with clean lines and clear motives, and finally, just when you expect a relatively straightforward, messy, unsatisfying conclusion, the whole film is pulled together at once by one of the most elegant moebius strip twists that I've seen in a very long time. It really is worth seeing for the the precision and beauty of the bow that's finally tied at the end. When the curtain was pulled back I just had to shake my head and laugh at the audacity of it all. TL:DR - come for the fight scenes, stay for the elegantly conceived narrative."
    }
  ],
  "recommendations": [
    "minority_report",
    "robocop",
    "blade_runner_2049",
    "mission_impossible",
    "the_matrix",
    "the_terminator",
    "bone_tomahawk",
    "hellboy",
    "doctor_strange",
    "cube",
    "avengers_age_of_ultron",
    "reminiscence",
    "color_out_of_space",
    "valerian_and_the_city_of_a_thousand_planets",
    "the_equalizer_2",
    "total_recall",
    "the_matrix_reloaded",
    "the_fly",
    "sicario_day_of_the_soldado",
    "hardcore_henry",
    "the_invasion",
    "mortal_engines",
    "the_invisible_man",
    "300_rise_of_an_empire",
    "blackhat"
  ]
}