{"id": 3052, "title": "Upside Down", "starring": ["Kirsten Dunst", "Jim Sturgess"], "runtime": 104, "genre": ["Romance", "Science Fiction", "Drama", "Fantasy"], "description": "In an alternate universe where twinned worlds have opposite gravities, a young man battles interplanetary prejudice and the laws of physics in his quest to reunite with the long-lost girl of his dreams in this visually stunning romantic adventure that poses the question: what if love was stronger than gravity?", "releaseYear": "2012", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/9hKKjXqrTW73Ob4wPJooNuhVpBg.jpg", "categories": {"plot": 7.526315789473684, "acting": 6.9, "ending": 7.5, "soundtrack": 8.333333333333334, "cinematography": 7.0, "familyFriendly": 6.0, "funny": 9.5, "action": 10.0}, "reviews": [{"rating": "9", "text": "Upside down is a science fiction movie but a tragic and romantic. The director is Juan Solanas and the main actors are Jim Sturgess (Adam) and Kirsten Dunst (Eden). This French-Canadian movie was realised in August 2012.\r I advise this amazing film to persons who love science fiction and love story.\rThis movie is a romantic comedy and it's a movie beautifully and incredibly directed.\rI think this movie is an awesome and convincing story because the soundtrack and the special effects are amazing and beautiful.\rAll along this movie Ifeel a billon of shivers in my body. It's fantastic ! Go and see this movie and you will be surprised !"}, {"rating": "10", "text": "The film centers on a pair of lovers divided by a world with dual gravity. The two worlds are strictly separated: the rich people live up while the poor people live down. The only connection between this two worlds is through the company Transworld. Adam(Jim Sturgess)is from down but he has the fortunate chance to meet Eden(Kirsten Dunst). They fell in love but are forced to give up their love by the police of the upper world. After ten years they'll have the opportunity to meet again and fight against the gravity that separate them. The concept of two rigid separated worlds is an original metaphor of many people who had lived in difficult political and economical situations in which they were brutally used and forced to live a humiliating life. For this people there was no love, no emotions. They were merely an object, easily expendable to build a prosperous and cohesive society. It is undoubtedly a very pressing matter even in our historical situation. So Adam becomes the focus of our sympathy. We deeply understand his desire of redemption and quest of a long lost love who could give him some relief from a grim reality, even though he doesn't know her exactly. For this performance, Jim Sturgess deserves all the accolades. He is very moving and convincing. On the contrary, Eden is a little distant, only object of veneration and love-seeking. As for Kirsten Dunst, it is a much brighter and easier role after her dark roles in \"All Good Things\" and \"Melancholia\". She has no showy scene (aside from when she tries to remember in spite of her amnesia) even though she plays well as always. Timothy Spall as Bob ,who assists Adam and finally helps Eden in her final decision, is very good. Juan Diego Solanas, for his brilliant idea, can be considered a really visionary director. He created a film which has some elements similar to \"Inception\", \"Gattaca\" and \"Stardust\" mixed together which are well corresponded. The script is simple but nevertheless it deals with the question of gravity which may be at times a little confusing. The special effects are really astonishing and the soundtrack really suggestive. My vote is 8/10."}, {"rating": "8", "text": "After reading the reviews, I had modest expectations going into this one.  I was so pleasantly surprised!  This film packs in so many themes, the twin worlds embody so many metaphors, and it's simply an excellent love story.  If you were at all interested by Dark City, Melancholia, Brazil, the Adjustment Bureau and other sci-fi films of their ilk, you'll be at least amused by this one.  It's not extremely heavy or dark. but it's visually beautiful and entertaining."}, {"rating": "8", "text": "This is one of the strangest yet most original movies I have seen in a long time. My girl friend loved the romance, and I loved the science fiction part, so everyone was happy. I think this is the best fantasy i have seen in the last couple of years. Highly recommended, although at times all logic needs to be suspended. But I think the movie gets away with all of that..."}, {"rating": "10", "text": "Upside Down is a fantasy romance movie taking place in an hypothetical twin planet system where one planet is prosperous and the other is poor and exploited\rby the first. It is one of those Jonathan Swift type of settings where the social commentary goes hand in had with a striking sense of wonder. The romantic story at the core of the film is nothing new, but the construction of this alternative reality, with its\rown set of physics is what will keep you in awe for the whole running time. Cgi never felt\rmore organic (this was achieved by the seamless combination of computer generated graphics and\rpractical effects), and Jim Sturgess gives a highly physical, touching and funny performance.\rSolanas proves to be a talent to reckon with."}, {"rating": "8", "text": "♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"}, {"rating": "8", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■●■¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡"}, {"rating": "8", "text": "Upside Down has stunning visuals, a unique premise & the romance between the 2 leads is very strong. You can feel all of the emotions and there has never been a movie like this. It is great to see Kirsten Dunst in a movie aside from the Spiderman trilogy, B+."}, {"rating": "8", "text": "++++++++++++++++++××××××××÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷××+++++++++++++■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "8", "text": ":*:*:**:;*;**;*;:*:*\"*\"*\"**\"*\"*\"¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"}, {"rating": "8", "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************"}, {"rating": "8", "text": "Beautiful fairy-taleThe film's setting is magnificently beautiful, there are a lot of stunning ideas and images and the main story is good enough to make the two-planet world look real. The one and the only one flaw of the film is that it pretends to be a sci-fi film rather than a fairy-tale in an unusual setting. If you judge it as a sci-fi you will find a lot of \"how could it be\" things that tear the imaginary world apart. The actors are great and it is fun to see Spall as a protagonist friend rather than foe. Both Sturges and Dunst are wonderful. So if you want to watch a sci-fi film you better avoid \"Upside Down\". This is a love story set in the fantasy world. No more, but no less."}, {"rating": "8", "text": "⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙¤⊙•⊙•⊙•⊙⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙•⊙¡"}, {"rating": "8", "text": "Absolutely stunning in every sense, ignore the NEGATIVE people!! PHENOMENAL!!This is another example of how people judge a brilliant work of art like this film. I'm not sure if its outright ignorance or just good old fashion jealousy!! This is a beautiful film in every way possible, the cinematography showing the dark dreary low world and the high sunny bright world and how it compares to the rich and the poor in EVERY nation, then there is the beautiful romantic story, come on you cant stop true love!! Trust all of us who get this film, especially those of us in a long beautiful relationship we all GET it!! Ignore the haters who try to tell you different. So glad we own this picasso and even more amazing is the 3d bluray."}, {"rating": "8", "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"}, {"rating": "8", "text": "The science is lost on most.This movie uses a very interesting science fiction premise that is lost on most, judging based on the reviews. In short, it's a Romeo and Juliet story based on two tidally locked, geosynchronously orbiting binary planets, with one planet composed of matter and the other antimatter. There is no scientific consensus for how matter and antimatter interact via gravity, but one theory is that they repel, which is what the movie presumes. The orbital dynamics are sketchy (likely would require a binary star to push the planets together), but the \"three laws of inverse gravity\" succinctly summarize the net effects as perceived by our protagonists. A) The net force of gravity is in opposite directions for matter/antimatter, B) is a corollary of A, and C) matter/antimatter annihilate each other when they come into contact. C isn't explosive like how most action-oriented sci-fi portrays, and the gradual heating/burning process is actually somewhat realistic. Obviously the writers did their homework first, which is quite rare.The medical side of the movie that drove the plot isn't nearly as realistic, but used standard movie rules. Beyond that, I thought the plot was entertaining enough. There wasn't as much new ground with the human dynamics, but it's a sci fi/fantasy film with good special effects. The premise kept me pondering while I got to admire some beautiful scenes, with a feel-good plot happening in the background."}, {"rating": "8", "text": "Just watch it and you won't regret it!Such a good movie! People are criticizing talking about science and how the two worlds might collide, and some others are asking questions that were answered. For example: \"Why are Adam's shoes on fire?\" Well its because the very first thing they said in the movie was that matter from the opposite atmosphere will ignite if they are in contact for too long. It is defiantly very interesting and the answer to most ridiculous questions is \"because the director said so\". This is exactly the type of movie I love seeing. Not an extremely sappy romance, but a lot of other things going on around also. If only there are other films that similar to this, because the only ones I have found...I have seen. Two thumps way up !!!!!"}, {"rating": "8", "text": "Beautifully BreathtakingI absolutely loved this movie! It held me in suspense for the entire duration.First, the cast is amazing and their acting was believable. I'm always so much in awe when the actors must do their scenes facing green walls, imagining the world later created by computers and make us believe what they see. Dunst and Sturgess have amazing chemistry! They make a lovely couple! They are sweet together! And the graphics are absolutely killer. It's a whole new world that unfolds in front of you and you can nearly feel the magic and mystery when looking at the landscapes. The buildings have a modern look and really, every place has a style that goes with it. They've done great work here.And the most important of all is the story, the personality of the characters, the actions they take. It's all so realist. They follow their goals and you really see them evolve through the movie. The plot is beautiful. The director did a brilliant job and I'm so proud how the movie came out! I would recommend it to anyone!"}, {"rating": "8", "text": "One of the finest films that her lip in 2012\rFiction and very unnatural and very beautiful and very romantic and very good out\rby adil khojah  the best"}, {"rating": "8", "text": "8.5/10 for me.  The French Inception.  It complements the USA-UK Inception (2010) and the Russian Inception titled 'Coma' or 'Koma' (2019).  All three Inception movies have top-drawer VFX.  I note user scores for Upside Down are about twice as high as critic scores.  What critics often miss which fans do get is the mood of fantasy, invention and possibility.  Upside Down is this mood.  This one has much of the magic of the Toby Maguire Spiderman 1 & 2 with fewer plot distractions.  As with most fantasies written for the screen, every writer is challenged to come up with a satisfying third act.  It's simply much more difficult to write a compelling fairy tale or fable than non-writers imagine."}, {"rating": "3", "text": "Upside down started with a good idea and it came as a really really bad idea which has no explanation and it makes you bore as hell. A film which is extremely boring and has great effects. The budget of that film was really big and I don't think that many people which is a shame. But this movie is a shame too  Too bad because it had really great special effects with the upside down worlds..."}, {"rating": "0", "text": "This movie was just plain bad. I don't know what movie the positive reviewers were watching. But, surely it wasn't what I saw. The amount of poor direction, bad editing, and bad sound, was enough to make me and everyone else I saw it with, scratch their collective heads in amazement. I can't even say the visuals were good. The overly digitized backgrounds, and sometime grainy, overly produced, foreground, was enough to pull this viewer right out of suspension of disbelief, into sheer disbelief. You would think that the powers that be could see how bad it was, and not embarrass the actors who are all good outside of this travesty, and just shelve it (or direct to dvd). I don't know what else to say, because I don't know where to start. Worst movie I have seen in ages. Almost as bad as that Travolta abortion 'Be Cool'."}, {"rating": "5", "text": "‘Upside down’  una coproduzione franco-canadese ad alto costo in cui forse sono stati spesi troppi soldi per la parte visiva e il cast tendente all’hollywoodiano mentre si  posta poca attenzione alla costruzione della storia, di cui  autore il regista argentino, ma da sempre residente in Francia, Juan Solanas. Travestita da film di fantascienza, ecco allora una fiaba che non  altro che l’ennesima variazione della vicenda di Giulietta e Romeo: in un sistema binario, ci sono due pianeti gemelli ma dalla gravità inversa e gli abitanti del mondo di sopra sfruttano economicamente gli sfortunati che nascono di sotto. Gli unici contatti tra i due mondi sono il palazzo di un’avida corporation guidata da uno squalo senza scrupoli che si chiama quasi come un whisky (Lagavullan  omaggio a Izzo?  impersonato da James Kidnie) e le cime di alcune montagne che si avvicinano tanto da consentire l’amore impossibile tra gli adolescenti Eden e Adam (nomi fin troppo espliciti, si direbbe). Quando gli eventi li separano  cioè la polizia, chè i rapporti intermondani sono vietati  passeranno dieci anni prima che i due possano ritrovarsi soprattutto grazie alla buona volontà di lui, che vive in basso e ha un certo talento scientifico impiegato nella ricerca della formula che annulli i contrasti delle gravità. Dopo i bellissimi titoli di testa, realizzati dai francesi di Moustache Studio, e un affascinante prologo con i protagonisti ragazzi, il film resta sempre notevolissimo dal punto di vista visivo, ma perde la sua presa sullo spettatore perché incapace di coinvolgerlo dal punto di vista emotivo: le cause sono più di una e si va dal ritmo non certo trascendentale a dialoghi mai davvero memorabili, dai salti e dalle svolte telefonate della sceneggiatura a un finale frettoloso. A farne le spese  la sospensione d’incredulità, che finisce per lasciare spazio alla voglia di fare le pulci da parte di chi guarda, con tanto di discussioni divertite sull’amore che non fa sentire il freddo anche in cima ai picchi più scoscesi o riguardo a come abbia fatto Eden a restare incinta. Al risultato non contribuiscono granchè neppure gli attori, che pare non ci credano del tutto neppure loro (a parte il fatto che, primo, comincia a nascermi il sospetto che Sturgess sia sopravvalutato e, secondo, che Dunst sembra più vecchia del suo partner mentre ne  praticamente coetanea): anche i ruoli secondari non sono molto a fuoco, con la sola eccezione del personaggio di Bob grazie al quale Timothy Spall risulta essere il più convincente della compagnia. Per fortuna, a controbilanciare il tutto c’è la qualità delle immagini, grazie alla fotografia di Pierre Gill, a un reggimento di addetti agli effetti speciali e alla felice abilità di immaginare un intero universo: restano specialmente negli occhi la cupa decadenza del mondo di sotto  che si direbbe ispirato a un Paese del socialismo reale, tra buio, archeologia industriale e strade percorse da Trabant (o qualcosa di simile) e carri trainati dai cavalli  e le belle invenzioni visive consentite dalle inverse gravità dei due pianeti, dalle scoscese e iperrealiste montagne alla sala da ballo dove quello che  il pavimento per gli uni  il soffitto per gli altri."}, {"rating": "4", "text": "It cannot help but feel like a massive disappointment, given its unique premise and astonishing visuals, because the story is bland and so awfully told."}, {"rating": "6", "text": "This is a really cool looking movie with some really cool ideas that has a story that falls short.  I do think there is good chemistry between Jim Sturgess and Kirsten Dunst and their love story does work."}, {"rating": "6", "text": "To start with:It is not one of the movies that you must have see before you die but its not as bad as some people say.Its innovative at some parts.The gravity idea is fresh and the design is good.Of course the music is very bad timed some times and there some physical mistakes but i think that that doesnt pulled the movie down.In my opinion Upside Down is a average movie with an outstanding idea behind it.Its not the best but also its not the worst.All in all its good average.And Kirsten Dunst is absolutely stunning!"}, {"rating": "4", "text": "Love conquers gravity apparently, if it could only conquer stupidity...the movie could've been better...entertaining in bits and parts but doesn't do enough to win a favorable approval rating..."}, {"rating": "4", "text": "Dont waste your time. Seriously. I was embarrassed for choosing to watch this film with my friends. Very weak, simple story, so slow, everyone was almost sleeping."}, {"rating": "0", "text": "I couldn't continue after they involved bees three minutes in.  Bees?  I'm sorry I couldn't overcome that part and review the rest of the movie, but I \"stopped the movie there\"."}, {"rating": "6", "text": "The film was visually impressing, magnificent cinematography and perfect direction but exploring beyond the surface it will leave a trail of weak character development unnecessary side characters and altogether a cheap romantic drama."}, {"rating": "1", "text": "Les effets spéciaux de nos jours permettent bien des fantaisies et se prêtent à tous les caprices des esprits les plus imaginatifs... Quand certains ont quelque chose à raconter, cela peut donner de surprenants résultats mais quand il s'agit d'une seule pauvre idée (\"ce qui est haut est en bas et inversement\") déclinée à l'envi et à l'infini jusqu'à l'indigestion, ça devient particulièrement navrant, en plus d'être très ennuyeux.Upside Down est typiquement dans ce cas de figure et nous abreuve de ses effets \"d'en haut et d'en bas\" jusqu'à la saturation visuelle. Comme il n'a rien à dire, il meuble à la sauvette sur une vague \"histoire\" d'amourette à l'eau de rose fanée, périmée et recyclée dans laquelle les comédiens s'égarent, notamment Kirsten Dunst à la masse et à côté de la plaque et qui devrait songer à sa reconversion très prochaine.On a donc du remplissage, du superflu et des paillettes ainsi qu'une affligeante naïveté sous le prétexte fallacieux de l'onirisme béat, parce qu'un gars qui devait sans doute pousser très fort sur le trône s'est mis à mater le plafond."}, {"rating": "8", "text": "Imaginatively Brilliant Love Story !!!!!Upside Down - There's an epic love story other than Romeo and Juliet, or Jack Dawson and Rose DeWitt Bukater of the Titanic. This is one great story I would certainly recommend to those who seek for a legendary, extraordinary love epitomes. I can't imagine to live in a world where gravity were purely discriminative. The storyline might seem pretty cliché, but the idea of two distinct world of differences was an imaginatively creative. Not to mention, watching the sweetly talented 21's hero, Jim Sturgess as Adam Kirk with the beautiful Spider-Man's MJ, Kirsten Dunst, played Eden, the long-lost love of Adam. Of course, theoretically it was never possible for a many reasons, but the idea was greatly presented. Screw the universe's rule! Love's gonna conquer it all. And yeah, as you watched this movie, you might think a question that I was thinking, which will be the reason Eden might be able to live in both world. No, she wasn't really could. Great movie, nice CGI. That seemed pretty obvious too. Apparently, it's still beautifully scenic."}, {"rating": "8", "text": "Clever film with a stunning concept.This film is awesome. Good storyline and the stunning concept make the two-planet world even more realistic. The only thing that the production team of this movie got me confused is that it depicts to be a sci-fi film rather than a fairy-tale fantasy movie. The sci-fi concept of the movie will make its viewers realized that there were a stunning conceptualization and collaboration of work. You'll find a lot of things that tear the imaginary world apart. The actors are great, and they have played their roles very well. I could recommend this film to those who love watching this kind of epic love story. Overall, I believe that the film has exceeded and filled the expectations of people."}, {"rating": "8", "text": "In this movie an orphan meets a young girl and they like one another. However they have twin planets whirling around one sun causing double gravity. She lives above him, in the wealthier society. He lives below her in the poorer society. She has an accident that affects her memory. His grandmother is taken away because the authorities find out that he was talking to her. Anyone up top can't consort with anyone from below. Years later when they are adults he finds out that she works for Transworld a conglomerate company. He sees her on a prize show as a guest. He then decides to win her back by going up top. She doesn't remember him but her memory of him starts to comes back piece by piece later in the movie. The visuals, romance and acting are stellar in the movie. Upside Down is a one of a kind Sci-Fi Fantasy Romance. Upside Down is one of Kirsten Dunst's best movies. The movie is a gem and the cinematic experience is tremendously rewarding for the audience. If you have not seen this movie or heard of it, you need to see this movie today !!!!"}], "recommendations": ["contact", "eternals", "cloud_atlas", "arrival", "inception", "life_of_pi", "interstellar", "her", "the_martian", "avatar", "mortal_engines", "the_bfg", "hugo", "the_13th_warrior", "risen", "perfume_the_story_of_a_murderer", "the_giver", "titanic", "what_dreams_may_come", "the_fountain", "tolkien", "samson", "the_lovely_bones", "ex_machina", "tomorrowland"]}