{
  "id": 2093,
  "title": "Us",
  "starring": [
    "Lupita Nyong'o",
    "Winston Duke"
  ],
  "runtime": 116,
  "genre": [
    "Horror",
    "Thriller",
    "Mystery"
  ],
  "description": "Husband and wife Gabe and Adelaide Wilson take their kids to their beach house expecting to unplug and unwind with friends. But as night descends, their serenity turns to tension and chaos when some shocking visitors arrive uninvited.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ux2dU1jQ2ACIMShzB3yP93Udpzc.jpg",
  "categories": {
    "plot": 8.465116279069768,
    "acting": 8.416666666666666,
    "ending": 7.6923076923076925,
    "soundtrack": 9.0,
    "cinematography": 9.25,
    "familyFriendly": 3.0,
    "funny": 8.433333333333334,
    "action": 7.857142857142857
  },
  "reviews": [
    {
      "rating": "10",
      "text": "movie is good just needs to do better with the 3rd act that is all I have to say"
    },
    {
      "rating": "9",
      "text": "Us may look like your average family movie, but believe it or not, it has more meanings  than you think it is - and it's crazy amazing. No wonder why Jordan Peele ceases to amaze me when he came from a sketch comedy background on MadTV all the way to directing/producing Oscar winning films and he has made an another horror classic similar to what Stanley Kubrick has done with The Shining. If I were you, try to see 'Us' at least twice."
    },
    {
      "rating": "9",
      "text": "Ok, we all know/knew this would be a good movie, so there’s no need to say it in a review. The story/plot was fresh, original, exciting and dynamic(we all coulda guessed that also). The trailers left out a lot(pretty much all) of the plot so that was good. The cast did perfect, even the supporting actors. There were a few and minor character flaws while the story was building, but all that went away when the “other families” showed up. Solid dramatic/suspense movie with a little humor peppered in throughout, but not overdone. Nice wind up during the home stretch, and ended with a solid but subtle twist. They could leave the ending as is and let our minds wonder, or they could maaaaaybe do a sequel, MAYBE. (I'm sure they won't)If you liked early M. Night and Get Out.... you’ll obviously love this."
    },
    {
      "rating": "10",
      "text": "This richly layered, deftly nuanced smart horror offering tells a tale that can be viewed both personally and collectively, one that gives the audience much to think about upon leaving the theater. Director Jordan Peele's second feature defies the sophomore jinx, delivering an expertly crafted allegorical story that's captivating and insightful while delivering great laughs and a few good scares without becoming gratuitous. As good as his first picture, \"Get Out,\" was, the filmmaker has taken a quantum leap in his artistry and storytelling skills with this release, an accomplishment that will likely allow him to write his own ticket from here on out. I can't wait to see it again!"
    },
    {
      "rating": "10",
      "text": "fffDie Filmkritikerin Antje Wessels erklärt, vor allem die Idee, sowohl die Protagonisten als auch ihre jeweiligen Doppelgänger von ein und denselben Darstellern verkörpern zu lassen, trage dazu bei, dass sich Wir ganz langsam seinen Weg ins Unterbewusstsein der Zuschauer bahnt. Lupita Nyong’o, Winston Duke sowie die beiden Newcomer Shahadi Wright Joseph und Evan Alex agierten je nach Figur vollkommen unterschiedlich: „Sie werden zu einer Art negativem Spiegelbild ihres Gegenübers, reden mal gar nicht, dann wiederum so, als würden sie beim Sprechen ein- statt ausatmen, was körperlich nur sehr wenige Worte hintereinander möglich ist. Sie fokussieren ihr anderes Ich, umtänzeln es und morden schließlich auch – und das in Wir auch deutlich blutiger, als es noch in Get Out zu sehen war.“ Klassische Jumpscares gebe es hier zwar keine, dies sei aber auch gar nicht nötig, so Wessels weiter, da das Gruselige an Wir letztlich vor allem der Gedanke über sich selbst sei, wie viel Böses eigentlich in uns stecke"
    },
    {
      "rating": "9",
      "text": "Funny, suspenseful, occasionally scary. This film had me gripped throughout and moved at a nice pace. Great acting from all involved, some thought provoking at the end for the implications of the twist and how it would have impacted everything that came before."
    },
    {
      "rating": "10",
      "text": "US is a brilliant horror film. Peele has brought a fresh approach to an outdated movie genre. The direction, writing, and acting are some of the best not only in a horror/suspense film but in the recent movie history. Lupita Nyong'o is at her best here, portraying both her roles. The plot twists and story, in general, will keep you guessing but in all the right ways."
    },
    {
      "rating": "10",
      "text": "I absolutely loved this movie. It has one of the most beautiful scenes I've ever seen in a horror film and such an amazing score.  \"There's a family in our driveway\" is going to become an iconic line in horror."
    },
    {
      "rating": "8",
      "text": "Writer/director Jordan Peele is back with another creepy chiller that I liked better than \"Get Out\" (my review). This one focuses on a happy family starting a vacation near the seaside, but before long an ominous group shows up that looks exactly like them, with much more negative vibes. From there, things get fun, in a suspenseful way. The scares and violence are peppered with Peele's comic smarts. The father character (Winston Duke) is certainly channeling Peele's own style. While the concept behind the doppelgangers is promising, there are some questions marks that throw the logic off the rails a bit. Still, it's an inventive and engrossing addition to the genre."
    },
    {
      "rating": "9",
      "text": "90/100  Now I come from the movie and I think I'm too hypeed ... hmm ... I do not know but I really liked it. Jordan Peele nailed it again.  Interesting story and disturbing ending (I hope it won't be a second movie).  The acting is very good (except Winston Duke ...).  Be careful during the movie because you can figure out to some extent what's going on.  It's filmed well without cheap jumpscare and sometimes it has humor but it did not really go with the tone of the film...  Recommended!"
    },
    {
      "rating": "7",
      "text": "The type of film that demands a second viewing. Maybe there are plotholes, maybe Peele just layered clues in with his dialogue like with “Get Out” and it all checks out. Time will tell just how good of a sophomore outing this is, but no matter what it’s an effective thriller."
    },
    {
      "rating": "10",
      "text": "This movie is incredible. It has no universal meaning, despite what some critics said, outside of the statement it makes about the part of ourselves that we hide. It is truly terrifying, and although the siginificance of the ending twist is predictable, the way Peele executes it is highly surprisng."
    },
    {
      "rating": "10",
      "text": "Incredible.Hard to talk about this movie without spoilers, but I'll say that beautiful cinematography, an absolutely haunting performance from Lupita and the perfect mix of humor and horror all makes Us not only the best movie of 2019 so far, but quite possibly the best horror movie of the decade.Also, that Good Vibrations scene will bring new meaning to the song the same way A Clockwork Orange did to Singing In the Rain."
    },
    {
      "rating": "7",
      "text": "I definitely enjoyed it more than Get Out, and it has a great sense of style and tension, but as a horror movie, I found it a little bit tepid. Other than a single death scene toward the middle, I never felt there was much at stake. Lupita is fantastic - the movie is really her tour de force, but the twist didn't do a whole lot for me.  The implications of the twist just are not all that interesting to me.  And the \"other world\" of the doubles just didn't have the same kind of impact that the zombies in classics like \"Dawn of the Dead\" have. Sure, they mimic the regular humans, but to what end?  I should say that Elizabeth Moss is also great, and really, the kids are, too.  You definitely laugh a few times in this film, but the sense of real dread and true suspense are just not present in this film.  I do look forward to Peele's next one."
    },
    {
      "rating": "9",
      "text": "My God! What movie is this?!?! Lupita Nyongo deserves to be indicated in ALL, performance of the millennium! Jordan Peele is a genius. The scene of the invasion is the most tense of all! WHAT A FILM BIZARRE! It will stay in my mind for a long time."
    },
    {
      "rating": "9",
      "text": "More consistently terrifying than \"Get Out\" while maintaining that film's intelligence and emphasis on provoking thought, Jordan Peele's \"Us\" proves that the writer/director is far from a one-hit wonder. The movie isn't always as successful as its predecessor in exploring the heady themes of identity and control that it evokes, and is a messier, less coherent experience as a result, but nevertheless remains compelling throughout. The impressive cast members all show considerable range in playing two vastly different characters, particularly Lupita Nyong'o, who shines both as the desperate, terrified but determined matriarch as well as her sinister, calculated doppelganger with a voice straight out of a nightmare. The confidence with which Peele and his performers pull it all off is ultimately what rescues the project from itself, however, and it remains enough of an unnerving experience on a purely visceral level to remain enjoyable for horror fans looking for something a little more than ghostly ghouls and silent slashers."
    },
    {
      "rating": "10",
      "text": "No doubt about it, this is a masterpiece. Jordan Peele is an absolute genius for making a movie this incredible. If you love horror, but must see this in theaters."
    },
    {
      "rating": "10",
      "text": "First of all, Jordan Peele knocked it out of the park with this film. He directed, wrote, and produced this film. With every scene, he directed it to perfection so you knew what was happening to this family and what to feel. This wouldn’t be possible unless the actors did their job to the best of their abilities and easily they did. Once the invaders come into their house and the tension grows that is when some of their best acting comes out. They make you sympathize with them and want them to survive. The one person who stood out the most to me though was Lupita Nyong’o mainly because she is the main one you follow throughout the film. But she easily stole the whole film from beginning to end. Even the kid actors, Shahadi Wright Joseph, and Evan Alex did outstanding jobs and I hope they will go far with their careers. The music in this film also helped set the tone and mood in specific scenes. Every time the music started you automatically knew that something was going to happen. This film is already one hour and fifty-six minutes and it doesn’t feel like it one bit. The movie flows really well from scene to scene and you can easily understand what is happening without knowing what’s coming up next. I have to mention that the cinematography, especially in the scene where you don’t know yet that the people are them, is really well done. This film isn’t perfect but most of my problems are spoilers so I won’t mention them but they are minor and still don’t take away from how great of a film this is. In the end, Us is a great time for anybody whether you like horror movies or not, especially because I would classify it as a thriller. I highly recommend checking this film out."
    },
    {
      "rating": "7",
      "text": "Nice mix of the old and boring thriller jump-scares/templates and some fresh new visual ideas. Ironic use of music. There's an overall feeling of humor and wit to this film, which elevates it from the genre."
    },
    {
      "rating": "10",
      "text": "Like “The Shining,” there are a number of different ways to interpret Jordan Peele’s excellent new horror movie, Us. Every image seems to be a clue for what’s about to happen or a stand-in for something outside the main story of a family in danger. Peele’s film, which he directed, wrote and produced, will likely reward audiences on multiple viewings, each visit revealing a new secret, showing you something you missed before in a new light."
    },
    {
      "rating": "10",
      "text": "lolfrcgrthgrtytrgrtgrtvgrgvrtgrvtgtrvgtrgrgrgvvgtrgtrgrgtrytrytryrttttttttttttttttttttttttttttttttttttttttttttttt"
    },
    {
      "rating": "10",
      "text": "An absolute enjoyable film filled with thrills, chills, laughs, and mystery! Us, just like Get Out, isn't your generic \"horror\" movie,but it plays on that trope. Us delivers on the pulse pounding frights and brutal violence building up an interesting story and blowing twists, all while throwing a few comedic and funny moments. An absolutely incredible follow up film, and yet another film meant to be a cult classic!"
    },
    {
      "rating": "9",
      "text": "I went to watch 'Us' on the opening day expecting a decent horror film from Jordan Peele. On leaving the theatre I felt disappointed with the film, feeling it went too far in some places which overall lead to a disjointed narrative. However, the more I thought about the film the more I realised Peele's brilliance with this film. The tiny nuances through the writing and acting allow for the audience to interpret both the film as a whole and the ending in so many different ways, which I originally believed didn't work, yet after having time to think about the film it shows a great political commentary as an undertone whilst subverting the expectations of the horror genre and creating an overall brilliant film."
    },
    {
      "rating": "10",
      "text": "Horror/thriller Us, about a family being attacked by duplicates of themselves, was such a unique experience for me. This is only Jordan Peele's second film and he already has a confident sense of direction. Tightly controlled use of camera angles and fine use of color and scenery are all here. The panning out opening credits has a slow, unsettling strangeness to it. As I said, this is a thriller and the whole thing has taught pacing and fight scenes.The general story is entertainingly freaky. The duplicates, with their scary gold scissors and gloves on only one hand, are unsettling. And it isn't exactly like they're a mindless horde. Each one has a distinct, weird personality.The script is also pretty funny at points, but the humor never feels like it is detracting from the horror.The music by Michael Abels is also delightfully eerie. Be sure to check out the opening credits. The movie's main theme might make the list of most recognizable horror music. (It sounds a little like the main theme from Akira if you've seen that.)The entire cast, main and supporting, is great, including, surprisingly, comedian Tim Heidecker from Adult Swim's Tim and Eric. Winston Duke is fun as the family's goofy father and Lupita Nyongo excels in creepiness as the duplicate mother.The first act/setup is a little slow, but things run smoothly once the duplicates attack. The explanation to the duplicates' existence is a little vague. I mean the duplicate's motivations are made clear, but the logistical details of the whole thing leaves a lot of questions. Overall, i highly recommend this to people who are looking for something a little new in horror."
    },
    {
      "rating": "9",
      "text": "Maybe the ending could have been left without so much exposition but I had such a blast with this film that I didn't mind. Jordan Peele is becoming a must see director and Lupita Nyong'o is terrific. Overall a low 9 an A."
    },
    {
      "rating": "10",
      "text": "‘Us’ is a thought provoking psychological film that serves a genre defining moment. Like Hitchcock,Cronenberg, Carpenter, and other horror masters before him, Jordan Peele has created something unique that film bluffs will be discussing for years to come. Frightening, unnerving and utterly mesmerizing, ‘Us’ is the new modern horror. http://latetothegame.blog/2019/03/24/a-journey-into-darkness-a-review-of-the-film-us-2019/"
    },
    {
      "rating": "8",
      "text": "Una película que contiene mucha información, muy creativa. Por eso, a veces debe usar mucha exposición para evitar que el espectador se pierda con lo que está pasando. Las actuaciones son muy buenas, Lupita Nyong'o se roba el show en el papel(papeles) que lleva a cabo. Te deja tenso y también tiene buenos momentos de comedia, lo cual se puede esperar de algo hecho por Jordan Peele. Puede que el transfondo político presente en la pelicula no se logre captar para quienes no somos de Estados Unidos, pero eso no evita que se tenga una buena experiencia. Puede que requiera verla más de una vez ya que esta película es de esas que les puedes sacar información nueva cada vez que las ves. Buena. Un poco compleja pero buena"
    },
    {
      "rating": "10",
      "text": "Debo decir que esta increíble, la trama está muy bien hecha, a decir verdad ocurre en este caso que cuando piensas que las cosas están por volver a la normalidad te das cuenta de lo equivocado que estas ya que esta cinta no se detiene en ningún momento y luego ¡Boom! Una bofetada en el rostro, el reparto lo hace muy bien, pero su protagonista se lleva todos los aplausos y logras sentir empatía con ella.Imperdible, les volará la cabeza"
    },
    {
      "rating": "10",
      "text": "I want to address everyone saying that the plot is terrible to start. This was a brilliantly written film with much symbolism and metaphoric meaning. It's not a movie you can see once and say the plot is bad purely because u don't understand it. Lupita was absolutely amazing along with everyone else in the cast. When you really begin to think about the movie it all starts to make a lot of sense, and we can't just compare everything to Get Out, they're different movies with different meanings. The script was a great mix of comedy and horror giving the movie its own little flare, and everything in the script is there for a reason. But, overall this is really a masterpiece."
    },
    {
      "rating": "10",
      "text": "Movie was amazing, the best horror/suspense movie in 2019 by far, there was lots of humor and I really liked the movie. The end was pretty confusing but very interesting."
    },
    {
      "rating": "10",
      "text": "It’s one of those movies that needs time for you to digest it for you to truly appreciate how great it is. Needless to say when I left the movie I was confused about a lot. But I eventually got answers. And I haven’t been able to stop thinking about it since. If you ask me that’s a great movie."
    },
    {
      "rating": "8",
      "text": "Us is not as deep a horror film as you'd expect from Jordan Peele. There isn't really any social commentary, it is just old fashioned scares. A well made film that takes a different direction on the home-invasion genre, though at times it is slightly predictable."
    },
    {
      "rating": "9",
      "text": "Us was a lot of fun, a good blend of comedy and horror. Well the entire plot walked the line between cringe, comedy and horror. It's like a long episode of the Twilight Zone mixed with a Keeye & Peele sketch."
    },
    {
      "rating": "10",
      "text": "One of the most beautiful horror films I've ever seen and such an amazing score.  The ending ballet/fight scene is breathtaking."
    },
    {
      "rating": "8",
      "text": "Adelaide Wilson (Lupita Nyong'o) is haunted by an unresolved traumatic childhood event. She returns to the location of the incident with her family (Winston Duke, Shahadi Wright Joseph and Evan Alex) for a summer holiday. One night to their horror they find a group of doppelgängers outside their house determined to get in. Us really benefits from the less you know the better, avoid the reviews, avoid any online discussions and go see it. You won't be sorry, it's creepy, it's scary and it's well worth the ticket price.Now hopefully you'll have a better experience than I did at my local cinema house, horror audiences tend to be the most disruptive of cinema audiences unfortunately. No film is going to benefit from someone else's conversation but particularly a horror movie that relies on silence and atmosphere is going to suffer if you've got some absolute **** in the screen. So yes the experience was ruined for me a little, gotta hate my local cinema sometimes but I still managed to enjoy Us. From the opening scene you're reeled into this story, the impending sense of doom is constant, it's not just relying on endless jump scares, instead actually working at building up to a premise you can buy into and by the time the weird **** starts happening you can just sit back and let yourself be creeped out, scared and entertained. Maybe weird doesn't even do it justice, it's insane and although a little predictable at times and very in your face with the other film references I loved the idea for this story. The entire cast is giving it their all and more, double the roles and double the pressure. Lupita is exceptional, her performance will send chills down your spine. The casting could have easily ruined this film, it could have drifted into ridiculous but for the most part it didn't. It does try to get the humour into it yet for me that wasn't really working, it uses humour to defuse the tension and honestly I would have preferred if it didn't. Jordan Peele set the bar very high with Get Out, and to be fair it's a hard movie to follow. The mix of humour and horror worked very well in Get Out but for Us it just wasn't doing it for me. I would have preferred all horror and no attempt at humour. I'm looking forward to see what Jordan Peele will make next, he's creating horror movies that aren't an endless parade of jump scares with little to no story whose sole purpose is to make as much money as possible. Horror fans get yourselves to a cinema and see Us. Highly recommended."
    },
    {
      "rating": "8",
      "text": "One of the things that made Get Out special was Jordan Peele's blend of horror and comedy. Us continues in that vein, but to a different extent. In Get Out the two aspects worked in synergy to generate each other. Every moment comedy contributed to every uneasy feeling and vice versa. Us seems to work in a similar manner only instead of being co-dependent, they seem to bolster each other. It plays all it's cards with a straight face, even when the movie delves into complete absurd, goofy, and stupid territory, it never pauses to let the viewer become self-aware. Thus never getting sucked out of the experience. Us is a roller coaster ride of different genres that blend together for an experience that's an overall delight. My only gripe is that I think the script may have needed another glance over.*SPOILERS*The one thing I didn't like was the ending. The twist comes at a point where it doesn't matter anymore. Who cares at that point who was a doppleganger or not? None of these dopplegangers ever show any intention of switching places verbatim with their counterparts. If characters didn't know they were dopplegangers before and acted completely normal, why should that matter? The movie doesn't give us some reason to allude they're any more or less dangerous than the anyone else and it's never touched on this possibility before or after. There's just no motivation to b frightened by this sudden realization when this character has to our knowledge, been a normal person most of their lives and had no reason to be feared before the twist was revealed. It just feels very hammed in and like a decision that could've been easily cut or revealed at a point in time when it mattered in the movie or could've been given a consequence that had impact on the dynamic of the story."
    },
    {
      "rating": "10",
      "text": "Jordan Peele had a very difficult task with his sophomore feature after the smash hit that was \"Get Out.\" While \"Us\" may not be as concise as its predecessor, it's an absolute masterpiece that couldn't be more different. The cast is sublime; Lupita Nyong'o leads the pack with a tour-de-force performance that is bound to haunt you for at least a few weeks. The supporting cast is just as phenomenal: Winston Duke gives you most of the comedic relief, while Elisabeth Moss proves that she's one of the best actresses around at the moment. What she does with such limited screen time is astonishing. The movie is extremely funny, there will be moments where you laugh out loud. The score is superb, the editing is sharp (especially in one pivotal scene), and the cinematography is stunning. Peele's script and direction avoid the typical horror tropes and give us a story that is truly, well, messed up. The story will be etched into your mind for quite a while, and there is no doubt in my mind that you'll want to see it again. Have fun when you watch the movie, because it's such an entertaining ride."
    },
    {
      "rating": "1",
      "text": "You know the movie is bad when you have to go online to research it, the script is as weak as it can be on this budget and no one really cares about the family, no one really cares if they're black and no one really cares if they even die especially the boy with the mask, I mean who enjoys this movie and why? this was just bad, really really bad."
    },
    {
      "rating": "3",
      "text": "If you just want some cool kills, a couple good jokes, and some decent performances, you'll be happy with US. However, if you look past the surface you'll be faced with massive amounts of inconsistencies, character actions that make no logical or emotional sense, and plot holes so plentiful that Shia LaBeouf should have a cameo. Seriously, if someone can explain that Shamalan level of terrible twist(s) at the end in a way that makes sense, I would be extremely grateful."
    },
    {
      "rating": "2",
      "text": "bad movie, it does not make any sense, what it tells, what happens to the world, I almost fell asleep, at first I was laughing, but then I had more and more incongruities."
    },
    {
      "rating": "2",
      "text": "The Director sacrifices entertainment value to make some big statement about American society, which you could just as easily learn from reading a history book about American society. By the end of the film everything just gets so pretentious and ridiculous you're shaking your head in disbelief. Then, seeing as you're so dumbfounded as to what just happened you have to go online to read about it and then end up shaking your head even more. And don't tell me for a second anyone giving this film a great review understood what was going on symbolically while they watched it. Underneath this political garbage there's actually quite an intense horror, which is such a shame, because if Peele just concentrated on making an entertaining, believable and coherent film instead of ramming his political agenda down our throats, we'd walk away more entertained. Another thing that let it down was the script. Why are this family making jokes whilst they're being stalked and treating it all so light heartedly? It makes the mood so jarring. Everything was great with this film until you start having things 'explained,' and then it just gets farcical. Absolute nonsense."
    },
    {
      "rating": "9",
      "text": "Jordan Peele's Get Out is one of the most immaculately crafted directorial debuts of all time. It's a first-rate horror film that tackles relevant social and political issues in a manner that allows it to be both deep and entertaining. Those hoping to find the same kind of thematic timeliness here are not likely to be disappointed. They may, however, take issue with the delivery. Peele clearly has a lot on his mind and spreads himself too thin trying to cram it all into one movie. Us is littered with so many symbolic possibilities such as classism, race, and the dual hidden nature of humanity (among so much more) that it's hard to pull any sort of cohesive message from it at all. He manages to briefly touch on each of these topics, but never manages to make them come together in a way that actually says anything.Us may be unfocused subtext-wise, but it's only marginally less valuable because of it. The moment-to-moment action is so good that it's incredibly easy to overlook the contextual and narrative deficiencies, like how the plot twist is really just a big plot hole. To put it simply, I think Us is even more fun than Get Out.It's hard for me to not walk away from most horror-comedies disappointed as they tend to lean too far on one extreme more often than not. Us manages to be the rare exception that acts as the perfect marriage between the two genres. Both styles come off as complimentary, never serving to pull power away from the other. The film ends up being both hilarious and freaky as a result.It does a lot to help keep the fairly familiar home invasion/slasher action fresh, but the imaginative premise and excellent dual performance from Lupita Nyong'o that are the real heavy lifters here. In reference to the latter, I'm hearing a lot of people call her performance award worthy. I personally wouldn't go that far, but her work here is impressive. Especially as the creepy and menacing doppelganger.Peele also makes the most of the concept by once again crafting a slew of unforgettable, unsettling, and inventive scenarios and situations. I'm not just talking about the more violent or bizarre set pieces either. The smaller, more atmospheric touches matter just as much. Like the usage of Michael Abels' score for example. The songs pop up in the most unexpected of ways. Think you'll never listen to I Got 5 on It in the same way again? Try hearing N.W.A's F*ck tha Police without getting chills after this.Us isn't perfect and is nowhere near as focused as Get Out was. Yet, it's another standout work from a man who already proved himself to be one of the best talents in the genre after only one film. His second effort only bolsters that reputation. There's more to find fault with for sure, but that didn't stop from walking out of that theater having had a really good time."
    },
    {
      "rating": "7",
      "text": "An effective socio-political thriller looking at issues of class and privilegeThere's a detail to be found in writer/director Jordan Peele's second feature, Us, which gives you a good idea of the amount of thought that has gone into the film. In the opening scene, set in 1986, a young girl walks into a hall of mirrors, with a sign outside proclaiming \"Find yourself\", and a picture of a Native American above the door. Later in the film, now in the present day, the same hall of mirrors is seen, the same \"Find yourself\" is seen, but now the picture of the Native American has been replaced with a wizard. This change represents a meaningless and superficial attempt to tackle society's discomfort with its violent history, and this, in turn, speaks directly to one of the film's most salient themes - the US (or us) is a country built on violence, racism, and oppression, but as long as such things are swept under the carpet and no one talks about them, then there's no need to worry. Peele very much wants people to start talking about them.The film tells the story of the Wilson family - Adelaide (an astounding Lupita Nyong'o), Gabe (Winston Duke), Zora (Shahadi Wright Joseph) and Jason (Evan Alex) - who one night whilst vacationing in Santa Cruz are confronted by their violent doppelgängers.One of the problems with parsing the film is that so many of the socio-political themes are tied to who the doppelgängers are and what they want, that it's difficult to discuss them without spoilers. So, small spoiler ahead - the doppelgängers are called the Tethered; essentially, they are an underground-dwelling race of lookalikes. Through no fault of their own, they are deprived of the opportunities those above the surface have access to. The allegorical dimension couldn't be clearer; the film is a parable about class division. The Wilsons represent a middle-class all-American family; the Tethered represent the underclass, those without access to privileges, despite possessing the same capacity for happiness and success. This similarity is driven home when Adelaide asks Red (her Tethered) who they are, and Red answers (truthfully), \"we're Americans.\"In this sense, the film is very much about marginalisation. And this speaks to perhaps the film's most important point - the destitute and discriminated against can succeed just as much as everyone else if only they're given the opportunity to do so. This is also alluded to in the powerful final shot, which reveals that the Tethered have accomplished something which the surface dwellers once attempted but failed. The Tethered are the ignored, those swept under the rug of society, just like the alteration to the picture above the hall of mirrors. True, the deeper Peele explores the Tethered, the more insurmountable logistical problems are thrown up, and the further he strains credibility. However, this is not as detrimental as it may sound.Even more so than Get Out, Us is aesthetically gorgeous, with Mike Gioulakis's cinematography especially impressive. An illustrative scene features the rare use of a split diopter, a tool favoured by Brian De Palma that allows both foreground and background subjects to stay in focus simultaneously. Using it in a crucial scene towards the end of the film, it is the only time we see Adelaide and Red's faces in the same shot at the same time, with Red shot in BCU, facing away from Adelaide, who stands behind her.In terms of acting, Nyong'o's nuanced work as Adelaide and Red is a clinic in contrasts. Apart from their appearance, nothing about the two is similar; their posture, their facial expressions, how they talk, how they walk, how they react to things around them, how they use their hands. Adelaide, a former ballet dancer, is graceful and elegant, whereas Red is automaton-like, her movements almost staccato.As for problems, there are a few. Aside from the insurmountable practical issues with the Tethered, my biggest issue was that every time the Tethered want to kill someone, they do so immediately. However, they pass up multiple opportunities to kill the Wilsons, which is an irritating inconsistency. Additionally, the final twist doesn't really work, feeling like something of a twist for twist's sake that was never fully integrated into the narrative.These small problems notwithstanding, Us is an impressive film that improves on Get Out in almost every way, and which serves as a more complete artistic statement. The Tethers are monsters because they have been left with little choice other than to become monsters, imprisoned by a system they had no part in creating and in which they are not allowed to participate. In Get Out, Peele took a story of bodily possession and moulded it into a story of black/white relations. In Us, he demonstrates that oppression can easily cross racial boundaries. And the real horror of this is to be found in humanity's inhumanity to one another."
    },
    {
      "rating": "8",
      "text": "I really admire Jordan Peele because he is a comedic genius, a really intelligent guy and also a horror movie master. With 'Get Out' Jordan Peele had us talking non-stop about his movie, first because it was a really freaky and well-made 'horror' film by a comedian, but also because it was a really good movie. Following his global, critical, and Oscar-winning success that was 'Get Out,' it's hard to make a movie that would top his previous work, or even come close. That is the case with 'Us'. While 'Us' is still a really great piece of work from Jordan Peele, it is still clear that 'Get Out' is the better movie, mainly because of the concept, the plot, the twists, and the depth. 'Us' is a really creepy, well-done horror movie that more fits in the horror category than 'Get Out' does. It has scary scenes, jump scares, brutal deaths, a killer soundtrack, twists, and an overall terrifying concept. Spoiler: the concept of clones of yourself living beneath you that most of the time mimic your actions and one day come out to kill you so they don't have to mimic you anymore is kinda terrifying, especially with the way they look, move, and menacingly walk towards you then eventually stab you with scissors. We find out that everyone, not just the Wilsons family, has a \"tethered clone\" that is out to kill them when the tethered rise from the underground and kill their human forms. As the tethered people rise and brutally kill everyone they form a chain that is supposed to be \"Hands Across America\" which doesn't really make sense but it's still pretty creepy. I would say that once this movie steps back into reality it kinda loses its whole groove. This is because the movie, especially when the mysterious deaths of random people appear, and when the first family of tethered people attacks the Wilsons, 'Us' is really intense, scary, and has you on the edge of your seat, but in addition to that you know you're going to find out what it's all about. Once the story finishes the brutal killings of the tethered to most of the humans in America we assume, they start revealing backstory, explaining everything in a messy manner. First of all, when the family is out to kill the tethered people of themselves and their friend's family, it's totally awesome. The action is great, and it's enjoyable. Then once the climax and third act has begun the movie starts to explain every single bit of detail. The only tethered person that can speak, who is Lupita Nyong'o's tether, she explains it all to Lupita Nyong'o's main character. We find out that she has been planning this attack for 20 years ever since she encountered her at the hall of mirrors in 1986, but also how there are millions of people beneath the ground that are mimicking everyone's actions up above. Also earlier in the movie she explains how she was forced to do everything that her human self had done, have children with Winston Duke's character and give birth to two kids, two which she did not want to have. Pretty much she's suffered a lot, which is why the tethered are out to kill everyone. They have suffered enough. I think the whole idea is that Jordan Peele wanted to point out the privileges in everyone no matter what race you are but just being an American you have lots of privileges. In the end there are about 3 twists in like the last few minutes, leaving many unanswered questions, but for me the biggest plot hole was why sometimes the tethered mimic their actions up above but sometimes they didn't. There are scenes where they look straight at each other and mimic them but other scenes where they don't. I don't know if Jordan Peele left some plot holes as big as swiss cheese in the story or if he's just going to explain it all in the possible \"universe\" he has planned for us. I'm not sure. Overall, Us is actually a really good movie because it has stuck with me ever since I saw it and really has me thinking, while it has many plot holes."
    },
    {
      "rating": "9",
      "text": "Us is monumental for the horror genre, a piece of film making that understands itself down to the cells in its core. It’s bigger than anything we’ve seen the genre do for a long time, and inarguably not as universally pleasing as Peele’s prior feature. And yet, this is what makes Us such an immensely satisfying work. This is a fresh-faced director returning from an unmitigated triumph, proving to us he has more complex, challenging ideas behind him. Us lacks the surprise of Get Out, but makes up for it by being a denser, more ambitious feature. Comparing the two already feels like a losing battle. With Get Out, Peele showed up in this world and knocked us for six. With Us, he’s proved that he’s here to stay."
    },
    {
      "rating": "7",
      "text": "With great acting performances, genuinely funny moments, an interesting story, a good soundtrack and a surprising ending, Jordan Peele's \"Us\" is a future classic. While it may not be as good as his previous film, it's still worth seeing in the theater."
    },
    {
      "rating": "7",
      "text": "Having previously experienced a traumatic incident at the same location as a child Adelaide heads off to her family's beach house in Santa Cruz with her husband and their two children. Unfortunately for them her past is about to come back to haunt them...Us is a decent horror movie that provided plenty of chilling scenes, and even a few laughs, but compared to Jordan Peele's debut 'Get Out' it feels a little unoriginal and the intended social commentary isn't as effective."
    },
    {
      "rating": "8",
      "text": "Jordan Peele made a movie which is horror, comedy and drama with the great social comment. \"Us\" is something really extraordinary and of course it's not the movie for everybody, if someone want to watch just another horror, where doesn't have to think, well... it's not that kind of movie. Nonetheless everybody should give it a chance. Plus acting and music is something out of this world."
    },
    {
      "rating": "8",
      "text": "Just watched it in \"Worldmovieshd\" Site...Cannot describe how amazing it is..Visit Our \"WorldMoviesHd\"  Site to Watch new Hollywood Movies Online......"
    },
    {
      "rating": "8",
      "text": "With an amazing screenplay and a great plot, \"Us\" is a very stressful ride, filled with substance and creepy content, and not just cheap jump-scares. Lupita Nyong'o carries out her role (or shall I say, roles?) in complete perfection, which adds flavor to the eccentric film. A must-watch, you'll walk out of the theater with more questions than answers."
    }
  ],
  "recommendations": [
    "signs",
    "the_invisible_man",
    "the_lodge",
    "color_out_of_space",
    "a_cure_for_wellness",
    "a_quiet_place",
    "it_follows",
    "annabelle_comes_home",
    "the_fly",
    "the_killing_of_a_sacred_deer",
    "enemy",
    "ouija_origin_of_evil",
    "colossal",
    "coherence",
    "the_machinist",
    "lights_out",
    "it",
    "the_conjuring_2",
    "scary_stories_to_tell_in_the_dark",
    "a_quiet_place_part_ii",
    "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_",
    "ready_or_not",
    "the_conjuring_the_devil_made_me_do_it",
    "the_mothman_prophecies",
    "they_live"
  ]
}