{"id": 3852, "title": "USS Indianapolis: Men of Courage", "starring": ["Nicolas Cage", "Tom Sizemore"], "runtime": 128, "genre": ["Action", "War"], "description": "The harrowing true story of the crew of the USS Indianapolis, who were stranded in the Philippine Sea for five days after delivering the atomic weapons that would eventually end WWII. As they awaited rescue, they endured extreme thirst, hunger, and relentless shark attacks.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/aREeJV7avhlLnCicVG3fBjXiaW1.jpg", "categories": {"plot": 2.0, "acting": 2.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "2", "text": "It just seems like this movie wanted to be a cheap shark attack movie rather than an actual historical drama with some weight to it. Nick Cage gives it his best, Thomas Jane is merely on screen for a few minutes and some of the supporting cast gives it their best but this is just a really cheap and poorly made film with cheap Sharknado special effects and an overall cheap overall film. It just seems like they only wanted to skip the historical aspect of this film to make a generic shark movie. If you want a good adaption of this, watch Jaws and listen to Quint's monologue about the Indianapolis."}, {"rating": "5", "text": "This film is reasonably acceptable but it has its flaws. The explosions on board the ship are very amateurish and not a true reflection on what would be happening. The shark attacks were far from believable taking the film in to the fantastical rather than the believable. A particular shot depicts the poor quality of the direction, the shot involves one of the crew who is sat on the edge of the dinghy and witnesses an attack on a ship mate but all he does is dive in to the sea rather than taking the time to seem shocked at whats happening then going in to the sea. Overall this movie is watchable but does not do justice to Nicolas cage nor Tom sizemore as seasoned and respected actors, instead it puts the film in to the category of good when it could have been brilliant"}, {"rating": "3", "text": "Would have been a great movie if not for several discrepancies that writers & directors should have caught or known better. The movie would have been more realistic. 1- the black men using the phrase \"crackers\". The use of the word in reference to whites was not used until 1964 when it was coined in a Malcolm-X speech. 2- Reference to \"tampons\" - that official name was not used prior to LATE 1940's. They were simple called \"plugs\". 3- The phrase \"Cluster-F***\" was first coined in the 1960's by Ed Sanders and was originally coined as \"A Mongolian\" Cluster-F***. 4- The left-handed black man. In the 20's & 30's when he would have been educated, the left hand was commonly tied behind a child's back to force right-handedness. This would have been especially true of a black child.All small details, but anyone 50 or older would easily catch (as I did)."}, {"rating": "1", "text": "Actually cringe-worthy, starting with a script which seems not to know what to do with the true story, and provides dialogue that makes the already awful cast sound like they just dropped by from the local mall rather than weary combatants in a war 70 years ago. Nicholas Cage furrows his brow admirably, but is as phony as the second rate special effects. What a disgrace that Hollywood has managed to turn a true and tragic incident into a C grade TV movie with the production value of 'Sharknado', and at least that one was intentionally humorous."}, {"rating": "4", "text": "Увы, но кроме эпичной музыки от Лорена Эйкема ленту больше не за что хвалить.Том Сайзмор переигрывает, Николас Кейдж недоигрывает, драматичные моменты вышли смехотворным фарсом, а режиссёр... Стоп, а он есть?"}], "recommendations": ["midway", "the_great_wall", "pearl_harbor", "red_tails", "armageddon", "transformers_the_last_knight", "king_kong", "geostorm", "independence_day_resurgence", "war_of_the_worlds", "immortals", "gravity", "greyhound", "battleship", "pompeii", "poseidon", "dunkirk", "the_last_airbender", "300_rise_of_an_empire", "sanctum", "into_the_storm", "blackhat", "jonah_hex", "master_and_commander_the_far_side_of_the_world", "the_purge_election_year"]}