{"id": 1823, "title": "V for Vendetta", "starring": ["Natalie Portman", "Hugo Weaving"], "runtime": 132, "genre": ["Action", "Thriller", "Science Fiction"], "description": "In a world in which Great Britain has become a fascist state, a masked vigilante known only as “V” conducts guerrilla warfare against the oppressive British government. When V rescues a young woman from the secret police, he finds in her an ally with whom he can continue his fight to free the people of Britain.", "releaseYear": "2006", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/1avD1JeaRiJX5M4ahPdZPypGoGN.jpg", "categories": {"plot": 7.681818181818182, "acting": 7.3125, "ending": 5.333333333333333, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 4.5, "action": 5.764705882352941}, "reviews": [{"rating": "8", "text": "V for Vendetta feels like a personal vendetta against today's government but one can not help admire its deeply thought characters, great visuals and intriguing storyline & premise."}, {"rating": "10", "text": "One of the best films ive seen in a ong time, the Guy Fawkes mask surprisingly never gets old throughout the movie, V's character is original even though he echoes many characters throughout history, very fun to imagine and not hard to believe, gets a 10 without a doubt."}, {"rating": "10", "text": "Awesome!!!"}, {"rating": "10", "text": "this is a great movie to see."}, {"rating": "10", "text": "This is by far the most down to the point movie I have watched."}, {"rating": "10", "text": "This was a readlly good movie! i recommend it to everyone!"}, {"rating": "10", "text": "Acting, plot, and story are excellent. Ending tops it off perfectly. Couldn't have asked for more..."}, {"rating": "10", "text": "You people are crazy. Whether some people believe it or not, movies affect and move people. When I get done watching what I believe to be a great movie, I get a great feeling after watching it. And that's what I felt after this one. One of the best stories I've seen out of Hollywood so far. LOVE IT!"}, {"rating": "10", "text": "The language that V employs in the movie alone makes it worth the watch. It is definently one of the best movies I have seen made in a long while."}, {"rating": "8", "text": "I love it. I love all of you. I wonder what is it people go for in movies anymore. We complain about acting, about facts, about realism. Then we complain this or that is not true, or this and that is ripped off that guy's book. HEY. Let me remind you something real quick, boys. A movie isn't reality. V for Vendetta is an attempt at reproducing a book's story into visual interest. Had they actually made the entire book into a movie, you'd not have two hours on your hands, but perhaps SIX full hours. [***SPOILERS***] Many of the events were crossed out to squeeze the movie into something as short as possible, while remaining entertaining. What REALLY MATTERED about this movie's success, was that it STAYED loyal to its origins. Not that it entered the norms of literacy and whatever other crap some of you may complain about. In terms of cinematography, this movie blends in together theatrical pleasure and drama perfectly well. You might as well feel that most scenes are shot much like a Shakespearian play. (I'm gonna get flamed for this one in the future) You may be called simplistic by some pseudo-intellectual people for liking this movie. But what counts is not the quantity of references you may attach to it. It's the quality of them. The movie stayed true to the book in many facts, aside that it replaced the past of the book with today. Instead of the Cold War ending with general nuclear warfare, it was America's war on Iraq which spread out too much for its own good. It's not very likely to happen, but the movie reflects \"what ifs\". Other people may even complain about not understanding a thing that is said. Those people just are looking for a typical action movie, where nearly no acting is given and more gunning and killing occurs. V justified every fighting sequence, and made them count into the storyline. Now, remember dear children of cinematography: You're not looking for pure masterpieces when watching a movie. You're looking for entertainment and something of VISUAL and AUDITIVE quality. You may discuss politics when watching the news, otherwise you are just messing with the useless."}, {"rating": "7", "text": "I don't know the original graphic novel so I can't determine how faithful the adaptation is. As a genre film, with a certain 1984 flavor, it works quietly and well, although not to be kept in memory forever."}, {"rating": "10", "text": "This is not just an action movie, it is a part of history.One of the things that I love about this movie is the script, the characters interacts perfectly with each other and everything that V says it's poetry.It's sad to say this, but even in 2020, people should watch and understand, movies like this one to really understand what is like living in that kind of situations, and to not make totalitarianism live again."}, {"rating": "10", "text": "Excellent throughout every showing. I have seen this movie five times in the years since its release, and each and every time I've taken something new away from it. Extremely well done."}, {"rating": "10", "text": "Incredible. Moving, and sticks with you. Crazy how relevant this is with today’s American politics. A must see for sure!"}, {"rating": "10", "text": "A very beautiful movie withUnique characterizations.I fell in love with this.A complete political and very clever film with a story full of excitement.I enjoyed every moment of the movie and all the scenes in this movie.The character 《V》 of each of his words and each of his sentences is an extraordinary fact.The dialogues of all the characters are greatBelieve me, I can not talk much about it. If you do not see it, believe me, you have lost a great pleasure.-VPeople should not be afraid of their government, government should be afraid of their people"}, {"rating": "10", "text": "Excellent Movie, Best message and a peak of what may be a visible future for America. Watch it twice."}, {"rating": "8", "text": "Now, \"V for Vendetta\" here is a great example of how graphic novel-based books should be when made into a movie. The story is deeply involved into the movie as well as the characters and their significance. Natalie Portman especially does a exceptional, outstanding performance as V's girlfriend (?). Must watch!!!"}, {"rating": "10", "text": "Remember The 5th Of NovemberThis Film Pretty Much Is A Masterpiece From Beginning To End."}, {"rating": "8", "text": "This blast of subversive pop cinema is a thrill ride from beginning to end, and probably stands as the best film adaptation of all Alan Moore's work. However, the production is both propelled and impaired by the Wachowski Brothers' influence - the stylized violence is bound to be campy in a few years' time and the dramatic storyline is carried too much by actors with the same serious deadpan British accent (hearing just audio, I doubt I'd be able to differentiate the voices.) Still, in the end, the movie gives us exactly what we want - controversy, an awesome antihero, and a huge, giant explosion."}, {"rating": "8", "text": "Superb acting, really awesome lines, great action, and an effective political message. what more can you ask for?? This was really well done and there were scenes when i was like \"yes!\""}, {"rating": "7", "text": "V for Vendetta I would describe as 'The best F*** the government' film. It was not another fantasy-super hero movie with super predictable storyline - saving everybody, while a great love flares and of course - happy ending. Decent movie."}, {"rating": "10", "text": "this film is really underrated. the best comic book movie of 2006 and one of the best film in 2006"}, {"rating": "10", "text": "I thought this film was fantastic.I think that the way Hugo Weaving portrayed V without ever showing his face was a great testament to his ability as actor and Natalie Portman was great as well.The tone and setting is great as well and as a fan of dystopian film and literature, this film hooked me straight away."}, {"rating": "2", "text": "An all-around dreadful film. Terrible dialogue, subpar acting, wrapped in a story filled with absurd, juvenile politics with obvious and obligatory nods to the present-day \"War on Terror\" for easily amused critics to fawn over. Provoked no emotional or visceral reaction from me, other than laughter at its banality, and when it ended, astonishment at how such garbage could be so widely praised. If you're out of high school, and like good films, pass on this."}, {"rating": "2", "text": "A waste of time. Tries too many directions at once: arthouse, action entertainment, and moral message. Without any clear direction it failed to make sense or even entertain. I can give up the money for a rental, but I felt robbed of my time."}, {"rating": "0", "text": "V for Very Very Bad Film - As a fan of the comic, my opinion might be considered biased, but the FIVE people I took with me to the cinema had never heard of Alan Moore or V for Vendetta and we all roundly thought that this film was utterly rubbish. Don't be fooled by the trailer, there isn't enough action to provide half-decent entertainment. Instead the Wachowski Boys are trying their damnedest to be intelligent and they just make everybody sound stupid. There is a fine line between poking fun at the British and being completely patronizing. Maybe that can explain the good reviews of this film over on that side of the Atlantic, but I can't explain the good reviews of it that we've had over here. There is nothing to recommend this film apart from a mildly amusing Benny Hill type sketch in the middle. Utterly cringeworthy. I was embarrassed that I had recommended going to see it."}, {"rating": "8", "text": "This has to be one of the best movies I\"ve seen this year [so far]. It's great when an action movie, well, doesn't use action to move the story. Hugo Weaving once again amazes me at his ability to act any part, and he made V a very likeable character. Natalie Portman was pretty good, I guess. But as I mentioned earlier about an action movie that doesn't use action to move the plot, V for Vendetta ending action was executed perfectly. It also showed that V isn't perfect. I always love when a movie gives me the shivers. And that makes a great movie."}, {"rating": "2", "text": "Very dissapointed, most of the Anti-Bush down with America crowd will resonate with it and give it high marks, I personally thought it was rubbish, I was nodding off. One or two CGI scenes that were done well, the rest was just pretty poor. Too bad, I was hoping it would be much better."}, {"rating": "7", "text": "I thought the movie was a little bland. It had an interesting story and some cool ideas, but I thought the execution was off. Still worth seeing though."}, {"rating": "8", "text": "Blimey, there's some scathing comments there. I really enjoyed this film, maybe more so because I treated it as a work of fiction and didn't draw comparisons between it and the real world. A good storyline, decent enough acting, some fine visuals and some good plot twists made good viewing."}, {"rating": "5", "text": "Not bad, not good. I appreciate that the filmmakers tried to tackle some social/political points, but they focus on ideas that have been studied for many years. The plot, action and subtext are derivative of other films and books. V is an interesting character, though I don't know why he has to carve his initials like some others I've seen before...maybe we should call him Voro. Also, sort of boring for an action movie. Nice try though."}, {"rating": "7", "text": "Decent movie, but it's slow pace will mean many might not like it!"}, {"rating": "10", "text": "The best film since Forty Year Old Virgin."}, {"rating": "5", "text": "Politics really shouldn't even come into the equation. This is about rating a film. Was it well made? And the measure of that is whether people are entertained. Obviously, many people were, and a few were not. I enjoyed certain parts of the film, excited to see the characters and events from one of my favorite books. I try to distance myself from the source material when I see an adaptation, but I couldn't help thinking all the way through the film that it would've been so much better if they'd left a lot of things as they were. I agree that this was billed too much as an action film, and its really not. And that's not a bad thing. But to me, knowing the original text, I was dissapointed in the actual content and dialogue of the film. The \"message\" is not delivered in anywhere near as intelligent a fashion as done by Alan Moore. Few can match his talent. I tried to view the film as a piece by itself, but while it wasn't neccesarily a bad film, it just didn't do it for me. The only acting that really bothered me was John Hurt, chewing the misc en scenery. For the record, this is the director's first film. Someone on here called it his worst film yet. How can that be if its the first one he's made? I also agree with the comment that some scenes were \"Matrixy.\" If you were at all moved by this film, I urge you to go read the original graphic novel, and see how much more intense and meaningfull it is. All that being said, and while I hesitate to bring up the political aspect, it must be addressed. I felt it was a little too obvious that they were trying to make references to our current political atmosphere. And that cheapens the original story. I know very little about Margaret Thatcher, but I don't believe that Alan Moore shoved any references down people's throats. This movie also might've been much better if it had been made pre-9/11, or much further in the future. Nothing that comes out these days can speak about the government or terrorists without being labeled as a statement on politics. Lastly, why are there so many comments from the editor being stuck into our own reviews? They seem to be conveying the editor's own opinion of our reviews, when this is supposed to be our way of openly expressing our opinion. Just edit. Don't give us your opinion on our thoughts. Thank you. [Ed: Well said.]"}, {"rating": "4", "text": "Boring, long, and yet again proof that the Wachowski's are terrible writters who somehow fluked into the first Matrix movie. If you like little to no action, and dialog that is all exposition then this... still would be a bad movie."}, {"rating": "10", "text": "I totally enjoyed this movie. Also frightened me as it should frighten everyone. I see evidence every day of our society moving closer and closer to this very situation. Too real. I think this movie accomplished what it set out to do."}, {"rating": "4", "text": "I give it credit for expressing its own art. Nonetheless it remains a political thriller without all that stressful intrigue and zing."}, {"rating": "0", "text": "The film won"}, {"rating": "5", "text": "An enjoyable popcorn movie with a very weak, sad, and ultimately unfulfilling story. This is a movie that cant be deemed important or deeper than it claims to be unless you are 15 or younger. Some good acting from Portman and a very suttle Stphen Rea. John Hurt is over the top creepy. Weaving is dashing although you never get to see him, but I couldnt help feeling that this movie was trying to make a statement. I ssues about the Koran and repression of gays, etc.. But how do they answer these problems? By blowing up buildings and killing people! Not only that but once the biuldings are blown up and people are killed(many through out the film) where do they go from there? A question this movie fails to answer and chooses to ignore. I couldnt help thinking how Osama bin Laden would love this movie's dim message and how Ghandi and Martin Luther King Jr. would be rolling in their graves. Go see it if you want to have to be entertained for a think free price, but if you are looking for a moral lesson on violence while be engaged visually, check out Munich or A History of Violence."}, {"rating": "0", "text": "Just got back from V for Vendetta. Bad bad acting (Portman's pretentious accent sucked) or the boring buildup; the really dull action scenes or the one sided cliched dialogue. And it ran for like three hours. Not to mention HUGE plot holes. At the end of it all I was completely disoriented. What's with the Tchaikovsky music, or the TV infatuation? Or the overuse of 'bollocks' ? If there was *any* pseudo philosophical symbolism hidden in the movie someplace, they did not make an effort to get the message out."}, {"rating": "0", "text": "The worst thing about this film is that it makes the ideals of Anarchism and the Libertarian-Left sound completely stupid."}, {"rating": "1", "text": "Argh! Forget the politics! This simply isn't a very good film!"}, {"rating": "0", "text": "I feel this movie skimmed the surface of several American political issues without explanation or justification of any of them. I perceived blame being assigned to the US for terrorism and tyranny. Had this movie's political agenda been properly billed I would have never given my money for such psycho babble politics. One of the \"good guys\" had a nazi flag with the Koran in his secret room. This movie was pure garbage!"}, {"rating": "4", "text": "Makes christians look like crazy right wing fundlementalists. Christians have been repressed to. Sure they don't agree with some of the things in this world but they're not as narrow minded as portrayed."}, {"rating": "5", "text": "Entertaining? Yes. Smart? No. I was hoping that this movie would mix the two, but alas, it didn't. I'm glad I saw it, because it was a feast for the eyes. But not for the brain. It's thoughts are actually quite shallow, though at times exciting. If you want to see it, watch it in the theatre, but I wouldn't waste the time renting it unless you have a really sweet sound system and TV."}, {"rating": "0", "text": "I'm dumber for having seen this movie. Incoherent, lacking in style, over-wrought pretentious dialogue. Like a pissed off teenager who can't get laid wrote it. Geez."}, {"rating": "2", "text": "Look. Alan Moore had his name taken off the credits for a reason. The original comic is a magnificent piece of subversive, political and social commentary; this film is cynical action fodder, pandering to the feeble idea that we the public are all 'good people' who rise up when oppressed by the forces of evil. Give me a break. Moore tackled issues of complicity and how fascism can be taken as a viable system of government. He created a piece of work that demmands introspection from its audience. This film removes any value from its original source and replaces it with another empty piece of 'entertainment', peddling the usual nonsense that 'good people' (us) only let bad, destructive people into power when they have been tricked. This film is a cop out on every level."}, {"rating": "0", "text": "a quixotic piece of orwellian gargage. watching this movie is like eating bananas without peeling them."}, {"rating": "2", "text": "This is a simple movie for children, posing as \"art\". It takes more than a 130 minute running time to make a movie compelling. You'd have thought that after the dreadful Matrix sequels, the Wachowski brothers would have realised that."}, {"rating": "3", "text": "Decent acting. Sophomoric attempt at political philosophy. Actually, just plain stupid when all said and done."}], "recommendations": ["chappie", "equilibrium", "the_darkest_minds", "antebellum", "the_book_of_eli", "jarhead", "cloud_atlas", "morbius", "the_butterfly_effect", "perfume_the_story_of_a_murderer", "blade_of_the_47_ronin", "bright", "sucker_punch", "apocalypto", "tomorrowland", "tinker_tailor_soldier_spy", "they_live", "what_happened_to_monday", "fight_club", "tenet", "ben_hur", "the_lobster", "three_kings", "300", "inglourious_basterds"]}