{
  "id": 3782,
  "title": "Vacancy",
  "starring": [
    "Kate Beckinsale",
    "Luke Wilson"
  ],
  "runtime": 85,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "A young married couple becomes stranded at an isolated motel and find hidden video cameras in their room. They realize that unless they escape, they'll be the next victims of a snuff film.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1DdfXaXzi1sJysZ800GOUAwlLR4.jpg",
  "categories": {
    "plot": 6.2,
    "acting": 5.555555555555555,
    "ending": 6.5,
    "soundtrack": 4.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.8
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Vacancy is an intense thriller with stylish scares and visuals. Vacancy will surprise you and captivate\ryou with its refreshing style and plot. One of the best thrillers in years."
    },
    {
      "rating": "9",
      "text": "The advertising strategy for the film made use of the Internet as well as a toll-free phone number. The number was made to sound as if one is actually calling the Pinewood Motel. In the background, screaming can be heard accompanying the voice of the proprietor, who informs callers about \"slashing\" prices and the \"killer\" deals that the motel has, if it has a vacancy. The voice of the proprietor is none other than Frank Whaley's. The toll free phone number for the ad was 1-888-9-VACANCY (1-888-982-22629). The toll-free phone number is no longer valid."
    },
    {
      "rating": "9",
      "text": "An amazing film. Truly a great, suspenseful thriller from the time the banging started to the end of the movie. This has to be the best thriller movie I have ever seen. Every second of the film is sick and has you on the edge of your seat. I liked how the film was not long, and yet still managed to gradually take it's time to develop into a nail-biting thriller. Really, really impressed with this film, and recommend anyone to watch it if you haven't already. By far the best part of the film is when they see the snuff films, then lights go out, and it goes on like that for a few seconds. I do not see how realistic the movie is or the character's choices in the film can impact on how good the film was. A movie is supposed to be for entertainment, whether it's realistic or not doesn't matter as it's a movie, not real life."
    },
    {
      "rating": "9",
      "text": "The scene where David (Luke Wilson) and Amy's (Kate Beckinsale's) BMW car crashes into the motel was done as a practical stunt, not with computer effects."
    },
    {
      "rating": "9",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》●》■》■》■》■》■》■》■"
    },
    {
      "rating": "9",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "9",
      "text": "Igguugihhihiihfygjutewccsadghjkoiyhmbvcznnbbvvccxxbjkkhh⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙•••••¤¤¤⊙⊙⊙°°°⊙⊙¡¡¡¡¡¿¿¿¿¿¿{}[]()!?,.."
    },
    {
      "rating": "9",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;::;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "9",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"
    },
    {
      "rating": "9",
      "text": "+=+=+=+=+=+÷+÷+÷÷÷÷÷÷+÷+÷+÷+÷+÷+÷+÷+÷÷+÷+÷+÷+÷×××÷+÷+÷++■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"
    },
    {
      "rating": "9",
      "text": "¤¡¤¡¤¡¤¡¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤•¡•¡•¡•¡°¡•¡•¡°¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡••"
    },
    {
      "rating": "9",
      "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"
    },
    {
      "rating": "9",
      "text": "Vacancy is an unsettling horror thriller about a couple who stay at a motel in the middle of nowhere and discover they are about to be murdered and the murderers are going to tape their murder while it is happening. Luke Wilson & Kate Beckinsale provide top notch performances in this stylish horror thriller. The movie is well shot, acted, has stimulating action scenes and nifty twists as well. Vacancy is perfect for a rainy night or if you want to watch an original, clever thriller with your friend, loved one or family member."
    },
    {
      "rating": "9",
      "text": "●●●●●●●●●●●●●●●●●▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪▪....■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡¡.."
    },
    {
      "rating": "8",
      "text": "Hungarian director Nimród Antal’s debut was screened at the Prix Un Certain Regard of the Cannes Film Festival 2003 and with the suspense horror Vacancy, he establishes himself as a hope for future European independent cinema. This rather short Hitchock homage does have an A-list cast, including Kate Beckinsale, Luke Wilson, and Frank Whaley, but as we’ve seen well enough in the last couple of years, that alone doesn’t make for a good horror movie. Vacancy proves otherwise though, and impresses with never-ending thrill, creditable and genuine acting, and a completely rational story.\rAfter the nicely designed title sequence, the movie commences without any digressions, but it will take some time to completely grasp the situation. The screenplay deftly includes the needed information into the everyday dialogues of the two protagonists and knows just how much exposition is enough. Through that, the actual horror can quickly kick in and after not even 20 minutes, you’ll already have goosebumps and hands tied to the chair. The macabre game can begin and a difficult to watch assemblage of snuff films is followed by a nocturnal chase through an isolated motel, which doesn’t always omit clichés but conceals them through the director’s original and unpredictable ideas. However, the greatest asset stays the almost unendurable suspense, which makes for such an uncomfortable viewing that on one side, you’ll want to quit the movie and on the other, keeps you hooked in front of the TV.\rThe movie completely lays down all horror stereotypes in its final act by staging it in sunlight, and it may for a moment seem that it degenerates into the bizarre. Fortunately, that’s not the case, and Antal stirs up a mysterious open end that is without equal. As the credits start in the style of the title sequence, you’ll not only be relieved to stop shivering, but also exhilarated to have ultimately seen a really great horror movie."
    },
    {
      "rating": "9",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙________________________________________________________"
    },
    {
      "rating": "9",
      "text": "________________________________♤♡◇♧♤♡♡◇◇♧♤♡◇♧♡》》》》》》》》》》》》》》》》》》▪○●●□■▪○●□■▪○●●□°°"
    },
    {
      "rating": "9",
      "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》》°°》°》》°°》°°@&@&@&@&@&@&@&@&@&@&@&@&@&@&@&@@:@:@;@:@;@:@;:@;@;@;@;;@"
    },
    {
      "rating": "9",
      "text": "{}{}{}{}{}{}{}{}{}{}{}{}{}[][][][][][][][][][][][][][][]!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "9",
      "text": "□□□□□□□□□□□□■■■■■■■■■■■■■◇◇◇◇◇◇◇◇*****************************************************"
    },
    {
      "rating": "10",
      "text": "To put it plain and simple, This is horror. Vacancy not only keeps you on the edge of your seat but it also manages to suck you in and keep you interested every step of the way. I loved it."
    },
    {
      "rating": "9",
      "text": "&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;&;⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "9",
      "text": "♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"
    },
    {
      "rating": "9",
      "text": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》"
    },
    {
      "rating": "6",
      "text": "Vacancy is horrific, as well as scary, violent, and mysterious. It was okay, I'll say that. I had no complaints with this film but to me-- this film was just okay."
    },
    {
      "rating": "8",
      "text": "Was actually pretty good. The cast was solid, The story was interesting. Its a good suspensful movie that is well worth the watch imo. I really liked it."
    },
    {
      "rating": "5",
      "text": "I honestly want to rate it higher, but I can not! This movie was a totally average thriller, that is not really better than any other boring, ''we have seen this before'' horror/thrillers. The actors were not that bad I have to mention that, but they were nothing outstanding...Maybe a rent worthy survival/slasher."
    },
    {
      "rating": "6",
      "text": "Good acting, good pacing, well filmed and an interesting idea. Not that memorable though, I mean its not the kind of film you're gonna watch over and over again, or even twice. I'm only watching it again now as it happens to be on TV and I'm wondering why it doesn't blow me away. I think it's because it's so far fetched. View to a kill's starting now on another channel and I'll be switching over. Vacancy is THAT kind of movie"
    },
    {
      "rating": "8",
      "text": "The movie vacancy is not bad but i was expecting better because there was not enough action and when there was action Luke Wilson and Kate Beckinsale were always trying to escape.But i like it"
    },
    {
      "rating": "5",
      "text": "Must resist 'Psycho' motel references. *cough* Oh, hi. I didn't see you there. Anywayz, 'Vacancy' is... well, rather average. It's not so much of a bad film as it is pretty boring. It neither expands the genre nor offers anything new or fresh. The acting performances were alright (at best) but these lead actors weren't exactly believable as a married couple which repelled me from further from enjoying the movie. The production values are cheap but that simply might have been the intention to further point out that this isn't the Hilton Hotel by any stretch."
    },
    {
      "rating": "2",
      "text": "Unhappy couple get lost taking a short cut, car breaks down, stay at a motel in the middle of nowhere, strange owner, etcIt sort of tries to be a bit Hitchcock-esque with the torture genre thrown in but just comes out as a predictable, cliched nonsense of a film which is very thin on ideas & originality.Shame really because I quite like Luke Wilson."
    },
    {
      "rating": "7",
      "text": "Very good horror movie to watch!!!  Vacancy not only keeps you on the edge of your seat but it also manages to suck you in and keep you interested every step of the way. I loved it."
    },
    {
      "rating": "10",
      "text": "I'm amazed!!! This movie is awesome. Really scary and the actors (Luke & Kate) did a great job!"
    },
    {
      "rating": "9",
      "text": "I loved it I absolutley loved it! It was great. A classical suspense/thriller that had me trying to bite my nails and want to scream at the screen for someone doing something dumb. Of course although the movie was good there were alot of cliche mistakes made that although they were cliche made the movie that much more interesting. But generallyu speaking I loved the movie. The ending was horrible, I dint agree with the way the movie ended simpley because there was no action, no hand moving after a supposed kill, no karma for a stupid move."
    },
    {
      "rating": "2",
      "text": "Horrible movie, i was expecting  somethin scary , but spiderman actually seems more scary then this, the end is like so horrible this movide sucks @$$ big time."
    },
    {
      "rating": "1",
      "text": "This bootleg piece of sh.t.damn last night i took a sh.. and i think vacancy came out of my ass ....literally..out of my ass....luke(no one cares about me because i suck at acting) wilson cant act worth anything...kate beckinsale...looks like a beatup house wife.who in fact gets beat up..for not making din din...it should of been straight to sci fi."
    },
    {
      "rating": "10",
      "text": "I can't understand why this movie are gonna to be a big boxoffice flop??? Too many thrillers in theaters. I just saw Fracture and this one last weekend and I liked more Vacancy."
    },
    {
      "rating": "10",
      "text": "My wife and I loved it! And no gore to boot. Great acting, and very relatable characters. Unmarried twenty somethings might hate this film, though."
    },
    {
      "rating": "9",
      "text": "Great horror. Sometimes little B-movie miracle happens. Just don't take it seriously and enjoy beautiful beckinsale and surprisingly good wilson in this frightening and entertaining flick. More quality horrors please."
    },
    {
      "rating": "7",
      "text": "Good scary flick, at a time when too much that passes for a nail-biter acts more like a manicure. Hold somebody's hand."
    },
    {
      "rating": "8",
      "text": "For anybody who's been lucky(well...) enough to see the faux-documentary \"Man Bites Dog\", will recognize the snuff films David(Luke Wilson) and Amy(Kate Beckinsale) discover as nihilistic examples of neorealism; and its maker, a deranged auteur(he has an editing bay), who like Vittorio DeSica(\"The Bicycle Thief\", \"Umberto D.) or any filmmaker with a realist aesthetic, utilitzes real people and real locations in an economically depressed area. \"Vacancy\" questions the motivations of a filmmaker that seems to fetishize violence(like Eli Roth; you wonder about that guy) and the audiences who derive pleasure from watching innocent people being put under constant sadistic duress. Seen through Mason's cameras, Amy and David are the unenvied stars of a schlocky exploitation film like \"The Texas Chainsaw Massacre\". Like Remy Belvaux and Andre Bonzel's 1992 masterpiece(\"C'est arrive pres des chez vous\", or \"Man Bites Dog\"), \"Vacancy\" puts you in the shoes of Mason(Frank Whaley), who is watching one of his \"films\" in another room when the bickering couple rings his motel bell. If you were watching the very same film(out of the context of \"Vacancy\"), you'd praise the director for its realism. \"Man Bites Dog\" was a seminal film about the darker side of vouyerism because the Belgian production estranged audiences from the hurtful acts against humanity we've been conditioned to dismiss as \"movie violence\", as opposed to the real violence that we'd normally revile. It asked us if there's something unnatural about watching people getting killed for entertainment. \"Vacancy\" soft-pedals the faux-documentary's ideas, but if you equate the realism of the snuff films with the potential fate of the Foxs, the horror movie cliches they exhibit seem more like primal fear instead of a stock character's imbecility."
    },
    {
      "rating": "10",
      "text": "Guys. You have to go in cinema and watch Vacancy!!! They released so many terrible horror movies (Hitcher, Black Christmas, Dead Silence, Messengers, Reaping) in the last months that I didn't expect to see a good horror movie in future. But Vacancy is just amazing! It's a bit different from the trailer. This is a scary movie. Thanks Nimrod Antal for this awesome movie!"
    },
    {
      "rating": "8",
      "text": "Kept me on the edge of my seat....very entertaining."
    },
    {
      "rating": "3",
      "text": "No way, this movie really sucked!!! its boring and not entertaining at all, no way, cant believe that this kind of movies are still going out in theaters, these ones should be directly to dvd!!!! Worst Movie Ever!!!!"
    },
    {
      "rating": "5",
      "text": "Vacancy wasn't the best horror movie I've seen and its not the worst. Its unoriginal plotline and its predictable events rarely keep me in tact."
    },
    {
      "rating": "4",
      "text": "This movie sucked. No wonder they pumped up the advertising. Not scary. Not innovative. Not believable. Go see Fracture instead."
    },
    {
      "rating": "8",
      "text": "A surprisingly effective horror/thriller. The atmosphere is excellent, the movie is almost always suspenseful, the villain is very creepy, the movie does NOT rely on jump scares or excessive blood or gore...it's just a great, suspenseful horror movie. I'm glad the studio kept it with an R-rating. Hopefully it will find success on DVD. (After a relatively disappointing opening weekend.)"
    },
    {
      "rating": "3",
      "text": "There are 3 single word thrillers out (Disturbia, Fracture, and Vacancy) and I ended up seeing the wrong one. To highlight the positives of the movie - the characters are very realistic and acted extremely well by all. Whaley does a fantastic job being the modern day Bates (with his own twist), while Wilson does wonders as being a scorn soon-to-be ex husband to Beckingsdale who, to her own credit, hides her beauty behind her persona in the film. The plot...played out. The story....played out. The thrills...there were a few...but played out. you know when they are coming and I think it's your mind that makes you jump in anticipation over the actual scare itself. Gore-aversed folks - you need not worry, there isn't any. The ending was horrible. I just think they threw these rats in a maze, shook it up, and instead of letting them really struggle through to find the end, they paved the way for them. It grew to be predictable and incredibly cheesy. Why is Hollywood so afraid of taking chances?! This film sure doesn't take any for sure!!!!!!!!!! Time for me to check out the higher rated Fracture and Disturbia next."
    },
    {
      "rating": "4",
      "text": "Woe be to any thriller (and its audience) where the biggest and most effective thrills by far appear in the opening and closing credits sequences! By themselves, they're quite marvelous, actually, with the listed names of everyone involved acting as puzzle pieces in a design that suggests a collaboration between Saul Bass and the person who designed the topiary maze in Stanley Kubrick's The Shining, scored by Paul Henslinger as though his doctor told him that this would be the last music he'd ever compose, and, by golly, he's gonna make the most of it! Given how torpid, predictable and monotonous most of what follows turns out to be, it's hard to decide whether to congratulate those involved with the credits or sue them for breach of promise. The plot involves a troubled married couple (dealing with a recent tragedy, but details are deliberately left vague) who, experiencing that good old familiar car trouble that acts as such a reliable fulcrum in movies like this, check into a (literally) ratty old motel that, due to the manager's predilection for filming snuff movies starring previous customers, they might not be able to check out of. The most interesting filmmaking decision involved with Vacancy is that the time period is extremely difficult to place: for reasons obvious to the plot, no cell phones are employed; the costumes and cars don't tell you much; the radio looks old enough to have played Tommy Dorsey's first Number One hit; the TV Guide in the room is the size and shape of a Reader's Digest, just as God intended, and the technology used in making the snuff films is video, not DVD. (And given just how dusty and decrepit the motel is--it makes the Bates look like the Fountainbleu--it wouldn't surprise me to know that the videos were Beta, not VHS!) The heroes, Luke Wilson (by far the more bearable of the Wilson brothers and hence far less of a box office draw than Owen) and Kate Beckinsale (who was supposed to become 2001's \"It Girl\" following the release of Pearl Harbor, but instead was reduced last year to playing Adam Sandler's inflatable doll in Click) are quite good in their early sequences, effectively portraying two people who still care about one another, but still can't resist locating each other's last nerve and stomping on it, while Frank Whaley (Swimming With Sharks) is amusing as the motel guy, finally fulfilling all the inherent creepiness I always thought he possessed even in his sympathetic roles. Unfortunately, all three are rapidly reduced to climbing and crawling (in Luke's and Kate's cases) and stalking, shooting and slashing (in Frank's), resulting in an 85-minute movie that seems much longer, and whose \"ending\" is totally nonexistent and fraudulent. I suspect that a big part of the reason that this is getting so many friendly reviews is that, although dealing with a mass murderer, Vacancy doesn't endlessly dwell on explicit torture scenes in the manner of Hostel, Wolf Creek, Chaos and the Saws. In light of recent, extremely regrettable events, this is like a college professor giving a student who constantly turns in mediocre work a high grade...because at least he didn't shoot up the campus."
    },
    {
      "rating": "8",
      "text": "With more plot holes than Swiss cheese, you can't really take \"Vacancy\" seriously. That said, it still scared the living daylights out me. It's good old fashioned creep-out suspense--not the usual blood and guts stupidity of today's slasher films. Not that I'm comparing \"Vacancy\" to Hitchcock's \"Psycho\", but it's clearly a lowbrow homage--from the opening credits, to the locale, to the creepy desk clerk (played by Frank Whaley, who seems to be performing in a different film, he's sooooooo over-the-top Snidley Whiplash), to the almost total lack of bloodiness. The last point is key--horror can still be achieved without gore, with a tidy idea, excellent leads (Beckinsale and Wilson are great) and effective cinematography. Not to mention the best credits I've seen in a decade."
    }
  ],
  "recommendations": [
    "disturbia",
    "p2",
    "malignant",
    "dark_skies",
    "devil",
    "insidious_chapter_2",
    "the_collector",
    "the_ring",
    "final_destination",
    "the_strangers_prey_at_night",
    "insidious",
    "the_conjuring",
    "dead_silence",
    "the_boy",
    "annabelle",
    "the_conjuring_the_devil_made_me_do_it",
    "the_possession",
    "wrong_turn",
    "terrifier",
    "the_last_house_on_the_left",
    "insidious_chapter_3",
    "chernobyl_diaries",
    "it_follows",
    "a_perfect_getaway",
    "the_woman_in_black"
  ]
}