{
  "id": 1373,
  "title": "Valerian and the City of a Thousand Planets",
  "starring": [
    "Dane DeHaan",
    "Cara Delevingne"
  ],
  "runtime": 136,
  "genre": [
    "Adventure",
    "Science Fiction",
    "Action"
  ],
  "description": "In the 28th century, Valerian and Laureline are special operatives charged with keeping order throughout the human territories. On assignment from the Minister of Defense, the two undertake a mission to Alpha, an ever-expanding metropolis where species from across the universe have converged over centuries to share knowledge, intelligence, and cultures. At the center of Alpha is a mysterious dark force which threatens the peaceful existence of the City of a Thousand Planets, and Valerian and Laureline must race to identify the menace and safeguard not just Alpha, but the future of the universe.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aCDrPEfvxcPNRynd2uZyXql7aj.jpg",
  "categories": {
    "plot": 4.714285714285714,
    "acting": 4.638888888888889,
    "ending": 3.5454545454545454,
    "soundtrack": 3.0,
    "cinematography": 0.0,
    "familyFriendly": 5.25,
    "funny": 4.9,
    "action": 4.909090909090909
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Valerian is one of the most visually stunning films ever made. It also has lots of action and a story that doesn't suck. The main problem here though, are the two leads. Completely bland."
    },
    {
      "rating": "8",
      "text": "After watching \"Valerian and the City of a Thousand Planets\" I must say this movie falls into my all time favorites. It definitely takes top movie this year for me, beating the likes of \"Wonder Woman\" and \"Guardians of the Galaxy Vol. 2\". I highly recommend watching it!"
    },
    {
      "rating": "9",
      "text": "This movie is a breath of fresh air. For so many recent movies, you can predict pretty accurately what will happen in the next 90 minutes from the first 15, but not so for Valerian. There is a sense of wonder in this film. There is the wonder of seeing so many strange alien beings who are truly aliens, and not just bipedal humanoid of varying colours. There is the wonder of seeing different acrologies and biomes. There is the wonder of seeing genuinely funny scenes that are not deliberate or forced, but tickles you in the right place. If the sci-fic genre, in whatever medium, is supposed to instil a sense of wonder in the audiences, then this film is the quintessential sci-fi film."
    },
    {
      "rating": "10",
      "text": "I absolutely loved this movie! The alien worlds in this movie go beyond my imagination.The animation is absolutely amazing and breathtaking. The plot is well- developed and requires the viewer to figure out the story themselves. However, it could be improved. As someone who loves science fiction, I have thoroughly enjoyed this movie."
    },
    {
      "rating": "5",
      "text": "Pretty imaginative alien world, but boring overall.I'm a Fifth Element fan, and that movie was a lot of fun, with lots of charm, and tons of hilarious moments. Then this came up, with Luc Besson as the director I was really excited to watch it.I never read the comic book, but as far as comic goes, European comics have really unique style and story. Probably because they didn't reach the mainstream audience much. And lots of french movies are great, so at least these facts get me higher hope for the movie.But... the very bottom line is that I was wrong to expect Valerian as \"spiritual successor\" of Fifth Element. I'm guessing this is a very idealist project, sort of like James Cameron's Avatar.Something that has been around Luc Besson's head for awhile, but the technology wasn't up to it back when he came up with the idea.So the execution? The CG are wonderful, but that's pretty much all of it. Action sequences are not impactful, even Transformers Last Knight still did it better. No witty dialogue or hilarious/memorable moments such as when Ruby Rod interviewing Korben Dallas. The story is a jumbled mess too.If you want to feast your eyes again after Avatar did it to you, this will satisfy your thirst at least partially.But this ain't no Fift Element."
    },
    {
      "rating": "6",
      "text": "A film that is worth viewing for the spectacle alone. Not to say there aren't some fun moments within the story, but by the end you find yourself a little exhausted. B-"
    },
    {
      "rating": "4",
      "text": "Style over substance. Scenes were too long. Exposition was lame. There was zero chemistry between Cara Delevingne and Dane DeHaan. Cara Delevingne was okay, but Dane DeHaan was awful. Seems like he'd rather be sucking on a bong than doing anything else."
    },
    {
      "rating": "3",
      "text": "The plot was interesting, but the script was clunky and juvenile (almost like it was written as a translation) and the wooden acting on the part of Valerian and especially Laureline did nothing to save it. I loved the visuals, and the people in supporting roles generally were better actors, but even then, the writing quality was nowhere near the visuals. Sadly, this is a film that could be improved by redoing the dialogue and voice acting, so it may do much better in dubbed versions overseas if the writers and voice actors are skilled."
    },
    {
      "rating": "5",
      "text": "Visually ambitious, but ultimately the two leads fail to match up to the excitement of the worlds created. The characters are one dimensional and are hurt by a story that isn't all that enthralling."
    },
    {
      "rating": "5",
      "text": "Had high hopes for this one and it disappointed. The visuals and locations are pretty darn awesome and for the most part the action set pieces are good. The movie lacks with very poor dialogue and a weak script with eye rolling jokes and pretty bland leads. The story was okay but didn't capitalized on how good it could of been."
    },
    {
      "rating": "4",
      "text": "It could be a good film. The whole CGI, the planets, the effects, the paces, the races! Magnifique. But... this all was ruined by wrong actors choice. Valerian is played by guy who tries too hard to be badass, it sounds like he's forcing his voice to be lower and the outcome is ridiculous. Also he doesn't look badass at all. He sounds like he had stuffed nose the whole time. That girl... this was also a poor choice. She can't act, but on top of that she has incredibly irritating face. Eyebrows in particular. She was just ugly. I couldn't look at her, it was just annoying. Finally we get to Rihanna, who was just put there. No reason for her to be there, it was some kind of marketing stunt I suppose. She didn't fit in her role, she was just there to show off. From all of this I got the sensation that those actors were just forcibly fit into these roles, because how come the CGI generated characters were far better in acting!? This film could be epic."
    },
    {
      "rating": "5",
      "text": "Generally, I thought the film was quite good. It had stunning visuals, the CGI of the alien species was fantastic and very unique for some species. I liked how the use of locations was used throughout the film. The story itself was really interesting, however, the acting for the two main characters was very poor. Terrible even. I don't know if it was because they were poorly written or the actors just didn't fit the role well at all. And I found the 'love story' between these two characters to be very boring and unnecessary, at times I wished they would stop talking about it and just move on with the story."
    },
    {
      "rating": "0",
      "text": "a lot of computer graphics - a sea of ​​computer graphics! A lot of strange extraterrestrial creatures, animals, instruments, ships, weapons, buildings, etc., and ... a lot of nonsense things and very little sense. about 200 million euros was spent on this film! But the result was a totally incompetent rubbish. How sad it is! I do not understand how this is possible - the author of such a beautiful work as the \"fifth element\" suddenly creates such a sludge? Oh, maybe because the director Luc Besson decided to work in the area where he does not understand at all? He decided to write a script... I think this is the main problem of the film - a weak screenplay. Or rather complete absence of adequate screenplay. I put zero for this movie because I could not watch more than 27 minutes. watch longer, just unbearable"
    },
    {
      "rating": "2",
      "text": "This movie made me angry just by watching it. The 2 leads have no chemistry. The movie is nothing but eye candy. The people that are saying it's good have severely bad taste in movies."
    },
    {
      "rating": "2",
      "text": "Visually a nice movie, but the main protagonist is pretty unlikable and the story is as flat as a pizza. Pretty sad given the fact that the movie had loads of money to spend on very nice optics, but seemingly nothing left for the writers."
    },
    {
      "rating": "9",
      "text": "Way more inventive than the last three Star Wars movies. Lots of original ideas. Visually stunning. Creature creation and special effects some of the best ever . Luc Besson is a visionary scifi and action director par excellence. Bravo. The two leads were great. Cara Develigne surprisingly good actress. And super sexy! Would love to see a sequel. Shame it didn’t do the numbers. Shouldn’t have gone up against Dunkirk! Suspect this film will become more appreciated over time and become a cult classic"
    },
    {
      "rating": "3",
      "text": "This movie’s worst fault is the casting. The main character is obviously supposed to be charming but Dane Dehaan just wasn’t able to deliver. All of the characters were unlikeable and the great visuals barely helped."
    },
    {
      "rating": "2",
      "text": "The film is visually stunning and has some great ideas, with better actors and a cohesive plot it could have been fantastic.Unfortunately most of the movie is cringeworthy, firstly you are expected to believe a couple of wimpy high-school kids are super tough intergalactic heroes. Quite why they have teens piloting the spaceships, and a whole galaxy depending on them, when a whole host of better suited people are around them is never explained. Then you are also expected to believe that the lead actor is some sort of lothario, and that his partner is besotted with him, but they both are completely wooden and there is no chemistry between them. The story then muddles around for a bit without purpose and Rhianna pops up for a cameo appearance to plug a song in a sequence that should have been left on the cutting room floor. The final act has no surprises and you can see what is coming from a mile off, it ends with a bizarre conclusion, and the fakest most unconvincing  love scene I've ever seen in a film. Cara Delevingne rolls her eyes and acts bratish a lot and Dane DeHaan very unconvincingly plays the tough guy. Such a shame as I thought the concept had a lot of potential."
    },
    {
      "rating": "8",
      "text": "Criminally underrated. It brings an already defined and complex universe without handholding and providing unnecessary exposition. I get that this won’t be everyone’s cup of tea. It’s wild and crazy and sometimes silly. But it’s certainly not simple or dumbed down. It will find it’s rightful following on video. The only real detractors are the wooden performances of the two leads. Valerian is an unfortunate graduate of the Keanu Reeves school of acting and the chemistry just isn’t there between the two. Beyond that it’s a fantastic, visual feast that only Luc Besson could pull off and get away with."
    },
    {
      "rating": "9",
      "text": "A beautiful movie. Don't understand the critics who will rate any Star Wars movie high in spite of the wooden plot and acting and then trash this enjoyable and original film of the same type."
    },
    {
      "rating": "5",
      "text": "This adventure takes place in a future world that's populated by dozens of alien creatures in extraordinary environments. And it's surprising that a film so jammed with fantastic visuals can fall so flat. Two humans (Dane DeHaan and Cara Delevingne) have a mission to save the titular metropolis and ultimately the universe. This is another setback: DeHaan has none of the charm or charisma of an adventure hero and his chemistry with Delevingne never sparks. But most surprising is that director Luc Besson, who's best known for action series (Taken, The Transporter), has created such anemic encounters here. There's plenty of running and fighting, but it's never staged with any creativity or excitement.  Even the remarkable sci-fi elements that are crammed into every frame lose some of their spark after a while, plus the mundane writing and leaden drama dilute any appeal offered by the dazzling (and sometimes derivative) imagery."
    },
    {
      "rating": "7",
      "text": "Valerian does not deserve all the negativity it is currently receiving. The movie had a good story, the actors were not great, but they were good, and the visuals were awesome. Character development was lacking bordering on creepy from the countless times guy flirt with the leading female. It was a fun experience with great visuals and that's good enough for me. Noone said it was going to be a shakesperean space opera."
    },
    {
      "rating": "3",
      "text": "This movie is epic... an epic pile of crap. We take two space soldiers, with no personality or depth and plunk them in the middle of a badly scripted, poorly executed, over CGI'd and horribly acted sci-fi film where by the end no one cares who wins. When a film starts with music that sounds cheesy and out of place you know nothing is going to go right."
    },
    {
      "rating": "9",
      "text": "Very rarely can a sci fi film hit so many different races, locations and environments in one film. Not to mention with such quality visual effects and animations. This was a real treat. The main pearl aliens planet, behaviors and look were so unique that I was intrigued. What also struck me as surprising and kept me intrigued was the unique relationship unfolding between the two main characters. Finally, the lead female actor who played Laureline perfectly hit the alluring 'sexy' aspect that I felt they were trying to include in there and reproduce Fifth Element with Leeloo."
    },
    {
      "rating": "1",
      "text": "The main problem with Valerian is that it's less of a sci-fi movie than it is a really dumb romantic comedy that just happens to have aliens and technology letting you exist and travel through several dimensions at once (used for an action scene early on, then NEVER becomes relevant later on, when it would've solved A LOT of problems.) Moreover, it's a romantic comedy whose lead characters are openly callous (ignoring allies getting killed as a direct result of their action in favour of more \"flirty\" chitchat) and are so unlikeable you totally do not care whether or not they get together.Yet, this is all the plot is interested in: most of their shared dialogue is creepy \"flirting\", and very little screentime is devoted to addressing their supposed mission as opposed to them having to rescue each other from completely irrelevant doldrums that only exist to cram in more action scenes and give other characters a chance to pontificate on their supposed love and how they should be together. It's sickening, especially when practically all those side characters are a lot more interesting than these leads (with the exception of THREE Jar Jar clones that crop up way too often, especially for a film made a whole decade after Star Wars prequels concluced.) I suppose all of these flaws were probably present in the source material (1960's French comic book just called \"Valerian and Laureline\"), but that doesn't make it look any better on screen.The \"main plot\" to do with their missions, or what there is of one, is also not great to say the least: it's something like a cross between Avatar and that Star Trek movie about whales, with a very pointedly \"noble savage\"-like race (though again, that might have looked fresh and topical when it came out and hippies were all the rage), and what now seems like parallels refugee crisis, but at the time was probably intended to mirror Algerian and Indochina wars France went through at the time, and likely nuclear testing as well. While it would've probably still looked silly, it might've been compelling if more screentime was devoted to developing these ideas, as opposed to all the reasoning being dumped in the 10 minutes close at the end."
    },
    {
      "rating": "6",
      "text": "Luc Besson’s Valerian adaptation based on the French comic of the same name is visually stunning but unfortunately that’s about all it was. Some of the creatures in the film looked very similar to Luc Besson’s other movie “The Fifth Element”, which was a nice throw back.  The main protagonists were not as memorable or likeably as some of the other space operas, but good enough to move the plot along. I didn’t mind Dane Dehann, but I can honestly say I have not like Cara Delevingne acting in any of the movies I have seen her in. She frankly comes across as wooden with most of her lines.    If I had to take one good thing from Valerian other than the visuals, I would say the technology concepts were cool. It was the first Sci Fi film in a while to really show me advance technology concepts that felt alien.  Overall if you like Sci Fi films you will probably find enjoyment in this one, if you’re a fan of a more emotionally deep film then this one is passable."
    },
    {
      "rating": "8",
      "text": "A great science fiction romp. The film speeds by so many interesting visuals and ideas pulling you into the next one before you've barely caught your breath. However, this is definitely not a film for everyone, it is outlandish and bizarre and will often contradict its own world's rules several times in the same scene. You should definitely go in with more of a Monty Python mentality and less of a Star Wars mentality. The only major issue I had was with a 30-minute plot cul de sac right in the middle of the film. Rihanna shows up for a goofy and awkward side story that should have been completely cut from the final film; it merely provides a long distraction from the main plot and adds nothing to the overarching story. I love that she's bringing people into the theaters for fun action sci-fi films like Battleship and Valerian, but they're clearly creating custom characters for her that just aren't very good. I loved everything before she shows up and after she leaves."
    },
    {
      "rating": "10",
      "text": "Just another movie proving to me that critics really don't know how to go to the movies and just have FUN sometimes. The plot kinda stretched a bit, there are moments of terrible acting, but the film knows that it's just trying to have fun, and at that it exceeds. I'm a long time fan of the French comic book series and I feel like this did pretty good justice. And finally, the 3D is definitely the best 3D I've ever seen, better than Avatar (which looked amazing but was not a very good film). Sadly we'll probably never see the characters in a sequel as the critics basically shot this movie in the heart."
    },
    {
      "rating": "6",
      "text": "Valerian and the City of a Thousand Planets is Luc Besson's ambitious project and really big letdown as well. The Movie has awestruck visuals which are out of this world and absolutely brilliant creativity in its world building and aliens. Apartfrom that the movie has nothing to offer. It got caught up in the visuals that the movie really lacks character development with really cheesy dialogues and humor not landing always and a really convoluted plot."
    },
    {
      "rating": "5",
      "text": "Very good special effects, costumes and creatures. Beautiful scenery and filming. But how come the main characters were not developed. The humor sucked and the lead characters had virtually no chemistry. It would seem if you go all out on developing such stunning effects for a movie, the plot would be just a tad better. I'm givin it a 5 and a half. If you had thrown in some free popcorn I could have called it a 6..at the most!"
    },
    {
      "rating": "10",
      "text": "I watched the movie without reading any reviews, nor seeing any trailers. I just wanted to watch good SciFi movie. After I saw the critic reviews I was surprise of their negative views. To be honest the pace, the story (if a bit soft) was creative and entertaining and this is exactly what you want to see in a SciFi movie. I like directors and producers that are bold and create a store which is probably not for everyone. You can see the amount of effort and passion everyone gave to bring this movie to life. The movie was not perfect, but definitely an unexpected exciting journey."
    },
    {
      "rating": "0",
      "text": "Valerian and the City of A Thousand Planets is perhaps the greatest example of style over substance in modern film history.Luc Besson is such a huge fan of the comic book source material he has worked tirelessly to bring the film to the big screen, seeking funding from multiple independent bodies to make it the most expensive indie movie of all time. Unfortunately for the director, the end result is an absolute mess.The film starts with a spectacular montage telling 400 years of exposition as the titular city slowly grows from an Earth space station. Soundtracked by David Bowie’s Space Oddity, this is by far the best sequence of the film. Unfortunately, it’s all down hill from there.Despite some genuinely great visual artistry, Valerian is spoiled by stilted dialogue, a meandering plot and two horribly miscast leads.It’s hard to think of an on-screen couple with less chemistry than Dane DaHaan and Cara Delevingne as Valerian and Laureline.After the initial exposition of the opening scenes, it is their relationship that is the key focus of the film, with the plot very much secondary.Unfortunately, the pair have no spark whatsoever and just sort of say their lines at each other in wooden, bland exchanges that are often cringe worthy and painful to watch.Dane DeHann can be good, his performance in Chronicle gave us a glimpse at a realistic super-villain origin story, and for the first half of The Amazing Spider-Man 2 he made a pretty credible Harry Osborne. Here though it becomes clear that ‘swash-buckling, womanising, space agent’ is not in his repertoire. The actor is just lacking that elusive quality that you can’t really teach — charisma.Delevingne is another story all together. At this point I’ve seen two of her cinematic outings — last year’s Suicide Squad and now Valerian. So for me, she is two for two in terms of god awful, wooden and almost film killing performances. It’s hard to get into specifics but from what I can tell she doesn’t seem to get how ‘acting’ works beyond wearing the clothes she’s told to wear and saying the words she’s told to say. As I said though, I haven’t seen Paper Towns for all I know she could be great, judging by Valerian though, it doesn’t look likely.As the film moves on the plot about the wrongful near extinction of a species fades into the background. When it does resurface the plotting and painfully basic dialogue can barely keep it chugging along. For the most part though, the film is concerned with Valerian and Laureline and how much they care about each other/work well together/should be a couple etc. none of which works due to the aforementioned lack of chemistry.Ultimately Valerian comes across as a poor man’s Guardians of the Galaxy and essentially shows us what might have been given some alternative casting. The reason both Guardians films work so well is the interplay between the characters, without that the films would have just been a mixture of bright colours and fun noises, and that is basically what Valerian has ended up as.Even the visual flare of the earlier scenes gives way about half way through proceedings. After setting up a huge universe full of different species and alien environments, Besson for some reason decides we should spend the back half in the dimly lit sewers and underbelly of ‘The City of A Thousand Planets’.The final nails in the coffin are a couple of bizarre cameo appearances from Rihanna and Ethan Hawke (what are you doing?)I would say Rihanna’s inclusion drags the film down but the leads are already doing a pretty good job of that themselves. Instead, her section is another speed bump in a film that makes 2 hours and change feel like an eternity.By the time the final battle gets going, we’re all past the point of caring and no amount of laser gun fights and killer robots can save us (and they usually save everything).I’m sure Valerian will have its supporters from its pre-existing fan base, but the terrible casting accompanied by a script that has clearly been written by someone without a full grasp of the English language means it has ended up as a convoluted mess without enough flair or imagination to make it worthwhile.There is something to be said for films that are ‘so bad they’re good’ (see my Fast and Furious 8 review for further details). Valerian, however, is just plain bad. Maybe it will become a cult classic in the future, ultimately though the film will always go down as a missed opportunity. If, for whatever reason, you do end up watching it, I have one piece of advice — in your head recast Dane DeHann and Cara Delevingne with Tom Hiddleston and Emma Stone. Better isn’t it?"
    },
    {
      "rating": "3",
      "text": "The opening sequence of this film is a delight, with a montage that instills a heightened sense of curiosity about a rich and cosmopolitan universe. From such promise, however, Besson provides a film which falls so spectacularly short of expectations as to induce an incandescent rage at having to endure the inexorable torment of futile hope that something, anything, might redeem the experience and justify your time. The pacing is lethargic and the editing lacks coherence, the script is utterly woeful, and the chemistry between the lead couple is more akin to siblings than lovers (decidedly not of the Lannister variety!) making for some excruciating moments. Performances are wooden and without charm, and the desired social and political commentary languishes in unsophisticated banality, devoid of any emotional resonance. The storyline had some brief moments of promise, but the plot is a sieve, and whilst there is some excellent creature design and moments of cinematic grandeur, these are few and far between and fail to redeem the film from the inconsistent abyss of boring mediocrity in which it wallows. 3.23/10"
    },
    {
      "rating": "0",
      "text": "The visuals are gorgeous and surprisingly creative given how safe Hollywood plays it these days, but beyond that it's a trainwreck. The plot is a mess, the dialogue is brutally stilted, awkward, and exposition-heavy, and above all they completely wreck both the lead characters. Valerian is supposed to be a lantern-jawed He-Man ladykiller but here he's a dead-eyed twink, and Laureline is supposed to be bubbly, feminine, and lovable (and totally in love with Valerian), but they've made her a scowling, frigid harridan obsessed with her career.Just read the comics, they are 1000x better and will underline just how badly they botched this adaptation."
    },
    {
      "rating": "10",
      "text": "Valerian is a breath of fresh air for the Sci-Fi genre. If you want to see a future cult classic, before it's time, space adventure then you will be hard pressed to find a better movie that scratches that itch this year than Valerian."
    },
    {
      "rating": "3",
      "text": "Some of the worst acting/writing I've ever seen in any movie - ever.  Visually there's some cool stuff here, but it's doesn't give you much reason to root for the lead character.  I liked Dane Dahaan in \"Chronicle\", but I don't understand his casting in this role at all.  They are a lock to win Razzie awards."
    },
    {
      "rating": "10",
      "text": "Great movie with cool visual effects and non-obvious story. Aliens and other worlds are very interestingly done. Lots of good humor. Great sound effects."
    },
    {
      "rating": "2",
      "text": "It's visually stunning, but the story felt underwhelming. This film had a chance to be big. If you're going in for a great story, don't because the movie won't deliver that to you. The two lead characters though....uhh no chemistry between the two so it was hard to watch."
    },
    {
      "rating": "10",
      "text": "Valerian and the City of a Thousand Planets immerses you in a unique scifi fantasy world teeming with aliens and wondrous sights. Despite the weak plot, poor script, rushed character development, and typical sexist treatment of the female lead, I did find the movie enjoyable and memorable. I hope the movie does sufficiently well to encourage movie makers to continue to take chances on ambitious projects like this."
    },
    {
      "rating": "7",
      "text": "This is a fine movie you can go and watch for a boring afternoon. I quite enjoyed watching this movie and so is everyone sat next to me. But release on the same day with Dunkirk is a very bad decision. If you are making decisions which movie to go for this weekend and if you are not interested in Dunkirk, this movie will worth your money.So let me first talk about what is bad:1. Trailer. Just terrible. Misleading trailer.2. Story. The story is not that \"bad\", However, this is a mix of the star trek and the star wars. I had a feeling that \"this is star trek beyond\" since the beginning to the end.3. The setting: as title said, this is a movie about \"the city of thousand planet\", however, the story itself doesn't adapt such nice setting. The story has nothing to do with this \"the city of thousand planet\". If I change this movie to \"Valerian and The death star\" it still works. Such a waste!Let's talk about what is good.1. CG. Like some users said above, the director is going to have the same life where Zack Snyder will live the rest of his life. The CGI is good. However this is not a selling point in 2017. I promise you if we put this movie in 2008, that's a winner. As for today, it is really not important.2. Cara Delevingne. Holy **** I just can't stop looking at her the whole movie, she got all my attention and I don't really care about what on earth this movie is talking about. she is so pretty. HEY, why this is called \"Valerian and the city of a thousand planets\". Change to \"Laureline and the city of a thousand planets\" please.3. Rihanna. That's the best 5 mins in the movie. You will know what I am talking about if you go watching this movie.Overall, this is a fine movie worth your 5 dollar ticket. The movie is full of amazing idea but the director didn't make it in good use.I will give it a 6 and 1 extra points for Sergeant Laureline."
    },
    {
      "rating": "9",
      "text": "This film is simple fun with highly creative visual elements.  If you go into it with an open mind, I'm sure you'll be impressed and enjoy yourself.  If you're looking for a deep, challenging, dark, or thought-provoking film, this is not going to satisfy you.  This is sci-fi at its most campy and imaginative, which can be so entertaining if you're open to it!"
    },
    {
      "rating": "10",
      "text": "Visually STUNNING on a par with Avatar.Action, Adventure, humor - and an element of mystery...Valerian and Laureline deliver the goods!!!Personally, I enjoyed it TEN TIMEs better than Guardians 2.  Just relax and enjoy the ride!"
    },
    {
      "rating": "10",
      "text": "Amazing and alluring graphics, accompanied by an unbelievably fast pace storyline that will keep you on the edge of your seat form the beginning to the end. It is a great movie for any sci-fi lovers out there, giving a fresh and bold twist to the typical space adventures. Definitely a must watch for those who are looking for something new and unorthodox."
    },
    {
      "rating": "10",
      "text": "Absolutely delivers on the awesome trailer. People are too cynical for a silly fantasy movie, and the theater was half empty, but it's an injustice that will probably deny me a sequel. This was a fun movie with cooler aliens than Star Wars. Actors did a great job with a script that wasn't as bad as some say. Worth the price of admission. I want another movie."
    },
    {
      "rating": "8",
      "text": "I enjoyed the hell out of this movie. It's indie nature shines through and gives way to truly unique sci-fi (and even borderline cyberpunk) elements. The troopers in this space opera can actually aim!!I feel maybe 15 minutes could have been shaved off, with its weakest points being Rihanna's sub-plot and some needless mushiness in the final act. Still, it wasn't enough to stop me from enjoying the film and talking over certains scenes with my wife.Despite a few cheesy lines, the relationship between the two lead actors felt pretty realistic to me, a husband of 6 years.Side-Note: Valerian came well before Star Wars...best recognize and respect :p"
    },
    {
      "rating": "2",
      "text": "Overall the movie was very disappointing. Mostly due to the story and the two main protagonists. However, the basic setting (i.e. the city of a thousand planets) in which the story takes place is interesting and is the only reason why I awarded any points to this movie. Taking Avatar as a benchmark, I evaluate the movie the following way: The development of the plot is way below the benchmark and not convincing. At no moment i was touched or surprised by the story: It just didnt make any sense. The acting was below the benchmark. The relation between the protagonist seemed artificial: The \"romance\"  is rather ridiculous and  convinced me at no point of time. My conclusion is: if you expect something comparable to Avatar, you will be extremely disappointed. If you expect a good and convincing plot, you will be extremely disappoined. If you expect a few nice pictures, and a few funny moments, you will be satisfied. For me personally watching this movie was a waste of both time and money."
    },
    {
      "rating": "6",
      "text": "Where do I begin. I went to see it last night and although I was not bored or looking at my watch for the over 2 hours of impressive sets and special effects, I came away a bit empty. It was like eating rice cakes. Flavorless, tasteless and having the texture of styrofoam. This is nowhere as good as \"The Fifth Element\", which was a mind-blowing spectacle that broke all kinds of barriers for the sci-fi genre. Think of this as a lite, a very lite version of that movie from 20 years ago. Remember that Wendy's commercial from the 1980's - Where's the beef?"
    },
    {
      "rating": "10",
      "text": "I went in with low expectations, but was surprised at every turn. The movie is goofy, but the fantastic visuals and a story that is willing to take some risks and not be your typical paint by numbers summer blockbuster makes this one of my favorite films of the year."
    },
    {
      "rating": "10",
      "text": "Sometimes I just don't get the critics. Is it because this movie is French? Does the Hollywood blockbusters industry feel threatened in any way by a French movie other than from the independant movance? It is really to be wondered when you read the critic of that guy in the Hollywood Reporter. Everybody is entitled to its own opinion to be sure, but I'm puzzled by such subjectivity. Praising random Blockbusters with no imagination whatsoever and crappy plot and litterally destroying one (arrgh French) with imagination, crasy effects and original premises. Yes, for sure, the scenario could have been maybe refined in some places, but nothing that justify a 20 whereas other movies with nothing more than this one (Guardian of Galaxies opus 1 for example? with its pushy and already seen pushline like \"Oh yeah!!\"). I mean, really? One thing people, once again everybody is entitled to his/her opinion, but give it a try. Don't let those shamy critics discourage you to watch that movie. And then, if you don't like it, you're perfectly entitled to that and I would be very much interested to read a review with constructive critics! Not those crappy review of so-called professionals. Cheers!"
    },
    {
      "rating": "10",
      "text": "I liked this movie very much. The critics, again, are wrong. It reminds me of a mix of Avatar, The Fith Element and Guardians of the Galaxy. Absolutely worth it, a Must See."
    }
  ],
  "recommendations": [
    "jupiter_ascending",
    "oblivion",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "serenity",
    "mortal_engines",
    "blade_of_the_47_ronin",
    "avengers_age_of_ultron",
    "independence_day_resurgence",
    "the_three_musketeers",
    "pacific_rim_uprising",
    "clash_of_the_titans",
    "project_power",
    "9",
    "the_last_witch_hunter",
    "moon",
    "rise_of_the_planet_of_the_apes",
    "blade_runner_2049",
    "poseidon",
    "guardians_of_the_galaxy",
    "gravity",
    "chaos_walking",
    "thor_the_dark_world",
    "color_out_of_space",
    "captive_state",
    "what_happened_to_monday"
  ]
}