{"id": 2568, "title": "Valkyrie", "starring": ["Tom Cruise", "Kenneth Branagh"], "runtime": 121, "genre": ["Drama", "Thriller", "History", "War"], "description": "Wounded in Africa during World War II, Nazi Col. Claus von Stauffenberg returns to his native Germany and joins the Resistance in a daring plan to create a shadow government and assassinate Adolf Hitler. When events unfold so that he becomes a central player, he finds himself tasked with both leading the coup and personally killing the Führer.", "releaseYear": "2008", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/8eoRtXswC8IQDsqW7iJWO56NhAv.jpg", "categories": {"plot": 6.9, "acting": 6.857142857142857, "ending": 6.0, "soundtrack": 5.0, "cinematography": 6.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.75}, "reviews": [{"rating": "4", "text": "The movie is definitely skillfully done. It captures the era of the 1940's perfectly from the phonograph to the typewriter. However there's one basic flaw in the entire movie. There were 14 failed assassinations against Hitler before this one. Does anyone truly believe that you could bring anything near Hitler without the SS checking? We know Hitler was insane, but stupid, never. You have to suspend all intelligence at the door to buy into this as it is never discussed or explained."}, {"rating": "1", "text": "Tom strikes out again. Where's the big boom?"}, {"rating": "1", "text": "Tom Cruise is just really bad in this film and at points it verges on comedy. E.g The telephone call bits where it keeps being past on. We all know the story and yet there are no little details that are mildly interesting or exciting and after half an hour you can't wait until Cruise is put in front of that firing squad. Oh Dear Tom, Oh Dear."}, {"rating": "5", "text": "Adolf Hitler committed suicide April 30, 1945. Valkyrie is about a group of men who are plotting to assassinate Hitler. Due to the information I have just given to you, you now know that by the end of the movie, Hitler will still be alive. This is a bit of a problem for Valkyrie, but this film does a relatively good job of making you forget about this conclusion. The A-list cast does a more-than-excellent job at acting, though the actual character development is extremely minimal for most characters. Valkyrie does something very smart at the beginning of the movie. We understand that the characters are all speaking German, but they speak English anyway. This eliminates the need for silly German accents, and is much less distracting. There are times when this is contradicted though, such as one scene where there is a woman singing in German, but these are forgivable. Unfortunately, my compliments must end here. Valkyrie is not an action movie. It is not placed under the action genre, and there are almost not action scenes in the movie. Valkyrie is a war movie. Does this seem contradictory to you? I was surprised by the lack of action in Valkyrie, but a lack of action isn't necessarily a bad thing if the movie is entertaining enough. Unfortunately, Valkyrie is mostly just people talking and planning. The reward for waiting through all the talking? One explosion. Really, that's all. For all the planning and talking and such, I expected a very elaborate plan to take place. The plan, though, is really not much more then setting a bomb next to Hitler during a meeting. So I ask, how did a film with such a simple plot manage to stretch to a unnecessarily long, 2 hours? It seems that more time was spent thinking of one liners, than developing an interesting plot. What was most agonizing though, was all the potential Valkyrie. Imagine if we were given flashbacks to Hitler's childhood. And what if there was some more background about the main character's marriage? More story, a little more action, and some decent character development would've gone a long way for turning this mostly mediocre film into the masterpiece it just missed out on."}, {"rating": "8", "text": "Entertaining and suspenful."}, {"rating": "9", "text": "This is a perfect example of critics giving a great movie a bad reputation. Thanks to the critics, I walked in with relatively low expectations, especially considering everybody who bothers researching this stuff already knows the ending. However, the movie itself was so amazing, that I simply cant describe what I enjoyed most. The casting was absolutely brilliant, the acting was remarkable from absolutely everyone, and the suspense absolutely refused to deminish. The only reason I don't give it a perfect score is because I left to go to the bathroon halfway through, which broke the flow for me personally. A must see for anyone who likes tom cruise, hiatory, WWII, or REALLY good suspense movies."}, {"rating": "8", "text": "The general condescending reaction to this film is puzzling to me. I cannot help but think it is largely reactionary to the lead, Tom Cruise, and his recent escapades and media treatment as well as pre-release buzz. Personally, I thought the film engaging and entertaining due to being very well executed (NPI) generally , appealingly designed with authenticity, well photographed and extremely well and credibly performed by the impressive array of international actors, all (literally) of whom did splendidly in their roles. This in addition to a ripping good story made al the better by being based on historical events. I believe that once the lemming-like mentality of the media-mashed masses wanes this film will do better in DVD and may be remembered with more appreciation and respect than it currently enjoys."}, {"rating": "10", "text": "Historical and realistic. A very good film for people who are bored about American action mindless films."}, {"rating": "5", "text": "My main issue with this film is the lack of authenticity created by the use of British and American speech by 'German Characters'. The film lacks continuity because you have all of these 'non-germans' reciting their lines when there should have been a larger effort for authenticity. I would have loved to sense that these were Germans conspiring against the Nazis, but I just didn't get that total feeling."}, {"rating": "10", "text": "A luring story of courage and defiance. obviosuly we know how it ends, so don't be critical of the rather straightforawd plot (as many are). and no, it's not a war movie so dont expect constant explosions and huge action scenes other. Above all else, it's a testament to the men who had the guts to defy hitler's germany. Perhaps the film could have explored their motives more, but it did make clear the bravery inherent in them. Still, it was fascinating to see how close Cruise's \"coup\" came to altering history; this movie explores the chapter history books left out."}, {"rating": "9", "text": "No Dark Knight, but it was still a well-researched and gripping film."}, {"rating": "7", "text": "This movie was way better than I'd expected based on the dreadful press the production was getting; doomed before it was done. But it is a lean, historically accurate from what I can tell/read (for a big time Hollywood project), and simply entertaining. I think many folks saw Tom's name and dismissed it. Is he a bit of a loon? Sure. But let's not lose sight of the fact that he's good at his job. As is Bryan Singer. If you like WWII movies, it's a no brainer. Go see it."}, {"rating": "9", "text": "I don't get all the negative reviews. This was a great film. Very suspenseful and gripping from start to finish. Tom Cruise does an excellent job as Strassenburg. The rest of the cast is great as well, except somewhat of a miscasting of Hitler. And the ending, though we already know what happens, is very powerful and emotional. Great movie."}, {"rating": "8", "text": "Good acting (not great) and fairly accurate Although I am not a Tom Cruise fan his performance was fine."}, {"rating": "6", "text": "A fascinating story, but not that well told by this movie."}, {"rating": "8", "text": "Entertaining film. I would recommend seeing this."}, {"rating": "8", "text": "Thought i knew this story but it had me on the edge of my seat. It was muchc better than i thought it would be. saw some things on the history channel and it appears they did not over play the story line -- GREAT Movie."}, {"rating": "8", "text": "The critics, whether intentionally or not, have misjudged this film."}, {"rating": "6", "text": "Overall it was a good movie with a daring plot to kill Hitler, although it didn't show the wrong doings of the Nazis."}, {"rating": "8", "text": "I agree with the San Francisco Chronicle. History is what is appealing here. You know the outcome, but to see how the details unfolded. I found very interesting. I certainly prefered this to the long dragging Benjamin Button."}, {"rating": "8", "text": "Very good, suepsenseful despite historical reality, high level of accurate realism."}, {"rating": "8", "text": "An excellent film that left the viewers in suspense despite the fact that we knew the obvious ending. It was about time someone made a film on the topic."}, {"rating": "5", "text": "The cast does a fairly decent job, but the movie didn't have any hope to be great. We know from the beginning that the plan will fail, so all we're doing is watching some scenes that lead up to a climax that has been spoiled for everyone that's ever taken a world history class. The movie leaves you wanting to root for the traitors but you can't because you know they don't succeed. It's really all rather disappointing."}, {"rating": "8", "text": "great movie; Tom Criuse put together a respectable performance. This is good for him after all the negative publicity in the past few years. Worth seeing. Even though I knew the plot before I saw the movie, I was intrigued by it when see the movie."}, {"rating": "10", "text": "A very good movie about real facts in history."}, {"rating": "8", "text": "This film was not as bad as (almost) everyone is saying, in spite of Tom Cruise (who was tolerable in here). It was a quiet and understated thriller that kept my attention."}, {"rating": "6", "text": "Pretty much OK to watch, but you forget it fairly quickly."}, {"rating": "8", "text": "Valkyrie is probably one of the more interesting films I've seen lately regarding an important part of WWII history, and that being one of the many assassination attempts on Hitler's life by the Germans themselves. It's interesting to see these heroic Germans banding together to help take down a tyrannical leader that is clearly ruining the world around them. These heroes care about their country and their way of life that has seemingly been stripped away from them for far too long...and when our main character Staufenberg (Cruise) gets injured, its the last straw. Cruise does a decent enough job with whats given to him...playing a character that is completely torn away from his duty to serve a leader that simlply isn't worth serving. Its ruined his body and his way of life, and he is sick of it...and he jumps at the oppurtunity to change things, which is noble and heroic given the dire consequences he knows he will undoubtedly face if caught. The rest of the (amazing) cast does an even better job...most notable Kenneth Bragnagh, Terrence Stamp, and Bill Nighy. Overall the film is rather predictable, its not very tense as anyone with a shred of knowledge regarding history will know how this all plays out but it still makes for a very interesting watch. RECOMMENDED."}, {"rating": "7", "text": "The details of the plot are confusing. I could not follow them most of the time, but this defect isn"}, {"rating": "10", "text": "Ignore the newspapers and magazines who are simply too critical sometimes. Movies can occasionally be much more entertaining and enjoyable if you don't read the reviews first."}, {"rating": "10", "text": "Tom Cruise is Beautiful and a grat actor ! Valkyrie is a movie fantastic !"}, {"rating": "6", "text": "Undramatic."}, {"rating": "10", "text": "Amazing!! Valkyrie is an amazing, exceptionally well made true life suspense thriller. Valkyrie stars Tom Cruise as Col. Claus Von Stauffenberg a one eyed one handed German solider who while in the service of his country has betrayed his honor and dignity as a human being. Now with a banned of politicians and soldiers Stauffenberg sets out to take out one of the true evils of the world Hitler. Valkyrie is one of the best films of the year and probably the only true Mission Impossible. I very highly recommended this great war time thriller."}, {"rating": "7", "text": "It's all in the eye. Colonel Claus von Stauffenberg (Tom Cruise) loses one of his (plus 70% of his fingers) in a wartime explosion, and when visiting Adolf Hitler, snaps on an artificial one presumably because of the Fuehrer's high regard for physical perfection...but in most other situations makes do with an eye patch. Why not wear the fake orb ALL the time? This may hold the key to why von Stauffenberg's assassination plot, admirable as its intentions may be, was doomed to failure from the start: von Stauffenberg simply calls too much attention to himself. (This tendency is further explored in one of Valkyrie's best sequences: von Stauffenberg, upon being chastized for not \"heil Hitler-ing\", immediately, sarcastically overcompensates.) Of the sudden pack of Nazi/ Holocaust-themed movies suddenly surrounding us, Valkyrie is the most traditional, genre-based, and old-fashioned; it could've played quite snugly in 1966 on a very satisfying double bill with The Dirty Dozen. (At age 52, I was the audience's spring chicken at the showing I attended.) Even though most of us already know the outcome of von Stauffenberg's plot going in (or at least SHOULD, depending on how good a job our public schools are doing) Valkyrie still succeeds at being not only surprisingly and admirably tense and suspenseful, but even heartbreaking as we come to know something that our heroes are blissfully (and tragically) unaware of. (Adolf's resiliency becomes Hitchcock's famed bomb-under-the-table.) Director Bryan Singer's comic book adaptations (particularly Superman Returns) suffer from a heavy dose of misplaced gravitas, but given the urgency of his subject matter here, this time his approach is just right. And can we all just lay off Tom Cruise already? The man did a few silly things in public and paid for them (and shouldn't even have had to do THAT for exercising his right to publicly express his religious beliefs; it's a disgrace that he had to appear on TV to defend his friend and fellow believer John Travolta's during a very private, tragic time in the latter's family life) and Cruise's trademark on-screen quality--steely determination (never better displayed than in his \"Love it or leave it!\" speech in Born on the Fourth of July, where he's desperately trying to convince himself) is abundantly present here. Besides, nobody ever talks about Cruise's SECOND most noticeable acting quality...his utter generosity. Cuba Gooding Jr., Ken Watanabe and Jamie Foxx have scored Oscar nominations or awards playing opposite him, and Cruise is equally both self-effacing and self-assured here in allowing such Brit heavyweights as Kenneth Branagh, Tom Wilkinson and Eddie Izzard to pilfer their scenes. Cruise hasn't quite seen a Robert Downey Jr.-like resurrection this year, but between this movie deservedly coming off far better than expected, and his one-for-the-books turn as Dancing Hollywood Butthole in Tropic Thunder...hey, the man is still young!"}, {"rating": "10", "text": "great movie. even though we all know whats going to happen its interesting to see how they try to pull it off."}, {"rating": "9", "text": "I, too, have no idea why critical and public acclaim for this picture isn't better. I found the movie engrossing even though I knew the history behind it. Not every \"action\" flick has to have a constant barrage of bombing and things otherwise violent! Grow up, people. Cruise looks like the Colonel, and is restrained in his \"Cruise-like\" performance, and yet no less intense. Co-stars were exceptional."}, {"rating": "9", "text": "I loved that this movie gave Germany a different \"look\" than just the traditional anti-semitic picture painted in almost every other movie for this era."}, {"rating": "7", "text": "Would have been better if it had been done in german with subtitles, but I guess Tom Cruise is not that good an actor I guess! Otherwise a great thriller!"}, {"rating": "10", "text": "This movie is getting a bum rap! I enjoyed it and felt it was thought provoking and very well done. I personally do not like Tom Cruise, but he played this part so well that I forgot it was him acting! The strategic scenes were super well done and kept my attention throughout. It was a surprise find considering the ratings being given by reviewers and fewer alike."}, {"rating": "9", "text": "It was surprisingly a great movie. I especially liked the costumes and period wardrobes, uniforms, etc. You really felt like you were in WWII. Also, it gave a thoughtful look into the german side of the equation which is rare in most WWII films. Kudos!"}, {"rating": "8", "text": "I like the way the story went from the beginning to the end in constant dosage of tense,and it did justice to let the death of the characters just so. And, no, this is not the movie where you'll see it's just about Tom Cruise as the main actor playing oh-so-military. No dramatic cliche words (well,maybe when Stauffenberg yelled his last words) and the plot is a one-way without unnecessary flashbacks or imaginary scenes."}, {"rating": "7", "text": "How do you build a thriller around a story of which the audience knows the outcome right from the start? The makers of the film have been blessed with the fact that the details of the plot are still relatively obscure, so although we know that the bomb intended to kill Hitler did not succeed, it is the aftermath of this sequence which is the most intriguing. The plot fails at about the halfway point of the story, and I guarantee that everything that takes place afterwards will be news to you, and that despite yourself, you will end up on the edge of your seat wondering how it is going to end. The film is built around the idea that the biggest plans revolve around the tiny details, and it spares none of them yet still manages to make such a complex story coherent and seem almost straightforward. However, this almost complete submission to the plot does sacrifice attention to the characters. We never find out why Stauffenberg, or any of the other members of the conspiracy, have gone from Nazi generals to deciding to rid themselves of their Führer. Although maybe the audience"}, {"rating": "5", "text": "This would have been a great movie if Tom Cruise hadn't been in it. Every other character was truly brought to life, and I actually cared and cried over their deaths. But Cruise's performance cut them movie off at the knees. While I find the whole story fascinating I just couldn't bring myself to like or care about Cruise's von Stauffenberg."}, {"rating": "6", "text": "Two big flaws: It should have gone the route of \"Downfall\", and been a historical drama instead of a routine thriller. Second, I could not help but think of how many many actors would have been sooooo much better cast than Tom Cruise. He is not the least bit convincing. The production is excellent - good art direction, cinematography etc."}, {"rating": "10", "text": "Valkyrie was EXCELLENT! Not what I expected... Anyone that loves WWII movies and/ or period movies will enjoy this film. The Tom Cruise character was very interesting, while Hitler was exactly what he needed to be, the sick and scary human that he was. A must see..."}, {"rating": "10", "text": "A thoroughly enjoyable reenactment of the Generals' Plot - which 74 years later, very few people know about. Cruise was appropriately reserved and stoic, while the filmmaker's attention to historical detail was refreshing. If you are looking for Mission Impossible, rent that; if you want to see a piece of historical drama, this is the film for you."}, {"rating": "4", "text": "A movie about something so gloomy as a failed assassination attempt on one of history's most notorious genocidal maniacs should be reason enough for this movie to not do well at the box office. The problem for me is that the movie fails at feeling as though it has the strength that other great bigraphical films has had. And where it falls down is that Tom Cruise is in the presence of actual actors and no amount of PP or hype or appearances on Leno, Letterman, or Oprah can change the fact that Cruise will always be a Hollywood one-tricvk pony. He is and always will be Tom Cruise and that is the movie's biggest downfall - the casting of Tom Cruse."}, {"rating": "7", "text": "The Fuhrer has landed. Leni Riefenstahl must've had the day off. As Adolph Hitler descends from his small plane, it's a guy who's holding the camera. Hitler and his men are in Russia, on official Nazi business one would presume. But before they confab, there's lunch to consider. The food is ready, but the men wait. Nobody eats until Hitler eats. Movies about Nazi Germany fall in two categories: films with Hitler, and films without Hitler. \"Valkyrie\" is a film with Hitler, and quite notably, very scant mention of the concentration camps. It's like a perfect inverse of Steven Spielberg's \"Schindler's List\", in which the Jews are dying in the frame, and the only time that the film refers to Hitler, it's the last word Amon Goethe utters before he dangles. \"Valkyrie\", thankfully, does not try to humanize the man as Oliver Hirschbiegel's \"Der Untergang\" did, but the lack of a Jewish presence does humanize the Nazi soldiers. Without the Jews readily made available for random extinguishment, the Nazis seem like ordinary men, especially out of uniform, as in one scene where they occupy hospital beds in the sick ward. Stauffenberg(Tom Cruise) comes close to being an anti-hero, or worse, the antagonist, in his exhibition of vigilante-like behavior against the Germans. Of course, the Nazi party is synonymous with evil, but in a pop-entertainment such as \"Valkyrie\", the negation of evildoing actually makes for a more tasteful movie, than if we saw a Jew get shot in the back of the head, in the same filmic universe where Cruise dons an eye-patch like a SS pirate."}, {"rating": "4", "text": "The movie was okay in my opinion but it would have been good or even excellent if someone else played Colonel Claus von Stauffenberg. Tom Cruise's acting was really annoying to watch."}, {"rating": "8", "text": "Usually always agree with MetaCritic, but its 58 rating is off. Going in I was sceptical Tom Cruise could adapt his brand/image to this movie, but, as the movie progressed, I was plesently suprised (and I'm not a Criuse fan) Good plot, well directed, fairly tight dialogue, and above average supporting acting and cinematography. MetaCritic should change its rating to at least in the high sixties. I'd say worth the trip (and price) to the theatre."}], "recommendations": ["argo", "patriots_day", "zero_dark_thirty", "13_hours_the_secret_soldiers_of_benghazi", "the_monuments_men", "the_1517_to_paris", "child_44", "green_zone", "hereafter", "allied", "master_and_commander_the_far_side_of_the_world", "lord_of_war", "the_good_shepherd", "the_sum_of_all_fears", "tinker_tailor_soldier_spy", "red_tails", "chaos_walking", "closed_circuit", "alexander", "elysium", "unbroken", "the_last_duel", "sicario_day_of_the_soldado", "deepwater_horizon", "hostiles"]}