{
  "id": 3028,
  "title": "Vamps",
  "starring": [
    "Alicia Silverstone",
    "Krysten Ritter"
  ],
  "runtime": 93,
  "genre": [
    "Comedy",
    "Romance",
    "Horror"
  ],
  "description": "The modern-day story focuses on two beautiful young vampires who are living the good nightlife in New York until love enters the picture and each has to make a choice that will jeopardize their immortality.",
  "releaseYear": "2012",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sW4MFTfW88Ii8TyZVD7oprzzhOU.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 6.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.333333333333333,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "The film is obviously not a masterpiece, but is far to be bad and unwatchable: taking into account the other films of writer-director Amy Heckerling (Look Who is Talking etc.) it is not expected something worthy of any nomination.\r The movie is a light romantic comedy, and unpretentious movie, about two vampires, one older (1840) and other \"younger\" (1990) who live together and their adventures and romantic conflicts in nowdays New York.\r It features an interesting cast with Alicia Silverstone and Krysten Ritter in the lead roles, besides other known actors such as Sigourney Weaver and Malcolm McDowell (Clockwork Orange The - any movie with him to me is worth watching). The performances are of a light-hearted comedy, with a mocking tone.\r The film's visual effects are at least basic and do not know whether they were deliberately forced to refer the B horror movies, with hours that they are hilarious...\r The story unfolds gradually with a meeting between Krysten and another person who I will not name (spoiler) and this event turns to be the main line of the story until a cute end, typical of those light romantic comedies. The jokes are good and funny, but not hilarious.\r Ends up being a good fun to watch with your wife / fiancee / girlfriend, off course, if she likes this genre of movie."
    },
    {
      "rating": "0",
      "text": "Awful and a huge waste of time.... It is completely boring and a bad replica of a would be vamp romantic comedy. Watced the first 1/2 hour and the rest on FF. Avoid it at all costs"
    },
    {
      "rating": "10",
      "text": "I love this movie!  Alicia Silverstone and Krysten Ritter are so cute and funny!  Plus it is really smart and heartbreaking.  Alot more than you'd expect from ads."
    },
    {
      "rating": "8",
      "text": "I was utterly surprised at just how much I enjoyed this movie. It's not good and and has allot of corny moments, but none of which that ruin it. In fact all of its flaws actually give it some charm and as a comedy this movie really does do something slightly different with a very tired genre. Vamps is funny, charming and I really enjoyed it. Don't expect a grade A film, but watch it expecting a warm, heart felt comedy that really seems to have fun with itself."
    },
    {
      "rating": "3",
      "text": "Sadly this film is a satire about modern culture and technology. The special effects budget also seems to have been slashed last minute and the star studded cast add nothing to the plot."
    },
    {
      "rating": "10",
      "text": "I love it so much fun and amazing definitely something you would like to get into watching"
    }
  ]
}