{
  "id": 1369,
  "title": "Van Helsing",
  "starring": [
    "Hugh Jackman",
    "Kate Beckinsale"
  ],
  "runtime": 132,
  "genre": [
    "Horror",
    "Adventure",
    "Action"
  ],
  "description": "Famed monster slayer Gabriel Van Helsing is dispatched to Transylvania to assist the last of the Valerious bloodline in defeating Count Dracula. Anna Valerious reveals that Dracula has formed an unholy alliance with Dr. Frankenstein's monster and is hell-bent on exacting a centuries-old curse on her family.",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gsFun8nATm52aGHeT8ueAel98nE.jpg",
  "categories": {
    "plot": 5.285714285714286,
    "acting": 4.566666666666666,
    "ending": 5.8,
    "soundtrack": 3.5,
    "cinematography": 4.666666666666667,
    "familyFriendly": 5.333333333333333,
    "funny": 4.444444444444445,
    "action": 4.416666666666667
  },
  "reviews": [
    {
      "rating": "9",
      "text": "[9/10]\rPros:\r1. Classic dracula movie.\r2.In the climax dracula Vs. werewolf fight.\r3.Nice action.\r4.Good storyline.\rCons:\r1.Not much, only the idea, if a dracula is killed, all his family, descendants will automatically die, looked a bit creepy.\r2. The gorgeous Kate Beckinsale,the heroine dies at last."
    },
    {
      "rating": "6",
      "text": "If you are looking for some B-Movie, cheesy fun times, then THIS is the film for you. Everyone loves a so-bad-its-good monster mashup, and I definitely recommend this one for fans of the old Scy Fy channel classics."
    },
    {
      "rating": "2",
      "text": "Noisy, fast paced, boring, lacking any depth. Very nice effects and lots and lots of actions. Also sometimes stylish design and lots of effort. If only it had plot and charisma."
    },
    {
      "rating": "3",
      "text": "To think 160 million dollars went into one of the worst movies i've ever seen. Blade II uses half that amount, and gives you twice the fun, and axes those annoying Transylvanian accents. Dracula's brides were cool when they didn't talk. That crossbow is a good use of Retro-futuristic imagination. But everything else is a total wreck. How could ILM screw up so badly? Those FX guys worked with Steven Spielburg, for heaven's sakes! Even the musical score fails to deliver. Oliver Stone's disasterous Alexander at least had uplifting, epic music from Vangelis, but this stuff was just garbage. Just watch the mummy movies for hollywood cheese. This blunder doesn't even qualify for those lowly standards."
    },
    {
      "rating": "9",
      "text": "Strange that so many people hated this movie. The plot might not have been very original, but it was decent. The action sequences were fun to watch, there was more humor than the average horror movie, and the graphics were good. I guess I don't hate mainly because I didn't know much of the vampire, frankenstein, and werewolf lore that so many people were upset about since the movie didn't stick to them."
    },
    {
      "rating": "4",
      "text": "Van Helsing is a definite thrill ride, just the never-ending action sequences were so prolonged that it got quite annoying after a while."
    },
    {
      "rating": "7",
      "text": "I'm really baffled at the hateful negative response to this film. No it's not Oscar material, it's just good campy fun. If you're a fan of old monster movies, James Bond and Indiana Jones flicks, and over-the-top humor in an action/horror movie, then you get it. I guess if you're looking for a summer action flick that takes itself too seriously, then you're out of luck with this one.\r I admit that the film runs a little to long, the chemistry between Beckinsale and Jackman leaves something to be desired, and the Frankenstein \"monster\" (though well-intentioned to give a nod to \"Young Frankenstein\") is really annoying. But the entertainment spawning from the hokey fun that \"Van Helsing\" is all about, makes these flaws so forgivable.\r For me, I'll take the over-acting screaming Brides of Dracula, the silly homages to dozens of classic action and horror movies, the cheesy one-liners, and the not-so-convincing special effects. Isn't that what monster movies are all about?"
    },
    {
      "rating": "10",
      "text": "I don't understand why people think this is a lame or poor movie. I think it's awesome, fun, CGI was decent, I liked how werewolfs were made and many more. It is such a shame that actually some good vampire movies have a sigma of bad movie because there are vampires in it, movies like this should be more better because it's something you can't see in a real life, so that you can enjoy it on the big screen."
    },
    {
      "rating": "10",
      "text": "Seriously?? Critics and users don't like this movie? this is more than dumbass! this is the only movie i like werewolfs, vampires and frankenstein! the story is simply beautiful, the CGI are really awesome, the cast too and c'mon! the movie is great!"
    },
    {
      "rating": "10",
      "text": "Отличный фильм, критика против него не заслужена."
    },
    {
      "rating": "6",
      "text": "I honestly didn't mind it, I really liked the fight scenes which Van Helsing (Hugh Jackman) had throughout this movie they were quite fun and entertaining."
    },
    {
      "rating": "10",
      "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************"
    },
    {
      "rating": "10",
      "text": "Wow. I can't describe how much i'm disappointed. How can you not like this movie? And that's why we don't get good movies nowadays. People don't even have a good taste! This movie is awesome. Amazing storyline, seriously.. A monster hunter? EPIC. I mean, who doesn't like it? It's so good! The werewolves are incredible, the best ones I've EVER seen in a movie. And the vampires? Van Helsing is probably the only movie that shows vampires how they really are: monsters. But sure, people now prefer \"vampires\" who shine like fairies at the sun! Is that even a vampire? Oh right, no. And the werewolves? Nowadays are simply wolves. Van Helsing recreates it as a completely beast, which is what they are! And the CGI? It too damn good! It was 8 years ago and it is still way better than most of the movies we get now! Just.. argh. Seems like people don't know what are good movies. Today, people prefer vampires who fall in love with humans and it's all a big teenager drama than really good stories who give a message. The world is lost. Such a good storyline, such good characters and actors. The CGI is very good and.. then there's the public who actually sucks. Van Helsing is a really good movie."
    },
    {
      "rating": "5",
      "text": "Van Helsing just about works as a film if you don't take it too seriously. It's a fun fantasy romp with numerous references to 30s and 40s Universal horror films. It does have some awful dialogue (it's written and directed by Stephen Sommers, and as with The Mummy and The Mummy Returns, he proves himself much more talented in directing ballsy action sequences than bringing profound vocal utterances to the big screen). It also has some awful performances from its cast (the chief culprit being a laughable, bad Eastern European-accented Kate Beckinsale, but a fairly wooden and inconsistent Hugh Jackman in the title role doesn't fair much better) and the plot is an ugly mess - rather than a glowing tribute to classic horror filmmaking it's a ridiculous throw-everything-but-the-kitchen-sink affair. Despite these glaring issues, Van Helsing could never be called boring. Yes, it might be a bit too long, but the film boasts some fantastic effects (I personally feel that the werewolves featured in the film are the finest in movie history) and the action scenes are handled well - though each set-piece is quite long, the momentum is never lost. You also have a liberal dose of humour and a standout performance in Richard Roxburgh's Count Dracula. Yes, he's hammy, but in a knowing sort of way, and he's a much better actor than Bela Lugosi ever was, and, perhaps most importantly, he appears to be having so much fun with the role. Van Helsing is completely hilarious if it's taken completely seriously, but if you're willing to suspend your disbelief, ignore its more wobbly aspects, it's quite possible to derive a certain amount of perverse pleasure from such a genuinely entertaining film."
    },
    {
      "rating": "4",
      "text": "I think that if you're looking for a copy of this movie on DVD or Blue Ray, you just have to drop into your local cheese shop and you'll find it right next to the cheddar.\r Very cheesy movie that looks great but you have to fight your way through the over-the-top acting and non-sensical direction to grab your slice."
    },
    {
      "rating": "4",
      "text": "I heard great things about this movie. It failed at keeping my attention but I have to say that the graphics and concept was truly something out of the ordinary. I'm a fan of vampire movies but this was not something I could get myself to enjoy."
    },
    {
      "rating": "10",
      "text": "I guess people hate this movie, huh? Well, I'm weird."
    },
    {
      "rating": "3",
      "text": "Although great action scenes, Van Helsing is a pathetic attempt to create interesting monster characters but senseless with daft screenplay and terrible directing from Stephen Sommers."
    },
    {
      "rating": "8",
      "text": "It sucks!"
    },
    {
      "rating": "9",
      "text": "Another epic breakthrough by Universal studios. I loved the monster violence, but the story needs some help. Definately a solid 9."
    },
    {
      "rating": "6",
      "text": "Easily, may I repeat EASILY, 2004's biggest cinema dissapointment. It's not a terrible movie, I just expected it to be a classic on the lines of Batman Begins or Spider-Man 2, and, well, it wasn't. It had pretty good FX and the action scenes were enjoyable, but the plot was just a rip-off of Godzilla if you think about it. The bad guy is trying to let his billions of babies hatch to rule the world. That's pretty much it. I will, however, admit that Van Helsing and Dracula are likable, but all the other characters hace as much life as Dracula's children, for a few momentary seconds they may have life, but then right after they lose it."
    },
    {
      "rating": "2",
      "text": "To save you valuable hours of your life, here's a summary of the whole movie: Big action scene with monsters, Bad CGI, People talk fast, Big action scene with monsters, Big action scene with monsters, Big action scene with monsters, People talk fast, Big action scene with monsters, Bad CGI, Big action scene with monsters, faux-dramatic scene, Big action scene with monsters, Bad CGI, Bad CGI, Fin."
    },
    {
      "rating": "1",
      "text": "Van Helsing is possibly the closest I have come to giving a film a 0. It is a lifeless corpse of a movie. The acting is dreadful bordering on laughable. The referencing of classic monster movies doesn't only fall flat but it grates. Richard Roxburghs Dracula is over the top in the worst possible way and the scripting is dreadful. If anything its one saving grace is a remarkably entertaining intro to the character of Van Helsing (even if Hugh Jackman is terrible as the title character) with the fight between Jekyl and Hyde being a fun piece of action. Its the films only saving grace and its only 5 minutes. The film lumbers on after that, slowly killing your soul. It's dire and thats before it gets to the end where you get to witness Lion King esque sky visions. Because copying Disney in a monster movie seemed like a good idea at the time. Don't watch it, and if you do, bring a pillow."
    },
    {
      "rating": "2",
      "text": "If Bram Stoker resurrected and see what they did with his story, he kill himself! this movie is just, i donÂ´t know, this movie simply have no reason to exist"
    },
    {
      "rating": "6",
      "text": "Eh, it's pretty mainstream and a good example of shallow storytelling, sure, but it's ok after all if viewed with the right mindset. Not that I'm into those things that much, but the action segments and the CGI were not bad at all, so combine that to a story that is... well, I'd say more \"neutral\" than bad, like incredibly obvious and, again, mainstream... and I guess you get something \"ok-ish\" out of it. I admit it also has some minor sentimental value to me, seen this one a lot of time ago."
    },
    {
      "rating": "5",
      "text": "Shallow storytelling and it really only amounts up to a CGI showcase."
    },
    {
      "rating": "2",
      "text": "Had very big expectations, because of the great opening 5-10 minutes, but i was disappointed! It could be so much better! 2/10 is my score for \"Van Helsing\""
    },
    {
      "rating": "2",
      "text": "Van Helsing made me want to gouge my eyes out.\rThis was an extremely painful movie to watch, quite frankly a missed opportunity in ever sense of the word. A horrible script with actors simply reading their lines and waiting to get through it."
    },
    {
      "rating": "9",
      "text": "Van Helsing is movie that combines fantasy, action, drama, mystery and sci-fi. It has monsters, cool weapons and very good characters and performances. I think Van Helsing is one of the most underrated movies ever and it is also my favorite movie with no sequels or prequels.\r Story is good and atmosphere is more than great. Many classic monsters show up and face common nightmare that is called Van Helsing.\rHugh Jackman is nearly perfect Van Helsing (some reason called Gabriel instead of Abraham), Richard Roxburgh is surprisingly good Dracula and Kate Beckinsale is great as Anna, same time beautiful and tough counterpart to Van Helsing.\r Action and story are both well executed and overall design of the movie is great and entertaining. Characters are well made, places look good and movie is from start to finish well made, interesting and feels good.\rMonsters look good overall and great finale is amazing. Even the ending is very well done and I think that movie has very little flaws.\r 9/10\r Masterpiece"
    },
    {
      "rating": "7",
      "text": "Most underrated movie i have ever seen , i don't know what's wrong with the acting , dracula acted excellent,every character was interesting and fun to see in action ,the story is also goodThere are some annoying moments like dracula talks to much instead of fighting and no joke made me laugh , but overall the movie was fun and worth watching"
    },
    {
      "rating": "0",
      "text": "Trash. Made me cringe from first seconds. I think actors were laughing at the director"
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷"
    },
    {
      "rating": "2",
      "text": "This Movie is utterly ridiculous, has hollywood ran out of stories to tell? They have Van Helsing, Dracula, Mr. Hyde, Frankenstein's monster and the Werewolf running around. I almost died with laughter. I just wanted to see Frankenstein bust a colt .45 revolver, that would finish off this movie. This movie should have just been converted into a spoof comedy during the production -- Oh wait it all ready is -- it just wasn't done intentionally"
    },
    {
      "rating": "7",
      "text": "For me a movie underestimated. It 's just a movie for entertainment, but it succeeds well in the order and tells an interesting story about Van Helsing starring Hugh Jackman (a role that seemed inappropriate to him but he managed to play well)."
    },
    {
      "rating": "10",
      "text": "Dear All,  This my perspective - The movie was fantastic. Dont expect more and some strange things.But observe the technicality of the movie, how good it is? Its amazing. I have been watching whenever iam free. Coming to plot, its entirely new concept. lets no think of probability whether it happens or not happens in real life. Casting: Jackman was the perfect fit for this role and moreover he is my fav now. Actress Kate, even wonderful. Very challenging. Carl- Comic+ genius. :)"
    },
    {
      "rating": "0",
      "text": "There was too much focus on this laughably bad CG and repetitive action-packed scenes without any real focus on telling a decent story around these legendary characters. Just ignore this movie, It isn't worth watching."
    },
    {
      "rating": "4",
      "text": "Okay so this movie is stupid. Like, really stupid. All about Count Dracula needing the body of Frankenstein's monster to give life to his children, Van Helsing is a pure mess of a movie and really off-the-wall. With horrific dialogue and bad effects, this one is just a recipe for disaster. However, its campy inclinations and embracing of its more ludicrous elements by bringing them to their completion is what really makes this one a film packed to the brim with raucous entertainment. That said, the everlasting question of the film is: how bad is life in Transylvania? It is bad enough being neighbors with Dracula. However, to accept that the vampires will kill and eat one or two people every once in a while to sustain themselves as a fact of life and an ideal situation is really terrifying. How bad were things before they struck a deal with Dracula?Featuring Hugh Jackman as Van Helsing, the famed archenemy of Dracula, the film tells the story of Gabriel Van Helsing having to go to Transylvania in order to kill Dracula. He is to help save the Valerious bloodline, as they will be stuck in purgatory as a result of their failure to kill Dracula, who was one part of their bloodline before he struck a deal with the devil. By the time he arrives, however, only Anna (Kate Beckinsale) is alive. As with all of Beckinsale's more ludicrous roles, Van Helsing is unafraid to utilize her sex appeal with tight clothing, revealing dresses, and tons of ass shots. She is also largely a damsel in distress here finding herself in situations where men must come and save her. However, the one character I did love, other than Van Helsing himself, is Frankenstein's monster (Shuler Hensley). A compassionate figure in this installation, he was created against his will and, yet, now that he is here, all he wants is to live. Highly sympathetic, it is hard to root against the classic monster in this film.On the flip side, Dracula (Richard Roxburgh) is very easy to root against. Wholly evil, Dracula's large breasted concubines often do his bidding and are truly horrifying to look upon. The special effects on their bat forms are really quite bad and stand out as some of the worst, aside from Mr. Hyde, who is certainly the worst. This said, Dracula himself is well costumed and truly menacing. Roxburg instills him with a stoic deviousness. However, the best part of Dracula is the mythology here. From the ice castle to the missing script to his back story with Van Helsing, it is all very engrossing. With small details sprinkled throughout the film, director Stephen Sommers really does handle the story quite well at times. Though silly and over-the-top, there is a common thread here that binds it all together.Yet, the film cannot get out of its own way. Not only is the acting horrific by Beckinsale and David Wenham, but so is the script. Deviating and often unfocused, the script is over-written, too long, and far too wordy. Though the story does often exceed these problems, it occurs far too sparingly to ignore the issues with the script. Even worse, the conclusion is embarrassing.SPOILERSAfter killing her as a werewolf, Van Helsing buries Anna. As she is finally reunited with her family, we see a vision of her being reunited with her family in the sky and gravitating towards the light. Yikes.END SPOILERSOften really dumb, Van Helsing can also be incredibly fun. Campy, silly, and over-the-top, it is hard to defend the stupidity of the plot, though I really liked the mythology. Unlike other movies of this ilk that came out in the early 2000s such as Underworld, its mythology is its only strength. In Underworld, we had over-the-top, yet solid acting. Solid special effects. And a lot of fun. Here, we get some good fun, but everything else is just so bad it hurts."
    },
    {
      "rating": "5",
      "text": "Não  grande coisa"
    },
    {
      "rating": "7",
      "text": "Ok, so it's not anywhere near a masterpiece.  I'll also admit that it's at times cheesy, and it does really, really overuse c.g.i.  But it's also undeniably fun.  Jackman is awesome as Van Helsing and the movie is super energetic.  Those are its two main strengths but it has more.  I liked its imaginative take on some of the classic monsters.  Frankenstein's monster is usually depicted as dim witted, but here he's basically a genius.  The action is indeed ludicrous but it can also be exhilarating at times.  I thought the plot was pretty interesting to be honest, especially how it depicts Van Helsing as professional monster killer.  If you don't take it too seriously I'm sure the movie will give you a good time too.  I think the main reason the critics didn't like this movie was because they were expecting an actual horror movie.  It's not.  If they were expecting the fantasy adventure that it is, I think it would have gone down a little more smoothly.\rIf anything, it's a thousand times better than Hansel & Gretel."
    },
    {
      "rating": "10",
      "text": "I can't believe how dumb the '' critics '' are this movie is simply brilliant,character development isn't that good but its fairly decent, CGI is superb for a 2004 movie and its the only movie to make a vampire and a werewolf just right."
    },
    {
      "rating": "4",
      "text": "Fantastically high quality prosthetics, costumes, props,seemingly limitless visual effects budget, great soundtrack and an excellent cast are wasted regularly throughout 2004's van helsing. Most of the issues stem from its poor screenplay. Direction pacing and story are a miss here. This movie had all the right ingredients for a blockbuster hit but sadly misses the mark in almost every sequence. The artistry is phenomenal in places though!"
    },
    {
      "rating": "10",
      "text": "It was a great movie. The CGI wasn't bad,  the story is great, the characters are great, everything is awesome. But the thing that makes this movie one of my favorites movies, it's how they make the supernatural beings. They make you want to be one or hunt one. Love this movie"
    },
    {
      "rating": "4",
      "text": "Van Helsing does have some excellent sets and costumes, giving a dark macabre feel and some dark cinematography that was quite possibly the best thing of the film. I also liked the haunting music, and was on the whole impressed with Hugh Jackman in the title role, very brooding at times. Richard Roxburgh, despite some very cheesy material was good as the count.Unfortunately, these were the only redeeming qualities, to a film that is overall disappointingly uninvolving. What I mean by that, is that there isn't much of a story, which was too many times clumsy and unfocused. The dialogue was eye-rollingly cheesy, I think the count's lines were the worst. I wish I could give some examples, but I can't remember any of the dialogue. The performances were okay, Hugh Jackman certainly acquits himself well, and perhaps the only actor to rise above the challenge. However, Kate Beckinsale seemed to do nothing but act pretty, therefore a rather uninvolving character, and consequently there was little chemistry between her and Jackman.Overall, some good moments save a rather bland and uninvolving film, that also suffers from being overlong, that could have been much more with some better dialogue and a better story. 4/10 for trying. Bethany Cox."
    },
    {
      "rating": "1",
      "text": "Signed up on Metacritic after 15+ years just to leave my mark on Van Helsing. Instead of rehashing what's been said, I copied some of the bizarre comments made in the \"positive\" reviews. If you've avoided the movie for this long already, don't break your record...\r it was decent. (9) not Oscar material (7) I guess people hate this movie (10) story needs some help (9) plot could use some work (8) I don't know what everyone else was expecting (8) It sucks! (8) had no real story (8) who cares how the story works out? (10) it was a little long (9) not the best movie out, but it's not the worst. (7) Not a terrific film (7) It isn't necessarily great movie-making (7) despite its many flaws... (7) The ending isn't as good too (9) so amazingly bad, that it was good (10) Sommers doesn't have one iota of Buffymeister Joss Whedon's storytelling skills or wit (7) skips dialogue altogether. And the plot, while impossibly contrived, is nevertheless *novel* (9) The acting was decent (10) Dont expect more and some strange things. (10) character development isn't that good (10) Ok, so it's not anywhere near a masterpiece. (7)"
    },
    {
      "rating": "7",
      "text": "The opening sequence is one of the best things ever, but the movie never reaches that level again."
    },
    {
      "rating": "4",
      "text": "This film portrays Van Helsing's efforts to fight Dracula, which is now trying to give life to his children through the research of the late Doctor Frankenstein. Directed and written by Stephen Sommers, this adventure film has the participation of Hugh Jackman, Kate Beckinsale, Richard Roxburgh and Shuler Hensley in the lead roles.There are certain adventure films, inspired by horror movies, that makes a jumble of elements and characters that have nothing to do with each other. This is one of those films, mixing Dracula to Frankenstein's monster. Even Dr. Jekyll (and his alter-ego, Mr. Hyde) enters the movie! This is not new, has been done in other films and works well when it's done carefully, but definitely wasn't the case here. The script is confusing and makes an attempt to transform Van Helsing, originally a Dutch professor with taste for the occult, in a kind of good supernatural entity destined to hunt down and kill evil monsters. Sorry, but the way this character ended up being \"deconstructed\" was wrong. The director/writer could have made other more interesting options like keeping Van Helsing more faithful to Stoker's novel and try to frame him in a story in the current time, perhaps. The truth is that this film is a clear script error, resulting of flying imagination of its director/screenwriter.The actors were good in their roles, without surprises or special highlights, except perhaps Shuler Hensley, who played a character far from the usual monster, in constant psychological conflict because of his horrid appearance and inner humanity and goodness. The accent of some characters wasn't well done and if the idea was to make them closer to the Romanian universe (when is usually located Dracula's Castle), it failed and became them more humorous than they can be at certain supposedly dramatic moments. The setting, costumes, makeup and sound, visual and special effects are too imaginative, like coming out of a Marvell comic or a graphic novel. The soundtrack, despite the good performance, also didn't stand out particularly.This film is well seeing and entertaining, but doesn't bring big surprises or positively impresses the audience. Far from being a good movie, is ordinary and we see it without big pleasure or expectation."
    },
    {
      "rating": "5",
      "text": "Not sure why I keep watching, but I do.Cons: 1. The acting is \"C\" at best. 2. The script is waaaay overwritten. The characters do not talk like normal people and especially not like people in a vampire apocalypse. 3. Makeup is not very good. 4. Very obvious that this was not a high-budget series."
    },
    {
      "rating": "7",
      "text": "Serviceable movie. Dont watch if you are pretentious and dont want to have a good time. Not a classic but not the worst either."
    },
    {
      "rating": "5",
      "text": "I had a lot of fun watching this. I can see why this gets bad reviews, this wasn't by any means a great movie, but I think that's the charm of it. I also have to note that I thought the cinematography was gorgeous (the purple lighting that was in a lot of scenes; stunning!!!) and that I loved the score and seeing Hugh Jackman and Kate Beckinsale on screen together."
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;"
    }
  ]
}