{"id": 3289, "title": "Vanilla Sky", "starring": ["Tom Cruise", "Penélope Cruz"], "runtime": 136, "genre": ["Mystery", "Science Fiction", "Drama", "Romance", "Fantasy", "Thriller"], "description": "David Aames has it all: wealth, good looks and gorgeous women on his arm. But just as he begins falling for the warmhearted Sofia, his face is horribly disfigured in a car accident. That's just the beginning of his troubles as the lines between illusion and reality, between life and death, are blurred.", "releaseYear": "2001", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/cAh2pCiNPftsY3aSqJuIOde7uWr.jpg", "categories": {"plot": 7.4, "acting": 7.583333333333333, "ending": 7.909090909090909, "soundtrack": 7.2, "cinematography": 8.0, "familyFriendly": 3.0, "funny": 5.0, "action": 8.5}, "reviews": [{"rating": "9", "text": "With great actors and unforgettable moments. A pesar de los comentarios de la prensa, creo que sus virtudes superan a los defectos que pueda tener como creación. Yo vi tanto la versión española como esta, y prefiero esta siempre. La cutrez de Almenábar y el vestuario, y un a mi gusto nada creíble Noriega la lastraban demasiado.  Vanilla Sky no estaba para galardones de la academia, pero deja mucho en la memoria del espectador."}, {"rating": "9", "text": "You either understand this film or you don't.....and that alone would base the difference between a positive or negative review. This film is indeed a glorious mess........that's what it intends to be and yet, in the final few moments of the film, it bunches up into something that somehow works. In the end, the story hits you in the gut and calls into question every character that you've grown accustomed to throughout the duration, and it asks you to let it all go. So devastating but so courageous and raw. Performances all around are top-notch, including Diaz, who does some of her best work here."}, {"rating": "10", "text": "I disagree with many 'reviewers' and feel that this version is a much more polished movie than the original spanish movie. The soundtrack is amazing and the suspense is real. An amazing achievement by Crowe."}, {"rating": "10", "text": "Just ignore the \"Critic Reviews\", they cant be Serious Professionals. Its a much more polished version of \"abre los ojos\" and  Eduardo Noriega did a HORRIBLE work. Thanks Vanilla Sky, to transform this history into a masterpiece."}, {"rating": "10", "text": "A poignant classic. Perhaps not as intelligent as it wants to be but certainly far cleverer than it is given credit for. Without a doubt it is simultaneously my favourite film - and the one I am most tentative about admitting I enjoy. Tom Cruise before Scientology ripped the soul out of his movies."}, {"rating": "10", "text": "Vanilla Sky is a profound mindbender. The movie is engaging with creative visuals and a convoluted screenplay that will surprise & delight you."}, {"rating": "10", "text": "Extremely beautiful film! Seriously one of the best films I have ever seen! This is an original story, with a fantastic cast, and an even better sound track. This is a must see."}, {"rating": "9", "text": "After watching it the second time recently I have come to realize that this movie was ahead of its time. Science fiction was at the point where the randomness was an accepted thing. Of course the original is really the landmark movie, but overall this is a great movie and like the source material it has inspired many great movies, books and television shows I love now."}, {"rating": "10", "text": "When imprisoned David wears a patient ID with his last name and initial. Underneath appear the letters 6R0Z5N and 7UY This translates in code to \"Frozen Guy\" if you realize the number 6 is an F in the alphabet and 7 is a G."}, {"rating": "10", "text": "--------------------------------------------------------○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○○"}, {"rating": "10", "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●■$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷+÷"}, {"rating": "10", "text": "Exceptional. No movie has ever played with my emotions more than this movie or any movie has or will again. Wow."}, {"rating": "10", "text": "A well put together and interesting movie. Honestly, it is insane that it has such a low critic score. If you like movies that keep you guessing like Fight Club or Eternal Sunshine, then you will enjoy this movie. It's confusing because it's meant to be and it triumphs in being entertaining until the end reveal. And on a second viewing, everything makes sense and is one cohesive picture. As others point out, there are many Fantasy vs. Reality films out there, many with more shocking \"twists\", but Vanilla Sky is a gripping movie in it's own right and me and my friends definitely enjoyed watching it even now, a decade after it's original release."}, {"rating": "10", "text": "Wow. A 45% from critics?This just shows how little credence you should pay to professional opinions on works of art. This movie floored me and stuck with me for years. To come here and see it scored below dreck like Doctor Dolittle and Zombie Strippers is an absolute insult.If you're a fan of high concept science fiction and have at least a triple digit IQ, you owe it to yourself to watch this movie and come to your own conclusions. Criminally underrated."}, {"rating": "10", "text": "For a movie that is 13 years old now and is buried in the past, this is truly a great movie for those that like this kind of film. It really isn't meant for everyone and I can understand where the displeasure from critics and users alike. However, if you like science fiction thrillers, romance thrillers or mind-bending movies, this movie is for you. It's similar to the likes of Jacobs Ladder to put it in perspective. I'd at least say watch it through once and see what you think. Personally, I think critics were too harsh on this film and that follow the users score more since the users seem to actually understand this film more. I loved this movie and I hope if you watch it that you will too!"}, {"rating": "10", "text": "》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》********************************************************"}, {"rating": "8", "text": "I feel that blending genres is a very tough, but interesting, way of portraying a story. You take the different aspects and you don’t have to necessarily have equal amounts of each, but you do need to try to manage the quality for each. If one part is mediocre, why even have it? Vanilla Sky was a blend of a number of genres including drama, romance, psychological thriller, science-fiction, and a bit of mystery. Vanilla Sky may have had all of this, but I will proudly say that I loved each and every unique aspect.\rVanilla Sky begins with the wealthy and sadly narcissistic, David Aames (Tom Cruise) waking up in his bed and going about his average morning with that smug grin he has. He drives from his house on his way to work and to his surprise; the streets of New York City are empty. Once he reaches the uninhabited Madison Square Garden, he begins to run in panic from his car. After running a good distance through the streets, he screams up into the sky and he wakes up from the nightmare. This scene may have little to do with the overall story, but I think it was an important sequence to show you what you’re in for. I will tell you now, Vanilla Sky is confusing. The story chronicles the wide and deranged psyche of a man who goes insane, so it’s going to challenge your mind as well. But this scene tells you up front that reality and dreamscape will be jumbled together in this film and you’re going to have to figure it out. I make this connection because the movie begins with him in the dream, so you really don’t know that it’s a dream until he wakes up. Then throughout the rest of the movie you are tossed in and out of consciousness without warning, but it all adds to the experience.\rAnother thing that adds to the experience is the stylistic choices in this movie. I have seen some pretty stylistic movies in my life but man, this one had some style. The cinematography, the set pieces, the props, and the things people did were all so cool. Cameron Crowe did a fantastic job directing it too. I am a fan of Crowe, I liked Say Anything, loved Jerry Maguire, didn’t care much for Almost Famous, but he’s still a fantastic director and it shows in this one. There is a scene where Tom Cruise is in the lobby of L.E. screaming for tech support and the camera is spinning around him as he is standing in this empty room with his reflections surrounding him and this is one instance where the directing is very impressive. It really adds something and so does the soundtrack. This movie had such a collective soundtrack and every song fit so perfectly to the scene it was in. I’ll talk about the same scene I did before and say that the choice of “Good Vibrations” to be in that scene was awesome.\rThere are many interpretations of Vanilla Sky and they all are interesting, but everyone has their own opinion.  The twist in this movie is that everything that happened after David fell asleep on the sidewalk was a dream that he was having in cryogenic sleep. He had killed himself after the car accident when he found a place called Life Extensions or L.E. where he could sleep contently forever with the perfect life. For a while, he does live a perfect life, he gets his face repaired and Sofia back and it’s all good (he doesn’t know he is sleeping at this time). But as we all know, we can’t sleep for too long or else the dream can turn into a nightmare and when David begins to suspect something, that’s when it does. I think this is a really cool concept and I really enjoy it in this movie. This mixture of subjects has never been done before and I don’t think it ever will be again. Then the ending has multiple interpretations too. I believe that he chose to live a normal life and he decided to wake himself up from sleep and the end of the movie is him waking up from that sleep which happened to be 150 years. The moral of this story is that you can’t run from your problems forever. David says that he wants to live a normal life and doesn’t want to dream anymore meaning that he wants to take in the world for what it is and not live the perfect life he had always wanted because his problems even caught him there. The present is 150 years later so he can start over and take on the world without his handicaps like his father’s inheritance. They even bring that up; his finances won’t last long in this time.\rVanilla Sky did get mixed reviews from critics, but in the end, I do not agree with any of them. I think that Vanilla Sky may have a few flaws, but it is still an entertaining and intellectually rewarding movie that actually contains some beauty. It has a good message and there are a few others I didn't even mention. The stylistic choices were cool and the acting and directing were great. Vanilla Sky is a massive blend of many genres that come together to make a thought provoking and entertaining film that actually works."}, {"rating": "7", "text": "There is some psychological pressure along the movie, but the story do not seem natural and honestly it is a bit boring in the middle and the ending from my point of view is the thing called deus ex machina, it does not look logical. Overall a decent movie."}, {"rating": "8", "text": "I have no idea what the plot is...which characters or scenes are actually happening and which are an 'altered reality'...no idea of whether (SPOILER ALERT...) the Cruise character is alive, dead or in some suspended state...in general, no idea of what's happening at all.  Still, for some reason, I really like this movie."}, {"rating": "0", "text": "The worst movie I've seen this year. tell Tom Cruise I want my 3.99 back."}, {"rating": "10", "text": "One of the best movies I have seen. Raises many questions and evokes even more feelings."}, {"rating": "9", "text": "This movie is amazing, although it's sometimes intense and painful to the point of being hard to watch The negative reviews are hilarious; they remind me of AI, in particular the complaints about \"too large of scope\". If you can't wrap your head around epic, high-concept scifi, then go watch Animal House or something. This is a fantastically made and riveting film. Those scoring it on par with \"The Hottie and Nottie\" is deeply clueless."}, {"rating": "10", "text": "I simply do NOT understand how anyone could say this film is anything but brilliant."}, {"rating": "5", "text": "A film which makes an attempt to pattern itself on the fantasy vs. reality films that had become popular at the turn of the new millennium - David Fichner's \"Fight Club\" and M. Night Shamalan's \"Sixth Sense\" both from 1999, Christopher Nolan's \"Momento\" from 2000, and David Lynch's \"Mulholland Drive\" released the following year (all of which don't surpass the reigning king of this genre when Terry Gilliam released his 1985 masterpiece \"Brazil\") - by no means fails in this respect since I found it both entertaining and intriguing for the most part, but is noticeably long and certainly may confuse the average '2hr-max-movie-goer'. Penelope Cruz and Cameron Diaz both stand out playing their respective, 'good gal/bad gal roles and Jason Lee is quite appealing as the best friend of our dashing lead Tom Cruise. Yet Cruise may be viewed as stretching this performance given the physical challenges that are demanded. I hesitate to reveal these challenges to those that have not seen the picture as they are indeed the focal point of the plot. Many good things like the witty Cameron Crowe retrospective soundtrack that is weaved into clever culture references and tributes which are indeed enjoyable and even necessary to solve the riddle presented in 'what's is going on?' scenario of the main character's pressing dilemma which may not be easy to access with a single viewing. But still the ride can be entertaining as Tom runs away and into trouble as he often does in quasi-action films that are laced with mystery and intrigue like Sydney Pollack's 1993 \"The Firm\", Brian De Palma's 1996 \"Mission Impossible\" and even the more cerebrally dark, \"Eyes Wide Shut\" from Stanley Kubrick. As noted by many educated critics as well as the tasteless tabloids Mr. Cruise may be biting off more than he can chew as he dives into the land of independent production. I applaud Tom for his efforts and are rooting for his 'comeback' yet do believe that his choice for future roles should include a return to comedic territory as a deviation/diversion to selecting elaborate/complicated efforts which could be prove a bit too risky and result in a poor reception at the box office."}, {"rating": "6", "text": "Vanilla Sky is, fundamentally, a movie about lucid dreaming. And there is something about it that only lucid dreamers will recognize. Sadly, it's a bit downhill from there. While Vanilla Sky is a solid effort, it's unfortunately short of genius. The very project is a bit curious. Is Cameron Crowe, the permanent teenager responsible for perfectly good yet light-as-a-feather comedies like Jerry Maguire and Almost Famous, up to the challenge of remaking a Spanish psychodrama? Crowe goes through the motions, and from time to time he proves that he can handle heavier material, but Vanilla Sky is too murky to be much more than a holiday distraction  far from the cult classic that the original Abre los Ojos (Open Your Eyes) has become. However... Cameron Crowe's DVD commentary track is one of the best I've heard. While he's overly proud of the middling achievement, he's honest about the tepid reaction from test audiences, and he does provide a little extra context for the various interpretations of the movie. (Also of note, this is the first commentary I've heard with a musical score: someone (Crowe's wife, Nancy Wilson) playing acoustic guitar. Crowe also phones up his stars during the recording... bizarre.) Unfortunately, none of this can make Penélope Cruz a good actress. An interview with songwriter Paul McCartney, two featurettes, and assorted trailers round out the disc. Vanilla Sky has moments of brilliance and bears a certain style, but the movie is neither simple enough for sheer popcorn-thriller fun nor complex enough for true psychodrama buffs. It lies somewhere in a middle ground, and anyone that tells you different... needs to open his eyes."}, {"rating": "4", "text": "This movie had a lot of good things going for it but you can't have a dream when you're dead, people. If they had cut the 15 seconds where they said he overdosed, it would be a lot better. I knew what the twist was going in and it was alluded to constantly - I can't imagine being surprised by it.\rIt had a lot of good dialogue! Jason Lee was good in it! But Tom Cruise screaming \"TECH SUPPORT!\" over and over ruined all that."}, {"rating": "1", "text": "Je ne l'avais pas revu depuis un bout de temps et le souvenir que j'en avais demeurait très confus... et je comprends au revionnage pourquoi : le film est en effet très confus et très bordélique. Evidemment, la fin comme un deus ex machina vient tout éclairer et tout expliquer mais continue de laisser totalement incrédule.Oui, on nous prend pour des jambons là-dedans... Et puis il y a Tom Croute : il faut se le taper Tommy, lui et ses gesticulations pour faire l'acteur, gueule cassée ou pas. Il a tout de même des moments presque convaincants -ou moins à la masse- quand il porte le masque. Le voilà donc qui se trompe de jambonneuse entre la blonde et la brune, qui a survécu, qui n'a pas survécu, la tronche droite ou la tronche de travers... On l'imaginerait mieux dans le rôle de l'éléphant (\"je ne suis pas un animal !!\") qu'a nous jouer ainsi les états d'âmes superficiels d'un fils à papa millionnaire sur fond de petites chansons affreuses (une espèce de pop commerciale niaise et très con).Et puis le film est extrêmement lent et ne se réveille qu'à la fin... Bien sûr, on pense à Ubik de Philip K. Dick et on relirait bien le livre encore une fois : ça  nous changerait très agréablement de ce ciel vanille aussi indigeste qu'un pudding périmé."}, {"rating": "8", "text": "Está demasiado subestimada y eso es algo lamentable; tiene suspenso, drama y la actuación de Tom Cruise es excelente; es muy recomendable."}, {"rating": "7", "text": "Apesar de um remake, tem fôlego por um elenco mais famoso e melhores performances, além de um final um pouco mais interessante."}, {"rating": "3", "text": "Well, before giving it a good rating, you gotta see the original (\"Abre Los Ojos\" by Alejandro Amenabar). Hate to disappoint you guys, but this one is total crap.. Unless you are one of those people without imagination, and you like all the answers being given to you, lefting no place for you to think, you should stay away from this remake. (Sorry for my English, I've only learned it at school :) )."}, {"rating": "10", "text": "Superb, highly moving and deep when understood. Vanilla Sky is not a movie to watch just once and requires your full attention. Not everyone will get it; few will appreciate it on the first viewing. This is not a \"Tom Cruise\" movie, but definately one to watch several times if you enjoy complex movies."}, {"rating": "8", "text": "I'm still confused by whatever went on in that movie, but I loved it, and I was blown away by the ending which was made even spectacular by Sigur Ros' '\"Njosnavelin\". This movie toyed a lot with my emotions, and I don't think I can spite Tom Cruise for his role as David Aames, even if I loathe him (Tom) with a passion as of now."}, {"rating": "10", "text": "A wonderful movie. Cameron Crowe really gets the perspective of the original \"abre los ojos\" and focus all the main ideas in this picture. Vanilla Sky make humans realised the meanning of their existence, it try to achieve a new level of understanding of the human mind by incorporate anormal fenoms in cuatidan life. As Cameron Crow said about the movie. \"life, sex, emotion, sadness, love, crazyness, dead\".This is Vanilla Sky."}, {"rating": "8", "text": "One of the better movies to be released to a full national market in recent history. While not quite up to par with the original Spanish version, this movie still carries a great deal more weight than the majority of mass-market movies. On a sidenote, if you're one of those individuals primarly concerned with Tom's pretty face, Cameron Diaz' as a sexual figure, or anything else pop-culture, don't bother with this movie."}, {"rating": "10", "text": "Wonderful movie, one of my favorites. Starts off slow, but the ending blows you away. I loved it."}, {"rating": "6", "text": "This is one of those movies that had a great concept but didn"}, {"rating": "8", "text": "Cameron Crowe really has outdone himself in some of the movies he's made. This movie is no exception. Let me just make a personal note before I make this review. I'm one of those people that saw this movie for the first time and understood everything, and something I have to note about is that this movie is a true Cameron Crowe masterpiece if you actually understand it. I really went through a lot of emotions when I watched this movie, this is one of the more cinematic movies I've seen. From the music to the very clever lines, and to the story pulling all together on one very well made elevator scene. This movie has a really cool vibe to it from the moment it starts. Plus the ending is mind blowing. I really love Paul Mccartney's song played in the credits, it really brings you down to earth after seeing such a breathtaking ending. If you want to watch this movie go ahead, I think that some of the critics were a little rough on this movie. Heres a hint to watching this though, when you reach a scene that shows Tom in an Elevator with a man in a suit, pay attention to this scene, because it explains everything about this movie. Happy Watching."}, {"rating": "10", "text": "One of the most interesting unique plots ive ever seen in a movie with an unpredictable ending."}, {"rating": "6", "text": "It has a good soundtrack?  I really respect what “Vanilla Sky” is trying to do, weaving a complicated narrative, but it just doesn't gel.  Perhaps a different editor could have built a more enjoyable experience out of the pieces.  Even though I am a huge fan of Tom Cruise movies, he is just too \"Tom Cruisie\" in this one.  I give it a C, if you've already seen the best, but you insist on watching a movie, try this one out."}, {"rating": "5", "text": "For me the great soundtrack and cast are tainted by the convoluted plot and at time hyperactive edits. Despite this, it was a fascinating watch and at times quite entertaining. I would've marked it higher if not for the pointless explanation at the end....For the psychedelic  mystery genre it does a decent job falling just below decent."}, {"rating": "5", "text": "This is undoubtedly a bizarre watch but the real issue I found with it, is that the main character, David Aames, is really not likeable. Pretty much at all. I admit I'm not a big fan of Tom Cruise, which is partly why I hadn't seen this film until now. I heard that its partly about dreams and fantasy, the surreal and that aspect of it interested me, as I'm interested in quirky watches but this didn't really appeal to me. It felt like a pretty big ego trip for Cruise, with the main female characters being his characters love interests, there being various scenes of moderate to heavy flirtation going on and the rest of it.At first the film seemed relatively basic and I wondered what the fuss had been about it, as I knew it was the kind of film that people tend to want to re-watch, to see if they can understand things better, spot things earlier on, when re-watching it but it didn't seem too complicated at first, although that did change later on. I think that, for me, it was the cliches that jarred a bit too much for my liking. This is perhaps more a film for men than women? I don't know but I wasn't especially keen on it, although it is certainly quirky and bizarre, something a little different, although not without cliches. Overall, I suppose I'd say this is an average film. I think there are some interesting themes at play - showing your true identity etc. and I was intrigued a bit to try and discover more about what really happened, where the flashbacks present relate to different events but not everything is explained (its perhaps a bit David Lynch-esque) and I didn't feel I greatly enjoyed it, although it is a curious watch. Also it contains some good songs on the soundtrack, so thats a plus. Other people may well enjoy it more than I did but thats my thoughts on it. I don't think I would specifically recommend it as such but its not an entirely awful film, its just perhaps not quite as good as I feel it could have been."}, {"rating": "10", "text": "___________________________________________________________________________"}, {"rating": "10", "text": "The scene with Tom Cruise alone in Times Square is not computer enhanced. The production was given unprecedented permission to shut down Times Square for one Sunday. At the time, the news ticker was providing updates on the George W. Bush-Al Gore election. To avoid dating the film, Crowe got permission to change the NASDAQ sign in post-production."}, {"rating": "10", "text": "...........,,,,,,,,,,,,,,,,,kkmm@#$%^&*().,?!!;:\"+×÷=_€£▪○●□■☆⊙°•¤《》♡♡◇♧♤¡¿[]{}▪●■•▪⊙°°°●■▪°°°°》"}, {"rating": "10", "text": "$.$.$.$.$,$,$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》"}, {"rating": "10", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿:;:;:;:;;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"}, {"rating": "10", "text": "+++++++++++++++++++++++++++++÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "10", "text": "¡¿¡¿》¡¿¡¿》¡¿¡¿》¡¿¡¿》¡¿¡¿》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》¿¡¿¡》♡♡♡♡♡♡♤♡♡♡♡♡♡♡♤♤♤♤♤♤♤♤♤♡♤♡♤♡♤♤♤♤♤♤♤"}, {"rating": "10", "text": "¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¡¤¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"}, {"rating": "10", "text": "Tom Cruise's best movie with a fantastic supporting cast and clever surprises, A+."}], "recommendations": ["tomorrowland", "inception", "glass", "fear_and_loathing_in_las_vegas", "t2_trainspotting", "twelve_monkeys", "fight_club", "the_hobbit_an_unexpected_journey", "the_butterfly_effect", "the_chronicles_of_narnia_the_voyage_of_the_dawn_treader", "enemy", "the_13th_warrior", "cloud_atlas", "the_hunger_games_catching_fire", "inherent_vice", "john_carter", "hereafter", "hugo", "the_adjustment_bureau", "inferno", "demon_slayer_kimetsu_no_yaiba_to_the_swordsmith_village_", "the_conjuring_the_devil_made_me_do_it", "morbius", "chappie", "eternals"]}