{
  "id": 324,
  "title": "Vanquish",
  "starring": [
    "Ruby Rose",
    "Morgan Freeman"
  ],
  "runtime": 96,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "Victoria is a young mother trying to put her dark past as a Russian drug courier behind her, but retired cop Damon forces Victoria to do his bidding by holding her daughter hostage. Now, Victoria must use guns, guts and a motorcycle to take out a series of violent gangsters—or she may never see her child again.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/AoWY1gkcNzabh229Icboa1Ff0BM.jpg",
  "categories": {
    "plot": 1.0,
    "acting": 0.6666666666666666,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 1.0,
    "funny": 5.0,
    "action": 0.8333333333333334
  },
  "reviews": [
    {
      "rating": "0",
      "text": "I love action movies but this one is not a good one. The actress does not feel a good choice for the role (she nailed it in the Johnny Wick film but not her).I would rather recommend to watch nobody if you are into mayhem movies. Morgan Freeman is the one high point."
    },
    {
      "rating": "0",
      "text": "I got bored while watching this movie, so I'm writing a review.Story is boring. Colors are stupid and disgusting. Opening credits are so long I wanted to kill myself. Morgan Freeman is literally just sitting there and does nothing."
    },
    {
      "rating": "1",
      "text": "Vanquish: You probably never heard of this movie that’s a good thing. Why you may ask because it’s dull, I know I shouldn’t compare but look at John Wick for instance why do we love the movies the characters, the action and the world. The movie only has the actors nailed Ruby Rose and Morgan Freeman have proven they are talented especially Freeman in Hitman’s Wife’s Bodyguard, not to mention his tons more films like Seven. But here he’s just doing it for the pay I can tell his performance is so dull it’s not even worth it for him. Rose does good but still lifeless. The action good god it’s just boring there’s a motorcycle chase that goes on for way to long, let alone barely any action to begin with just dull. Take again Wick Chapter 3 there’s a motorcycle chase and it’s about 4 minutes full of action, long takes and it’s just fun to watch. Here though nobody is fighting back and it’s not fun to watch I was waiting for it to end. Now my main gripe with this movie is the editing because they do some either cliché edits or down right stupid like a kid discovering how to make cool transitions in PowerPoint it’s terrible, not to mention the dumb green filter like your looking at a GameBoy screen up close. Overall this is a not very good movie shoty editing, dull action and acting, a generic plot of I want you to do something for me, person refused, other person takes something from that person and they now do it, just don’t watch this it’s not worth it. Ranking Bad."
    }
  ]
}