{
  "id": 3571,
  "title": "Vantage Point",
  "starring": [
    "Dennis Quaid",
    "Matthew Fox"
  ],
  "runtime": 90,
  "genre": [
    "Drama",
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "The attempted assassination of the American president is told and re-told from several different perspectives.",
  "releaseYear": "2008",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4mSh7NZiW36rUbpIgcKeGVcbSSx.jpg",
  "categories": {
    "plot": 4.8,
    "acting": 4.230769230769231,
    "ending": 4.888888888888889,
    "soundtrack": 5.0,
    "cinematography": 3.5,
    "familyFriendly": 6.0,
    "funny": 2.0,
    "action": 4.9
  },
  "reviews": [
    {
      "rating": "8",
      "text": "With really great acting, well made action scenes and an interesting scenario, Vantage Point is a movie that hit pretty hard.Even though there is some minor plot holes and some situations are unbelievable, it's still a good entertaining movie."
    },
    {
      "rating": "5",
      "text": "The concept was good: show different perspectives of the same event. The problem is that it's unrealistic. Not the attempt on the President, but the terrorists plan would never unfold in such a way. First, the traitor secret service member is becoming cliche. Further, the secret service takes regular polygraphs to ensure loyalty. Second, the single special forces guy who is able to take out secret service control single-handed. The secret service are some of the best trained agents in the world, many of which have special forces training. It's ridiculous to think one guy could kidnap the President. And for some reason, no one was wearing bulletproof vests. Next, the meeting point had to be only a short way from the target so Forest Whitaker could save the little girl, but there is no way a terrorist group would do anything but run as far as possible. Lastly and what was the hardest to believe was that a terrorist who just orchestrated multiple bombings and murders who swerve and endanger his plan when a child stepped in front of his car rather than simply run her down. He most likely just killed a dozen children with bombs, but he hesitates to run another down. It's just not common sense. So while a good premise, terrible terrible execution."
    },
    {
      "rating": "10",
      "text": "Very realistic situation of a thriller. Reminds me of Real-life 9/11. Very intelegent way of perception this film has."
    },
    {
      "rating": "3",
      "text": "There are two reasons to watch this movie: the first five minutes and the main car chase. Other than that, nothing. I thought the idea of watching different points of view would be an interesting concept, but it becomes tedious very quickly. This movie is just so completely implausible. And when people say that the ending becomes ludicrious...well, the movie isn't even 90 minutes long and \"the ending\" they're spreaking about actually consists of OVER 1/3 of the movie. Way too many impossibilities and ridiculous scenarios they throw at you. Spend your time on something better!"
    },
    {
      "rating": "4",
      "text": "Vantage Point is a difficult movie for me to rate. It has good action, acting, and a good enough premise. However, going back in time 8 times makes the movie feel tedious and the conclusion is not satisfying enough to make the long 2 hours worth the wait. Overall, it isn't a bad movie, but compared to what it could have been, it is weak and unsatisfying."
    },
    {
      "rating": "8",
      "text": "I don't get why this movie was panned. I thought I would be bored to tears because of the way it was described by the critics, but I found it very interesting and entertaining, enough to want to know how it ends. And it does end satisfactorily, which is something I can't say for a lot of movies lately (Spanglish, Be Kind, Rewind, anyone?) Certainly not worse than most action films."
    },
    {
      "rating": "3",
      "text": "Car chase scene is not terrible, but movie suffers from a loss of momentum since it replays every 10 minutes or so, each time adding on a bit more. Potential was there, but doesn't live up to the idea. Not worth it."
    },
    {
      "rating": "1",
      "text": "They always lure you with the trailers in the theaters. The trailer was much better and suspenseful than the movie. A TV movie or (Lost) has more suspense in it than this movie, relatively speaking. That goes to show that writing a script worth while is much more difficult than some special effects. But they knew they were going to get their money because people would go see it anyway."
    },
    {
      "rating": "10",
      "text": "The movie takes you to a thrilling ride only to take you back again without finishing, leaving you hanging. And when that cycle ends, you are blown away. Spectacular action sequences, brilliant editing, relevant plot, though too unrealistic. But it succeeds more than any commercial post 911 film has done, because it immerses you on what the war on terror really is for normal people like us."
    },
    {
      "rating": "1",
      "text": "No offense to anyone involved, but this movie was honestly a waste of time and money. If you think about it carefully, the movie is only really 15 minutes, which includes the little adventurous car chases and highway runs and one episode of the president being assainated. The rest of the 90 minutes was a repeated disaster of the presidents speech and the explosion. Everyone seemed to have the same point of view on what happened, which seemed ridiculous and repetitive. I just wish that the scene would have changed for everyone's point of views, and that everything wasn't repeated so much. The ending was the only part that really grasped attention. The rest needed work."
    },
    {
      "rating": "6",
      "text": "From a reality standpoint this gets a 0, but from a fun time in the theater, at least after the 4th reset, this movie satisfies. Are there things I would do to make this better? Yes there's a long list, but going in with low expectations, I enjoyed the ride."
    },
    {
      "rating": "10",
      "text": "This was an amazing production......it was a captivating thriller that kept you guessing until the end. Well executed and masterfully assembled. no moment of pause and amazing action scenes mixed with clever plot planning."
    },
    {
      "rating": "3",
      "text": "The movie is so stereotypical, that i can't believe i even found this movie somewhat appealing. The idea of viewpoints sounds wonderful (main reason i even gave this movie a 3), but it becomes tedious, revisited and in the end abandoned for an all out momentum, we-dont-have-enough-of-a-budget-to-add-more-viewpoints. There is almost no character development, and all the characters are typical and uninteresting. Despite half the cast dying somewhere in the movie, without much emotion, the plot could've worked with some enhanced character development. Forest Whitaker acts decently, but seems to fit in the Forest Whitaker type of role, barely causing for major acclaim. The movie was just awful really, yet could keep you somewhat appealled for the first time in theatres. - Einar J."
    },
    {
      "rating": "1",
      "text": "Distinguished by a plot so convoluted that even on reflection it can't be explained, and distinguished most by Dennis Quaid's gritted teeth, this is one major flop."
    },
    {
      "rating": "0",
      "text": "I am not judging certain aspects, but the motion capture was terrible. In the very first scene I just knew what the rest was going to be like. Vantage Point lacks on just about everything, and provokes the could-have-been good entertainment. Even sitting their for 1 hour and a half was stressful. My cheeks could not have been more aching, and frustrated. I can stand a long 3 hour movie, but not being able to stand 1hour and a half is ridiculous. This movie is ridiculous, the action was hard to watch, and weak too. I am very disappointed. 0/10 is my average, some might say thats way too low!!! Well trust me, this movie is awful, horrible, and terrible. It was a complete rip-off, with predictable ends, and no mysterious plots, it is obvious what happens. And the twists were not even mind-bending. Sorry if your confused but this movie was weak and terrible."
    },
    {
      "rating": "0",
      "text": "There always is something to like about a movie, but this one doesn't have one single thing. The posters and ads look cool and exciting, twisting, engaging, and awsome. And the movie keeps those elements retained to the story, to make it look better, and it does. But in my opinion, it was just a poor execution. It has a style that is similar to \"The Kingdom\", \"The Bourne Ultimatum\", but on the most part, it seems as if director Pete Traivs was doing nothing but presenting a stunning visual of action, chasing, violence, and fast-pace. It looked like he was trying to copy a Bourne movie or something because while he thought their was a really engaging story in the capture of the audience, the audience remains either confused or dulled out. It was absolutely weak! The script is terrible, Peter Travis tried the best he could to rushingly move such a dull plot and weak story. The assasination wasn't very grabbing. And here's the main thing, it starts off showing an assasination with a visual look around for about 7 minutes. And then it is nothing but people working together as if they know exactly what to do. There were average citizens working with high priority agents seemingly knwoing how to do things, survive car collisions, handling guns, chasing suspects, and helping investigations. And for 1 hour and 10 minutes there was nothing but watching video tapes, quickly getting information from witnesses, chasing suspetcs, car chases, public chases, shootings, very short and fast-talking deliberation, and pure action. This certainly isn't a dram/thriller/suspense, its more of an action/thriller. But once again, 2008 offers another marginally dissapointing piece of work. The writing was cheesy, everything went so fast. Pete Travis was doing nothing but focus on action, when he could have worked a whole lot more on story, character development, and deliberation, and at least a few breaks, (Which unfortanutely he never does). He never gives up, he keeps on going with the action, and after a while you just wan't to say ENOUGH! Right in the theatre. And the sad part is while it could have a been an okay 5 or 6/10 movie, it fails on suceedingly intense action. The action was weak, and poorly screen written, the events in each scene or sequence are either impossibley concluded or just relentlessly stupid, with each view having a dull break or bore added in. Well this film could have been way more hot and juicy, but all it was is a lame, absolutely piece of crap."
    },
    {
      "rating": "0",
      "text": "If you want to see some real action that stays true to whats happening in the story and to the characters, watch any of the Die hard movies or Bounre movies. Because this is probably the worst action movie I have ever seen. There was no single twist, or any thought convincing fun. This was completely boring, dull, and collosally stupid. If I were to see one movie this year that would be worth price of admissiom then I would see There Will Be Blood, aparently nominated for 8 academy awards, one for best leading role, and another for best motion picture of the year. Anything else that has tried an approach to the big screen this year lately has been implemented to be awfully stupid. And I have to say, after the pass of two months into the year, I am quite dissapointed having there being said that only There Will Be Blood and The Spiderwick Chronicles are the only goodie-goos of the year so far. As far as we can see only those two are winning Oscars like flying colours for 2008 films. Like c'mon, there has been nothing but low reviews for any film being released. E.G: Rambo, Jumper, The Bucket List, Colverfield, veggietales, etc, etc, they all suck. And this is no different, but worse, there has no touch of heart, engagement, or fun. Its too serious, and runs out of ideas right after the president gets shot."
    },
    {
      "rating": "0",
      "text": "People, this movie sucks. There is no question. I was bored right when the first scene even started. I wasn't even excited for this. A total waste of my time. I wish I went to go see jumper whcih actually is marginally better than this."
    },
    {
      "rating": "10",
      "text": "By far one of the greatest movies i've ever seen. It was suspensful and it had me itching for more. It was extremely creative that they showed the same thing 8 times. Different views of course. Dennis Quaid was extremely good and they other actors were too. I gave it a ten out of ten, those who didn't didn't appreciate its creativity and action!"
    },
    {
      "rating": "1",
      "text": "movie was horrible. boring."
    },
    {
      "rating": "4",
      "text": "slightly entertaining, however mostly from the reaction by the audience! if you are ready to watch the same scene for an hour, with slightly different perspectives. the twist is actually pretty good, however there are so many holes with actors and scenes, that it makes for a dull ending. the line at the end with quaid is comical, i couldnt countain my laughter! At the end you realize that the car chase was not up to par, that you didnt know where the other supposed main actors and actresses went like sigourney weaver, and the secret service during the chase. it could have been a hit, but sadly there is no top performer to save the movie, the trailer is about the only thing here worth watching, as it usually always is!"
    },
    {
      "rating": "2",
      "text": "Positively dreadful. No character development, no back story, no intelligence. The action scenes are nauseating. Totally implausible plot. Can't even enjoy it as a mindless thriller, only mindless. The dialogue is laughable; in fact, many in my theatre were giggling (between the groaning). P e e-y e w!!"
    },
    {
      "rating": "0",
      "text": "NoDoz anyone? Just awful!"
    },
    {
      "rating": "7",
      "text": "Not the best movie, but definitely kept me entertained. I liked that each viewpoint brought to light new information while including elements (including off camera sound effects!!) from the previous view points. However, while I'm normally one to forgive some continuity and other editing gaffs, this movie suffers from some biggies. They usually only momentarily jarred me out of my focus on the movie, but it was frequent and obvious enough to be very annoying."
    },
    {
      "rating": "9",
      "text": "There was a lot of action and all the vantage points fit together. It was great!!!"
    },
    {
      "rating": "7",
      "text": "Not as bad as the critics claim. Just enjoy the ride."
    },
    {
      "rating": "2",
      "text": "Forest Whitaker needs to redeem himself for his horrible performance in this film. Sigouney Weaver was not needed for the role she played. Anybody can shout \"Camera 1\" \"Camera 2, I'm losing you!\" It's been a long time since I've sat in a movie theater and heard people laughing out loud at a movie that's not a comedy."
    },
    {
      "rating": "10",
      "text": "AMAZING thriller and car chase."
    },
    {
      "rating": "8",
      "text": "Saw this at a $2 theatre...besides the rip in the screen, I was on the edge of my seat for the complete last half of the movie. The characters seemed to fit well into their parts and the car chase scene was well done. The conspiracy theme wasn't too disturbing except for the poor untrained Secret Service actors...(they really are alot tougher and smarter than directors make them to be ((I'm ex-military)). I really enjoyed the last few minutes...how all the parts collided together...nice twist. Fairly nice plot altogether. Kudos to William Hurt's character for being the gentleman president with a little common sense and straight thinking. -not a warhawk, nor weak-knee kind of guy."
    },
    {
      "rating": "9",
      "text": "Many people won't like the narrative arc, but I was totally mesmerized by it. The car case blows its rivals out of the water!!!"
    },
    {
      "rating": "9",
      "text": "The best movie since '' The Rock '' and '' Heat ''. Surprising and interesting. A good cast and good interpretations. Nice soundtrack."
    },
    {
      "rating": "5",
      "text": "An interesting comcept is developed fairly well but never takes full advantage of its potential. Although I couldn't believe a minute of it, I wasn't bored."
    },
    {
      "rating": "5",
      "text": "This film starts very promisingly but quickly becomes increasingly tedious and unbelievable. There is some entertainment to be had from watching it but ultimately it leaves you feeling unsatisfied."
    },
    {
      "rating": "9",
      "text": "I think it would be a wise choice for people to actually watch a movie they are voting and reviewing before they do said voting/reviewing, please, kthxbye."
    },
    {
      "rating": "4",
      "text": "O.K, I gotta get this off my chest first. This movie could have been soooooo much more. I'm a huge fan of whodunnits, especially one with presidents and car chases. So, naturally, I figured that this movie would be awesome. Unfortunately, this film came off as dry, and a little bit cheesy. Dennis Quaid, who I think is a pretty good actor, was so corny, I couldn't really listen to what he was saying with a straight face. Also, watching what we've seen before 8 times, was unique, but the directors could have mixed it up a little. It always ended with the same blinking digital lights. The whole theater was laughing by the last one. All that being said, it has a few moments where it twinkles. Not shines, but twinkles. Forest Whitaker was by far the best actor in the whole movie. I actually cared about what was happening to him, unlike most everyone else. In addition, the twists were kinda neat. You don't really suspect most of them (though there are a few that were so obvious, my 10-year old brother guessed 'em in the first half hour.) But most of all, in the last few minutes, there is about a 20 second shot that...well..I don't even want to give away any details. Did I mention that some parts twinkle? This shot is a freakin' supernova. I can't stress enough how amazing this last shot is; probably on par with the infamous \"Exploding White House\" from Independence Day, (though nothing like it in substance.) Too bad, it'll remain buried in this sub-par movie. Anyway, I digress. You'd probably want to spend your money on something else, like Be Kind Rewind. Better yet, stay home, and watch Independence Day. At least there, the president kicks some @$$."
    },
    {
      "rating": "8",
      "text": "This movie is not nearly as bad as the critics say and a good few of these user reviews say. If you are looking for a solid action movie and aren't expecting the Oscar winner for best picture then there is no doubt that you will enjoy vantage point. The car chase scene is very bourne esque and while the first 1/3 to first 1/2 of the movie is a little redundant with all the rewinding and then reviewing of nearly the same thing over again from a different vantage point the second half definitely makes up for everything and is extremely good. But like i said, its a good big screen action movie but not a departed or gladiator or braveheart type of quality movie."
    },
    {
      "rating": "0",
      "text": "Horrid. It reminded me of the old Saturday Night Live Skit where Buckwheat was shot...Over and over again - we watched the same pathetic movie clip - at least SNL was supposed to be funny; this movie just ended up making us laugh in the same manner. It made me think about I am Legend and realize that there actually is worse movie made this year. I also think that how in the world could any studio read this script and say - oh yes here is a blockbuster - well at least the everyone will get a nice payday; they should give the largest part of the money to the guy who pieced together the trailer, if he would have directed the movie - it might have been exciting. Not."
    },
    {
      "rating": "7",
      "text": "Only time you see the same explosion five different times. This movie goes fast if you like action."
    },
    {
      "rating": "4",
      "text": "A strange, less than credible mix of Groundhog Day and Crash--without the literate screenplay and superior acting--Vantage Point wants us to believe that Dennis Quaid is apparently from the planet Krypton and is completely industructible and that stampeding Spaniards can miraculously avoid runaway, high speed police cars, ambulances and gunshots. The audience in my theater literally talked to the screen during the last two \"rewinds\" in frustration--and the little girl, Anna, elicited giggles for her improbable and oh-so-obvious plot placement. This could have been a very interesting film in the hands of a better writer and director. Instead, Forrest Whitaker looks lost and embarrassed, and the starry cast has to work hard to sell this dialogue. I wanted this to work--but it's a bit of cheese."
    },
    {
      "rating": "7",
      "text": "I didn't think it was awful, yes it was drawn out, and a little predictable at some parts, but it was mostly well acted, good special effects and action, and a decent plot. it was an average film that i would of been a little more disappointed if I had paid to see it. Also it draws out to a point that is boring, but brings you back in towards the end of the middle"
    },
    {
      "rating": "9",
      "text": "This movie deserves an 8, but i'm giving it a nine to increase the user vote. I think this movie achieved everything it set out to do. I don't think the same story would have been suspenseful or dramatic enough if told from linearly or from a single point of view. It never got nauseated and there were quite a few edge of your seat scenes. Was it a perfect thriller? Of course not. Audiences have gotten used to the formulas and are smart enough to know it has to be tied up somehow. But stylistically, the movie worked and that's enough for a solid thumbs up."
    },
    {
      "rating": "10",
      "text": "Exciting and smart and fun and full of action. I enjoyed every minute. I was surprised by all the negative reviews to be honest. I thought it was purely enjoyable. I wished the end was a little less \"Hollywood\" and stuck more with the structure of the beginning. But overall, I loved it."
    },
    {
      "rating": "10",
      "text": "the best movie ever. Its a great brian teaser. You cant watch it without finishing it. You should go see it. You will love it!"
    },
    {
      "rating": "5",
      "text": "You have to go into this movie knowing it uses the Groundhog Day scenario, but you don't have to go in hoping to get more than you asked for, which is a repetitive thrill ride."
    },
    {
      "rating": "7",
      "text": "Yes the first few vantages were not nessesary, but other than that this was a good movie."
    },
    {
      "rating": "1",
      "text": "I'll be honest, the trailer was more exciting then the movie. You had to watch through 7 \"vantage points\" until you saw the 8th one which filled in the real details. Seems like they only needed about 4 people in the movie to tell the story. When the movie was finished with everyone's \"vantage point\", it seemed like they ended it so quickly. And was it my imagination, or did those car chases seem to take a long time, but only ended up going a few blocks from the shooting."
    },
    {
      "rating": "2",
      "text": "It was entertaining until the second vantage point, when it became monotonous...every vantage point had *some* new information, but I felt it was honestly just a big filler. And by the third..and the fourth...I was ready to leave the theater. the only reason I stayed was because I was with friends, plus I wanted to finish my popcorn. The only parts I found exciting were the first couple of vantage points and then the ending; the rest felt like listening to a broken record player. Don't watch this movie; you'll never get that hour of your life back."
    },
    {
      "rating": "5",
      "text": "The movie was basically ok in terms of action however, I would like to point out that the next time a film is supposed to take place in a white european country such as Spain, that they shouldn"
    },
    {
      "rating": "0",
      "text": "Complete trash. Each vantage point up to the fourth offers no new useful information. I walked out after the fourth."
    },
    {
      "rating": "6",
      "text": "I saw Vantage Point tonight. It's sad that this light action film made every critic wonder why it was \"no Rashomon.\" Here's a tip: there hasn't been another Rashomon since Rashomon. I'm not saying this was a classic action film, but it was hardly \"dreadful\" or an \"unholy mess,\" as Travers and Morgenstern complain. Ryan Stewart provides the most accurate adjective: \"serviceable.\" It's 40 probably should have been a 58-59. Nothing mindblowing, but satisfactory. I might not give it my fullest recommendation, but it was certainly not, as the metacritic score would have you believe, worse than Fred Claus."
    }
  ]
}