{
  "id": 2137,
  "title": "Vehicle 19",
  "starring": [
    "Paul Walker",
    "Naima McLean"
  ],
  "runtime": 85,
  "genre": [
    "Thriller",
    "Action"
  ],
  "description": "A parolee becomes the target of a massive police manhunt after inadvertently picking up a rental car with a female whistleblower tied up in the trunk. Now, as the police attempt to silence the woman before she can testify about the city's rampant corruption, the ex-con who just regained his freedom must defend her life, and clear his own name.",
  "releaseYear": "2013",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/vRZobS1s3ojOpLFUbFVb2k1qDQI.jpg",
  "categories": {
    "plot": 4.7,
    "acting": 4.142857142857143,
    "ending": 3.0,
    "soundtrack": 3.0,
    "cinematography": 3.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Very simple concept in which whole story takes place in a car. This low budget movie was not actually a bad. It is one of the last movies of Paul Walker. He was excellent, though the movie was B due to the poor production quality yet quite enjoyable.\r Paul Walker as Michael, an ex prisoner who goes to meet his girlfriend who is in a foreign country. All the sudden he gets trapped into some local criminal affair without his knowledge. So the hunt begins where he tries his best to escape it.\r The movie was not for everyone, you can get better movie than this though I must be honest that I saw it because of Paul Walker."
    },
    {
      "rating": "3",
      "text": "It becomes clear within the opening fifteen minutes that Vehicle 19 is fundamentally flawed. There's not much logic in the plot and it really needs audience to suspense their disbelief. Having Paul Walker doesn't help in the slightest as he's given so little to work with, not to mention there's no merit in cinematography as it's almost entirely shot in that one car. The overcompensating music is loud enough for monster truck.\r Michael Woods (Paul Walker) is a former convict, he goes to Johannesburg to see his loved one. Unfortunately, he takes a wrong car from the rental, containing some illicit packaged stashed inside. This revelation will plunge him into the city's conspiracy and corruption. Now most people would freak out if they find spiders on their cars, but Michael Woods chooses a different unnatural reaction. It's unclear if Paul Walkers was still engrossed in his Fast and Furious character and thought he could drift the trouble away or he's channeling Jason Statham's character from Transporter.\r Heck, even Transporter had the audacity of presenting goofy action, Vehicle 19 wants you to take it seriously as thriller despite the highly unrealistic script. This makes me wonder how the script got passed in the first place, why there was no one proofread it, point to a certain scene, any scene for that matter, and express how implausible it was. Furthermore, half of it is rambling and random shouting, but the characters still go along with the absurdity.\r There is not much development as it progresses, only stifling dialogues, strange change in behavior and a few unbelievable occurrences. By the time it reaches halfway point, the movie produces a numbing effect. The use of Johannesburg as setting is actually a good decision, it's exotic and adds to the atmosphere. However, since most time is spent on the car, it brings little value in the end. It's not like this is Collateral where the production incorporate the scenery into an integral part of the movie, it just drives by aimlessly.\r The end is just as bad, so without spoiling anything, it's not worth tolerating the entirety of the movie. Vehicle 19 is bound for junkyard."
    },
    {
      "rating": "5",
      "text": "A simple movie...but i don't like this.A boring story with a great actor.\r ***************************************************************************"
    },
    {
      "rating": "5",
      "text": "Vehicle 19 wasn't horrible but it was mediocre. It has drugs, cars and blood. What action junkies want, right? Well, yes and no, because of Paul Walker the film has the Fast And Furious type thrill. The film is very cheesy and with a low capacity for talking- it's get to the point action. What I didn't like was that the acting by all the other roles was slow and corny. In the end- not perfect, not bad but a time pass rental after a long night at work."
    },
    {
      "rating": "8",
      "text": "I was really not a fan of this movie.  As you can see from the other ratings, it just really didn't have a great cast of characters or plot at all.  Testing."
    },
    {
      "rating": "5",
      "text": "It's a ok movie for what it is the movie is in the car for the whole movie but if you liked this movie then check out a movie called \"HOURS\" with Paul Walker so FASTEN YOUR SEAT BELT!"
    },
    {
      "rating": "4",
      "text": "There's a movie out there called Locke starring Tom Hardy and in that movie he's in the car the whole time and well that's a better well written movie then this (Just saying)\r The story is about a recently paroled man unwittingly picks up the wrong rental vehicle, having just got off a long haul flight. He soon realizes that he is the target of an entire police force that will use any means necessary to stop him and the tied up female \"passenger\" he discovers in the trunk, from getting to the courthouse to testify against top-to-bottom local corruption.\r I got to be honest here the only reason I watched this movie is because of the sad lost of Paul Walker. I normally do this when a big name star dies and their very last performance you every going to see them in that I normally go searching for the last role so I can see them one last time, and thank god Paul's last role was in Furious 7 and not this movie because Vehicle 19 is seriously not that good.\r Vehicle 19 tries to be smart and original and some how comes off a stick in the mood who framed me or who's after me story line that's turning into a cliche now as every movie is doing that.\r If you haven't seen my Furious 7 review (Which you should) I already give a little tribute to the late great Paul Walker at his finest, but in this movie he looks like his about to go to sleep feeling bored which is basically me watching this movie. He didn't do a bad job but he didn't do nothing outstanding. Paul buddy I miss you and I respect you as a person but you look like you don't want to be there and I won't blame you on that.\r The movie overall tries to do something groundbreaking and something new which back fired."
    },
    {
      "rating": "3",
      "text": "Plot was refreshing. Paul's acting specially toward the later half was good. The camera usage laced inside the car was very unique. Not seen many movies with this kind of attempt.What screwed up the movie for me was the numerous logical errors right from start. Car company gives a rental without checking and cleaning out the vehicle? Why would a person in a new country rent a car...instead of using a taxi or Super Shuttle or whatever? In 2011 who does not have a smartphone which has GPS capability? Who does not come prepared to a new country without specific instructions to reach the US Embassy? Paul takes so much time to decide to spray his car. If you are a criminal on the run the first thing you would do is to ditch your vehicle and try using another. Or just hire a cab to get to US embassy.A different Director would have made this a great movie. Sorry I cannot go beyond 5 in rating this movie"
    }
  ]
}