{"id": 2, "title": "Venom: Let There Be Carnage", "starring": ["Tom Hardy", "Woody Harrelson"], "runtime": 97, "genre": ["Science Fiction", "Action", "Adventure"], "description": "After finding a host body in investigative reporter Eddie Brock, the alien symbiote must face a new enemy, Carnage, the alter ego of serial killer Cletus Kasady.", "releaseYear": "2021", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/rjkmN1dniUHVYAtwuV3Tji7FsDO.jpg", "categories": {"plot": 5.777777777777778, "acting": 5.384615384615385, "ending": 7.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.0, "action": 6.4}, "reviews": [{"rating": "8", "text": "Venom Let there be carnage embraces and accepts its ridiculousness, that makes it a Great comic book movie, Bravo."}, {"rating": "9", "text": "Vibrant, fast paced, and entertaining movie. The second one in the Sony's Spider-Man Universe.Definitely much better and more thrilling than the first \"Venom\" movie. Woody's acting can't be disappointing and there he confirmed his great acting skills.Certainly the movie had some bad moments, but generally Andy Serkis and Tom Hardy did a good job. Can't wait for Morbius in 2022."}, {"rating": "10", "text": "This movie is short, but it's still good. I'm sure whoever liked the first movie will like this one."}, {"rating": "10", "text": "It was AMAZING! I love Venim, I definitely want him to meet Spider-Man ASAP."}, {"rating": "8", "text": "This is a great improvement.This sequel is much better than the first movie."}, {"rating": "9", "text": "I watched Venom 2 yesterday and I liked it. Beware,light spoilers ahead!Hardy and Serkis did a great job carefuly transferring the most interesting part of the first movie into the second one. Regretably,not everyone understands that this is not a marvel \"save-the-world-again-from-a-cliche-enemy\" movie. This a sitcom. The most interesting and intriguing part of the movie is the relationship betbeen Venom and its host. This movie is not a blockbuster. Dont expect to see someone saving the world. This entirely relationship comedy with beautiful visual effects and a descent (maybe not the very best,but still) play from Woody and Hardy boy. Every host in the Sony Marvel Universe received a simbiot similar to his personal character. The first movie villain was all bossy and self-esteemed. Brock got and outcast with a very low level of intellectual behavior. Woody was gifted with a badass maniac. Not so good as he was in the original story,but hey,this is a movie for kids. They still did their best coming as close as they could to total massacre. Serkis did excellent job visualising   every scene in his own,unique way. The only thing i didnt like is that sometimes there was no ending to the one scene before switching to the other - its like he got bored with one scene and just switched to the next one. Still,highly recommended. A lot better than \"Black widdow\" and is just as funy as \"Jackie Chan and the nine rings of power\" ."}, {"rating": "10", "text": "This movie is super fun and so easy to watch. Sony definitely did a good job adding to the first film and this movie leaves you wanting more. It’s no Academy Award winner, but it’s absolutely entertaining. It’s goofy, funny, at times even scary. Andy Serkis some how made it all work."}, {"rating": "10", "text": "If journalists hate it then it's a very good movie, not political agenda **** just a good buddy movie and everyone need to see it"}, {"rating": "7", "text": "“Venom Let There Be Carnage” is pretty good. Coming in at a 1 Hour And 30 Minutes Run time this movie is damn good fun if you can overlook all its flaws. From a Critical standpoint this movie has a lot of flaws and isn’t the best movie to grace the screen, but it is damn good fun. The action sequences are way better than 2018’s “Venom” and you can actually see what is going on during the action sequences. The PG-13 does hold this movie back though just like it’s predecessor. The story is ridiculous like the first, but let’s be honest who comes to watch Venom for the story. If that is what you are looking for, I think you will be disappointed. But overall, the pacing is extremely fast and crazy just like it’s great final sequence with Venom Vs. Carnage. The Post Credit scene is fantastic and without any spoilers is worth a ticket for admission alone. Overall, I recommended this movie to fans for marvel and is a step in the right direction from its predecessors. If you can shut off your brain, and not take this movie seriously you will have a great time.  And Yes, There’s A Lot Of Carnage…"}, {"rating": "5", "text": "Venom: let there be carnage is loaded with good special effects, more comedy than originally anticipated and solid performances from both Hardy and Harrelson. However, ultimately the newest installment in the Venom series turned out a sloppy missed opportunity, yearning for that R rating."}, {"rating": "6", "text": "Venom: Let There Be Carnage is the sequel to the standalone film Venom, in which journalist Eddie Brock was bonded to the alien symbiote, Venom, and became our anti-hero. In it, we have Eddie Brock doing investigative journalism on the serial killer Cletus Kasady and eventually gets bitten by Kasady who is exposed to his blood and becomes infused to a red symbiote, Carnage, who is evil and wants revenge on Brock. Carnage breaks out of prison and frees Kasady's girlfriend, Shriek, however, Carnage soon grows tired of Shriek as her powers involve shrieking and causing irritating noise, one of the symbiote's weaknesses. Eddie is turned down by his love interest in the movie, which actually largely played up for laughs. Venom and Eddie have trouble getting along, so the symbiote leaves Eddie at one point and literally just starts raging at a rave. At the end of the film, the movie takes place in a cathedral where Shriek and Kasady are wed, and they kidnap Brock's love interest so Venom is there to battle Carnage. Venom is triumphant in the end and there is a end-credit sequence which references Spider-Man: No Way Home. Overall, this was a pretty fast-paced, short-lived movie that probably had too much cringey comic relief. It was still entertaining and pretty fun though."}, {"rating": "6", "text": "Pt-BR: Foi um filme divertido de assistir, mas a sensação que transmite é que ele foi feito para crianças. Com piadas infantis e um mal desenvolvimento de um dos vilões do filme, ele não consegue usufruir de toda a história do Venom nos quadrinhos. Foi interessante ter o carnificina como vilão do Venom, mas foi muito mais interessante ver o Kasady como vilão do Eddie Brook uma vez que o personagem foi muito mais aproveitado em relação ao próprio carnificina. A cena pós crédito do filme foi fantástica para o futuro de como veremos o futuro da Marvel e da Sony no cinema.En-US: It was a fun movie to watch, but the feeling is it was made for kids. With childish jokes and a poor development by one of the film's villains, he can't show us the entire Venom story like the comics. It was interesting to have the carnage as Venom's villain, but it was much more interesting to see Kasady as Eddie Brook's villain since the character was much more leveraged in relation to the carnage itself. The film's post-credit scene was fantastic for the future of how we're going to see the future of Marvel and Sony in film."}, {"rating": "2", "text": "Where do I start? Venom’s second movie and third onscreen appearance and they still didn’t get it right. Eddie Brock (Tom Hardy) is attempting to reignite his failing career as a journalist. When the opportunity to interview notorious serial killer Cletus Kasady (Woody Harrelson) arises he cannot pass up the chance of the interview of a lifetime. Things don’t go according to plan for Eddie and Cletus becomes infected by the symbiote Carnage who proceeds to skip his execution and bust out of prison. Chaos then ensues.I wasn’t exactly a fan of Venom but it made nearly a billion at the box office so lucky for us we got a sequel. I had slightly higher expectations this time around due to Andy Serkis taking over as director. No offence intended towards Tom Hardy but I never felt he was right for Venom and the role would have been better suited going to Andy Serkis instead but sure we’re here now. The scenes with Harrelson and Naomie Harris are giving strong Natural Born Killers vibes and honestly the only good thing I got from Venom: Let There Be Carnage is Woody Harrelson, he’s a show stealer in any scene he’s in. The rest of the movie feels like a buddy bromance movie between Eddie and Venom. It’s silly, ridiculous and not nearly as violent as it should be although it clearly found some sort of an audience. It didn’t make as much money at the box office compared to the first Venom but considering the state of the world right now it did quite well. The build up to the epic showdown between Venom and Carnage was just another CGI overloaded fight scene. Underwhelming and a quickly forgettable movie. I honestly don’t know why I keep putting myself through this.Look the only way you’re going to enjoy Venom: Let There Be Carnage is to have your expectations as low as possible and just maybe you’ll find it a bit of fun. It knows it’s not a serious comic book movie and it doesn’t try to be either. Recommended for fans of the first Venom movie."}, {"rating": "2", "text": "Der Film geht zwar 90 Minuten. Er hätte aber von dem was er erzählt ruhig noch 30 Minuten kürzer sein. Leider existiert dieser Film nur für seine Post-Credit Szene. Carnage ist zwar super gecastet, aber furchtbar geschrieben. Den Film will ich wirklich nicht mehr sehen..."}, {"rating": "2", "text": "Beh, ho avuto esattamente quello che mi aspettavo: il primo film, ma molto peggio.I personaggi sono veramente stupidi o scarni, i dialoghi sono di un infantile pauroso, per non parlare di una trama che va avanti perché sì. E le scene d'azione sono da sbocco più che mai. Ve lo giuro, non ci hanno nemmeno provato. L'ho visto solo perché invitato e mi andava di stare in compagnia, sennò neanche con un palo lungo tre metri l'avrei mai toccato questo film.Consigliato? Ho trovato giusto il secondo nome alla pellicola, che gli calza alla perfezione: \"Non ci hanno nemmeno provato: il film\"."}, {"rating": "3", "text": "Hardy es increíble, los sets CGI son geniales, aunque los monstruos parecen figuras de plástico. Es una película corta y llena de acción, pero está desprovista de emoción."}, {"rating": "3", "text": "Carnage's voice isn't high pitched and he is taller and bigger than venom i think ı don't have to tell anything more to express how bad this movie is"}, {"rating": "7", "text": "7.5/10They really make Venom a way comedic character than the first one, and sometimes it was too much and it bothered me, and sometimes it works so overall i still enjoy Venom, while Carnage is just an absolute carnage, he was amazingly scary, terrifying, and brutal, he was really the best thing in the movie despite being the villain, Shriek was alright, i didn't hate her but i felt she was just unnecessary, Anne, Dan, and Mrs. Chen have a good performance, the final battle was solid and the post-credit scene was great, overall Venom Let There Be Carnage still not as good as the first one but it still a pretty good movie."}, {"rating": "1", "text": "This movie is trash. Start with the corny and lame origin of Cletus and the horrible race swap casting of shriek. There are an unending amount of stupid plot holes, an a non existent story. Do not watch this crappy movie."}, {"rating": "1", "text": "This movie is about two highschool buddies fighting around and acting goofy, which is Great! The bad thing is that they are not actually highschoolers but the god damn Venom and hardy!"}, {"rating": "3", "text": "This movie can be characterised as a family drama and comedy from one side (Venom and Brock) and criminal / horror from another side (Cletus and Carnage). The problem is that 1) the 1st component is absolutely ridiculous and uninspiring but takes up to 70% of the movie; 2) the two components do not combine together at all, although the 2nd component is somewhat good; 3) there is only one confrontation between the two components like an afterthought and does not tie the movie in any meaningful way. End result - disjointed, unfocused, messy, void of meaning movie that is completely unsalvageable."}, {"rating": "3", "text": "Absolutely awful,They made Venom a dumb goofball.  Which if anyone knows the character hes nothing like this. The story is a snorefest of waiting for Venom and Carnage to meet. Which doesn't happen till the last 10 minutes of the movie. Everything else between that is Venom and Eddie acting like morons, arguing, or trying to find each other since they broke up. Carnage spends his time trying to find his old Girlfriend... Which is wtf. He has no GF why is this character even in the movie it just takes away from time that should have been spent between Venom and Carnage. Instead, they wasted all that on bad comedy and even if it was good comedy it still would have sucked.I waited 20 years since the original Spider-Man Movie to see Venom and Carnage on screen and was hoping Spider-Man as well and what a waste."}, {"rating": "4", "text": "What I expressly feared in my review of the original Venom came to pass with the sequel: the studio continued to shy away from a true R rating and managed to make a Carnage movie with no carnage whatsoever. Meanwhile, what this all boils down to is a repeat exercise in \"Eddie and Venom bicker, then do battle with another, meaner symbiote.\" Even Woody Harrelson is nowhere near enough to make this an interesting watch."}, {"rating": "4", "text": "Again Brock and Venom's comradery are the highlight in Venom 2.Harrelson is miscast.The action isn't as good as the first one and the set pieces could easily be mistaken for poor copies of the original movie.These movies need to be \"Hard R\" because without gore the violence is comical.There's going to be a sequel but they need to step it up big time."}, {"rating": "6", "text": "It was quite average to me - predictable plot and not many jokes or anything new compared to first one. Watchable though just could've been better."}, {"rating": "5", "text": "Worse than the first movie. Riddled with cliches, convenient story telling and miss-the-mark humor. I could write a novel about the poor choices made in this film, but I will say the final battle was pretty epic and Carnage's look and feel was spot on."}, {"rating": "7", "text": "I think better than first movie. Action scenes not very good but good. The relationship between Eddie and Venom is good. Scenario could be better but I think scenario better than first movie."}, {"rating": "10", "text": "Pelicula que me ha parecido muy buena,ya que tambien introduce el multiverso"}, {"rating": "7", "text": "Totally a 7 not a 1 or a 10 but a 7. I just wish they gave carnage more love in this but other than that it was great."}, {"rating": "10", "text": "This movie just doubles down and the craziness and absurdity of the first movie. Tons of action, comedy, \"romance\", and a great third act. Wonderful cast, Tom Hardy and Woody Harrelson are the stand outs, but Naomie Harris and Michelle Williams are also great as supporting characters. Highly reccommended film, definitetly stay for the credits."}, {"rating": "9", "text": "the film has its problems, but it is still a good film, on the contrary, it does very well what it promised."}, {"rating": "9", "text": "the movie is good but too easy it could have been better, I expected carnage to die in a more difficult way especially in the final scene."}, {"rating": "9", "text": "Stupid fun! Really enjoyed it. Tom Hardy is the next Daniel Day-Lewis. He's a chameleon."}, {"rating": "9", "text": "Fun super hero film that respects your time. Glad to see the MCU formula shaken up."}, {"rating": "7", "text": "*I love the smell of vengeance in the morning!*What am I saying?! Welcome back, Streamers! This weekend we got the long awaited sequel to one of our favorite anti-hero movies, Venom. Venom: Let There Be Carnage was released this weekend on the big screen, and the MCU has continued it's run of expanding the its universe.*Yes, and they had to before I ate their heads for a snack.*Who said that?! Anyway, for those of you who may remember, Venom was reviewed on our Facebook page years ago. Here's a reminder: \"Venom: '...7.9... Definitely catch the Matinee... If you feel froggy pay full. Entertaining film... A little dragged out and would've appreciated more antagonist development.... But go catch a laugh or two\" and \"the [poor] reviews aren't fair to whether you will laugh or be entertained.... the reviews are right about Michelle... she's awful [in this movie] LOL' \". For this sequel, I must say, the review is almost exactly the same. A major difference comes in the run time being 107 minutes for Venom versus just 83 minutes for Let There Be Carnage. Whereas the first movie dragged on a bit, this movie is short and pretty quick. Actually, almost too quick to the point that nothing really happened. It was a bunch of one liners and explosions. I'm with it, but it's just not typical to what the MCU has produced recently. I think it makes sense for this type of side character of the MCU though. Realistically, this storyline goes nowhere at all. At least with the first film we got introduced to Eddie, the symbiotes and etc. This sequel was literally just a laugh and dash movie that really didn't further anything.*Speak for yourself, turd*Who's calling me a turd? I'm trying to say this movie actually feels funnier than the first. Tom Hardy/Venom have a really funny and fun relationship and dialogue with each other. Kelly Marcel and Tom Hardy did a pretty good job of writing this movie. They even made Michelle Williams remotely palatable in this go round. Either way, viewers know what they came to see. The fights and the laughs were quite entertaining. The biggest flop in this film was Woody's hair piece. That joker was horrible! I'm surprised no one in filming said, \"We have to change this mess.\" Otherwise, the rest of the cast like Naomie Harris are alright for what they do. They made her pretty creepy and crazy and I was for it. They could've done a bit more with her talents, but I'm not mad at it. Either way, the cast and their performances are pretty solid but rushed.*I should be snacking on movie reviewers*I think I need to hurry up. While the MCU rarely misses, Venom: Let There Be Carnage is the closest they can get without missing. They produced an entertaining and funny film but just not typical to their usual cinematic fare. If you enjoyed Venom then you’ll enjoy him even more this time but if you’re looking for a storyline wait for Spiderman: No Way Home. Grab a bowl of popcorn, or the matinee, to make sure your money is spent well. I think that’s all I can say because I might have a symbiote problem. Someone bring me some gongs and bells!!!*WHAT!*"}, {"rating": "10", "text": "Krwi i rzezi nie ma ale nadrabia chemią miedzy Edim a Venomem i humorem. Tym którym 1 cześć się podobała na pewno się spodoba druga część."}, {"rating": "10", "text": "This movie was phenomenal! It was very very funny, and the action was totally insane! It’s so much fun and a lot better than the first movie!"}, {"rating": "7", "text": "Much better than the first. The dynamic between Venom and Eddie is just great. I'm only disappointed with the fact that it wasn't R rated. It would've been boosted up to a sure 10 if I saw Carnage(Or Venom) gore some people."}, {"rating": "10", "text": "Venom 2 Let There be carnage is a great movie to watch maybe the best movie you can watch I really recommend it. Can't wait for another movie of Venom maybe with spider man this time."}, {"rating": "7", "text": "So maybe my expectations were a little high since the trailers looked really good. In watching the actual movie I was a little let down. I thought the first movie was a little bit better. This one is less engrossing as the first, but still entertaining. It's just not as interesting as the first. Enjoy it anyway."}, {"rating": "10", "text": "Great movie! I watched in 4D and I totally recommend every Venom fan to experience the movie this way. The so called professional movie critics are diks! This movie is totally worth to watch and it deserved a better score!"}, {"rating": "9", "text": "Just now, I watched this film in the cinema and I want to share the following subjective opinion:Well, in my city, well, just a **** movie theater is very loud and the picture is smeared as if I have - 1 or - 2.5 vision :(And I also watched an advertisement about the Spider :(+ High quality special effects+ Excellent acting+ Action and combat look really cool - kept me on my toes+ Carnage looks juicy... and one - (minus) = Although I did not specifically watch the trailer of this film - so as not to spoil my first impression of the continuation, but alas, the plot turned out to be banal and a little disappointment regarding the carnage - I thought that he would at least survive :("}, {"rating": "10", "text": "Better than I expected venom is amazing Tom is perfect as him Spider-Man is coming man…. And the best part is no woke parts!"}, {"rating": "10", "text": "This movie is so brilliant, a perfect follow up to the first one, i highly recommend it."}, {"rating": "10", "text": "You may ask “why is this movie getting so many bad reviews?”. The answer is I DONT KNOW. This movie from top to bottom is amazing. A crazy amount of action, great story, and a game breaking post credit scene. Let’s not forget to give it up for Tom Hardy and woody Harrelson for their OUTSTANDING performances!! A 10/10 movie"}, {"rating": "10", "text": "The movie was just super-tastic I loved all the visuals because it was super scary. I’m hoping venom 3 will be just as good"}, {"rating": "7", "text": "A slight improvement over the first, VENOM: LET THERE BE CARNAGE is a ridiculous, funny, and dumb superhero flick that doesn't try to be anything more. Tom Hardy is a one man show here, Woody Harrelson gives it his all and certainly doesn't skimp with Cletus Kasady but at times his character is treated as the B-plot to the true story of Eddie and Venom's couples counseling. Andy Serkis is absolutely the best choice here for director, and going forward I hope Sony sticks with him as the CGI looked much more crisp this go around. Lean and mean, but also choppy and sloppy, VENOM: LET THERE BE CARNAGE is a blast that maybe tones down the carnage a tad too much."}, {"rating": "10", "text": "This one is even better than the first. I wasn't too fond of the first one. But this is much better. Very funny and makes Venom relatable. Also has a nice mix of action and the plot is very easy to digest. Looking forward to other films from the same IP"}, {"rating": "7", "text": "O filme foi bom, mas faltou muita coisa, é difícil falar isso mas a Sony tá praticamente falida, Os  pontos positivos são a interação do Ed Brock e o Venom e as piadas,além da psicopatia do cletus ser bem evidente. O filme conseguiu tirar muitas risadas minha em pouco tempo de filme"}, {"rating": "10", "text": ""}], "recommendations": ["the_a_team", "night_at_the_museum_battle_of_the_smithsonian", "the_green_hornet", "hancock", "deadpool_2", "zombieland_double_tap", "terminator_genisys", "mission_impossible_iii", "the_hangover_part_iii", "i_am_number_four", "shazam_fury_of_the_gods", "rush_hour_3", "kingsman_the_golden_circle", "indiana_jones_and_the_kingdom_of_the_crystal_skull", "national_treasure_book_of_secrets", "the_losers", "the_expendables_3", "hercules", "thor_ragnarok", "edge_of_tomorrow", "the_mummy_tomb_of_the_dragon_emperor", "bloodshot", "this_means_war", "polar", "teenage_mutant_ninja_turtles"]}