{
  "id": 4883,
  "title": "Vertical Limit",
  "starring": [
    "Chris O'Donnell",
    "Robin Tunney"
  ],
  "runtime": 124,
  "genre": [
    "Adventure",
    "Action",
    "Thriller"
  ],
  "description": "Trapped near the summit of K2, the world's second-highest mountain, Annie Garrett radios to base camp for help. Brother Peter hears Annie's message and assembles a team to save her and her group before they succumb to K2's unforgiving elements. But, as Annie lays injured in an icy cavern, the rescuers face several terrifying events that could end the rescue attempt -- and their lives.",
  "releaseYear": "2000",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kpqQUEi8eAyYHMDFACf6YlnPIu7.jpg",
  "categories": {
    "plot": 2.0,
    "acting": 2.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 4.666666666666667
  },
  "reviews": [
    {
      "rating": "2",
      "text": "This is a disgrace to all the Mountain climbers and hikers who is represented by this movie. I mean all the characters on this movie suck. They are all stupid, retarded, pretentious, snide, arrogant SOBs. But admittedly all the thrills that this movie has, all of em, is due to this unbelievable stupidity. None due to natural or other causes. And add to all that Robin Tunney. Who in the world convinced her and let her become an actress???"
    },
    {
      "rating": "2",
      "text": "Des clichés ambulants vont aux sports d'hiver et se retrouvent coincés comme des cons. Alors, on envoit une autre équipe de cons pour leur porter secours, surtout que le frérot veut retrouver sa petite soeur parce que leur père... snif snif c'est trop triste ! que d'émôssions.On se croirait dans Koh Lanta Edition Everest avec tous ces candidats éliminés qui se cassent la gueule sur des peaux de bananes glacées : ils sont tous débiles et même les deux jolies nanas ne parviennent pas à nous remonter le moral, le motivamètre de regardage d'étron en immersion en apnée forcée étant au plus bas.En outre et comme si ça ne suffisait pas, le film souffre de nombreuses lenteurs en attendant les quelques scènes d'action peu crédibles heureusement assez bien filmées par le réalisateur Martin Campbell. En somme, on l'aura compris, on se (re)tournera vers Cliffhanger avec Sylvestre Beuhar si on veut de la vraie aventure hollywoodienne à la montagne, car la montagne, ça vous gagne... ou pas."
    },
    {
      "rating": "7",
      "text": "It was good, regardless of what others may think. even though i dont think, it was stil good. well pretty good."
    },
    {
      "rating": "6",
      "text": "Fully action packed movie. Technical details about the K-2 are not right though but daring action sequence, one with another, are alone enough to keep you interested in the movie."
    }
  ],
  "recommendations": [
    "demolition_man",
    "jiu_jitsu",
    "kate",
    "xxx_return_of_xander_cage",
    "shooter",
    "gunpowder_milkshake",
    "mechanic_resurrection",
    "sabotage",
    "safe",
    "extraction",
    "con_air",
    "angel_has_fallen",
    "the_mechanic",
    "desperado",
    "the_last_stand",
    "mission_impossible_ii",
    "the_expendables_3",
    "transporter_3",
    "hercules",
    "american_assassin",
    "gangster_squad",
    "salt",
    "gone_in_sixty_seconds",
    "elektra",
    "the_equalizer"
  ]
}