{"id": 4541, "title": "Vicky Cristina Barcelona", "starring": ["Scarlett Johansson", "Rebecca Hall"], "runtime": 96, "genre": ["Drama", "Romance"], "description": "Two girlfriends on a summer holiday in Spain become enamored with the same painter, unaware that his ex-wife, with whom he has a tempestuous relationship, is about to re-enter the picture.", "releaseYear": "2008", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/6rGpTCfAxxnx1YODyPmjDhSkdCC.jpg", "categories": {"plot": 7.055555555555555, "acting": 7.0, "ending": 7.333333333333333, "soundtrack": 4.5, "cinematography": 5.0, "familyFriendly": 5.333333333333333, "funny": 8.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "The first hour is solid while the last hour is absolutely dreadful. The relationships start out somewhat believable but quickly turn to B-movie crap."}, {"rating": "0", "text": "This movie sucked. I can not believe i spent money to rent this movie. It has no point. 4 people started unhappy, 4 people ended unhappy."}, {"rating": "2", "text": "With Blockbuster rentals up to $4.99, I regretted the money and time spent on this movie, memorable only for for the spicy little Spanish tune at the beginning and end. I'm as hungry as the next person for the next Woody Allen film. But these characters were flat, slighty annoying and utterly uninteresting."}, {"rating": "1", "text": "I think critics were dazzled by Woody Allen's name on the credits. It was predictable, shallow and boring. Barcelona is not yellow either! Really disappointing."}, {"rating": "2", "text": "I'm not a fan of classical guitar.It's boring. There's scene where the sensitive \"artists\" of Barcelona are gathered together sipping wine and listening intently to mindless strumming. And that to me sums up this movie.There are no revelations ,no insights nothing is learned.And nothing is funny."}, {"rating": "0", "text": "Stereotypes. Boredom. Stereotypes. Also, some of the fakest dialogues ever seen on the big screen. More stereotypes. More boredom. Everything is 100% predictable in the storyline. The portrait of Spain is nothing but a shadeless and blurry sketch packed full of stereotypes. Yeah, stereotypes. Lots of."}, {"rating": "1", "text": "The voiceover narration and dialogue are so painfully stupid, I actually could not watch more than a half hour of the film. Horrible, simply horrible."}, {"rating": "0", "text": "What is it with all the 9's & 10's??? C'mon people! If this had been written & directed by someone OTHER than Woody Allen, you'd see it for what it really is - a horrible, horrible film."}, {"rating": "0", "text": "Pointless and boring. Woody Allen should hang it up. His creative talent is gone, and he should be, too."}, {"rating": "0", "text": "Utter rubbish-don't waste your time."}, {"rating": "3", "text": "What was the intent of the banal narration? Was it supposed to be amusing? Well, it was pretty irritating, as was the incredible stereotypes that pass as characters. Some redeeming scenes every now and then involving either Rebecca Hall or Penelope Cruz. Scarlett Johansson was boring and physically too bleached out. Bardim's quiet truthfulness was appealing but overall it was hard to see why he would be such a heart breaker. Finally, every American man who shows up in this picture is a total tool or twerp."}, {"rating": "0", "text": "I think this is more male fantasy stuff that Allen's been churning out for years at first making us believe that beautiful hapless waifs could fall for his neurotic bullshit (Mia Farrow, Diane Keaton) and now 3 women at a time! Really. Every time I thought he had something different to say, I regretted it seeing such colossal bores as Match Point and some painfully idiotic movie with Meg Ryan and Jason Biggs. Sorry San Francisco Chronicle this time I don't agree."}, {"rating": "0", "text": "Rubbish. It was the falsest movie I have ever seen. The dialogue was almost as if they were making it up. There was no passion between the main actors. I wanted to just Slap Scarlett Silly, she's beautiful to look at, she can't act, Hello. If Woody Allen Got to spend all that money to make a money not even vaguely entertaining, then there is something very wrong with our culture."}, {"rating": "3", "text": "As they say in writing, show it, dont tell it. The narrator is very distracting. The character, even if there is barely a story to tell, are funny and interesting. The ending feels like Mr. Allen just ran out of anything to say."}, {"rating": "4", "text": "A movie about PASSION; yet apart from Penelope Cruz this film is devoid of it - everyone is sleepwalking. Woody Allen is too neurotic to embrace feelings as free-spirited as passion, so him making a film about it is like a fish discussing life outside the bowl."}, {"rating": "3", "text": "I would have given it a zero if not for Javier Bardem and Penelope Cruz - I'm sick of Woody Allen getting good reviews on bad movies because he's Woody Allen. This would never have been made and certainly not with these stars if not for his name. Like so many other of his recent movies."}, {"rating": "4", "text": "Vicky Cristina Barcelona seems to be a movie that had no direction, with writers that were just as lost as the characters were. Instead of having a narrator say the story, it should have been told through the screen."}, {"rating": "1", "text": "Short version: The Hollywood equivalent of a Gypsy Girl painting. Longer version: Arguably the century's most pretentious wank, the most badly made disaster ever. A toxic, petit-bourgeois piece of pestilence of a film. Painfully self-conscious kitsch story wrapped around egregious dialogue hiding a pretentious old man fantasy. Badly acted rubbish for pseudo-intellectual losers, lacquered sentimentally over by a pseudo-liberated morality tale that performs - to make it worse- a criminal act of despicably shallow Euro-Orientalistic violence against the idea of Spain and the reality of love. May the gods of art and love have mercy on Woody Allens twisted, pathetic soul."}, {"rating": "3", "text": "Way overrated. Except for Cruz the acting was uninspired. Javier was miscast and Johansson was amateurish. Writing as not up to Woody's standard. Don't waste your money!"}, {"rating": "1", "text": "It's almost impossible to find anything at all to like about Vicky Cristina Barcelona. Woody Allen's direction is lazy and heavy-handed, and his dialogue is completely lifeless. All the characters featured in the film are thoroughly unlikeable and impossible to relate to on any level, and every actor involved, while turning in completely competent performances, just look bored with what they are being asked to do. Instead of using a narrator as a device to drive the plot, and make some amusing comments about the events we are witnessing as he did in Annie Hall, Allen this time uses it to state the bleeding obvious, and therefore makes it completely unnecessary. The very worst of the film's numerous crimes, however, is the message about love it attempts to communicate, which is insulting to men, women and everyone's intelligence. Basically, Allen would have us believe that all women are either easy (like Scarlett Johansson's Cristina) or prude (like Rebecca Hall's Vicky) but both types of women can be seduced by a pretty disgusting misogynist so long as he's got nice eyes and a sexy accent (which describes Javier Bardem's Juan Antonio perfectly). The only smiles raised for the entire film are embarrassed ones, and you feel slightly emotionally drained by the film's conclusion, not because you've had an involving viewing experience, but because you've struggled for 95 minutes to find something to keep you watching. Still, the Spanish guitar music is nice, and Penelope Cruz makes a good crazy person."}, {"rating": "8", "text": "Vicky Cristina Barcelona is one of the strangest movies of Woody Allen, because it is extremely artistic, also the point of view towards art is unique and not influenced by the consumerist society. So if art is out of influence, human relations work in the same way, that is why the affairs between two, three and even four people are normal and accepted.Another remarkable thing is that the character of Woody Allen, who is well expressed in Annie Hall and Zelig, jumps from person to person; the first in line is Cristina, because she is looking for true love knowing what she does not want and settling for nothing; second we have Juan Antonio, who is trying to defend his concept of art and balancing it with his relationships; third it is Vicky who is doubting about her marriage and husband; then we see Maria Elena, she wants to get back what she had, no matter what she must do; finally it is Judy, who tries to fulfill her dreams using other people.This film has amazing performances, but the one of Penelope Cruz is the most outstanding, the academy award for best supporting actress is definitely well deserved. Also the script is one of the bests from this director. All this is surrounded by peculiar music and the beautiful environment of Spain."}, {"rating": "10", "text": "this movie should be watch as (Annie Hall 2), Allen ended the earlier by describing relationships \"They’re totally irrational and crazy and absurd\", and after many years he completed his idea and made it crystal clear, and now I can see the whole artistic work of Woody Allen as a masterpiece."}, {"rating": "9", "text": "Great, clear, funny."}, {"rating": "10", "text": "One of Woody's best!"}, {"rating": "8", "text": "One of Woody's best in years. The hopefulness of Hannah and her Sisters meets the cynicism of Husbands and Wives."}, {"rating": "9", "text": "Woody Allen can still create a film that weaves between comedy and drama and give the viewer something to retain when the lights go on"}, {"rating": "9", "text": "Perhaps it's only flaw (and the same that beset Cassandra's Dream) is that lately Allen has a tendency to send all of his thoughts out to character's incapable of truly expressing them. In other words, on occasion, they're simply offshoot personalities of Allen's own worldview & set of expressions, resulting in dialogue that seems a little too intellectual or esteemed for some of the personalities involved. Now, Cassandra's Dream didn't suffer from highbrow dialogue but rather that it had working class stiffs using Allen's own ideas in less educated language. Don't get me wrong, when he reigns it in as he did in his earlier work or features believable upper-class representatives, then I can totally buy it. Here there's a few times, usually involving the straight-edged grad student where I feel the characters would be over-reaching in order to utilize such lofty language. Other than that, it's probably his strongest overall work since Husbands & Wives. There's great cinematography, a well-balanced story (NEVER one of Allen's shortcomings) and fabulous acting all around. Go check it out and try and ignore the forced lines in the first half hour."}, {"rating": "10", "text": "This movie was throughly engaging from the first moment to the last. He writes a diverse cast of characters with such virtuosity. The cast is spot on perfection. And though I was looking forward to seeing it from the bouncy title and great cast, I was not prepared for what I saw and how deeply it reverberated. The melancholy story is punctuated by lots of laughs. If you have ever liked a Woody Allen film...GO!"}, {"rating": "10", "text": "In my 40 years of movie going there's been two constants that are a dependable annual reason to remind me why I love the movies - The Oscars and a film by Woody Allen. Sometimes I'm not happy with the Oscars, I've never been unhappy with Woody. He's made a few classics and many great films and the rest are just very good. Vicki Cristina Barcelona is a great film and Spain is the perfect location in which Woody makes a city another character in his film the same way he canonized NYC for all those years. Looks like this will be another year when Woody and the Oscars will be together again!!"}, {"rating": "8", "text": "Overall it is a great movie! Woody Allen does a very good job in this romantic and extraordinary movie taking place in the beautifulcity of Barcelona. Penelope Cruz does a great job and truely needs to have an Oscar nomination. The story is great and very well handed. It is fun and good to watch! Now, Scarlett Johansson's character is so boring actually! For being Allen's favourite, he really puts her in the second place. She does not shine in any part of the filma nd that's sad. The beginning is not as strong as well as the end. The middle point is awsome! You must watch the film because it is one of the best movies of the eyar nd one of the ebst comedies of the era!!!"}, {"rating": "8", "text": "Art, pure art. Simple art. A demonstration of feelings and relationships's complexity. Penelope Cruz's performance is a standout performance. The narration is weak sometimes. But the movie doesn't lose its gentleness."}, {"rating": "10", "text": "An excellent film about how we love. The romanticism of picturesque locales and beautiful people in a film that, despite being sent in the 21st echos an almost Renaissance-esque devotion to cultural achievement and academic pursuits. The film ends on a slightly melancholy note but on the whole is an extremely satisfying picture."}, {"rating": "10", "text": "I really enjoyed this film. It was simply romantic & funny . The actors beautiful and I liked that it did not have sweaty sex scenes."}, {"rating": "6", "text": "Nice movie with great acting and beautiful cinematography. A beautiful love mosaic."}, {"rating": "8", "text": "Same great discussion, new venue."}, {"rating": "10", "text": "Unforgettable film. One of the best works by Woody Allen. Superb Penélope Cruz."}, {"rating": "9", "text": "Rarely do the emotions of quiet people get as much interesting attention as the emotions of the extroverts. This film lavishes insight on them both, wonderfully and wittily. Oh yes, and lots of pretty people having sex. Beautiful architecture, beautiful shots of Barcelona and surrounding countryside. In my fantasies, I now live in the artist's studio in this film, with or without Javier Bardem."}, {"rating": "7", "text": "There isn't anyone who can depict neurotic, paranoid, erotic characters like Woody Allen. IMO he's also the women's director. This romantic humorous spicy comedy isn't new material, but it's mood and spirit makes for a satisfying film. Penelope Cruz doesn't appear until the hour mark, but lifts the film in her spitfire tongue to a whole new level. I'm sure there will be some consideration for a Best Supporting Actress Oscar nomination. Rebecca Hall looks like a rising star.....perhaps Woody's new muse..... and maybe the next Annie Hall. IMO the weak link is Scarlett Johansson. And sorry to say Patricia Clarkson...a favorite and queen of indies....in a minor role. I liked the use of narration, since it moves the film along at a nice pace. It's not Hannah or Annie Hall, but it's a pleasure to see Woody's standard style.."}, {"rating": "10", "text": "This is one of the best movies lately with astonishing performances by most of the cast"}, {"rating": "9", "text": "Loved it! Kept me interested the entire time... made me want to move to spain :)"}, {"rating": "10", "text": "This film is outstanding! A must see for all ages."}, {"rating": "9", "text": "Very confused as to why The New York Times score is a 70 even though it's only movie highly recommended by one critic at The Times. Really enjoyed this movie from start to finish. I think it also dealt very well with the struggle to find and maintain passion versus love. Woody was smart to stop making movies in New York. He had really gotten into a rut. Although it's sad that a lot of people won't see this movie simply because they hate woody as a person. My response always is would you not read a great book or not listen to great song just because you object to the artist's personal life? Would you not go see a Bruce Willis movie, for example, if you're a Democrat since Willis is a die hard Republican? Anyway... Woody does it again. Now if only Scarlett Johansson can learn to act."}, {"rating": "9", "text": "Wow! As much as I defend Woody and try to find encouraging signs of regained competency when he misses the mark, I have to admit, to my shame, I didn"}, {"rating": "9", "text": "Woody Allen's best in years with a very refreshing set of themes and dialogue among the Spaniards. A very poignant story that's also funny. What a pleasant surprise!"}, {"rating": "6", "text": "Well done satire of the American daydream"}, {"rating": "8", "text": "It is profound creative genius which combines cast and script toward the result of Scarlet Johansen kissing Penelope Cruz. There is not an Oscar category for this. But there should be."}, {"rating": "9", "text": "YES, Male fantasy, but it makes senset hat women should reallly get along and support one another; what woman really wants a full-time man anyway ? IF other American Writers were authoring, the ending might have been more formulaic and less believable; but perhaps more satisfying and with slightly higher audience reviews/satisfaction."}, {"rating": "9", "text": "Come on guys! Why all the moaning? This is a funny, funny film. Lots of little homages to European film (Jules et Jim, etc) but at no stage does Woody's respect and fondness for film history overwhelm the entertainment. And the star quality on show here is a delight. In particular, Javier Bardem is an absolute hoot, but everyone else is in there having a great time as well. It is an ensemble show through and through. Not perfect - the film is made on a tight budget and sometimes it shows - but this is so much better written than every other American comedy this year (apart from Burn After Reading) that it is embarrassing. I chuckled about all sorts of elements of this film for a week afterwards. Great fun."}, {"rating": "9", "text": "Unlike many triangular-love films, Vicky Cristina Barcelona has achieved the important feat of making a point and few (perhaps only those who have lived in Spain) have the capacity to understand the degree of perfection achieved by Penelope Cruz's portrayal of Maria Elena, the half psychotic, half genius artist who teeters on the brink of insanity; she makes this movie, and for that reason alone, this movie should be regarded as Woody Allen's best."}, {"rating": "10", "text": "This was great. Woody's back to his best. The dynamics of the relationships between the leading characters was nicely judged and Mr Bardem and Penelope Cruz were outstanding. It had a lovely continental and arthouse feel."}], "recommendations": ["midnight_in_paris", "match_point", "the_upside", "blue_jasmine", "the_royal_tenenbaums", "eternal_sunshine_of_the_spotless_mind", "me_and_earl_and_the_dying_girl", "american_hustle", "youth", "greenberg", "annette", "i_am_sam", "phantom_thread", "the_favourite", "the_fault_in_our_stars", "revolutionary_road", "the_intern", "magnolia", "inherent_vice", "closer", "the_devil_wears_prada", "the_edge_of_seventeen", "hustlers", "eddie_the_eagle", "fading_gigolo"]}