{
  "id": 2865,
  "title": "Victor Frankenstein",
  "starring": [
    "James McAvoy",
    "Daniel Radcliffe"
  ],
  "runtime": 109,
  "genre": [
    "Drama",
    "Science Fiction",
    "Thriller"
  ],
  "description": "Eccentric scientist Victor Von Frankenstein creates a grotesque creature in an unorthodox scientific experiment.",
  "releaseYear": "2015",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/iIF0y5Gq0XxRgddaWtVTqqHboWp.jpg",
  "categories": {
    "plot": 7.178571428571429,
    "acting": 7.038461538461538,
    "ending": 5.4,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 2.0,
    "action": 7.4
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Absolute national disgrace at how poorly reviewed and unpopular this film is, this film deserves to be widely regarded as a treasure of the English nation, it was THAT GOOD! It seems to just be Americans that hate this film and I think part of the reason why Americans hate this film is that Americans are jealous of the greatness of the British Empire and London in Victorian England when they watch this amazing film. Americans know that their hot ugly native American lands will never be as beautiful as Britain's when they see Britain's magic and beauty in this film, they know when they watch British geniuses that the USA will never get as big as the British Empire or as influential due to their governments relative stupidity and ultra Liberalism. I bet the Americans also didn't appreciate Victorian London and probably struggled to understand the British accents so that's also why this film's ratings are so unfairly low.So my message to the Americans is this, if you don't like it simply because you're jealous that you'll never be as good as your country's Father then you can stick to watching your crappy, mind dulling, simplistic American films instead and get even more stupid and simple as a result of watching your rubbish TV and films! If you DARE give such foul barbaric low ratings to films produced on your ancestors sexy island ever again, then I'll make sure Britain colonises the USA, grounds the USA for a month, forces the US to live with it's Dad again and force Americans to give 70% of their yearly wages to the British government in the form of taxes!This film was amazing, complex, thought provoking and above all British through and through. A truly amazing film, don't be turned off by Americans unappreciative **** and their retarded and pathetic jealousy of our amazing history lovely Brits. This movie is unsuitable for Americans but I recommend it to all Brits."
    },
    {
      "rating": "10",
      "text": "I liked this movie very much. I was expecting way worse because of the poor ratings on meta critic. Yet I found the movie to be funny, well acted, engaging, and well produced. The graphics were incredible. I really liked the old English set. Daniel Radcliffe was great in the movie. I think he played the character really well. The storyline for the movie was interesting. Igor seemed to be torn between the woman he loved and the man who saved him from the circus. Great film."
    },
    {
      "rating": "10",
      "text": "Loved it! My wife and I just saw it today and were pleasantly surprised! I'm not sure what some of these reviewers are talking about. It's a very creative and really intelligent film. I loved all the twisted science and art direction they used. The story and characters were interesting and made you excited to see what would happen next. I won't give any details but if you appreciate movies that make you delve a little deeper than what's on the surface, you'll like this movie too. It's not your ordinary mindless adventure."
    },
    {
      "rating": "6",
      "text": "The difference in this reinterpretation is that it focuses on the relationship between crazed scientist Victor Frankenstein (James McAvoy) and his hunchback Igor (Daniel Radcliffe), who has been reinvented as his brilliant protégé. The interesting twists to the traditional story begin with Igor's origin and continue thru the entire narrative. Most of them provided a fresh perspective, although McAvoy's ranting does get tedious (Radcliffe creates a sweet character). The cinematography, art direction and costumes beautifully capture the period. An absorbing, vigorous and interesting new version."
    },
    {
      "rating": "9",
      "text": "My wife and I thoroughly enjoyed this film. The casting was terrific, the acting superb and was complimented perfectly by its setting and wardrobe choices. Further appeal of this picture comes from the strength in its solid storyline that kept us interested from start to finish. It was refreshing to see a quality Hollywood film that was not simply a special effects production. Well done. We would see it again. ﻿"
    },
    {
      "rating": "6",
      "text": "This really is an entertaining adaptation. But it lacks a lot of substance and somewhat lacks integrity. Acting was very enthusiastic but seemed like they were trying their hardest in a story which is so overused and has been done a million times that they needed something extra for imagination. There was just nothing particularly new or surprising. Plus, the very end scene really got me pissed off from the film's overall moral, it felt like a betrayal in honesty.  That said, I wasn't angry with this movie, nor was I bored for the most part. It was solidly entertaining and you'll have a good time at the cinema with this one."
    },
    {
      "rating": "5",
      "text": "This is a handsome, but empty production.  Or, put another way, it is an imposing shell energized by the lightning of fine acting and craftsmanship, but adrift without a soul.  The idea is obvious:  create a spry, postmodern, and loose adaptation of the often-often-adapted Mary Shelley novel to attract the audience which drove Guy Ritchie's two enjoyable Sherlock Holmes films to around one billion worldwide.  But Shelley's gloomily Romantic story of science gone awry (and the prior cinematic versions which gave us malformed laboratory assistant Igor and \"IT'S ALIVE!\") proves an uncomfortable candidate for too-cool-for-school revisionism.  The result is a curious case of hyperactive lethargy in which no charming diversion—not a wild-eyed camp performance by James McAvoy as the title character, not a love story for a straightened and beautified Igor (Daniel Radcliffe), not the extensive Victorian-era production design, not composer Craig Armstrong's thundering original score—distracts from the fact next to nothing of consequence is transpiring, and there is a waning sense of anticlimax when the film finds its way around to the main creature-feature attraction just in time to end."
    },
    {
      "rating": "4",
      "text": "Victor Frankenstein is not one of the worst films of 2015 but it’s hardly good at the same time.  It’s a very forgettable film, it doesn’t really have much to offer, the actors are very decent but they are so bland in this film and it’s a real shame that it’s a blight on the careers of Director Paul McGuigan and Writer Mat Landis who are both very talented people, hopefully their next project together will be better.  There is very little praise to really give to the film, but at least it’s a decently shot film and it never feels awful, it just feels boring and dull and you know that everyone involved can do better.  It’s a mess pure and simple and it’s probably down to studio interference and constant re-editing, which once again destroyed what was clearly a promising film, and it’s a shame for James McAvoy and Daniel Ratcliffe who are actors that I really enjoy and have been given a film that is clearly not up to their talents.  I would skip this one altogether if I were you."
    },
    {
      "rating": "8",
      "text": "ok saw this recently was it the best movie i saw this year well no was it the worst agin no it was just an avrage movie meant for fun if u go see it looking to be disapointed then thats what u will receive but if u go in with some what hopes of a good movie then u will be suprized its fun good action great story and scares i say go see it"
    },
    {
      "rating": "5",
      "text": "[Movie opens with Igor narrating]\r Igor: \"You know this tale\".\r *MOVIE CUTS TO THE END CREDITS*\r Red Letter Media basically summed up the movie in the most funniest way possible. James McAvoy and Daniel Radcliffe were great in the movie, but that's really it."
    },
    {
      "rating": "10",
      "text": "Not really sure what to make of this, I was a little confused to see Gollum Radcliff scuttling about at the start. Other wise i thought it was good, i dont have anything to compare it to as this move has rendered me permanently brain damaged."
    },
    {
      "rating": "2",
      "text": "It's alive! It's ALIVE! IT'S ALIVE!!! IT'S..... oh wait... it's dead. That's funny how there's no negative reviews before this review popped out of nowhere and now there is one."
    },
    {
      "rating": "8",
      "text": "An exciting reimagining of the classic horror story brought to life (pun intended) by the deliciously mad performances by Daniel Radcliffe and James McAvoy. Okay, so perhaps \"mad\" only applies to McAvoy. His eccentric performance as the bat-crap crazy Victor Frankenstein is outstanding. Radcliffe brings a more human and sweet side to the whole affair.\r We really shouldn't be surprised that these two knocked it out of the park. As far as their talent as actors goes, have they ever let us down? Here they seem to be having a lot of fun. Particularly McAvoy. To be honest it's the sense of fun that saves the film. The whole thing is as completely mad as it's title character. It's willingness to fully embrace it's craziness is what makes it so enjoyable.\r It's got it's awkward bits though. The moral dilemma is pretty solidly captured, but the interference to Frankenstein's plan brought on by the side characters falls a bit short. Mostly because those characters are so bland. The stars of the show here and definitely McAvoy and Radcliffe. Their characters are lovingly fleshed out with complexities and layers. Everyone else just kind of falls to the side. Not a huge issue, but a flaw nonetheless.\r Once you get past the awkward, slow motion ridden opening there is a dazzling movie to behold. One with  two fantastic lead characters played by equally fantastic actors. There's also a surprising heart to it all. This is essentially a tale of friendship. It's a crazy, exciting, and at times sweet ride. One that proves to be an exciting and likable horror-themed fantasy. Mostly due to how outstanding it's leads are.\r 8.2/10"
    },
    {
      "rating": "4",
      "text": "McAvoy and Radcliffe are good but this is a bit of a disaster of a film in several ways."
    },
    {
      "rating": "7",
      "text": "While most of the movie can be seen as boring and cliché, the last half hour, the great CGI and the superb acting by the main characters keep the movie above the average mark.It might not be an excellent movie, but it sure as hell is not a bad one."
    },
    {
      "rating": "5",
      "text": "El guión muy malo, flojo, sin chiste, da risa. Por lo mismo las actuaciones son flojas y aunque Radcliff y McAvoy intentan darle sentido a este despropósito no pueden.  El diseño de arte bueno pero no destaca y la musica de siente invasiva en ciertos momentos. Muy mala."
    },
    {
      "rating": "5",
      "text": "‘Victor Frankenstein’ kicks off with a narration by Daniel Radcliffe as “Igor” declaring to the audience that “you know this story”, implying that you’re in for something new, or perhaps lowering expectations, intentionally or not. What follows for the best part of 2 hours is a 21st century treatment of this 19th century story, originally set in the late 18th century.\r To say that ‘Victor Frankenstein’ shares a lot with Robert Downey Jr.’s recent Sherlock Holmes films would be an understatement, from setting a typically mostly central European late 18th century story in Victorian London, to the stylized dramatic action sequences and overall aesthetic, you’d be forgiven for thinking you’re watching Guy Ritchie taking on Mary Shelley.\r James McAvoy stars in the titular role accompanied by Daniel Radcliffe through whose eyes the story is seen, both deliver adequate performances with McAvoy given the chance to flamboyantly overact to his heart’s content, giving the film a graphic novel if not comic book sensibility. The production design is impressive as you might expect, with the dirty streets of Victorian London coming alive, as do the props and of course the creatures, literally.\r The film is billed as a re-imagining of the “Frankenstein” story which brings something new, that’s certainly true in terms of veering away from the original novel, but in terms of the 80+ years of Hollywood treatment since, ‘Victor Frankenstein’ takes from virtually every version of this classic story making it disappointingly unimaginative for a “re-imagining”.\r Director Paul McGuigan’s film does manage to shine a dim light on the original “mad scientist’s” motivational inner demons and the dangers of scientific overreaching, but despite a good momentum and the entertainment value, ultimately ‘Victor Frankenstein’ is a fuel-injected version of a well-trodden theme.\r The Bottom Line…\rSilly and fun, uninspired and forgettable, ‘Victor Frankenstein’ is an entertaining but unmemorable romp that offers little that’s new to an established story, beyond its lavish interpretation."
    },
    {
      "rating": "6",
      "text": "Great acting and interesting adaptation of Frankenstein etc. Can't really compare it or rate it comparing to other versions as this is the first Frankenstein movie I have seen to be honest. But as a standalone it seemed to be quite decent. Not impressive, but ok."
    },
    {
      "rating": "5",
      "text": "Yet another version of the world famous Frankenstein novel Victor Frankenstein is a blend of several genres and it is really difficult to find a specific one that it fits under. This movie is intended to be reimagining of the classic tale but there is still not anything revolutionary going on. I enjoyed the first two acts of this film it may not have been the story that I was looking for but there was some fun to be had. In the third act though, everything falls apart in just a few scenes and it completely drags on and when the time comes you are not invested in the ending at all. James McAvoy was really the reason I watched this film in the first place and he is great here but there is some pretty obvious overacting in spots. Radcliffe is pretty solid as well as he often is."
    },
    {
      "rating": "6",
      "text": "Not bad, just boring.\r It's not a bad movie but it really drags through it's second act and then speeds right through the third without allowing you to feel anything for anyone involved.\r Parts of it are fun so if it pops up on cable or you need something to watch while distracted with other things, watch it."
    },
    {
      "rating": "8",
      "text": "We are in the era where big companies retake old classics to adapt again and Twentieth Century Fox Film   did a decent job with respect to Mary Wollstonecraft Shelley's Frankenstein. It is completely innocuous and unimportant to mention that Paul McGuigan makes the movie  aiming to do for \"Victor Frankenstein\" what Guy Ritchie did for \"Sherlock Holmes\", Victorian London but with a different theme:  \"Two men with the ability to generate life\".\r It is interesting to the reinvention of the classic focuses on Igor more than the same main character disappearing completely cliche that Victor is the center of attention, obviously, without downplay Victor in the movie.\r More than a story of monsters , religion and beliefs \"Victor Frankenstein\" is a story of true friendship that surpasses any buddy film.\r Landis'  script  addresses the issues of life and death in an impressive manner focusing not just on the name \" Frankenstein \" also in his friend \" Igor\" . This script takes the essentials of classical achieving a memorable tribute to the most fearsome monster of Hollywood. The script and the effects are a key part to connect the film with the audience but clearly are the actors who work for the reborn:  Radcliffe took the right tone to become the shadow of  'Victor' ( perhaps for his dream of  medicine expert or in gratitude for his flamboyant remove hump) although at times McAvoy stole the limelight to 'Igor'. The performances of these two ambitious men are truly spectacular, them feelings and differences make the trip that much more fun and entertaining , these two guys deserve a ton of applause.\r The break point of the movie are ten long minutes, where they are presented many villains, and often the case the bromance ((Jessica Brown Findlay’s trapeze artist, Lorelei) appears to exist largely to deflect suspicions that Victor and Igor only have eyes for each other (not counting the eyes in formaldehyde, of course).\r \"Gordon\" and \"Prometheus\" (the first experiments of them ) are shown in a majestic manner , with a dark touch but with a careful hand of details that make each look truly amazing .\r However , the end is not the best, but leaves the door open for a possible franchise, that according to public reaction (Box Office) and apparently , it is very unlikely to see a sequel due to the few gains so far over budget.\r \"Victor Frankenstein\", really surprised , managing to show a new face of classic , fresh it , and exceeding what we had in mind.\r Innovative, refreshing , exciting and totally unbelievable becomes the new invention of  \"Victor and Igor\"."
    },
    {
      "rating": "7",
      "text": "Victor Frankenstein is not without its flaws, but on the whole, it's an interesting, visually striking and thoroughly well-acted take on a classic tale. Daniel Radcliffe gives an impressive performance as Igor, James McAvoy does a good job as the title character and Andrew Scott makes for a good antagonist. As I mentioned, I did have a few gripes- not all of the plot elements were entirely plausible and the only major female character in the movie does pretty much nothing for the plot. That said, there is still plenty to enjoy in the movie- McAvoy and Radcliffe had great chemistry and the production design was amazing. Overall, Victor Frankenstein may anger purists, but it's a fun movie that gives an iconic tale an intruiging twist. 7/10."
    },
    {
      "rating": "4",
      "text": "Scenes without that would not change anything in the film did not exist or is this unnecessary film is not worth watching it spend your money seeing another film that you will be happier."
    },
    {
      "rating": "6",
      "text": "If you are looking for an entertaining romp of a movie, this pretty well fits the bill.  The screenplay is rather clumsy, but the A list actors are of such a pedigree that most of that can be overlooked.  If you're in the mood for a monster film and have time to kill, give this your 1 1/2 hours, but don't expect it to resonate after."
    },
    {
      "rating": "4",
      "text": "The two actors are not strong enough or good enough in these parts. Its a mish mash of a film, you only get to see the monster at the very end of the film. It tries to be many things but in the end it delivers nothing new.  bring back peter cushin and christopher lee any day and the old hammer films to this modern rubbish. At best its a rental on dvd.. But once youve seen this you wont want to see it again.  Another very avarage frankenstein  film in a long line of bad attempts in recent years."
    }
  ],
  "recommendations": [
    "alice_through_the_looking_glass",
    "samson",
    "ben_hur",
    "the_nutcracker_and_the_four_realms",
    "eternals",
    "maleficent_mistress_of_evil",
    "the_bfg",
    "blade_of_the_47_ronin",
    "let_me_in",
    "oz_the_great_and_powerful",
    "conan_the_barbarian",
    "dune",
    "doctor_strange",
    "the_count_of_monte_cristo",
    "news_of_the_world",
    "bone_tomahawk",
    "oblivion",
    "murder_on_the_orient_express",
    "fantastic_beasts_the_crimes_of_grindelwald",
    "reminiscence",
    "looper",
    "the_devil_all_the_time",
    "the_godfather_part_iii",
    "alice_in_wonderland",
    "the_man_in_the_iron_mask"
  ]
}