{
  "id": 3506,
  "title": "Village of the Damned",
  "starring": [
    "Christopher Reeve",
    "Kirstie Alley"
  ],
  "runtime": 99,
  "genre": [
    "Thriller",
    "Horror",
    "Science Fiction"
  ],
  "description": "An American village is visited by some unknown life form which leaves the women of the village pregnant. Nine months later, the babies are born, and they all look normal, but it doesn't take the \"parents\" long to realize that the kids are not human or humane.",
  "releaseYear": "1995",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1Iezq745huWW3xB5xQMPDdyyWx7.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 6.0,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "El Pueblo de los Malditos (1995)Sinopsis:Remake de la película homónima de 1960.Unos extraños niños albinos usan sus poderes mentales para controlar a los adultos de un pueblo en California.Opinión:Empezaré comentando que en su momento esta película recibió malas críticas y fue un fracaso financiero, en lo personal no encuentro que sea una mala película, de hecho me gusta, contiene un buen reparto, buenos efectos especiales y de sonido además de una buena fotografía al mejor estilo de John Carpenter.El punto flojo es la historia, la cual se desarrolla bastante bien durante la primera mitad del largometraje en donde se plantea el origen del conflicto central presentándonos a varios personajes los cuales son parte relativamente importante de la trama, pero a partir de entonces es cuando la historia acelera su ritmo y deja de sustentarse a sí misma dejando a casi todos esos personajes en el olvido limitándose a mostrar a los niñitos haciendo nada más que de las suyas y que pese a que de forma implícita se menciona su origen, no es suficiente para resolver el enigma. Una dosis de viagra y un porro le hubieran hecho bien al guionista para mejorar la historia del material original.Valoración:3.5 ⭐ de 5 ⭐"
    },
    {
      "rating": "3",
      "text": "Village of the Damned passing fantasy thriller. When viewing it, you can literally fall asleep. Village of the Damned is so mediocre both in its structure and level of suspense for a thriller that it can hardly be called a whole piece, it's just a set of scenes. In general, the viewer will not lose anything at all if you watch only the first and last 15 minutes of the film. I am very disappointed, this is probably one of the most boring and monotonous films of Carpenter's career. But the very idea of ​ ​ the arrival of aliens and the attempted invasion in this way is very interesting and so worn in the cinematographer. But the realization of all this is terrible."
    },
    {
      "rating": "4",
      "text": "This is totally one of my less favorite films of John Carpenter, especially not only for being a remake but because he was unable to create tension and with this kind of stories is obligatory.The only thing I really like about this film is the atmosphere because it does feels like the atmosphere in Carpenter's best films but the rest is Carpenter's poorest."
    },
    {
      "rating": "6",
      "text": "Remakes made to make money quickly are a common thing in the film industry. To be honest, only a short time ago I knew that this movie was a remake. In fact, he became more famous than his predecessor, although the experts praised him and said that this film had no reason to exist beyond the profit he could raise. They may even be right, but this movie survived the test of time, and its predecessor did not.Why did this happen? I think the weight of the director, John Carpenter, had a lot to do with it. Carpenter was able to create around him a legion of admirers, keeping alive his work. On the other hand, we still have Christopher Reeve, the eternal superman, in the lead role.The script is the same as the original film: a group of children with similar characteristics grows in a secluded location after a bizarre incident where several women get pregnant without knowing how. Children quickly become the focus of bizarre accidents where adults self-mutilate or commit suicide for no apparent reason, as if deprived of their own will.I recognize that this movie is not the best of Carpenter. It is far from that! But I can not throw it in the trash. Unlike some people, I felt that children were an intimidating presence, not so much for what they could do but for their lack of humanity and for the possibilities they had at hand. The film frightens us more by what makes us think than by what it shows us. However, the film ends up being lost, by embarking on easier and more predictable ways, with the action being more and more banal. Christopher Reeve stands out at this point, his good performance being an element that prevents the second half of the film from being deeply unpleasant."
    }
  ],
  "recommendations": [
    "annihilation",
    "coherence",
    "morgan",
    "arrival",
    "donnie_darko",
    "the_autopsy_of_jane_doe",
    "dark_city",
    "the_conjuring_the_devil_made_me_do_it",
    "alien_covenant",
    "the_invasion",
    "a_cure_for_wellness",
    "color_out_of_space",
    "the_girl_with_all_the_gifts",
    "personal_shopper",
    "us",
    "constantine",
    "interstellar",
    "chaos_walking",
    "midnight_special",
    "sunshine",
    "annabelle_comes_home",
    "the_lodge",
    "dominion_prequel_to_the_exorcist",
    "captive_state",
    "they_live"
  ]
}