{
  "id": 2356,
  "title": "Vivarium",
  "starring": [
    "Imogen Poots",
    "Jesse Eisenberg"
  ],
  "runtime": 97,
  "genre": [
    "Science Fiction",
    "Thriller",
    "Mystery",
    "Horror"
  ],
  "description": "A young woman and her fiancé are in search of the perfect starter home. After following a mysterious real estate agent to a new housing development, the couple finds themselves trapped in a maze of identical houses and forced to raise an otherworldly child.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/myf3qzpeN0JbuFRPwSpJcz7rmAT.jpg",
  "categories": {
    "plot": 4.333333333333333,
    "acting": 4.090909090909091,
    "ending": 4.538461538461538,
    "soundtrack": 5.0,
    "cinematography": 3.5,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 3.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Finally, someone other than me who ”got” the cuckoo foreshadowing! Vargatyr’s review is only inaccurate in estimating the film’s length at 120 minutes; it’s actually 97 minutes, but those are loooong minutes (about 280 seconds each).Read John Wyndham’s The Midwich Cuckoos rather than sitting through this movie’s dark and stormy-lite treatment without one decent line of dialog and with only one book in the house. (I doubt that it was To Serve Man, but it could easily have been from the same publisher.) Spare yourself."
    },
    {
      "rating": "0",
      "text": "The movie spends the entire 2 hours trying to tell you what you already knew in the first 10 minutes of the film ( cuckoo bird ), but fails to deliver in all aspects of story telling.  You are left with interpreting the director’s failed metaphor on suburban life being like in a vivarium that has no real freedom, and the  clinical indifference of the alien zoo keepers ( that you learn nothing about ) as a stand in for society itself.  Stay away, a waste of 2 hours that has zero entertainment value. Slower and more boring than the worst documentary you can think of. This films only purpose is to feed the ego of whatever “artist” is responsible for this trash. I think I spent more time writing this review than the director did in making this film.Very disappointed that Jessie Eisenberg decided to be in such a film."
    },
    {
      "rating": "7",
      "text": "An anxiety-free and enjoyable movie to watch during coronavirus self-isolation."
    },
    {
      "rating": "7",
      "text": "Super creepy, fantastic art direction and sound desIgn, no easy answers. Performances were uniformly great. It’s a metaphor for suburbia, marriage, child rearing, modern life, the afterlife, all wrapped in a Stepford wives cum Invasion of the Body Snatchers nightmare."
    },
    {
      "rating": "10",
      "text": "A great piece of mindf**kery. If you enjoy weird and cerebral horror, you’ll dig this movie."
    },
    {
      "rating": "5",
      "text": "Фильм просто разочаровывает, тупая концовка не связанная с сюжетом, а тупо заканчивающаяся ничем. Унылая игра актеров и отсутствие логики у персонажей"
    },
    {
      "rating": "10",
      "text": "Vivarium (2020)Sinopsis:Gemma y Tom son una joven pareja que se ha planteado la compra de su primera casa. Para ello visitan una inmobiliaria donde los recibe un extraño agente de ventas, que les acompaña a Yonder, una nueva, misteriosa y peculiar urbanización donde todas las casas son idénticas, para mostrarles una vivienda unifamiliar para ellos. Volviendo de la visita, quedan atrapados en una laberíntica e interminable pesadilla surrealista.Opinión:Esta película es en extremo bizarra y surrealista, no apta para todos los gustos y es muy probable que las opiniones del público sean polarizadas siendo las negativas las que podrían predominar, para empezar creo que nunca he visto una película así de rara, pero no digo que sea mala porque la verdad me gustó mucho, una vez que te atrapa y termina te empieza a revolver la cabeza porque en el fondo da para un profundo análisis. Yo la consideré como una metáfora sobre el ciclo de la vida de las especies en general y como cada uno absorbe todo lo que tiene a su alrededor hasta que la muerte venga a por uno solo para volver a comenzar desde otra perspectiva. A nivel artístico está increíble, el trabajo audiovisual está bien pulido y es bellísima la puesta en escena, por otro lado están las actuaciones, las cuáles son muy buenas, Imogen y Jesse hacen una buena dupla en pantalla y es retorcido ver como lentamente van cayendo hacia la bancarrota moral y mental.Aquí no hay monstruos ni cosas sacadas del espacio exterior ni gore ni nada por el estilo, si esta catalogada como ciencia ficción es por lo surrealista que es la historia en sí, pero a aquellas personas que les guste debatir y compartir teorías es posible que esta película sea para ellos, si eres de esas personas que solo miran una película por matar el tiempo y si no te entregan todo en bandeja la botas a la basura, te digo amigx que esta película no es para ti.Por mi parte me dejó un poco marcando ocupado, le daré otra visualización en otra ocasión y veré que información puedo conseguir al respecto, noté una influencia bastante explícita de otra película que no voy a nombrar porque mataría el encanto.Si tuviera que hacer tesis sobre alguna película, trataría sobre esta definitivamente.Valoración:5 ⭐ de 5 ⭐"
    },
    {
      "rating": "8",
      "text": "Even in his wildest dreams there’s no way Lorcan Finnegan could have possibly imagined a couple of years ago when he was co-writing and then directing ‘Vivarium’ the truly aberrant state of the world into which his second feature film would eventually be released.And yet here we are, under a mass quarantine due to a raging coronavirus pandemic with seemingly no end in sight, relegated to streaming the few movies that are trickling out into the world since all film productions are suspended and every movie theater is closed.Finnegan must be incredibly disappointed—as we all are—that ‘Vivarium’ wasn’t able to enjoy the full theatrical run that it deserves (the film has since been fast-tracked onto all major video on demand services).  However, there’s a certain serendipity to the timing, with Finnegan crafting a story that is wonderfully bleak, totally unnerving, and incredibly prescient for the times.For those who are curious, the word “vivarium” refers to a place such as a laboratory where animals or plants are kept under conditions simulating their natural environment so that they can be observed, typically for research.While Jesse Eisenberg and Imogen Poots represent the proverbial labs rats in this mystery-horror-thriller, it’s the impotency of adulthood and cracks in modern society that fall squarely under Finnegan’s keen eye and sharp filmmaking.  Covid-19 has already dimmed a lot of light in this world.  If at all possible, don’t let ‘Vivarium’ be yet another example.  Stream it, spread the word, and support the project any way you can."
    },
    {
      "rating": "3",
      "text": "(Mauro Lanari)On the end credits there is \"Complicated Game\" (XTC, 1979) in place of \"Every Day Is Exactly The Same\" (NIN, 2005). Although both songs are excellent, their cinematic rendering could not be more different: a loop of quiescent nihilism in the first case, a cry of desperate existentialism in the second."
    },
    {
      "rating": "0",
      "text": "A COMPLETE WASTE of time. Somewhat interesting idea that could've been developed into really intriguing moive. Unfortunately it's a sum of events that have absolutely no connection with each other. There were a couple of events that made me think that there will be some developement of the mystery or some investigation of  it - not to be. Honestly, just don't bother. Unless you are some snobby, weird, twisted freak that adores what the mass public dislikes - then that's definitely your movie."
    },
    {
      "rating": "0",
      "text": "I never rate movies, I never rate anything because my time is precious....exceptions had to be made in the case of this abortion of a film. I am obligated as a human to try to dave as many people as possible from being time raped by this movie. I want my 99 minutes back....send help."
    },
    {
      "rating": "7",
      "text": "I like watching Imogen Poots perform her craft and that is why I decided to watch this film.  Conversely, I've never particularly enjoyed Jesse Eisenberg's acting efforts and I think I actually avoid his work if I can - but, Vivarium provides some of his best efforts and I think I may need to adjust my thinking in that regard.  Regardless, I completely understand casting Poots for her role - but, Eisenberg seems to be a poor choice for his role in my estimation.So, if you spent time in your freshman dorm room discussing things like nihilism - you will probably enjoy this film.  If you do not know what nihilism is - you will probably not enjoy this film.Vivarium has a very straight forward, uncomplicated science fiction, horror plot.  Nothing wrong with that - but, I don't think I can rate it higher than a 7 given its simplicity.  If you owned an \"ant farm\" when you were a child, you probably know what a vivarium is.  If you catch the bird-nest scenes at the beginning of the film you will understand the premise of the film.I enjoyed the film and would recommend that the potential thinking-viewer will want to try it out.  If you are looking for light, escapist diversion - you will want to look elsewhere.Likewise, if you are an individual who requires all/most plot lines to resolve to some definitive end point and/or you do not deal with the reality of uncertainty - you will want to avoid Vivarium."
    },
    {
      "rating": "7",
      "text": "Had this movie done more to explain what was going on behind the scenes I would have given it an 8. But I was entertained throughout, so I did enjoy watching it. I just generally don't like movies that end by having asked more questions that it answered. This movie answers a few questions, but asks hundreds.With that said, I can appreciate how it sort of puts \"human everyday life\" down to a very simple recipe. In doing so, it underlines how important the tiny differences in our day-to-day life is - they make life interesting. To be content means enjoying those differences. Too little is not enough, as clearly portrayed in this movie. So I guess it underlines the need to hit that balance between too little and too much.2020 was too much."
    },
    {
      "rating": "10",
      "text": "Absolute terrifying. Great idea for movie.. on many levels. Love that kind of scare! One of the best horror movies i've ever seen. Highly recomended"
    },
    {
      "rating": "3",
      "text": "Disturbing, depressing, tedious at times.  NOT a comedy, horror fantasy is probably the right genre."
    },
    {
      "rating": "4",
      "text": "While it started out kinda interesting with an interesting premise and stuff, it eventually became boring and ended without solving anything and leaving you feeling like you just wasted time watching it - it gave no reasons for what happened and no answers why it happened etc. Acting also was weird at times. Basically feeling like even giving too high of a rating and maybe basing that on liking actors or the initial premise, but yeah if you saw trailer before watching i doubt you dont know already how movie ends"
    },
    {
      "rating": "6",
      "text": "This movie is not for everyone. While it’s a really well made from the top down with great writing, acting and cinematography the bizarre story leaves you without any idea of what just happened and a very unsatisfying ending. I wouldn’t call this a traditional horror or thriller film either. While it has its moments of creepiness, it’s a very slow burn story that doesn’t really amp up till the end where you will be left with more questions then answers. The ambiguity didn’t bother me as it seemed the film makers are trying to make a statement about “nature” and how it can be unfair, but that thread of narrative gets lost by the end. This is definitely one of those films I found interesting and will discuss with other people who enjoy this kind of thing, but I’ll probably never watch it again."
    },
    {
      "rating": "0",
      "text": "The worst movie ever! Let me get straight, Only a few things,It hasn't anything in the movie, boring, too slow, tedious, I got it the movie, I really do, though this movie hasn't anything of meaningful or a message, or meaning at all, on the other hand like the platform on Netflix it' has something, it has a message for everyone in the world. But this It's too far far away from being a good film or interesting."
    },
    {
      "rating": "6",
      "text": "The perfect allegory for what it's like living in a suburban subdivision during the Coronavirus pandemic."
    },
    {
      "rating": "6",
      "text": "It's interesting to understand that the various interpretations this movie can have will vary depending on the viewer, but irrevocably its conclusion is still the same and that's the key element of this story.Vivarium is a kind of lost episode from The Twilight Zone. A tale about being trapped in an existential circle over which you simply have no control, or if you came to believe that you had it, now you have to face reality and accept the role that life has imposed on you.Something the two main characters end up confronting once they surrender to the reality that has been imposed on them.Vivarium isn't a subtle film and yes, it's more confusing than explicit and both its second act and conclusion don't feel satisfactory, but in my personal interpretation and the reason why I give it three stars is that that final path is precisely the bleak moral of the allegory and the obvious disappointment that life can bring when it binds you to an established social role from which you cannot escape and after all the work you will simply die and the ones whom you raised will only repeat that cycle."
    },
    {
      "rating": "1",
      "text": "Absolute crap! One of those movies where they never come to a concussion and never explain anything!!!! I’m mad at the time I’ll never get back. Sooooooooooooooooooooo badddddd"
    },
    {
      "rating": "6",
      "text": "This film has an artificial feel to it (the setting), which reminded me a little of The Truman Show, only the characters are nearly entirely alone - isolated in a very clinical feeling way. It has a spooky, unsettling feel to it. I felt there were some unanswered questions - where did they get there groceries from, if their truly trapped in the same street with only houses as far as the eye can see, for example?.If your not ok with loud, long, prolonged shrieks then this film isn't for you. Also, it becomes distinctly more unsettling and surreal towards the end, with a lot of emphasis on light and colour - one plot element reminded me of 'Being John Malkovich'. It also made me think of 'The Stepford Wives'. By the very end, I felt it was a bit of a 'mind eff' type film. I'm not sure I'd say its particularly good but its certainly not a pointless film - its quirky and definitely not perfect - perhaps somewhat memorable, though not entirely in the best of ways maybe, I'm going for this rating as I thought the cast did well and the visual effects aren't bad. If your into claustrophobic, somewhat spooky mystery type films, then this is likely worth your time but it won't suit everyone."
    },
    {
      "rating": "3",
      "text": "If I hadn’t been aware that Vivarium was going to have a Cuckoo story, the literal cuckoo pushing baby birds out of their nests at the beginning followed by the navel gazing scene of a girl asking why a cuckoo would do that really drove it home. Vivarium is not subtle about its imagery. One of the most distinctive things about this movie, in fact, is its blasé attitude toward the clichés of this decades’ horror films. Tom (played by an inexplicably unaccented Jesse Eisenberg) digs (spoiler) his own grave, Gemma (played by national treasure and future star of the live action adaptation of Y the Last Man, Imogen Poots) falls into the role of Giving Tree.The Giving TreeWriter and director Lorcan Finnegan spends a lot of his movie waxing poetic about the horrors of suburbia and gender roles, actualizing the alienation and resentment young parents feel toward their child in every interaction between Tom and It, but rarely with a point. defection in the couple is broadcast fairly early in the story, which makes for a somewhat hollow script as the two characters with the most self-knowledge cease conversing. Vivarium‘s greatest contribution to the horror genre is in its imitations. The way the Young Boy parrots the language of his caregivers in that otherworldly voice, the way that Martin’s sales pitch feels so oddly expressive and staged, and his borderline mocking impression of Gemma’s cliché response to getting pregnant are oddball moments of drama and humor.Friend and I spent some time afterwards trying to nail down what didn’t work about the third act, and generally I think it’s worth a discussion about what structures of cuckoo stories work and which ones don’t, which might be more interesting than the movie itself. It feels like the things that we like about the composition of cuckoos, these monsters, whose power comes from their ability to shapeshift into innocent or beloved characters in our lives, is that their power extends only insofar as they are able to play convincing copies. The moment that Coraline’s Other Mother shows her button eyes, that the spider-like dream-dwelling villain of Terry Pratchett’s I Shall Wear Midnight series loosens its grip on the illusion, the protagonist is able to regain control. The story structure of a cuckoo narrative should follow something like: 1) the protagonists don’t notice the cuckoo, 2) discover a discrepancy, 3) attempt to trap/kill it, and 4) fail or succeed. In the empowering version of the story, take It Follows for instance, the children succeed. There’s still lots of room for scares and failure along the way, but the audience feels the thrill of the victim’s empowerment as they learn more about the cuckoos physical limitations. Ditto this for a story like Stephen King’s It, another classic cuckoo story.I’m not saying that there can’t be entertaining stories where cuckoos are successful–I’d offer China Miéville’s Perdido Street Station as an example of a situation where the success of the cuckoo is how the author subverts our expectations and increases the emotional stakes of the story–but I think that the means by which the cuckoo succeeds need to be carefully considered, and maybe roughly equivalent with the ability of the victim, in order for the film to feel exciting. The discovery of how well the spider’s web is constructed is not sufficient entertainment for the fly (or the audience). Vivarium is very much about revealing a neat, little web that two unsuspecting flies have been caught in, and as a metaphor for buying in to consumerist culture, it feels, as Friend put it, like “dated critique.”Usually, I have some recommended reading. I think that this week, I’m going to draw your attention away from the director’s reflection of his own genius in the time of quarantine."
    },
    {
      "rating": "6",
      "text": "Hey Streamers! This week we got straight up depressed and watched the first thing in our watchlist. Vivarium, you're up to bat. We weren't too picky, and we'd heard the movie was \"interesting\". The synopsis of Vivarium goes as follows: a young couple looking for the perfect home find themselves trapped in a mysterious labyrinth-like neighborhood of identical houses. I know that was absolutely horrifying for you millennials out there and I think that's the point. Let's get to it.First, this movie reminds me of a little diddy I used to love. A cult classic, if you will:\"I have a blue house with a blue windowBlue is the color of all that I wearBlue are the streets and all the trees are tooI have a girlfriend and she is so blue... Blue are the feelings that live inside meI'm blue da ba dee da ba daaDa ba dee da ba daa, da ba dee da ba daa, da ba dee da ba daaDa ba dee da ba daa\" (\"Blue (Da Ba Dee)\" by Eiffel 65... If I were green I would die, If i were green i would die.Why do I say that you ask? Well as the poster and description suggest, the maze of homes and interior of homes is just a green bundled mess. Eiffel 65 would've been disgusted and shocked by this green anomaly. The setting of the film is basic yet simultaneously complex. How will our protagonists get out? Are they alone? Why was this house so cheap? I know you house hunters out there will ask the same question after watching. Either way, the setting of the film sets that freaky atmosphere.Second, we have the cast. Some of us love Jesse Eisenberg and others are not so high on him. This role is in no way one of his better one and, in fact, I think the movie really missed out on using him better. He's got more range in acting ability than the director, Lorcan Finnegan, allowed him to portray in this movie. Should've let him go full Social Network or Luthor. As for Imogen Poots, she was \"just alright for me dog\". She definitely hit the range of emotions here but her character was the \"poots\". I don't know if that was on purpose or not. The real star of the movie was my man, Martin. No, not Lawrence. The character Martin, while weird and strange is the only thing worth watching in the film. How will Martin act now? And why are these fools even following him to an open house? But I digress.Finally, the movie isn't really about the characters or the setting as much as the meaning of everything together. Where the film lacks in storyline creativity, it makes up with in storyline and movie detail analysis. My wife, Trip and I sat here on the phone for an hour talking about what certain images meant or were trying to represent in society. From what we gather, the director and story writers think millennials lives suck and are trapped in the monotony of the aspirations previous generations' American Dream. And there is something strange about cuckoo birds too (pay attention). We would enjoy reading your comments about your thoughts after you've watched.Trip: Ahem! If I may interject for a quick couple notes? While watching Vivarium, I definitely thought of this film as the existential nightmare for millennials. My biggest problem with the movie is that it is so obvious in what it is doing that I felt like screaming \"just get to the point\" throughout its 90 minutes. Consequently, I found the film kind of repetitive and so \"boring\" is an apt description for something that otherwise has a potentially interesting premise. I will allow that there are some complicated themes to unpack after it's all done. Also, I think Imogen Poots was fine. She did what she was called to do and is the audience surrogate here, especially when the film examines parenthood in this day and age. Jesse Eisenberg, on the other hand, now makes me feel icky, and I think that's because he's very much associated with that smarmy, creep he's played in the past, Mark Zuckerberg. He's not doing that here, but the presence is still off-putting.Long story short, Vivarium is a strangely boring and ironically chuckle-worthy film. The cast is small and only delivers a couple notable moments. The film is worth a handful of popcorn for our creepy friend Martin and the post film symbolism analysis. If you get bored and have Amazon Prime, check out Vivarium to go house hunting for your forever home.Trip: Yep, it's a decent conversation piece. Check it out and send your comments about what it all means!"
    },
    {
      "rating": "6",
      "text": "This could easily be a Black Mirror (or Twilight Zone) episode, but one of the more average episodes. It's good, has a nice eery atmosphere, but not great or as clever as it thinks it is/wants to be. I love Imogen Poots (and her weird run) and she doesn't dissapoint, nore does Jesse, although he has the *cough* every now and then *cough* which in every film means somethings wrong with him, I hate it when they do that.The ending is sort of what you think is going to happen, it's not amazing, like alot of Black Mirror's really. The problem is, you're obviously looking for some big clever twist that just doesn't really happen."
    },
    {
      "rating": "0",
      "text": "Wasted my time !!! Empty Story, They could show our daily routines better, it's not necessarily to show it by this way,The movie wasted 2 hours to tell you what you already knew in the first 10 minutes of the film"
    },
    {
      "rating": "5",
      "text": "Finally, someone other than me who ”got” the cuckoo foreshadowing! Vargatyr’s review is only inaccurate in estimating the film’s length at 120 minutes; it’s actually 97 minutes, but those are loooong minutes (about 280 seconds each"
    },
    {
      "rating": "7",
      "text": "Vivarium has a great story! It is very original and has great acting. And omg Imogen Poots is amazing"
    },
    {
      "rating": "3",
      "text": "This caught my eye bc I enjoy Jesse Eisenberg in nearly all of his acting roles. As always, his acting was superb in this film. Unfortunately, the story line, or lack there of, in this movie was so agonizingly drawn out that I feel like this is the worst movie (out of 100+) that I have wasted time watching during this pandemic."
    },
    {
      "rating": "0",
      "text": "So aliens are trapping couples in suburban homes and forcing them to raise their alien children. People lose there $&!÷ and are miserable. There is supposed to be some \"profound\" hidden meaning about how buying a home , and having children, and being stuck in the suburban life is all a trap that makes you unhappy. Here is the problem, its not true. ANYTHING in life is a trap if you allow it to be. Buying a home isnt a trap, having and raising a child isnt a trap, they are choices. If you trap someone in an apartment with no contact with the world, no choices, and nothing but walls to look at with no choices, then they would be trapped and probably unhappy.  People buy houses in the suburbs because they want to and chose to, if they dont like it they choose to move. People choose to have and raise children because they choose to and accept the good with the bad. People become unhappy and feel helpless when they dont have choices. If you take away my tv, computer, phone, car, communication with all people and outside world,  take away my kids, and replace it all with a heartless annoying alien child, then paint my house ugly *$$ green color and tell me i cant leave, im gonna be one unhappy sob.  Another point in the plot that will drive you crazy is that anyone in that position either  wouldnt raise the alien child that is completely heartless with no emotion, or even if you chose to raise it, you would discipline the alien child. Then there is the lack of communication between Gemma and Tom. So there is  Tom,Gemma, an annoying  emotionless alien, stuck in an ugly house with nothing but walls to look at basically, and Tom and Gemma dont talk hardly at all. Save your time , if you want to watch people trapped , go watch a North Korean documentary, it would be more entertaining and you will get more out of it."
    },
    {
      "rating": "0",
      "text": "A horribly bland \"thriller\" with no spice. I fully understand the premise and meaning of the movie but that doesn't excuse how horrible it is. They really could've just made a twenty-five minute short film with just the beginning part, a montage, then the ending, and it would be loads more enjoyable than this. The movie is painfully dragged out with the characters doing nothing but moping around and feeling bad for themselves. Yes, I get that they're in a helpless situation but that doesn't change how boring the movie is. It's like the director wanted to make a \"smart\" movie with scares that don't feel cheap but instead got an uneventful mess. Another gripe I have is how little questions are answered. I understand that with mystery comes fear and that a good movie leaves the viewer with questions afterward, but this isn't a good movie.[[SPOILER WARNING FOR THIS PARAGRAPH]]Why did the aliens set up  the trap this way? What gave them this idea? Why do they want to overthrow humans if obviously they're smart enough to live on their own. What did the boy learn from watching the TV? Why was the randomly mean at parts like locking Gemma and Tom out of their house? Why do the aliens think this is the best way to learn how to be human? Why did Gemma just give up? You could argue that she was too broken from the situation but if she had the strength to try and kill the boy then I don't understand why she didn't explore the weird underground area? Why did she sink through the floor in the underground area? Why did the boy let her see the book? Why didn't she ever try transcribing the book? Why didn't Tom or Gemma try and use the radio in the car to contact help? Why didn't they ever try breaking into other houses? Why didn't they ever try ripping up the concrete? Why did that giant hole not lead to anything but there was an entrance not very far under the road? What's with the funky colors when she was going through houses? Why did the lighter never run out of fuel? How did they rebuild the house so quickly when it got burned down?[[Spoilers are done :-)]]All of these questions are asked but none of them are answered, leaving the viewer frustrated after the movie. They had such an amazing idea and there were a lot of promising elements, but it was executed horribly. Please, don't watch this movie. It isn't worth it."
    },
    {
      "rating": "0",
      "text": "I'll say the acting was good, but that alone can't save this movie. The CG animation quality is about on par with what you'd expect from the late 90's, the thinly veiled social critique seems misguided and the story is a hot mess. It's bits and pieces of acting strung together with no real intent of creating anything coherent. None of the mysteries get elaborated on in any meaningful way, half the scenes are practically irrelevant, because there is literally no payoff for anything. Utter waste of time, I was expecting something akin to The Trueman Show and ended up with garbage."
    },
    {
      "rating": "7",
      "text": "Vivarium is not necessary a masterpiece, but it's weird enough to have its own charm."
    },
    {
      "rating": "4",
      "text": "This is y types of movie critics will be more likely to love because of 'art' while the average movie goer is going to feel .... Well you'll probably feel nothing. It's an interesting story to start with, and keeps you engaged waiting for some sort of explanation behind it all.But that never happens. If you just want to be entertained, skip this movie. If you want something that's a little bit more of a pshyco-horror art/think piece, then maybe you'll like this."
    },
    {
      "rating": "0",
      "text": "highly DO NOT recommendfirst i want to say no disrespect to the actors they did good with what they had to work withwith that out of the way though on to everything elsethe entire movie youre waiting for something to happen but nothing ever doesabsolutely no payoff and a waste of timeleft feeling frustrated and scammedentire family also agreedconcept seems interesting from the description but absolutely nothing is done with itall this movie achieves is making you feel annoyed and frustratedVERY SLIGHT SPOILER (FOR MAYBE ABOUT 30 MINUTES IN?) mainly because of the demon child thing is just being horrible the entire time and nothing can be done about iti will say again this movie has absolutely no payoff and is a waste of timeyour time would be better spent searching for pennies on the sidewalk"
    }
  ],
  "recommendations": [
    "the_lobster",
    "children_of_men",
    "colossal",
    "donnie_darko",
    "downsizing",
    "a_ghost_story",
    "a_cure_for_wellness",
    "annihilation",
    "the_butterfly_effect",
    "unfriended_dark_web",
    "the_purge_anarchy",
    "the_adjustment_bureau",
    "greenland",
    "babel",
    "nerve",
    "contagion",
    "antebellum",
    "a_quiet_place",
    "bird_box",
    "lucy",
    "enemy",
    "under_the_skin",
    "the_purge",
    "predestination",
    "swiss_army_man"
  ]
}