{
  "id": 77,
  "title": "Vivo",
  "starring": [
    "Lin-Manuel Miranda",
    "Ynairaly Simo"
  ],
  "runtime": 103,
  "genre": [
    "Animation",
    "Family",
    "Comedy"
  ],
  "description": "A music-loving kinkajou named Vivo embarks on the journey of a lifetime to fulfill his destiny and deliver a love song for an old friend.",
  "releaseYear": "2021",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eRLlrhbdYE7XN6VtcZKy6o2BsOw.jpg",
  "categories": {
    "plot": 7.4,
    "acting": 8.454545454545455,
    "ending": 6.5,
    "soundtrack": 8.714285714285714,
    "cinematography": 10.0,
    "familyFriendly": 7.0,
    "funny": 9.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Un tributo a la música cubana con una historia que destila humor inteligente y frescura, con personajes originales y simpáticos. El estilo de animación no será del todo perfecto pero el resultado final tiene la dignidad que adolece últimamente la conformista Dreamworks."
    },
    {
      "rating": "9",
      "text": "Vivo is a lovely little film with a lot of heart and IMO some fantastic music.The story focuses on a Konkajou named Vivo and a little girl named Gabi who want to go on a journey to deliver a love confession from the latter's late uncle to a big musician who's about to perform her last concert.At its core the movie is about how music connects us even when we are no longer around and I think for the most part it does it very well.However, it does follow a familiar formula that some people may recognize from more modern animated movies such as Moana or Coco with it being a buddy cop movie with a strong focus on culture and music but what makes up for all of those cliches is the heart and great music that accompany this production.If you ask me, Sony has another great animated film under there belt counting this and the Mitchells vs Machines"
    },
    {
      "rating": "7",
      "text": "You know, sometimes Netflix just knows how to surprise you. This week they did that again with, Vivo. This week Vivo was released by Netflix and Sony Picture Animation with some striking and captivating animation. Vivo is an animated musical adventure featuring all-new songs from Lin-Manuel Miranda. The movie follows a kinkajou, Vivo, (aka a rainforest \"honey bear,\" voiced by Miranda), who spends his days playing music with his friend, Andres (Buena Vista Social Club's Juan de Marcos), in Cuba. Andres is invited to world famous Marta Sandoval's last concert because they were former partners. Vivo and crew set out to meet Marta and provide her with a new song that will bring back the magic of her past with Andres. Let's see how this movie comes together.Vivo is such a fun film for kids and families. It has great themes: how to find yourself; being true to yourself; fighting for love; you don't have to do it on your own; there's not just one way to be great; among other great ideas. That's a lot to pack into a little movie. Vivo gives all the feels of Up, Rio, and Coco. If you touch the realms of those animated classics, you've done well. I wouldn't say Vivo is better than those but at least it's in good company. Speaking of good company, being led by Lin-Manuel Miranda is always good company. Along with the cast and songs, Vivo is so vibrant, even though it's a bit too stereotypical Lin rapping. At times, I wish he would just mix it up a bit and not do the same exact thing as Hamilton and In the Heights but in animation. While it is still good, it's just not as impressive when you already know what you're going to get. Since we already know we are getting quality music, we also got quality voice acting by the rest of the cast. I fell in love with my girl, Gabi. Vivo is a diverse and culture-filled animation that makes you feel at home or a part of the family. The production, direction, and animation is just stellar. I just couldn't take my eyes away from scenes in this movie. Pixar and Disney missed out on making this film, but Sony Animation is starting to catch up in the animation creativity realm with their films like Spiderverse and The Mitchells vs. The Machines.Long story short, Vivo is a really nice and well done animation movie. In fact, it’s so well done that I’m glad that it is available for everyone to see on streaming services but I’d love to see this on the big screen in the theaters. While this doesn’t match the levels of Coco but it’s pretty close with the pulling on the heartstrings. Lin-Manuel Miranda and crew feed you a big box of fresh popcorn. Make sure you check out Vivo on Netflix."
    },
    {
      "rating": "9",
      "text": "This years version of \"Soul\". Like that movie Vivo has great music, endearing characters and story."
    },
    {
      "rating": "9",
      "text": "Honestly the portrayal of Cuba was 10/10 spot on. It brought me back to going to El Centro when I was younger. I'm also happy to see a movie that takes place in Miami that isn't about cocaine. This movie feels really authentic and true to the source material, not 100% Coco for Cubans but easily trying it's best. The music is very Hamilton which is to say quick in parts and deeply emotional in others. Gabi is very much a 2nd or 3rd generation Cuban kid, American but still with Hispanic roots. Gloria Estefan as the  clearly Celia Cruz inspired singer does a great job at hosting the emotional notes of the film. You will cry you will laugh.You can feel a lot of love and research went into this film. (Except for maybe the part with the everglades, they really fell short on researching those parts) and I feel like Egrets would have been a more familiar choice to go with instead of spoonbills. They definitely tiptoed around the Cuban Embargo as most Cubans would be able to see that as the reason why the main characters were separated and could only communicate via a letter."
    },
    {
      "rating": "10",
      "text": "Watch it for what it is - a brilliant heart warming musical with soul and charm."
    },
    {
      "rating": "3",
      "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."
    },
    {
      "rating": "0",
      "text": "It was a bad film because it didnt had a great plot and ending was predictable and it had a lot boring music."
    },
    {
      "rating": "6",
      "text": "Colorful, musical and entertaining, mostly for kids. But Vivo can't shake off the problem of looking like an animated movie from a small studio. Even by Netflix standards.The animation is just average, so they rely on the music.It will certainly generate a big audience for Netflix, but I doubt very much that anyone will remember it before the end of the month."
    },
    {
      "rating": "8",
      "text": "A wonderful movie to watch with the family. The music is catchy and the animation is a sight to see. The story drew me in and you root for the main character to finish his quest. One character was annoying and some songs dont land but overall had a good time with this film"
    },
    {
      "rating": "7",
      "text": "Let me say something I'm 14 alright but don't think I'm going to sugar coat my review. I came into the movie thinking I would hate it but it was just average what held it back from being great was the annoying purple haired main character she did sorta redeem her self near the end but she was still annoying also her beat of her own drum song was bad and for the first 10 min of the movie the monkey was a dick to the old man in the end this movie is just average didn't hate it didn't love it I wouldn't watch it again any time soon but I didn't hate watching it the first time around"
    },
    {
      "rating": "10",
      "text": "Simply amazing! This is currently my child's favorite movie as he watches it over and over. It's absolutely well done and the music is probably the best part. The composition of the songs are moving, catchy, instrumentally genius, and high end professional. It also has a great Latin flare to it. Exploring Cuba, the Florida Keys, the Everglades, and finally Miami was a great adventure! Highly recommend!"
    },
    {
      "rating": "9",
      "text": "this movie is simply amazing with no doubts. the lively animation, the PHENOMENAL character design, and the BANGER songs! I totally recommend this!"
    }
  ],
  "recommendations": [
    "trolls",
    "sing",
    "moana",
    "rio",
    "sing_2",
    "cats",
    "strange_magic",
    "rock_dog_2_rock_around_the_park",
    "my_little_pony_equestria_girls_rainbow_rocks",
    "rio_2",
    "winnie_the_pooh_blood_and_honey",
    "spirit_stallion_of_the_cimarron",
    "trolls_world_tour",
    "jingle_jangle_a_christmas_journey",
    "over_the_moon",
    "the_greatest_showman",
    "sing_street",
    "tangled",
    "the_princess_and_the_frog",
    "klaus",
    "pocahontas",
    "my_little_pony_the_movie",
    "the_road_to_el_dorado",
    "my_little_pony_a_new_generation",
    "in_the_heights"
  ]
}