{
  "id": 4511,
  "title": "Volcano",
  "starring": [
    "Tommy Lee Jones",
    "Anne Heche"
  ],
  "runtime": 104,
  "genre": [
    "Science Fiction",
    "Action",
    "Drama",
    "Thriller"
  ],
  "description": "An earthquake shatters a peaceful Los Angeles morning and opens a fissure deep into the earth, causing lava to start bubbling up. As a volcano begins forming in the La Brea Tar Pits, the director of the city's emergency management service, working with a geologist, must then use every resource in the city to try and stop the volcano from consuming LA.",
  "releaseYear": "1997",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6JA1o2Xz3QJRfdZqhAwlGqAVQyR.jpg",
  "categories": {
    "plot": 5.25,
    "acting": 4.166666666666667,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.75,
    "funny": 1.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "Clearly whoever made this movie does not even understand the basics of how a volcano or heat in general would work. Men are feet from lava and not sweating, there's little to no smoke, and just about no one is coughing. The effects are ok expect for the ash. It looks like someone put grey paper into a paper shredder and thought \"hey that looks like ash I guess.\" The dialogue is also pretty bad and the plot is boring. The best part about the movie is laughing at how stupid it is. I gave it one star because at least the actors in it don't suck."
    },
    {
      "rating": "6",
      "text": "Volcano doesn't get any more fun than seeing it a second time. What Volcano lacks is fun, thrill, and shock. What we got instead is a plain messed-up visual effects with decent acting."
    },
    {
      "rating": "10",
      "text": "I found nothing wrong with this movie. The plot is somewhat original, I mean, who would of thought a park in Los Angeles, California would become a volcano, destroying everything in its path. Tommy Lee Jones and Anne Heche were amazing in this.  Great special effects. This film really blows Dante's Peak away hehehe. 10/10"
    },
    {
      "rating": "8",
      "text": "If I needed to point out amazing example of where a film gets hate for no reason, it’s absolutely Volcano. All of these incredibly stupid comments that say “This movies sucks, so unrealistic because that’d never happen.” Last time I checked, Volcano is a Sci-Fi which is short for science fiction. So yeah, no **** the movie’s plot isn’t realistic, neither is Star Wars, The Avengers, or Men In Black, is anybody going to hate on those films too for being fake?Volcano has amazing acting brought to us by Tommy Lee Jones, Don Cheadle, Anne Heche, and Gaby Hoffmann. The plot for its time was also quite original and showed how the people of Los Angeles would work together in such a scenario. There’s honestly no reason to hate this movie, stop being so uptight over nothing."
    },
    {
      "rating": "10",
      "text": "Excellent movie. Tommy Lee Jones' best film to date. Also, it's the best disaster film ever, even better then \"The Day After Tomorrow.\""
    },
    {
      "rating": "6",
      "text": "Good special effects. could've easily been better. its no dantes peak."
    },
    {
      "rating": "3",
      "text": "Volcano is a shallow, effects heavy disaster movie that looks and feels like a Roland Emmerich film, which is not meant as a complement. Volcano just feels empty of emotion, common sense and character. It substitutes all of it for special effects that are now incredibly dated leaving a film with very few redeeming features. That being said, Tommy Lee Jones is always reliable in almost anything he is in and is a entertaining lead. He is let down by Anne Heche who isn't bad, but she is miscast with her never meshing with the film. That may be because the script is awful but it's probably the fact the film feels chaotic and she is always bizarrely chirpy. In fact the films chaotic feel actually makes the whole film seem messy which isn't helped by the fact the story is borderline nonsensical. Overall it's a film that hasn't held up over time due to some terrible writing, casting and special effects. All in all it's really really bad."
    },
    {
      "rating": "6",
      "text": "The story is ridiculous, a volcano in the middle of L.A.? It's hard to believe and kind of hard to follow. The story starts out very strong, but descends into chaos as everything happens at once. A lot is going on and it's a jumble of impossible acts, which include stopping lava with a bus, a blown up building, and finally the sewers. At points it's more than just impossible, it's ridiculous! The only reason I liked this movie is Tommy Lee Jones, I love Jones and he once again shows that he can carry a film on his back. He's done it before, he'll do it again, and he did it here. Without Jones, this movie stinks, it's his distinctive, energetic, and authoritative personality which makes this film interesting. The movie is utterly ridiculous, yet Jones keeps you interested. Volcano may not be a movie you run out and buy, but if it's on cable, Jones will definitely keep your attention and get you to watch it."
    },
    {
      "rating": "6",
      "text": "Volcano is no \"Dante's Peak\", but it provides a quick, cheap fix for disaster movie junkies. The special effects are the downfall here; they could've been improved greatly."
    },
    {
      "rating": "5",
      "text": "Volcano is a classic disaster movie from the 90s. There's no cool CGI here yet, no spectacular scenes. And in general, after watching Volcano, I am no longer sure that 2012 is the most anti-science film. The most disappointing thing about watching a movie called Volcano is the lack of an eruption of the volcano itself. Well, there is no entertainment in the film at all, although the scenery is not bad enough. In general, when watching a film, there is a feeling that Volcano tried to do as soon as possible, well, too many movies, and the number of victims for such a local apocalypse is somehow not enough"
    },
    {
      "rating": "4",
      "text": "American cinema loves to destroy things, the bigger the better. In this case, the thing to be destroyed is Los Angeles, with a huge volcano rising right in the middle of the city. Its a very traditional disaster film, true to its genre, in which the improvised hero saves the day with total heroism, in a situation off total despair. The only two real characters here are the Volcano and the City because no character is truly developed, not even the hero. They are faces, people who do things. Sometimes they're there just to scream hysterically, be scared, to die, to show cowardice or to create situations in which the hero will shine. Because of this, the work of the actors is just OK, including Tommy Lee Jones. It would be impossible for any actor to shine with such empty characters. The strongest part of the film are the action scenes, stuffed with special effects. Some are so far-fetched that we're forced to think that guy should be on the luckiest day of his life to survive in that unbelievable way. But anyone who is expecting a CGI show will be disappointed: they're not always good and seem a bit dated in the eyes of the current audience. But it's a 1997 movie... everything has its time and, of course, with today's technological breakthroughs, our eyes will not see this movie the same way we watched it twenty years ago. Even so, there are some scenes and sequences where the film is powerful and emanates a pleasant tension that makes us uncomfortable. Not everything is bad, predictable or cliché."
    },
    {
      "rating": "5",
      "text": "If you came here for fun, this is the movie for you. For others the unoriginal plot along with a huge amount of cliches and an unlikely scenario makes me stay away from this movie. Watch Dante's Peak instead."
    },
    {
      "rating": "4",
      "text": "The movie is dumb and fun so I can`t say I vas bored. However, the movie is filled with unneeded subplots that don`t go anywhere, scientific inaccuracies and cliches. It also gets less and less interesting with repeated viewings. You can`t really get angry at this movie,though. though."
    },
    {
      "rating": "3",
      "text": "This has the most brain-dead script of all time ever. The effects are mostly a little tacky but pretty cool. Not as good effects as Dante's Peak (1997) or The Day After Tomorrow (2004). The biggest fault is the fact that the whole movie is based on the most stupid premise ever. There are moments with dogs, children and even trains that are so painfully beyond belief that you just want to stick a volcano up your own bottom. Having said that there is fun to be had knowing that this is more ridiculous than Star Wars and The Lord of the Rings combined. Not knowingly campy, this is a shame."
    },
    {
      "rating": "10",
      "text": "I've seen it multiple time throughout the years, honestly I find nothing wrong with it, it's a movie don't be so uptight trying to tear everything apart by over analyzing"
    }
  ],
  "recommendations": [
    "into_the_storm",
    "battleship",
    "independence_day_resurgence",
    "transformers_the_last_knight",
    "teenage_mutant_ninja_turtles",
    "indiana_jones_and_the_kingdom_of_the_crystal_skull",
    "poseidon",
    "pacific_rim_uprising",
    "san_andreas",
    "the_darkest_hour",
    "geostorm",
    "the_mummy_tomb_of_the_dragon_emperor",
    "2012",
    "gods_of_egypt",
    "war_of_the_worlds",
    "skyline",
    "the_matrix_resurrections",
    "the_meg",
    "bloodshot",
    "the_tomorrow_war",
    "transformers_revenge_of_the_fallen",
    "hercules",
    "jumper",
    "clash_of_the_titans",
    "suicide_squad"
  ]
}