{
  "id": 1562,
  "title": "Voyagers",
  "starring": [
    "Tye Sheridan",
    "Lily-Rose Depp"
  ],
  "runtime": 108,
  "genre": [
    "Science Fiction",
    "Thriller"
  ],
  "description": "With the future of the human race at stake, a group of young men and women -- bred for intelligence and obedience -- embark on an expedition to colonize a distant planet. When they uncover disturbing secrets about the mission, they defy their training and begin to explore their most primitive natures. As life on the ship descends into chaos, they soon become consumed by fear, lust and an insatiable hunger for power.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gn2vCmWO7jQBBto9SYuBHYZARaU.jpg",
  "categories": {
    "plot": 3.5,
    "acting": 4.571428571428571,
    "ending": 4.0,
    "soundtrack": 6.0,
    "cinematography": 6.0,
    "familyFriendly": 6.0,
    "funny": 5.0,
    "action": 6.25
  },
  "reviews": [
    {
      "rating": "4",
      "text": "There's quality in the production, and intrigue in the premise, but in everything else it seems that an extreme laziness took hold of those involved in this tedious, inefficient, predictable and mostly empty science fiction story.Zero interest in their characters and zero interest in their fate.No development for them, and therefore you don't engage with them.If that doesn't set off your alarms right away, I don't know what else could do it. If so, maybe you will find something here that I simply couldn't."
    },
    {
      "rating": "4",
      "text": "Voyagers is a rather lazy attempt of exploring topics like groupthink, lawlessness and fear mongering. There is no subtlety and nothing to really think about, because everything is presented in black and white. The result is a boring movie with mostly unlikeable, comically one dimensional characters."
    },
    {
      "rating": "6",
      "text": "Wildly evocative and almost unbearable to watch, this movie doesn’t pull any punches. I had to watch it in several separate sittings as the atmosphere they pull off was really intense for me. That said I don’t think I love the cinematography. I really don’t like some of the editing choices that felt very over used as a way for suggesting what they where “showing” through fast cuts on screen. The easiest way to sum this film up is “Lord of the Flys…in Space.” The thing is that’s not an entirely fare review. The parallels are there, but there really is a lot more to it. I gave it a lower score because I couldn’t watch this again, but if you are a diehard sci-fi fan there is quite a bit to like here. Other then that I can’t recommend it. The final thing I will say is that this kind of film relies heavily on music and sound design. While both are very familiar in composition and style, they do their job very well and stand out in a good way."
    },
    {
      "rating": "0",
      "text": "It's terrible, the story doesn't make any sense and it is all over the place. The editing is atrocious. None of the characters are believable. It's a film that lazily tries to explore its themes with its inept dialogue."
    },
    {
      "rating": "7",
      "text": "Basically *The Lord of the Flies* in space.It's a horror story about a potential issue with Generation Ship, starships that have to travel so far at such slow speeds (such as is currently possible) that multiple generations have to be born on the ship, and the colonists, have no real touchstones to Earth beyond records they bring.In Voyagers, they try to minimize this by raising the crew in isolation for their first decade and a half before sending them on their way, with one parental figure. Concern about overpopulation and how the kids will turn out as they grow older, they're drugged to dull their personalities, with the plan for the second and third generations born in incubation chambers rather than through intercourse. This plan falls apart as a few of the crew, being intelligent twenty year olds, discover the drug and not sure what it's purpose or reasoning for it is, stop taking it. They promptly become sensation junkies, which isn't too bad until the lone adult dies suddenly and the rest of the thirty member crew also stop taking 'the blue'. With only a handful of documents and media from their 'father' left over (which were supposed to be destroyed to ensure the crew wasn't tainted by Earth) they struggle with concepts that most people of their ages should be done with, like fear of the dark, fear of strange sounds, lack of understanding of death or harm. They aren't mentioned specifically, but hinted at, the majority of the crew don't know the words to describe their emotions, because they haven't had them, or a reason to explain them.An interesting movie, with interesting themes, and perfectly well done, worth seeing at least once, but probably not a rewatch for me."
    },
    {
      "rating": "2",
      "text": "I was excited for this movie originally because futuristic movies offer us a chance to see that things can be different. In spite of this being a futuristic sci-fi where the children are bred with no parents and no knowledge of earth or its history of sexism and racism— it seems they still bring those ideals into space, suggesting that discrimination and prejudice are a raw human instinct, which they’re not. It also perpetuated the idea that white men are naturally instinctual rulers. The film centered a mainly white cast, or at least all the main players with any influence were white. The kids who get bullied and end up getting killed just happen to be BIPOC. I’m sure that was a “coincidence”. The representation in the movie was unrealistic and the BIPOC were basically used as props for the white main cast. One specific thing bothered me as well. There was a part in the film where Jack (the antagonist) stopped taking the blue liquid that suppressed their emotions and so he started to feel horny for the first time and sexually assaults Sayla “out of male instinct” the movie makes it seem. Like it’s a males natural calling to just take whatever he wants and that women are just vessels for male pleasure. There’s a part in the film where Christopher (the protagonist) sees that Jack is going to go and rape Sayla so he goes to her first and makes Jack believe that’s he’s claimed her and therefore Jack has to leave her alone. And Jack says, “you can’t tell me what I can and can’t do. I can do whatever I want.” (Referring to Sayla as the object here that he’ll do whatever he wants to) And all Chris says in response is something along the lines of, “she’s mine.” I don’t specifically remember what he said, but it was along those lines of male ownership and dominance. When there was a perfect opportunity for Chris to say, “No. I can’t tell you what to do. But when it comes to Sayla, she gets to decide what she wants to when it comes to her body.” A lot of impressionable teens will watch this and I think it sends the wrong message. It’s 2021 and it’s time we tackle big issues that are really happening and it’s important that representation is realistic and that racism and sexism are addressed. Something this film had the opportunity to do, but did not."
    },
    {
      "rating": "8",
      "text": "Good movie. I recommend it.So many movies these days are rubbish, or are so riddled with PC group think they're unwatchable.Pleasant surprise... Simple story but a good one."
    },
    {
      "rating": "8",
      "text": "The classic novel Lord of the Flies by William Golding is not only a beloved classic but has been assigned reading for generations of students since it was first published in 1954. The book has been adapted into plays and films over the years and remains a chilling and poignant cautionary tale.In the new movie “Voyagers” audiences are introduced to an Earth that has been ravaged by climate change and disease. In an effort to save the species; a grand experiment to genetically create a group of children who are the origins of a colonization effort is undertaken.The planet is 86 years away so the decision is made that the children will be raised and trained indoors without any exposure to nature, open skies, fresh air, and other aspects they will be deprived of on the ship.Richard (Colin Farrell) decides to accompany the children on the mission as he wants to protect them and ensure things go as planned so their progeny will be well suited to continue on the mission to the next generation who will ultimately be the ones who colonize the planet.Ten years into the mission things are going well until a discovery is made that a drink the children take daily known as “The Blue” is a drug used to suppress their emotions and keep them docile and easy to control.When friends Christopher (Tye Sheridan) and Zac (Fionn Whitehead); who learned the secret of the drug decide to stop taking it; they soon reveal the truth of their discovery to the rest of the children who in turn stop using the drug.In no time rampant emotions, aggressions, desires, paranoia, and mistrust start to run wild and Zac becomes obsessed with Sela (Lilly-Rose Depp).  His unwelcome advances soon become more and more aggressive which causes Christopher and Richard to intervene and tragedy soon follows.Christopher and Zac soon find themselves at odds with one another and fear and paranoia lead the crew to form into factions and turn on one other which not only threatens the mission but their very survival.The film was very engaging and while I saw the influence of Lord of the Flies early on; the engaging cast and setting make the film entertaining and enjoyable despite any really unexpected twists.The young leads work well with one another and it will be very interesting to watch how their careers unfold in the years to come.  “Voyagers” is a refreshing new take on a classic tale and provides an entertaining and engaging adventure for viewers to enjoy.4 stars out of 5Skewed and Reviewed"
    },
    {
      "rating": "7",
      "text": "Not sure what some of the critics are driving at, but I've always felt that sci-fi has always been a whipping post for them (unless it's a beloved franchise that they can gush over). I like movies that take a chance and aren't trying for a trilogy. I also love the space roadtrip genre, and there just aren't enough of them for me. I thought this was an interesting take on the generational ship, enough so that I was able to start plugging plot holes and enjoy it. Production values were on point, acting was fine, and the story, while an obvious Lord of the Flies vibe, was engaging. Given these same critics gush over superhero movies (even calling them sci-fi when they're really just action movies in a sci-fi setting), I'm not surprised they got.the old.whips out for something that doesn't have the armor of a franchise to protect it.As per usual, I disagree with some of the worst redballs on here, and even some of the yellow. I dug this."
    },
    {
      "rating": "5",
      "text": "Entertaining I guess, Interesting plot, it had potential. However, the acting is a bit off, borderline right between satirical and bad."
    },
    {
      "rating": "1",
      "text": "A great idea which can create amazing movie, BUT NO with an insignificant script caused a completely clichéd story and we faced movie with lowest quality. BY WATCHING it, You frittered away your time! By the way! How “COLIN FARREL” Accepted This Scenario?!"
    },
    {
      "rating": "4",
      "text": "no drama, childish plots, empty & bland story, boring & simple climax, terrible fight scenes, sci-fi that lacks sci-fi, and there's not enough casts.The story revolved too much around the ship. A mission led by scientists to save human species and they were never seen during the missionThe transmission is so slow it takes months before it reach Earth. It could be possible if they're light-years away. But even if they're just 1 light-year away, the ship would be traveling nearly 2 million km per second if 10 years have elapsed since it took off.In comparison, voyager 1 was 0.00063 light-years away 13 years after it took off and have a 10-hour delay between transmissions.The spaceship's gravity and speed was never mentioned, nor the distance of the exoplanet. It's just a quick narrative of among us, a parody."
    },
    {
      "rating": "5",
      "text": "What a wasted premise. It could've been an interesting piece exploring the nature vs nurture part of the crew but it just kinda devolves into your average \"kids with no adult supervision\" film."
    },
    {
      "rating": "6",
      "text": "Overall was not a bad movie and I feel like they left an opening for a sequel.  I wouldn't say it was an overall great or bad movie the acting could have been better. I wouldn't watch the movie again but would be interested in a sequel.  If you haven't watched it, it is worth a watch even more so if you are into sci fi movies with an underlying statement."
    }
  ]
}