{
  "id": 4133,
  "title": "Walking Out",
  "starring": [
    "Matt Bomer",
    "Josh Wiggins"
  ],
  "runtime": 96,
  "genre": [
    "Adventure",
    "Drama",
    "Thriller"
  ],
  "description": "A city teen travels to Montana to go hunting with his estranged father, only for the strained trip to become a battle for survival when they encounter a grizzly bear.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wK3l4ZfcRXFph6uop7yr7scM2SP.jpg",
  "categories": {
    "plot": 5.333333333333333,
    "acting": 6.75,
    "ending": 6.0,
    "soundtrack": 6.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Walking Out is a very unremarkable film and while certainly not bad has the feel of a made for TV movie. Bill Pullman, one of my favorite actors has just a cameo role which was disappointing."
    },
    {
      "rating": "4",
      "text": "While there is much to admire emotionally and visually about this movie, there was just so much wrong technically as in how one goes into the wilderness, which is something I know a great deal about, that the ineptitude of the research of that kept getting in my way. I really wanted to love this movie because the father-son relationship had a potential resonance in my own life. But, the father was portrayed so one-dimensionally for so long in the film. BTW, once you apply a tourniquet you have to relieve it and then re-apply tension every 15-20 minutes. Every Boy Scout knows that! And, a fire fed with pine boughs is not going to burn through the night. There were more continuity errors in this film than I maybe have ever seen before. Could be used in a film class for that purpose. All that said, this could have been a good+ film. It clumsiness robbed it of its promise. I did love the young man."
    },
    {
      "rating": "6",
      "text": "A reasonably engaging survival drama but slow and a bit pretentious. Acting is fine."
    },
    {
      "rating": "8",
      "text": "Beautifully photographed and containing solid performances by relatively unknown actors, Walking Out works like a stripped-down, more relatable and grounded Revenant and it is light years better than the abysmally overrated and contrived Winder River. While it doesn't exactly re-invent the wheel in regards to filmmaking, it holds enough excitement and emotional nostalgia to keep the viewer engaged."
    },
    {
      "rating": "6",
      "text": "This is a film that at first appears to be about father and son sharing some quality bonding time out in the woods, with the father teaching his son how to 'be a man' and all of that. It seemed a little slow and unclear what the main plotline was at first but I did think the music played in the background was quite good at creating an atmosphere - it is maybe a little overly sentimental in parts but for the most part I thought it was good. Its is somewhat thought provoking perhaps but its not entirely original and the timeline I felt was also a bit confused. Its worth seeing if given the choice and it sounds of interest but it isn't a film I'd go out of my way much to see as such...the themes have all been covered in numerous other films. This is very much an ok film that you may feel engrossed in towards the end but no more."
    }
  ],
  "recommendations": [
    "thoroughbreds",
    "the_place_beyond_the_pines",
    "the_good_shepherd",
    "blue_valentine",
    "the_curious_case_of_benjamin_button",
    "the_beguiled",
    "white_boy_rick",
    "the_rover",
    "prisoners",
    "manchester_by_the_sea",
    "good_time",
    "20th_century_women",
    "the_florida_project",
    "hugo",
    "hereafter",
    "21_grams",
    "a_history_of_violence",
    "you_were_never_really_here",
    "a_most_violent_year",
    "the_book_thief",
    "the_devil_all_the_time",
    "the_machinist",
    "stillwater",
    "the_killing_of_a_sacred_deer",
    "her"
  ]
}