{"id": 4115, "title": "Walk the Line", "starring": ["Joaquin Phoenix", "Reese Witherspoon"], "runtime": 136, "genre": ["Drama", "Music", "Romance"], "description": "A chronicle of country music legend Johnny Cash's life, from his early days on an Arkansas cotton farm to his rise to fame with Sun Records in Memphis, where he recorded alongside Elvis Presley, Jerry Lee Lewis and Carl Perkins.", "releaseYear": "2005", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/p8lPTjvjOjTfvC1E9pmMwcF9vkn.jpg", "categories": {"plot": 6.473684210526316, "acting": 7.870967741935484, "ending": 9.0, "soundtrack": 7.733333333333333, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 9.75, "action": 5.0}, "reviews": [{"rating": "10", "text": "Ahhhhhhhhhhhhhh, walk the line. in entertaining movie with a good message. Don't do speed or you will lose everything but gain a wife. Even so the main part of the movie was to shoe that he walked the line, been to the worst place almost any Artist could go and came out of it. He was the first person that people said was messed up in the music biz."}, {"rating": "10", "text": "My wife and I both saw this movie at the same time, we both loved it and will probably purchase the dvd with it comes out. We both felt it had the potential for Academy Award nominations for best actress and actor for 2005."}, {"rating": "10", "text": "Johnny Cash undoubtedly left an everlasting legacy after his death in 2003, and there was inevitably going to be a biopic of the iconic country singer, so soon perhaps was surprising, but here we have it, and a truly riveting, compelling and entertaining tale has been told by director James Mangold.\rWe start off seeing John 'JR' Cash inside Folsom prison, about to take to the stage in one of the most high profile concerts in recent memory. Joaquin Phoenix steps into the famed singer's shoes, and does an emotionally satisfying and shockingly accurate rendition of the Man in Black.\rThe film then seemingly transforms into a flashback, as Johnny thinks back to his days as a Christian child, not at all the favourite son of his discipline happy dad, he often listens to bible tunes on the radio, to the dismay of his father.\rAfter a tragic accident, we see a grown up Johnny joining the army, and he spends most of his free time writing songs, mainly things that seem to annoy him or that are constantly on his mind. He soon returns home to a wife and a life not quite what he had hoped for as a door to door salesman, he happens upon a recording studio run by Sam Philips (Dallas Roberts) who convinces Johnny to sing something of his own, simply telling him that people don't want to hear bible music....and so begins the unforgettable career of the legend.\rJoaquin Phoenix delivers his most memorable and certainly the most close to life of any biopic tale of Cash, combining his rusky voice with the charm and charisma of the real thing. His struggles with the beautiful June Carter (Reese Witherspoon) are chronicled in this excellent tale of a complex trial and error story, one which shot Cash to the highest stardom of his life but one which also made him face his darkest demons.\rWe watch as the celebrity stigma with Cash perhaps becomes too much, and he begins to delve in the narcotic way of life, eventually destroying his marriage and possible his career.\rAll the songs that made him as we know him today are present, and Phoenix couldn't be more on par with the man he is portraying, it is sometimes a pinch yourself moment just to make sure you are listening to the real thing,\rWhat truly leaks from this picture is Cash's attempt to constantly make his dad proud, something he never seems to get, and perhaps the reason behind his spiral out of control.\rA truly powerful and exhilarating biopic that cannot be missed, showing the life of one of the most charismatic, egotistical yet brilliant musicians of all time, Johnny Cash."}, {"rating": "8", "text": "Walk the Line is a beautiful film that takes the audience through the destruction and ultimate redemption of the immortal artist's life, emphasized by the flawless lead performances."}, {"rating": "9", "text": "Walk the Line is a huge achievement for musical film. A biopic which follows the relationship and careers of both Johnny Cash and his eventual-wife June Carter. They've decided to re-record Cash's music with its very talented cast, bringing us a brilliant soundtrack. Joaquin Phoenix is a valiant Johnny Cash--and Reese Witherspoon, leaves us speechless."}, {"rating": "10", "text": "Being an ultimate fan of Johnny Cash, I was very happy with the way this film turned out. Joaquin Phoenix and Reese Witherspoon both nailed their performances in voice and poisture. The also went into great lengths of how drug addiction can ruin your life and how stopping can rebuild it. And the music was mind-blowing. Especially because it was the actors singing it. Great film!"}, {"rating": "10", "text": "Not only is it the greatest, most evocative filmic depiction of a musician I've ever seen, it's easily one of the top three biopics I have ever seen. With Phoenix and Witherspoon's frighteningly uncanny performances, a superbly thematic script, a brilliant set of images, and an obviously extraordinary musical atmosphere, \"Walk The Line\" is nothing short of immaculate."}, {"rating": "9", "text": "Roger Ebert said this about the film and I completely agree with him: \"The music is great, the drama is great, the writing is great, the performances are great, I love it!\" Joaquin Phoenix gives a brilliant performance as Johnny Cash, and Reese Witherspoon gives the performance of her career."}, {"rating": "9", "text": "A simply brilliant film that really gets behind the complex troubles that made Johnny cash who he was. The best part about this film is Reese Witherspoon's performance as June Carter, although ironically she seems to have a more polished voice than June but she still captures her character and her love for Johnny. The film ends on a romantic vibe which makes you forget about the adultery, heartache and drug use that had to happen before. It covers a lot of deep and heavy topics but the soundtrack and the tour sequences keep the film on an upbeat and feel good beat. Definitely an all time favourite!"}, {"rating": "10", "text": "Not all the parts were completely true but they had to keep the movie short enough to keep attention. I think it would be better with the deleted scenes. I still loved it. Music is great, clothes, cars, hair, was very good.some were wondering why Jerry lee Lewis was in there. Jerry was touring with John and they were good friends. John was weaker in the movie than I thought. Movie of my overall review was a fantastic film still deleted scenes would have made it better but it is my favorite movie ever. I'd totally give this movie 20 points if I could. Helped? Email me at JadaO00@hotmail.com no negative please"}, {"rating": "3", "text": "I watched this movie from beginning to end, and I was angered and disgusted! After reading Johnny Cash's autobiography 'Man In Black' it is easy to spot very obvious flaws in the movie. For one thing, Johnny Cash described his father as a good natured, good humoured, loving and dignified man who even preached one Sunday morning at thier church. The movie, however, portrays Ray Cash as a gruff , abusive, contemptuos tyrant. The movie didn't do June Cater justice either. In Cash's autobiography, June was a very strong, patient, sweet and dignified woman. The movie, however, has Reese Witherspoon portraying June as an ill tempered, mean mouthed battle axe. The movie also made Johnny Cash look wimpy and pathetic. Even during the weakest time of his life, the man still had strength, character, dignity, and a keen sense of humour. The good things I can say about Walk The Line is that the music and singing was pretty decent, and the clothes, the hairstyles and the cars were very authentic. I'll give Joaqin phoenix due credit for being able to do the tough job of looking and sounding like Johnny Cash."}, {"rating": "2", "text": "I've seen this movie it came out last year it was known as Ray."}, {"rating": "2", "text": "A huge disappointment. Threads that could have been interesting (Cash's childhood, his stint in the Air Force, his first marriage) aren't really explained or developed the way they could have been or should have been. The songs are all good, but it seems like they spent a lot of time trying to establish the fact that Cash rubbed elbows with the big names of 1950s music. Jerry Lee Lewis is certainly an entertaining character, but why bother throwing him into the film for the sake of throwing him into the film? The movie just dragged on, turning into a long story of \"will they or won't they\" with June Carter and Johnny Cash, a story that had no suspense or interest. The movie would have been better served exploring how or why Cash wrote some of his greater, and darker songs. This movie felt mostly like a great opportunity wasted."}, {"rating": "2", "text": "Oscar material? Hardly! Jamie Farr captured Ray in which we believed he was Ray. You can't compare the two performances because he didn't look like Johnny Cash and couldn't sing either. Reese Witherspoon is great in everything she appears in thus the two points. For country music fans only."}, {"rating": "2", "text": "I was surpirsed at how bad this movie was. Maybe my expectations were too high."}, {"rating": "5", "text": "Disappointing. Seemed to gloss over Johnny's dark side, drug use, arrest etc. Various scenes such as when Johnny or June are inspired to write a certain song were painfully contrived. Cash fans, I would say give it a miss and check out some of the good docos on his life instead."}, {"rating": "0", "text": "Who knew Cash was not only boring but couldn't sing very well."}, {"rating": "10", "text": "Gripping and powerful."}, {"rating": "3", "text": "Reese Witherspoon gave a great performance of Dolly Parton doing her imitation of June Carter. The movie started off great and deteriorated into a real loser...this is nowhere close to the incredible movie \"RAY\". Don't waste your time....spend your money on a Johnny Cash CD...would be more entertaining."}, {"rating": "3", "text": "It was Jamie Foxx but nonetheless I couldn't agree with you more. The essence of the man was not captured; only his troubled life. Depressing film."}, {"rating": "10", "text": "Best movie of the year, hands down, there were dramatic parts and hilarious parts to it too, when oscars come around, if any other movie wins best picture, it would be a crime, and give joaquin phoenix best actor too, he was unbelieveable."}, {"rating": "10", "text": "I must have seen this movie about a million times already, and it just seems to be getting better and better every time I see it. The issues that Johnny Cash went through and the tours he was on were portrayed well. Reese Witherspoon was fantastic in the flick, she's got the pipes in her family. Awesome job by the entire crew and a great movie to have in the collection of DVDs at home."}, {"rating": "10", "text": "Delightful performances! Both, Joaquin Phoenix and Reece Witherspoon did very well. This movie has given me some insight to what our beloved Johnny Cash has lived through. I have always liked most of his music but now I love it! I want to buy it when it comes out... hope it wont take too long. For once... a movie I can actually say I loved it. Two thumbs way up to all the actors, writers, and all the rest of the crew."}, {"rating": "8", "text": "Very light and enteraining movie. Even though it was a standard rags-to-riches musician story, Joaquin Phoenix kept it from sinking into boredom with his charisma and presence. And Reese Witherspoon, I can't say enough good things about her. She totally won me over with her solid acting, totally immersing herself in her role as June Carter. Who would've thought Reese could sing? Hopefully she'll snag the Oscar this year."}, {"rating": "10", "text": "My favourite film of the year."}, {"rating": "4", "text": "Just average. I really like Johnny Cash, but this movie didn't do him or his memory justice. Full of cliches and limp drama. Unfortunately, I walked away not caring much about Johnny and definitely not much at all about this character."}, {"rating": "10", "text": "Brilliant - although not a Cash fan, I thoroughly enjoyed this film, and the two main actors gave an awe inspiring performance."}, {"rating": "10", "text": "Completely Spellbinding, Witherspoon & Pheonix Are Amazing And Deliver Their Best Performances To Date. Choice Of Songs In The Movie Were Great And Really Note The Progression Of Cash's Music. Look Out For When He Performs At Folsom Prison, Excellent Scene. Top Movie Best Of The Year!"}, {"rating": "3", "text": "Although Witherspoon was okay. I do not see this film, in comparison with one like Crash, nothing less than ordinary. Johnny Cash was not very good as a singer and is totally uninteresting as a person. Did not get all the hype."}, {"rating": "10", "text": "L.S. for the first time in 20 years i did enjoy a movie so truly a life story like gone with the wind SO MIGHTY WELL AND HARTWARMING PERFORMED growin older the mind starts to forget mercifully hopefully never ever for walk the line adios hendrik from holland the little brave country of the lowlands."}, {"rating": "4", "text": "Aside from one or two almost moving moments, this film is an endurance test of cringeworthy scenes and boredom. I am surprised I sat through and watched this to the end."}, {"rating": "10", "text": "This is the most entertaining film I have seen in a long time. The music is great and the performance by Mr. Phoenix is astounding and well as Ms. Witherspoons. They are great together. When Mr. Phoenix sings he is really into it all the way."}, {"rating": "9", "text": "This film was a lot better than expected. I don't understand the somewhat mixed critical reviews other than some reviewers perhaps view the focus on a county singer less worthy of their praise -- and I am not a country fan. Walk the Line is much better than last year's Ray although there are many similarities in the story lines. Joaquin Phoenix and Reese Witherspoon as well as many of the supporting actors are outstanding. The film has multiple interesting themes -- Johnny Cash's rise from a poor background, his conflicted relationship with his father and wife, his obession with June Carter, June Carter's strong independence, Johnny's struggle with drugs, June's friendship and love for him, etc. Phoenix and Witherspoon accepted low pay levels because of the potential quality they saw in this movie. It's well worth your time."}, {"rating": "10", "text": "Amazing film. I'm a Johnny Cash fan now, believe me. I've never had much use for country music, but this movie won me over. Great acting jobs by Phoenix and Witherspoon are just icing on the cake of an excellent story, whether totally true or not."}, {"rating": "10", "text": "\"Walk the Line\" never strays far from the rise and fall form of your traditional biopic, but like Julie Taymor's underappreciated \"Frida\", it hardly matters if you cast the right actors. Joaquin Phoenix and Reese Witherspoon are so spot-on as Johnny and June Carter Cash, they could've succeeded in a mock-concert film. Phoenix's live performances surpasses Gary Busey's work on \"The Buddy Holly Story\" and that's no faint praise. Busey was great; very Holly-like, but Phoenix IS Cash, even though the two bare only the slightest resemblance. As for Witherspoon, she hasn't beem this incandescent since her debut in Robert Mulligan's \"The Man in the Moon\". She nearly steals the movie away from Phoenix, which seems almost appropriate since June Carter Cash gave this film its title. To ignore the extraordinary chemistry between two actors who seem to be at the height of their craft because they exist in an admittedly ordinary screenplay would be to miss the point of this truly galvanizing movie. Phoenix and Witherspoon transform showbiz cliches into emotional truth. If you loved Ray Charles, you loved \"Ray\". If you didn't love Johnny Cash, you'll, at worst, love Joaquin Phoenix's version of The Man in Black\" better than the real Mccoy, and second-guess your original assessment of this popular music recording giant. \"Walk the Line\" is a triumph of mimicry and sound."}, {"rating": "1", "text": "Don't waste your time on this unless you want see an overproduced typical hollywood plot. This film sheds litte light on Cash's life, and trivializes his story into the typical \"struggling artist with childhood struggles, takes drugs, yells at his wife, falls in love and is redeemed\". This movie would be a fine Lifetime/Hallmark tv drama if it was some fictional story about a fictional character. This film offers no insights into why Johnny Cash was such a beloved artist, and is an insult to his life."}, {"rating": "10", "text": "Amazing!!!...I have already watched in twice in theaters!!!....Voices were outstanding...didnt even realize it was the actors!.....Worth every $"}, {"rating": "10", "text": "I have followed Cash since I walked the Line and this movie was the greatest."}, {"rating": "9", "text": "For me, this was the surprise of the season. Standard musical bio-pic made stimulating by the talents of Reese Witherspoon and Joaquin Phoenix who capture the characters' personalities, vocal styles, and intimacies with remarkable skill. They truly inhabit their roles. Bravo!"}, {"rating": "7", "text": "Sorry to say after so much hoopla from critics and film fans, I was a bit disappointed. Not nearly as compelling as I expected. Inferior to \"Coal Miner's Daughter,\" and \"Ray.\" I have always been a huge fan of Reese Witherspoon. I think her peformance is her usual high-quality, but does exceed her other fine work. I'm not sure why critics have gone so crazy for her performance here. For my money, Mr. Phoenix had the much tougher job and the more outstanding result. I particularly liked Dallas Robert's scene as Sun Records' prez, Sam Phillips. A good movie, but not a great one."}, {"rating": "9", "text": "I loved this passionate move, but the abundance of similar singing scenes detracted from the storyline."}, {"rating": "7", "text": "Engaging and heartfelt performances by the cast and fabulous music. I was definitely entertained and was touched by the love story. But I would have liked to have learned more about Cash other than his romantic yearnings and his battle with drugs. There was something that drew him to maximum security prisons and the stories of prisoners, but this was never really fleshed out in the movie. Like I said, more of a love story than a bio pic. But well done."}, {"rating": "0", "text": "The worst cliche film about a musicain I have ever seen"}, {"rating": "10", "text": "One of the best love stories about two musicians I have seen in a long time. Plus the actors are unbelievable with their performances. For sure a perfect 10."}, {"rating": "9", "text": "I've been a fan of Johnny Cash for 25 years and just watching this movie was really a great experience!The acting and story were incredible.I'm happy it won academy awards but I believe it should of won more than it did.  Great,great movie!"}, {"rating": "9", "text": "This movie was one of the best of the year by far. It gives great acting and you can tell the actors worked really hard. I had know idea that Johnny Cash's life was like that until i watched the movie. The story was excellent and exciting. Anyone who didn't like this movie doesn't know a good movie if it hit them in the nose."}, {"rating": "6", "text": "a movie that reese witherspoon deserved to win the oscar in. If u love johnny cash music then this is for you. if you like the director james mangold check out identity. great little thriller."}, {"rating": "7", "text": "Not bad, and Reese probably deserved the Oscar, because she is radiant, without being coy. But really, this is just a better than average standard biopic. It is mystifying to see all the comments above claiming this film transcends the form, when in fact it clings to the bioipic format like a limpet. Which is a pity, as there was a whole lot more that was soulful and interesting in Johnny Cash's life than what is portrayed here (ie Sun records, pill popping, the romance with June, the conflict with his father, the death of his brother in a saw accident). Maybe there should be a sequel. One that focuses on the fact that Johnny was slightly more than a self-pitying, self-obsessed drug addict with no manners, and that he stood for a number of social causes of note, and that he helped define and then redefine both country and folk music. Compare this film to Ray, where you really got what was special about Ray Charles. Somehow, what was truly great about Johnny Cash gets left behind in the smouldering desire and the period detail. And while the music in the film is engaging enough (it is hard to really destroy good material, and as the musical director, T-Bone Burnett was never going to allow that to happen anyway), it is pretty illuminating to play the soundtrack up against the real thing, as I did shortly afterwards. A good effort Joaquin, but Johnny Cash had a once in a lifetime voice, and was a unique artist. Not just a rock'n'roll wannabee. Overall, good - but not great."}, {"rating": "4", "text": "The story was familiar and simplistic, but heart affecting. Reese does an excellent job of acting and reasonably good singing, but Joaquin's one note acting and thin, off key singing ruined the story for me. I wish they would have used the original artist recordings to give true honor to the music instead of the karaoke subsitute we got."}, {"rating": "10", "text": "I was very skeptical at first but I have to so, I was impressed. Great movie, great cast. Witherspoon just lights p the screen and Phoenix is so scary, so on the edge... The music is rip-roarin'."}], "recommendations": ["respect", "almost_famous", "rocketman", "burlesque", "bohemian_rhapsody", "hairspray", "cinderella_man", "mamma_mia_here_we_go_again", "a_beautiful_day_in_the_neighborhood", "yesterday", "a_star_is_born", "begin_again", "raging_bull", "the_fighter", "million_dollar_baby", "whiplash", "cats", "hustlers", "joy", "eddie_the_eagle", "amadeus", "forrest_gump", "chef", "crazy_heart", "mary_poppins_returns"]}