{
  "id": 4093,
  "title": "Walking Tall",
  "starring": [
    "Dwayne Johnson",
    "Johnny Knoxville"
  ],
  "runtime": 86,
  "genre": [
    "Adventure",
    "Drama",
    "Action",
    "Thriller"
  ],
  "description": "A former U.S. soldier returns to his hometown to find it overrun by crime and corruption, which prompts him to clean house.",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2sdmKtRz2SlGSLxxZDePKm5zxus.jpg",
  "categories": {
    "plot": 5.428571428571429,
    "acting": 5.714285714285714,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.666666666666667,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "A moderately entertaining showcase of action with a surprisingly adequate performance from Dwayne \"The Rock\" Johnson."
    },
    {
      "rating": "6",
      "text": "Walking Tall is stupid on a lot of levels but it's enjoyably stupid. The Rock is ok in this movie, Neal McDonald is ok, Knoxville can get really annoying and the rest of the cast is just there. the action sequences are pretty good but vary in quality at times (the shoot out at the sherif's office being shot utterly terribly) and while the plot is farfetched i would be lying if i said it wasn't a guilty pleasure of mine. you ever see that film that you know you should hate but come out liking and you don't know why you just do. that's this film for me"
    },
    {
      "rating": "6",
      "text": "Walking Tall is a big, dumb, fun action movie. Dwayne \"The Rock\" Johnson and Johnny Knoxville are both enjoyable to watch, and The Rock gives an interestingly average performance that will go on to define the rest of his career. This a great movie to have on in the background and not think too hard about, lest the \"Wild West American Values\" get shoved too hard down your throat."
    },
    {
      "rating": "5",
      "text": "Walking Tall comes down to the simple fact that if you want to see a popcorn flick and loads of guys getting kicked around by a wrestler, this is the film for you.The real issues with the film are its attempt at a serious and relatable plot, yet it only clocks in at 86 minutes, leaving very little time to relate to anyone because of the high-octane pace of the film, therefore creating a film with some fine performances, but an ultimately forgettable flick that is heavy on violence and light on pretty much everything else.\rWe are reminded how this is based on a true story, but I doubt it played out like this, we see Chris (Dwayne \"The Rock\" Johnson) returning home after serving in the army, to his surprise, the town is now a haven for pretty girls, casinos and of course, drugs. Chris gets reacquainted with all his childhood friends, including Ray (Johnny Knoxville) and the successful Jay (Neal McDonough), who we can immediately sense tension with as Chris shakes his hand. We then see first hand how the town works as Chris exposes many crooked things when visiting the casino Jay owns that night, something he pays dearly for.\rThe \"clean-up\" that happens after this sort of ends up like a superhero flick when the hero realises the powers he has, lets go and cause havoc. Sufficed to say there is very little brain but plenty of brawn after this, with a welcome blend of humour from Knoxville and The Rock. But there are a few opening plot points that were never fully explored, Chris' dad and his refusal to shoot a gun, the repercussions of the young boy taking drugs, and the seemingly far-fetched descent into maniacal thugs, it simply didn't make sense or was never fully explained.\rThe length of the film is also a middle-finger to any sense of character development or reasoning for some of  its decisions for that matter, the relationships break down too quickly and supporting characters are grossly under-used. Don't view the film with much thought in your head, and it will be very enjoyable, but wanting to see a dramatic and sensical flow of a film will leave you wondering what just happened. The performances are neatly on par, put short run time and brawn over wit approach will leave the film as a brainless popcorn show."
    },
    {
      "rating": "7",
      "text": "Schlock and seriousness combine in what was only The Rock's third starring role. As odd as it can be at times to go from some Johnny Knoxville related antics to something legitimately dark happening, I'd say Walking Tall balances the two tones well. So much so that I had a harder time swallowing the protagonist's overly aggressive approach more than anything.Violence was always going to be the outcome of this conflict. It was simply unavoidable. That being said, I can't help but feel like a lot of the bloodshed and family endangerment could have been avoided had the main character not have immediately gone all gung-ho at the first sign of corruption in his hometown. The majority of the carnage was a result of his own antagonistic behavior. If it had been anyone other than Johnson onscreen, I might have been mad.Is it any wonder why we fell in love with this guy? He's one of those rare stars that can be larger than life, but still come off as a hardworking everyman. I can't think of any other film he's been in that's capitalised on that the way this one has. Here he's just your typical small town guy that played football in highschool, is close with his family, and left to join the army. The guy played an average joe with ease while still delivering superhuman level beatdowns. You can't tell me he isn't the full package.The action is surprisingly brutal. None of it is terribly explicit, but whether it's happening onscreen or not moments like a man getting held down and sliced open with a box cutter can still be felt by the audience. Plus, there's still plenty that occurs right before your eyes. The movie has no problem showing things like the mangled aftermath of a freshly broken limb.A lot of this is still escapist fun. It wants you to ogle half-naked ladies, have a laugh at Knoxville being a goof, and cheer as despicable villains meet the receiving end of a 4x4. It just carries the occasional, unexpected gutpunch the likes of which we don't typically see from a Dwayne Johnson flick. Which may be why it's one of his best.7.5/10"
    },
    {
      "rating": "7",
      "text": "A good film with an adequate performance from Dwayne Johnson when he was \"The Rock.\""
    },
    {
      "rating": "10",
      "text": "dope movie after this one the rock in the others sucks  I only like this one"
    }
  ],
  "recommendations": [
    "no_escape",
    "unhinged",
    "those_who_wish_me_dead",
    "savages",
    "snitch",
    "colombiana",
    "the_last_stand",
    "3_days_to_kill",
    "the_town",
    "free_fire",
    "taken",
    "knock_at_the_cabin",
    "cellular",
    "the_marksman",
    "falling_down",
    "machete",
    "wild_card",
    "magic_mikes_last_dance",
    "honest_thief",
    "white_house_down",
    "cold_pursuit",
    "live_by_night",
    "guns_akimbo",
    "siberia",
    "from_paris_with_love"
  ]
}