{"id": 2278, "title": "Walk of Shame", "starring": ["Elizabeth Banks", "James Marsden"], "runtime": 95, "genre": ["Comedy"], "description": "A reporter's dream of becoming a news anchor is compromised after a one-night stand leaves her stranded in downtown L.A. without a phone, car, ID or money - and only 8 hours to make it to the most important job interview of her life.", "releaseYear": "2014", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/octCQBtM0MbIS19oZAlO1mHvnhi.jpg", "categories": {"plot": 6.333333333333333, "acting": 4.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.421052631578948, "action": 5.0}, "reviews": [{"rating": "7", "text": "I am not quite surprised that critics are bashing this movie, Walk of Shame is not a perfect comedy but it is for sure an entertaining, funny and heart warming at times! Elizabeth Banks did a really good job. Steven Brill directing a movie is what makes you want to avoid it and not give it a chance and this is what I believe the critics are doing. Besides, Walk of Shame is recommended, it is a fun movie featuring a bunch of talented people despite some outdated ideas, it is still a blast in my opinion."}, {"rating": "3", "text": "Besides Elizabeth Banks this film has little going for it.  Bank's is able to keep your attention on the film while the lack of comedy makes you not care about anything else.  D"}, {"rating": "4", "text": "Walk of Shame is a disgrace - blissfully offensive, incredibly crass, and incredibly sexist, and has claimed the prestigious title of Elizabeth Banks worst film to date."}, {"rating": "7", "text": "This movie was much better than I thought it would be. Elizabeth Banks is hilarious but I was concerned with whether or not she could carry a comedy by herself. Well in this film she didn't have to because the supporting cast around her was absolutely amazing and the hilarity of each moment in the film's plot progression was just great. James Marsden, Gillian Jacobs, and Sarah Wright were all fantastic and then factor in the comedic genius of Bill Burr and Alphonso McAuley and the cast was just fantastic from top to bottom. Is this raunchy comedy going to be for everyone? No, it's not. It's more of a guy's style comedy film with a female lead, which is probably why it didn't kill it in the box office or why the closed minded critics didn't understand it. That being said, if you have enjoyed previous Elizabeth Banks films, you'll certainly get some quality laughs here."}, {"rating": "6", "text": "Unrealistically outrageous journey through Los Angeles featuring the lovely Elizabeth Banks. Walk of Shame is not a deep or moving piece of film; what it is, is an entertaining, light late-nighter."}, {"rating": "6", "text": "I'm very surprised. Not only is Walk of Shame not a complete fail, it's actually not so bad. The story itself is pretty farfetched (as it sets out to be), but Banks makes you root for her character by adding just enough charm and sweetness to the role. Yes, there are stereotypes and clichés running amok here, but this kind of movie doesn't work without familiar characters."}, {"rating": "7", "text": "Wow ..........FUNNY !  wow Elizabeth Banks was funny in Pitch Perfect , her comedy sucks also her directing in movie 43. in the walk of shame she improves her comedy it's really funny  a classic maybe i agree with the critics , this is not  an \" A+ \" movie. it was short and enough laughter ? .... some moments. Grade B"}, {"rating": "4", "text": "2/5★ The Walk Of Shame is on a mission to prove that yes, women can be just as freely promiscuous and foul mouthed as men, no judgment allowed. There are a few funny moments, and Elizabeth Banks has the comedy chops to pull it off, but as a whole, Walk Of Shame does nothing to further feminism, but instead is a shrieky, logic defying mess.\r Verdict: Meh"}, {"rating": "2", "text": "An offensively unfunny exercise in misogyny and boredom. Elizabeth Banks is an excellent comedic actress and deserves a hell of a lot better than this."}, {"rating": "9", "text": "It may be the second best \"woman takes wild, wacky trip across Los Angeles\" comedy to come out in the last decade, but it is still a pretty good, pretty funny movie.\r Watch the movie for free  http://www.watchfree.to/watch-29e63b-Walk-of-Shame-movie-online-free-putlocker.html"}], "recommendations": ["the_wedding_ringer", "forgetting_sarah_marshall", "tropic_thunder", "zack_and_miri_make_a_porno", "identity_thief", "tower_heist", "tammy", "dodgeball_a_true_underdog_story", "neighbors", "the_break_up", "wanderlust", "date_night", "zoolander", "wild_hogs", "what_happens_in_vegas", "murder_mystery", "due_date", "30_minutes_or_less", "friends_with_benefits", "just_go_with_it", "the_other_guys", "mortdecai", "sisters", "norbit", "a_million_ways_to_die_in_the_west"]}