{
  "id": 4583,
  "title": "Wall Street",
  "starring": [
    "Charlie Sheen",
    "Michael Douglas"
  ],
  "runtime": 126,
  "genre": [
    "Crime",
    "Drama"
  ],
  "description": "A young and impatient stockbroker is willing to do anything to get to the top, including trading on illegal inside information taken through a ruthless and greedy corporate raider whom takes the youth under his wing.",
  "releaseYear": "1987",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2tQYq9ntzn2dEwDIGLBSipYPenv.jpg",
  "categories": {
    "plot": 7.25,
    "acting": 7.086956521739131,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "It was an interesting movie but overall it had quite a bit of flaws. I still enjoyed it though and thought Michael Douglas was an amazing lead. Worth the watch imo."
    },
    {
      "rating": "9",
      "text": "Wall Street combines one of the most interesting and deepest villains ever in Gordon Gekko with an interesting and emotionally-charged plot as well as a great performance by Charlie Sheen to make one of my all-time favorite films."
    },
    {
      "rating": "7",
      "text": "I liked the film. It was driven by Douglas's amazing performance through out and the rest of the cast was solid as well. I did not like Charlie Sheen at all in this film and thought he was terrible for this kind of role. The film is interesting and definently worth the watch but dont expect it to be the greatest film you have ever seen."
    },
    {
      "rating": "7",
      "text": "I had heard a fair amount about Wall Street in the past and had dismissed it as likely being more or less what it did end up being: interesting, but not absorbing. I wanted to have watched it, though, to provide context for when I eventually watch Wall Street: Money Never Sleeps, and the fact that it stars Charlie Sheen made it all the more relevant and fascinating.  Charlie, as Bud Fox, is in nearly every scene of the movie, and given recent events it was hard to watch for anything other than his performance. Having watched and enjoyed Platoon last year, though, I wasn't really surprised that he performed quite well. He was dark and brooding and very intense, and more or less nailed the role, even intermittently causing me to forget that I was watching Charlie Sheen.  Michael Douglas also did a fantastic job at embodying the ruthless, unscrupulous character he was portraying. That character, in turn, embodied the tone and the overarching theme of the movie, most notably with his famous \"greed is good\" speech. In fact, Michael Douglas was awarded the Academy Award for Best Actor for this role, and I would say deservedly so, although I haven't seen any of the other performances that were nominated that year.    Martin Sheen was also great as Bud's father, but his casting made it so that, again, examining the acting - in this case Charlie and Martin's father-son dynamic - was more interesting than watching the actual movie. Add that to Charlie's mere presence, Darryl Hannah's lack of charm, wit, or sexiness as Bud's love interest, and the laughable 80's-style art, decor, fashion and technology that featured in the movie and it made for an overwhelming number of distracting factors that precluded any real immersion in the movie itself.  In the end though, the main distracting factor - studying Charlie Sheen - is also the most compelling reason to watch, at least at this point in time. Combine that with Michael Douglas' performance and Wall Street becomes quite a worthwhile viewing experience. (http://diversionary-tactics.blogspot.com)"
    },
    {
      "rating": "7",
      "text": "Overall, not many complaints here. Michael Douglas is phenomenal here and really commands your attention when he is on the screen. Heck, he commands it even when he is not on screen. The film as a whole is also very interesting. It feels a bit rushed in the beginning, which can lead to confusion, but as it slows down and settles in, things improve. However, the film still requires that you know at least a little bit about the stock market and even then, there will be things that will be confusing for many. But, the story is well-written and well told thanks to solid direction from Oliver Stone. Aside from Douglas, the acting is also pretty solid, though there are some moments of very poor acting from some of the supporting members and Charlie Sheen just never really works too well for me here. He is alright, but gets outclassed by Douglas. Overall, this film is made by Douglas and has a pretty effective story surrounding him that never really fails to have you attention. In spite of its negatives, the overall product is pretty good and enjoyable."
    },
    {
      "rating": "7",
      "text": "Let's be honest -- you're here for Michael Douglas's legendary turn as Gordon Gekko, aren't you? Well, you very well should be. The performance that got the actor his first and only Oscar as an actor is more than worth the watch. But there's also a lot of other fantastic work surrounding him, namely Charlie and Martin Sheen, who play a terrifically dynamic and meaningful father and son onscreen. Who would've thought, eh? Beyond that, though, you also have a screenplay here that's as worth its salt as you'd expect an Oliver Stone script to be worth. And on the subject of Stone, the movie is framed, shot, and stylized particularly well overall. An enjoyable watch."
    },
    {
      "rating": "6",
      "text": "Un jeune courtier en bourse apprend toutes les ficelles du \"métier\" auprès d'un requin de la finance, parangon de cynisme et de voracité dont les méthodes sont sensiblement en marge de ce pourquoi le système a été conçu... Oliver Stone sait habilement démonter les rouages et dénoncer les pratiques de tels requins, caricatures ambulantes du capitalisme en haut-de-forme, sauf qu'ici Michael Douglas, admirable dans son rôle de salopard amoral porte des bretelles (oui, c'était ça les années 80... avec un peu de coke de temps à autre bien entendu).Etonnamment, Charlie Sheen se défend très honorablement en tant que jeune premier un brin naïf qui prend vite goût aux joies de faire du fric pour... simplement faire du fric. Et ça, c'est tout un état d'esprit, une mentalité opaque pour le citoyen lambda qui se demandera pourquoi et comment, on en vient à payer -dans le film- des sommes folles pour des croûtes de l'art très con-temporain. Eh bien, tout simplement parce que ça coûte très cher et accessoirement bien sûr, pour la spéculation.Le film est à rapprocher d'une certaine façon du récent Loup de Wall Street de Martin Scorsese, le temps de se rendre compte que rien n'a changé et que tout a empiré. De quoi devenir communiste, camarade ! même si les deux doctrines mènent en vérité au même résultat (après tout, Brejnev avait une collection de voitures de luxe hallucinante...).Moins facétieux et plus sérieux, le film d'Oliver Stone est aussi plus moral (ou moins cynique en tout cas) que le brûlot souvent délirant de Scorsese, sans doute parce qu'il espère et croit encore un peu dans le système.Cependant, sa mise en scène a beau être soignée et la distribution bien calée, son film est trop long et trop répétitif : pour les truqueurs de merde et leur blanchiment de fraude fiscale, de délits d'initié et de coulage de boîte et tout ça, il suffit juste de regarder les infos et les crises et cracks qui se succèdent. Comme le Loup de Wall Street, on s'interroge sur l'utilité de tels films qui ne font pas avancer le schmilblick et ne font que nous énerver un peu plus. Cela reste néanmoins intéressant et très édifiant mais à petite dose seulement."
    },
    {
      "rating": "4",
      "text": "to dive into this professional building..Wall StreetStone's mean corporate world is unfortunately way too mechanical for it to be cinematic. But within these mundane textbook formula, he does manage to install tiny bits of delightful packets for us to enjoy. These are the bits that survives upon performance. It isn't independently a good movie. It relies a lot upon other factor, which often or not, aren't in its favor. And then, to fill in that void grows impossible even by a skillful filmmaker like Stone. It cannot be completely crafty. It does and ought to be commercial; the script is weaved out accordingly. Wieser and Stone, the writers, fails to keep the crisp alive. It isn't complex as the writers think.In fact, the structure of the script is something that we have seen earlier too. But the only thing that makes it stand alone, is its characters. The characters are immensely intriguing and are three dimensional. The perspective may stay on a single point, but the way the makers fiddle with the characters is what helps them keeps the audience tangled in its world. The performance is the soul reason why is it worth to dive into this professional building.And holding the crown at the center of the stage, Douglas is at his best in here. His monologues, speeches, ideologies and the way he looks at the black and white's of the world; every tiny aspect of it is appealing. His body language and dialogue delivery is what amps up this electrifying tale to a whole new level. Sheen has a parallel role to fill in, but he fails to live up to the power that Douglas oozes in front of him on the screen. Wall Street is a one way street, it doesn't care for the outcome of its methods, similar to its character, unfortunately the repercussions are catastrophic and inevitable."
    },
    {
      "rating": "8",
      "text": "An essay on greed.This is a movie that revolves entirely around greed, and the harm it brings when greed for money becomes a person's reason for living. Directed well by Oliver Stone, the film shows the rise and fall of Bud, a New York Stockbroker who, driven by greed, associates with Gordon Gekko, an amoral finance shark. Profits happen, and Bud's life takes a turn, but at some point he realizes that he is somehow living on the edge of his own convictions of right and wrong, and when it threatens his own father's job, Bud has to decide which side of morality he is on.The movie is loaded with moral messages about money, speculation and greed, which is good. Stone undoubtedly wanted to warn of the dangers of savage capitalism and lack of business ethics. Got. The movie makes anyone think twice before investing in the stock market.The cast of the film is strong, full of big names and each actor does a great job, in particular thanks to the good material each one received. In fact, the characters were very well made and developed intelligently. Charlie Sheen shone like Bud Fox, and has in this movie one of the most interesting roles of his career. Michael Douglas was also magnificent in a villain role where he accentuated the character's amorality and gave the film a remarkable strength and impact. He, too, got one of the most remarkable performances of his professional life, so much so that he earned him the Oscar for Best Actor that year. Martin Sheen also made a good appearance and the most emotional parts of the film are the work of the good professional collaboration between him and Charlie, who is his son in real life and also in this film. Worst of all was Daryl Hannah, in the uninspired and insipid performance of a pretty, materialistic girl.Overall, this movie is worth it for the good story it tells and the excellent performances of the actors. Morally grounded, it has aged well and continues to look current even twenty years after it was launched. And even if we hate Gekko's biased amoral philosophy (translated in his famous speech \"Greed is Good\"), we cannot deny the character's magnetism, charm and attractiveness. The evil is seductive, and Michael Douglas got it very well."
    },
    {
      "rating": "6",
      "text": "If you want to learn about USA country. Wall Street is one of the movie you need to watch."
    },
    {
      "rating": "8",
      "text": "The plot is a bit predictable nowadays but the theme is certainly still relevant and indeed I'm not at all surprised that a sequel film was made a few years ago (I haven't seen that yet). This is quite a watchable film and I felt Michael Douglas did particularly well portraying the obviously greed motivated 'bad guy', Gordon Gekko. I thought it was interesting seeing all the old technology and what-not, given the film dates from the 1980s - its clearly very dated - it couldn't not be! so that amused me a bit but, sadly, some peoples motivations hardly change, hence me saying the themes are still relevant.I have to say, the sheer conept of Charlie Sheen having some (or any) link to morality seems a bit unlikely nowadays but there you go(!). Its an interesting film, not a bad one but its certainly dated and it undoubtedly has some cliches. I suppose if this film were made nowadays, viewers would expect more in the way of a shock value, such as the more graphic aspects of 'Wolf of Wall Street' etc. but personally I'm ok with the way it is. I also enjoyed noticing that one of  Bud's colleagues was played by John V. McGinley, who is probably better known for playing the janitor in the US sitcom Scrubs. Overall, I'd recommend it as a fairly decent film of its type, with the caveat that it is visually quite dated and there are some cliches present but it doesn't take away from the main theme of corporate greed."
    },
    {
      "rating": "9",
      "text": "Fantastic movie! The best photography of 80s aggressive business world. The only reason why it's a 9 and not a 10 for me is that you can easily see the ideological footprint of the director. Masterpieces have a deeper level of storytelling and if you can tell where the director stands on issues then it's not good. Also, Gekko makes the zero-sum game quote which is completely false and comes just from a misunderstanding of economics which a character like him should not have. That entire speech is technically speaking wrong and it's a weak defence for the vulture capitalist which has a very important role in society. Of course, Gekko is a financial criminal and there is no one in the movie who represents the vast majority of the financial professionals who are among the most diligent people in the world (if you think about it, they have all the savings of the world in their hands and still the scandals are extremely limited while other sectors people steal for much less). However, his speech at the shareholders annual meeting is accurate despite harsh, no wonder he won the vote in that instance!"
    },
    {
      "rating": "8",
      "text": "An entertaining movie with one of the 1980's greatest villans in Gordon Gecko.A study of greed, ego, and the drive to succeed."
    },
    {
      "rating": "5",
      "text": "oh yes, giving your life for a workplace / corporation is the greatest honor of every human being, defend it against speculators with your own breast and of course brokers are great people XD"
    },
    {
      "rating": "7",
      "text": "Wall Street is one of the better niche movies of its era. Led by memorable performances by Charlie Sheen and Michael Douglas, with some excellent production by the legendary Oliver Stone; Wall Street is a great movie, but one that can certainly lose its crowd fast. While the story of Bud Fox is heartwarming and raises plenty of ethical and moral debates for the viewer, any movie involving investing, finance, and the stock market will take a hit in terms of viewers it can appeal to. At times I feel as though Wall Street recognizes this, but simultaneously tries too hard to appeal to both sides in its writing. Certainly worth a watch for the story of Gordon Gekko alone, however, Wall Street is one of the great business crime movies of its time."
    }
  ]
}