{
  "id": 321,
  "title": "Wall Engravings",
  "starring": [
    "Macha Méril",
    "Patrick Jouané"
  ],
  "runtime": 68,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "Jeanne looks back on her love for Jean. The melancholic young man wouldn't accept the world as it was, always wishing to depart. She doesn't know that he's dead.",
  "releaseYear": "1968",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/fl5DmLQOan2t5PSuaKZ9ypz5tXd.jpg",
  "categories": {
    "plot": 9.56,
    "acting": 9.5,
    "ending": 5.0,
    "soundtrack": 10.0,
    "cinematography": 7.0,
    "familyFriendly": 9.4,
    "funny": 7.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A lot of people seem to share my opinion about how incredible this film was. I personally feel that this may be the best film I've ever seen. I don't see this as bashing any one group of people based on their weight (...and I love that one person commented on how this movie would offend \"fat people\". Don't you think that some people might find that label offensive?). It does raise some important questions about the amount of time that we spend in front of our computer/screens these days, the lack of time that we spend playing outdoors and interacting with others face to face, and the nature of the \"corporate beasts\" that rule the retail market. More importantly, it's got great music, amazing graphics, and is truly endearing and hilarious. Watch this movie. And then go for a walk with family or friends."
    },
    {
      "rating": "8",
      "text": "WALL-E is probably their biggest gamble yet, but as always, Pixar pulls it off. There is virtually no dialogue for at least the first 15 minutes of the movie, yet the audience is suspended by the charm of a tiny little trash compacter, something that is unheard of in a modern kids movie (let alone a regular movie.) The film also contains an overt environmental message that probably wouldn't have been possible a few years ago. All in all, it's not Pixar's best, but it's still an enjoyable movie and a must see for the big screen because the visual environment is absolutely gorgeous."
    },
    {
      "rating": "10",
      "text": "An astonishing film in every way.  First half a mixture of sweet poetry and heart warming romance; second half, rough satire.  All sweetened with optimism.  Wall-E represents hope in a world that has lost touch with connections.   The greatest of all great Pixar films.   Here's hoping there's more like this."
    },
    {
      "rating": "10",
      "text": "The contrast between the landscape and life on Earth and The Axiom is overwhelmingly brilliant in a visual sense. The depiction of human life on the ship isn't forced like it so easily could've been. The sort of love story between the robots was also really fun to watch and provided a perfect back story for the front theme of the discovery that the captain was going through. It's different and brilliant in every sense"
    },
    {
      "rating": "10",
      "text": "Goes to show that you don't need characters to speak in order to make a classic. I haven't seen a robot as adorable as Wall-E since R2-D2 in the Star Wars movies."
    },
    {
      "rating": "8",
      "text": "Awesome animation for adults, essentially. There were some children in the audience when I saw this and they weren't obviously getting it. Besides that and imho, best anim. movie ever."
    },
    {
      "rating": "7",
      "text": "The opening act had me transfixed with amazement. The cinematography and visual realization of an abandoned dystopian Earth will take your breath away. We see who is essentially a lonely child going about his futile, grinding routine, and his funny gags add an eerie resonance to the movie, as if he was trying to distract himself from pervasive loneliness. Sadly, after the plot starts moving and Wall"
    },
    {
      "rating": "10",
      "text": "WALL-E is a special kind of movie that is soaked in wit, a spirit of adventure and, rarest of all, sincerity. There is an innocent joy evident within this film of which theaters have not seen in quite some time. WALL-E's powerful first half involves little dialogue and though some may find it boring, the movie never loses sight of where its going and what it wants to be. The second half is more standard Pixar fare but is enhanced by the attachment we grow towards WALL-E early on in the movie. This movie does not try to dazzle us with special effects or perplex us with a complex plot. The animation, though amazing, and the plot, though interesting, never overtake the characters in terms of importance. Pixar' took two significant risks with this movie: taking a slow approach to the scenes on Earth and having a largely speechless main character. Both paid off handsomely making WALL-E an affecting and enthralling classic."
    },
    {
      "rating": "9",
      "text": "Its charming and intelligent plot is enough to make Wall-E  an enjoyable experience. The lack of dialogue for almost fifty minutes it wasn't a problem but indeed a pleasure. Why do you need sounds when the visuals speak for themselves? Besides, I was pleased by the captivating love story and environmental messages."
    },
    {
      "rating": "10",
      "text": "It's not unusual for Pixar to make a movie that is unforgetable, flawlessly animated, and mind-blowingly beautiful; but WALL-E took Pixar awesomeness to a whole new level. Some people think that the movie is about \"the dangers of consumerism\", but Director Andrew Stanton himself said that the real main point of the movie is love, and WALL-E is one of the most powerful love stories you will ever see. The movie has really cute lovable characters, stunningly beautiful music by Thomas Newman and Peter Gabriel, subtle humor, and tons of heart, soul, and emotion expressed with very little dialogue. It may seem like a major stretch, but this movie is yet another home run for Pixar. Easily the best movie of 2008, the best movie of decade, and (in my opinion) the best movie of all time. I give this \"LOVEL-E\" masterpiece my highest recommendation. 10/10 (I would give it an 11 if I could)."
    },
    {
      "rating": "9",
      "text": "The best Pixar animation yet! Wall-e is a genial masterpiece! So much action,emotions,fun,philosophy and great graphics deliver us one of the most deep animations of all-time! My score is 9/10  very close to full 10!"
    },
    {
      "rating": "9",
      "text": "Wall.e deja un mensaje profundo e importante para todo publico un concepto entendible y demasiado importante en la sociedad mostrandose en una tierna pelicula de Pixar"
    },
    {
      "rating": "10",
      "text": "I've always been a fan of the Pixar films but this easily surpassed my expectations. The characters all had personality and really came to life. It was also, as usual for a pixar film, expertly rendered."
    },
    {
      "rating": "10",
      "text": "My friends can tell you I have an unhealthy habit of bringing up WALL-E in almost every conversation. Words cannot even begin to describe my love for this movie. It's a heart warming, life-appreciating, gem of a movie. Take a civilization that has never heard about what Earth is and what its people do and I bet you they would be amazed. WALL-E finds a way to show us a society just like that and at the same time give us a new perspective on the little things that we have. If you haven't seen WALL-E yet, go see it now. If you just can't seem to see past the idea of a robot love story, you might want to try and unscrew the blots tightly placed in your head."
    },
    {
      "rating": "10",
      "text": "I thought the movie was great. Very well done and suitable for all ages. I have heard some people say that they were offended that the movie made fun of \"fat\" people. There was nothing that pointed fingers at that. Just the mere fact that thousands of years from now if we are not active and have machines do everything for us then we aren't getting exercise. So anyone who is reading the comments, ignore the bad reviews. the movie was great and I guarantee you and children of all ages will enjoy it. :)"
    },
    {
      "rating": "10",
      "text": "That movie is so funny, wonderful story. Nice movie Pixar."
    },
    {
      "rating": "10",
      "text": "Amazingly different movie. Highly recommended!"
    },
    {
      "rating": "10",
      "text": "I've never cried so much at a movie. I think the film is relevant to nowadays and it touches people of all ages. Kids have fun and adults simply get the noble message without being preachy at all. Highly recommended!"
    },
    {
      "rating": "9",
      "text": "With this movie and the people behind it, there's hope for planet earth!"
    },
    {
      "rating": "10",
      "text": "I loved this movie i just wish i could watch it for the first time again"
    },
    {
      "rating": "10",
      "text": "Brilliant story telling, right at the top of the already impressive Pixar heap."
    },
    {
      "rating": "10",
      "text": "Took the whole family to see this movie last night and we absolutely loved it. The kids (10, 4, 2) sat mesmorized - even though there was little dialogue for the first 30 minutes. Let me just say there is a lot of prognostication in the reviews about whether children will love this movie as much as adults, and I can say without a doubt YES. This is a family movie. To all of you out there without any kids who offer opinions about kids not liking this - SHUT-UP. You don't know what the heck you're talking about."
    },
    {
      "rating": "10",
      "text": "I hope people saying 'Wall-E is hypocritical because it's saying big corporations are bad but there are lots of Wall-E toys.' know that Pixar makes the movie and has nothing to do with the marketing. Only disney does. Anyway, this is easily tied for the best movie of the year in my book. It's message is obvious, but it's told in a moving, never before done way. The 2 main characters have an extraordinarily engrossing romance, and their total dialouge has about 4 different words total. The first half of the film is nearly dialouge-less. It uses its wonderous visuals to share its story. But whent the dialouge does come in, the story doesn't get any less intruiging and the visuals are even more involving. It's a film that has aspects most summer blockbusters have, but this doesn't make it any less fascinating or loveable."
    },
    {
      "rating": "8",
      "text": "If this was purely an art house film, the first essentially wordless half hour would be extended with no human involvement and would make a beautiful film. Alas, this is not the case and this film has to include some relevance to modern times and true narrative.This film is 10/10 for me in the sections with only the robots. The sections with the humans are 6/10, which brings the score down for me."
    },
    {
      "rating": "9",
      "text": "I was really surprised at the quality and depth of the movie. This is not your ordinary children's cartoon by any stretch of the imagination. This is a movie that Stanley Kubrick and Arthur C. Clarke would enjoy."
    },
    {
      "rating": "8",
      "text": "great entertainment, great writing, great animation, great everything.\r Rating: 88%"
    },
    {
      "rating": "10",
      "text": "WALL-E was purely amazing. Nothing much else to say so ill fill in the last of the words needed with. CCCCCCCCCCCOOOOOOOOOLLLLLLLL MMMMMMMOOOOOOOOOOOOOOOOOVVVVVVVIIIIIIIEEEEEEE!!!!"
    },
    {
      "rating": "10",
      "text": "This movie, up to the point at which the humans show up, is one of the best dialogueless movies of all time. The humans in the movie are the weakest link - in particular, the normal ones - but the captain, the AI, Wall-E, and EVE are all great. There are very few animated movies which are on the level of WALL-E, and the social commentary is biting."
    },
    {
      "rating": "8",
      "text": "Even though I was reeled in by the cute characters and the futuristic hi jinks, part of my mind was fixated on how the world turned to refuse and how everybody got so lazy and fat."
    },
    {
      "rating": "10",
      "text": "amazing, speachless, captivating. really touching and emotional.  I realy thought that this movie was one of the best animation i have ever seen in my life."
    },
    {
      "rating": "10",
      "text": "Normally, fussing over every detail when creating art can make the big picture stiff and neglected.  Instead Wall-E blossoms into a masterpiece from whatever angle you look at it.  Bravo."
    },
    {
      "rating": "9",
      "text": "A vivid experience everyone should partake on no matter what age.  If you can fight the grueling and passive first 10-20 minutes, you shall be rewarded."
    },
    {
      "rating": "10",
      "text": "A classic disney movie. Amazing quality animation, great for kids and grownups. Loads of humor, cute moments, even thrilling. Character creation was the best, simple, yet straightforward, kept you interested for a long while thoughtout the movie."
    },
    {
      "rating": "10",
      "text": "Ok the images are clearly amazing. But what is this story and this scenario ?! It's so boring, so useless. I just wanted to kill myself cause I couldn't endure that !"
    },
    {
      "rating": "9",
      "text": "A perfect Pixar masterpiece that appeals to the science-fiction genre, while also finding simplistic romantic tie-ins and a child-based approach that allows plenty of entertainment for adults and children alike. Even though jagged dialogue is the main communication between characters, the emotion between each of them is strong and connective. By far a standout title among Pixar's great list."
    },
    {
      "rating": "9",
      "text": "This movie was one of my favorites from Pixar. It involves an innocent little robot who has feelings for a robot named EVE (Extraterrestrial Vegetation Evaluator). I'll leave the wonderful story from there. This film proves that humans aren't the only things with feelings, and it shows it in an awesome way. The movie gives plenty of laughs. The storyline is a little predictable, but everything else is excellent. If only I could give this a 9.5!!"
    },
    {
      "rating": "10",
      "text": "Without a doubt, the best animated movie I've ever seen and my 2nd favourite movie of all time. I can't fault anything about it. It is entertaining for all ages. I've seen it many times and still want to watch it more. It's a heart-warming story with a great meaning. I highly recommend it."
    },
    {
      "rating": "10",
      "text": "Wall-E is an astonishing film. The movie has barely a word spoken in the first 30 minutes but tells a story so magnificent, so touching, and so innocent it leaves you breathless. The movie injects something so rare in movies, sincerity that it might be Pixar's finest of all."
    },
    {
      "rating": "9",
      "text": "Very Cute  And Amazing Movie! This Is 100% Pixars Best Movie!"
    },
    {
      "rating": "9",
      "text": "Fantastic movie! As usual, Pixar knocked this one out of the ballpark. What I found really impressive was that despite the fact that the main characters are robots and don't really talk, you nonetheless come to love them and really care about their story. Heck, they even made a **** lovable. That takes talent."
    },
    {
      "rating": "9",
      "text": "I give out high ratings like a greedy old man gives out money. It's rare, and films must EARN it. Comedies only get 10s if they are great movies, and I consider them classics. While there are many classics, Wall-E directed Andrew Stanton is inredible. For those with a great attention span, there will be magic, and curiousity. This movie is fantastic for all ages. For a deeper diagnosis, it is filled with longing as Wall-E wants to be with Eve, and it shows through his motions. Incredible. This film is a classic in my book. It deserves it. A-"
    },
    {
      "rating": "9",
      "text": "Wall-E is a near masterpiece for the animation genre with a great plot and special effects while having that rare emotional depth for the icing on the cake."
    },
    {
      "rating": "9",
      "text": "WALL-E has captured the hearts that Pixar is still having throughout the past couple of movies. Let's just sit down and enjoy this movie right here and don't think about anything else."
    },
    {
      "rating": "10",
      "text": "Wall-e is my favorite animation and one of the best Pixar works! You will sink into the sweet story of a little, charming robot, who falls in love and saves mankind, followed by incredible effects, characters and beautiful messages. What more to ask for?! :D I really.. stand for a good 10 minutes, thinking and trying to spot some flaws, but really didn't succeeded. So watch it!"
    },
    {
      "rating": "9",
      "text": "Beautiful. Wholesome. Just plain good. The best Pixar movie ever made. There’s nothing more to say about Wall-E."
    },
    {
      "rating": "10",
      "text": "This is pure magic. It's able to give a robot personality when it barely speaks. It has some of the funniest visual gags in any animated movie. It gets you in the feels... every time. 10/10."
    },
    {
      "rating": "10",
      "text": "A romance story that still manages to hold it's magic twelve years later, this is the best Pixar film. No contest. Well Ratatouille is close..... but not that close."
    },
    {
      "rating": "10",
      "text": "The Best Movie of All Time. See It Once and You Can not Refuse to Watch It a Second Time."
    },
    {
      "rating": "10",
      "text": "Best kids movie ive seen in years. It has a great story and amazing visuals. I loved it to no end. All ages will enjoy. if your 1 or 100, you'll enjoy"
    },
    {
      "rating": "10",
      "text": "The Best Movie of Pixar & maybe of the decade!"
    }
  ]
}