{
  "id": 3014,
  "title": "Wanted",
  "starring": [
    "James McAvoy",
    "Angelina Jolie"
  ],
  "runtime": 110,
  "genre": [
    "Action",
    "Thriller",
    "Crime"
  ],
  "description": "Doormat Wesley Gibson discovers that his recently murdered father - who Wesley never knew - belonged to a secret guild of assassins. After a leather-clad sexpot drafts Wesley into the society, he hones his innate killing skills and turns avenger.",
  "releaseYear": "2008",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/cbDMsV4VJAL2xJ2JXdWWjmUXZkT.jpg",
  "categories": {
    "plot": 3.1724137931034484,
    "acting": 2.8181818181818183,
    "ending": 3.6,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 1.0,
    "funny": 3.0,
    "action": 3.3461538461538463
  },
  "reviews": [
    {
      "rating": "4",
      "text": "This is not the worst film in the world but it is definitely nowhere near the best. I have given a 4 since the film kept me moderately entertained while on a long car journey. I knew half what to expect: mindless violence with a stupid plot and over the top action scenes and this is exactly what Wanted delivered. If you are prepared to switch your brain off then it could provide some entertainment value."
    },
    {
      "rating": "4",
      "text": "Sexy action, yes. Jaw dropping action, no. Script, poorly written. \"Fraternity' cliche...yes. This is enjoyable to see in a theater, but not worth the cost of an evening ticket - see as a matinee."
    },
    {
      "rating": "5",
      "text": "wasn't that good of a movie i saw an early screening of it and i didn't like it much it was very very unrealistic at some parts. i personally think it was one of those movies that u ether loved or didn't think much of. some parts were really cool but just didn't have that feeling of like..... being able to believe that anyone could do them."
    },
    {
      "rating": "0",
      "text": "Muddled, misanthropic and stupid."
    },
    {
      "rating": "0",
      "text": "If Angelina Jolie could sink any lower she would have to make yet another movie of any catagory."
    },
    {
      "rating": "5",
      "text": "I wish I could have liked this movie, except every time I looked at my wife during the screening she had her hands over her eyes. Can you say violent? This movie puts Kill Bill in the docile category. Not for the timid or young viewers."
    },
    {
      "rating": "0",
      "text": "\"A spectacle of terribleness\" is how my husband described this movie. The loom of fate????? Give me a break. I felt like I was being kicked in the crotch repeatedly for paying my hard earned dollar to see this. How did this get good reviews? I am ashamed of our society. If I could get a lawyer to sue the filmmakers for wasting my money and time I would. Please don't spend your hard earned dollar on this....go buy yourself 1/8 th a tank of gas instead!"
    },
    {
      "rating": "5",
      "text": "How does one rate a movie that has spectacular visual effects, pretty much non-stop action and Angelina Jolie at her sultriest? When you add to that list of accolades: the most ridiculous main plot device in the history of movies (\"the loom of fate\"), the retarded use of rats as incendiary devices that apparently do no damage and characters that are supposed to be superhuman who have the need to get up close and personal to their targets (which allows them to be easily set up) . . . . This movie is an entertaining roller coaster type distraction. That is it. Some may love the film for the visuals and action; some may hate it for insulting the audience's intelligence. They're both right. At least there will be no sequel, as every main character (except one - our hero) dies. Thank god for that."
    },
    {
      "rating": "5",
      "text": "Very pretty but James McAvoy isn't Edward Norton."
    },
    {
      "rating": "0",
      "text": "Laughable plot, inane (and sadomasochistic) action scenes, forgettable dialogue, and everyone except McAvoy phoned in their performance. Avoid at all costs."
    },
    {
      "rating": "4",
      "text": "Just a dumb manufactured thriller. Even its occasional wit felt cheap. Its loud, its oh so slick and, despite not taking anything what happens on screen seriously, i still couldn't get past the total total emotional disconnect."
    },
    {
      "rating": "4",
      "text": "If anyone has read the comic book wanted, this movie is the biggest dissapointment ever. The second half of the movie was completely fabricated. do yourself a favor and just read the real thing and don't subject yourself to the slaughtered hollywood movie."
    },
    {
      "rating": "2",
      "text": "Irritatingly smug, ponderously self-important and ultimately numbing/dull and pointless, \"Wanted\" starts with a bang and then runs out of ideas, surprises and steam within its first 30 minutes. When you're watching a train plummet down a chasm and thinking about what you'd like to fix for dinner that evening at the same time, it's not a good sign. One of the most inept and knuckle-headed comic book adaptations I've seen in some time."
    },
    {
      "rating": "3",
      "text": "Terrible film. Sure it had a few good action scenes, but the plot and most of the acting was horrible. Not even worth renting."
    },
    {
      "rating": "4",
      "text": "Three words sum it up. \"Loom Of FAAAAATE\"! Very disappointing, especially the ending. If you can COMPLETELY shut your brain off, it's a decent action flic, but that's it."
    },
    {
      "rating": "2",
      "text": "Horrible! Just way too absurd! The storyline isn't all that fluid and anyone who knows just a little about ballistics has a pretty hard time watching this movie."
    },
    {
      "rating": "2",
      "text": "Draggy, and a ridiculous premise even for this type of movie. A total waste of talented actors. I blame the script and the direction. I expected much more, and am really surprised at the high reviews here."
    },
    {
      "rating": "2",
      "text": "I thought a 1 would be cruel. Maybe I"
    },
    {
      "rating": "5",
      "text": "The only great thing about this film is James McAvoy's performance. Jolie & Freeman sleepwalk through the film, and the action sequences are just too unbelievable to enjoy."
    },
    {
      "rating": "0",
      "text": "Embarrassingly bad lines, acting, plot devices. Good for a laugh if you're not affected by violence at all and two hours of your life is meaningless. Morgan Freeman--what were you doing in this awful movie?"
    },
    {
      "rating": "3",
      "text": "The action is great, but the plot twists are doozies. Then, there's the ending. If you've been debating about watching this one, save your money. It will look just as good as a rental."
    },
    {
      "rating": "1",
      "text": "Literally one of the worst movies I have ever seen. We went to the movie because it received generally favorable reviews on metacritic, only to have to sit through the longest two hours of my life. I am not big on action films, but can stand them. This was ridiculous and horrible. Spare yourself!!"
    },
    {
      "rating": "0",
      "text": "The most over-hyped movie I have seen all year. I couldn't fall asleep because the movie was so loud and I couldn't leave the theater because I didn't drive. I wish I ws one of the half dozen people that left half way through. The highlight of the movie was the Dark Knight trailer."
    },
    {
      "rating": "1",
      "text": "This movie was a 2 trick pony. When you get tired of seeing bullets colliding and cars flipping over one another, there is absolutely nothing else to see. The script was non-existant. The plot was so flat that you were begging for the \"twist ending\" that left you laughing. I snuck into this movie and still feel ripped off. I want the 2 hours of my life back to see batman again."
    },
    {
      "rating": "1",
      "text": "If this is entertainment, I need a lobotomy. There is nothing there."
    },
    {
      "rating": "4",
      "text": "This movie started strong, but seriously took a nose dive after like 20 minutes. Worthless story line along with a way to skinny Jolie who didn't show me anything the whole movie. I kept waiting for something to happen and the story just got worse and worse. Nothing new here in this one, it is easily the worst movie I have seen this year. Go see the Incredible Hulk if you are looking for a good action film, at least you will get good exciting and a good story."
    },
    {
      "rating": "5",
      "text": "Less than I expected, that's for sure. There were some humorous moments (the Loom of Fate is forever memorable) and Angelina Jolie is definitely a screen presence but this was a fair movie at best. When you're aware that it's a movie and look at your watch, it's a bad sign."
    },
    {
      "rating": "4",
      "text": "A bit of fight club + a lot of matrix + a little star wars (you are my son instead of i am your father... come on!) = wanted. See it if you like special effects and don't mind the reckless borrowing from better films."
    },
    {
      "rating": "0",
      "text": "-I thought this was gonna be a decent movie at best, but it wasn't even decent. For those who gave high scores then criticized others for their low ratings, you're not really making sense. When you say that it's supposed to be mindless action, then that means you're a mindless idiot of a viewer. I don't care if the movie's concept wasn't believable (that's why we watch movies), it's the fact that the acting was horrible, the script was full of more bullet-holes than the people who get shot in this dumb-ass movie, and it didn't make much sense. -BTW, the voice-over of the main character narrating the story is some of the worst in movie history; he makes fun of the audience by saying we're mindless sheep and he's so cool, but basically he's saying is what distinguishes his thrilling existence from our boring ones is that he kills people and that makes him cool. And especially at the end when he asks what we've done with our lives: the attempt to break the \"fourth wall\" and sound profound doesn't work, and makes the director and writer seem like freaken retards. -Also, there's so many glaring plot-holes. Ex: the assassin at the start can jump so far and run so fast as to make papers scatter, but he's NOT the world's greatest assassin. However, NO ONE else in the movie has that ability, even the main character or his father. -I \"WANTED\" to like this movie, but now I just \"WANT\" to kick whoever's ass that made it."
    },
    {
      "rating": "4",
      "text": "6.7 is definitely overrating this movie. The plot was stupid and the twist was predictable, my little brother knew hwat the twist was gonna be 25 mins into the movie, no joke. The bullet curving is so stupid, such a childish concept, how would moving the gun effect the bullets motion, I mean even in a basic understanding of physics you'd realize wherever the gun is pointing when the trigger is pulled the bullet goes... You want a fast paced, reality curving gun action movie, watch the matrix one and two at least they had a storyline (wasn't a big fan of the third)."
    },
    {
      "rating": "0",
      "text": "This was an absolute garbage. Very hard to find even one redeeming feature. Wasted time."
    },
    {
      "rating": "4",
      "text": "The plot and storyline is laughable. The petty scenes of revenge against the office tyrant, the ex-girlfriend, the best friend are pitiful and revealing of the scriptwriter's emotional maturity. Come to think of it, the whole film says a lot about how old the writers were. Redeemed only by James McAvoy who is over the top and verging on melodrama but is somehow appropriate for this messy film."
    },
    {
      "rating": "5",
      "text": "This movie offers nonstop action from start to finish, but there's nothing else to keep viewers interested. If you want to watch a mindless film without any semblance of reality, then this movie is for you. If you want to be able to have some brain activity while still being entertained, then find another film."
    },
    {
      "rating": "0",
      "text": "I lowered my standards as much as possible before seeing this boring and totally computer generated, play it safe, fake stunt, wank but I was still shocked. The only thing that blew me away in this plot less career killing waste of money was the pure ass stink of every person involved in its production. From the acting and directing to the sets, dialogue, premise, you name it, it's all crap. How did they get Morgan Freeman to do this?! Amazingly, the film has the nerve to lecture the audience after the whole ordeal is over! I never thought shootouts, explosions and hot chicks could be made into such a colossal bore. save your time, save you money, and spend it doing something a million times more exciting... like picking lint from your belly button."
    },
    {
      "rating": "1",
      "text": "I was really disappointed with this movie. I loved the graphic novel that was the source material. Aside from the obvious ignoring of the laws of physics, this movie made no sense at all. It was a waste of time except for the action scenes and Angelina Jolie, who is smoking hot (and I am gay.)"
    },
    {
      "rating": "3",
      "text": "We hated it. I thought it was trying too hard to be hip,cool and brash. Too much senseless violence and a very weak script. very disappointed."
    },
    {
      "rating": "3",
      "text": "Not sure why this is called Wanted, when it bears no resemblance to the comic book. That might have been a good thing if the new direction they took the plot in wasn't even worse. This is basically Assassin's Creed the movie, and while it's better than that video game, it still pretty much sucks. It's good for a few laughs, but definitely not worth the price of admission."
    },
    {
      "rating": "5",
      "text": "Wanted falls very short of expectations. It definately has it's moments and it is sad that the execution wasn't there as the few pieces that held it together would have made another more polished plot into a great action movie. The writers couldn't decide if the characters were supposed to be super-human or just well trained assassins as they flip flopped between very supernatural behaviour to hand to hand combat. In the end it seemed like the story was rushed along to get a few of the special effects they were excited about out the door before the competition."
    },
    {
      "rating": "5",
      "text": "The first 45 minutes you feel the heavy hand of the editor removing all character development. The action is derivative and the \"suprise\" plot twist can be guessed at a mile away. Save your monet or see Wall-e again."
    },
    {
      "rating": "5",
      "text": "It was good for an action movie. I don't usually see those things.. anyway, wtf was with the beginning? Those 'two parts' were totally unecessary. I mean, they could've just explained that his girlfriend was cheatin on him.. anywho wahte."
    },
    {
      "rating": "5",
      "text": "Stylyized violence meets nerdy white boy dreams. All you need is some assassination training, a big gun, special bullets that shoot around things and you can control the world. Too bad Wesley does have a better answer to the question they keep asking him in the movie."
    },
    {
      "rating": "5",
      "text": "The train wreck is very ironic in this movie. Why? Because I felt like right when the train-wreck happened, that's the movie turned into. It had some real original ideas, and some kick ass action scenes, but once they did that bullet hitting bullet mid-air trick for like the 5h time, it was just ridiculous."
    },
    {
      "rating": "3",
      "text": "There was a script? Worst movie I have seen in 5 years!!!"
    },
    {
      "rating": "4",
      "text": "A rollercoaster ride? I literally fell asleep in the middle of this movie (it was a 12am showing). Plot and script were cast aside and replaced with weak excuses to show rediculous action scenes, sexy actresses, and displays of violence that were disturbingly glorified and artistic. I found some enjoyment out of this movie as many of the action sequences were not taken that seriously and were actually pretty funny to watch. This amusement quickly wore off on me and since the story was not even remotely interesting, I decided to make better use of the dark room and padded chair that I had spent $9 for."
    },
    {
      "rating": "4",
      "text": "Some of the action sequences were cool. There is a massive gap in logic though where supposedly binary code like computers use to turn 1s and 0s into letters was invented a 1000 years ago by textile mill workers. Not sure if that is a fault of the comic books it was based on or just lazy screenwriting."
    },
    {
      "rating": "2",
      "text": "Holy shEEt! Annoying, irritating and pretentious!!! This is matrix and jumper and \"God-knows-what-else\";) mixed into totally inedible pulp. DONT waste Your time for that one!"
    },
    {
      "rating": "2",
      "text": "This movie is a dark, gory, nihilistic bloodbath (how many different ways and times can you shoot a person in the head?). It is being touted as a \"must-see\" movie of the summer, but don't believe it! Some of the action scenes were cool, but most were so over-the-top that they detracted from the film in my opinion. There are some comedic moments that lighten things up here and there, but even some of the \"humor\" in these moments was a little too disturbing for me. Additionally, the storyline was weak and disjointed. I love action movies but this one seemed (in my opinion) to almost glamorize killing, or, at a minimum, it treated murder too lightly. Not recommended."
    },
    {
      "rating": "2",
      "text": "I thought this movie was dreadful. Sort of like The Matrix meets the Punisher. The action was completely over the top and unbelievable - it was unbelievable in the Matrix, but at least they had the excuse of being inside a computer simulation and not in the real world. No plot at all - a LOOM of FATE?! Come on! Terrible acting. James Macavoy makes a terrible action hero - looks like a school kid running around, none of the months-of-training martial arts of Reeves/Fishborne in the Matrix or Matt Damon in the Bourne films. The whole thing is just an excuse for special effects, which aren't bad but what's special about that any more? Dreadful, dreadful, dreadful."
    },
    {
      "rating": "4",
      "text": "The movie had decent acting, but not plot or point. It was like Fight Club meets James Bond, but with none of the finer points of either. The movie would have been better if they presented it in a more comic book stylized manner. After this movie, I am seriously doubting the ability of critics to judge a stinker from a winner."
    },
    {
      "rating": "1",
      "text": "I could not believe how bad this flick was, especially considering the talented cast. I kept hoping that McAvoy would revert back into Mr Tumnus happen upon and slip into the Narnia wardrobe and exit that awful movie."
    }
  ]
}