{"id": 4137, "title": "War", "starring": ["Jet Li", "Jason Statham"], "runtime": 103, "genre": ["Action", "Thriller"], "description": "FBI agent Jack Crawford is out for revenge when his partner is killed and all clues point to the mysterious assassin Rogue. But when Rogue turns up years later to take care of some unfinished business, he triggers a violent clash of rival gangs. Will the truth come out before it's too late? And when the dust settles, who will remain standing?", "releaseYear": "2007", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/scFc8RD4sFxB2x0eIOaymphMnYh.jpg", "categories": {"plot": 4.625, "acting": 4.5, "ending": 4.933333333333334, "soundtrack": 5.0, "cinematography": 7.0, "familyFriendly": 3.0, "funny": 2.0, "action": 6.125}, "reviews": [{"rating": "1", "text": "POW!!!! War is shocked with action. But that's all. Just action. You've gotta' be kiddin' me. Who would think of a stupid story like this. Jason Statham actually had a pretty good role, but the plot was terribly written. All it was was this chinese guy killed Statham's partner and wants to take revenge. Just too obvious. I think the Director of Epic Movie would do better, even though that one was still a complete mess. War, I think not. Not much of a war to me. They should have called it Revenge of the Partner, sounds kind of pathetic but still. I think it could've been better on a whole pack of other ways."}, {"rating": "2", "text": "This was a by the numbers shitty boring flick. So predictable, and unlikeable. At the end of the movie the entire audience yelped a loud WHAT??? Absolutely terrible."}, {"rating": "5", "text": "Cool idea - Yakuza vs. Triad in America with an unstoppable \"rogue\" operative who was working for one side then unexpectedly starts wiping out the other side. Compelling and interesting action flick that you can just turn your brain off... that is until the last 15 minutes. The movie jars you with a ridiculous and non-sensical twist that is like hitting the audience with a 2x4. The ending is so absurd that it caused my brain to switch back on and realize that this was a terrible movie. For the first 90% of the movie, I give it a 5."}, {"rating": "10", "text": "A hit, its the best action movie of the year that surprisingly beats The Bourne Ultimatum. Its disturbing and thrilling, War is the movie that none of us had expected."}, {"rating": "6", "text": "A little bit of everything but never really excels at anything - for an action flick the plot was above average but you never really know it until the end, however the twist was unfortunately just not that plausible."}, {"rating": "4", "text": "Mindless in the way that it tries to put so much of that pretentious intelligence into an action movie, it loses touch with itself. This isnt a cobweb, because cobwebs are neat and constructed. Its literally a desk, full of papers scattered all over the place, placed in drawers and forgotten about, some even lying on the floor with coffee spilled all over them so they're basically pointless. Jason Statham plays a man who lost his partner, and when he finds out who did it, a man named Rogue (played by Jet Li), he goes out on a man hunt. The character Rogue.....well, don't bother trying to figure out just what the story is on him. The entire story is wrought with double-crosses, backstabs and kill after kill after kill, but it ultimately leaves you unsatisfied. You wait for the showdown between Statham and Li, and what they deliver is hardly a good recreation of the great Norris vs. Lee fight, and the \"final climax twist,\" just leaves you feeling even more unfulfilled. With two of the most popular bodies of martial arts, there is so much more that could have been done here. Maybe Mr. Atwell should have spent less time trying to spin our heads around, and more time giving us what we wanted- toe-to-toe matchups, wall-to-wall fighting."}, {"rating": "6", "text": "Plot is silly - the writers tried way too hard to be tricky. But there are some great action scenes. Worth a matinee - or a DVD rental."}, {"rating": "7", "text": "Imperfect, but fun. Jet Li's viciousness and smart character manipulation really makes the film. Some fight scenes could have been better, camerawork needed some widening, but otherwise a very enjoyable popcorn action flick - with a better than average plot for a film in this genre. Recommended."}, {"rating": "10", "text": "it was a good movie"}, {"rating": "5", "text": "Anything higher then a 5 is ridiculous for this movie.I don't know how anyone could screw up a movie with Jet Li and Jason Statham but this producer should did.It never really grabs your attention.The first forty minutes are pretty boring with hardly any fighting.Jet Li and Jason only fight for about 3 minutes in the movie.I was confused near the ending so I just assumed what the ending was about.Don't even waist your time on a weekend watching this or even late at night you could spend the 2 hours reading blogs online which is much more entertaining then the movie."}, {"rating": "10", "text": "This movie was great. Jet Li does it again with another great action movie. This is probably his best American film so far. It doesn't compare to his chinese films like Once upon a time in China or Fearless but it was a real good action movie, i don't care what the critics say."}, {"rating": "7", "text": "I thought this was an alright movie."}, {"rating": "3", "text": "The director took a fair story and botched it and Jason Strathorns career, setting them both back a couple of years."}, {"rating": "0", "text": "Why is Jason Statham so popular in Hollywood? This concept that he, or Vinnie Jones, can carry a movie is laughable."}, {"rating": "7", "text": "The action in this movie was pretty good, it had swords, guns, and hand-to-hand combat. It also had some twists, which were entertaining. The ending had many people in the theater confused. I was looking forward to more fights between Jet Li and Jason Statham. The plot was pretty interesting. Either you are gonna love or hate the ending, no in betweens."}, {"rating": "10", "text": "this movie was packed with action from the get go and u don t see that, that much anymore"}, {"rating": "5", "text": "As expected, It was a solid action flick that was worth watching for Li and Statham alone. The twist at the end was a little expected but still worked out good. It was ok but not as good as I expected it to be."}, {"rating": "6", "text": "Statham and Li's action-thriller suffers from not fully embracing the more fun elements of it's B-movie nature. It takes almost an hour to get to the action we are waiting for. It's a little too plot heavy. Something that's really only a problem because our leads go so underdeveloped. There are also problems with the logic behind events. Like the scene where Statham is magically able to deduce who the dirty cop behind the gunning down of Yakuza thugs is. I like the different flavor the focus on Asian crime syndicates brings to the mix. It's a nice change of pace from your typical street thugs and mafia types. It kind of brings an interesting question to the table though. Why is War set in San Francisco? Bringing all of these Triad and Yakuza members stateside serves no other purpose than allow for a white actor to be marketed as the lead in order to appeal to an American audience. With so much of the architecture and locales appearing distinctly Asian, the U.S. setting feels wildly out of place. Especially since Statham is barely in the movie at all. They could have just as easily trimmed down his part, cast his character as Asian, moved the setting to Japan or China, and spent more time fleshing out Li's role as his is the one so crucial to the film as it's his increasingly questionable actions that will keep viewers interested right up to that incredibly satisfying big twist that almost makes everything worthwhile.When the action finally ramps up things get much more entertaining. There are all the katanas, shout outs, and chases you could want. Li and Statham have managed to stand out as actions stars thanks to the remarkably fast physicality they are able to show off in fight sequences. War makes good use of both of the actor's abilities and allows them to dish out some bloody deaths. So the film has some cheap thrills that make things more entertaining in it's second-half, and overall the first-half isn't terrible. Some questionable writing and half-baked characters bring things down, but the energetic violence and stellar reveal help bring some life to the mix. It may only hover slightly above the realm of mediocrity, but War can still manage to entertain the action movie fans out there who are more concerned with star power and some decent punches thrown as opposed to genuinely fulfilling writing."}, {"rating": "2", "text": "War is lacklustre in many regards, with  the storytelling, characterisation and acting leaving a lot to be desired. You could forgive this little B-movie for these shortcomings if it managed to entertain in other ways, but generally War just isn't enough fun. The action is all competent, and both the Li/Statham car chase and their close-quarters fight at the finale is well-handled, but the set pieces are over too briefly, and are surprisingly infrequent for a film of this type. It's also disappointing that a film that pitches Jet Li and Jason Statham, two of the most talented martial artists currently working on film, against each other and doesn't give them many opportunities to demonstrate their considerable combined talent - in most scenes they are reduced to taking pot-shots at each other rather than getting up close and personal. Aside from a couple of stand-out set-pieces, and Statham giving off his usual gravelly charm, War is a largely dull affair, with a flimsy plot, terrible acting and staggering cultural insensitivity. For a film like this to work, it needs something extra - whether it's more memorable and stylish action, a bit of humour thrown in or a better script, and it certainly cannot take itself as seriously as War does."}, {"rating": "5", "text": "10 for having Jason Statham in\r0 for giving us a weird story.\r In the end I dont understand anything about the story who was who and what was what?\rJust watch it for the fighting scenes."}, {"rating": "6", "text": "Reasons to see WAR\r WAR kicks ass, and you should see it a lot of times, for these reasons:\r Jason Statham yelling at people, and then kicking ass. In other\r words, being himself.\r Jet Li killing a guy by kicking him in the face....and that's not his\r best kill.\r Random girls getting nude for no reason.\r Ninjas. Just when you think this movie couldn't rock any harder, they\r put Ninjas in the movie.\r A twist ending that would make M. Night Shawhocares *beep* himself.\r A car chase every 10 minutes. There's even one with motorcycles.\r Violence. Lots of it. Guns, blades, blood, kungfu, decapitations, the\r bases are covered.\r -Jet Li and Jason Statham fighting each other. It's as epic as you might think.\r So, in conclusion, if you, 1. Like things that are awesome. 2. Have a pair of testicles. 3. Need to see a movie that rocks for a change. 4. Are a human being.\r ...than WAR is for you."}, {"rating": "6", "text": "Not the best but good    ."}, {"rating": "3", "text": "War is a film with an unintelligible plot, very basic characters and not very abundant action scenes.In short, a disastrous film."}], "recommendations": ["safe", "the_mechanic", "salt", "death_race", "the_ice_road", "london_has_fallen", "furious_7", "escape_plan", "mission_impossible_ii", "angel_has_fallen", "the_commuter", "jason_bourne", "atomic_blonde", "den_of_thieves", "wrath_of_man", "ninja_assassin", "mechanic_resurrection", "the_fate_of_the_furious", "infinite", "the_marine", "xxx_return_of_xander_cage", "wild_card", "olympus_has_fallen", "sabotage", "the_last_stand"]}