{"id": 387, "title": "War for the Planet of the Apes", "starring": ["Andy Serkis", "Woody Harrelson"], "runtime": 140, "genre": ["Drama", "Science Fiction", "War"], "description": "Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet.", "releaseYear": "2017", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/ijQHiImv16vNSeZQsmih04kwn0C.jpg", "categories": {"plot": 9.163934426229508, "acting": 9.253968253968255, "ending": 9.217391304347826, "soundtrack": 9.666666666666666, "cinematography": 9.25, "familyFriendly": 6.0, "funny": 9.333333333333334, "action": 9.176470588235293}, "reviews": [{"rating": "10", "text": "War for the Planet of the Apes is to me one of the year's best movies. It's the perfect conclusion to the Planet of the Apes reboot trilogy, which should be remembered as one of cinema's best trilogies. The action, the emotion, the visual effects and the Oscar-worthy performance from Andy Serkis are only a few reasons why everyone has to see this movie."}, {"rating": "10", "text": "Already one of my favorite movies this year, so far. 'War for the Planet of the Apes' is a fitting end to a classic trilogy that revitalized the long running \"Planet of the Apes\" franchise which started as far back as the late 1960s. This movie sees Caesar (another brilliant Andy Serkis performance) still trying to fight for survival with his entire family and friends of apes also looking for ways to survive. Things take an ugly turn when The Colonel (Woody Harrelson) discovers the apes' habitat, and Caesar feels he must take action. There is a lot to talk about in regards to the plot, but things do happen early on that the trailers did not show, so without the fear of spoiling the movie, I'll just review the movie in regards to what I loved so much about it. Director, Matt Reeves takes the personal and poignant (two words you never thought would be used to describe a \"Planet of the Apes\" movie) aspects of the previous movie, \"Dawn\", and makes it arguably more emotional here. Some new characters are also a welcome addition to the franchise, particularly Bad Ape (Steven Zahn), who provides just the right amount of comic relief when the movie needs levity, instead of being that funny character who overstays his welcome... in other words, he is nothing like Jar Jar Binks of the \"Star Wars\" prequels. Serkis is obviously better than ever, playing the emotionally distraught ape, Caesar, who is still horrified after the events of 'Dawn of the Planet of the Apes' (2014), the CGI looks just as good, if not, better than ever from the previous movie. The human characters are also very well developed, more so than in the previous two movies. This movie reminded me of 'Logan' (2017), in that, it's personal... it's not some colorful, fun blockbuster like 'Spider-Man: Homecoming' (2017) (which I really liked), but it's also not some dumb action extravaganza like the \"Transformers\" sequels. It's just a small, emotionally stirring and gripping movie that does not feel like a product of a big studio trying to spend their money, and waiting to make it back. 'War for the Planet of the Apes' is the perfect sequel to the surprisingly great \"Rise\", and the equally entertaining \"Dawn\". Also, Michael Giacchino's score is as terrific as ever, probably his best work since 'Inside Out' (2015). His music just fits the tone beautifully for the movie, and is sure to get a lot of people thinking once they see this. I cannot stress this enough of how great this movie is, it's one of my favorites this year so far."}, {"rating": "8", "text": "Great action. Good plot... although a bit drawn out.  Nonetheless... I must always keep in mind that this a science fiction movie.  The apes seem all too human and must make many choices that are akin to human survival.  But these are apes.. with the same wants, needs and interests as humans. Survival and existence without predatory threats.  The action, acting and special effects are flawless.  The plot was lacking some direction at times... and the villain...woody harrelson... was a bit conflicted ...  which we will never know what his deal truly was.  Was it Militarily centered... or some biological issue that the film sort of touched on?  I guess we will never know.  other than that.. good time on the couch."}, {"rating": "10", "text": "War for the Planet of the Apes is an excellent conclusion of an epic trilogy. The movie is very mature, interesting, have a beautiful soundtrack, memorable characters, a epic entrance scene and a great end (no spoil !). Andy Serkis is perfect in Caesar. A excellent movie"}, {"rating": "8", "text": "Loved it, an amazing end to a brilliant trilogy, great story and great acting. I hope there's more but if this is how it ends I'm happy. A must watch if you haven't saw this trilogy."}, {"rating": "10", "text": "Best third one ever. This should be put up with Last Crusade, Return of the King, and The Dark Knight rises."}, {"rating": "8", "text": "As usual the best part of a movie from the Planet of the Apes franchise is the story part. Fortunately this movie is not only about action as hint in the title, so I enjoyed this movie. The story itself reveals interestingly, the actors are great and the actions scenes were well done. Anyway the mainstream scenes (slow emotional kitsch and dumb dialogues for example screaming) were annoying, especially the little girl was pure kitsch."}, {"rating": "10", "text": "La Planète des singes : SuprématieUn superbe film doté d'une clôture dans la lignée des 3 épisodes. Bref ce film est excellent comme la série qui se place en prequel.Pour résumer la planète des singes est un film intelligent tourné sur les questions existentielles de la vie ainsi que la différence entre Singe et Humain (Animal Vs Humanité). Il va cependant beaucoup plus loin comme l'interrogation du début de la fin. Cette dernière question nous suit tout au long du film de manière implicite (message en arrière-plan écrit sur les murs et les objets...)[spoiler]    et est exprimé de manière explicite à la fin #Nova    [/spoiler]    . [spoiler]    Même l'adoption d'un étranger ou d'une autre espèce au sein d'un groupe ou tribu complètement différente autant en besoin qu'en croyance.. quoique...    [/spoiler]    Mes craintes étaient d'avoir un épisode seulement orienté de manière réductrice sur la guerre. Mais pas du tout.. Il est meilleur que les autres et ne s'attarde pas sur la beauté des images il va plus loin comme montrer la dureté d'un conflit qui est émotionnellement forte (on s'attache aux singes) et que la guerre n'est pas majoritaire par rapport à la survie. Le film oriente son discours sur la stratégie de combat, escape et de survie. Le méchant a une valeur ajoutée bien dosée #ConflitD'Icone, en réalité il y a un excellent méchant. Un bon méchant c'est un film réussi. Cesar Vs Mechant.L'ambiance est excellente. Un film de survie. Des saturations en coucher de soleil qui nous rappellent des jeux comme \"The Last Of US\" ou une série comme \"The Walking Dead\". Cela renforce l'esprit survie et de l'espérance. [spoiler]    On est vite refroidi, mais après tout il n'y a plus d'espoir dans la neige..    [/spoiler]    [spoiler]    Finalement, l'épisode ne s'arrête même pas ici et nous fait comprendre le début de \"La planète des singes 1968\"    [/spoiler]    Les effets spéciaux sont sublimes les singes sont filmés comme les vrais acteurs (comme les 2 autres épisodes).. Ce qui choque c'est que le film n'a plus peur de faire des gros plans sur un visage \"singe\", mais ils s'en servent comme un outil émotionnel.La musique de Michael Giachinno est géniale comme toujours les notes de piano vous feront pleurer de tristesse.La 3D est majoritairement plate, mais le CGR n'aide pas vraiment à avoir une bonne 3D.Je déconseille ce film pour les enfants #PériodeVacances #Cars3Il est conseillé d'aller le voir si vous aspirez à aller voir un \"Alien\" dans le monde d'Hollywood d'aujourd'hui !"}, {"rating": "9", "text": "I was surprised how good this movie and it was definitely the best out of the series so far. Bad Ape is hilarious and makes me laugh every time. Besides it being funny it has a ton of emotion and significant character moments. Caesar's death at the end was a great and satisfying way to close the book on the trilogy. One of the best movies of 2017.Score 9/10Amazing"}, {"rating": "8", "text": "One of the best films of the year. Andy Serkis is great as always. Dawn maybe slighter better mind."}, {"rating": "10", "text": "The characters went through so much together, been to so many situations.Wow.Life teaches everything. 10/10"}, {"rating": "10", "text": "War for the Planet of the Apes was gut-wrenchingly epic. Andy Serkis gives the best performance of his career, the visual effects are stunning, and the visual storytelling is down-right poetic at times."}, {"rating": "9", "text": "(93/100)I felt for Ceaser in this movie, its a great ending to the story..."}, {"rating": "9", "text": "This final chapter concludes the \"Planet of the Apes\" trilogy in a spectacularly satisfying fashion, combining jaw-dropping visual effects, remarkable performances, and an extremely moving and poignant narrative."}, {"rating": "10", "text": "I regret that i didnt watch this in cinemas. Would've been awesome. Every time i watch a Planet of the Apes movie i start with a mindset \"yeah this is gonna be an average Hollywood movie\". And especially on this movie i was blown away. This movie has beautiful images, heartbreaking scenes (i had tears in my eyes, havent had that for a long time), a mindblowing stories and the Apes are animited beautifully like in the previous movies, but a little bit better than the last times.This was my movie of the year 2017, together with Baby Driver. This is the best movie out of a great triology and a ending i didnt expect. In general the movie isnt really predictable and if you watch it with the regisseurs comments you now how much work and love they put in this movie. I rarely give a 10/10, but this movie really deserve it."}, {"rating": "10", "text": "For starters, this movie is a technological marvel and will hold up for years to come.  The CGI of the apes is nothing short of amazing and you never think it’s CGI, you believe those are actual animals with personalities.  Even the camerawork makes it even more believable, because you get close ups of these apes and the apes don’t look any less believable which is very hard to do with CGI.  The use of real sets and how seamlessly it blends with the CGI is another marvel because in many movies today I can easily see were CGI has been placed, but this movie does a marvelous job of using both practical and digital affects.Lastly, the king of motion capture, the man, the myth, the legend Andy Serkis!  What else can I say about this man that hasn’t already been said about him in these movies.  The man gives another Oscar worthy performance as Caesar and shows a totally different dynamic of the character.  You see through his performance that Caesar is in a totally different place and has just had it with settling with the humans and fights only to protect his kind.  Andy Serkis brings this character to life yet again through his great emotional movements and expressions he brings to life as the king of motion capture.  You also see Andy Serkis bring all new, damaged, aspects of the character.  You see Caesar still trying to cope with the events of Dawn that Koba caused and him still thinking about what could’ve been if they didn’t happen.  You also see a scene where Caesar make a decision that goes against all of his ideals, but you find a way to agree with this decision, and Caesar acknowledges that it’s his own flaw.  Andy Serkis deserves an Oscar nomination for this performance, while he probably won’t get one he solidifies himself as one of the best actors in the business.  Andy Serkis will forever be the king of all apes only known as Ceasar.I thought that this movie was a compete masterpiece, but I did have to nitpick some things for the sake of this review.  To start off, towards the end while the apes are attempting a mission a lot of conveniences happened so the plan is taking shape.  While that cliche is used in almost every movie, it was a little too obvious while I watching the movie.  Secondly, the little girl in the movie, while she did a fine job I couldn’t say she was irreplaceable.  This being because a kid actor who has to speak with the performance is, to me, automatically compared to Dafne Keen in Logan.  When I compared the two performances, Keen’s performance kills the other girls performance, she did do a good job but didn’t shine as much as Keen did in Logan for a child actor.  Lastly, I would have to say that Battle for the Planet of the Apes would’ve been a better title because war isn’t the main focus of the story, more like a significant part in the third act that the movie led to.The last little problem I had with this movie was the act of a good human character in the movie.  Don’t get me wrong, I love being with Caesar more than with humans.  But, in the first two, you saw certain human characters that made the decision of siding with either the apes or humans harder for me as I was watching the movies.  In this movie, it is a little more black and white on who you should side with because  there aren’t any humans that you see have compassion for the apes and try to help them besides the little girl.  The story could’ve benefited just from a simple look of a soldier that thinks maybe what they’re doing is wrong.The last little problem I had with this movie was the act of a good human character in the movie.  Don’t get me wrong, I love being with Caesar more than with humans.  But, in the first two, you saw certain human characters that made the decision of siding with either the apes or humans harder for me as I was watching the movies.  In this movie, it is a little more black and white on who you should side with because  there aren’t any humans that you see have compassion for the apes and try to help them besides the little girl.  The story could’ve benefited just from a simple look of a soldier that thinks maybe what they’re doing is wrong.I don’t want to go into huge depth about the movie because I want you to experience the movie yourself.  All I say is that War for the Planet of the Apes is a masterpiece of a movie and gives you the conclusion to what now will be considered the best trilogy of the decade.  You connect with Caesar more than ever, the story is investing and the performances are all great.  Along with being a great action movie, the drama is in the forefront and is a great thought provoking movie."}, {"rating": "10", "text": "It is very rare that a modern film trilogy doesn’t have a bad entry in the series but it is even rarer that every film in the series is brilliant in its own right. Any fears of the last part of the trilogy being a let down were quickly squashed as the critics gave high praise to the summer’s best intellectual blockbuster.In War for the Planet of the Apes, we rejoin Caesar and his apes as they are forced into a deadly conflict with an army of humans led by a merciless Colonel. After the ape family suffer unthinkable losses, Caesar struggles with his darker instincts and his ideas for vengeance against humankind. As the ape’s epic journey brings Caesar and the Colonel face to face, they are drawn into a monumental battle that will determine the fate of the planet.Not a single frame is wasted by director Matt Reeves. The film is full of stunning cinematography from start to finish; with dazzling sets and locations which transport you deep into the middle of the ape’s world. War for the Planet of the Apes has probably the best use of CGI and motion capture ever committed to film. Caesar’s character has been rapidly developing throughout the series and now in the close ups, you can clearly see Andy Serkis in there more than ever before. All of his facial expressions are realised and you feel exactly how he is feeling. Caesar has become mythical himself and will go down as one of the most compelling characters in modern cinema.The stunning musical score by Michael Giacchino is completely wonderful. It heightens the experience, enhances moments of silence, captures the tension and suspense and overall suits the material to a T. Giacchino is quickly cementing himself as one of the all time great film score composers.Like the other previous entries, there are many Easter-eggs and links to the series. But this time the links are much more accessible to casual fans. The script expertly sets up the state of the humans in the original 1968 film while also setting up one of the original characters in a charming way.There is much-needed humour injected into the film with the addition of the new character Bad Ape. Throughout the film’s sombre tone and dark setting, he provides some uplift. While being a hilarious and endearing character, he also surprisingly gives some of the most touching moments.War for the Planet of the Apes is a stunning conclusion to Caesar’s story but also an incredible film in its own right. It’s the completion of a masterful trilogy which works extremely well as a whole story linking together. The Apes prequel series can now be added to the list of the greatest film trilogies of all time after pulling off the near impossible of not featuring one bad film."}, {"rating": "10", "text": "Favourite movie of all time, which surprised even me. Have watched it multiple times after the initial viewing and my thoughts haven't changed. I typically prefer more critically-lauded films but for some reason I absolutely loved this brilliant end to the Apes trilogy."}, {"rating": "8", "text": "A fine conclusion to this re-booted franchise. For what is in the main an action movie there is a fair amount of depth and character development going on."}, {"rating": "9", "text": "A great end to a surprisingly great franchise, I actually think this is the best of the three."}, {"rating": "9", "text": "Wooooooah. Didn’t really expect the movie to be so good. It’s long, but it’s worth it."}, {"rating": "9", "text": "What a spectacular conclusion to a superior trilogy. It may not be the bombastically action-packed finale that would be expected from a title like \"War for the Planet of the Apes,\" but this film finishes the Apes origins saga in a way that's far more gripping, intelligent, and thought-provoking than a blockbuster could ever be expected to be.Caesar ought to be cemented as one of cinema's most memorable characters. This movie completes his arc so powerfully as he--for the first time in the trilogy--confronts his demons and learns what it truly means to lead. The motion-capture is perhaps the best ever put to film as the apes' emotions are so effectively portrayed. Caesar is old, tired, and battle-hardened, as are his primate companions, and it shows. The human characters here are also arguably the best of the three films as the morality of all sides of the conflict are explored. Rather than painting this war as a black-and-white good ape vs. evil human sort of struggle, the story shows it to be a psychological war. It's a deeply complex political tragedy where evil deeds are done with the best intentions. It's thought-provoking in a way that is rarely seen in cinema todayAlthough it is the most effective of the trilogy, War does suffer from some very sluggish pacing. Slow-burning stories are not always bad, but this one does not have enough locations or differing events to keep it engaging throughout the entire runtime. The dialogue is sufficiently intelligent to mostly make up for it, but the film seems to end in a disappointingly abrupt way that doesn't quite serve as a payoff for the long, bleak drama that led up to it.Nitpicks aside, War for the Planet of the Apes is an emotionally exhausting sci-fi tale that adds the perfect cap to the provocative themes and poignant character arcs of its predecessors and makes this trilogy one of the best sci-fi series ever put to screen.Story: 8.5Acting: 10Script: 9Visuals/Sound: 10Entertainment Value: 8.5OVERALL SCORE: 9.2/10"}, {"rating": "9", "text": "What an excellent movie - and about 10 times better than any comic book movie or the shallowness of Baby Driver.  It's the first bona fide great movie of the summer.  The acting is incredible, the directing impeccable, and the writing?  Second to none. Congrats to everyone involved"}, {"rating": "10", "text": "War for the Planet of the Apes, was emotionally dark, beautiful, realistic and a perfect piece of filmmaking from the brilliant director Matt Reeves.It surely is a good finishing for the Planet of the Apes trilogy. Andy Serkis and other actors did brilliant job on Performance Capture and they do deserve highest of awards.It's gripping story gives rise to possibilities of more franchises in the world of Planet of the Apes than ending the story. I was lucky enough to catch the Dhaka Premier of this film, and experienced it on Dolby Atmos hall, it was amazing, I had a great time, specially the fight and battle scenes although not very long. I loved it and I would suggest all to watch this film.All hail Caesar!"}, {"rating": "9", "text": "This is indeed the epic finally that this franchise earned, making it in my mind, a perfect film trilogy. This is the best of the franchise and what makes it so special is the anti-blockbuster feel. This is 100% slow burn a drama that is purely character given. The special efforts are jaw dropping, the cinematography gorgeous, the music elevates each scene, and Andy Serkis once again delivers on one of the best performances of the entire year."}, {"rating": "9", "text": "A fitting end to one of the best trilogies ever. While the film is called War for the Planet of the Apes, this film is more personal struggle and the decision's that Caesar must make.  Like the other two films this film looks amazing and the score is perfect.  The score has the feel of the original Planet of the Apes film.  Overall this is one great summer film and a fourth would be okay by me. A"}, {"rating": "8", "text": "I predict this movie will get an Oscar nomination or 2.  It's moving,fast-paced,significant with the most awesome special effects.  I mean how do u make a hairy face of primates convey such deep emotions and intelligence. Must watch!"}, {"rating": "8", "text": "I hope this part is the last in a series of refreshed planet of the apes. Great atmosphere, dashing scenes and moving sequences. Few people in this scene, definitely not enough interaction between species. Summing up the whole movie for incredible visual effects and keeping the tension in sequence gets a nice rating."}, {"rating": "8", "text": "The third instalment of this trilogy had a high bar, given the quality of the last film, and ultimately this didn't disappoint. Serkis is magnificent as Caesar, and this is a performance that shows mastery of his craft. The storyline is epic in scale and the cinematography is excellent, though some of the CGI is distracting, and the inclusion of certain comedic elements throws the tone and tension out of kilter, which is jarring on occasion. Harrelson is excellent, if decidedly disturbing, and the portrayal of complex themes lends pathos to the story. An enjoyable film that will satisfy fans of the franchise. 8.02/10"}, {"rating": "10", "text": "RU:Фильм отличный, но для тех, кто не видел прошлых частей, он будет местами скучным(мой друг уснул, стыдно за него :c)ENG: The film is excellent, but for those who have not seen the past parts, it will be boring in places (my friend fell asleep, ashamed of him :c)"}, {"rating": "9", "text": "Oscar winner right there. If u haven't seen this movie yet just go see it now. Avoid internet for spoiler and go see it RIGHT NOW. Heart broken story , amazing VFX, Incredible acting performing . Academy award should consider best motion capture award for Andy Serkis , this man make me cry. Prepare for tissue guys/girls you gonna need this"}, {"rating": "9", "text": "Great movie. What a great way to end the series. The movie was extremely intense and once again Andy Serkis does a phenomenal job as Caesar. But Bad Ape is the one who steals every scene he's in. His comedic presence was needed in a very dark and dramatic movie. The action was superb and fun. The movie starts on a high note and never lets go. I think this movie did too the previous one as a story and drama movie. I really liked that they focused more on the Apes this time because that's what they needed to do. It seems like Matt Reeves took every negative from Dawn even though there were many and improved upon all of them."}, {"rating": "10", "text": "War for the Planet of the Apes caps off what is arguably one of the most surprising and best blockbuster trilogies in recent memory. Unlike many trilogies though this third film actually comes out as the best in my opinion. The film features an oscar worthy performance by Andy Serkis as the ape protagonist Caesar, great characters (new and old), a powerful message, engaging action, stunning directing, a beautiful soundtrack, and inarguably the best CG effects and motion capture in a film to date. My only nitpick is a somewhat slow second act in comparison to the great first and third acts. Overall, War for the Planet of the Apes is arguably the best movie of the summer, best of the Planet of the Apes movies, and even the best of the year so far."}, {"rating": "7", "text": "I am so blown-away by this series. I get so into it, like \"Yes, apes - crush the humans!!\" Andy Serkis is like one of my favorite actors. I never think they'll be able to come up with a new one that's as good as the first, but they keep doing it."}, {"rating": "8", "text": "An undoubtedly strong and epic conclusion to the current 'Apes' trilogy. The effects are as impressive and engaging as ever, the story is gripping and has plenty of heart and emotion, which many of us have come to expect from this trilogy, and the acting from both human and ape is stellar, with Andy Serkis delivering outstanding work as usual as Caesar. Woody Harrelson is also notable in his villainous turn. Overall, it's undoubtedly exciting, full of heart, and concludes things rather satisfyingly, but by the end, I still found myself preferring the middle chapter (Dawn) slightly more. Nonetheless, this film is right behind that one in my opinion and I couldn't have asked for a stronger or more satisfying conclusion to this solid and memorable trilogy!"}, {"rating": "10", "text": "an excellent movie worth the money to watch. The entire movie was entertained I really recommend it for those who haven't watch it yet, you won't regret it :)"}, {"rating": "10", "text": "War of the planet of the apes has enraged the relationship between the Apes and the Humans, but with Caesar not wanting a war, he struggles to control his anger of the humans. This is a very intense, dramatic and surprisingly emotionally drawing movie that gives fans the conclusion to the rebooted franchise a fantastic but emotional send off."}, {"rating": "8", "text": "This movie was astounding. From the story to the visual effects to the characters to the fight sequences to Andy Serkis performance this is where it's at and in my opinion the second best movie  of the just behind Spider man homecoming which could possibly be my favorite movie. I saw this a month ago or maybe longer but it just blew my mind."}, {"rating": "9", "text": "If you want to see in this film, mountains of meat, a large-scale battle scenes between humans and monkeys — they are in the film. This film is not about war, it's about revenge, about survival. The first part of the rebooted franchise came out wonderful, the second turned into a movie about war and has lost a lot in the story and the characters. The third part of the work done on the bugs. It's not a massive blockbuster about the war, but rather a drama. This is not a mindless summer movie, there is a very strong story. Revenge, survival, family, decisions — that's what the movie's about. Caesar for the third time beautifully played by Andy Serkis. Nowadays technology has reached the point that we can see the smallest emotions on the faces of the computer model, and Andy Serkis is laid out! You believe him, sorry and worried about him. We watched Caesar from infancy, his character developed before our eyes. Therefore, in order to better emotionally to feel the movie you need to watch the previous two. The finale for this character, the most correct that could be. Other monkeys, too, you remember, and worry about, it would seem that computer models, like the real people. There are no unnecessary characters, unlike the second part, and each is remembered. Antagonist of Caesar was played by equally talented Woody Harrelson. For the trailers, I thought it would be flat evil villain, and Woody Harrelson is here so he pressed his charisma. But all went not so. Yes, he is charismatic and looks cool, but he can play, his character is not so simple, and it will be a strong scene. This film is surprising. To view it you think you know everything beforehand, that's just typical opposition of brave Americans, only now against the monkeys, not the Russians or other enemies. I think that there will not be strong characters, and the whole film will occupy the shooting and explosions. But it's not. It's a smart movie, touching. In the plot, \"War for the Planet of the Apes\" and gives us plot twists. You don't know what will happen next, I don't know what the outcome of this story. While similar, predictable movies it's really worth it. The film is amazing. It is beautiful, and you can't see where the graphics are, and where nature. But Director Matt Reeves has shown his talent. If the Director can make you cry an over drawn by monkeys, he has the talent. The few, the chamber of the battle scenes is also shot nice. But the film is not about that. There is no war here, here the confrontation of two charismatic representatives of the two types. Each of them wants to survive, and empathize with both man and the apes. Because both those and others there is a strong motivation. \"War for the Planet of the Apes\" is for me the movie was a surprise. I got more than expected and it is wonderful! This film carries the thought. It's not just a pretty shell, it is filling and tasty."}, {"rating": "10", "text": "War for the Planet of the Apes is one of those chapters that digs deep into your own soul and never quite leaves. This is most definitely one of the best movies of the year."}, {"rating": "10", "text": "After a solid first movie, and an excellent sequel, this trilogy reboot of The Planet of the Apes ends on an incredibly strong note, with hands down the best movie in the trilogy.Great visuals, outstanding acting and story, a really good score... This 3rd iteration is poignant, breathtaking, and concludes the reboot in the best way possible.A must see for Sci Fi fans, The Planet of the Apes fans, and anyone looking for thrills without compromising quality this summer.Incredible movie"}, {"rating": "10", "text": "Movie of the year so far!  I didn't think it was possible for each movie in the trilogy to be better than the last, but I was wrong.  It was greatly written from the script to the plot.  I actually cared about all of the main characters.  This movie takes you on an emotional roller coaster with great action sequences to cap it off!"}, {"rating": "9", "text": "An amazing finisher to a already great trilogy. This gives us hope for the future of matt reeves career. It can easily be said that Matt Reeves is approaching the high stakes club in where directors such as Steven Spielberg, James Cameron, Edgar Wright and Christopher Nolan stand in. Matt Reeves is probably one of the greatest directors in cinema history."}, {"rating": "10", "text": "Incredible movie worth every penny. For a $150 million dollar movie i would say it's the best movie I've seen at the theaters this year. While i didn't agree with the ending i still think its a beautiful film, the SGI is amazing and the movie is long but its worth it to get a real feel of the story to enjoy it. I gave this movie 5-stars because its really a movie of Hollywood's best, these are the kind of films we need more of, real story telling."}, {"rating": "10", "text": "My personal favorite of the Planet of the Apes reboot trilogy. There is a character development is done well, and of course, there is plenty of action and suspense. The film does a good job of ending the trilogy and having a lot of links to the original Planet of the Apes film. Overall one of my favorite films of the year so far."}, {"rating": "8", "text": "War of the planet of the Apes was a great conclusion to this Ape trilogy, and a must see for fans of the series. The heart and dedication to detail that went into the motion capture of the apes, is the best cinema has to offer.  This is partly due to the amazing performance given by Andy Serkis as the main protagonist Caesar and the rest of the ape cast.  When I first watched the prequel film back in 2011, I was a little biased as I wasn’t a fan of the Tim Burton remake that came prior to its release.  I am so glad I took a chance on this reimaging of the series, as I was shocked at the depth of these films.  Matt Reeves and writers took a series that can come across as extremely campy, and turned it into a modern day epic.  The story of Caesar and his apes is one of the most compelling trilogies I have ever watched. I highly recommend watching this trilogy in its entirety as the weight of some early consequences echo through to the later films."}, {"rating": "10", "text": "Incredible. Heart-wrenching, ominous as well as light-hearted all at once, it certainly has its moments. Definitely a must-watch. The music is also very well composed, and very fitting to the movie. Well done!"}, {"rating": "8", "text": "A fitting and altogether satisfying conclusion to the new Apes trilogy and the most complete and thematically satisfying one yet. Harrelson is a pure nutjob villain but he at least starts to hint at the some of the broader questions the characters in this universe should be asking more of - namely what does this do to the evolutionary ladder/food chain and what exactly does it mean for God and souls? (this still gets short shrift, probably to avoid alienating audiences). He sees himself as a messiah delivering the human race from a scourge of its own making - he doesn't seem to hate the apes so much as understand objectively what they mean for the human race. He's more complex this way.There are some homages to the original Planet here too - the little girl is named Nova and the flu has mutated causing humans to become less intelligent (this is not what is meant in the original film but sure - it does can explain why humans don't fight back and can't read). Some of the final scenes are a little too on the nose and ham-handed. Caesar as the real messiah leading his people to the promised land. The gorilla that finally turns good at the end (this scene could have worked but is dumb in execution - Caesar almost dies anyway). The apes survive an avalanche because they climb trees - this is what is meant by an evolutionary advantage apparently. Between that, the mutated flu and the old version of it, this explains how the Planet becomes one of Apes. It works but feels a bit over-engineered.I really appreciate how this trilogy of Apes films is a character and theme based work first. These films use state of the art CGI in order to create more believable characters and tell a tale not possible any other way (I mean, yeah makeup, which I do miss, but still for the new films this is what works). There aren't many overblown action scenes that dominate and wear down the film. This is what franchise big budget moviemaking should look like."}, {"rating": "8", "text": "After the pretty forgettable Tim Burton version this latest Rupert Wyatt/Matt Reeeves directed trilogy has revitalised the franchise, and War is a fitting conclusion. The CGI is absolutely astonishing, and has improved greatly in the six years since the original. Of course this helps make the action sequences look all the more realistic but it also allows the actors playing the motion captured roles to give real performances, and Andy Serkis in particular deserves to win an Oscar for his performance as Caesar."}, {"rating": "8", "text": "Best movie in the trilogy. It's quite rare to have a trilogy where the last part isn't the least likable or the one they shouldn't really have made. If you liked the other two episodes, then you're really going to love this one. Very watchable move. I'd go with an 8.5 if I could, but since that's not an option it's getting a rare enough 9."}], "recommendations": ["rise_of_the_planet_of_the_apes", "gladiator", "star_wars_episode_iii_revenge_of_the_sith", "master_and_commander_the_far_side_of_the_world", "braveheart", "x_men_days_of_future_past", "man_of_steel", "blade_runner_2049", "alita_battle_angel", "black_widow", "the_lord_of_the_rings_the_two_towers", "doctor_strange", "eternals", "terminator_2_judgment_day", "how_to_train_your_dragon_2", "fantastic_beasts_the_crimes_of_grindelwald", "the_bfg", "avengers_age_of_ultron", "conan_the_barbarian", "top_gun_maverick", "maleficent_mistress_of_evil", "troy", "spider_man_into_the_spider_verse", "the_hunger_games_catching_fire", "the_lord_of_the_rings_the_fellowship_of_the_ring"]}