{"id": 2260, "title": "War Room", "starring": ["Karen Abercrombie", "Priscilla C. Shirer"], "runtime": 120, "genre": ["Drama", "Romance"], "description": "The family-friendly movie explores the transformational role prayer plays in the lives of the Jordan family. Tony and Elizabeth Jordan, a middle-class couple who seemingly have it all – great jobs, a beautiful daughter, their dream home. But appearances can be deceiving. In reality, the Jordan’s marriage has become a war zone and their daughter is collateral damage. With the help of Miss Clara, an older, wiser woman, Elizabeth discovers she can start fighting for her family instead of against them. Through a newly energized faith, Elizabeth and Tony’s real enemy doesn’t have a prayer.", "releaseYear": "2015", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/unxQeVUi5DH01r7ZNvAHwpvX7UK.jpg", "categories": {"plot": 7.0, "acting": 7.631578947368421, "ending": 1.5, "soundtrack": 5.0, "cinematography": 10.0, "familyFriendly": 6.666666666666667, "funny": 8.0, "action": 8.0}, "reviews": [{"rating": "10", "text": "Outstanding movie! Great script! I and three of my kids (10, 12, 16) all loved it.  Laughs and tears! Yes, I am Christian. This movie has a message for all though. The movie is not preachy. Very impactful! Ranks among best movies I have ever seen. Will be seeing it again today. Do check this out!"}, {"rating": "10", "text": "War Room was a fantastic and well developed Christian movie. With one purpose in mind, the creators of War Room aim to instill the power of prayer into every Christian's walk with Jesus. While many believers and non-believers alike may not understand the effectiveness of prayer, War Room provides an entertaining practical approach to it. This emotionally captivating movie creativity shows the complete sinful nature of man without the typical extreme violence and sexual innuendos normally seen in the movie entertainment of today. I would highly recommend this movie to everyone."}, {"rating": "10", "text": "The Kendrick brothers are the revolutionaries of a genre that many hate. Telling the truth is controversial, and even more so in film. War Room takes a lot of risks to venture into that territory...and it pays of."}, {"rating": "9", "text": "The Kendrick brothers send up another good movie that is both encouraging and engaging. Some reviewers have discounted the idea that prayer can be your best weapon in a bad marriage but Stallings, Shirer, and Abercrombie prove them false.  Great performances by all 3.  They take a good script and make it into a wonderful story - should be seen by all!"}, {"rating": "10", "text": "Faith based movies are without question maturing and getting more professional, and gladly it's happening without loosing the focus on the message. War room is the most realistic portrait of a family that works on their own \"weapons\" to survive and the usual outcome of it;, and goes on showing what can happen when God is allowed in the  picture.  Everyone practically gets the chance to evaluate their own personal relationship with God in light of facts not concepts. No preaching necessary."}, {"rating": "10", "text": "Just saw this movie and it was awesome. The theater was a sell out and broke into applause at the end....wow! This movie is well written and extremely will acted. The woman who plays the prayer warrior is simply amazing and moving. Our 12 year old daughter loved the movie and so did we! I highly recommend ignoring the negative comments and go and judge for yourself...you will not be disappointed. It has been a long time since I sat in a packed theater and listened to cheering as well as watching so many emotionally moved people. The message is incredibly inspiring and uplifting and rings true."}, {"rating": "10", "text": "Knocked My Socks Off!\rI have seen a slew of \"Christian\" genre-based movies, and I confess, I have been quite critical of them. Cheesy-lines, unbelievable plot, low-quality camera-work (director issues usually). I've always thought that the actors themselves did a fine job with what they had to work. My issues have always stemmed from the screenwriting and directing faux pas'.\r That said, I did not go into this with high expectations. I went in expecting the quality of prior \"Christian\" movies. Kind of like I do when I watch a movie based from a book. I don't expect it to be exactly like the book, so therefore, I'm not the critic who will complain that it not the book.\r This blew me away!\r Acting: So good you don't feel like you're watching actors, if you know what I mean. And that is good!\rScript Dialogue: Lines are not cheese-filled, but true to characters and the dialog feels genuine and like the words you would hear actual people speak... not just cheesy cliche's. If there are cliche's, they are only there because they are the ones that we actually use in \"real life.\" And let me tell you, as a continuous student of language and linguistics, people use cliche's and tired figurative language or euphemisms more often than they think they do!\r Plot: It moves along at a wonderful pace and in a logical way. You do not feel as if you wish they'd \"get to the point already;\" or as if, they \"rushed that scene\" and so therefore, it doesn't work for audiences. In fact, although I am known for always looking for a slow spot to \"exit to the ladies room\" because of my large-diet-Dr. Pepper-movie-going-tradition, I was so engrossed in this film that I didn't even notice that I REALLY had to go until it was all over!\r Camera work/directing: One of my peeves, tell-tal signs of a low-budget movie for me, is camera angle, lack of close-ups or scenes being filmed from just one angle. This movie does NOT have those. I did have trouble at first with the (only my personal opinion) too-many closeups; but I was soon (within just a couple of minutes) so engrossed in the story and the characters that I forgot about that tiny flaw. This particular issue is something that I have noticed in other blockbusters. I guess what I'm trying to say, is that as you watch it, you do not \"feel\" as if you are watching a \"low-budget\" film at all! And that, if it actually IS made with a low-budget as this was, is AMAZING! For that to happen, the directors, actors, and all involved, HAVE to be uber-talented.\r Yes, this is written with a lean toward a certain audience. But, when I read reviews that say that, all I can think is, \"And your point?!\"\rYou see, every book, film, or written article is written with a particular audience in mind. You learn that in third-grade language arts! So, in order to review a film objectively and without bias (which is actually humanly impossible even if you use a rubric as I did) you have to review the film itself and not the message with which you may or may not agree .\r Bottom line: It is a really good family movie, convicting at times, yet encouraging, challenging and thought-provoking. You will laugh, cheer, cry, be angry, then laugh and cheer again."}, {"rating": "0", "text": "I'm a Christian. There's nothing wrong with faith or prayer at all. But when a movie's answer to domestic abuse is prayer instead of counseling or a divorce, then that's stupid and offensive. God and Jesus aren't genies. In the same way if you got robbed or stabbed you would go to the police or a hospital, you can absolutely turn to God if you're being abused, but also you DEFINITELY should call the police, or get counseling, or get a divorce if all else fails because some people are a**holes and can't be changed and you shouldn't have to suffer because of them. This movie paints a woman trapped in an abusive marriage as the bad guy and that's incredibly insulting."}, {"rating": "10", "text": "This was one of the best movies I've seen in a very long time.  It was uplifting.  I was glad to see so many men in the audience cheering!  Grab your family and don't miss this one."}, {"rating": "10", "text": "Inspiring movie that will give many hope for their relationships, marriages, and families.  Watching this movie will give people the tools they need to handle a few of life's difficulties.  Acting was on par, but it's more the message that will have a lasting impression on people.  I recommend it."}, {"rating": "9", "text": "As you can see from previous user reviews, the score seems to be divided drastically. Those that have a faith-based background will rate it highly, while those that don't want a \"Church\" lesson or a sermon will give it a flat zero. War Room is very well done, and has fantastic acting. Yes, it's preachy. Yes, it may appeal more to Church-goers. However, as a movie unto itself, it's much better than these critic and user scores suggest. It's a great story with plenty of laughs and touching moments that I'm sure many of us have experienced no matter what you believe. Put aside the political rhetoric of some if these reviews and give it a shot."}, {"rating": "8", "text": "Enjoyed movie. Message of trust in God, unconditional love and forgiveness was refreshing to hear and see. It particularly spoke to those of us who claim to be Christian but often lack faith."}, {"rating": "2", "text": "The problem with War Room, it is so cheesy and just can't pick up. The whole 2 hours you are waiting for it to start picking up, and in the end it never does."}, {"rating": "9", "text": "A positive film that took a difficult family situation that we see the pains of all across this land and offered a way out. With a powerful message of loving on the people that we say mean so much to us, we see how to grow stronger together and not to be torn apart.\rWhile we have seen movie after movie from Hollywood of characters that start well and then spiral downwards into destruction, it is so very refreshing to watch a movie about family on the brink of failure find unity, hope and love for one another.\rThis movie has a voice that is pulling people up, not pushing them down. Great watch, hope you get the chance to see it! =)"}, {"rating": "0", "text": "Fitting that the very system so often derided by the Christian right (Hollywood) is now being used by those very people to prosthelytize and peddle their hilariously vapid moralizing.  Fitting, because filmmaking in and of itself is a creation, a fabrication - relying on written contrivance and a necessary suspension of disbelief, not unlike religion, which requires even more of a \"leap of faith.\"  Make no mistake, faith is literally defined as \"belief without evidence,\" so what better venue than a movie theater to peddle such absurdities?  The problem here is that religion also lacks creativity (to be creative one must also embrace free thinking, which religion rejects) and this film is likewise utterly and pathetically devoid of anything resembling a creative work of art.  Watch Bunuel's \"Viridiana\" or \"The Milky Way\"... watch any of Bergman's chamber dramas - \"Seventh Seal,\" \"Through a Glass Darkly\"... watch Bresson's \"Diary of a Country Priest\" and witness the opposite of what this insipid Christian Hallmark card of a film attempts to put forth.  These are great films that offer thought-provoking, artistic ruminations on belief and faith and the challenge of living in a world that does not have easy answers that can be cured with such intellectually lazy devices such as prayer and faith.  This ridiculous film caters to hate mongers like Kim Davis, who have the same narrow view of the world that the makers of this film embrace with such blinding zeal.  Avoid this film at all costs - it's simply an advertisement to belief without the \"inconvenience\" of thinking."}, {"rating": "0", "text": "I almost commited suicide after watching this movie,one of the worst movie i have ever seen.I still cry from time to time after watching this Christian propaganda trash."}, {"rating": "7", "text": "The Kendrick's are back with another christian drama. The scenario is believable and delivers an effective message about how faith in God will help you through the hardest of times. While this is sure to be a huge hit with Christian audiences it's popularity with non-believers is much less certain. Those who actively have something against religion of any form need not apply.\r While believable, the struggling marriage angle has been played many times before. The catch here is the religious angle. If you've watched the Kendrick's \"Fireproof\" they retread a lot of the same material here. That isn't necessarily a bad thing though. It's just very predictable.\r At times my mind would wander for the slower bits just because I knew where those scenes were headed. It's an effective way to get the message across, but one that feels simplistic and easy. Even the characters themselves are stereotypes we've seen time and time again. However the actors portraying them do a great job with the material. They feel natural and real in their roles. It allows for the film's cheesier moments to go down easier.\r To help break up the drama the movie has some nice bits of humor interspersed throughout. It's a nice touch and allows the film to have a little bit of everything. Humor, heart, and a good message are all present, but the less than stellar execution and presentation of morals that feels more like a lesson plan than a realistic movie are likely to make this a turn off for most non-believers. It's got so much pandering and stereotypes on display it's almost as if Tyler Perry made a faith-based movie.\r If you've got the faith of God in you then it's definitely a movie you'll enjoy. If not, then unless you have an open mind this is one you are better off avoiding. It won't change your mind and you are going to be less likely to put up with it's flaws.\r As far as I'm concerned though it's a solid movie. One with issues, but a sweet, harmless message that appeals to the believer in me. I enjoyed it even if it's not something I can rave about. I would most definitely recommend it to my fellow christians and the more tolerant of non-believers."}, {"rating": "8", "text": "Instead of coming out of the closet, War Room tells you to don't come out until you make things right with yourself and leave all of your life baggage and junk inside. The Kendrick bos. are masters at connecting with spiritual audiences on a emotional and inspirational level. Not only do they make entertaining Christian films, they also give you strategies and weapons to fight your battles. Up there with Facing The Giants and Fireproof. It's good that they don't rush films to be made just for Hollywood."}, {"rating": "8", "text": "Pretty solid that the Kendrick brothers has made. This is one the movies that is made for Christians. People who hated this, are non-Christians. Though it may not pleased for every Christians, but it is worth checking out."}, {"rating": "5", "text": "I get that Christian movies are meant to inspire and change people, but it at least needs original stories. I have seen a lot Christian movies and I have seen the same thing. I'm not saying this movie is bad, it actually included a message to remember and it's something to watch as a family. I'm just saying that it's time to gather good actors and get original stories. If you're looking for a great story with amazing performances. Watch 'Woodlawn' and than watch this. You'll see the difference."}, {"rating": "4", "text": "\" War Room \" was a very moving film, and very faithful to Christianity , many tears left , shown great joy , and the Christian themes of the prayer room , is very ideal for Christians to pray or their families , but the disapproval of criticism was that it was boring , so disapproved the movie , but hey , criticism are not faithful to God but do not try to be so ordinary."}, {"rating": "10", "text": "Outstanding movie! Ignore the professional critics who probably despise the fact that movies are now being made for Christians, as if we have no right to see them. Ignore also the reviewers who rated it low because it contained prayer and other religious content, as if they didn't know that beforehand. I'm guessing that they are just pretending that they saw it."}, {"rating": "10", "text": "Awesome!  My wife and I went yesterday and it was like coming away from an anointed sermon.\rThe older lady really adds life to the whole movie!\rIf you have a chance to see it, do it!"}, {"rating": "4", "text": "So critics say that Fantastic Four (2015 reboot) is better than this? Or they even say my latest low score is better than this? No... even... way. Those two are so bad they don't deserve respect; however, this does and I'm about to give it a chance."}, {"rating": "10", "text": "This movie should be watched by all couples. War Room is very inspiring to say the least. Marriages will be blessed by watching. It didn't feel like an \"A\" movie in regards to acting or production (B maybe A-)... but when it comes to content it gets an \"A+\" ...tears we're flowing in the seats. When people left the theatre they were talking. This movie reveals very important relationship understandings... it was a gift to watch. I highly recommend it."}, {"rating": "6", "text": "This is a Christian Evangelical movie. If you don't like being preached to/at, you won't enjoy this at all.\r Most Christian movies make me want to puke, despite me being an active Catholic. They're insipid, the characters mere cardboard cutouts to promote the JEEEZHUS!! message and the plot is always entirely predictable.\r This movie was a step up from the usual Bible Thumper movie. Whilst it has no surprises, and carries the usual tropes of dysfunctional family with Nagging Wife, Nasty Husband, and Sad Child, who all find God via a Caring Christian and Live Happily Ever After, it wasn't so sickening sweet as to become unpalatable, and the characters weren't so wooden and one dimensional as to be completely unbelievable. If nothing else, it did make me think about my own marriage and how much time I spend building it up rather than harboring negative thoughts.\r Certainly not a \"great\" movie, but as overtly Christian and actively Evangelical movies go, this is one is a good one. Lots of nice feels, some light comedy and some tear jerking moments. I found it pleasant enough to watch. Not a bad one for a church movie night, but I wouldn't bring my secular friends to see with with me, it is still too heavy of the Evangelical message for non-Christians to enjoy."}, {"rating": "9", "text": "This film is very powerful, especially meaningful to Christian viewers. If we submit our will to God's Will, amazing things happen. Submitting to God and/or your partner, putting yourself second, is incredibly difficult. I think the film captures the human struggle perfectly. The old lady, Miss Clara, plays a great role as a wild old crazy with a handle on Faith. A challenge to each of us. I loved it. Thanks, Kendrick Brothers!"}, {"rating": "7", "text": "-War Room is a 2015 American Christian drama film directed by Alex Kendrick and co-written and produced by Stephen Kendrick. War Room is the Kendrick brothers' fifth film project and their first film project through Kendrick Brothers Productions. Provident Films, Affirm Films and TriStar Pictures partnered with the Kendrick brothers to release the film.\r -Regarding the title of the film, director Kendrick says \"We called it 'War Room' because, like the military, we should seek God for the right strategy before going into combat. By combat, I mean daily issues we face in our culture.\" The film was released in North American theaters on August 28, 2015, and received generally negative reviews from critics, but became a box office success and a sleeper hit. Regarding War Room's box office performance, CNN said \"some might call it a faith-based David versus the secular Goliaths in the entertainment industry\".\r --African-American portrayal:\r -Initial plans had the main characters being white; however, Alex began having dreams about a predominantly African-American cast and, believing that God was trying to tell him something, the brothers switched the characters to make it more in line with Alex's dream. Early on, Sony expressed some concerns over a film with a mostly African-American cast produced by a white-led production company, but the brothers stuck to the premise.\r -Several characters in the film are African-American and being released only months after the Charleston church shooting, those involved with the film claim to believe that the timing of release is no coincidence. According to director Kendrick, when Affirm Films first saw the film, they claimed, \"If this had been told with a different race, it would be a different movie.\"\r -Stallings, who plays a major role in the film, says, \"There are many people out there—white and black—who stay with their families and work through their problems. They aren’t thugs or gang leaders. ’War Room’ tells the truth about society by showing the reverse of that stereotype. Racial tension is dangerous and people are dying and a lot of us want to see that stopped. We protest and speak out and tweet out, but this problem is much bigger than human beings. This movie will give people a way to take these problems to the Lord and show them that prayer is the best weapon to fight back.\"\r --Critical response:\r -War Room has received mostly negative reviews from critics. Rotten Tomatoes gives the film a rating of 34%, based on reviews from 32 critics, with an average rating of 4.4/10.Metacritic gives the film a score of 26 out of 100, based on reviews from 11 critics, indicating \"generally unfavorable reviews\".\r -The Christian Post praised the film, calling it better than Courageous and Fireproof. According to Crosswalk.com \"it comes as good news that War Room is a step up for the Kendricks, who continue to develop as filmmakers.\" Nick Olszyk of Catholic World Report similarly praised the film, writing it successfully portrayed \"prayer... forgiveness, temptation, conversion, and, most importantly, the cosmic struggle between God and the devil that occur in every home and every heart.\"\r -The Los Angeles Times called the film more of a Bible study than anything else and \"so heavy on broad pulpit pounding that it’s challenging to get swept away by the story’s message.\""}, {"rating": "0", "text": "So, the moral of War Room is if your husband is abusive, then it's YOUR fault, and you need to pray to God for him to forgive YOU and let him do all of the work instead of getting counselling or if all else fails, a divorce.That's a disgusting, sexist message."}, {"rating": "1", "text": "At least it's not as bad as Gods Not Dead. That's about the only compliment I can give it."}, {"rating": "1", "text": "There is a story I remember, a man is drowning in the Ocean, so he prays for salvation. A boat comes by and offers him safety. But he turns them away saying God willSave me. This process repeats it self 3 times it's 3 times in the end the man drowns. When he sees God in heaven he asks why Gpd didn't save him. God said I sent you 3 boats what more could you want? Now imagine a movie that's moral is pray like that man in the ocean while not working towards  safety. That is War Room"}, {"rating": "10", "text": "War Room is an emotionally driven and inspirational film for all ages that keeps a family from splitting apart."}, {"rating": "10", "text": "This is SUCH A GREAT MOVIE literally from start to finish!! This is a must see! If you are struggling in your marriage, job, family, relationships watch this movie. Your life will he changed forever."}, {"rating": "6", "text": "A sweet, charming, faith-based drama that is quite enjoyable for Christian audiences, though it definitely falls into the problems a lot of Christian movies do:  It has a cliched script, rather predictable plot, but a lot of it is redeemed with strong acting."}], "recommendations": ["overcomer", "courageous", "the_shack", "son_of_god", "heaven_is_for_real", "the_case_for_christ", "i_still_believe", "facing_the_giants", "united_93", "the_lobster", "crash", "risen", "machine_gun_preacher", "the_hate_u_give", "let_there_be_light", "babel", "i_can_only_imagine", "antebellum", "mother", "noah", "the_passion_of_the_christ", "zero_dark_thirty", "silence", "chappie", "exodus_gods_and_kings"]}