{"id": 2002, "title": "War Dogs", "starring": ["Miles Teller", "Jonah Hill"], "runtime": 114, "genre": ["Comedy", "Crime", "Drama"], "description": "Based on the true story of two young men, David Packouz and Efraim Diveroli, who won a $300 million contract from the Pentagon to arm America's allies in Afghanistan.", "releaseYear": "2016", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/uH9qGH5XS1iZXCSb3tgu40dxQoh.jpg", "categories": {"plot": 6.46, "acting": 6.444444444444445, "ending": 6.142857142857143, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.595744680851064, "action": 6.909090909090909}, "reviews": [{"rating": "10", "text": "Screw those who are giving this negative ratings - if you aren't a dried up, soulless pessimist this movie has something to offer you.\r Lets start with what  we were all nervous for, Jonah Hill - my god, does he nail this role. Humor, intelligence, and cunning all rolled into one. He drives this movie and gives every viewer something different. I took my partner, and she also enjoyed the movie, especially his performance.\r This is a rags to riches 'true story' with some humor intertwined and Jonah Hills signature 'laugh' saw me laughing aloud multiple times.\r I don't want  to post spoilers, and I don't want to ruin your experience - hell that is what movies are for, watching  and making your own informed decision. Just don't let some of these bad reviews deter you."}, {"rating": "8", "text": "Fantastic movie which once again shows us how out of touch Hollywood critics are with film goers alike."}, {"rating": "10", "text": "One of the best crime thrillers in years. The movie also has comedy, stylish editing & a strong moral message."}, {"rating": "4", "text": "Witness the bromance of the year. Miles Teller and his bro Jonah Hill go on a broventure and do lots of bro things together cause they're bros. A scrappily told story with lots and lots of narration from Miles Teller broken up by Jonah Hill doing the most annoying laugh you'll ever hear. Believe it or not this is a true story so it should have been better. There is a good movie somewhere about gun running, unfortunately this isn't it. A lukewarm recommendation."}, {"rating": "5", "text": "Well what can you say about War Dogs...This movies is like the thin air , it has no real purpose .\r This movie is a real lackluster in many departments .\r So first-up the humor , this movie has so few scenes you can laugh at and the rest are small chuckles. It's the tipical humor that a 12 year old kid would think its funny . So overall it really doesn't win much in the humor department and any Seth MacFarlane blows it out from the water .\r The story is very much interesting , the story of two gunrunners is not bad at all . The story unfolds in a decent way , and it has it's fair share of plot twist . The actors were okay , nothing groundbreaking but certainly not bad .\r But this movie has certainly scummyness involved , because at the start of a movie it gives you the impression of a very carefully thought out film , that will have a lot of interesting things in it , and that is A HUGE LIE . This movie's ending is absolutely and midblowingly ass . \"But why ?\" you may be asking , because despite it being based on a real story it has zero verdict .\r The verdict can be interpreted as : Don't be a lowballer , don't be a scammer , don't be a dumb fat sack of sh*t like Efraim Diveroli . So the verdict is practically non existant because , there is no need to tell ANYONE to not be a scammer because everybody knows that already , be that person a child or an adult.\r So my personal verdict :\r This movie is very much neutral , it can't be said that it's an absolute awful movie , but it is very far from a good movie . If you have something other that interests you , than choose it over this . if you just want a substitute movie , just so you can go to the cinema again , eat some popcorn and relax , then this movie is okay for a watch\r P.S most of the people who say this is a good movie have no idea what a good movie is."}, {"rating": "8", "text": "A very enjoyable movie. I wasn't expecting much when going in but it was good."}, {"rating": "10", "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●●°●°●°●°●°●°●°●°=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"}, {"rating": "10", "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》"}, {"rating": "10", "text": "Synopsis: Two friends in their early 20s (Jonah Hill and Miles Teller) living in Miami Beach during the Iraq War exploit a little-known government initiative that allows small businesses to bid on U.S. Military contracts. Starting small, they begin raking in big money and are living the high life. But the pair gets in over their heads when they land a 300 million dollar deal to arm the Afghan Military—a deal that puts them in business with some very shady people, not the least of which turns out to be the U.S. Government."}, {"rating": "9", "text": "I enjoy the movie very much. It is funny. The plot is really interesting. The filming style with narrator remind of fight club.\rI would recommend this movie.\rAnd I don't know and don't care why the 'professional' reviewers don't like it."}, {"rating": "8", "text": "Этот фильм по началу немного наскучивал, но после 20 минут просмотра я понял что я пошел на то кино, на которое шел!\rОтличный сюжет который затягивает не сразу.\rМного шуток, половина показана в трейлере, но есть и много других.\rАктерский состав порадовал меня с трейлера, хорошая игра хороших актеров.\rНе стоит идти на фильм если вы хотите посмотреть комедию, на фильм стоит идти ради отличнейшего сюжета!\rКино от создателей \"Мальчишник в вегасе 1,2,3\", этот фильм похож на мальчишник в вегасе, но мне он показался немного серьезней.\rМоя оценка 8 из 10."}, {"rating": "9", "text": "It was very entertaining. There's a lot of bro humor. Not something you would take the kids to, but definitely for teenagers 16 or older. Not something to take your date to."}, {"rating": "9", "text": "If you like Jonah Hill and Miles Teller than definitely check this one out. It has great performances and top notch humor. Todd Phillips knows when to write and give a good script, and in this occasion, it worked. Forget The Hangover Part III and give Todd Phillips a chance. Loved the chemistry and loved the humor this movie delivered."}, {"rating": "9", "text": "Miler Teller and an Oscar worthy Jonah Hill are both phenomenal in War Dogs. Taking inspiration from Martin Scorsese, Todd Phillips finds a near perfect balance between gut busting laughs and tension filled drama that had me hooked from start to finish. To simply put it, I could have watched it for another hour."}, {"rating": "6", "text": "The bro version of Whiskey Tango Foxtrot, War Dogs is an occasionally funny yet thoroughly entertaining work from director Todd Phillips. While it is entirely derivative of many other films and, more recently, tries to emulate the success and style of The Big Short, War Dogs is still entertaining in its own right. Jonah Hill and Miles Teller have good chemistry, while Hill in particular is terrific with his shady charisma. That said, the film never accomplishes its full \"let's reveal the crookedness behind the curtains\" schtick, nor is it as funny as it may thinks it is. Other than attempts at making blowjob jokes, War Dogs really has no other comedic tricks up Jonah Hill's fat sleeves, which is unfortunate. That said, it is well told, decently entertaining film even if it falls short of its lofty goals. Another problem were the intertitles that really seemed out of place and were sort of trying to break the film into \"chapters\" for no apparent reason. Overall, War Dogs was largely disappointing, even if it was entertaining and Hill's performance is worth the price of admission. It is a film that had the pieces to be great, but lacked the heart, soul, depth, and originality to do so."}, {"rating": "8", "text": "Good action comedy film, Miles Teller and Jonah Hill both give great performances, the plot is interesting and well put together, it is also well paced and funny at times."}, {"rating": "6", "text": "This is obviously Todd Phillips trying to make a Scorsese film, more specifically the Wolf of Wall Street, but he's no Scorsese. However, it's watchable and mildly entertaining and sadly that's a rare thing for summer cinema."}, {"rating": "6", "text": "War Dogs seems like a film with a ton of potential, because of the people involved in it, but lacks the spark to make it anything other than okay. The problem seems to be that the crew wanted to tell a true story and make the audience laugh but didn’t fully understand, given the source material, how to do that. War Dogs is intermittently funny, but relies too much on clichés, and fails to pack any kind of a punch. If you’re trying to figure out what kind of a movie this is, picture The Big Short with a slightly lesser known crew.\rWar Dogs did have a lot going for it, namely the talents of Miles Teller and Jonah Hill, as well as the direction of Todd Phillips (The Hangover Trilogy.) Above that the trailers for this film looked fairly funny, but note that almost all of the genuinely funny parts of the movie are contained in the trailer. That being said the film often tries to take a more dramatic approach, and fails to ever generate a hilarious moment. That being said both Miles Teller and Jonah Hill’s performances are great in this film.\rWhile Teller and Hill are great in this film it really feels too familiar, as if you’ve seen it before. That shouldn’t be the case with a film about two men in their twenties running guns in the Iraq War. That being said it ends up making it’s characters into cliches, and tells an overdone storyline about rags to riches idiots, and betrayal of best friends. It really is a shame because, as I mentioned before, this film could’ve been very original and interesting, but ends up being like most other films of today, more recycled than anything else.\rAbove that the film fails, at what it ultimately wants to do, which is pack a punch. It seems self evident watching it, that the director and writers wanted to expose a scary problem in America, and at the same time generate a few laughs. In that sense it’s a lot like The Big Short, however War Dogs fails to ever do what it strives to do. Where The Big Short was informational, funny, and in the end terrifyingly honest, War Dogs is not. This movie may have a moment or two, but seems to miss it’s intended mark on both ends, in that it’s not as funny as it’d like to be nor is it as damning.\rIn the end War Dogs feels like more of an average film, which is disappointing because it had the potential to do everything wanted to. If you expect a great comedy, it’s not really that, if you’re expecting a great look at true and terrifying events that led to two young immature men running guns for America, it’s not really that either. War Dogs is funny, well acted, and has a story to tell, but relies on cliches, stereotypes, and doesn’t offer very much thought provoking material. This is a good film if you want a few chuckles but it doesn’t supply a ton of laughs."}, {"rating": "6", "text": "War Dogs: Shia Lebeouf & Seth are 'Murican, **** Yeah!\r Now you're thinking **** this guy he can't even get the actors right! But only one of the points in that sentence is correct, **** me, but before you do Sir - I can't be the only one who thinks Miles Teller comes across as a sedated, slight more serial Killery version of the Transformers star?\r No, just me? Ok, moving on.\r War Dogs at its heart wants to be Scorsese film, unfortunately in doing so all Todd Phillips has managed to do is leave what should be a witty and well scene'd film with absolutely no ****ing identity. Which is a real shame because I am a fan of Todd Phillips. (Link to greatest comedy scene in the comment section)\r Luckily for us though this film has Johan Hill, who pulls his second best performance in his 3 performance career (Game: name them). The banter between Miles and Johan - at first - is top notch, bordering on Big Bad Willy & Martin Lawrence levels. However, like all used out porn stars the story starts to suffer with a - too slow - 'From Rags' - with a too quick - 'Too Riches' plotline.\r Don't get me wrong, again, like with all used out porn stars; theres still a good **** in it. It just felt like it could have been so much more.\r The fact that I have not mention Miles Teller is a Tell tale sign (lol, pun) of how forgettable his character is. Giving him the old \"Forgotten Child\" trope:\r \"Forgotten Child Trope: Wherein a character or characters are given a child as a way to deploy emotion depth at the expense of the realism of raising a child. Seen in such shows as EastEnders, Hollyoaks and Crimewatch.\"\r Truly a boring character, Miles is only given the chance to act when in Scene with Johan, which he does well.\r Overall: One of the best gun running film that is not as good as Nicolas Cage's Load of War, imagine that.\r A semi sloppy 4.8/7\r If you enjoyed this review (How could you not you sick ****s) then visit my page:\r ****"}, {"rating": "10", "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;;:;:;:;::;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"}, {"rating": "7", "text": "War Dogs soars with its incredible Jonah Hill performance, and entertains with its humor, intelligence, thought-provoking subject matter, and characters."}, {"rating": "10", "text": "::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::"}, {"rating": "7", "text": "Remember \"Whiskey Tango Foxtrot?\" It starred Tina Fey and the previews looked hilarious. This film has the same MO: the advance ads make it look like a rollicking comedy (after all, director Todd Phillips created the \"Hangover\" series), but the reality of the movie is much more somber. Jonah Hill and Miles Teller plays friends who end up as arms dealers to the US military. It starts out with some lighthearted fun (and Hill's arrogant asides), but as it progresses, the seriousness of their situation develops into a personal and political drama. As a result, this becomes an interesting true story about the foilables of our military system with a compelling performance by Teller."}, {"rating": "6", "text": "I know this is categorised as a comedy film but I wouldn't say its really a comedy per se. There are definitely some cringey moments and knowing its based on a true story made it more interesting, as its hard to believe that such a turn of events would really happen. The subject/thematic material is more than a little grim, so if it has any kind of comedy element to it then I'd say its quite dark comedy but its pretty watchable with some fast paced action and fight based scenes, so that made it a reasonable film to me. The characters aren't exactly greatly likeable - one of the two main characters appears to be more childish and frivolous than the other, although both of them are clearly naive.  I found Jonah Hills laugh annoying but that is maybe a bit too pedantic(?). I dont know, its a bit of a hyper film in a way but its alright. I don't think I can say much more than that. Oh and if you don't like strong swearing and sex references then this won't be for you but there isn't much in the way of strong bloody violence."}, {"rating": "3", "text": "Based a true story is fine with me. The fact that the movie had a very misleading trailer, I went in thinking it was going to be some sort of action packed bro comedy. I was very wrong, it was the most boring depiction of gun runners I've ever seen (even though they are \"arms dealers\"). Get ready to sit down and gnaw your arm off. The \"romance\" in the movie felt so forced and overall made me cringe."}, {"rating": "6", "text": "A subtle attempt at anti semitism.  Jews should be outraged by the portrayal of them as penny pinching  money loving and people screwing scumbags.  We all know Jews are model citizens who promote equality and help the destitute"}, {"rating": "6", "text": "A pretty good job at telling a story based on true events. Don't get me wrong, you can totally tell real things that actually happened were glossed over(where did they get the guns in the first place?), changed, or just left out to make for a more widely pleasing movie. At it's core though the tale is still interesting. Not too mention we get two fantastic performances from Jonah Hill and Miles Teller.In the end War Dogs ends up being a better drama than comedy. Quite frankly, it's nowhere near as funny as those trailers let on. Part of this has to do with subject matters serious nature. Mainly though, it's an issue of timing. It's simply off. The witty and quick lines the characters are given rarely hit that right note to make you laugh out loud. You'll still chuckle, but there are plenty of times where the jokes just fly by because you are too caught up in what's going on with the actual plot.The plot itself has a few stumbles of it's own. For starters, it's really hard to care about these two characters. They're just too big of scumbags to root for. They're occasionally dumb decisions don't help either. You're supposed to be able to possibly sympathize with Teller's character, but not even looks into his family life make that possible. So essentially we're just watching two not very likable people getting involved in some very interesting scenarios that aren't quite as funny as we hoped. Normally, that would be the death of a movie like this. However War Dogs just barely manages to get by thanks to the inherently compelling nature of the events it is based on. I, for one, found myself pushing past myself and increasingly getting more and more involved with the events. Fans of \"based on a true story\" movies can likely find their fix here.So in the end it's a disappointing, but passable movie. One that could have been executed better, but still proves to be watchable and usually entertaining thanks to the great, true source material. Overall it may leave you wanting more, but it won't leave you feeling like you totally wasted your time or anything.6.7/10"}, {"rating": "7", "text": "Though it may try a bit too blatantly to be like similar films that have preceded it (\"Lord Of War,\" \"Wolf Of Wall Street,\" \"The Big Short\"), Todd Phillips' \"War Dogs\" still manages to use its too-good-to-be-true narrative towards its ultimate advantage. The film is brash, infuriating, occasionally insane, and blissfully irreverent. And when coupled with the knowledge that all of this actually happened (for the most part), it makes the film that much more watchable in the end."}, {"rating": "8", "text": "War is like a business zone, anyone can start-up a business.Ten years ago a similar film was made with Nicolas Cage in the lead called 'Lord of War'. This was based on the two youngsters who got into arm dealing, but many events were fictionalised. War is a business and these two made lots of profit out of it. So it all begins when financially struggling David clueless about raising his unborn child. At a right time he meets his old friend Efraim and decides to partner with him to supply arms to the US army abroad in a small scale. But when they saw a big opportunity, they decided to give it a try. From the obstacles, they go the extra mile to achieve it. But not knowing how serious the consequences are, finally they step into a dangerous turf and from there, what follows is revealed in the remaining parts.This is really amazing film. Obviously a slow start, but like after 10-15 minutes later it gets better and better. For these actors, this is something big and they have done it excellently. Jonah Hill was simply unbelievable. Kind of good, as well as negative, totally unpredictable character. Mile Teller was superb, he narrated the story with the opening scene, gun pointed at him, the flashback begins. While the story keeps developing, it only gets crazy and crazier. Nearly two long was never been an issue, because of the good pace, as well as for the off beast storyline.Lately I have been seeing lots of Ana de Armas, quite a coincident to watch some many films of someone in a short time. Anyway, her role in this was small, but she was decent. From the director of 'Hangover' trilogy, I think one of his best films it is. If you like the American Dream themes like 'Pain & Gain' and 'Wolf of Wall Street' about making dollars in a fast way risking everything, you would enjoy it as well. Like those two, it was also a comedy, despite inspired by the real. One of the film posters imitates the 'Scareface', but there's a strong reason for that, so you should watch it. Definitely worth a watch, so I suggest it!8/10"}, {"rating": "7", "text": "Todd Philips' war comedy is a film that lacks some substance, but most of it is filled up by the brilliant performances of Jonah Hill, Miles Teller and Bradley Cooper. Those actors alone make this a worthwhile watch. The plot of the film is interesting and will drag you out like other war comedies this year, but it is all seen before and done better. Guys do illegal things, buy a lot of expensive sh*t, get into trouble, cue in bromance. I wish that the ensemble of such actors could have got a better, more fleshed out film than this. It still is fun though, will make you laugh and is enjoyable as a one time watch. I found no deep storytelling in War Dogs, but it was hella fun."}, {"rating": "6", "text": "The movie was enjoyable. Jonah Hill and Miles Teller had fantastic chemistry. The movie was very funny and it's almost mind blowing that all thus actually happened. Unfortunately you really don't get a connection to the characters though even though Jonah and Miles did great. Todd Phillips doesn't reach Hangover level but it sure beats the sequels."}, {"rating": "8", "text": "A surprising film that is compelling and well paced, which focuses on a true story that cuts to the heart of the American war economy in an engaging and occasionally funny manner. The performances are very good, with some more subtle offerings from the three main men than their previous attempts in recent memory. This was a polished, considered and enjoyable experience that far exceeded my expectations. 8.21/10"}, {"rating": "6", "text": "War Dogs may be the best in Jonah Hill's absolutely great performance and the movie may have a bit of sensibility and fun, but what I literally felt what War Dogs needed was a little more pizzazz. Questioning why it needed a little more pizzazz would be a huge confrontation and I will try my very best to not to go there."}, {"rating": "7", "text": "Deutsche Review - Kritik Der folgende Test ist in 5 Kategorien zusammengefasst. Diese 5 Kartegorien ergeben die Gesamtpunktzahl von 0 - 100 Punkten. Um einen passenden Userscore zu geben wird auf oder abgerundet. Bei 84 Punkten ergibt das einen User Score von 8. Bei 86 einen von Userscore von 9. Falls eine 85 kommt entscheide ich ob ich es eher positiv oder negativ nehme. Regeln verstanden? Dann sind hier meine Punkte. Mein persönlicher Score = 69/100 Mein User Score = 7/10"}, {"rating": "8", "text": "This movie was amazing and extremely funny and throughly entertaining the humour  was  fun and one of the best true story's ever told although it was sexual in many ways"}, {"rating": "6", "text": "Yet another spin of the greed is good / rags-to-riches American success story formula pioneered by Oliver Stone’s 1987 classic „Wall Street“, still heavily used by all the others.This is a true story about 20-something guys (Jonah Hill, Miles Teller) exploiting a little-known government initiative that allows small businesses to bid on U.S. Military contracts during the Iraq War. They begin raking in big money but soon get in over their heads. Also starring, Bradley Cooper, Ana de Armas, Kevin Pollak.This type of movies usually depend heavily on the coolness of the leading actors, and Hill + Teller surely is an exciting combo. Hill’s work is especially noteworthy, giving the staple comedy actor a chance to create an unusually multifaceted character, a sociopathic narcissistic dude.„War Dogs“ also has the typical weakness of this type of movie: underdeveloped final act. After taking their sweet time showing all about the humble beginning and rise to fame and fortune, the later events are shown in a hurry. Stuff happens because it has to happen, not because the story has evolved to this point naturally.Director Todd Phillips is known for moderately funny but not especially inventive mainstream comedies („Road Trip“, „Old School“, 2004’s „Starsky and Hutch“, „School for Scoundrels“, „The Hangover“ trilogy, „Due Date“). This is his first break from the mold, and surely a refreshing step in new direction.Like some of the best screen stories, \"War Dogs\" is not tied to a particular genre such as comedy or action or drama. It has a bit of everything which has always been one of the most attractive aspects of this type of rags to riches movies.By the way, the poster design is a parody of the iconic poster for mafia classic „Scarface“, which is referenced throughout the film; also, Hill was born in 1983 when „Scarface“ was released. I don’t know if it’s really important in some way.It's a solid way to spend nearly two hours, but there's a great number of movies of the same type already. Don't expect to remember it in the morning."}, {"rating": "6", "text": "La grande vie agitée de deux combinards qui se la jouent trafiquants d'armes pour le Pentagone ! à mi-chemin entre un certain réalisme et la franche comédie, War Dogs peine à trouver ses marques. En témoigne par exemple le rôle du gros qui cabotine comme un chien fou tandis que le petit jeune (qu'on avait vu dans l'excellent Whiplash) se révèle ici un peu juste au fil d'un scénario qui le fait passer pour un gentil petit gars, bien brave.Bien que le rythme reste satisfaisant, le film est tout de même un peu long tandis qu'un sujet aussi délicat (et assurément discutable) est traité un peu par dessus la jambe. L'impression globale n'en est pas moins assez plaisante bien qu'en retrait d'un Lord of War ou même un Blow. Un film qui aurait mérité davantage de profondeur mais qui reste cantonné au simple divertissement : il fait le boulot mais sans plus. A noter la présence regrettable du branque Bradley Cooper : heureusement, on ne le voit que très peu."}, {"rating": "7", "text": "Uma história contada com humor e tensão. Um elenco minimamente bom que consegue entregar o que lhe é pedido e uma direção operante; esse filme definitivamente não é incrível, mas no mínimo bom."}, {"rating": "6", "text": "The cast is great but there are too many unnecessary scenes that fail to add depth to certain characters."}, {"rating": "0", "text": "The babies who played Ella (Natalia Mantilla and Valentina Mantilla) were poorly raised and annoying in this movie. If you want to see a movie with unnecessarily annoying characters, then go on ahead. This isn’t even the best movie by a long shot. There are PLENTY other movies out there. I’ve HAD IT with annoying BABY GIRLS."}, {"rating": "5", "text": "Decent, serviceable movie, nothing great, not too bad, doesn't make you feel like you wasted your time, but does Bradley Cooper have to be in everything?!"}, {"rating": "7", "text": "Though flawed, War Dogs' dramatisation of its real story is engrossing, with quick pacing, humour that works and captivating performances of its two leads."}, {"rating": "8", "text": "If you liked Leo Di Caprio's Wolf of WallStreet then you will really like this one too I think as it is in a really similar style. Also it is based on real events and it has many fun moments. Ok, not as many as in Wolf of WallStreet and this one isn't as great as that one, but it is still really enjoyable and if you like Jonah Hill's work you will definitely like this one a lot."}, {"rating": "5", "text": "Apparently if you eat ramen before going to bed, you wake up with a swollen face. The movie was okay. It was reaching for something great, but didn't quite get it. I'm glad I watched it, otherwise my curiosity wouldn't have been sated. On the bright side, the ending could have been done much more poorly than we got."}, {"rating": "8", "text": "I was really surprised by this film. Judging by the trailers and the two leads, I was expecting a much more light-hearted comedy-drama, but War Dogs is actually an enthralling and at times intense film. Whilst it still has a good sense of humour, what really shines through in this film is the lead actors’ incredibly striking performances, director Todd Phillips’ ability to deliver such an unexpectedly dramatic atmosphere, as well as the absolutely fascinating story.So, the most important thing about this film is to go in not expecting a comedy. There are some good laughs here and there, but it’s very clear that War Dogs isn’t trying to be funny, rather a genuinely serious and interesting drama, only with interjections of humour to lighten the mood and provide some unnerving moments.Let’s start off with the two central performances from Miles Teller and Jonah Hill. For the whole film, we see the events unfold through the perspective of Teller’s character, a down-to-earth, new father who just wants to find a way to make ends meet for his family. Immensely likable and relatable, Teller is excellent from start to finish, and even when we begin to learn about some of his character’s less morally justifiable actions, he works brilliantly as the person to guide you into this world of arms dealing, whilst also retaining a shred of reality.On the other end of the spectrum, we have Jonah Hill, who is terrifying. In just one of the many elements of the film highly reminiscent of The Wolf Of Wall Street, Hill plays a highly ambitious and morally dubious man who will do anything to make more and more money. From the start, his character is immediately unnerving, thanks to his terrifying cackling and clearly short-tempered nature, but as the film unfolds, Hill becomes more and more intense in the role, adding a brilliant level of dramatic depth that we really haven’t seen from him before, yet another hugely impressive surprise from this film.The two work together brilliantly throughout, and are instrumental in making the wild ride the two men take through the world of international arms dealing both absolutely fascinating and surprisingly intense. What’s more is that director Todd Phillips also plays a big role in getting those performances out of the actors.In general, his direction here is excellent, as he directs two very contrasting on-screen personalities and ties them together brilliantly. The entire film’s atmosphere is a stroke of genius, as he retains the odd comedic relief, but still confidently delivers a very dramatic story that, after coming at you out of nowhere, is enthralling from start to finish, something that’s very difficult to do.But the real reason that this film is so good is because of the story. Very loosely based on a true story of two men who got into a similar situation, it is a truly enthralling watch. The screenplay is excellent, detailing some of the most complex dealings in very simple and easy-to-understand ways, without coming off as didactic of patronising. What’s more is that the story’s focus on Teller’s character, and particularly his relationship with his wife over the course of the years he works in this business, gives an emotional core to everything that’s going on, making it feel a lot more important, and as a result interesting, than two guys hopping over to the Middle East on gun runs.Excellently paced and featuring an intense snowball effect towards an enthralling climax, I was hugely surprised by how much I enjoyed this film. Its story is fascinating, the two central performances are excellent, and the directing makes its unexpectedly dramatic vibes work brilliantly."}, {"rating": "6", "text": "影片确实比较松散，男主角演技缺乏吸引力……乔胖被带沟里去了……群戏上似乎搭配并没什么灵气……只能说非常刻板……导致整部电影都缺乏了灵气……库珀出场乔胖就亮了~~你们一定是真爱~~~群戏水平暴增，这群戏水平是要冲学院奖的节奏啊~~~制作上多少拍点真实场景啊……罗马尼亚和阿尔巴尼亚场景不一样啊……这样被看出来真心很粗糙啊……实在不行就P上去啊……当然这片子可以深挖的东西还有很多，但这又不是《权力的游戏》可以拍个电视剧什么的……挖得越多搞笑效果反而变差了……不过希望有人能拍个深挖版本的~~这片子的评论家得分只有57分，你们特么在逗我？就算影片节奏比预告片慢了很多，也有不少问题，商业喜剧片也要按照学院奖的标准来？？？？那平均也能拿到70分左右。低于50分的，你们真的看电影了吗？还是忙着表忠心爱国了？谁说三观一定要正确的？"}, {"rating": "6", "text": "War Dogs is the tried and true tale of greed and arrogance wrapped up in unique circumstances. So unique that it must be \"based on a true story\" to be believed. Two stoners (one larger than life played by Jonah Hill who is obsessed with being Scarface and his reasonable but careful foil played solidly by Miles Teller) become arms dealers and fake and lie their way into a multimillion dollar contract with the US Government. Eventually greed and hubris destroy them both. There is a disgusting level of machismo on display here (particularly from the stubbled and portly Hill) but if you can overlook that quality in the characters, this film is quite entertaining"}, {"rating": "6", "text": "War Dogs plays like the less evolved companion to the Wolf of Wall Street; dramatically less bite, and the howls of laughter are few and far in between."}, {"rating": "4", "text": "War Dogs is in many ways a mistake. A good, admirable one. But nonetheless a mistake. Almost as if Jonah Hill's character is going to deny or defend it.War DogsThe co-writer and director Todd Phillips makes a wannabe Adam McKay alike biography. Unfortunately, it is not smart. It is not sensible. What it is, is light on feet. And that's a double edged sword. That is not to say that when the time comes the film fails to draw in necessary emotions. Though not powerful, that pull you feel towards these characters is through performance and not the way it is portrayed. Phillips is smart enough to realize that within the next four lines the script asks him to shift the tone in a snap. What he then does, is make us walk through long one shot elaborated scenes that puts us right into the middle of the desert- often, literally! This is how the film remains to be for the most part of its run. You see each of these artists, on screen, straining themselves to achieve something higher from the script that never even existed in the first place. There is disappointment. Dissatisfaction comes from the incompleteness. Certain expectations are built in this completely-new-world, for the audience, and we are repeatedly shot down. We never get to seal the deal. The good scenes are overpowered by the dull ones and its muddy speech, is somehow, the spine of the film. How will it stand tall, then? Even Todd who is exceptional in sliding in his sense of humour, fails to cook its content into favoured crisp texture. Neither are these dogs trustworthy, nor are they an important piece of the puzzle at war times. If anything they are the ones spoiling the definition, the meaning behind all of it; if there is!"}, {"rating": "10", "text": "A+ *************************************************************************"}], "recommendations": ["ant_man_and_the_wasp_quantumania", "three_kings", "no_country_for_old_men", "the_men_who_stare_at_goats", "colossal", "american_ultra", "savages", "cold_pursuit", "the_accountant", "the_family", "lucky_number_slevin", "thor_ragnarok", "free_fire", "avengers_infinity_war", "the_big_short", "tag", "the_gentlemen", "limitless", "kingsman_the_golden_circle", "bumblebee", "downsizing", "the_king_of_staten_island", "burn_after_reading", "the_equalizer_2", "inherent_vice"]}