{
  "id": 2528,
  "title": "War of the Worlds",
  "starring": [
    "Tom Cruise",
    "Dakota Fanning"
  ],
  "runtime": 117,
  "genre": [
    "Adventure",
    "Thriller",
    "Science Fiction"
  ],
  "description": "Ray Ferrier is a divorced dockworker and less-than-perfect father. Soon after his ex-wife and her new husband drop off his teenage son and young daughter for a rare weekend visit, a strange and powerful lightning storm touches down.",
  "releaseYear": "2005",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/6Biy7R9LfumYshur3YKhpj56MpB.jpg",
  "categories": {
    "plot": 3.619047619047619,
    "acting": 3.875,
    "ending": 3.8666666666666667,
    "soundtrack": 5.0,
    "cinematography": 7.0,
    "familyFriendly": 6.0,
    "funny": 2.0,
    "action": 7.8
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Absolutely terrible! This movie is an insult to the viewer as it seeks to sell two hours of special effect spectacular but delivers no content. There is almost no story line of any acceptable depth, and all characters are as annoying as hell. There is little explanation for what happens and only a 30 second voice to let you know that the [OMITTED] prevail. Nothing made sense in the movie: why the aliens came, how the hell they arrived...., why there were bloody vegetations all over the earth, and why they were out there to kill. Finally, the end scene was designed to make you hate the movie if all the previous scenes were not enough.....And what the hell was up with the Tom's son anyway? Here this from me and don't waste your time and money."
    },
    {
      "rating": "7",
      "text": "If anyone can make an amazing blockbuster, it is Spielberg, and he has proven this once again. Overall, this is a rather good film. Technically - simply stunning. Great visual effects, sound and cinematography make it a pleasure to watch. It is one of the rare blockbusters that are actually decent when it comes to the plot, also. Ironically enough, the screenplay is also its weakest point. I was especially annoyed with the ending and the \"happy family\" crap. The demise of the aliens also came a bit too suddenly, and Spielberg could have made the transition more subtle, more intense. Nonetheless, \"War of the Worlds\" is going to be definitely one of the many blockbusters of Spielberg's that is going to be remembered as a good, entertaining, and thrilling film."
    },
    {
      "rating": "10",
      "text": "First off, I would give this a 9.5 out if 10. Acting is good. Not amazing, but everyone does a good job. Score was really good. Had an incredible story. It also has really good special effects and great set pieces. Overall, this is a really good movie. Great movie, and one of my favorite Tom cruise movie. Highly recommended."
    },
    {
      "rating": "8",
      "text": "The ending was indeed lame, but taken exactly from the book. You got a problem with the ending, take it up with H.G. Wells. In terms of \"disaster\" movies, this is as good as they get - Spielberg is a master filmmaker. It has heart, adventure, and terror not seen in normal movies of the same ilk. All in all, a worthy picture."
    },
    {
      "rating": "9",
      "text": "This movie is one my favorite movies of all time. Love every bit of it. Tom Cruise actually killed the role and the little girl did it too. To be honest this my favorite movie because it has suspense and some scenes just left me breathless."
    },
    {
      "rating": "3",
      "text": "I agree with another's remarks, but she was pretty harsh. This movie deserves at least a three. It's funny to read all the half-baked critics who just want their name seen next to Spielberg and Cruise for once. The acting was so bad, I found myself annoyed at how stupid the alien was that it couldn't just squash Tom Thumb in the first 5 minutes. The scenes in the cellar were absolutely laughable, these Spielberg's tripods were dumb and dumber. I really wanted to like this movie, honest! Starts off quite well, but it went all downhill after about 20 minutes into the movie - Did Spielberg go on vacation and let someone else take over after the first few minutes? Things I hated about this movie 1) Severe plot holes - Usually I don't let a plot hole or two ruin the movie, but this was ridiculous. Plot holes throughout meant that the story just didn't make sense and wasn't believable at all 2) The main characters - Very unlikeable. The audience couldn't care less if they lived or died. The acting was okay, for what they were given to work with. I still have faith in your acting abilities, Tom Cruise. I know you'll do better in your next movie. 3) The pacing in the film is extremely uneven 4) The ending! Very uninspiring and a total let-down. It's as if the director suddenly got bored and didn't care that he was slacking off, thinking hoping that the start of the film will at least get it good reviews. All in all, don't bother with this movie. But if you're still curious and hoping that all the bad reviews were wrong, get it on DVD. It's a renter at best!"
    },
    {
      "rating": "9",
      "text": "War of the Worlds is a near perfect experience however, I had some hard time getting into the visual effects because for some reason I couldn't like the CGI in this movie, I am not saying that the CGI bad but it is out of my league. Despite, the movie is one of the best science fictions in recent memory, it is clever, tense and leaves at the edge of your seat. However, I am not used to seeing a Steven Spielberg film that is so hardcore and heartless, so I would consider this movie Spielberg's weakest. On the other hand, I would consider it a distinct achievement in movie history of Sci-Fi. It is recommended, other than some weak CGI, it is a wonderful popcorn B movie!"
    },
    {
      "rating": "3",
      "text": "This movie had so much potential and just did not deliver. The holes in the plot were large and frequent. The main charecters were annoying and at times I wanted them to die. The special effects were good but could not rescue this flop."
    },
    {
      "rating": "10",
      "text": "Visceral, vile, repulsive and totally awesome. Alien meets the Nazi death camps. And the creepy sound effects as the tripods processed and disgorged human blood towards the conclusion freaked me out-it was the sound of death."
    },
    {
      "rating": "1",
      "text": "This is the worst movie I've seen in a very long time. It has no style, no personality. Its sole purpose is just to show a small town get blown to pieces in the first 20 minutes. Every other second of the movie is agonizing! Its not even a movie, its what the \"nails on a chalk board\" sound is to the visual sense. The actors all spend the whole time screaming at each other in a very melodramatic fashion. Or just screaming in general. I've never seen people scream so much before in my life. If a giant robot is trying to kill me, I'm not going to be like \"DAD WHY ARE YOU UPSET ITS ONLY THE END OF THE WORLD!!!! DAD!!! DAD!!! DAD!!! AAAAAAH YOU'RE MAKING ME NERVOUS TRYING TO FLEE FOR YOUR LIFE!!!!!\" The characters don't even have lines when they're not screaming or acting stupid. At one point, Tom Cruise's son begs him to let him go watch a battle between the US army and aliens, and Tom has to try and drag him away; to no success. That's the dumbest thing I've ever seen in a movie, and it was totally non-secateurs. No plot. No nothing. When the pretty visual effects stop momentarily, Tom Cruise resorts to throwing peanut butter and breaking the windows of his house to entertain us. I guess they ran out of budget after making all the terrible CGI."
    },
    {
      "rating": "5",
      "text": "the plot of the original war of the worlds film was better then this.  the original was about how helpless we where against a aliens invasion focusing on the the military just getting beatin down . the new one is all about the survivle of tom cruises charicter and his 2 obnoxous kids. the aliens are only there to chase him down . while this is not completely unentertaining it just doesnt bring what the original had to the table . woulda been better served being called some thing els ."
    },
    {
      "rating": "3",
      "text": "this movie i must say is very unsuccessful in my eyes for starters not providing an entertaining story i thought was even boring in some parts. the acting from the cast is the only thing that saves it in my opinion"
    },
    {
      "rating": "6",
      "text": "Not the best film, but it certainly delivered. It was smart of Spielberg to leave the audience wanting more. I totally picked up on the frightening vibe and the movie was intense. Still... I thought it was boring and don't really have a desire to watch it again."
    },
    {
      "rating": "1",
      "text": "OK...team up Tom Cruise, Steven Spielberg, and one of the greater science fiction writers' best story...like the saying in \"Crazy Like a Fox\":  \"What could possibly happen?\".  As it turns out, not too much.  Cruise running around like a maniac would not be too bad...IF it'd happened following the 'invasion'.  However, it seems like that's the way the character normally acts.  Dakota Fanning's claim-to-fame seems to be her ability to remember one line of dialog:  \"SHRIEK!\".  'Sir' Spielberg places this film in the modern day, which might have worked.  However, in this case, it didn't.  In his re-imagining of the invasion, it turns out the aliens have been here all along (Spoiler...naw...).  The so-called effects just seem too Michael Bay-ish, with the only item that I enjoyed being the 'harvesting' tripod.  I will mention that the ending was great...it meant this tripe was finally over."
    },
    {
      "rating": "0",
      "text": "That is the first one in my \"black list\" os worst movies ever.\rI hate when a history force too much to give a good end without any reason.\r The movie dont have a start, a middle and an end, have nothing. Every behavior from humans and aliens are so stupid. The script has so bizarre errors. Like someone recording a PEM with a cam, or Tom Cruise leting off the city in a car with ALL cars stoped in the streets, how?\r When i saw the end, i just ask \"why\"? The perspect of view was amazing, but all the rest was disastrous."
    },
    {
      "rating": "9",
      "text": "War Of The Worlds has defined alien/action movies, whilst setting a new bench mark that continues to be undefeated. Tom Cruise has performed to his A game in which could be his best acting to date, the whole cast was exceptional and they work well together. War Of The Worlds is a action pack adventure of the survival of humanity on its last breath from extinction via the threat of alien invaders. This is a must watch for all Si-fi fans and a great movie to watch with family/friends."
    },
    {
      "rating": "8",
      "text": "To put it in perspective, I like everyone else enjoyed 70-75% of this movie. Spielberg brings it all into this movie, the themes and imagery come with a purpose to frighten and disturb rather than thrill, making ingenious use of familiar 9/11 imagery along with clear references to the Holocaust and the war in Iraq. The references and themes are so chilling that its almost to the point its as if the movie is a post 9/11 propaganda film. Tom Cruise, who was excellent in Collateral also brings it in this film by delivering a very committed and tense performance as a seemingly failed father. Then comes the second act, the movie begins to stumble and fall leading up to a clear Dues Ex Machina conclusion that almost makes me wonder as if Mass Effect 3 took a page out of Spielberg's book to deliver a unsatisfying conclusion to an otherwise satisfying movie. The film tragically changes and almost with no regard for itself violates its carefully established tone and internal logic to become a typical and cliche summer action film where our hero valiantly goes one-on-one with an alien invader to eventually turn the tide in humanities favor. The transition is jarring almost to the point to where you feel disconnected from the story. It's also troubling that the guy who created Jaws and Jurassic Park also couldn't hold himself in check before misfiring and showing his badly designed and poorly CGI'd alien invaders. Still, War of the Worlds is well worth a view for fans and movie goers. Whereas, despite it's otherwise weak second half, it's an excellent film. Considering it was made in the wake of 9/11, its not hard to view the film as a form of post 9/11 or Iraqi war propaganda. Its almost brilliant when you think about it, America under attack by technologically advanced \"sleeper cell terrorists\" coming from within, hellbent on destroying America with extreme prejudice. The only thing that would make it more evident would be if Spielberg decided to put beards and turbans on the aliens while having them speak a strong middle eastern dialect."
    },
    {
      "rating": "6",
      "text": "While I enjoyed it, it's definitely a mixed bag.It's like for everything it does right, it does something wrong.Its scenes of chaos and panic are absolutely horrifying, but it's the most unsubtle 9/11 allegory I've ever seen.The tripods are incredibly scary, but the aliens inside them are hilariously goofy.The performances are all solid, but the characters are very annoying.What pushes it above average for me it's the ending. I really like the ending. I know some hate it and think it's unsatisfying, but it's refreshingly hopeful and it makes me feel that if aliens were to attack, everything would be ok."
    },
    {
      "rating": "1",
      "text": "I liked the lightning and weather effects, but ALL the crowd scenes were terrible. It was a first date movie with someone I didn't last more than a month with. And, I am tempted to blame this waste of money and time and energy and online time to write this review. I want to have a subtitle to this movie: \"Spielberg and Cruise, The Betrayal.\""
    },
    {
      "rating": "1",
      "text": "In this days... great f/x doesn't justify a bad movie like this one. The first thing to do before an invasion is recognising the place, so, how can a group of aliens with that technology fail in a basic strategic point like that one?????"
    },
    {
      "rating": "8",
      "text": "Great mood setting before the big storm, great special effects! Yes, story has a few plot holes (the ending gets a thumbs down) where you must suspend your disbelief, but come on, it's very entertaining! Worth seeing on the big screen for all the effects."
    },
    {
      "rating": "0",
      "text": "Joel is correct in attacking the workmanship of this poor effort by Spielberg and Cruise as it makes no sense and is laughable from beginning until the bitter end. But Joel may be the most prosaic person ever to write on this board. To attack Spielberg for other efforts that were truly heads and tails above the best of its generation is grossly unfair. War is simply bombastic in that it tries to attack the senses without plausable explanation. It fails on every level imaginable."
    },
    {
      "rating": "6",
      "text": "A thrill-ride with a crappy ending. Could have been a 9 with a less stupid and less hasty ending (and perhaps not so humanoid-like aliens)."
    },
    {
      "rating": "4",
      "text": "Good special effects, but once again Tom Cruise plays a character with the depth of personality of a potato. Whether this movie is about humanity's best or worst tendencies under stress, it is painful to contemplate."
    },
    {
      "rating": "0",
      "text": "Too bad to be believed. It falls off a cliff early on and into an abyss."
    },
    {
      "rating": "1",
      "text": "The horror......the Razzie-worthy horror. Crappity crap crap, all of it. Acting, cinematography, FX, script, characterisation, logic, bookends, you name it. Fugly and unprofessional as sin. Spielberg and his lousy leading man need to go away ASAP if all the reaction they can elicit with their sad craptitude is not one shred of unintentional amusement, but instead bore me to death with their bumbling indifference to quality. I know lots of videogames more mature and entertaining than this trailer trash - so why do the ravers even bother? I'd think a non-event even more effortlessly mechanical, empty, contrived and idiotic than Revenge of the Sith(!) is hardly worth talking about in the first place, let alone gushing over."
    },
    {
      "rating": "7",
      "text": "First off, the special effects were amazing. Nothing released on DVD has come this close to blowing you away. The buildings collapsing, aliens, UFO's, explotions etc, were spectacular! The acting, especially by Cruz and the little girl, were Oscar worthy. The story, is were this film falls short. Packed with tons of suspense and action, this movie was great. But there were tons of holes throughout the movie, that made this fall short of a perfect film."
    },
    {
      "rating": "9",
      "text": "It was great! there was some minor problems with it that keep it from being a classic, but still, amazing entertainment!"
    },
    {
      "rating": "3",
      "text": "[***SPOILERS***]  Not a patch on The Terminal or Catch Me If You Can. I don't blame Steven Speilberg, more the writers who did the script. It is totally unintesting espcially after some of the great versions that have been done in the past. The only excellent scene was the bit where the young girl goes off into the forest and gets to the river and sees the bodies flkowing down the river. That was excellent thought."
    },
    {
      "rating": "9",
      "text": "One of the tensest movies I have ever seen. Like Spielbergs last 2 sci-fi movies, A.I and Minority Report, it would have been superb if not for a shit ending. Why can't Spielberg just show some balls and try to end on a dark note. He seems to have the ability to go dark until when it really matters; the ending. oh well, it was still one of the better action films of all time despite the borderline horrendous ending."
    },
    {
      "rating": "3",
      "text": "I can't believe how high most critics scored this. its fairly entertaining in the same way pyromania is. cruise sucks in pretty much everything bar Magnolia, and no change here. Throw in some of the worst logjc ever, some stupid mistakes such as the deaf guy reacting to a sound when someone says 'did you hear that', and the biggest cop out ending involving a family who from the looks of things didnt notice the aliens. The daughter is also incredibly annoying, and Spielberg tries to add some depth im some really dubious shots of cruise and his son. Photography is nice however, but that hardly saves this mess."
    },
    {
      "rating": "0",
      "text": "The reviews by average posters on this board is all in the RED column but somehow this film has a rating of 6.4? It is as preposterous as the storyline in this absolutely dreadful remake of a great science ficition classic. Message to the genius Spielberg: If you are going to take a book from a century ago, made into a movie a half century ago and then set it one hundred years into the future, perhaps it would be wise to use 21st century technology. For example, would you make a movie in 2005 and use smoke signals rather than computers? Pony Express instead of Federal Express? Wind power instead of nuclear power? So then why would we believe that these super intelligent omnipotent aliens who came a billion miles through space and had been monitoring our planet for a million years would know nothing about filtration, bacteria, our atmosphere or wear space suits? It is total illogical as was the irritating Cruise and his band of misfit children running toward the danger instead of away from it? As for the ending the less said the better. It worked one hundred years ago when the book was written but not now! What could have been a great movie turned into a natural disaster because of a financial partnership with a no talent pretty boy like Cruise who backed the movie with Spielberg. About the only thing they did right was to hype this to the rafters to turn a profit from basically a pet rock production. Avoid at all costs."
    },
    {
      "rating": "1",
      "text": "No, seriously, what's the point of that story ? They take a car through the crowd... What is gonna happen ? Everybody is going to jump on the car to take it. Yep. Then the son is joining the army, is he gonna die ? yep, or no, because it's a happy ending movie. I'm looking for something in this movie I couldn't predict before it happened... Ah yes, actually, I couldn't predict an end as dumb: the Martians are sooooo technologically advandced that they forgot their space suit, and fall for the first virus. Maybe they didn't know about Pasteur, but I know about Spielberg: he doesn't do a movie like one does art, he chain-produces meaningless blockbusters. Star Wars was stupid but at least funny. This movie is boring, and I still don't get what the critics found interesting in it, I think critics are so bored they overrate any novelty."
    },
    {
      "rating": "9",
      "text": "Great movie...in the vein of other great horror remakes like Invasion of the body snatchers and the thing!"
    },
    {
      "rating": "4",
      "text": "After the previous Spielberg/Cruise/sci-fi combination of Minority Report, I had high hopes for this. Consequently I was very disappointed - it starts off convincingly, but once the tripods arrive it alternates between schmaltz and aliens incompetently attempting to kill everyone."
    },
    {
      "rating": "0",
      "text": "[***SPOILERS***] Please excuse Matthew as he obviously checked his brains in at the door. There are more plot holes in this film than Carter has Little Liver Pills. If you had a lobotomy then the loud noises and special effects make you giddy with joy. But if you have the ability to rationalize then this makes no sense at all. Imagine superior creatures capable of traveling a billion miles through space and somehow they forgot their spacesuits, filtration systmem and antibiotics. Simply ludicrous. Would any of us walk out naked on another planet without first checking the atmosphere out other than Matthew? I don' think so. Lame ending to go along with a totally lame effort by Spielberg. And those annoying children."
    },
    {
      "rating": "1",
      "text": "All that leaps off the kneejerk critical page to me - a lot more than this irritating brainless movie per se can muster anyway - are comments regarding 'top-notch special effects'. What are all you peeps smoking? I'd sure like an optimistic drag, because the only thing I found 'special' about these effects is how often I've seen less laughable and amateurish effects on bilge made for the Sci-Fi Channel."
    },
    {
      "rating": "7",
      "text": "I gave this movie a 7/10. The movie itself is ok, however it had some \"problems\" with it that I found hurt the movie quite badly. First off, you know how you get those movies such as this one where someone (usually aliens) is trying to kick the human races ass, and it happens - so you sit through it for maybe half or even two thirds of the film, then you get the payoff of the satisfaction of watching us \"get our own back\"? Well, this is one of those rare movies where you never get this payoff. (it's a bit like the Animatrix Episode \"The 2nd Renaissance\" or even the Matrix Trilogy itself) What you're treated to is the human race having it's ass handed to it for 90 minutes then the attackers basically just die, at the hands of a virus (I think it was the common cold... :|). The only remotely satisfying bit of them taking any flack is near the end when one is already half dead and the army take it out with rocket launchers. The other problem is that the film seems to lose it's way about half way through, with a pretty pointless bit involiving a nutter hiding in his basement, though this part does have some quite well executed suspense momemts. As always with Spielberg you can expect awesome special effects and all that, and you will probably feel some emotions, probably anger because a lot of people do get killed and not much happens to the attackers. One thing I did like though was the attitude of the son in the movie, his desire to follow the army into the heat to try and get some sort of vengeance pretty much summed up my feelings while watching the movie, like I said though, you never really get this. Overall a decent movie, probably one I might buy on DVD but it could have been a lot better in my opinion."
    },
    {
      "rating": "7",
      "text": "The movie was excellent, but the dvd does not have much to offer besides the movie itself."
    },
    {
      "rating": "8",
      "text": "I think it was a really good film actually, Only disapointing bit for me was maybe the ending."
    },
    {
      "rating": "4",
      "text": "Critic seems to like it, but to me it was just a bunch of aliens coming and killing everybody during the whole movie, until a stupid end."
    },
    {
      "rating": "5",
      "text": "Sure, it looks great, the special effects are seamless, but is it any good? Nope. It's weak sauce, as the kids say. Nothing compelling, a lot of awkward missteps (everything from the missed details of newscasters referring to \"THE Ukraine\" to Tom Cruise unconvincingly being unpleasantly surprised by the taste of humus to the son's inexplicable behavior after the invasion). But the biggest misstep is the casting of Cruise as the everyday working stiff just waiting to be a hero. Weak sauce indeed, Mr. Spielberg, Mr. Cruise."
    },
    {
      "rating": "8",
      "text": "I love this film! Spielberg yet again delivers another masterpiece in the form of an inpsired story with a good ending. Visual effects are awesome and the aliens attacking everyone bring an apocalyptic feeling to it. Tom Cruise has a good role as Ray. John Williams' score also gives the menacing atmosphere to the film. Excellent."
    },
    {
      "rating": "10",
      "text": "Holy crap this was good! This is like the best movie ever. the acting was phenominal (especially tom and decota) and the effects were so realistic! For those of you who gave it low ratings, you obviously did not understand the sybolism entwind in the plot. To Adam e.- nobody found a tripod because the aliens were smart enough to put them in the ground deep enough so no one would find them, Robbie is a smart kid he figured out something, The aliens didn't notice the desieases because the were arrogent and only focused on wepons, THey store people because they need to spread the blood everywere, not just all at once, who cares if they're nude (YOUR MISSING THE POINT!), the airplane crashed a little bit away and slid into the house, You would scream to if you were being attacked by bloodthirsty aliens, and the clothes show that the aliens are so sofisticatied and interested in our planet, that all they want to do is get rid of us, not anything else!"
    },
    {
      "rating": "10",
      "text": "Great is all I can say."
    },
    {
      "rating": "1",
      "text": "V.dissapointing. Why anyone would want to ruin such a good book god only knows. people should stick to just readin the book."
    },
    {
      "rating": "10",
      "text": "A great escapist movie. To anyone who gave this film a 0, I pity you and your attempt to think that anyone cares. Stop with all the negative reviews, there was nothing bad about this film and you know it. I makes me angry to know people like you have source to post your opinions on the internet, only to warp the movie. This was in no way a bad movie, but an amazing achievement. Want a bad movie, go see basically any other movie this summer. Suck me."
    },
    {
      "rating": "10",
      "text": "This was a great movie! excellent special effects, and Tom Cruise did a great job in this movie"
    },
    {
      "rating": "10",
      "text": "It was hard to breathe with all the thrills."
    },
    {
      "rating": "3",
      "text": "I think it's not such a good movie, and it should be nominee to the razzies."
    }
  ]
}