{
  "id": 1254,
  "title": "Warcraft",
  "starring": [
    "Travis Fimmel",
    "Paula Patton"
  ],
  "runtime": 123,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "The peaceful realm of Azeroth stands on the brink of war as its civilization faces a fearsome race of invaders: orc warriors fleeing their dying home to colonize another. As a portal opens to connect the two worlds, one army faces destruction and the other faces extinction. From opposing sides, two heroes are set on a collision course that will decide the fate of their family, their people, and their home.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/nZIIOs06YigBnvmlJ2hxZeA8eTO.jpg",
  "categories": {
    "plot": 8.547619047619047,
    "acting": 8.363636363636363,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 9.666666666666666,
    "action": 8.285714285714286
  },
  "reviews": [
    {
      "rating": "8",
      "text": "The mainstream critics were never going to get this film as it's guilty of two cardinal sins in their eyes.\r 1. Being based on a game.\r 2. High fantasy.\r If you're a fan of the source material this film was great fun.  If however you go in with the idea that its stupid you will hate it.\r To everyone else, give it a try it is far better than the critics would have you think."
    },
    {
      "rating": "10",
      "text": "Hmm. When critics views it bad and audiences views it good, who's wrong?\rAre we the stupid ones or those critics are the stupid ones who doesn't understand how to enjoy a good movie?\rEven my non gamers family and friends say it's good. I for one can't wait for the sequel"
    },
    {
      "rating": "10",
      "text": "A truly work of love. As a diehard warcraft fan this movie was amazing. So many details, amazing art design and amazing sound design. It truly shows how disconnected the critics are to the everyone else. Me and everyone i know that went to watch the movie truly liked it. Even people that had no knowledge on the Warcraft lore. A few friends even started playing after the movie. An amazing job by Duncan and the team. The actors were great and passionate and the CGI was one of the best i've ever seen. Go watch it, you won't regret it."
    },
    {
      "rating": "10",
      "text": "Had so much fun watching this and will watch it again yes a lot went on at the same time but it was still an awesome movie to watch and enjoy. note this is based on Warcraft and not world of warcraft"
    },
    {
      "rating": "8",
      "text": "What is with all these \"Professional Reviews\"?  Even more stupid then the videogame journalism going on.\r Anyway this movie is a solid 8/10\r Story is rushed and fast paced but is visually impressive and has great world building sequences in it, which is what I want from a fantasy movie, I want to see the world!"
    },
    {
      "rating": "10",
      "text": "Народ, не смотрите на оценки критиков, ибо нынче они просто напросто зажрались! Фильм ШИКАРЕН! Что мне - фанату варкрафта во всех его ипостасиях, что моей жене - не знакомой с миром варкрафтом вообще - фильм очень понравился. Единственно что немного огорчает это то, что сюжет в фильме бежит не останавливаясь на разъяснения. Но здесь все понятно - дядьки, решившие, что их видение картины лучше, чем у режиссера и считавшие, что лучше знают, что хочет видеть народ - несчадно порезали ту составляющую фильма, которая объясняет в подробностях все происходящее в картине. Отсюда и негативные отзывы от людей, не знакомых с лором (миром варкрафта). Повторюсь еще раз - не слушайте и не читайте рецензии критиков, не портите заранее себе впечатление о фильме! Сходите сами и посмотрите картину. А если уже почитали и сомневаетесь - так познакомитесь вкратце с миром варкрафта перед просмотром фильма - это улучшит его восприятие и все встанет на свои места. Ну или, в крайнем случае, дождитесь режиссерской версии картины, от просмотра которой, я уверен, все получат огромное удовольствие!"
    },
    {
      "rating": "9",
      "text": "Don't trust the bad reviews. The movie is not a cinematic masterpiece but it is quite enjoyable and a good intro to the Warcraft world.\r It is by far better than most popcorn flicks, even more so if you are familiar with the setting.\r If you want Lord of the Rings go watch that again, however if you want Warcraft you will not be disappointed."
    },
    {
      "rating": "10",
      "text": "It is not perfect, of course. But, bad as Critics say it is, it is not by far! It is everything I expected a Warcraft Film to be. I am not even a Warcraft-Fan, I know nothing about it or the Video-Games. I just like Fantasy and I love it."
    },
    {
      "rating": "10",
      "text": "Well done Blizzard! The movie stays faithful to its roots and theme.\rStory was good and it felt real (instead of fake, like most modern fantasy movie attempts).\r Was expecting worse, but pleasantly surprised.\rNo unnecessary sarcastic humour. genuine story, hard core bad guy, beautiful CG.\rChris Metzen, I salute you. Looking forward to a sequel."
    },
    {
      "rating": "10",
      "text": "Simply a great movie, enjoyed every single bit of it as a Warcraft fan. Acting was great from orcs, the humans was a little dissapointing at times and the effect are great! Can't wait for chapter 2."
    },
    {
      "rating": "9",
      "text": "As a fan of Warcraft I went into this movie a little bit sceptical, but from ten minutes in I was already loving the film. The majority of critic reviews are pathetic and should just be ignored. The CGI is mostly fantastic, and the story while it is a little rushed at the start is also pretty good. I saw the movie with two other people one who knows a little bit about Warcraft but who has only played WOW, and someone who has no interest in video games at all and they both loved it. I recommend if your a fan of Warcraft as a franchise go see it, if your a fan of high fantasy go see it."
    },
    {
      "rating": "8",
      "text": "I Honestly don't even know why the movie industry has critics anymore... This movie is one of the movies that prove that critics just don't know what they are talking about. Now to give you some background, yes i am a gamer, no not any movie that is based on a video game is good, and lastly i have played a very small amount of WoW or Warcraft. To start this movie was no masterpiece, BUT it was a good movie. The story line although critics would leave you to believe that you need to know EVERYTHING about Warcraft in order to understand was surprisingly good. That being said the story is tough to follow ALTHOUGH not for the reasons stated by said \"critics\" The main problem the storyline has is that it throws out A TON of hard to pronounce and even harder to remember names that get the listener confused. How is someone that has never played a video game going to remember who's name is who's when there are names floating around like \"dalaran\", \"lothar\", \"Gorona\", \"Gul Dan\" etc. the answer is they wont, they get frustrated and stop because \"it doesn't make sense\" when they really mean that they are lost because they dont know who is who and what is what. Now imagine if the main character was named Jason and instead of saying the complicated names of cities and towns they started saying names like \"New York\" \"Tokyo\" and \"London\" that literally EVERYONE knows! yes that would make the movie easier to understand, but because people are too lazy to even try to remember a name as complicated as \"Medivh\"(i think i spelled that right) they give up and call the movie **** THERE IS A REASON THIS SHOW KILLED IT IN CHINA! long story short if you only watch movies to be TOLD a story instead of watching movies to LISTEN to a story then this movie will be tough to watch."
    },
    {
      "rating": "9",
      "text": "Best Video Game movie I've seen so far, not perfect, but still a great time.\rDespite it's 2 hours run time it feels a bit rushed, but is never boring.\r If you expect a 100% adaption of any source material into a movie that's your own fault, not the one of the movie. I'd say it's welcoming to both people who play Warcraft games and those that don't."
    },
    {
      "rating": "9",
      "text": "I was lucky enough to see this at a Preview showing in IMAX 3D. Whilst the story and characters are only skin deep, this did not detract from the absolute spectacle that was on screen. Having been an on/off fan of the franchise for sometime - I really enjoyed watching characters on screen that I have been playing alongside for near two decades. Yes this is Fan fodder, and unashamedly so - that's a good thing. Definitely the best video-game inspired movie ever made and deserving of multiple sequels. My only complaint - the running time was trimmed too much, therefore there wasn't enough time to develop characters; the focus shifting between too many characters; within too short a space of time. In many ways I wish that had been a TV series rather than a movie, that would have given more time to give to character development and being in parts of well known locales. Ironforge and Dalaran were brilliantly rendered, but never on screen for long enough. That said, other movies like the Jurassic Park series had the same level of 2D characterisation and this did not detract from the stunning spectacle of the CGI dinosaurs. Warcraft has its flaws, but bloody hell is it one hell of a spectacular, no.. EPIC. Ignore the bad reviews, they are written by a constant flow of mainstream critics who wouldn't understand what Warcraft is about, or how deep its lore and canon is. If your a fan of the series its a must see, if your not a fan of the series - but are a lover of fantasy/sci-fi its a must see. If your tastes are more high brow then avoid this little gem."
    },
    {
      "rating": "9",
      "text": "I saw this film a few weeks prior to the US release in Germany and I was so frustrated that the user reviews were locked for this film. The Critics were totally off base on this one.\r The film is not perfect but I enjoyed it enough to pay for a second round at the theater. I didn't really connect to the characters but the film is really able to sell the world. I felt immersed in a beautiful cinematic universe with believable fantasy wildlife and magical powers.\r The action was brilliant, The Magic was beautiful and the Overall quality of this film was really high.\r Honestly this film is a 7/10 for me, I'm giving it 9 to help the average as the Critics genuinely angered me on this one."
    },
    {
      "rating": "8",
      "text": "I dont understand why this is getting such low critic scores its a really enjoyable film.I have never played the game so i dont know if it is true to it but as a film well worth a watch."
    },
    {
      "rating": "8",
      "text": "Una película destinada, sobre todo, a los fans de Warcraft (entre los que me encuentro). Es cierto que algunos personajes son poco profundos, pero el resto de la película es un auténtico espectáculo que ningún aficionado a esta maravillosa saga de videojuegos debe perderse. Una sólida base sobre la que construir una trilogía, bravo Duncan Jones."
    },
    {
      "rating": "10",
      "text": "Сперва я думал, что мне не понравится, поэтому с опасением шел на киносеанс, однако фильм оказался значительно лучше моих ожиданий. Да, повествование несколько рваное, есть глупые моменты, а местами сильно похоже на CG-ролик из игры, но все же это пока лучшая киноадаптация игры. Жду 2 часть. Критики - идите в жопу!"
    },
    {
      "rating": "0",
      "text": "If you're not a die-hard warcraft fan, then do yourself a favor and skip this one, you'll regret it ... nothing to see here.\r Probably the worst acting I've ever seen in my entire life. Every single actor really hates being in this movie and they don't even have the decency of hiding it. I wish I could say something about the plot, but I honestly had no idea what the hell they were even trying to do most of the time."
    },
    {
      "rating": "3",
      "text": "Comparable to the Shannara Chronicles, this is just plain bad.\rActing, script, characterisations... as with many movies in the end it´s just a boring CGI show, which makes no sense whatsoever. No humor, bad action sequences, nothing is comprehensible - it just feels like a senseless collection of scenes with slightly the same theme. I think no one even cared about it making sense a little bit or about continuity.\r The design, while true to the games which I like btw., doesn´t fit the big screen in any way. It´s just plain ridiculous.\r To the people, who seem to think, they must defend their beloved franchise by ignoring the failure of this movie: even as a WC fan you don´t need to like this to be a true fan, you know? It´s not heresy to be critical when something is as obviously bad as this adaption. Just think about, what would have been possible with some film making skills involved."
    },
    {
      "rating": "3",
      "text": "A terrible disappointment that not only fails to capture the hearts based on the video game it's played on but also seems obvious that the cast and crew were oblivious on what they were even doing in the first place."
    },
    {
      "rating": "10",
      "text": "Incredible movie and incredible characters. I am very proud to spent my money in this Movie.\r For me, all the critics are wrong because they are not  fair with a movie whose screenplay is about a video game and this mean dont take risk and execute on the best way the idea about Warcraft that every fans get in theirs minds."
    },
    {
      "rating": "10",
      "text": "More evidence that if the \"critics\" weren't paid off ahead of time, the movie will fail. The hipster brigade didn't receive enough Starbucks gift certificates in their email and therefore, they gave the movie 3s.\r Warcraft is a lot closer to a 10 than it will ever be to a three. I just hope we get a sequel and the physical release is a success."
    },
    {
      "rating": "10",
      "text": "i read the critic reviews after watched movie and frankly i was shocked, i can understand why some people wouldn't like it, being that it is a little geeky and all, but no way no how does this movie deserve the low rating that the critics gave it. I also saw some of the complaints that people couldn't keep track of the characters (being that i've never really played any warcraft games aside from warcraft 2 a little) i could understand this complaint, however even so, even with a little confusion as to who was married to who and related which way, everything mostly narrows down in the end, and ultimately i understood everything and really enjoyed the movie."
    },
    {
      "rating": "10",
      "text": "This film was so amazing. I have played a lot of the Warcraft games. I loved it, so did my brother in law. My girl friend have never played any of the games and did not know any of the lore before entering the theater. We all loved it. Die hard Warcraft fans as well as a new fan. All three of us look forward to the (hopefully) sequel."
    },
    {
      "rating": "10",
      "text": "I really enjoyed this, even though I am not a hardcore WoW player. Now if they would only remake WoW with proper graphics and console support ...\r 1. Release movie\r2. ???\r3. Remake game\r4. Profit!"
    },
    {
      "rating": "8",
      "text": "As a fan of the Warcraft games (Both RTS and MMO) for over 10 years now I wear my bias on my sleeve. The film's greatest strength is in the love and care that have gone into adapting this world for the big screen. Its a difficult task to try and distill over 20 years of lore and storytelling from one medium to another. Even more difficult is trying to tell a coherent story from this material in the space of two hours. The film largely succeeds in doing so despite a few stumbles.\r Blizzard and Duncan Jones wisely chose to start from the beginning. The story is fairly simple but serviceable. If I had one criticism its that the story is fairly generic compared to those found in later games. But that isn't a slight against the film as the movie is a faithful adaptation of that story. It wasn't until Warcraft 3 that I really felt that the storytelling really became interesting.\r The film can be a bit too fast paced in the beginning of the film which I do think may be disorienting to those who are not familiar with the lore. However I do feel that casual moviegoers can still have fun with it if they allow the film to exist on its own. If you can divorce yourself from the idea that the LotR is the standard of fantasy films I think you can have a great time with it and become invested in its characters.\r The cast does a great job of bringing these characters to life in my opinion. Durotan and Drakka are notable standouts. Lothar and Khadgar have decent chemistry between them and I would have even liked to have seen more of it. I know Ben Schnetzer has been criticized in other reviews but I actually quite liked him as Khadgar. Another casting choice I have seen criticized is Ben Foster's Medivh. Again I actually thought he put in a decent part as Medivh. I would be remiss however if I didn't give praise for Daniel Wu's Guldan. They captured Guldan's cunning and ruthlessness perfectly.\r The special effects are quite special indeed. I really do think the effects are a visual feast for the eyes. I saw the film in 3D and I even liked the extra sense of depth it added to the experience. I never really was taken out of the film by something looking fake or out of place. I found myself easily immersed in this lovingly crafted world.\r The score was solid as well. If you have played the games you will recognize familiar themes from the games as well as some original music. The fantastic audio extends to the sound effects as well. Punches feel like they have power behind them and even the sword strikes and magic carry spectacular weight through the sound design.\r Its worth noting that there is an abundance of fan service in the film and it never really felt too on the nose but there were some very clever subtle uses of it. Some of these may be lost on casual movie goers but I don't think they will detract from anyone's enjoyment of the film.\r In the end Warcraft is a solid fantasy film and one I recommend to any fan of the property. For die hard lore fans there are some changes made to the lore but they too never detract from this adaptation. If you are a casual moviegoer my advice is to just go into the movie with an open mind. Not every movie has to be a Lord of the Rings. I do hope we see sequels so that we can get the Lich King on screen someday."
    },
    {
      "rating": "10",
      "text": "As a Warcraft fan, I loved it.  Rest of my family, who have either little or no experience with the franchise, enjoyed it too. I don't understand the complaints from those who found it hard to follow - my kids, who didn't know Khadgar from Kil'jaeden, followed it just fine."
    },
    {
      "rating": "10",
      "text": "I have already seen the movie and it's \"EPIC\". They did such an amazing job on converting a franchise I love into such an incredible movie, as well as breaking the video game movie curse. Not only was it broken, it was shattered. The movie has everything in it so that fans as well as those that have never played any of the Warcraft games can enjoy the experience of seeing this movie. Don't listen to mainstream critics. IF you like high fantasy, chances are you will like this movie. You don't need knowledge of the games to enjoys this movie.\r Lok'tar Ogar! And. For the Alliance!"
    },
    {
      "rating": "10",
      "text": "Best movie EVER, and I want more!! Blizzard please don't listen to these noobs critics, they have no idea! We want more movies about other Warcraft characters!!"
    },
    {
      "rating": "7",
      "text": "I came into this movie expecting the worse, due to the critic reviews. I also came into Star Wars with low expectations despite critic reviews.\rIt would appear that user reviews are actually far more reliable.\r While I am familiar with the lore, I don't play the game.\rThe movie's setting is as complete as it can be without overwhelming the audience with names of kingdoms, characters, races, which is an impressive feat, I did not think it would achieve.\r If you are a hardcore fan, you might be disappointed in the lack of detail on the kingdoms/dranei/etc, but it makes it much more accessible to the general audience.\r The original lore is much more intricate and complicated, and it does a great job of giving a simplified adaptation, which means it’s also a little bit far from the original lore, but it does it fairly well.\r There are a lot of elements that are not fully explained, which from what I've read caused great anger from critics, who seem to have wanted to be spoon-fed every explanation.\rThat being said, while the movie is definitely internally-consistent, some of the missing details can cause confusion. It is like trying to collapse half a season of game of thrones into 2 hours.\r This makes it feel a bit rushed, but that's not on the actors or the direction, rather on how much they tried to squeeze in, making the writing a very difficult task.\rBecause of this, they lost a lot on character development and we don't get to relate much to Durotan or the Orc culture.\r The settings and art are beautifully done, the acting is adequate though limited by the fact that they couldn't develop that many characters concurrently.\rThe adaptation is impressive, albeit not loyal to the lore. It is worth noting that Warcraft lore is more of a history than a narrative.\r Critics never really gave the movie a chance, and if you read the reviews, you can tell how they never tried to understand it.\r Give it a chance, most questions you might have might at the end will be answered in the sequels"
    },
    {
      "rating": "10",
      "text": "I am a huge fan of Warcraft; played it for 11 years, I have a tattoo related to him and I met my husband playing it.. So I approached the movie with some fear.\rI must admit they made some big change lore related but they were well done: I am overall totally satisfied with the movie and I can't wait to see the next one! For Azeroth! For the Alliance!"
    },
    {
      "rating": "10",
      "text": "So.... this movie is awesome! Simple.... but its kind of tricky to rate the movie, because i feel people will think \"wow fanboy\" compared to the critics, yes I'm a fan indeed. Incredible. A world brought to life from two decades of imagination from game- playing. Tells a great story in a which encapsulates the humour and character of the games. A must- see for any fan of high fantasy, or if you've ever got anything out of Warcraft in the past, this will bring you right back."
    },
    {
      "rating": "10",
      "text": "As a WoW fan I think  this is an amazing movie and it is made for the fans. Yeah there are some plot changes but all the important events are still there, the CGI was amazingly done and I thought the acting was great as well. To the people who may not be fans I recommend going to see it and not listen to the critics, they are only hammering it so hard due to it being based on a very popular game series, for some reason it is \"cool\" to hate on popular things."
    },
    {
      "rating": "8",
      "text": "I didn't played a game, but i´ve seen the movie, and i kinda like it. CGI were not bad and the actors weren't bad at all. I hope there will be a sequel. 80%"
    },
    {
      "rating": "10",
      "text": "Amazingly good movie, best I've seen since Dr Strange. Great writing, avoiding many cliches, reasoned background and some truly unexpected events. The actors do wonders with this difficult material. Graphics and sound are top-notch. It's instructive to watch the deleted scenes - two that should not be in the movie made it into the Blueray, and two that would have added real value remain cut.Note that the blueray has issues on PS4 and Xbox with picking up after an interruption - all you'll get until you clean the internet cache is a black screen."
    },
    {
      "rating": "8",
      "text": "One fights for their new home and the others to defend theirs.\r I never played Warcraft game in my life, nor read comic book, but I enjoyed this new fantasy universe. Azeroth is the world where this story takes place. When the Orcs planet was destroyed, they use a magic portal to get to Azeroth and make a safe home. But that is where humans and other intelligent species live peacefully. A new race means a new conflict to solve the differences. So the battle commences at no time to gain the power to rule the land. Between the two great powers, who wins is the film to tell us in the rest of the parts.\r It was something like 'Avatar' and 'The Lost of the Rings' coming together. Despite having alien race, it is very much an action- fantasy film, not a sci-fi. From the games to film, it was awesomely made which is obviously a latest trend in the filmmaking. The graphics were good, but not perfect, and that's fine, because it succeeds to give the game look than the realistic one. I think that's the point, otherwise no disgrace to call it was inspired by the games or comic book.\r I know it is not a masterpiece like 'The Lord of the Rings', but there's a promise like the quality and story and its characters. There's no big names, but these actors who are known mostly for their supporting roles has given their best. Like I said I'm new to this Warcraft universe, so I don't know anything outside this film, but I'm kind of neutral on the war between the humans and orcs. Because one's world was destroyed and they're seeking a new home and the other ones are defending theirs. So everything makes sense from both the perspectives for their actions.\r This is just a beginning, there's lot more sequels to come. Though, it's a pity that it failed in America, the native product, but internationally proved it is one of best of its kind, I mean games to screen adaptation. The director of 'Source Code' did a great job and all the actors, including those motion-capture artists. I missed Zoe Saldana in this, to be as another blue or green skinned alien specie, instead Paula Patton did well in a similar role. The character name also very similar to the one from 'Guardian of the Galaxy'. I know it's going to get even bigger in the follow-up, so I can't wait for it. Hope it will release in less than couple of years.\r 8/10"
    },
    {
      "rating": "10",
      "text": "I've been to the theatre to see the movie twice which is something I may have only done one other time.  I am a fan of Warcraft which I am sure amplifies the movie enjoyment, however my girlfriend is not a fan and she actually really liked it as well, and she is even recommending it to her mom lol.  Go see it and judge for yourself, it seems that the critics are being pretty harsh for some reason."
    },
    {
      "rating": "10",
      "text": "Good thing someone is \"paying\" these critics to their job. And it is such a bad thing no one is paying us viewers to score the movie. But why do we consider this movie is something totally different than what the critics think is really strange to me. I advise them when they are payed to ruin something that they should watch if it is worth it of their reputation cause it comes with a price."
    },
    {
      "rating": "10",
      "text": "If you haven't seen it yet GO NOW. It was really damn good. If you have any doubts crush them now, it seems like the only gripes critics had were literally only in the first 35 mins yes the pacing was kinda funky in the beginning and some of the acting was a bit off but ONLY in that first 35 mins, while watching the movie I was thinking that literally maybe the critics didn't even watch the whole film and cut it off halfway because mid way thru the movie picks up and has really cool moments. The action scenes were brutal, the visuals were stunning and I even really liked the costumes and the set pieces yes they do look a little \"cartoonish\" but that's how the game looks! It's the perfect take on Warcraft the game and it leaves me wanting more. I want a sequel. Go support this movie don't pirate it don't stream it go buy a ticket and watch this film you will not be disappointed I promise you. It was the first time in a while I got up off my ass to the movie theater to watch a movie only other movie I saw this year was Star Wars and before that it had been years since I'd seen a movie in theaters. It's worth your time and money."
    },
    {
      "rating": "10",
      "text": "Wow, what a moviegoing experience. The film had a budget of $160m, and it really showed. The CGI was well done just like Blizzard's famous game trailers. The action was also well done, considering human actors were battling CGI orcs (though the humans often became CGI after putting their greathelms on). The environments were stunning. The overhead shots of great capital cities like Stormwind and the floating city of Dalaran were impressively detailed. The magicians' spells looked much better than Gandolf the Grey. The wolves, horses, and gryphons also looked spectacular. Overall, the movie was visually epic.\r The plot hewed closely to the original Warcraft video game's plot--which was a good thing, IMO. Due to the 2 hour time constraint, the movie moved at a dizzying speed and tried to cram in as much as possible. In the trade off between remaining authentic to the source material and cutting things to make the movie more watchable, Duncan Jones chose the former. And thank God he did. Fanboys of the world rejoice.\r A lot of casual references were made to Azeroth's characters and lore that required intimate knowledge of the game. When characters casually referenced the Redridge Mountains, Goldshire, Blackrock Mountain, Deadwind Pass, etc., I possessed a detailed knowledge of exactly what they were talking about (having ventured there many times myself), whereas casual babbies prob got confused. Same thing with all the names--Gul'dan, Medivh, Lothar--you get the picture. Same thing even with the jokes. Example--murlocs were considered a humorous enemy in World of Warcraft that made a distinctive gargling sound when attacked--the exact same audio recordings were used in the movie, which caused me to Løl Wüt.\r Some parts of the movie were predictable and uninteresting. A certain character died midway through. This elicited zero emotional response from me. I gathered early on that the only reason for that particular character's existence was to be slain to add emotional oomph to the movie. Judging from the music, the movie makers intended that scene to be quite dramatic. It failed entirely. But overall I was on the edge of my seat throughout.\r I loved the atmosphere at the theater--fanboys shouted \"For the Horde!\" at various intervals, and I of course responded with cries of \"For the Alliance!\" I definitely recommend seeing this one in IMAX 3D. It's the only way to do such a fantastic film justice."
    },
    {
      "rating": "10",
      "text": "The movie was awesome.  Beautiful settings, great music, lots of easter eggs for fans of the game.  Critics are idiots.  Listen to the overwhelmingly positive fan reviews."
    },
    {
      "rating": "8",
      "text": "This is in my personal opinion the best movie based on a video game franchise so far. I don't consider myself fan of Warcraft, Blizzard or Video Game movies in general but I think they did a great job in every aspect.\r The thing I like most about the story is that the producers didn't just want to try to please World of Warcraft players directly but instead cared about telling a kind of origin story for the whole series. In the movie you can see some nods and hints of characters and story that seem to lead to the events unfolded during the Warcraft III: Reign of Chaos game which is probably the most story focused Warcraft game.\r Regarding \"professional\" critics: In this era where it is so easy to land a job as a \"critic\" with even bloggers without any formal film education are being taken serious and are even calling themselves \"professionals\" 2016 is probably one of the most embarrassing years for these people, especially with fiascos like the Ghostbusters fake universal praise and the hate towards movies like Warcraft. I wouldn’t be surprised if in a few years Metacritic is entirely based on user opinions rather than on “critic” reviews."
    },
    {
      "rating": "10",
      "text": "I really cannot understand why the critics hate this film.\r The digital actors are the best ever. The orcs are the main characters and the emotions going through their faces are unbelievable. Truly fleshed out , awesome three dimensional characters.  The story is engaging, the action is awesome.\r This is the BEST movie based on a game."
    },
    {
      "rating": "9",
      "text": "I really enjoyed the movie.\r Awesome CG, great pace, nice combat sequences.\r Also, the lore and overall plot worked better for me than other titles like The Hobbit.\r And btw, not a fanboy of the WoW game. It is just my plain opinion :)"
    },
    {
      "rating": "10",
      "text": "Pretty darn good! It is as solid as any super hero movie of recent. The scope is kept manageable and has some beautiful special effects. Its a fun experience and worth seeing."
    },
    {
      "rating": "8",
      "text": "It did change up the original storyline from the RTS into the one presented by the MMO (which I thought the film pandered too much toward), but overall the movie was solid and I thoroughly enjoyed it. Saw it in 3D the night before release and the effects for the magic use was spectacular.\r Whatever the professional critics are smoking, they really should throw it away."
    },
    {
      "rating": "7",
      "text": "This movie is clearly for the fans. There's a lot going on and it's crammed into a tiny space. I can easily see how someone who doesn't play the games would be confused. Then the artistic style, while it scores high with anyone who plays the games it's so outlandish and cartoony that I could see it being a turn off for those who don't. Some of the acting was great like Durotan, Lothar and Medivh, but some was pretty awful like basically everyone else. It general it's the problem with video game films is that they try and fail to capture the scope of the game. They need to narrow their focus to a single narrative or this will continue to happen. You can't capture a 100+ hour gaming experience in a 2 hour movie.So why a 7? Cus for me as a former wc3 and wow player I loved the locations and how faithfully the universe was recreated. There were tons of props to fans with mention of locations like goldshire, redridge, elwyn forest and that murloc drop was awesome. The shot of Ironforge in the second scene made my hair stand up, I just wish we had returned there more. But again this is me with exposure to the universe. For any normal person this movie is sadly going to score pretty low."
    },
    {
      "rating": "7",
      "text": "I am a longtime player of Warcraft, first played Warcraft II: Tides of Darkness, then Orcs and Humans, Beyond the Dark Portal, and so forth, up until Warcraft 3. So, when the movie faithfully recreated the world of Azeroth, down to the near pixel perfect duplicates of the Footmen from the games, I was pleased, and first of all, I noticed. So, full credit there. The battles were good, faithful to the game, all that was missing was the hud, and cooldown timers. Having said that, the rest of the movie was unimpressive, in the way that the first film of a series often is. It introduces characters and gives a rough background. So, go see it, once, for no more than US$9 or local equivalent and if you can't avoid saying \"ready to work,\" or \"zug zug,\" you probably won't be sad. To the professional critics I ask, \"what you want?\""
    },
    {
      "rating": "8",
      "text": "I don't understand all the hate for this movie.  Yes I have played the games, but it only added small bonuses for seeing some of the iconic locations and characters.  It was a good fantasy movie in its own right, with great visuals, good pacing, and nice action scenes.  I hope there is a sequel or maybe they will decide to make a starcraft movie, which would also be great."
    }
  ]
}