{"id": 2271, "title": "Warm Bodies", "starring": ["Nicholas Hoult", "Teresa Palmer"], "runtime": 97, "genre": ["Horror", "Comedy", "Romance"], "description": "After a zombie becomes involved with the girlfriend of one of his victims, their romance sets in motion a sequence of events that might transform the entire lifeless world.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/pvVpl38YOBDOANb0pWbXFb8X3iZ.jpg", "categories": {"plot": 6.9, "acting": 7.0, "ending": 7.666666666666667, "soundtrack": 8.0, "cinematography": 7.25, "familyFriendly": 6.0, "funny": 7.041666666666667, "action": 6.333333333333333}, "reviews": [{"rating": "7", "text": "This is an extremely unique movie, something i'd never expected to exist, and it was very well executed here. The apocalyptic setting is convincing, the romance is absolutely believable, and the humor is enjoyable."}, {"rating": "7", "text": "I saw this flick with my girlfriend a few days ago and it was much better then i was expecting  interesting;even though slightly cliché plot that moves at a good pace The characters were nicely developed too, the small cast still held the movie high, but the female leads best friend (Analeigh Tipton) wasn't too great. Now even though this movie had heart and was decently funny, it does have zombies in it  and since it was rated PG-13 here in Canada  the movie would of been more believable if it had more gore in it  maybe not as intense as amc's the walking dead but more would be nice  i also would of gave it a higher rating if  incorporated  more action in the plot  especially near the end  but as the credit's rolled  the decent mix of romance and horror with a dash of action and comedy,  me and my girlfriend left the theatre enjoyed and received our moneys worth."}, {"rating": "9", "text": "Warm Bodies is riveting and fascinating, with tender romance and pleasant good time. It is absorbing, original, full of heart and sweet tale of unusual love between a zombie and a human being. This is a perfect movie for me to enjoy."}, {"rating": "7", "text": "Ever thought Romeo and Juliet was a bit stuffy, a little too formal and hard to relate to? Warm Bodies finds the perfect remedy, Zombies of course. R (Nicholas Hoult), a zombie who is remarkably verbose in his own head falls for Julie (Theresa Palmer), a human he saves when his pack of zombies attacks her and her friends who are scavenging supplies. The two begin to bond and realise that R is not like your conventional zombie and he could hold the key to reversing the apocalypse. Unlike any other zombie film including Zombieland, Warm Bodies has a powerful sense of emotion and understands one of the most important concepts/themes from all zombie films, the loss of humanity. The idea that its not just the zombies that lose who they used to be but the humans as well. This is something that is expertly handled in 28 days later and its surprising how Director Johnathon Levine manages to display this basic tenet of zombie lore just as well but in a completely different way. The use of flashbacks in the film is impressive as it does it in an original way while also giving the film a much needed back story  for Julie, a girl who is unintentionally soured by the apocalypse yet still has a light and beauty befitting a modern day Juliet, the Juliet Levine envisioned. R on the other hand is fleshed out through his own inner monologue, Levine's version of Shakespeare's soliloquies. This voice over gives a good impression not just zombie R but human R. However the monologuing gets irritating after a while as you become more invested in what he does instead of what he thinks, one of the main problems with Romeo and Juliet as a play as well. R spouts some great comic lines in his head but much of the comedy comes from his utterly uncomfortable actions in trying to become Julie's friend. The chemistry between Hoult and Palmer is good and overall Palmer is very impressive which came as a pleasant surprise for someone who watched I Am Number Four. Overall the film has very few flaws but even without flaws it doesn't wow in the way I thought it would or expected from the director of 50/50, one of the best films of 2011. Also the ending is incredibly rushed even though the film could have done with an extra few minutes to make the conclusion seem even remotely plausible. In fact the film just kind of ends, like this...."}, {"rating": "7", "text": "Turning zombies back into human beings as the healing power of pure human emotions. Simple skin deep symbolism in action. Soft watching. In any ways, it was the great pleasure for creators to shoot this movie."}, {"rating": "7", "text": "It won't slake your yearning for the next season of \"The Walking Dead,\" but \"Warm Bodies\" is a fun, quirky addition to the zombie genre. I admit that part of my interest was curiosity about what ever happened to that kid from \"About a Boy.\" (He's now tall & handsome, but retains that endearing quality.) The movie is kind of sweet, too, as it explores whether the undead are truly doomed. Not terribly profound  and not crazy/wacky  like \"Zombieland\"  but enjoyable in its way."}, {"rating": "8", "text": "By any mean not a masterpiece not even close, I'd say barely decent at best. But, but, for what it is I thought it played its strength well with a very likable cast and a silly but cute story. It reminded me of Silver Linings Playbook because its message which is basically the same thing: it's never too late to come back from the \"dead\" and be happy, in this case literally."}, {"rating": "7", "text": "A nice touch to all the zombie craziness circulating the movies these days. Funny, original, and sincere. This movie proves just how useful a soundtrack can add to a movie."}, {"rating": "5", "text": "Warm Bodies is a charming take on the romantic comedy formula with a nice soundtrack and two likeable leads and, sadly, not much else. It's mostly entertaining but there's a real lack of pace to the first half of the film. It shifts unevenly between trying to be (somewhat) deep and being absolutely candyfloss. Some characters are played seriously and others are super wacky. Considering the zombie threat the world is suffering, its amazing how quickly the girls come round to R being safe.\r There's worse films around and I enjoyed more in Warm Bodies than I disliked, it's just not interesting enough overall. I felt like it was a good first draft that needed more flesh on the bones (see what I did there?) If you catch it on tv you might enjoy it but as a trip to cinema there's far better fare out there. Or just save your money until next week."}, {"rating": "8", "text": "Very touching and emotional lovestory, finally not set in a fairytale world like every other love movie. Hidden social hints and black humour throughout the film make it a very enjoyable experience, especially for couples!!!"}, {"rating": "6", "text": "What a surprise this film was. So charming. Warm Bodies benefits from two excellent lead performances from Nicholas Hoult and Teresa Palmer; they carry this film nicely, but it's really the strong direction from Jonathan Levine (50/50) that makes the film work. Had someone else helmed the picture I don't think it would have been as effective as Levine's WB. Using concepts popularized by the likes of Twilight and The Walking Dead, Warm Bodies takes pieces of those projects to make a film that's highly entertaining and satisfying to a diverse audience."}, {"rating": "7", "text": "This movie is really great compared to other recent teen movies with the same unusual love story like the host or the twilight series, this one is way to better runs up to the top of your heart very quickly, fast paced with chilling scenes and great romance, but as a movie not compared to anything it is very good and funny, entertaining but not great."}, {"rating": "7", "text": "This is an above average rom com that is actually more self-aware than people give it credit for. A lot of reviews reference twilight, but few seem to really understand that this movie is in a lot of ways a tongue-in-cheek criticism of the whole twilight saga. Specifically, it's a direct jab at the ridiculousness of making the undead a love interest. Just look at the poster  the one with the female lead holding the male lead from behind. It even looks like a twilight poster!\r Apart from all that, the film handles itself quite well. The pacing occasionally slows down a bit, but gets itself on track quickly enough, and generally all the elements gel nicely.\r In short, this film is cleverer than people give it credit for."}, {"rating": "7", "text": "Warm Bodies is great fun, not only for Zombie fans but for any film lover. The film is very good on the pace of R an unusual zombie who lost his way. The film is very sweet and tangy, the middle of this juicy film the pace slows down and violence starts popping up. Then the sweet deal comes up, everything goes boom and the film hangs the viewers. But, dont be feisty- the film is really good."}, {"rating": "8", "text": "My 19 yr old daughter and I saw this last yesterday and we both loved it!  It was an original take on an old horror concept.  And as a self-proclaimed Zombieholic, I couldn't stay away!  Definately a fun movie for teenagers who haven't been conditioned to only enjoy blood, cuts and torture themed movies."}, {"rating": "7", "text": "Yes this movie has plot holes and there are certain things that just don't make sense, but I gotta say it was a good time.  It worked for me mainly because director Jonathan Levine who made the outstanding film 50/50 is able to make me believe in the romance between R and Julie."}, {"rating": "7", "text": "It's pretty cute, and the message is very endearing. Although it may be a bit unorthodox as a date movie, it's definitely one of the better romantic films to come out recently."}, {"rating": "8", "text": "Warm Bodies is a brilliantly original zombie story. I was afraid it wouldn't be as good, but as far as the storyline and the humor play-in together, it's really a warm-hearted love story that is perfect for the valentine's season, unless your girlfriend is terrified of zombies."}, {"rating": "9", "text": "Jokes aside this thing eats twilights brains. Its a compelling and cute zombie flick. Little bit of everything here. Horror comedy and romance. Give it a shot it isnt a 2 hour time sink like some movies."}, {"rating": "9", "text": "I liked this movie, thought it had action, romance, and some comedy although I wish they would have cured the zombies earlier so we could have seen Nicholas Hoult as a human longer but all in all it was good."}, {"rating": "6", "text": "Please don't take the rating of a 6 to be a bad thing, just compared to other films I have watched a 6 feels just about right for this film, which is good! it is brilliant for couples that want to sit back and watch a film. It has some real funny moments and quite a cool story. There were a few parts that got me abit bored, but it wasn't often. Overall, it's a good film and I recommend to watch it!"}, {"rating": "8", "text": "Warm bodies is a interesting take on a zombie flick me myself was kinda output by how they could have thought and become human again. Then i opened to the idea a bit and saw this was a cool take on zombies but if your a zombie movie watcher like zombie land or shuan of the dead you wont like this movie much but as i watched i learned that there are reasons behind there mindless killing and i kinda liked the idea and then we come to the romance in the movie its kinda weird to see it in a zombie movie but its more comedy so it works in the flow of it but one thing i have to say is it keeps you there till its overall conculsion and i even went back to watch the movie again so its a zombie movie with a new take and overall good story i didnt have any gripes with it besides the bonies they just seemed like minecraft skeletons on steroids and there are a few Why the  moments but still the movie was good"}, {"rating": "10", "text": "This is a great zombie love story. I do not think I have heard of this unique combination. The movie had a wonderful mix of love, humor, horror, and action."}, {"rating": "7", "text": "This movie isn't Twilight, in fact, it is better in so many ways, Warm Bodies is one of a kind, but is Warm Bodies perfect?! Almost. The Acting is way too better and the story scenes are really good, as a movie in whole. Absolutely YES!"}, {"rating": "6", "text": "Not as bad as I thought it would be. The movie sported a charming cast that really made the silliness quite acceptable. Even if you don't particularly enjoy zombie movies, like moi, you will still mildly enjoy this one. There isn't much of a comprehensible storyline, but that's probably not what movie-goers are looking for in this film."}, {"rating": "6", "text": "While its villains are weak and dialogue cheesy at times, Warm Bodies compensates by its sweet romance, energetic soundtrack, steady pacing and heart."}, {"rating": "9", "text": "A unique, brilliant hidden gem of a movie, Warm Bodies blends teen fiction, zombie horror, comedy, and romance in order to create a socially aware commentary and a great story. After things like Twilight, Warm Bodies is a fresh new start in the supernatural romance genre. The performances are fantastic. Nicholas Hoult absolutely steals the show, but Teresa Palmer more than holds her own, and she creates a completely believable and empathetic character. In supporting roles, John Malkovich truly shines, as does Dave Franco. The script is beautifully written. The cinematography is practical, elegant, and epic. The soundtrack is nothing short of inspired. If you are looking for a fresh romance, then please \"exhume\" Warm Bodies. It is well worth it."}, {"rating": "2", "text": "Mostly boring. I generally do not like Rom-Coms, but I do like comedy horror so I thought the bend might be watchable. I was wrong. The concept might have potential…maybe, but the execution here was abysmal. I could not get into this movie on any level. And that’s not just because the prolific musical interludes kept interrupting the story, if you want to call it that. The writing was blah, the acting was mediocre, and the pacing both monotonous and jerky. So the dood is dead, but is also capable of higher order thinking and self-reflection. The girl’s character kept bouncing around like she was three different people. There really wasn’t any horror, the comedy wasn’t funny and the romance was absurd."}, {"rating": "8", "text": "I'm surprised. The movie doesn't focus on the girl, like all the other pictures have done, this film represents the supremacy of love, and heart changing, it's funny, enjoyable and touching."}, {"rating": "10", "text": "I went into this film with high expectations and was not disappointed. It gives us a good mix of Comedy/Horror/Romance to make a new genre! ZomRomCom! Nicholas Hoult is outstanding as R, who slowly starts to become human again. There is such a nice mix of the three genres to have something for everyone to enjoy, and you are more than thoroughly entertained the entire time you're watching. Overall I was more than impressed and will highly recommend it to anyone up for a quality film this year!"}, {"rating": "8", "text": "A cheesy, predicable, zombie love story. That actually works! funny as that sounds. But the movie, has this its own charm. Pleasant to watch, likable characters. I enjoyed watching it!"}, {"rating": "9", "text": "Honestly better than expected...I usually rely on Metacritic faithfully but I saw this one anyone. It definitely deserves at least a 70 rating on here, its a fresh twist on an otherwise worn down subject (walking dead, twilight, etc). The acting wasn't superb, but the narration really kept the movie and the comedy flowing. Not to mention, the soundtrack was one of the best I've heard in a while."}, {"rating": "9", "text": "Nicholas Hoult gives a charming, career-making performance as a zombie dude who falls for a human woman. The post-apocalyptic world is populated by the undead. The humans hide behind a big wall, except for one blonde who gets trapped on the wrong side. Houllt's blank comic manner and sweet charisma combine with his cuteness to create a lovable character. The script has plenty of humor and only drags for a few moments. Jonathan Levine, who succeeded in combining cancer with comedy in \"50/50,\" shows a knack for staging offbeat jokes. This is a romantic comedy, not a horror film, but its charms make it a DEADpan delight."}, {"rating": "6", "text": "This movie was good.  Certainly not one that people will be talking about for years to come, or even anything that necessitates a second watching.  It was entertaining, and really, what else do you need?\r Of course the plot is far-fetched, but, let's remember, we are talking about a movie that contains zombies to begin with.  The problem that I had with it was simply that things seemed to work out a little too easily.  There did not feel like there was really any real drama, or any chance that things weren't going to work out.  If you can forgive the convenience of how easily things work out and just enjoy the show, it is fun to watch.  Also, how many times did they have to walk past that same old Buick Riviera?\r All in all, Rob Corddry did a great job.  The acting on the whole was not that bad.  Special effects were about as good as you could expect from a Summit movie.  It was just a cute little movie."}, {"rating": "4", "text": "Are all zombies cursed with lock-in syndrome, or is it just R., a jarringly articulate walking corpse, whose interior monologue indicates a cognitive ability to love that belies the grunting and monosyllabism? Wandering aimlessly through an airport that has long-past outlived its usefulness, R.'s inner voicings of alienation(\"Why can't I connect?\") and self-loathing(\"...so pale.\") uncannily echoes Charlie Kaufman in Adaptation, whose opening can be gleaned in Warm Bodies. The word \"adaptation\", here, is applicable in the biological sense, referring to the existential struggle of transitioning from life into death(heretofore only implied in Dawn of the Dead, where the zombies faintly recall the consumer culture of the living, converging on a shopping mall in parodic imitation of their former selves) and the angst that comes with post-death, whereas in Adaptation, it's a literary term: Kaufman's fruitless attempt to transform words into images from a non-fiction work about flowers. Guided by Charlie's tortured agency, the film's conceit that his screenplay and resulting film are occurring concurrently, gets thrown into chaos, when Kaufman's identical twin hijacks the narrative and turns Adaptation into some cheesy action picture. Donald is a hack, a Robert McKee disciple, whose tenets are a counterintuitive affront to Charlie's iconoclastic-minded psyche for non-formulaic screenwriting. Similarly, in Warm Bodies, despite the film's lack of self-reflexivity, two zombie narratives: one that demonstrates fidelity to the genre, and the other, while not the work of a maverick by any means, does humanize a historically malevolent monster whose inner life has rarely, if ever been explored, seem to emanate from two sensibilities at odds. A \"bony\", on one hand, is your standard issue zombie, engaged in the singular activity of unrepentant cannibalism, but R., conversely, while sharing the bonies' overriding appetite for human flesh, is a corpse with scruples, a corpse who feels conflicted about his bloodthirsty nature. Akin to Charlie attending a McKee seminar on screenwriting, selling out his guiding principles so he can finish adapting The Orchid Thief, R. watches a zombie, his compatriot, turn into a bony, ripping the flesh right off the bone: a two-fold adaptation that first, shows how taxing a conscience can be, as the decomposing man gives up on the idea of being nearly human, and second, on an intertextual level, like Adaptation, kinesis takes precedence over languor, or rather, Warm Bodies grows increasingly Hollywood in form and content. A bony, after all, is a zombie who adapts to the concept of death; it desires none of the earthly pleasures, but to eat. As a filmic metaphor, the self-mutilating zombie can be reconstructed as a Charlie figure, tearing himself apart as penance for using Donald's ideas to finish his shooting script. Charlie, in essence, is a zombie, sad and alone, more dead than alive. When R. intones, \"Don't be creepy. Don't be creepy,\" as he approaches Julie, the girl he keeps captive in his tarmac-situated home, a converted airplane, the moviegoer can imagine the hoody-cladded young man's analog, the bipolar writer, chanting the same mantra as he flirts with the diner waitress whom he wrongly invites to an orchid show. R., however, wins Julie over, in due part because he eats her boyfriend's brains. Here, the film borrows from another Kaufman/Jones collaboration, Being John Malkovich. On a subconscious level, Julie can sense Dave's presence behind R.'s eyes, just like how Maxine would know whenever Lottie was occupying the famous actor's body. By snacking on the dead beau's grey matter, R. collects his memories, thoughts, and feelings, which makes the zombie more like Dave than himself. So strong is Dave's aura, Julie allows R. to occupy the same bedroom in an abandoned suburban house. If Julie gave necrophilia a go, would R. stand for \"rapist\", since the faux Romeo, unbeknownst to the girl, is a conduit for Dave's ghost. Nevertheless, R. is a zombie in love, signified by his heart turning red, the same hue perceived by an ideologically pure boy from a 1950s television series, who discerns the rose's true color after having just made love to a real girl. Arguably, Pleasantville is a zombie film, a latent one. In the aftermath of the girl's mother experiencing sexual pleasure for the first time, she hides in the kitchen, embarrassed by her flesh tones and ruby lips. Afraid of what her monochromatic husband may think, with Bud's help, she acts in a reactionary manner, using black and white makeup to conceal the newfangled vividness. But she's alive, like R. is alive. Contextually speaking, you can't go back to Night of the Living Dead, the 1968 George Romero original, whose zombies now seem one-note and monotonous, just like a sitcom housewife of yesteryear. To answer R.'s friend's question, the mother feels it. Life after death."}, {"rating": "7", "text": "Otherwise known as Romeo and Juliet in Zombie Apocalypse, also despite the overwhelming Twilight vibe oozing from it, Warm Bodies is a funny undead flick and quiet charming in its wordless execution. Its self-aware lightly toned comedy composes lay back youthful attitude in the form of a zombie's monologues and his deficit on vocabulary. The antique plot may seem rigidly predictable, fortunately it has some freedom on delivery, making it a fresh tongue-in-cheek dystopian humor since Shaun of the Dead and Zombieland.\r Nicholas Hoult as R, is a good pick for the lively-minded undead protagonist. He has tall thin frame and apparent cheek bones, making him a believable zombie after a few touch of pasty foundation, all while cosplaying as the latest apparition of Dante. To his credit, this role suits him perfectly, he has minor motions that are cleverly stiff and humorous, which fits the novel sensation of courting living female. It's amazing that with much scarcer lines, he triumphs over his role as the recent Jack, the digital giant killer.\r Julie, played by Teresa Palmer, is your typical blond gorgeous chick. She moves rather well, although not full blown action star yet, but she makes for a convincing role of someone who grows up in cryptic world with daddy issue. Her emotions are expressed gradually, she has natural ambiance and it will attract the young audience, and even if she didn't stand out much in acting department, her looks elevate her performance. John Malkovich as the source of Julie's daddy issue is emotionally imposing. He has the air of someone you don't want to mess with, standing near to antagonism.\r Graphically, it's captivating. The world after zombie virus is depicted with great cinematography, barren gray dye, and still pertains few of its charms, which are subtly placed beneath a crumbling civilization. The set might be grim, but it doesn't depress, landmarks and trivial places have distinct salvageable atmosphere to them. Its use of make-up and wardrobe is simple, most often lacking color as R's red lackluster jacket, it emphasizes the little humanity left without going full zombie.\r CG for skeletal extremely-dead undead is rather plastic, it's obviously fake. There are some plot devices that are set conveniently as well. Details like these might not ruin the enjoyment, but they still register as annoyances. Warm Bodies is a quirky amusing twist of old ideas, it is wittily written and warmly entertaining."}, {"rating": "7", "text": "Although it is nearly brought down by a significant amount of plot-holes and some inconsistent tonality, \"Warm Bodies\" endures as a delightful and amusing twist on the classic horror subgenre thanks to a few resolute performances, some interesting stylistic techniques, and a mostly enjoyable story at its center."}, {"rating": "6", "text": "\"Warm Bodies\" is a nicely directed post-apocalyptic love story--that is at the very least--a fresh approach to a zombie film that is fully realized, and flushed out to satisfaction. \"Warm Bodies\" is a light comedy, which is often witty and consistently enjoyable. Levine's latest is well shot and possesses impressive production values. The film lacks any real thrills or major conflicts, but the romantic and comedic aspects are pleasant and effectively delivered with fine all around performances, while Jonathan Levine exhibits his skillful abilities behind the camera.\r Written and directed by Jonathan Levine (\"50/50\"), and adapted from the novel by Isaac Marion, \"Warm Bodies\" takes place in a post-apocalyptic world, following a plague that has wiped out millions. The remaining humans live behind a wall, surrounded by soldiers led by the human leader Grigio (John Malkovich). Meanwhile, the zombies mostly shuffle around an abandoned airport, only making occasional trips outside to feed on the living. Nicholas Hoult, our protagonist zombie named R, is amusing--stumbling and grunting his way around the airport. R explains his feelings in the voice-over narration, so the audience is always aware of his dreams and desires, and what is actually possible. When he meets Julie (Teresa Palmer), he is at the ultimate disadvantage  he's dead.\r On a feeding encounter with a human gathering party, R meets Julie and feels an urge to protect her. This sparks the beginnings of a strangely warm relationship that causes R to start to regain his humanity. As this change spreads throughout the undead population, Julie and R eventually find they are facing a larger issue--even as their friendship is challenged.\r \"Warm Bodies\" lacks the ability to surprise, which makes it seems longer than it. However, Levine does a good job with the screenplay, balancing the right amount of fun and romance, as well as human dialogue with 'zombie talk.' Simply put, \"Warm Bodies\" is heart-warming and charming, when it could easily have been a romantic zombie disaster."}, {"rating": "9", "text": "The only thing I knew before seeing this movie was that it had something to do with zombies, and that the movie got fairly decent reviews. My expectations weren't too high, and to be completely honest, I ended up really enjoying the movie.\r 'Warm Bodies' deals with the possibility that perhaps in some other universe similar to our own, where zombies parade the streets, there can exist a specific entity that is so infectious that it could even reverse the effects of a zombiefying virus... that entity being, of course, an amalgam of love and compassion. We're often led to believe by a large majority of zombie films that once a human has been transformed, all hope is lost. The opposite concept is presented in 'Warm Bodies' and I think it's a nice change of pace from the usual kill-all-zombies bloodfest.\r The two main characters were amiable and believable, and the overall production was well done from set pieces to camerawork to music. Slow in pacing at times? Sure, for a zombie movie, but I appreciated the scenes where we got to see the relationship between the two main characters develop. I will say that I only wish Rob Corddry had a larger presence in the movie. He's a funny guy, and it wouldn't have hurt if he'd been given more screen time.\r In conclusion, although this movie does require moviegoers to make a certain leap of faith in assuming love can overcome anything, I think that a suspension of disbelief is helpful in truly being able to enjoy the heart that this film has to offer. Viewed from that lens, this movie is a heartwarming reminder of what makes humans... humans. Some critics might deem this zombie flick a \"wussification\" of the zombie genre, and to them I say that 'Warm Bodies' is definitely not the conventional zombie movie, but that is the exact reason I enjoyed it. At the end of the day, what matters to me most about movies is that the story was well told, that I walk away from the film having learned something, and that I had a great time. On those terms, 'Warm Bodies' is definitely an impressing entry into the zombie world of entertainment."}, {"rating": "10", "text": "It is a masterpiece mixed with a critical social very hidden. I loved and how many will love too. One of the best movie of the year.  The film has a nice pace, with a bit of romance and a lot of action. Is just surprising. Exceeded my expectations"}, {"rating": "0", "text": "This movie makes Twilight seem like Citizen Kane. Easily in the top 10 worst movies I have ever seen. How did this script even get the 'green light' to get produced? How on Earth did the critics rate this about the same as The Hobbit? Just as one example of how inane this movie is. .it starts off with the Zombies being unable to talk or communicate other than grunts and rare single words, but suddenly they are all chatting it up with full sentences spoken slowly with broken English, including Rob Cordry and the lead actor. Also, the Zombies can smells humans inside buildings, but when it comes to the female lead, as long as she acts like a Zombie, she can walk amongst them if she is with her Zombie boyfriend. An intellectually offensive movie."}, {"rating": "2", "text": "Maybe I missed the point of the movie, but this sends a terrible message. Sort of like Forrest Gump with its advocacy of stupidity. I'm sorry but its not okay to be a moron. Just like the silly Twilight junk, we have another case of a dumb young girl and a boy who is wrong for her, not just wrong but biologically wrong, like science and stuff. Of course, for the children who run Hollywood, that is ok. Sure why don't we all hook up with zombies...nothing bad can happen then. I'd tell my daughter, \"Yes, I'm sure he's a nice boy but don't let him eat your brain on the first date. Save that for Marriage.\""}, {"rating": "1", "text": "Warm Bodies was a huge disappointment.  It was another film I went into with low expectations, and was still let down.  The trailer is very cute and perhaps if this were a 60 min tv show on MTV it could have been more bearable.  It had some cute moments, but again, not enough to warrant the hefty ticket price."}, {"rating": "3", "text": "Extraordinarily slow and weak.  It's the type movie that is squarely in my wheelhouse  I should have liked this. A waste of Malkovich.  And the bonies?  Check out Tom Chick and crews's rundown at Quarter to Three  they encapsulate to the gist of my feelings on this film. Even Rob Cordry can't get it done here.  They break all the zombie rules, and in doing so, it becomes ridiculous."}, {"rating": "8", "text": "Something for everyone. Took my teenage daughter and her friend and we all really enjoyed it. There is comedy, action, horror, drama, romance. It entertains on all fronts. Was it some serious critically acclaimed masterpiece that will pull in all the awards?... no. Who cares? Enjoy it for the good time it is."}, {"rating": "10", "text": "I've seen many great zombie comedy movies like Zombieland and Shaun of the Dead, but Warm Bodies is definitely one of the best movies of 2013. The movie was awesome. I was like I have to wait for the new Die Hard movie instead of watching another flop from any Expendable lead actors (Stallone, Schwarzenegger, and Statham). But now as the Super Bowl is about to begin, Warm Bodies may be the better Super Bowl movie than last year's Chronicle. I wish I was a lonely zombie like R (I don't know what R stands for in his name, probably like Robert as in Robert Pattinson). But I would love to see more zombie rom-coms in the future. I love Warm Bodies."}, {"rating": "9", "text": "A movie has to do something extraordinary to get a 10 or something completely abysmal to get a 0, so while I can't give Warm Bodies a 10, it definitely deserves a 9. I think critics are way too hard on this movie, as it seems they are with most movies. The movie is a witty, warm, heartfelt movie that provides a small amount of action, a decent amount of comedy and a good amount of romance. It's unique and fun to watch how everything plays out, and it's well acted all around. Nicolas Hoult, Teresa Palmer and Rob Corddroy played the roles well. Overall, it's a great movie and I wouldn't give these critics half a listen anymore."}, {"rating": "10", "text": "A fantastic and freash take on the entire Zombie genre as a whole, it exposes a more human side to the life of the walking dead. When one of them refuses to give up their last ounce of humanity, they discover love in the ranks of their enemies."}, {"rating": "0", "text": "This movie is the zombie version of Twilight. The mythical view of vampires have been ruined and now the same fate has bestowed zombies. Do not let the high user scores fool you. They will most likely be from the adolescent female crowd of Twilight fans."}, {"rating": "10", "text": "Good performances, good scenes, and sometimes, funny, good pace and a great social critic, makes the film one of the biggest films of this year. I gave this note (10) by a combination of factors that made ​​the movie. The soundtrack was one of the best in years and may ,or not, be well praised by all. The movie will surprises everyone. That's what I say."}], "recommendations": ["love_and_monsters", "colossal", "color_out_of_space", "maggie", "us", "ready_or_not", "28_days_later", "okja", "annabelle_comes_home", "the_fly", "the_girl_with_all_the_gifts", "ouija_origin_of_evil", "signs", "pride_and_prejudice_and_zombies", "daybreakers", "chappie", "gremlins", "the_good_dinosaur", "splice", "constantine", "the_house_with_a_clock_in_its_walls", "swiss_army_man", "bumblebee", "turbo", "it"]}