{"id": 3832, "title": "We Are Your Friends", "starring": ["Zac Efron", "Wes Bentley"], "runtime": 96, "genre": ["Drama", "Music", "Romance", "Comedy"], "description": "Young Cole Carter dreams of hitting the big time as a Hollywood disc jockey, spending his days and nights hanging with buddies and working on the one track that will set the world on fire. Opportunity comes knocking when he meets James Reed, a charismatic DJ who takes the 23-year-old under his wing. Soon, his seemingly clear path to success gets complicated when he starts falling for his mentor's girlfriend, jeopardizing his new friendship and the future he seems destined to fulfill.", "releaseYear": "2015", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/k8SfiPoh3zUkDpHOT22ATegS2FU.jpg", "categories": {"plot": 5.285714285714286, "acting": 5.5, "ending": 4.0, "soundtrack": 6.333333333333333, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.0, "action": 4.0}, "reviews": [{"rating": "8", "text": "\"We Are Your Friends\" é um filme agradável e bem dirigido, com um ambiente de drama e com uma trilha sonora eletrizante. A atuação é satisfatória.8/10"}, {"rating": "10", "text": "Muy entretenida y una historia que se siente muy real. Perfecta y traza un camino a nuevos djs"}, {"rating": "10", "text": "best movie of music electronic best movie of the world this movie mercing a oscar"}, {"rating": "5", "text": "This is going to be a review of two films, the first being the movie I saw on the screen called “We Are Your Friends” and the movie I was making in my head called “Wes & Zac, Where From Here?”\r “We Are Your Friends” is about a DJ, his 3 friends and electric dance music, learning more about the latter than I knew or need to know but, as I have found lately with a few movies, that is more a generation gap than anything else. Incorporated into the movie is a lot of ‘eye candy’ of both sexes along with a screenplay by the director Max Joseph and Meaghan Oppenheimer based on a story by Richard Silverman. It’s an old story offering very few surprises along with an unnecessary ‘aw shucks’ moment during the end credits. Joseph does add a few musical and southern Californian collages that are eye catching and like other films recently, including last week’s “The Diary of a Young Girl” plus last year’s “Birdman”, also uses animation.\r Aside from his good looks Efron hasn’t impressed me yet with his acting though to be fair I have only seen him in 3 films and he does have an impressive scene talking about how a DJ works the crowd. His friends played by Jonny Weston who wants to be a club promoter, actor and drug dealer played by Shiloh Fernandez and Alex Shaffer as the hanger on nerd offer good support. Wes Bentley is a has-been DJ living off his past and has a younger girlfriend, Emily Ratajkowski, with the latter basically in the pretty girl role.\r “We Are Your Friends” was an interesting movie from the point of view I knew nothing about how electronic computer music is made and, of course, nothing wrong with eye candy. It was also interesting for the ‘second movie’ I watched in my head.\r When I saw Wes Bentley, September, 1999, when he was 21, in “American Beauty” I walked out thinking “Wow! This is the next generation’s Kevin Spacey!” For the next decade he descended into the world of drugs admitting he made movies only to make money for drugs. He is 37 today, has been clean since 2009 and between his appearance in a Broadway play in 2010 and playing Seneca Crane in “The Hunger Games” in 2012 he has been working his way back but he lost the momentum of stardom that pursued him 16 years ago.\r Zac Efron had his breakout role in “High School Musical” in 2006 followed by the movie version of the Broadway musical “Hairspray” when he was 19 and 20.  In 2013 at the age of 26 it was reported that he completed an alcohol and substance abuse program. Now at 28 will he have a decade unlike the one Bentley had? Did Wes talk to Zac and give him advice and/or did Zav ask Wes what happened and how could he avoid the same mistakes?\r Now that’s a film I would like to see---and make!"}, {"rating": "6", "text": "Featuring stellar performances but uneven drama, We Are Your Friends might be the perfect end-of-summer story, yet it suffers from card-board cutout, insufferable characters."}, {"rating": "3", "text": "I don’t think there is anyone in the world that actually thought this was going to be a good film after watching the trailer, and its not good at all. I think this story is impossible to care about. It is just a plot that very few people have any sort of interest in. This movie has way too many things going on for a film that is less than 100 minutes long. There are too many storylines and two many characters that take away from a simple overall story and finally by the third act the film is just a complete mess. Jon Bernthal is also thrown into the mix in this movie and he has no reason to be there, plus we have Cole’s friends who are annoying for most of the film and just become so generic.\r There are really no awful performances in this film. Zac Efron and Wes Bentley are both fine in their roles and the scenes with the two actors involved where the best in the movie, but it is Emily Ratajkowski who steals the show. I almost feel bad for these actors for making such a terrible choice in a project. The script is just so weak and swollen that by the ending of the film the characters really aren’t much further than where they started."}, {"rating": "10", "text": "شراء الاثاث المستعمل بالرياض\rارقام اثاث مستعمل بالرياض\rشراء اثاث مستعمل الرياض\rشراء الاثاث المستعمل\rمحلات شراء الاثاث المستعمل بالرياض\rمحلات الاثاث المستعمل بالرياض\rشركة شراء اثاث مستعمل بالرياض\rحقين الاثاث المستعمل بالرياض\rشركة فرسان المملكه"}, {"rating": "5", "text": "Not a bad movie at all - just one lacking any serious ambition.  I enjoyed it, but on a very modest level.  Ratakowski and Efron are terrific as the leads, actually.  It doesn't try to be anything more than what it is."}, {"rating": "9", "text": "Incredibely well-directed, even with some script flaws, 'We Are Your Friends' is good and funny, always with a drama ambient, good photography and a blasting soundtrack. Zac Efron has done a great job in here acting, the same about Max Joseph's direction! RECOMMENDED!"}, {"rating": "1", "text": "Filme mediano, e de péssimo gosto, é um conjunto de tudo sem noção que acontece no meio de alguns 'jovens', como drogas, overdose, uma triste realidade, e que no filme se mostra confuso além de traições entre namorados, 1 ponto pela beleza do Zac efron"}, {"rating": "9", "text": "Basically the perfect summer movie, this lightweight drama has a great-looking cast and plenty of youthful energy, but not much authenticity or depth.\r Watch this movie for free http://www.watchfree.to/watch-2a440f-We-Are-Your-Friends-movie-online-free-putlocker.html"}, {"rating": "4", "text": "Eu sinto que aqui há um potencial muito desperdiçado, sendo uma experiencia entre erros e acertos que não conseguem levar o longa até onde ele precisa.O filme gira em torno de 3 personagens, e os demais secundários não tem uma importância tão significante. O filme tenta significar cada um, e por mais que o resultado seja satisfatório, ele não faz sentido, soando forçado. O personagem de Zac Efron é negligenciado no desenvolvimento, o que destoa do senso de empatia necessário para fazer o final do filme se tornar único e tocante - como planejado. Wes Bentley se encontrou bem no personagem, convencendo e tendo um desenvolvimento mais significativo do que o próprio protagonista.A cinematografia é simples. Não há muito bem direção de arte afiada, o que considero interessante para um filme do gênero, ainda mais com desenvolvimento direto sendo negligenciado. As posição das câmeras lembra uma serie de tv convencional.E no final de tudo, a influencia da musica sobre tudo aquilo não é o suficiente para tocar o público. Nós, apaixonados por musica, sabemos muito bem da tamanha influencia que ela tem sobre nossas vidas, mas o filme não consegue chegar lá, mesmo tendo um plot ok - que infelizmente se perde um pouco com o tempo, visto que a técnica de usar elementos cotidianos já é demasiadamente usada, apenas com algumas aplicações inteligentes em gêneros específicos.Audio: English, with Portuguese subtitles. Q60T 50' TV Speakers [Dolby 5.1]Quality: 1080p SDR [Netflix]"}, {"rating": "6", "text": "Zac Efron plays an eager DJ, who's trying to break into the hot LA scene of electronic music. He hangs with his boys, hits the dance parties and enjoys the inevitable drugs (highlighted by a cool animated trip). The filmmakers have gone for the MTV audience with a playful structure, quick cuts, on-screen graphics and plenty of EDM (most of which didn't stand out). The plot is completely useless and the performances don't add much value. Scenesters will either rave (pun intended) or scoff at the shameless pandering."}, {"rating": "6", "text": "I should really put this under \"Most Overlooked Movies of 2015\" because it's tough for a film that didn't connect with the audiences attention causing it to be one of the worst opening movies to garner less than 2,000 or more theaters. So yeah, I didn't get it with the story and it's confusing trailer alone, but I think this is the perfect movie whether you're an EDM fan or not. \"We Are Your Friends\" may have lacked charisma for a reality MTV-less generation, but I think Zac Effron did a great job. But the reason why it flopped is because Effron hasn't made any friends just yet and he's still not a talented A-lister just yet. Maybe one day. But I should wait for it on Netflix and see how it goes."}, {"rating": "7", "text": "Interesting insight to an industry, with Zac Efron playing a likeable lead. It's nothing special, but enjoyable enough."}, {"rating": "4", "text": "About an aspiring DJ and his friends circle.I've never seen any actor worse than Zac, yet he keeps making films. That's not it, so far he had failed to take the right project to work with. His films are either having no story or a silly concept and his roles among the worst. I could have liked this film if it was done by some other young actor. It looked a decent storyline on how an aspiring DJ is fighting to make progress. Living with his friends, then suddenly an opportunity knocks and followed by some issues surround it that should be solved to see the success in his passion in the music. So the remaining is to reveal how the things go on for him.Too slow narration, and it is being a music genre, a little soulless. Yeah, there's no rhythm. All we have seen a DJ while performing, but what his life would be like is what this film was focused on. Directional debute for a documentary filmmaker and he should make a couple of things right for his next film, including casting right actors and preparing an engaging screenplay. Some people might like the film, but not for me. This is completely an ignorable film.4/10"}, {"rating": "8", "text": "The strongest point to this movie is acting. I loved how the characters were delivered. The soundtrack is fantastic and the only thing that can get better is the story. You're bad. You meet someone and he gives you some advice. then you screw his girlfriend but he forgives you. After that, you write a perfect song. It was cliche but overall I really liked this movie and it was a great experience."}, {"rating": "7", "text": "You've seen this story before but \"We Are Your Friends\" does an admirable job of retelling it.\r It's a classic coming of age tale within the empty pursuit of fame. You've got a heaping helping of millennial naïveté and a dash of jaded LA dream killers.\r I genuinely liked these people. The whole thing is enjoyable enough and actually manages a bit of emotional resonance.\r It's not brilliant but it's worth the 90 minutes."}, {"rating": "5", "text": "Although the music is so stellar, the film itself has one problem. It starts off with so much energy and by the last half and hour, aside from the ending, lost all of it."}, {"rating": "6", "text": "What I want to say is that the movie is actually good and they have good actors but the fact that Zac Efron isn´t a Dj doesnt help and the data of the realese and the propraganda were bad, since it was a movie about a dj they could have rent a stage on Ultra music festival."}, {"rating": "4", "text": "The movie felt dry and the whole concept of this movie is fine but it fails when it tries to give you an interesting idea of the story. Zac Efron's character isn't as interesting as you think, although he gave it all he got to stay in character which he did..Kind of.. I do like the idea of a movie about a DJ who isn't a typical DJ, but a high rated type DJ. The only issue I got with this film is that it isn't as good as I thought it would  be. I will give it a 'FOUR' for the music, which is wild. That's all the movie offers."}, {"rating": "8", "text": "Este filme foi incrivelmente bem dirigido e, apesar de existir alguns erros no roteiro, \"We Are Your Friends\" é um filme engraçado, com um ambiente de drama, com uma boa fotografia e com uma trilha sonora eletrizante. O ator Zac Efron e o diretor Max Joseph fizeram um trabalho fantástico neste filme."}, {"rating": "10", "text": "I have watched this movie 5 times, in my native language and in the original, which means that this film is definitely worth watching if you are a fan of EDM, this film is my favorite since childhood, the first time I saw it when I was 12 years old. with LA Dream, California parties and so on. 7 years later, yesterday, I watched it again and I enjoyed it like the first time, however, I've watched it 4 times before and I know all the lines. The first time you watch with interest, and from the second you start to enjoy the music, all the songs from the movie are in my playlist, they are amazing. The main thing in the film is the songs, and as I said, if you are an EDM lover, you will definitely like it. The actors are perfect too, how these 4 friends live together and go all the way through all the hardships, finally doing the job they love in the end, and the chemistry between Cole and Sophia is awesome.  The film is very dynamic, it is short that you can watch it on a Friday night after a hard work or school day, during the movie you will not think much about the plot, because the plot is not difficult, you can just relax and feel songs, actors, and chemistry."}], "recommendations": ["yesterday", "the_lucky_one", "there_will_be_blood", "mamma_mia_here_we_go_again", "begin_again", "tomorrowland", "hustlers", "hairspray", "pan", "chef", "aquamarine", "inherent_vice", "sing_2", "the_irishman", "ghostbusters", "minions_the_rise_of_gru", "vanilla_sky", "we_bought_a_zoo", "bohemian_rhapsody", "the_gambler", "all_eyez_on_me", "the_disaster_artist", "passengers", "into_the_woods", "pitch_perfect_2"]}