{
  "id": 407,
  "title": "We Can Be Heroes",
  "starring": [
    "YaYa Gosselin",
    "Lyon Daniels"
  ],
  "runtime": 97,
  "genre": [
    "Action",
    "Fantasy",
    "Family",
    "Comedy"
  ],
  "description": "When alien invaders capture Earth's superheroes, their kids must learn to work together to save their parents - and the planet.",
  "releaseYear": "2020",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1S21HpcKY6uQ9UAw68aICmrJaq6.jpg",
  "categories": {
    "plot": 0.0,
    "acting": 0.0,
    "ending": 0.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 0.8,
    "funny": 9.0,
    "action": 0.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "This is probably my 2nd least favorite movie of all time, I know this is a **** Robert Rodriguez film and I shouldn't be getting so uptight but I'd rather saw my balls off with sandpaper than watch this **** I have a great nostalgia for spy kids and sharkboy and lavagirl so I was excited to here a new film and especially one with Sharkboy and Lavagirl and everyone saying the film was a sequel somewhat but it's clear that it was bull****. They do nothing for the plot and the whole \"oh they have a kid thing\" doesn't excuse it either, they do NOTHING at all for the film. The only reason why they probably had Sharkboy and Lavagirl in the film was because they probably finished the the script and started production and realized that the no one would watch or give ****s about the film the way it was, so decided to nostalgia bait people with the two into watching the film. Like Sharkboy doesn't even say anything during the entire **** film and either way their in the **** film for a total of like 4 minutes so yeah. Now as for everything else its just as bad, the acting from all (especially the children) is either unemotional or bland, the plot boring beyond belief and moves way too fast, to the point where my I thought my spine had shattered from a scenes progression I thought I was **** paralyzed. The characters are all so boring or generic along with the plot I almost fell asleep. The ending makes no sense whatsoever based on the events in between the action of the main parents/heroes and seems only to be their to force a moral message. The action and fight scenes are so boring and fake that I've seen bread toasting in real time with more intense action. And finally the CGI where, in 100% unironic honesty looks worse than Spy Kids 3-D, which at least with Spy Kids 3-D the cgi had somewhat of a charm with its look, giving off the child sense of mind and wonder that the first 3 Spy Kids and Sharkboy and Lavagirl films had done so well. In this film it's so bland and unpolished it gives off none the charm whatsoever and is so obliviously bad. Overall this film is 2 and 1/2 travesty's worth, and I would not recommend it in the slightest, its makes Spy Kids 4 look like The Godfather. I just hope that no one ends up having to grow up with this film instead of all the other Rodriguez films (except Spy Kids 4 but it's still better than this) cause I'd feel just depressed if this is what people are gonna look fondly back on in comparison to Spy Kids 2 or Sharkboy and Lavagirl.P.S they didn't even bring back Taylor Lautner for Sharkboy, so **** you Netflix."
    },
    {
      "rating": "9",
      "text": "It's a visual feast; the use of vibrant and colorful CGI here draws inspiration from its spiritual predecessor, \"The Adventures of Sharkboy and Lavagirl.\" It occasionally takes hilarious jabs at contemporary superhero films (Marvel and DC's), is goofy, self-aware, and overall doesn't take itself too seriously. These qualities can be delightful for young audiences, and even for adults like myself.At its core, \"We Can Be Heroes\" is a movie that brings to the forefront strong messages about youth empowerment, collaboration, and leadership, which somehow mirrors what many young people are doing today; they take charge in shining a light on pressing issues such as climate change and social inequalities, and making strides to develop sustainable solutions. The message is powerful and delivered crystal clear, which no superhero film has ever done in the past."
    },
    {
      "rating": "4",
      "text": "Maybe the kids will have a good time, beyond that, this is a rude throwback for Robert Rodriguez. And yes, it's true, it's not like there isn't a lot of this in his career, and it's obviously fun for him to make them, but frankly, he no longer explores anything relevant in these types of productions."
    },
    {
      "rating": "0",
      "text": "This thing is hilariously bad and made for a very good time with some friends over a video call. It fails at so much that I couldn't possibly go over it all in a reasonable amount of text. A couple of the highlights are how Taylor Lautner absolutely wouldn't come back to play shark boy again so the guy who replaces him doesn't get a single line, or how there's a kid whose super power is that his legs don't work and the writers thought it would be a good idea to name him \"Wheels\" after his disability. I should also argue that this movie being \"meant for kids\" does not excuse it's quality. Children will eat play-doh if left unattended but that doesn't make it okay to serve."
    },
    {
      "rating": "4",
      "text": "Only for kids. But to be honest I don't think they'll find it very entertaining either."
    },
    {
      "rating": "3",
      "text": "This movie literally ruined my favorite childhood series, they didn't put Max from the first movie and they didn't tell us about what happened to the shark boy's father."
    },
    {
      "rating": "2",
      "text": "The movie was disappointing. The message it sends is that kids should be in charge. Don’t trust the adults. Really a dumb movie."
    },
    {
      "rating": "0",
      "text": "Holy **** **** This movie is awful on so many levels. I even wanted to scream at multiple intervals because of this unnecessary and **** horrifying excuse of a movie. For one, none of the kids, except for Missy, Wild Card, and Wheels, are likable. They exist just for filler (Slo-Mo, Facemaker, A Capella, Fast Forward, Noodles, and Rewind), and cuteness proximity (Guppy).Also, despite this being a spinoff to \"Sharkboy and Lavagirl\" (WHICH WAS GOOD), the title characters don't get enough focus, specifically Sharkboy, who doesn't even have any lines!Also, why the **** is the main protagonist, Missy, not the child of the duo? I mean, it makes no sense why they gave birth to Guppy, a side character who just exists because of cuteness proximity, as said before.And then there's Ojo. She's a pretty cute character who is mute, but yet communicates through art. She's decent, but then the ending just RUINS her character. Turns out she CAN talk and that she's a straight-up **** in sheep's clothing who's the Supreme Commander of the aliens. Cool twist, right? Yeah, I thought so, too. But then it turns out it was all a TRICK, as she was just training the gang to be superheroes. How anti-climactic!So yeah, this movie sucks balls. Sure, the acting's okay and the plot's decent (despite it being atrociously executed), but I would rather stick a tree branch up my ass than watching this movie.Netflix, STEP UP YOUR **** GAME!"
    },
    {
      "rating": "0",
      "text": "Wow! This one was a painful one to watch. A really trash movie all around. Nothing good about it."
    }
  ],
  "recommendations": [
    "astro_boy",
    "spy_kids_all_the_time_in_the_world",
    "incredibles_2",
    "rim_of_the_world",
    "cloudy_with_a_chance_of_meatballs",
    "turbo",
    "minions",
    "free_birds",
    "the_smurfs",
    "the_nut_job",
    "real_steel",
    "teenage_mutant_ninja_turtles",
    "shadow_in_the_cloud",
    "jumper",
    "transformers_revenge_of_the_fallen",
    "g_force",
    "the_angry_birds_movie",
    "brightburn",
    "despicable_me_3",
    "the_boss_baby_family_business",
    "unfriended",
    "legion",
    "would_you_rather",
    "the_tomorrow_war",
    "the_croods_a_new_age"
  ]
}