{
  "id": 3061,
  "title": "We Were Soldiers",
  "starring": [
    "Mel Gibson",
    "Greg Kinnear"
  ],
  "runtime": 138,
  "genre": [
    "Action",
    "History",
    "War"
  ],
  "description": "The story of the first major battle of the American phase of the Vietnam War and the soldiers on both sides that fought it.",
  "releaseYear": "2002",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/q2LeLzw4q9HTelkKx29dyTMf5zK.jpg",
  "categories": {
    "plot": 6.4,
    "acting": 6.833333333333333,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 7.833333333333333
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Fairly laborious war film that stands on the shoulders of giants. Should be better."
    },
    {
      "rating": "2",
      "text": "Mel Gibson's \"we were soldiers\" is a rushed, poorly acted and terribly executed war movie. For a screenwriter who wrote Braveheart you would think it would carry over. No sign of it here."
    },
    {
      "rating": "1",
      "text": "Randall Wallace's \"We Were Soldiers\" is an unpardonable insult to young Vietnamese soldiers who sacrificed themselves for the independence of their homeland, completely contradicting what the story was supposed to do - honor them. In terms of history, The Battle Of La Drang Valley ended with American troops' retreat after sustaining heavy casualties from the ambushing Viet Minh army, instead of a \"spectacular counterattack which annihilated the entire Vietnamese battle forces\" like what happend in the end of the movie. As regards to direction, performance and storytelling, this film is a rather dull, boring war drama compared to Black Hawk Down or Saving Private Ryan; accompanied by a predictable plot, mediocre battle scenes that can be matched only by Michael Bay's \"Pearl Harbor\", I have but one word to honor this movie: CRAP"
    },
    {
      "rating": "7",
      "text": "We Were Soldiers may embrace some of the war film clichés but it still has enough talent and pretty solid action to hold the attention of its audience. The cast is full of big names like Mel Gibson and Sam Elliot and some cast members that would only gain more recognition as their career continued like Jon Hamm and Clark Gregg. I thought that the first 30 minutes of the film before they actually go to Vietnam Is great. I think it was a good way to build up the characters, but the story seems to get in a bit of rut once they do arrive but the ending is solid. Mel Gibson is strong but not as strong as you would like. War films are his bread and butter and he had the power to elevate this film a bit more and he did not. There were a lot of times where the story cut from the battlefield to the home front but I thought that it worked pretty well in this case. Barry Pepper gives one of the best performances of his career despite only being in the film for the second half. I actually though that he was the highlight and the movie seemed to get back on track once he joined the fight. I think this is a movie this is more for fans of the war genre but certainly has enough redeeming qualities that I can recommend it."
    },
    {
      "rating": "10",
      "text": "The action never stops."
    },
    {
      "rating": "7",
      "text": "Randall Wallace's \"We Were Soldiers\" tells the story of the events that surrounded the first major battle of the Vietnam War. The film stars Mel Gibson, Barry Pepper, and Greg Kinnear. First off, the greatest aspect of this film is the really strong lead performances from Mel Gibson - He really shines in this role. Another impressive performance in the film is Sam Elliott's portrayal of Sergeant Major Basil L. Plumley. His character has some of the most memorable lines of dialogue in the film which are often crass and caustic. Another very memorable aspect of the film is it's intensely realistic use of special effects. The film uses special effects to simulate what the actual Battle Of Ia Drang was like. Some of the special effects are really engaging and compelling while other special effects are grotesque and grisly, but either way it helps to ground this film in realism. While a lot of the performances in the film were noteworthy, there were some that were. . .not. I'm not going to say which ones fell flat, but there were some moments when actors delivered their lines in a really unsuitable way. These moments don't really take away from the film's overall appeal, but. . .their just bad. All in all, I felt that \"We Were Soldiers\" was a fairly impressive film that crafted a very believable simulation of the first battle of the Vietnam War."
    },
    {
      "rating": "10",
      "text": "an amazing story that is my second favorite movie of all time everything was realistic and is the best army movie ever i have watched it like 20 times get it"
    },
    {
      "rating": "8",
      "text": "This movie is in the top three vietnam war movies. Great acting and great battle scenes. the top three are 1. Apacolypse Now 2. Platoon 3. we were soldiers"
    },
    {
      "rating": "10",
      "text": "Absolutely a highly underrated materpiece, Gibson at or near his best. Incredible ensemble cast."
    },
    {
      "rating": "10",
      "text": "Exceptionally well made movie based on the novel written by the two people who actually lived the experience as a testimony in honor of the men of the 1/7 Cavalry who fought and died in battle."
    },
    {
      "rating": "8",
      "text": "The movie was entertaining, well made, the acting was good and it was interesting. The religious aspect might have been overdone and the movie might have been a little bit too long, but it was still a good war drama."
    },
    {
      "rating": "10",
      "text": "This movie is a strong and powerful to see. If you like war movies then you shod see movie. It is build from a best selling book that is not far from what really happened during that part of the war. Mel Gibson does this part extremely good. This is 1 of my favorite movies."
    },
    {
      "rating": "8",
      "text": "Stirring drama depicts, in graphic and heart-wrenching detail, what became the first major encounter between the soldiers of North Vietnam and the United States.\rMel Gibson credibly conveys the tortured nobility of a leader who recognizes the heavy responsibility of charisma. The storytelling here is powerful and unforgettable, the tone Shakespearean"
    },
    {
      "rating": "7",
      "text": "/    /"
    },
    {
      "rating": "8",
      "text": "This movie is in the great Vietnam war movies. Great acting and great battle scenes."
    },
    {
      "rating": "10",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\".\"."
    },
    {
      "rating": "9",
      "text": "Authenticity and believable relationships are to be had between both the friendlies and the enemies in \"We Were Soldiers\". It pays respect without too much of the Hollywood sugarcoating. \u2028I recommend this as one of the better war pictures to watch."
    },
    {
      "rating": "8",
      "text": "Well done & affecting, without major flaws."
    },
    {
      "rating": "7",
      "text": "Made very well, and is extremely intense. It is good that a war film be made as violent and as intense as this, cutting the BS. Because that is how to perhaps shock some out of apathy and show how truly evil, and senseless war is. A better film might have shown both sides a bit more evenly, to better humanize each side, for the true tragedy of war is that one is not fighting demons on the other side of the battle, but rather a soldier much like themselves."
    },
    {
      "rating": "8",
      "text": "This film shows us the first great battle that Americans suffered during the Vietnam War. Its difficult for me to assess how fair the film is in the picture of the battle, which I don't know very well, but I can say that I have not seen many problems with historical rigor. The film emphasizes the deficient American preparation for that type of war and the way that specific location was underestimated. It's a war movie and it has, of course, a lot of action but, despite some appeals to patriotism, it's not fanatical about it as some other films are (\"Black Hawk Down\", for example). This moderation was something I appreciated, as well as the focus on the human drama of the soldiers and how they had to solve that difficult situation. The result is a war film that does not stray from the feelings, embracing its humanity even though it may displease those who went to the theater expecting to see another \"Rambo\". Mel Gibson is the main actor and fills his character with courage, heroism, faith and dignity. He is a good actor and is on a family record, not being the first war film in which he participates. The rest of the cast doesn't stand out much but fulfills our expectations and does what it has to do. The film uses sound and special effects very well, realistically portraying the soldiers' action on the ground. The scenarios contribute to this realism and have been very well reproduced."
    }
  ]
}