{
  "id": 2609,
  "title": "Welcome to the Jungle",
  "starring": [
    "Jean-Claude Van Damme",
    "Adam Brody"
  ],
  "runtime": 95,
  "genre": [
    "Comedy"
  ],
  "description": "A company retreat on a tropical island goes terribly awry.",
  "releaseYear": "2013",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wRHaPGBBmQhUVgYofPoaqTEdUWq.jpg",
  "categories": {
    "plot": 6.0,
    "acting": 5.2,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.25,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "The movie maker might have thought using Van Damme would brighten up\rthis movie but terribly failed. It is not funny, it is not adventurous\rand it is not even look like a big screen movie. The quality of\rproduction was the only interesting thought they did not spend it\rwisely and broadly. You can watch this movie from first to last, but\ryou can't enjoy it any portion of it. This movie was based on a silly\rconcept with okayish actors in it which looked like a weekend movie\rthat aired on a television. Hope you guys won't end in a disappointment\rlike me for choosing this movie to watch.\r ✰✰✰✰/10"
    },
    {
      "rating": "6",
      "text": "Could have been better,would have liked to see more of van damme ,but apart from his character nothing\rstood out in the movie,idea was right,execution could have been better"
    },
    {
      "rating": "4",
      "text": "It's a comedy largely devoid of humor. Not even it's unique island theme or the inclusion of Van Damme and Kristen Schaal are able to add anything funny to the mix. You'll be lucky to hear one or two funny one-liners, and I'm not about to complain about the topless ladies, but overall there are a lot better and funnier alternatives out there. Just do yourself a favor and skip this one. I give it a 4.5/10-Bad."
    },
    {
      "rating": "3",
      "text": "I'm very curious on how this movie come to be. It's nothing more than cheesy dialogues and entirely predictable jokes, but it manages to include Jean Claude Van Damme and Daniel Haybert, who have more credential in action. Not to mention the attempt in humor is very crude, it’s practically littered with profanity as well as decades old slapstick.\r The story follows a group of company workers who are sent to an island for teamwork drill. They hired Van Damme as the guide but he is far from special force veteran here. Not before long everything falls apart and it becomes torturous castaway flick. Characters are stereotypical, you have your overly nice guy, scruffy sidekick for comedy, pretty love interest and that one annoying boss.\r Everyone behaves in straightforward manner following template from 90s comedy, the other cast not only lacks any hint common sense, they are also interchangeable extras. Jokes aren't funny in the slightest, with most are attributed with vulgar or racial tone. It tries hard way too much it becomes too unnatural. Perhaps this is to showcase the stagnant work place can be and how people would like to become more than they are, but it delivers the idea in such feeble manner, crediting them such effort is an overstatement.\r Van Damme, maybe, wants to broaden his acting range. This character is so different from his usual stint, it could be interesting for a few scenes, but it becomes too tired too fast. In fact, the movie feels way too lengthy for such thin material. It really wastes not only audience's time but also dulls their senses.\r Avoid at all cost. It is worth neither your money nor time."
    },
    {
      "rating": "10",
      "text": "i love it, they catch me with the plot twist ,i enjoyed so much, good cast , i like it i dont know why people doesnt like?  comedy and drama its very funny"
    }
  ],
  "recommendations": [
    "baywatch",
    "chips",
    "zoolander_2",
    "the_spy_who_dumped_me",
    "keeping_up_with_the_joneses",
    "stuber",
    "red_notice",
    "ride_along",
    "thunder_force",
    "the_watch",
    "horrible_bosses_2",
    "paul_blart_mall_cop",
    "this_means_war",
    "30_minutes_or_less",
    "spy",
    "pineapple_express",
    "anchorman_2_the_legend_continues",
    "mortdecai",
    "couples_retreat",
    "22_jump_street",
    "rough_night",
    "jumanji_the_next_level",
    "deadpool_2",
    "identity_thief",
    "johnny_english_reborn"
  ]
}