{"id": 72, "title": "Werewolves Within", "starring": ["Sam Richardson", "Milana Vayntrub"], "runtime": 97, "genre": ["Horror", "Comedy"], "description": "When a proposed pipeline creates hostilities between residents of a small town, a newly-arrived forest ranger must keep the peace after a snowstorm confines the townspeople to an old lodge. But when a mysterious creature begins terrorizing the group, their worst tendencies and prejudices rise to the surface, and it is up to the ranger to keep the residents alive, both from each other and the monster which plagues them.", "releaseYear": "2021", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/WoG2tvwanOMlU0qsbxpf9Qd3y.jpg", "categories": {"plot": 7.0, "acting": 7.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 7.2, "action": 10.0}, "reviews": [{"rating": "5", "text": "A new forest ranger (Sam Richardson) comes to a small mountain town about the same time the titular creature cranks up a killing spree. In the early scenes, the local mail carrier (Milana Vayntrub) takes him around to meet the town’s quirky citizens. Sadly, most of them aren’t that quirky…just trying too hard. This develops into a classic whodunit with everyone a suspect. The combo of comedy/thriller never materializes on either level. Although there’s plenty of comic energy, it doesn’t translate into a lot of genuine funny. Even when the creature does attack, it’s not remotely scary. While making a robust effort, this film doesn’t deliver on its eccentric promise."}, {"rating": "6", "text": "It's humorous, but it's also supposed to be horror, yet it never takes advantage of both genres and stakes.Its own execution provokes it, and that thing, despite the charisma, took away many points from the whole story.Especially the incredibly weak conclusion.It didn't displease me, but it was underwhelming to say the least.I would recommend it for a weekend. You can forget about it after that."}, {"rating": "2", "text": "What starts as a fun idea soon fizzles out once the ensemble of townsfolk are introduced. The film becomes irredeemably forgettable once the realisation sets in that you won't see a werewolf at all until the last seven minutes or so. For a werewolf film to exclude its titular monster and rely on bitter townsfolk to off each other in abrupt and unimaginative ways is unforgivable. Forget the critics score. There is no way this unfunny, formulaic video game adaptation is better than Mortal Kombat."}, {"rating": "1", "text": "Everyone just fights. You find out who the werewolf is and then the movies over. Waste of time!!!!"}, {"rating": "3", "text": "Nothing to see here except the lovely Milana Vayntrub. There's a single scene in the movie where she dances to 'I Saw the Sign' by Ace of Base which I personally really enjoyed. After that I could have just turned the movie off because it was terrible. It wasn't funny, scary or entertaining. It was just a load of poorly written characters running around doing dumb stuff for no reason until the credits roll. And there's very little werewolf in the whole movie."}, {"rating": "8", "text": "First off, so glad to see Sam Richardson play the lead in this movie. One of the best supporting cast members on Veep, along with his co-starring role on Detroiters (nice timing that his buddy, Tim Robinson's Netflix sketch series just dropped it's second season), Richardson anchors this movie with his persona. Richardson plays a relocated forest ranger, assigned to the little snowy berg of Beaverfield. The first person he meets upon arriving is the mail carrier, portrayed by Milana Vayntrub, who is best known as AT&T's Lily. Sure, she is cute and quirky on those commercials, but given her performance in this movie, give this woman more movie roles. Their back-and-forth dialogue and chemistry is humorous and adorable. The tiny town is divided by the prospect of a gas pipeline, with some residents for it and some against. In the midst of this, the dead body of the husband of the owner of the local inn is found mauled to death. Then the power goes out. To steal another critic's line, it's as if John Carpenter's The Thing was mixed with the characters from Letterkenny. To say more would ruin the joy of this amusing comedy/horror hybrid. I'll just say \"heaven's to Betsy\", give it a watch."}, {"rating": "10", "text": "I could not believe that a movie based on an Ubisoft VR game was getting such great reviews. Then I saw that it had Sam Richardson and I had a good guess as to why. Sam is one of those performers that I could watch in anything and he delivered an amazing performance here amongst other engrossing comedic actors. The chemistry between Sam and the on screen love interest, Milana Vayntrub, was palpable. I know they adapted the story for the movie and they made so many great choices. The setting of a small town in the dead of winter really set the mood. For a horror movie that is rated R there wasn’t a lot of gore. I think it’s more because of the language that this movie earned an R rating, but there is a lot of violence. There are things about the style of editing that are a little over used in this genre of movie, but the quick cuts weren’t too many for me to be taken out of the action and didn’t mess with the pacing either. The mystery they set up is pretty good as well. I’m not kidding when I say I could have started the movie over and watched it again I had that much fun with it. I’d recommend this for anyone looking to spend some time enjoying an evening in."}, {"rating": "8", "text": "Consistently amusing and engaging comedy which maintains the tension of its genre elements (horror, whodunnit). Great cast none of whom look like models but are appealing regardless (fancy that?). One of the best werewolf moves since the heyday of the 80s and by way of focusing on the characters instead of the situation, perhaps the best film made from a videogame."}, {"rating": "8", "text": "In a small town, there seems to be some sort of creature (obviously a werewolf) going around attacking the townsfolk and it takes far too long for everyone, including the overly-polite new forest ranger to suspect the new postal worker."}, {"rating": "5", "text": "I liked some of the goofy humor and how all the characters are complete idiots. Although, not so much on the social commentary that this movie tries to put in for some reason."}, {"rating": "7", "text": "It was a fun movie, interesting and unpredictable, with some fun moments. Maybe not the funniest movie of last year, but certainly a good watch."}, {"rating": "7", "text": "A cheesy fun who-dun-it with well done set and cinematography. If there was half as much political references and poking it'd probably be a 8 or 9, but each time it comes up it ruins the moment for nothing extra."}, {"rating": "5", "text": "Neither that funny or that scary. A movie that could of been so much more but in the end becomes a dull ride."}], "recommendations": ["zombieland", "the_babysitter", "american_ultra", "jumanji_the_next_level", "goosebumps_2_haunted_halloween", "keeping_up_with_the_joneses", "jack_the_giant_slayer", "tremors", "ready_or_not", "night_at_the_museum_battle_of_the_smithsonian", "jungle_cruise", "jumanji_welcome_to_the_jungle", "guardians_of_the_galaxy", "thor_ragnarok", "krampus", "red_2", "hotel_transylvania_3_summer_vacation", "red_notice", "game_night", "deadpool_2", "logan_lucky", "baywatch", "deadpool", "night_at_the_museum_secret_of_the_tomb", "minions"]}