{
  "id": 296,
  "title": "West Side Story",
  "starring": [
    "Ansel Elgort",
    "Rachel Zegler"
  ],
  "runtime": 157,
  "genre": [
    "Drama",
    "Romance",
    "Crime"
  ],
  "description": "Two youngsters from rival New York City gangs fall in love, but tensions between their respective friends build toward tragedy.",
  "releaseYear": "2021",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lnUxSldaVI0mYCCf2akyQpbTFgr.jpg",
  "categories": {
    "plot": 8.833333333333334,
    "acting": 8.666666666666666,
    "ending": 8.0,
    "soundtrack": 8.0,
    "cinematography": 8.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "West Side Story is one of the best, if not THE best, film adaptations of a musical to ever grace the cinema. Bernstein's score, Sondheim's lyrics, and Jerome Robbin's choreography hold up today, and the themes of hope, hatred, love, The American Dream, downtrodden youth, and racism still exist today, almost 57 years later. If you are a fan of musicals, classic cinema, or just film in general, you absolutely cannot miss West Side Story."
    },
    {
      "rating": "8",
      "text": "co-ordinated as a mirror..West Side StoryAs much as simple and familiar path the tale walks on, there is just too much of passion and enthusiasm towards the project and the work that went behind the camera, which makes it almost impossible to not be affected or mesmerized by it. The technical aspects like costume design, sound department and choreography is rich in details and makes its immensely entertaining at the largest scale possible. The first half of the feature is simply and utterly beautiful and pleasing to encounter where everything is mushy-gushy and mellow but as soon as the second half kicks in, the whole plot turns into this hegemony of \"humane\" nature conflicts and ironically more poetic than the first half. The execution by the director is decent but in here the editing plays a major role and sweeps away the charm as it is perfectly done. The performance is decent by the lead characters but all the limelight is stolen by the supporting cast especially Rita Moreno. The only minor conflict in it is the amount of time it takes to make the definite point, which can be challenging at some times. West Side Story is a musical act co-ordinated as a mirror; which is the ideology of the society in here that we all reside in."
    },
    {
      "rating": "10",
      "text": "Through its legendary performances, lovable music, and important themes and messages. This classic Romeo and Juliet Masterpiece brings the Broadway musical to life as one of the greatest films in existence."
    },
    {
      "rating": "9",
      "text": "RITA MORENO RITA MORENO RITA MORENO RITA MORENO RITA MORENO RITA MORENO aaaaa"
    },
    {
      "rating": "9",
      "text": "First time that I saw West Side Story today. I must say, I really enjoyed the movie. Mostly because I was surprised to see the serious topics which it tackles, which were relevant back in the 60s, but are all, oh so, relevant even today. I enjoyed the performances for the most part, especially Rita Moreno and Richard Beymer. I did get annoyed at those bad \"Puerto Rican\" accents which were used by most of the Puerto Rican characters and which sounded more Italian or other European accents.I really enjoyed the musical numbers and I loved how they used dancing in the fighting scenes. The only thing which was a bit cheesy was the fact that Tony and Maria meet and fall so madly in love in a matter of one evening. Looking forward to see what Spielberg will bring with the remake of this really amazing movie."
    },
    {
      "rating": "7",
      "text": "assisti em 2019, filme simples, normal ao meu ver, não consegui entrar dentro do filme, ele se mostra serio mas com brincadeiras, com o musical e suas musicas e danças algumas são boas e outras mais o menos, eu esperava mais, não achei que combinou."
    },
    {
      "rating": "8",
      "text": "Beautifully shot, edited and directed.The film's somewhat predictable Romeo and Juliet story is elevated by some very impressive song and dance numbers, as well as its gorgeous cinematography and creative editing.It's definitely a little too long, but it's great piece of filmmaking with some really biting commentary on racial discrimination (the song \"America\" is a perfect example).I love the ending credits."
    },
    {
      "rating": "8",
      "text": "With cool music and slick dance routines, this is a triumph. Maria and Tony have real chemistry. It makes serious points about gang culture and the way immigrants are viewed in American. You could question some of the acting, but it's not the sort of film where the acting really matters."
    },
    {
      "rating": "10",
      "text": "West Side Story from 1961 is simply unforgettable and loving with great performances and magical musical performances."
    }
  ]
}