{"id": 4796, "title": "What Lies Beneath", "starring": ["Harrison Ford", "Michelle Pfeiffer"], "runtime": 130, "genre": ["Drama", "Horror", "Mystery", "Thriller"], "description": "When Claire Spencer starts hearing ghostly voices and seeing spooky images, she wonders if an otherworldly spirit is trying to contact her. All the while, her husband tries to reassure her by telling her it's all in her head. But as Claire investigates, she discovers that the man she loves might know more than he's letting on.", "releaseYear": "2000", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/2L3Cn0CizbSy2E9KJt1SiOSyb6p.jpg", "categories": {"plot": 6.894736842105263, "acting": 7.315789473684211, "ending": 4.333333333333333, "soundtrack": 7.0, "cinematography": 7.0, "familyFriendly": 1.0, "funny": 7.333333333333333, "action": 7.333333333333333}, "reviews": [{"rating": "1", "text": "A stupid plotline really. I mean ghosts in a house? Ghosts going into people's bodies? Corny."}, {"rating": "10", "text": "A Brilliant first-rate classic. Mind blowing intelligence and incredible acting deliver the small blows. Sheer terrifying brilliance delivers the rest. A perfectly cast mind-blowing tour-de-force, stunning and superb. The greatest horror movie of our time."}, {"rating": "6", "text": "Above average (average horror flick) in terms of cinematography, acting, and a very effective score. And there are some great chilling moments. But it gets pretty ridiculous pretty quick."}, {"rating": "9", "text": "What makes this movie great is that it's essentially a chick flick that descends into a suspense thriller. The scares and special effects are given in quality, not quantity, sprinkled perfectly throughout the plot. The ending requires you to stretch your brain a little, but the setup leaves you so desperately wanting a manifestation of the fears involved that you take it. Pfeiffer does an excellent job carrying the load, and Ford is refreshing as a villain."}, {"rating": "9", "text": "A smart thriller with brilliant acting from Harrison Ford and Michelle Pfeiffer. Definitively one of my favorites. While focusing on the problems of an apparently normal relationship, \"What Lies Beneath\" has some original scary moments and much suspense."}, {"rating": "1", "text": "What lies beneath? Definitely the most impressive and comprehensive collection of cliches, nonsense absurdities and boring moments ever assembled in this pretentious couldn't-possibly-be-slower film. Nothing happens for the first 90 minutes. Pfeiffer wanders in her home trying to look troubled, has pointless encounters with neighbors, plays some ouija with a friend and from time to time exchanges with Ford some dull dialogue that sounds anything but realistic. And when filming nothing seems to have reached it's limits, well, you just get some more. The final twist doesn't come as a surprise -remember, you had 90' to try and guess it out, nothing was happening on the screen- and the final confrontation is sooooo ludicrous that it keeps me wondering if it has been stolen from the Scary Movie franchise. But surprisingly, I actually rather enjoyed the ending. It gets hysterical as every step seems to have been written under the strict rule of \"of all options my characters have, what would be the least logical or probable?\" This pure overdose of nonsense situations gets really funny, and comes as a nice and more than welcomed frustration relief after sitting through nearly two hours of pretentious pseudo hitchcokian homage. (I know I got Sir Alfred's last name spelled wrong, but it keeps being deleted by some poorly encoded \"Politically Correct\" protection stuff that doesn't seem to stand the second syllable of Hitchco**)"}, {"rating": "4", "text": "This dry mystery thriller fails to generate enough tension with its superb cast. Seems in the persuit of a Hitchcock style zemekis instead strangely focusing here on unnecessary complex visual effects shots that serve only to distract from the events unfolding. Missed opportunity but an interesting watch."}, {"rating": "6", "text": "Despite an interesting story and a charming cast, What Lies Beneath has trouble raising it's quality above average. The acting wasn't particularly good despite the fact that both of the main characters are known to give good performances, the third act, while being entertaining was completely illogical, cliché and way too over the top compared to the more realistic and slow previous acts and the movie isn't very scary.If you're looking for a good scary paranormal flick, I'd suggest you watch something else."}, {"rating": "8", "text": "Very Hitchcock like movie. True to his style in every way. Well written, well edited, well acted. Naysayers will be out there, but then, not everyone loves Hitchcock, either, so there you go."}, {"rating": "7", "text": "The imposing shadow of Hitchcock looms large over Robert Zemeckis' \"What Lies Beneath,\" a thriller that tries aggressively, but not entirely successfully, to deliver the goods of three genres -- suspense, supernatural and horror -- for the price of one movie. Revisiting the turf of stylish thrillers, in which an upscale yuppie couple is haunted by mistakes of the past, story centers on a genius researcher and his loving wife, played by Harrison Ford and Michelle Pfeiffer, whose seemingly happy marriage and stable life are utterly shaken by mysterious events that spiral out of control. Intermittently scary but not fully absorbing, this DreamWorks-Fox co-production should grab strong opening numbers due to shrewd marketing that positions pic as an adult thriller.\r Top flight talent on both sides of the camera can’t quite disguise the B-quality of Clark Gregg’s script, a patchwork composed of bits and pieces from Hitchcock’s suspensers, the Gothic “haunted house” tradition, “Fatal Attraction”-like cheap thrill sensations, creepy supernatural mysteries like “The Sixth Sense” and so on.\r “What Lies Beneath” won’t restore Ford or Pfeiffer to pre-eminence. On the one hand, the old-fashioned material is inferior to their talents, while on the other, it’s not spooky or stylish enough to become a must-see for the goodtimes-hungry summer masses.First act is an unabashed reworking of “Rear Window” with a gender reversal. Norman and Claire Spencer (Ford and Pfeiffer) move to a picturesque house near a Vermont lake after sending their daughter to college. As soon as they settle down, Claire begins to suspect that there’s something wrong with their neighbors, Warren and Mary Feur (James Remar and Miranda Otto).\r Behind a fence that divides the two estates, she hears vocal arguments, then painful cries. Like Jimmy Stewart in Hitchcock’s classic, she’s glued to her window with spectacles, soon beginning to fear that Warren has murdered his wife. Norman, who’s totally consumed with his research project and upcoming conference, dismisses her reports.\r Top flight talent on both sides of the camera can’t quite disguise the B-quality of Clark Gregg’s script, a patchwork composed of bits and pieces from Hitchcock’s suspensers, the Gothic “haunted house” tradition, “Fatal Attraction”-like cheap thrill sensations, creepy supernatural mysteries like “The Sixth Sense” and so on.\r “What Lies Beneath” won’t restore Ford or Pfeiffer to pre-eminence. On the one hand, the old-fashioned material is inferior to their talents, while on the other, it’s not spooky or stylish enough to become a must-see for the goodtimes-hungry summer masses.First act is an unabashed reworking of “Rear Window” with a gender reversal. Norman and Claire Spencer (Ford and Pfeiffer) move to a picturesque house near a Vermont lake after sending their daughter to college. As soon as they settle down, Claire begins to suspect that there’s something wrong with their neighbors, Warren and Mary Feur (James Remar and Miranda Otto).\r In a problematic sequence that lacks much credibility, an angry Claire accuses Warren of murdering his wife at a public function attended by Norman’s notable peers, only to realize that his wife is there.\r The movie then drops the Hitchcockian subplot — which proves to be a teaser — and turns into a supernatural mystery revolving around a lone woman in a haunted house.\r Some humor is integrated into the proceedings by the presence of Claire’s cynical divorcee friend, Jody (a splendid Diana Scarwid), in scenes in which the two discuss witchcraft and try to communicate with ghosts on a Ouija board.\r Changing gears again, third chapter centers on Claire’s discovery that her husband had an affair with a girl who is missing. Working as a private eye, she conducts an obsessive investigation to discover the girl’s whereabouts, including a visit to the girl’s distressed mother.\r Echoing motifs of Bernard Herrmann’s music for Hitchcock, Alan Silvetsri’s score contributes effectively to the menacing atmosphere.\r Tech credits are high grade, especially widescreen lensing by Zemeckis’ longtime collaborator Don Burgess, which keeps things fluid during the numerous house-bound scenes. There are notable trick shots within tight and confined spaces, good use of multiple mirrors that both reflect and distort Claire’s reality and long takes that allow the actors to develop a scene organically.\r Zemeckis, best known for combining storytelling skills and technical wizardry (“Back to the Future,” “Forrest Gump,” “Contact”), operates on a new turf, directing a thriller for the first time.\r All along, the feeling is that the filmmakers don’t trust the core material and try to compensate with a complicated storyline and overbaked production."}, {"rating": "8", "text": "Ghostly thriller. Strange behaviour from the neighbours and ghostly goings on play on Michelle Pfieffer's nerves. Harrison Ford holsd back just enough to keep you unsure of what's going on until . The direction builds tension well, provides several sudden shocks and then develops an air of malice. It all rewards repeat viewing. Luxurious like dark chocolate and double cream. Sit back on your sofa and indulge."}, {"rating": "8", "text": "This film was badly mistreated by critics, but, I confess, it worked reasonably for me, and I am not disappointed with it. It is not a brilliant film, it has flaws, but it seems to me a successful effort. The well-written script, full of twists that add to the mystery and prevent the audience from realizing what is really going on until almost the end, as well as the excellent performances of the main actors, were decisive for the quality of the final result.At first, it looks like a simple mild psychological horror film around another haunted house: Norman and Claire are a middle-aged couple and now live alone, as their daughter went to University. They recovered the family's country house, but Claire will begin to hear voices and have strange and frightening visions, which she quickly relates to a couple of neighbors with somewhat strange behaviors. But the truth is hidden closer than she thinks, and what we thought was a light horror film turns out to be, after all, a very elegant and engaging mystery thriller.The cast is skillfully led by two great actors, who need no introduction nor to prove their talent to anyone: Harrison Ford and Michelle Pfeiffer. She is totally at ease with her character and is still very beautiful, although she is no longer the young actress of \"Age of Innocence\". Ford gives us an equally solid and fresh work, as it is extraordinarily rare to see this actor not being the good guy. The way in which both actors act together is very positive, full of chemistry and intensity. The supporting characters are guaranteed, with pride and merit, by actors like Diana Scarwid and Katharine Towne.Technically, the film shows the full value of its budget. Skillfully directed by Robert Zemeckis, it has excellent cinematography, with a dark and dense atmosphere, good light and shade and a very restrained, but effective, use of outside scenes. The house is beautiful, and the set is very elegant, as well as the costumes, particularly Pfeiffer's. The film is over two hours in length, and it may seem a little too long, but I confess that I handled it well and didn't feel that it needed many additional cuts. Most of the time, it manages to create the atmosphere and environment necessary for the suspense to work, but this begins to fail as the film moves towards its climax."}, {"rating": "9", "text": "Interesting story and acting, there was an alternative to explain the paranormal things happened in the house and the hostess's hysterical reaction made you almost believed that it was the right answer, however, with the investigation going deeper, the really truth was not revealed until the very end. Brilliant story-telling keeps the audience in suspense. BTW, the film's name is a pun."}, {"rating": "8", "text": "This is quite a spooky thriller, although it is quite slow to start, the atmosphere builds up.There are a few scenes which should make you jump, its more spooky or creepy than violently scary though. If you've seen many similar movies then you may laugh at first, as it did seem a bit obvious and perhaps even over the top, when the ghost first made itself known, although after about an hour into it, it does become quite enthralling and you (or I, anyway) become more taken by the story and more interested in the outcome.If your looking for some cheap scares, then I'm not sure this is really the movie for you, its more about the relationships and stories behind people involved and what has happened in the past, than it is (really) about lots of gory scenes, although thats not to say that there aren't some creepy and atmospheric scenes that may send a chill down your spine all the same, its more of a ghost story, than a full blown horror movie.Be aware that there are some scenes where Harrison and Michelle get a bit, intimate, which may be a bit off putting for young viewers, if I may say so, he wasn't so young even when this movie was made, some 8 years ago! (makes me wonder about this new Indiana Jones movie?!) haha not for the faint hearted perhaps, if I may be so cheeky as to say that(?!), though right enough im sure he has fans all the same and I can't fault his acting really.Michelle Pfeiffer also played her role well I thought, you can see the fear and desperation on her face. Its quite easy to feel sorry for her character, with a busy husband she's often on her own, in a large, spooky house with peculiar things going on, trying to make sense of it all.In the end, there's quite a twist, which is pretty chilling and it does get, if only fairly briefly, a bit more bloodier. I think it really is more of an atmospheric, dramatic ghost story than anything else though and as that, its not too bad.As a spooky ghost story/drama/thriller, this isn't too bad.Its certainly fairly atmospheric at times and you can get pretty absorbed in the story, hoping Claire finds out what has become of the neighbour and what is causing all the spooky things that appear to be going on. If your looking for an all out gory and overly violent horror movie, then this probably isn't going to fit the bill entirely but, as I say, its not too bad as a spooky thriller, with a pretty exciting climax. The acting is good and its just spooky enough to pull you in, though you may need a little convincing to start with but it is worth sticking with.This is possibly not the greatest movie of its type ever made but equally its not the worst and so I think if it sounds interesting to you then you should check it out."}, {"rating": "6", "text": "Ok movie. The movie keeps you interested throughout. The only problem is in my opinion I thought the ending sucked."}, {"rating": "4", "text": "I watched this movie due to the reason that it had Harrison Ford and it was a horror movie. Movie's story was not that great. It looked like the writer was confused while writing the story. Movie was unnecessarily too long, movie could have been half hour short. There was problem with movie's pacing also, felt slow. The acting was good and the only thing worth watching in this movie. Overall, a simple horror drama which I may not recommend to big horror fans."}, {"rating": "10", "text": "An unforgettable impeccable performance by Michelle Pfeiffer. The story of a woman who becomes possessed by a ghost of the past, most notably the scene recalled by fans as the couple is about to make love, Michelle Pfeiffer's character turns towards her lover, played by Harrison Ford, and says \"I think she's starting to suspect something...,\" \"Who?\" And replies: \"your wife.\""}], "recommendations": ["the_others", "the_mothman_prophecies", "the_night_house", "last_night_in_soho", "before_i_go_to_sleep", "the_lodge", "the_woman_in_the_window", "candyman", "stonehearst_asylum", "the_invisible_man", "the_skeleton_key", "a_simple_favor", "the_rental", "10_cloverfield_lane", "winchester", "panic_room", "the_raven", "stoker", "run", "midnight_special", "lights_out", "gothika", "crimson_peak", "the_autopsy_of_jane_doe", "the_black_phone"]}