{
  "id": 2086,
  "title": "What Lies Below",
  "starring": [
    "Ema Horvath",
    "Mena Suvari"
  ],
  "runtime": 87,
  "genre": [
    "Horror",
    "Mystery",
    "Thriller",
    "Science Fiction"
  ],
  "description": "Liberty, a socially awkward 16-year-old, returns from two months at camp to a blindsided introduction of her mother’s fiancé, John Smith, whose charm, intelligence, and beauty paint the picture of a man too perfect to be human.",
  "releaseYear": "2020",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/6K8Zdz85GbCrb6oXbUGcKxPZ5e0.jpg",
  "categories": {
    "plot": 8.5,
    "acting": 9.0,
    "ending": 6.666666666666667,
    "soundtrack": 8.0,
    "cinematography": 10.0,
    "familyFriendly": 6.333333333333333,
    "funny": 5.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "1",
      "text": "It had a lot of potential, but halfway in and every thing just became more and more predictable up to the point of the worst ending they could've gone with. The not so surprise twist! Only netflix would give this a number 1 spot*Edit: I find it sketchy that the positive reviews are from people writing long reviews with big words and little, if any grammatical errors. It seems fake. F these phoneys."
    },
    {
      "rating": "9",
      "text": "Well, if their intent was to make ever inch of my body contort with creepiness vibes — they were successful!   The horror component of this film is definitely more the psychological, instead of the jump-scares.  It taps into those primal fears that most of us ladies don’t like to think about, being sexually targeted by a man we are suppose to be able to trust.  He’s like the male version of a siren, so beautiful and is leading us to our death.(Spoiler alert) That shower scene was probably one of the most uncomfortable scenes I’ve EVER witnessed in a film, which was preceded by a scene on a boat that I —omgeee —I don’t even want to think about.  I audibly gasped. Umm, John licks something, that I’ve NEVER seen in cinema.Then there’s that ending.  WHAT?!  That’s all I get?  What happens?  I. Need. More.  I then went looking for answers, and I read this Q&A with the director. He said , “the final scene was one of the earliest shots in my head.  For me it answers the who, what, where, and why of our mystery.  Part of the why, for instance, is distinguished by a physical trait shared by all the subjects in the shot.”   Then I watched the film again — and this movie is really nuanced.  Once you see that detail and a few others you finally get what John is doing, and where Libby is headed. I’ll let you see it for yourself.   Overall, great acting and a visually beautiful film.  Ahhhh — Give me a sequel!!"
    },
    {
      "rating": "7",
      "text": "A fun little science fiction horror that will seem a little familiar, but is original enough to be interesting. I would have liked more story and a stronger third act, but at least they didn't got for a conventional ending."
    },
    {
      "rating": "10",
      "text": "Good acting. Great cinematography. Well produced. I did not see that ending coming."
    },
    {
      "rating": "10",
      "text": "Sets were stunning, shot composition fantastic. I'm not qualified to watch scary movies but this one has me rethinking that."
    },
    {
      "rating": "10",
      "text": "Finally a horror movie with a new plot and good acting. It made you think from the beginning and it was different than any other movie, it kept making you think it was like others but then had a twist. The location was gorgeous too, natural setting with beautiful views. I hope that this director/writer comes out with more movies, it’s just what we needed for 2020!"
    },
    {
      "rating": "10",
      "text": "Beautifully shot. Loved the lighting and sound. Great work from an exciting new director."
    },
    {
      "rating": "10",
      "text": "If you’re looking for a movie grab you into it’s reality, raise some hair on your skin and has a driving female force (something many films need more of!), this is definitely the movie for you. “What Lies Below”, on a formal level, is incredibly impressive and pleasing to the eye, from its camera work to its coloring, and of course, it is all pulled together with convincing dialogue, and a strong character performance. Don’t miss out on this gem. It’ll definitely be a movie to watch twice, three times, four times, and more... We want more from new dir. Braden Duemmler!"
    },
    {
      "rating": "8",
      "text": "I really enjoyed this. It felt like something fresh in a genre that is awash with “same old.” While much of the plot just unfolds in a pretty straightforward fashion, there are still some interesting concepts. However, the very end, literally the last second, doesn’t quite make it all the way to a complete thought. This is made especially so as the acting and plot start to lean a little more to the campy side near the climax. The pacing is a little strange and in many ways I was hoping this slow burn would have had more to offer length wise. It could have had another fifteen minutes in the runtime without it feeling tired. There are some silly horror troupes here and there, but tension is built up nicely as things get stranger. The music is great and with such a small cast it’s a very impressive sci-fi horror/thriller. I highly recommend it."
    },
    {
      "rating": "6",
      "text": "This movie was strange and not in a good way. It was very cliche in many aspects and very corny as well. I managed to watch all of it but I had to watch Youtube in between on my phone. Is not really good at what is trying to do. If you want something scary that is good? watch \"The Hole in the Ground\" from 2019 that movie nailed it very good movie. What Lies Below was pretty lame it tries but it doesn't come close to succeeding at all lol a low 6 out of 10 for me."
    },
    {
      "rating": "6",
      "text": "this was way better than i expected, i thought this was gonna be some kind of corny Lifetime romantic thriller but this really surprised me. i don't want to spoil it but if you like Lovecraftian horror this will be a pretty good watch for you."
    },
    {
      "rating": "6",
      "text": "this was way better than i expected, i thought this was gonna be some kind of corny Lifetime romantic thriller but this really surprised me. i don't want to spoil it but if you like Lovecraftian horror this will be a pretty good watch for you."
    }
  ]
}