{
  "id": 3851,
  "title": "What Dreams May Come",
  "starring": [
    "Robin Williams",
    "Cuba Gooding Jr."
  ],
  "runtime": 113,
  "genre": [
    "Drama",
    "Fantasy",
    "Romance"
  ],
  "description": "Chris Neilson dies to find himself in a heaven more amazing than he could have ever dreamed of. There is one thing missing: his wife. After he dies, his wife, Annie killed herself and went to hell. Chris decides to risk eternity in hades for the small chance that he will be able to bring her back to heaven.",
  "releaseYear": "1998",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2gUfJKfJ6LwdqQebiAWuNzIWyp9.jpg",
  "categories": {
    "plot": 7.142857142857143,
    "acting": 5.333333333333333,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "i think this movie is amazing in every way. it is a beautiful love story that endures all obstacles. superb acting. amazing effects. a story that you couldnt find anywhere else."
    },
    {
      "rating": "10",
      "text": "This movie had some mistakes, much like all movies, but the overall meaning and purpose behind the film is absolutely fabulous. The way the purple flowers fall from the tree to represent the beauty of death, yet the sincere loss of a loved one, the way water plays an extremely important role with the cleansing of both mental and spiritual aspects of \"the self.\" It shows pain, and power through love and free will. Never give up, is the motto throughout the movie. Family is the most valuable thing on earth and it does not just stop there, it follows into the after life. With heaven represented as Annie's paintings it shows that heaven is whatever you want it to be. It is not laced with big pearly gates and cloud walking with angel wings. Heaven is your own manifestation. However it incorporated sin, so that it is not all rainbows and butterflies. Hell is not represented by fire and dragon's breath but is depicted by Dante's \"Inferno.\" Each level representing a different sin. \"I'd rather die trying, then never try at all,\" is a saying common in today's language and through this movie, it gives hope and strength, with lots of symbolic meaning to the questions what is life after death and what is the meaning of life as it is now?"
    },
    {
      "rating": "9",
      "text": "I'm utterly confused as to how critics could review this so poorly. What Dreams May Come is a vivid and captivating movie that will both mystify and spiritually gratify nearly anyone that views it. Though it distances itself somewhat from the actual Matheson novel, this film won't disappoint."
    },
    {
      "rating": "4",
      "text": "There is a certain beauty about this film. Largely from the visual effects and the wonder of Robin Williams. Beyond that, the story doesn't allow itself to live up to any expectations."
    },
    {
      "rating": "9",
      "text": "BEAUTIFUL!!!!! Any critic that have it less than 9 is a heartless cold soul.\rSo much beauty/pain/love all together in one!!\rI cry every time. Only downfall is you need tissues for this movie, it's a sad film for the most part."
    },
    {
      "rating": "10",
      "text": "I could not follow this mixed up movie.  The depictions of heaven and hell showed heaven to be as depressing as hell, some place no one would want to be. I finally just turned the movie off since I got absolutely no enjoyment out of it, glad it was free. The only thing I really enjoyed about this movie was the beautiful home this couple lived in. That was all."
    },
    {
      "rating": "8",
      "text": "Death, love, soul mates, symbolism, heaven and hell - well blended in one movie. Adorable visual effects and music."
    },
    {
      "rating": "8",
      "text": "This movie was impressive. The Richard Matheson story was tremendous and the movie didn't totally lose the point of his story. The actors did well given a production where most everything must have happened in front of a green screen. Could the movie have been better? Absolutely! But it was infinitely better than much of the schlock coming out of Hollywood."
    },
    {
      "rating": "2",
      "text": "Besides the film being visually appealing the acting fails to impress along with its confusing story that is supposed to be emotionally gut-wrenching which it isn't. I give this film 24%."
    },
    {
      "rating": "5",
      "text": "Bit too weird and slow to be good but has some nice visuals and decent acting."
    },
    {
      "rating": "6",
      "text": "The main thing about this movie are the visual effects, which are awesome for the year 1998! Heaven and hell are shown in a subtle way, which is very interesting and really memorable. The actors are disappointing and the story is predictable. But it's touching and good picturized from this great book! All in all, it's good but could've been way better! (I liked the alternative ending on the special DVD better - look for Wikipedia if you want to know what it is!)"
    },
    {
      "rating": "10",
      "text": "It tells the story of a love that is so strong which lasts even in the other universe. The story, actor's performances, directing and everything else were excellent."
    }
  ]
}