{
  "id": 2782,
  "title": "What Women Want",
  "starring": [
    "Mel Gibson",
    "Helen Hunt"
  ],
  "runtime": 127,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "Advertising executive Nick Marshall is as cocky as they come, but what happens to a chauvinistic guy when he can suddenly hear what women are thinking? Nick gets passed over for a promotion, but after an accident enables him to hear women's thoughts, he puts his newfound talent to work against Darcy, his new boss, who seems to be infatuated with him.",
  "releaseYear": "2000",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/n5NOxrcgeiCxvEn47FG9bvlHNsV.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 8.181818181818182,
    "ending": 5.0,
    "soundtrack": 8.0,
    "cinematography": 8.0,
    "familyFriendly": 5.0,
    "funny": 8.153846153846153,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "This film isn't exactly groundbreaking in any significant way.  Nevertheless, it is a very solid film...  if you can suspend your belief regarding the mind-reading (and the way he gains and loses the ability).   Mel Gibson gives an absolutely stellar performance and looks pretty good to boot.    Helen Hunt's performance is also quite sublime.   This film even deals with the topic of suicide in a very profound and tear jerking way.  I had to pause the film so as not to break out in tears...  and I'm not the type to cry at films much\r All in all its worth a watch"
    },
    {
      "rating": "8",
      "text": "A movie that is worth seeing for the unique storyline and the comedy resulting from the theme of the movie."
    },
    {
      "rating": "8",
      "text": "________________________________________________________mmmmnihihihihijijjjji"
    },
    {
      "rating": "8",
      "text": "niniuhugfttfgunojokpkpkijihgytdrseawwrtgughiononinonjookomigrewetuomhguugihinihihihihih"
    },
    {
      "rating": "8",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "8",
      "text": "Mel is very funny in this movie. It has many laughs, a diverse plot and some of Mel's best acting since Braveheart. If you haven't seen this, you have to see this comedy today."
    },
    {
      "rating": "8",
      "text": "What women want is a hilarious comedy. Mel's character Nick is a ladykiller who works in advertising in New York. One evening he has to use these feminine products and come up with an idea on how to market one. He decides to use some of them with comical results. After he humiliates himself he accidentally electrocutes himself without dying and he wakes up the next morning on his washroom floor. All of a sudden he can hear all of the women's thoughts that he interacts with. He is afraid but then he realizes the advantages his power offers him. You have to suspend your disbelief as to how he attains and loses the telepathy. The movie is amusing and all of the supporting actors are on point. This is a comedy anybody can enjoy on a day off or on a weekend."
    },
    {
      "rating": "10",
      "text": "°》°》°》°°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°@#@#@#@#@#@#@#@#@#@#@#@#@#@#@_@_@_@_@_@_@_@_@_@_@_@_@_@_"
    },
    {
      "rating": "0",
      "text": "Awful, brainless, misogynist tripe."
    },
    {
      "rating": "10",
      "text": "Mel Gibson's charming performance shines in an otherwise moderately amusing movie. He's become the best comedic leading man I've seen in a very long time--maybe ever. I'd have to go all the way back to Cary Grant to find anybody even comparable, but Gibson offers accessibility and vulnerability that Grant never had. He even makes romance with Helen Hunt believable. Marisa Tomei is good too, beautiful and sweet. I give it a 10 because Mel Gibson is so astonishingly good. Otherwise it'd get about a 4."
    },
    {
      "rating": "8",
      "text": "A comedy that works well because of Helen Hunt and Mel Gibson. I think today a movie like this would not be made as there would be an uproar. However I can clearly see why other dislike this as while good is not a masterpiece and could do more with the idea. The movie follows Nick Marshall who is a chauvinist and works in an advertisement company. When he is expecting to be promoted he is surprised that his boss instead will hire Darcy McGuire. She is tasked to improve the advertisement towards woman. This is a field where he has no experience. For Nick this is a shock and even more his estranged daughter stays with him as his ex-wife is on the honeymoon with her new husband. Thinks start to get momentum when he accidentally archives the ability to read woman's thoughts. I stop here to avoid spoilers. The story is good and the humor works well. I was entertained and would rewatch the movie. As remark the focus is more on humor than on handling serious issues but it does get the last thing done too. By today's social justice standards it would start an angry woke mob. The idea itself is excellent. Each of us man has wondered how woman think. There are often fundamental differences. Like the still true cliche that woman often do not point out what is wrong. Instead they want that man come on the correct conclusion on their own. I have experience with this with a female friend who talk about this with me and I said her that her boyfriend will never come to this conclusion if she did not say this directly. Was right and she thanked me. A comedian once translated this: If your girlfriend is angry, you ask her if anything is wrong and get the answer “Nothing is wrong” than it means there is something terrible wrong and you have to find out what you did wrong as soon as possible. Back to the movie review. The idea is used well to be enjoyable but not in such a great level to be remembered as cult classic. I think the cast made this better and I can see it failing without. First there is Mel Gibson as Nick Marshall. He delivers the character excellent and is fully believable. With Helen Hunt you can basically do no wrong. As Darcy McGuire I say the same as for Mel Gibson. She fully delivers. Then there is Ashley Johnson as Nicks daughter Alex Marshall. Great performance by here. Other than those the rest also made no missteps. The humor like I said works well enough to make this enjoyable. Overall I would recommend this movie for the idea and humor. It might not be a cult classic but works well enough to entertain."
    },
    {
      "rating": "8",
      "text": "Personally, I think this is one of the best romantic comedies I've ever seen. Fun and contagious, it's one of those films that wasn't made to be a work of art or to win prizes, but to amuse, entertain and have a good time. And it's effective at that.The script begins with the introduction of Nick Marshall, a misogynist womanizer who works in advertising. He thinks he is the biggest male around and considers himself a lucky man in the relationship with the opposite sex, although he doesn't particularly consider him out of the way. However, everything changes with the arrival of a new boss, Darcy. She is the agency's new creative director and will be tasked with capturing a market share that Nick can't take advantage of: female consumers. While doing some silly experiments with women's products, trying to figure out how to work with them, Nick gets an electric shock. The next day... voilà! He can hear women's thoughts, and the new and unknown world of the female mind is at his mercy!The film is excellent in every way. Of course, the story's premises are imaginative and credibility isn't even an issue because it's something so clearly invented that such a question doesn't even arise. The pace is quite fast and events continue as Nick tries to deal with his latest skill and discovers that, after all, women don't think he's as amazing as he thought. The relationship with his daughter is also convincing and well-used in the film.The cast is expertly dominated by Mel Gibson. The actor is funny, pleasant and competent in the role he was given. He's perfectly capable of taking the film through to the end, but he manages not to overshadow the brilliance of Helen Hunt, with whom he co-stars wonderfully, in a collaborative effort full of chemistry and good spirits. In a secondary but very witty character, the beautiful Marisa Tomei also does an excellent job. I also liked Ashley Johnson's work, but she has little to do, and the character demands little from the actress, in my opinion.Technically, it is a discreet film, which leaves the story told the space it needs to shine and develop, capturing our full attention. The cinematography works very well, and all the filming work was exquisitely well done, with competent use of color and light. The costumes, unsurprisingly, adapt wonderfully to the characters and the way they develop. The soundtrack works well, and features an excellent song by Meredith Brooks called **** which is still a hit today."
    },
    {
      "rating": "10",
      "text": "Honestly this is probably my favorite romance movie out of all that I've seen. I wish I was able to hear what women think. That would be sweet."
    },
    {
      "rating": "8",
      "text": "||||||||||||||||||||||||||||||||||||||||||||||||||||||||,,,,,,,,,,,,,,,,,,,,,,,,,》》》》》》》》》》》》》》》》》》》》"
    }
  ],
  "recommendations": [
    "the_intern",
    "the_upside",
    "pretty_woman",
    "blue_jasmine",
    "morning_glory",
    "the_devil_wears_prada",
    "silver_linings_playbook",
    "joy",
    "don_jon",
    "hustlers",
    "the_second_best_exotic_marigold_hotel",
    "the_dilemma",
    "chef",
    "groundhog_day",
    "as_good_as_it_gets",
    "eddie_the_eagle",
    "gifted",
    "sleeping_with_other_people",
    "last_vegas",
    "the_royal_tenenbaums",
    "midnight_in_paris",
    "i_feel_pretty",
    "vicky_cristina_barcelona",
    "good_will_hunting",
    "going_in_style"
  ]
}