{"id": 1377, "title": "What Men Want", "starring": ["Taraji P. Henson", "Aldis Hodge"], "runtime": 117, "genre": ["Comedy", "Romance"], "description": "Magically able to hear what men are thinking, a sports agent uses her newfound ability to turn the tables on her overbearing male colleagues.", "releaseYear": "2019", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/30IiwvIRqPGjUV0bxJkZfnSiCL.jpg", "categories": {"plot": 3.6666666666666665, "acting": 4.25, "ending": 5.666666666666667, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 5.444444444444445, "action": 5.0}, "reviews": [{"rating": "3", "text": "So the new current in Hollywood to make ''inclusion'' is to redo stories already portrayed by men?Yeah, it's not working.Mel Gibson may be an **** but it was an **** with charisma in that film. Taraji P. Henson isn't but a shadow of what the role needed it to be."}, {"rating": "3", "text": "A fun idea on paper, that just wasn`t brought to fruition. Some people did not try hard in the acting and writing departments. There are still some laughs to be had, but some decisions in the plot and jokes just don`t go really well. Leading to a disappointing film."}, {"rating": "2", "text": "I'm giving this a two because of the lack of creativity & the annoying trend of gender swapping. Not to mention the movie was pure garbage. The Mel Gibson version of this movie was 10x better."}, {"rating": "6", "text": "It’s fun and watchable. Simple, predictable and watchable. Plus, Henson is a dime and a natural treasure."}, {"rating": "7", "text": "I think a 49 Metascore is WAY too low.  There are some HUGE laughs in this film.  Tiraji is incredibly funny - great slapstick. And the flow of the film is excellent. Only the ending falls a little flat, but by then, who cares?  Big thumbs up for this effort."}, {"rating": "10", "text": "So better than the original. I really enjoyed every single moment of this masterpiece"}, {"rating": "4", "text": "Taraji P. Henson plays a sports agent who's frustrated by lack of equity with the men...until she becomes able to read their minds. This gender switch on the Mel Gibson starrer makes a female empowerment statement, but offers little humor. Henson tries manically to be funny, but seldom succeeds. The best comic moments go to Tracy Morgan and they feel his adlibs. Anytime you see 10 writers in the credits is a sign that things aren't going well. Although there's plenty of energy, this is simply not amusing. The outtakes during the credits provide the most fun."}, {"rating": "5", "text": "I did think it was quite funny even tho it is reusing the same plot that was there with Mel Gibson. Plus also if they wanted to make it inclusive for women then kinda making it still a bit sexist at points and countering what they wanted to do then. Anyway, wasn't that bad but nothing impressive either."}, {"rating": "5", "text": "\"What Woman Want\" was one of the best and most striking comedies of the dawn of the new century, and it has remained relatively current and fresh. Films like this generate followers and, not infrequently, imitators. This film, despite being directly inspired by it, also ends up following some similar films (sometimes with the same name), which goes back to the beginnings of cinema. It's true, it seems that filmmakers have been trying to understand the male head for a long time.In this film, we follow the combative and intemperate Ali Davis, a woman used to surviving (and imposing herself) in a world of men. She works for a sports agency, and promotion is a long-cherished dream. However, when she is passed over by another colleague, despite feeling that she deserved to be promoted, she loses her temper. That same day, a strange sequence of events leads, the next morning, that she wakes up with the frightening ability to hear men's thoughts... and it won't be long before she understands that she has acquired a powerful weapon to get everything she's ever wanted. But the new power will also test her ability to bond with others, starting with her friends, her gay assistant and the one-night stand she will eventually fall in love with.The movie is not bad. It's an adaptation that sometimes sounds bad, works in a forced way, and it will even take, sometimes, a kind effort on the part of the audience to ignore the flaws and inconsistencies of the characters' behavior. However, I confess, I was capable of all this and the film ended up working, albeit with difficulty. No, in fact it's not a bad movie, but it's far from good. On top of this, the movie sometimes utterly fails to be funny, and I get the idea that the male mind is more complex than what's been showed here. In fact, I'm convinced that some men would find it insulting if a woman assumed that men only think about sex, football, uselessness, partying, and food.Taraji Henson is the soul of the movie, and it's her ability to do some well-crafted comedy and to make her character likable that ultimately helps the movie to work better. She's funny and was able to make her character evolve favorably, become more human and understanding, but the histrionic, noisy and screaming way she acts becomes tiresome after a while. I liked, even so, the excellent partnership with Josh Brener. Both worked really well together, and Brener is really good in his role. Tracy Morgan is also histrionic and paranoid, but turns out to be less fun than Henson. Aldis Hodge also did a very well done job, but I felt he had a role that gave him relatively little to do other than being the love interest of the main character.Technically, it's a regular film, which is nothing particularly notable: the standard cinematography and well-done editing are nothing special. The sets and costumes are good, being in the standards of what could be demanded in a film of this genre. I especially liked the corporate setting of the company and also the medium/weed dealer's studio. I also really liked the end credits, with an interesting digital design and lots of extra scenes."}, {"rating": "4", "text": "Would never watch this film again. I was dragged to see this as my friends were too afraid to watch \"us\" and similarly this film felt like a drag at points as well. The story was ok in an unoriginal way, we all knew what was going to happen immediately when the story line was set up. Actually, the whole movie was predictable. My main concern was the jokes, or rather lack thereof, it seriously doesn't qualify as a comedy but instead should be called light hearted. I also believe that overacting or being so exaggerated to the point of becoming a caricature is not enough to make a film funny. Taraji is ok, she has found a niche, and works tight within it, she is likeable but doesn't quite save the film. The film is littered with irrelevant characters and we don't really care what they do let alone what they think, especially when they are treated as a crude opportunity to say a joke that doesn't really land. This film is very shake and go; where its formulaic approach ruins the film."}, {"rating": "10", "text": "People complain too much, the movie was good. It was funny and I really enjoyed it."}, {"rating": "0", "text": "Anyone who enjoyed this movie can say they are retard.ed.The movie is very boring with a lot of unnecessary scenes"}, {"rating": "0", "text": "Being a big fan of What Women Want I was very much looking forward to it. But efforts to make it more inclusive made it not funny, not witty, less believable, or to put it simply plain boring. So much potential wasted. Characters are dull and story has too many glue moments where screenplay doesn't connect from one place to another. It felt like they tried to diverge from original but didn't have idea how so just added filler scenes here and there. One of worst movies I had pleasure watching."}], "recommendations": ["thor_love_and_thunder", "the_cobbler", "i_feel_pretty", "burn_after_reading", "the_men_who_stare_at_goats", "ant_man_and_the_wasp_quantumania", "kingsman_the_golden_circle", "the_five_year_engagement", "inherent_vice", "logan_lucky", "mortdecai", "the_gentlemen", "how_to_be_single", "the_spy_who_dumped_me", "lucky_number_slevin", "keeping_up_with_the_joneses", "the_dilemma", "palm_springs", "baywatch", "deadpool_2", "the_happytime_murders", "magic_mikes_last_dance", "shazam_fury_of_the_gods", "tag", "the_family"]}