{"id": 4323, "title": "What Happens in Vegas", "starring": ["Cameron Diaz", "Ashton Kutcher"], "runtime": 99, "genre": ["Comedy", "Romance"], "description": "During a wild vacation in Las Vegas, career woman Joy McNally and playboy Jack Fuller come to the sober realization that they have married each other after a night of drunken abandon. They are then compelled, for legal reasons, to live life as a couple for a limited period of time. At stake is a large amount of money.", "releaseYear": "2008", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/x3yN37OKHOzqnwa5sum8Ut4nobY.jpg", "categories": {"plot": 5.7272727272727275, "acting": 4.2, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 6.870967741935484, "action": 5.0}, "reviews": [{"rating": "3", "text": "This movie is so stupid in almost every way. Cameron Diaz and Ashton Kutcher have pretty bad character development due to what immature idiots they play. They don't make a very good couple either. The gags, the jokes, and the dialogue is stupidly sexist and vulgar."}, {"rating": "0", "text": "More sexualized unrealistic crap that let's our children and some adults think getting drunk out of control and acting like an idiot will turn out just fine."}, {"rating": "10", "text": "It was actually a really funny movie. We laughed all the way through it."}, {"rating": "7", "text": "The movie is just hilarious it's light hearted and entertains the audience. I definately recommend."}, {"rating": "6", "text": "it's supposed to be a light movie putting that in mind you'll never go under the influence of expecting too much...I did like it and there was something real about it... and of course ADORED Lake Bell's Part and Rob Corddry's too .. and the judge when talking bout his wife"}, {"rating": "7", "text": "I usually live by Metacritic scores, but I didn't think it was that bad!!"}, {"rating": "1", "text": "Thanksgiving came early this year as this is a Turkey alert complete with all the trimming. The critics got it right. Avoid."}, {"rating": "2", "text": "It gets two marks - one for the guy playing Ashton Kutcher's sidekick, and one because it only made me roll my eyes five times, therefore beating the spread."}, {"rating": "10", "text": "This film was both funny and touching at the same time, I thought it was great, and screw what those film critics think, they could find a problem in an angel."}, {"rating": "8", "text": "This Comedy is very, very funny !!! Asthon e Cameron is big !!! Very good...compliments !"}, {"rating": "7", "text": "Very funny!"}, {"rating": "9", "text": "Very Very Funny ! Is a Big Comedy Movie ! Cameron is Beautiful ! Compliments at the cast !"}, {"rating": "6", "text": "Good for a few laughs... far between each other... and that's about it. It's the kind of film you'd expect Ashton Kutcher to be in, but maybe not Cameron Diaz. I do hope she gets better scripts in the future."}, {"rating": "9", "text": "Truthfully, you can definately see from the beginning where this is going. However, the ways that they get there are creative and funny. As chick flicks go, this one is really quite good! My only disappointment is that I expected some hate sex--but even without it the film was good."}, {"rating": "8", "text": "It's a fun movie, better then expected after reading the reviews. I don't know why they dislike it, I enjoyed it and I'm glad I saw it."}, {"rating": "2", "text": "One of the silliest flicks I have seen lately. Painfully unfunny."}, {"rating": "10", "text": "Very funny!"}, {"rating": "7", "text": "Good. Funny. NYC loclaes are cool. \"Dick Banger!\""}, {"rating": "9", "text": "Yes, we have seen it all before, but not like this. It was a fun and funny movie. Cameron and Ashton works! It's been a while since I enjoyed comedy like this. I liked that I can enjoy antics of drunken people while I'm soberly drinking my soda. It's very NYC more than Vegas. If you're looking for depth, don't watch a romantic comedy. Duh!"}, {"rating": "3", "text": "With its aggressively reactionary attitude towards Type A women in the workplace, it's surprsing to discover that \"What Happens in Vegas\" was written by a woman. The film reduces the stature of day trader Joy McNally(Cameron Diaz), through a series of degrading encounters with Jack Fuller(Ashton Kutcher), who she married under the influence of an all-night bender. And then there the matter of the slots. The slots make her a slut for the almighty dollar. When they finally do embark on their new lives together, Jack will take on the role of sole provider, because Joy decides that she'd rather do nothing. She turns down a promotion at her stock brokerage firm to be a trophy wife. Joy, literally, looks like a prize in her trophy-colored dress(a gold dress), when she asks Jack to unzip the back. This gesture of servility is a sort of unspoken promise that she'll ditch her \"travelin'\" pants(the pants belonging to a sisterhood of strong women), so he can wear his, when their union becomes legit. \"What Happens in Vegas...\" debases Joy by making her fawn over a man who displays nothing but contempt for this ambitious woman during their alleged courtship. Any sane female with a measure of self-respect for herself would walk out the door after falling inside a toilet bowl, and eating popcorn with possible trace elements of \"hair-gel\". The contrivances of this rom-com doesn't bother me; it's the misogyny."}, {"rating": "5", "text": "Okay, I knew it was a date-movie before purchasing the tickets. I expect fluff, some comedy and predictability. Sometimes I am surprised by a film in this genre; but not this time. I will admit that it began with enough energy to spark a little hope I might leave surprised. However, it ran out of gas after the first half hour and coasted to an ending so predictable a pre-adolescent could write it. What saves this ilk of film is that entertaining twist and elbow-in-the-ribs ending. The movie was void of both. I did find myself contemplating one serious matter: How long did it take for the Queen to learn her lines? She can be an amazing, mesmerizing presence in film and yet, they probably shot her scenes in one afternoon. She could very well have been the comedic shot in the arm the film could use."}, {"rating": "10", "text": "I usually don't like mainstream hollywood movies, but this is definately a good one. Its not a serious or realistic movie and i dont think it was meant to be. This is just a funny entertaining movie that I would recommend to anyone."}, {"rating": "6", "text": "Very predictable, but I found it very entertaining and funny as well. I enjoyed the characters and the chemistry between Ashton Kutcher and Cameron Diaz. Good supporting cast. Light and enjoyable."}, {"rating": "10", "text": "I was surprised at how much I enjoyed this movie. Funniest and all around most enjoyable romantic comedy I have seen this year."}, {"rating": "10", "text": "All critics are complaining about cliche... why does a person buy a dvd? to watch the same movie that they like over and over again! so what's wrong with making a movie of the genre that many people like, except with different actors, a different storyline and different jokes!? Obviously the critics would have known what this movie was going to be about, and if they don't like the genre, then why the hell watch the movie and then criticize it for being exactly as it should be. Critics are so stupid it's beyond words... all they're looking for is a movie that makes absolutely no sense, so they can say that it is really smart and appear as if they're the only ones who understand it, thinking this will make them seem like the clever ones"}, {"rating": "4", "text": "One of the predictable comedies. There is no interestin dialogue and Ashton Kutcher is sometimes overacted. It is though very funny at moments and really catch you in some scenes. The director does not do a very good job though the two supporting actors are pretty well chosen. With Ashton and Cameron they could have done a better comedy moviethough I think it is difficult."}, {"rating": "10", "text": "I thought it was hilarious!!! I laughed through the entire movie, even cried a couple of times from laughing so hard... Best comedy I've seen in a long time!"}, {"rating": "4", "text": "Silly romantic movie that has a predictable conclusion, shallow acting and few genuine moments."}, {"rating": "9", "text": "I was surprised to see such bad reviews for this one, i liked it, i thought it was great. It was funny all the way through, and i think it deserved much better reviews than it got."}, {"rating": "6", "text": "This movie was not entirely boring but it was pointless. I was looking for something to not have to think too much about while watching, and this is one of those movies for sure. It didn't really have much funny moments but I did like the messages of the movie about love, money, and happiness."}, {"rating": "9", "text": "Before the Hangover, there was What Happens In Vegas. It didn't get the same cult following simply because it was billed as a romantic comedy, but it was almost as funny and has a cameo by Zach Galifinakis. The story is about a couple of friends getting drunk and hooking up in Vegas. After a drunken marriage, Diaz and Kutcher gamble, winning 3 million dollars. They go to court, being that they want and divorce and don't wanna split it, and the judge played by Dennis Miller puts the money in escrow, forcing the couple to live together for 6 months. That's when they find out how different they really are. This movie is hysterical, fun, and much better than the previews which by no means do it justice. If you like comedy and you enjoyed the Hangover, check it out!"}, {"rating": "4", "text": "A small dose of humor cannot redeem this movie from its ridiculous logline and even more ridiculous third act."}, {"rating": "7", "text": "Not a bad movie... despite it's cliches it's a nice and funny movie\rDespite some other users/critics criticised the movie for sexist and a bit vulgar jokes but it's not a movie for kids for Heck's sake.."}, {"rating": "5", "text": "This movie is pretty much what you see on the box (or cover, so to speak), it features Ashton Kutcher and Cameron Diaz as a 'couple' that are forced to stay together and put up with each other in order to get the $3 million. The movie features more comedy than romance for the majority of the movie, although the ending is a bit annoyingly preachy and not so funny, which made it a bit of a let down for me and almost makes you wonder, who their accommodating for? certainly some elements of the movie will appeal to men and others perhaps more to women, though I don't like to be seen as generalising too much and I don't want to go into any details incase it spoils the movie for anyone. The story has some similarities to The Hangover, only this is lower key but the gags are still pretty low-brow, with some crude-ish jokes/innuendo and so on included, you've been warned - of course this is a film with a 12 rating not a 15 rating like The Hangover and I wouldn't say its quite as outrageous storywise as The Hangover, though its another comedy that has a moral to it (dont party too hard and drink too much or you never know what might happen and going all out in Vegas can lead to some unlikely situations!).. Speaking of The Hangover, I should mention that Zach Galifianakis appears in this movie, he is, of course, mainly known for playing Alan Garner, one of the main characters in The Hangover (btw I hear there's a 'The Hangover II' in production), in this movie he plays the character 'Dave the bear' - not a main character but one of Jacks friends, I think, who shows his surprise and jealousy to Jack for him landing who he sees as a right good catch (aka Joy), put it that way. Kutcher and Diaz give pretty decent performances I suppose, there's not much to be said really, it is what it is, a rather light hearted comedy with a few surprise laughs (ie gags that I wasn't really expecting and that were funnier than others). Male viewers will likely enjoy watching Diaz in terms of eye candy, there are one or two shots of her scantily clad (wearing a bikini or underwear I think) and equally for female viewers, Kutcher is on good form and there's the odd scene of him topless, which im sure some people will appreciate(!). Its all a bit predictable, Diaz as Joy, the ratherly more ambitious woman who is determined to get the money and not let Jack win and Kutcher as Jack, the markedly less ambitious guy who finds it difficult to think of the answer when their marriage therapist/counsellor (who, by the way, is played by Queen Latifah - her role is pretty short lived but I quite like her in the comic roles she plays and I kind of liked this character too) asks what his hobbies are, there's the obvious comedy around the two of them having to make concessions for each other as they settle in to life living in Jacks apartment, Joy having to deal with being in a mans apartment, one that isn't as hygenic as she would like (what with him being a lazy guy), you get the picture and then there are the situations that you know will lead to comedy - you can pretty much guess the majority of the story if you bother to but thats not to say that the movie isn't enjoyable or entertaining, it is. This may seem a bit confusing but basically its a comedy movie that does have its laughs, it has its limitations for sure but is it funny and watchable all the same? yes - for what it is, its quite amusing in parts, overall as a movie its alright, indeed I think some people will enjoy this more than others, it depends on what you expect, what kind of movies you like etc.Read the last paragraph above. I think this movie will appeal more to some than others, if rather basic/predictable storylines or 'chick flicks' irk you at all, then I'd recommend that you steer clear of this title but otherwise I can say that I thought this movie was pretty entertaining, its certainly watchable, though its not very memorable, I wouldn't want to see it again but it passed the time ok. I felt that the ending was a bit of a let down, although others might disagree, it just depends on whether you like this kind of movie or not. Overall its not a great movie, nor is it an awful one, its decent enough with the odd extra funny line/scene but it definitely doesn't cover any new ground and the ending, like I've said, was a bit of a let down to me personally. Judge by what I've said whether you'd enjoy it."}], "recommendations": ["the_proposal", "the_change_up", "trainwreck", "the_ugly_truth", "hall_pass", "rough_night", "the_watch", "this_is_the_end", "just_go_with_it", "30_minutes_or_less", "knocked_up", "thunder_force", "yes_man", "dinner_for_schmucks", "the_hangover", "a_million_ways_to_die_in_the_west", "the_wedding_ringer", "grown_ups", "zack_and_miri_make_a_porno", "neighbors_2_sorority_rising", "the_wrong_missy", "forgetting_sarah_marshall", "identity_thief", "good_luck_chuck", "hot_tub_time_machine"]}