{"id": 4261, "title": "When the Bough Breaks", "starring": ["Morris Chestnut", "Regina Hall"], "runtime": 97, "genre": ["Mystery", "Thriller", "Drama", "Horror"], "description": "A surrogate mother harbors a deadly secret desire for a family of her own with the husband who is expecting to raise her child.", "releaseYear": "2016", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/mHNAzwNJmEllFa5Lt1RjyyXoGMS.jpg", "categories": {"plot": 2.1, "acting": 1.2, "ending": 4.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 2.0, "action": 5.0}, "reviews": [{"rating": "4", "text": "They say movies are only as good their villains, and when you have, not only one, but two villains that are as incompetently written and inconsistently performed as this film's. . .well that just about says all that needs to be said about how good it really gets. John Cassar's domestic thriller skimps on the intrigue and suspense, ultimately fulfilling an unintentional result promised by the film's lullaby-inspired title. Yes, folks, just like \"Rock-a-bye, Baby,\" \"When The Bough Breaks\" will almost assuredly lull you into a deep, dark slumber, even with the most earnest efforts of both Morris Chestnut and Regina Hall bolstering its fallacy-ridden narrative."}, {"rating": "2", "text": "Garbage in a nutshell. They take two classical clichés and mix them into total trash that doesn't belong in any theater that is playing this movie. When you blend in elements to make 'When the Bough Breaks', you won't get happy results whatsoever."}, {"rating": "1", "text": "I like Morris Chestnut, I've always thought he was a better actor than the movies he stars in. When the Bough Breaks is no exception to that statement. The acting from the two leads is fine but everything else is not. The movie's plot is garbage that tries hard not to be garbage and carries every cliche from \"Fatal Attraction\" to the equally bad \"Obsessed\" in it as well."}, {"rating": "0", "text": "this was plain excrutiating. Can someone at least tell me what the hell's going on in Hollywood lately? This was the dullest experience I have had in the movies so far this year."}, {"rating": "0", "text": "One year ago, a movie called The Perfect Guy was released. It was enormously cliché and definitely flawed, but it had potential which at the very least made it watchable.\rEnter When the Bough Breaks, the by-product of a thermonuclear warhead strike on The Perfect Guy. Anything good about The Perfect Guy is now missing from this film. Also keep in mind that this film was released two weeks after Don't Breathe...which was made by the exact same studio.\rLike Nine Lives, this film is insanely bad. The characters are terrible, the plot is wholly uneventful, and no character emerges as good when everything comes down. For the sake of making a longer movie, the studio probably wanted the movie to operate off of convoluted plot points.\rDon't bother watching this film. It has nothing to say and nothing interesting to show. It is all a broken promise that was probably caused by that thermonuclear warhead. From the microscopic pieces, the studio not only poorly Frankenstein-ed it back together, but it forgot about all the problems that The Perfect Guy had."}, {"rating": "4", "text": "It's like a falling tree dropping a seed on the ground.I have to agree with the film critics on this one. Felt like I have already seen this film, but it turned out to be a very familiar thriller theme. It had plenty of issues and the first thing was the main plot in which the story built on. The mother-child connection is a very sensitive matter and that's where the film got stumbled. Even though they wanted to do film on that, they did not convince with the portrayed of the surrogate mother. From the entertainment perspective, it lacked the thriller big. The climax was all the sudden and then it ended just like that.At first I thought it might be a remake, but it was inspired or borrowed the theme from elsewhere. This psychological-thriller focused on to tell the tale of a wealthy childless couple. They decide to hire a young and beautiful Anna to be their surrogate mother. When everything was going very well, Anna's crush on the man she's carrying a baby begin to blow the things off. So now what happens to the couple, Anna and the baby revealed in the final segment.Thankfully, this is not the worst film of the year. I have even worse than this. But this can be easily a skippable one. There's no complaint over the actors, they had given what the characters demanded. Rich in quality, not a bad film from the technical aspect. Those are the area where it got scored a few points from me. If the screenplay had developed well, the film would have been in a different league. Particularly, I did not like the lack of diversity, looked like a black film for the black viewers. There are lots of similar films which are much better than this one that you could try.4/10"}, {"rating": "10", "text": "I was hesitant to see the movie.  But at the last minute, I said okay....let's go see it!!! I was pleasantly surprised.  I actually enjoyed the movie.  It was great to see a decent movie with an all black cast, without a lot of profanity and no gang bangers and other stereotypes.  I was pleased.  I would definitely recommend this movie to others.  I always like Morris Chestnut.  He is a pretty good actor."}], "recommendations": ["what_happened_to_monday", "the_loft", "house_at_the_end_of_the_street", "the_purge_election_year", "hancock", "the_conjuring_the_devil_made_me_do_it", "the_new_mutants", "the_craft_legacy", "the_invasion", "lucky_number_slevin", "now_you_see_me", "a_perfect_getaway", "man_on_a_ledge", "the_number_23", "colossal", "code_8", "rocknrolla", "cube", "black_panther_wakanda_forever", "broken_city", "the_good_liar", "gone_girl", "x_men_apocalypse", "jumper", "the_departed"]}