{
  "id": 1272,
  "title": "Where the Wild Things Are",
  "starring": [
    "Max Records",
    "Catherine Keener"
  ],
  "runtime": 101,
  "genre": [
    "Family",
    "Fantasy",
    "Drama",
    "Adventure"
  ],
  "description": "Max imagines running away from his mom and sailing to a far-off land where large talking beasts—Ira, Carol, Douglas, the Bull, Judith and Alexander—crown him as their king, play rumpus, build forts and discover secret hideaways.",
  "releaseYear": "2009",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sDFV9VEjwTUWF1s5sjOllsb70jk.jpg",
  "categories": {
    "plot": 5.473684210526316,
    "acting": 7.0,
    "ending": 2.6,
    "soundtrack": 3.2857142857142856,
    "cinematography": 9.333333333333334,
    "familyFriendly": 3.5454545454545454,
    "funny": 8.75,
    "action": 6.833333333333333
  },
  "reviews": [
    {
      "rating": "3",
      "text": "I just saw the film, Where the Wild Things Are, last night. There were moments that I really liked in the film but even in those moments I felt frustrated in that the movies main character had never been fully develope much less a sense of exceptionality in his life experience. Even when I tried to appreciate the setting and creation of the wild animals I was aware of my boredom. And as to the insights into childhood, I found those self-indulgent. One scene stood out to me. Before running away, the boy stands on the kitchen table saying \"Feed me woman\" and asserts more than he knows only to find that he is more terrified with his mothers remark, \"What is wrong with you? Maybe he knows in a post Freudian world living with a single Mom and watching his Mom flirting with her boyfriend. His answer is to set sail and find a new family where he can be King and in becoming King he becomes tamed. I like the insight but a whole film?"
    },
    {
      "rating": "8",
      "text": "While the story sagged a bit in the late middle, the rest had me gripped and enmeshed in the head of a 9 year old ( hard to do that with my mind)."
    },
    {
      "rating": "4",
      "text": "I'm going to go ahead and agree with everyone else; visually, this movie is stunning. Aside from that, I didn't like it. The whole movie was largely forgettable and boring. The music is distracting and it often took me a minute to discern the music from the actual audio of the film. The events are disconnected and just sort of happen one after another with no real flow or sense of plot. More than that, though, the movie seems to illustrate the point that life is terrible and no matter what you do to try and fix it, it will only get worse. Certainly not a message for a kids movie. And on that note, the movie seems to reward bad behavior more than it does anything else. The boy throws a tantrum for no reason and is gifted a kingdom. When he returns home, he gets cake. We leave the movie with nothing resolved, and I myself was annoyed.\r It's apparent that many people liked this film. I want to say people liked it because they expected to. I personally would recommend watching the trailer instead. It's much more moving and exciting than the film was."
    },
    {
      "rating": "6",
      "text": "More for adults than kids. Awfully serious and depressing, especially for kids. Takes patience to watch through, but moving near the end."
    },
    {
      "rating": "5",
      "text": "A sad experience, one that made me feel about myself rather than enjoying the innocence of youth. There's not enough story to carry a full movie, and the wild things seem more like reality show characters bickering amongst themselves rather than fantasy creatures. I was excited for this film, mainly because the story is brilliant and Jonze is very good, but I was sorely disappointed."
    },
    {
      "rating": "1",
      "text": "Now, yes. Many people.. are going to disagree with me, go ahead, hate me. I don't like this movie. I DESPISE THIS MOVIE!!! This is just too dark, too dark (by this part, I mean literally, JUST LOOK AT THE BACKGROUND PEOPLE!!!), and what is pretty much one of the worst costumes on a person for a kids movie, this movie is unappealing and is too dark for a children's movie. And I wanted to give it a chance, because when I was a little kid (or even a baby), this was one one of my favourite books, and you people are giving me this, how disgraceful."
    },
    {
      "rating": "7",
      "text": "Slow pacing does not hinder this enchanting movie, a story so innocent and at the same time so dangerous one cannot help but wonder if director Spike Jonze is secretly a ten years old kid. The integration between costumes and CGI looks beautiful  the Wild Things show real emotions and are never clumsy. At one point the movie starts going nowhere, but its delicate allegories and interesting look keep the attention up. Soundtrack is spot-on."
    },
    {
      "rating": "7",
      "text": "\"Where the Wild Things Are\" is a movie campier than its original book source, but director Spike Jonze successfully transfers the unbiased, pure perspective of a child (Max) to the audience."
    },
    {
      "rating": "2",
      "text": "The book is my all-time favorite children's story and still holds up as a wonderful tale well into my adulthood.  So forgive me if I take it a little personally when (the normally competent and entertaining) Spike Jonze comes along and turns it into a complete bore.  On top of being a snoozer, the world of the Wild Things is as stale and spartan as you can get... the complete opposite of the lush world created by Maurice Sendak.  There are also moments of scariness that I don't believe young children should see despite it's questionable PG rating.  So yeah, it's a kids' movie that's unsuitable for younger kids.  Good call on that one, Spike.  Altogether a huge, thudding disappointment that I would like to say would have Mr. Sendak rolling in his grave... except he's still alive... and he has a producer credit in the film. So an unfortunate big thumbs down to one of my literary heroes.    :(...."
    },
    {
      "rating": "10",
      "text": "A stunning, emotional , well acted and written movie. Although im glad many others give it a 10 i would disagree with any that state it not a childrens movie. Its for everyone that is or has ever been a child, and certainly some children ( just like the \" adults \" hear giving well thought out 0 reviews ) will find it boring but some will love it. It has a certain look like no other film . Everyone has differnt opinions on everything in life so dont listen to the ( incorrect ) bad review....know what your getting into and just watch it. U could be missing out on one of your new favs :)"
    },
    {
      "rating": "4",
      "text": "If you are a fan of this book, or if your kids are just now becoming fans of the book, please do not let them watch this movie, it will ruin the book for them. This movie does no justice to it. The only way you could watch this movie and maybe enjoy it a bit is if you had nothing better to do and you rented this movie. Otherwise stay way."
    },
    {
      "rating": "0",
      "text": "This movie was awful and definately not a kids movie. The openng scene with the sister kissing on the couch was unecessary and came without warning for me to prepare my small children. In addition, the disfunctional boy biting his mother and then running away was out of character with the book. The movie truly illustrates bad disfunctional behavior, but does not drive the point for children to understand why the behavior is unacceptable. THIS IS AN ADULT MOVIE, better suited for those trying to understand the depth and emotions of a disfunctional child!!!"
    },
    {
      "rating": "1",
      "text": "The movie is about a kid going to another world and trying to make everything right for them, but fails miserably and goes back home. It was really awful. Nothing even like the book my dad used to read to me when I went to bed at night."
    },
    {
      "rating": "3",
      "text": "Lots of good songs, lots of anger and lots of no story. Do not punish your kids with this movie - buy them the soundtrack instead."
    },
    {
      "rating": "0",
      "text": "Anyone who rated this movie above a 2 should seek help! Did Jones even have a script it seems the Actors were thrown on to set and Spike said, Ok say something! They seemed lost thru the whole movie, if Spike Jones would have just stuck to the book it might have been good instead we got this, I want my money back!"
    },
    {
      "rating": "0",
      "text": "Boring is one word to describe this movie. There are some slightly fun elements but everything is ruined by the story line which is lacking completely... it's just made up of disjointed ideas. The way the movie looks visually is amazing, but underneath the makeup there's really nothing of value that will stay with you, it just feels hollow on the substance front. It's a movie that kids won't understand or like and a movie that will leave adults disappointed thanks to the undeserved hype. At least the soundtrack is good, if you're a fan of Karen O and the 'Yeah Yeah Yeahs' you're probably going to be satisfied by the soundtrack rather than the movie."
    },
    {
      "rating": "0",
      "text": "This was the worst movie I have ever seen, and I've seen The Patriot and Transformers. It mistakes misery for profundity and strips all joy from childhood. Enjoy kids!"
    },
    {
      "rating": "3",
      "text": "I fell asleep and dreamed I had gone to see Zombieland instead. I really wanted to like it too, it's just that it's so boring."
    },
    {
      "rating": "0",
      "text": "The ugliest movie i ever seen in my life. i thought nothing can beat \"lady in the water\" or \"futuresport\" this sucks big time. It's about a retard kid that thinks he can do whatever he wants. wish that the monsters ate him right away so the film could end early. Boring!"
    },
    {
      "rating": "2",
      "text": "The sound track was good other then that this movie was horrible. Here is a quick plotline: Little kid ruins mom's date then runs into woods finds boat goes to other world ruins it then comes back satisfied and forces mom to make him food. It should really be renamed \"Land of Depressed Monsters\""
    },
    {
      "rating": "0",
      "text": "Yawn. A selfish kid full of self-pity goes to an unadventurous island inhabited by lame, unhappy, aimless \"things\" that are decidedly un-wild. Not sure how such psycho-babble nonsense was derived from the 9-sentence book. The mom's worshipful gazing at the end is repulsive."
    },
    {
      "rating": "2",
      "text": "First: Why did so many reviewers suggest this might be a kids' movie? It's a kid's movie for your wounded inner child. Spike Jonze said he wanted to capture how it was to be nine years old. Well, he succeeded, and maybe that's why I hate this movie so much. Nine for me meant divorce, yelling parents, separation, uncertainty and anxiety. I read books like \"Wild Things\" to imagine a place beyond all that. But the stressful home Max leaves (like mine) is Oz compared to the mopey, violent, joyless land of emo muppets he lands on. There is nothing bright or delightful about this world or this movie and Max is never in command of anything, but always fearful and sad. And yes, that was my nine, but that doesn't mean it makes a good movie. Especially when nothing happens, and for a long time. Masking the misery with indie-star voices and achy hipster tunes doesn't make it gold. \"Wild Things\" is painful and boring."
    },
    {
      "rating": "1",
      "text": "#1 NOT A KID'S MOVIE #2 Violent #3 Destructive #4 Without Resolution #5 Doesn't hold a candle to what happened in my imagination...wish I could erase this movie from my memory!"
    },
    {
      "rating": "0",
      "text": "DEPRESSING! DARK! AWFUL!"
    },
    {
      "rating": "7",
      "text": "Pretty good adaption of the classic children's book with good acting/voice acting, visuals and music."
    },
    {
      "rating": "7",
      "text": "Where the Wild Things Are may be the first family film in recent memory to rely not on narrative or character development but on ideas and the director's vision. The result is an involving experience for all but the most fidgety children and an opportunity for parents to enjoy (rather than endure) a motion picture with their offspring. For director Spike Jonze, this represents a \"pet project\" and it turns out better than is often the case when a filmmaker is too close to the source material. There are problems, but they are mostly minor and do little to detract from Where the Wild Things Are's effectiveness as a 2009 answer to The Wizard of Oz.\r The movie's plot is minimal; it's more about changes to Max's worldview than anything physical. Much of what happens on the island concentrates on his interactions with the various creatures he encounters there. It's here that things tend to meander as the dramatic momentum flags. In adapting Maurice Sendak's illustrated book, Jonze was forced to expand the canvas significantly, and this leads to some narrative and pacing issues during the midsection. Dorothy's journey along the Yellow Brick Road explores many of the same ideas with a tighter focus. Jonze also fashions a level of separation between Max and the audience, creating situations in which the intellectual resonance is stronger than the emotional one. One doesn't feel invested in Max's adventure in a way that would elevate this story to the high level achieved by the best children's story adaptation of recent years, A Bridge to Terabithia.\r The central relationship on the island is between Max and the giant Carol (whose voice is provided by James Gandolfini). Carol, for lack of a better term, represents Max's soul: a need for friendship and unconditional love coupled with the capacity for destruction. By coming to terms with Carol, Max learns to understand himself and, most importantly, the trauma he has been causing his mother. Another important friendship develops between Max and the nurturing KW (voice of Lauren Ambrose), who represents the aspect of Max we see early in the movie when he curls up by his mother's feet.\r The creature design is an incredible feat of imagination, evoking with near-flawless effectiveness the illustrations in Sendak's book. The Wild Things provide the impression of muppets and Big Bird (not surprising considering the involvement of Jim Henson's Creature Shop), but not in a cartoony way. They are the kinds of giant puppets that Sid and Marty Krofft would have used in H.R. Pufnstuf given the technology and budget. As \"cute\" as they sometimes appear, they are capable of generating an aura of menace. When Carol becomes enraged, there's nothing cuddly about him. The importance of getting the look of the Wild Things right should not be underestimated, since the film's success relies on this. Jonez and his team find the right balance between three-dimensional embodiments of the book's creatures and entities that work in the context of a live-action motion picture.\r Where the Wild Things Are is Jonze's third feature length motion picture (he is probably still best known for his music videos). The sense of visual imagination one has come to expect based on Being John Malkovich and Adaptation (both written by Charlie Kaufman) is fulfilled here. This movie is nothing if not an embodiment of Jonze's flair and style. Most importantly, it fulfills the #1 criterion of any family film: it involves viewers of all ages on different levels. Children will react viscerally (both positively and negatively, with delight and fear) to the creatures, pre-teens and young teens will connect with Max and instinctively relate to his experiences, and adults will recognize the allegorical nature of the experience and enjoy it for what it is. This is probably the best family film since Disney's Up, and one of the most visually interesting pictures of the year. Whether or not it's a big success during its theatrical run, this is the kind of movie people will be watching for years to come at home."
    },
    {
      "rating": "0",
      "text": "Truly Awful...long dreary depressing. I was relieved my four year old fell asleep so as not to ruin one of her favorite books. This movie truly sucked, in ways beyond my humble ability to describe, posing as a hipster film doesn't make it a good movie, just a pretentious one. Spike was waaaaay off the mark with this one!!!!!!"
    },
    {
      "rating": "6",
      "text": "Some people may walk into this show thinking it's a children's film, understandably as it"
    },
    {
      "rating": "10",
      "text": "Reminded me of my own youth but more creative and sprawling."
    },
    {
      "rating": "8",
      "text": "Good film, but it is so depressing. I still appreciate it for bringing that emotion out in me."
    },
    {
      "rating": "1",
      "text": "This movie was an unfocused, boring mess. Just because the director backlights practically every shot does not make it emotionally profound nor does it support any filmic metatexts. Key problems: 1. The monsters have regular adult voices, and these voices are used for complaining all the time thus crushing any form of escapism 2. Max is too old to be behaving like a 4 year old- he comes across as a kid with ADHD 3. The film is incoherent and formless with no building action, climax or resolution- if Warner Bros. wanted an art film, they could have gotten Godard to make it- and better 4. The film is political in the sense that if you don't like it you are vilified as a soulless conservative just because a committee of granola crunching potheads thought they were making a profound film. Don't ever bother watching this film. Read the book instead 40 times in the 101 minutes running time of this adaptation (and I use the term loosely) and it will be time better spent."
    },
    {
      "rating": "9",
      "text": "I found this movie delightful in a most refreshing non-Disney, non-pop-culture spouting, non-bosom baring princess sort of way. I disagree that this movie is not for children - and don't understand why it's \"better\" to feed children such a sanitized, marketable version of reality. Visually beautiful, emotionally real, and yes, \"wild\" in the truest sense - in that emotions, relationships cannot be tamed, nor should they be feared for this. Not a message I think we should keep from our children."
    },
    {
      "rating": "10",
      "text": "A beautiful and I think perhaps misunderstood film. This is not a Hollywood formula film. But to mistake that a child cannot enjoy this or relate to the film is unfortunate. My 9 year old daughter loved this film. This is not a film with a morale. It is a portrait of a child's emotions in a breathtaking format. My daughter giggled at the appropriate times. My daughter was quiet and thoughtful at appropriate times. The film is an accurate portrayal of a child in our modern world and all the feelings that get wrapped up into it. I'm not sure what folks were looking for. But it was sweet, heartbreaking and charming."
    },
    {
      "rating": "5",
      "text": "I really want to love this movie, just like the book, but just can't. The style, art, effect and music of this film are incredible, very imaginative and lively. The downside are the scary & depressing story, tone and dialogue throughout the film...it's like having a nightmare instead of inspiring children story. Just too bad."
    },
    {
      "rating": "10",
      "text": "This movie is very heartfelt and had me balling my eyes out at the end. It is way too dark for children, but will take you back to your childhood. I absolutely love this movie. Let your emotions run wild during this film."
    },
    {
      "rating": "9",
      "text": "Where the Wild Things one of the most anticipated films of the year is not a let down like many other films this year. But, if you are a parent and you are going to bring your children to see this film watch out. I think that this film is for 2nd grade and up and possibly 1st grade. This movie is appropriately rated PG not G. It's not that this film is to inappropriate for them well it little bit is but they probably won't get it. Just like what Julie N said don't go in expecting a kids movie. Now going on the specific's of the film you are probably wondering how did the little boy act. Well, Max Records that is his name is terrific except for when he is crying. He really has to work on that a lot. The role he plays is not an easy role. He has to play a boy who has more imagination then Walt Disney and highly sensitive. But what really surprised me was that he was really funny. Spike Jonze the director and the co writer really captured a lot of funny moments and I didn't think it would've been all that funny. For instance Max when he was mad and it was time for dinner he stood up on the table and said FEED ME WOMEN. It might not sound that funny but it is. Also Spike Jonze decided to use a hand held camera for some of the most of the film. If it wasn't a hand held camera I do not know what shaking that entire time. Gosh it felt like the Blair Witch Project sometimes. Also a mistake in the writing was that it wasn't descriptive enough some things about the film it never told us. To add on to that in the ending it started to get out of control. The critic inside me was not happy about the weirdness and craziness but the fan inside me loved it. So it was very hard to give a score on this movie. Mainly because it was very fun, wild and out of control but so enjoyable. That it twisted my brain around. I just couldn't decide. Overall a wonderful film not so much as a family film but still one of the year's best."
    },
    {
      "rating": "10",
      "text": "I never do these things, never comment or follow through with films after seeing them (unless with friends). Nevertheless, this movie was stunning. My vocabulary is limited and my mind is weary after seeing the 12 O'clock showing, but I will try to express how I feel. Every frame in this movie could be a photograph, every interaction between the characters is captured so strongly through the cinematography and the perfect setting (Australia). The Wild Things are all brilliantly played out and the pacing of the film is hurried (to accentuate the childlike impulsiveness of Max's mind). As a forewarning, this is not a film for children. It is a brutally dark and emotional film. The simple message from the story, some may have a problem with this, has been expanded into something incredibly large. It has become a tale about self reflection and allowing your mind to look at itself in order to learn what you are doing wrong. Max, the main character, is childish and immature. His anger is often untamed and he allows his sadness turn into aggression. The Wild Things are all branched out of his personality though and he has the opportunity to observe himself from an outside perspective. Its all so simply developed and displayed. There is not a moment in this movie that is misplaced or lacking of beauty. Enjoy it with an open mind."
    },
    {
      "rating": "10",
      "text": "I really cannot properly describe the way this movie made me feel. It's a film everyone needs to see, not expecting a blockbuster or a 'magical'/cliché Disney film, but rather an experience you haven't had since your best childhood moment. The melancholy lies in the fact that our childhood has been dead for decades, but we have our children to look forward to."
    },
    {
      "rating": "9",
      "text": "I really love this movie. I'm quite sure how my 7 and 9 year old children really felt about it. I'm hoping that it left them thinking. We talked about the themes of the film that they may not have understood on the own. I think it's a complex story, ideally for involved parents to take their older children too and discuss afterward. Don't expect children to fully enjoy or comprehend it without you. However, isn't that what parents are for? I enjoyed the absolute beauty and poignancy of the film. It was bittersweet."
    },
    {
      "rating": "10",
      "text": "This truly was - A Heartbreaking Work of Staggering Genius. I've never left a theater so emotionally devastated in my life. Frame after gorgeously shot frame just aches with sadness in this beautiful meditation on what childhood is like growing up in a broken home. My hat is tipped and my hand is over my heart."
    },
    {
      "rating": "10",
      "text": "By far the greatest, most imaginative, and clever film adaptation of a children's book ever done."
    },
    {
      "rating": "8",
      "text": "THIS IS NOT A MOVIE FOR KIDS.  ITS ABOUT AS KID-FRIENDLY AS PAN'S LABYRINTH.  THE YOUNG KIDS WERE TRAUMATIZED, AND I HAD TO LEAVE EARLY WITH MY 5 YEAR OLD.\r But it is a really excellent adult move.  It's unbelievable how that the excellent young actor carried the entire feature."
    },
    {
      "rating": "3",
      "text": "This film constructs and simultaneously deconstructs itself in each scene. The film's honest ending is a meager consolation prize for those patient enough to endure the existential vacuity of the film."
    },
    {
      "rating": "10",
      "text": "Moving, subtle film."
    },
    {
      "rating": "8",
      "text": "Not a kids movie, but super funny & deep."
    },
    {
      "rating": "10",
      "text": "As you can see from the scores, it would appear you either love or hate this movie. If you know what you are getting into before you see this movie, you will know it is not really a \"children's\" movie .. it is a movie ABOUT childhood. If you like movies that have the guts to go \"outside the box\" a little, you will appreciate this movie. It is an amazing accomplishment. Very powerful movie."
    },
    {
      "rating": "9",
      "text": "For all you people complaining about the movie because you brought kids to it, did you even see the previews before you went? As for me, I got what I expected and enjoyed the movie very much."
    },
    {
      "rating": "10",
      "text": "This film is pure, pure magic, and anyone who disagrees needs to think long and hard about what life was like when they were six and confined only by the limits of their imagination"
    },
    {
      "rating": "10",
      "text": "Beautiful... A very symbolic movie. A true work of art."
    },
    {
      "rating": "10",
      "text": "Visually stunning and emotionally exhilarating! A true work of art not to be missed on the big screen."
    }
  ],
  "recommendations": [
    "coraline",
    "bridge_to_terabithia",
    "the_polar_express",
    "soul",
    "brave",
    "babel",
    "happy_feet",
    "the_good_dinosaur",
    "flipped",
    "the_land_before_time",
    "the_spiderwick_chronicles",
    "paranorman",
    "up",
    "moonrise_kingdom",
    "the_art_of_racing_in_the_rain",
    "dora_and_the_lost_city_of_gold",
    "vivarium",
    "the_willoughbys",
    "bambi",
    "boyhood",
    "frozen_ii",
    "okja",
    "your_name",
    "pay_it_forward",
    "the_tree_of_life"
  ]
}