{
  "id": 4783,
  "title": "White Boy Rick",
  "starring": [
    "Richie Merritt",
    "Matthew McConaughey"
  ],
  "runtime": 111,
  "genre": [
    "Crime",
    "Drama"
  ],
  "description": "The story of a teenager, Richard Wershe Jr., who became an undercover informant for the police during the 1980s and was ultimately arrested for drug-trafficking and sentenced to life in prison.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/xjW2wgrC2ey0APDELP6NMD8tAq7.jpg",
  "categories": {
    "plot": 5.88,
    "acting": 5.636363636363637,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.2,
    "familyFriendly": 3.0,
    "funny": 6.333333333333333,
    "action": 6.333333333333333
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Ricky Wershe Jr, AKA White Boy Rick, went to jail in 1987 at the age of 17  and is still in jail today though he was paroled 2017. “White Boy Rick” tells his story from the age of 14 to 17 with an addendum at the end.The film covers many topics like the state of Detroit at the time, corrupt cops and politicians, drug dealers, teenagers giving birth, Black versus White subjects, all very lightly including time spent in prison. The two subjects that the film delves into are Ricky Jr., who as a teenager is used and gets involved in dealing drugs by ‘law-abiding’ adults. The other subject is about family and the fight to stay together.The family consists of grandparents (Piper Laurie and Bruce Dern), father  (Matthew McConaughey) brother (Richie Merritt) and sister (Bel Powley) each having problems but all there for each other for good or bad. All we know about the children’s mother is that she left before the film starts. The cast also includes Jennifer Jason Leigh and Rory Cochrane as FBI agents, Brian Tyree Henry as a narcotics cop, Eddie Marsan as a drug kingpin, RJ Cyler as Ricky’s friend among many who come and go without a chance to make an impact.The movie mainly relies on McConaughey who plays the shady dealing con man with dreams and the father who loves his children giving a definitive portrait of the man. With more face time and some deeper scenes Merritt is at a disadvantage being a nonprofessional cast in his first role. At times he acts as a typical teenager, which may be natural, while at other times he doesn’t quite have the gravitas needed in some scenes.Bel Powley as the daughter/sister is a match for McConaughey and, in a few scenes is too intense for Merritt.“White Boy Ricky” is directed by Yann Demange with the screenplay by Andy Weiss, Logan Miller and Noah Miller with both sides seeming not to know what to concentrate on, a shaky camera coming and going for no any particular reason, which at times prevents the audience from being quite as engaged as it should and could be.“White Boy Ricky” is an interesting film to see because it approaches an often done subject from a new angle."
    },
    {
      "rating": "6",
      "text": "White Boy Rick follows a teenage boy, named Rick, who becomes a drug dealer and informant for the FBI. The Good:- This is based on a true story and I found it to be very well done. I had also never heard of this story until now. - Matthew McConaughey is solid as always. - They captured the 1980s well.- It's interesting to see a \"gangster\" movie that actually focuses quite a bit on kids rather than a mob. - They also tackled the story in a realistic and grounded way. Nothing that happens in this film seems overdramatized or unrealistic. The Bad:- The story of someone getting involved in dealing drugs and informing for the FBI is nothing new. And while there are some elements of this story that I found to be original, the overall story is nothing we haven't seen before. - I don't mind language in films. In a lot of ways it makes films more realistic, but it becomes a little much when the main characters are saying \"f**k\" in almost every sentence. - The pacing of the story is by far the weakest part of this film. It's never consistent and therefore makes it hard for the audience to gauge exactly how quickly it's moving along. Overall, White Boy Rick is a solid watch, but it doesn't push the envelope by any means."
    },
    {
      "rating": "6",
      "text": "This a sad, but true story of a teenager who went undercover for the FBI in 80s Detroit. His involvement led to even more complex, unfortunate situations. Matthew McConaughey plays his father, a hardscrabble hustler who's devoted to his son, played with steely reserve by newcomer Richie Merritt. The most outstanding performance is from British actor Bel Powley as his screwed-up sis. This is a dark, gritty story about an unfortunate family and the effects of the War on Drugs. French director Yann Demange has created a grim, hopeless world, infused with authenticity and affection. It's not often that we see such tragic work, but this one is weirdly compelling."
    },
    {
      "rating": "10",
      "text": "Saw this film tonight, Really good true story! Loved the performances by Matthew McConaughey, Good storyline, would highly recommend this film!!"
    },
    {
      "rating": "4",
      "text": "the laziness in its previous act that makes it more active..White Boy RickWhite Boy Rick is a character driven biographical crime drama about a 15 year old boy that falls in a trap of FBI officers in order to help them and then latter finds himself on the wrong side of the door. This arthouse is a blunder of any whatsoever production gone under where its only way out is its pathos reality that it uses utterly to manipulate the emotions out of the audience. It may have a newer structure but the primary reason behind it, is its inability to construct one, each sequence is unfinished, each move is illogical. The creativity and originality never had any vacancy in here, but even a world extracted from real incidents ought to feel practical; don't get your hopes high. The side characters are one dimensional and are handed a wafer thin characteristic to mug up and on that note, the performance of supporting cast is plausible. The relationship between McConaughey and Merritt has done something right to its viewers and it is a real gem of the feature and not because of the sweet and innocence it is brimmed with, but how flawed and honest it is; not often where we encounter this complex chemistry and on such large scale. Merritt is good in bits and pieces just like the feature along with Powley that follows his footsteps. One of the major disappointments is Jennifer Jason Leigh who is underused and undercooked where she isn't given enough range for her to flaunt her skills. McConaughey soars through this crime drama amidst all this traffic of mediocrity and justifies his stardom and his presence on screen every time when a camera looks at him; it loves him, we love him. Its first half is scattered into bits and the second half is equally sensible that for the least itlands this risky flight safely. And as much as gathering the makers does of its mutilated bits and pieces, its amendment can never be that glorifying to make one suffer through that hour. The latter stages are genuinely moving and appreciative but it too falls on a shorter level, either the expectations have grown mediocre or its just the laziness in its previous act that makes it more active. The background score is incongruent with daft cinematography and disturbing camera work that reaches to go all artsy which fires back vigorously. And the anchor that weighs in the most is its editing that is just banal and amateurly polished upon. The narration is something that neither makers agree with nor the actors, their uncomfortness is communicated thoroughly which is just plain old sad. The recalcitrant natured script is why there is no rhythm to it, it was supposed to be this, it became that and clearly we don't want THAT. What it does get right somehow, is when it attempts to depict a series of events to convey the time passing by, but that too is fueled with performance, the juvenile execution barely takes part into it. White Boy Rick is clearly a non-calculative venture whose schemes aren't worth getting into, forget the long run it can't even hold its promises up till the runtime."
    },
    {
      "rating": "5",
      "text": "Boring and disappointing... slow and not very engaging. Dreary and depressing, lacks any real entertainment value. Worse, none of the characters are worth investing in."
    },
    {
      "rating": "5",
      "text": "If you sell drugs to someone, the responsibilityof that person's life is in your hands.  With that,Ricky Wershe Jr deserved every day of every year ofthe sentence he served.WHITE BOY RICK is yet another 'Oh, Poor Him' storywhere he has to perform criminal acts in order tosurvive or he is being forced to do it.  Rickchose to sell drugs, Rick got caught, Rick did time-and if it weren't for Michigan bleeding hearts, Rickwould still be in prison.The acting is average.The story is average.The soundtrack is average."
    },
    {
      "rating": "8",
      "text": "Great film. The pace and rhythm of this movie is close to masterful. The variety of contexts shown and the delicacy of the storytelling has become so uncommon, that some will consider this a minor film. Wrong.  Excellent performances and flawless direction. Remarkably well chosen music, and used very effectively. A great surprise."
    },
    {
      "rating": "6",
      "text": "Reasonably good performances and gritty look and feel compensate for obnoxious characters."
    },
    {
      "rating": "7",
      "text": "It was a good movie, but not what I expected based on the previews.  It was more like a slow-ish paced art-house film, than a big budget wide-release film.  So..it was still good, but more depressing than I was anticipating.  Good acting from everyone esp McConaughey, and the newcomer kid, who has never acted before.  But again I was hoping for more humor or excitement from a wide-release film, and it was much darker than I expected, but still worth seeing if you are in the right mood."
    },
    {
      "rating": "7",
      "text": "\"White Boy Rick\" certainly isn't the best version of itself that it could have been, but it's also not a bad one in any regard. The performances, the tone, the ending - it's all very well thought out. Director Yann Demange even somehow manages to take an utterly disgusting-looking color palette and turn it into a series of lush-looking images. But back to the version of the film that we ended up getting, I couldn't help but feel as though there was something missing in the delivery of this film on a narrative level. Something about the structure and pacing of this piece ultimately left me feeling - miraculously - as though there were both things to be cut and/or expanded upon all throughout. The result is a decidedly off-kilter experience, with some sequences of the movie being more interesting and easier to watch than others. It's not a perfect film, but the ending and lasting thematic coda helps it solidify itself into the memories of the audiences members. Overall, a good effort, featuring what I unfortunately suspect will become one of Matthew McConnaughey's most overlooked performances."
    },
    {
      "rating": "7",
      "text": "Based on a true story, White Boy Rick offers up a truly wonderful Matthew McConaughey performance, solid storytelling and a good cast but missed opportunities with it's script keep the film from being a better version of itself"
    },
    {
      "rating": "5",
      "text": "Great performances, excellent cinematography, and decently directed by Yann Demange.But man, the movie itself is so forgettable. I watched this weeks ago and I completely forgot to login this in. Not only on my Letterboxd, but on my IMDB page, which I usually login first. I don't know what it is. There's so much to admire in this, and yet it keeps slipping out of my mind like a wet soap in someone's hand."
    },
    {
      "rating": "8",
      "text": "I liked the movie and Matthew is great as always in it. It had me entertained throughout and was a good watch."
    },
    {
      "rating": "5",
      "text": "This is a very monotonous film and lacks of resonance. Frankly it would be much more forgettable if Matthew McConaughey wasn't in it and also if his performance would had been bad.I can really say that I recommend it because it's kinda dissapointing."
    },
    {
      "rating": "7",
      "text": "It is annoying when a movie's trailers misrepresent the movie. White Boy Rick is not a gangster/crime drama or a dark comedy as the trailers portray. It is really much better and more compelling. It is a sad story of a teenager in a poor broken family growing up in a poor neighborhood in Detroit.Overall, the movie is decent and the acting is solid. Bel Powley is particularly noteworthy in a supporting role as the sister.My major complaint about the movie is that it gets sidetracked at the end by calling out the injustice of the outcome. The movie is not about injustice and the detour at the end does not fit."
    },
    {
      "rating": "6",
      "text": "La historia es interesante, la versión de la historia del criminal, obvio por lago esta en la carcel por 30 años, el problema de la pelicula muy lenta, malos actores, muchos negros y mucho drama."
    },
    {
      "rating": "8",
      "text": "White Boy Rick has an impact as strong as the title. But it is quite enjoyable to watch.We take a look in the life of some trash americans who live a life on the edge of society, stuck in their situation. The interactions are very interesting, and seems believable.It has a sad ending, but basically says: 'You should have known better.'I would recommend this movie to other people, and i think Matthew did a good job. I give this movie a 8/10."
    },
    {
      "rating": "5",
      "text": "In short, you, like myself, were probably excited about this movie after watching the trailer...which well may be the best part of this movie. The trailer promises an action drawn film that follows a kid that with help from the gov't runs gangsters' paradise, almost narcos level operation with good laughs through it. It delivers approximately about 10% on those expectations. What is delivered is a drab story, more closely compared to a documentary than the cinematic adventure we wanted. the movie is pretty slow and has a middling script that leaves you wanting (not in a good way), and was only saved by solid performances by Matthew McConaughey and much less known Richie Merritt."
    },
    {
      "rating": "5",
      "text": "Movie had way to much going on , it tend to jump all over the place literally one min the character is 15 and the next he’s 17 . Movie doesn’t go into full depth on things that happens it just jump into something leaving you to guess what occurred, also the Movie is highly predictable"
    },
    {
      "rating": "7",
      "text": "This is a film which tells an interesting story. The depiction of a teenager getting in with the wrong crowd is certainly not a new story in itself but this has a twist to it. I felt the film seemed quite realistic and indeed the performances are decent - both father and son were well played by the respective actors. McConaughey certainly rocks a mullet type 'do quite well, if I may say so. There is perhaps a somewhat predictable element to the story but it is based on a true story and so it interested me. It is of course a gritty and sobering watch - I wouldn't say its an especially memorable one as such/per se but its certainly worth watching, so yes, I'd recommend it."
    }
  ]
}