{
  "id": 798,
  "title": "White Chicks",
  "starring": [
    "Shawn Wayans",
    "Marlon Wayans"
  ],
  "runtime": 109,
  "genre": [
    "Comedy",
    "Crime"
  ],
  "description": "Two FBI agent brothers, Marcus and Kevin Copeland, accidentally foil a drug bust. To avoid being fired they accept a mission escorting a pair of socialites to the Hamptons--but when the girls are disfigured in a car accident, they refuse to go. Left without options, Marcus and Kevin decide to pose as the sisters, transforming themselves from black men into rich white women.",
  "releaseYear": "2004",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/aHTUpo45qy9QYIOnVITGGqLoVcA.jpg",
  "categories": {
    "plot": 4.111111111111111,
    "acting": 5.6,
    "ending": 10.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.644444444444445,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Dreadful, disgusting, witless, and all in all unfunny."
    },
    {
      "rating": "10",
      "text": "Guarantee of good laughs!Keep these types of movies coming Wayans Brothers!!!!  I definitely think it was a mega hit!\rThis movie is packed full of laughs and will leave you wanting more.\rPlease! to all of the comedy lovers out there,  See White Chicks is amazing!"
    },
    {
      "rating": "0",
      "text": "Ok,how can i describe this film:A big **** that was made by two of the dumbest directors ever ,i think that is only a way for you to like a movie like that ,it is simple kill your brain."
    },
    {
      "rating": "0",
      "text": "A generally pointless movie - particularly why the hell the two main characters convinced people with their stupid prosthetics as two ladies (The bit I saw was where that happened - course me and my family turned it off barely halfway through because it was so boring and ridiculous), and they had to go to all of that trouble after two stupid spoiled brats 'injured' (I wouldn't call a split lip and a nosebleed horrific injuries - unless they are such a frequent problem) themselves. Maybe the people who made this movie should re-watch it and tell themselves what a complete waste of time and money it was. Also, some people should seriously reconsider their views after watching this movie."
    },
    {
      "rating": "10",
      "text": "People who are offended by this film and claim that it is 'racist' I suggest you go watch something where knitting involved because you obviously have no sense of humor.To dumb it down the title 'White Chicks' is NOT a  racist pun, just because it has the title White Chicks don't assume its going to be a racist film. I heard no derogatory words against white people such as 'cracker' or 'honky'. If anything I heard the word **** or 'Blacky Chan' a lot. It's a black comedy so it's not suitable for every audience, not trying to be racist, but Black comedies have that 'racist'( As the Idiots reviewing this 0) joke. They make fun of all cultures. I haven't heard a single person I have met who doesn't like White Chicks, its a favorite.It is isn't supposed to be racist, but even then the whole plot is more of an action film.The people reviewed this an gave a negative answer are obviously some old idiots who cannot tell the difference between the joke and an insult. The best way to like this film do not take it seriously! Common sense can prevail."
    },
    {
      "rating": "0",
      "text": "It is truly one of the worst movies ever created, just another generic \"mock\" movie. Really all you get is a badly made film with equally bad actors, a generically boring storyline which can be seen in multiple other films which get released every year. See that toilet seat over there? Licking it will be a better use of your time than watching this film."
    },
    {
      "rating": "2",
      "text": "This film is outrageous, obnoxious, and stupid. However, what keeps me from giving it a 0 is there were 2 laughs in that entire movie. Just two.    Diagnosis: Pass. Guilty pleasure: Possibly."
    },
    {
      "rating": "10",
      "text": "It is one of the best films i have seen, it made my whole family laugh and i would ( and will) watch it again and again."
    },
    {
      "rating": "6",
      "text": "This movie had its laughs. Their were funny parts but at least the movie didn't lag too much. The concept of the story was surreal. I really liked how they poked fun at dumb blondes."
    },
    {
      "rating": "0",
      "text": "It's pretty pointless when this was brought out - it wasn't even worth the time and effort to make this film. Just because a film may take a while to film, and with painstaking effort, does not mean we should take pity on the production team - a film I adore which was used without computers and technology but what was certainly better and certainly a hit with the critics, Who Framed Roger Rabbit. Now, White Chicks itself might be a pathetic product of a lazy day out with the Wayans brothers, so I really don't care whether they were lazing on their ass when they filmed this, or just worked hard to make people assume they were doing something.I wasn't sure where this was going at the start - the plot didn't seem to make any sense. I was then revealed what was actually going on - with severe disappointment. I'm sure many films out there have used this ongoing theme of men dressing up as women - with actual style following a decent plot. This is just cheap, lazy entertainment following two black guys dressed up as white women making disgusting, immature jokes looking nothing like what they're supposed to be - of what I heard, I never got the chance to find out after I switched the TV off after barely even halfway through. But even that was too much - even if you begin to watch this, it would put you off big time."
    },
    {
      "rating": "0",
      "text": "Terribly unfunny and crudely unoriginal. Waste of talents. I hated every single moment of this torturous experience. I advise anyone looking for a good time to buy White Chicks on DVD and just burn the hell out of it, paying to buy this and burn it is better than sitting through it."
    },
    {
      "rating": "1",
      "text": "A silly and predictable comedy that doesn't bring in any laughter. There's like a few types of people here.... people who love a movie, people who hate a movie, and people who pass a movie like it was okay."
    },
    {
      "rating": "7",
      "text": "I liked this sooo much more than I expected to. This is very much a guilty pleasure, I am not quite sure why I found it so funny, but I did. I laughed out loud on many occasions. The humor can be a bit crude at times, but it's a fun movie."
    },
    {
      "rating": "3",
      "text": "I have no idea how many people will be able laugh this movie. Its really funny but the way they talk was so unbearable and a bit stupid. If u really want to laugh this movie be my guest but for me it was far worse then that. Believe me, this movie will spoil your mind and inappropriate for u."
    },
    {
      "rating": "2",
      "text": "This film was one of the worst films i've ever seen. The humour was awfully stupid and the whole premise was pretty much racist......can anyone imagine the uproar if it was two white guy's dressed up as black chicks???? it would never be made! also...while i'm on the subject, can you imagine a tv station called White Entertainment? double standards exist in the US today."
    },
    {
      "rating": "10",
      "text": "Excellent."
    },
    {
      "rating": "9",
      "text": "Oh my god! i miss so much this movie, it make me non stop laugh and really funny! i love wayans style even some of their movie is crap (scary movie series), but this white chicks is just different, they just have fresh ideas to make us just want to laugh over and over again."
    },
    {
      "rating": "6",
      "text": "Really funny. Shouldn't have got a lot of criticism & may i also say that Terry Crews' character in this movie is really stupid to think those guys are actual girls."
    },
    {
      "rating": "4",
      "text": "White Chicks is one-of-a-kind. I'm not entirely sure that's a good thing. There are moments here that are mildly entertaining but largely bizarre. I'm torn."
    },
    {
      "rating": "2",
      "text": "This movie strives so hard to be humorous, but falls short by a long distance."
    },
    {
      "rating": "6",
      "text": "A movie that you will laugh to death."
    },
    {
      "rating": "7",
      "text": "Yes this movie is silly, and politically incorrect with many flaws, but that aside it is also very funny and highly entertaining that it almost doesn't matter. Probably not as fun to watch on your own but for a good laugh with friends its the perfect popcorn flick, and you can't really go wrong with the Wayans Brothers who are always good at making me laugh  It is also quite racist with so many racist jokes in there it isn't funny, but as a whole it's a decent comedy flick"
    },
    {
      "rating": "6",
      "text": "The two shades of white!\r I've heard this film a long ago, but I never interested to watch it. We can't avoid them, because when we look for a particular type of film for the occasion, they will pop-up and that is how I watched this now. I know it is a silly comedy, because in a real world this thing never happen. So knowing this is only for cinema, I prepared to enjoy whatever it offers. But I must say, even though my rating is not big, I kind of enjoyed it.\r Nobody watches this without knowing its synopsis. So you will already know the fifty per cent of the story when you do. The rest is how it is developed; including how good the jokes are that comes with our watch. So much cliché, but entertaining with some good scenes and lines. The actors were excellent. The make-ups were not flawless, but worked okay, especially for a comedy. Because if there is an error, it will going to appeals from the comedic side.\r So the overall film was better than what I presumed all these years. Glad I saw it, it's nothing like those silly comedies I've seen. I've seen many imposter themes, but this is refreshing. All the above, this is a one off film, that's the best thing about it. You know, sequels are what degrades the original film in most of the scenarios. Thanks for that, there's no follow-up for this with a B movie cast and crew. This is a very much watchable film, not comedy riot, but fairly does its job.\r 6/10"
    },
    {
      "rating": "7",
      "text": "Good film, funny in places and enjoyable watch"
    },
    {
      "rating": "8",
      "text": "Genial não é,pois é uma comédia mas como comédia é excelente os irmãos Wayans são fodas ainda mais Marlon Wayans,e ainda conta com o genial Terry Crews num papel coadjuvante,boa comédia"
    },
    {
      "rating": "4",
      "text": "The film has a few funny moments, but the film has a poor plot, far too many unfunny jokes, and often turns into a childish and stupid film, so could have been so much better, disappointing film."
    },
    {
      "rating": "4",
      "text": "This so called comedy from the Wayans is just a simple ridiculous comedy put into an action-like film. You may laugh... I know I did... But that was once maybe twice. I don't really care for it, nor recommend it. But if your looking for something to watch on a really boring day, then look no further then \"White Chicks\""
    },
    {
      "rating": "5",
      "text": "the wayans brothers is hilarious in many of there great  successful films like scary movie movie , little man .\rbut this film is okay and some what not funny just a bit  . but i like the african american humor . but its still enjoyable .\rGrade C+"
    },
    {
      "rating": "7",
      "text": "...............................................................................................Some hilarious scenes............................................... Some hilarious jokes.............................. Some awesomes performances"
    },
    {
      "rating": "10",
      "text": "The negative reviews on this thread made me want to write a review. This film is epic, hilarious and well worth a watch if you're considering it. If you have a sense of humour you'll love this, some of the Wayans best work, check out Haunted House aswell lol funny as ****"
    },
    {
      "rating": "9",
      "text": "A comedy classic. It has very funny jokes and if you stop to do an analysis it has some criticism to the behaviors"
    },
    {
      "rating": "9",
      "text": "Almost a cult film in the mainstream side of comedy, its humor (though ridiculous and sometimes obvious) remains fresh and enjoyable and it still will make you laugh like crazy after all these years. A classic."
    },
    {
      "rating": "6",
      "text": "Yesterday, I watched this movie with a bunch of friends. While it isn't the most original film I've ever seen before, it still has its moments in terms of being a comedy, and I would recommend it."
    },
    {
      "rating": "10",
      "text": "This movie is so hilarious and amazing and I definitely recommend it. It is my all time favorite movie and it did not deserve all the bad critical reviews."
    },
    {
      "rating": "6",
      "text": "A renowned dated 00's Wayne comedy that manages to make you burst out laughing in tears. This inversion of blackface creates a searing takedown of privilege, the dual **** between black men and white women,toxic masculinity and sisterhood. This is a good"
    },
    {
      "rating": "8",
      "text": "As branquelas, como é conhecido no Brasil, é um dos filmes mais queridos por aqui.A dublagem é fenomenal. O filme é claramente politicamente incorreto e faz piada com tudo. O proposito do mesmo é apelar a pieguice, e é tão ruim que na maioria das vezes tu se pega dando risada em situações completamente idiotas e exageradas. Os irmãos Wayans são carismáticos, e a vê-los agindo como negros num corpo de patricinhas é no minimo desconcertante de cômico. O elenco como um todo é bem escalado, mas a maior acertada aqui foi o Terry Crews AKA julius. O carisma dele é incomparável, e mesmo o personagem dele sendo muito  idiota, conseguimos gostar del graças ao ator.A trilha sonora do filme é muito boa, e é muito interessante ver que o diretor brinca com algumas situações, onde claramente haveria uma mensagem a ser passada - mas não, era só uma situação comum mesmo. Eu diria que a maioria das piadas são terríveis, mas tudo se torna engraçado com um amigo(a) ao seu lado para rir contigo. As vezes acho que os críticos levam comedias pestelonas a serio demais, ou no minimo vão assistir com o pensamento errado. As branquelas é fenomenal no seu proposito e deve ser lembrado!"
    },
    {
      "rating": "10",
      "text": "excelente pelicula. cuando haces una pelicula de comedia el objetivo final es hacer reir a la gente y esta lo hace a la perfeccion"
    },
    {
      "rating": "9",
      "text": "Since my review must be a least 75 characters long...A thousand miles. Perfect."
    },
    {
      "rating": "10",
      "text": "Love this movie another favorite. Dressing up as women for a undercover job for law enforcement. They were pretty convincing females. Ugly females but convincing."
    },
    {
      "rating": "8",
      "text": "Two African-American men trying to pass themselves off as very, very, very white women? Sounds preposterous. But with the help of an FBI friend, who just happens to be a genius with make-up, that's exactly what the hapless Marcus and Kevin Copeland (Marlon and Shawn Wayans) do when they go undercover a"
    },
    {
      "rating": "10",
      "text": "Nothing to say, just perfect, its the best comedy that I ever seem in my hole life"
    },
    {
      "rating": "0",
      "text": "Ruim, prefiro enfiar uma caneta no meu olho do que ver este filme, - - - - -"
    },
    {
      "rating": "8",
      "text": "----------------------------------7.7/10-----------------------------------"
    }
  ],
  "recommendations": [
    "nacho_libre",
    "a_haunted_house",
    "the_watch",
    "the_dictator",
    "one_year_one_night",
    "the_hangover",
    "miss_march",
    "hot_tub_time_machine",
    "meet_the_spartans",
    "the_interview",
    "little_man",
    "fifty_shades_of_black",
    "movie_43",
    "jackass_presents_bad_grandpa",
    "superhero_movie",
    "the_three_stooges",
    "this_is_the_end",
    "another_gay_movie",
    "deuce_bigalow_european_gigolo",
    "the_ugly_truth",
    "grown_ups",
    "epic_movie",
    "vampires_suck",
    "dumb_and_dumber",
    "not_another_teen_movie"
  ]
}