{
  "id": 597,
  "title": "White House Down",
  "starring": [
    "Channing Tatum",
    "Jamie Foxx"
  ],
  "runtime": 131,
  "genre": [
    "Action",
    "Drama",
    "Thriller"
  ],
  "description": "Capitol Policeman John Cale has just been denied his dream job with the Secret Service of protecting President James Sawyer. Not wanting to let down his little girl with the news, he takes her on a tour of the White House, when the complex is overtaken by a heavily armed paramilitary group. Now, with the nation's government falling into chaos and time running out, it's up to Cale to save the president, his daughter, and the country.",
  "releaseYear": "2013",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hXLScIERphkTsMGdfKKvF4p4SPB.jpg",
  "categories": {
    "plot": 4.7272727272727275,
    "acting": 5.12,
    "ending": 5.375,
    "soundtrack": 6.0,
    "cinematography": 3.5,
    "familyFriendly": 5.944444444444445,
    "funny": 5.761904761904762,
    "action": 5.764705882352941
  },
  "reviews": [
    {
      "rating": "1",
      "text": "'Oh my god, there are U S special forces flying over us' states an incredulous news reporter. This is just one example of how unintentionally funny, but risibly bad, the dialogue is in this ludicrously awful action adventure opus. It actually seems keen to copy all the worst aspects of the (far superior) 70's disaster movies. Scene after scene just lie there and die there as Channing Tatum heroically endeavours to save President Jamie Foxx from the clutches of evil inside aide, James Woods.\rThe film is full of stock characters and cliched, not to mention ridiculously unbelievable, situations and it's not even exciting. Despite having set pieces involving explosion after explosion the movie ignites not one jot of palpable tension. The actress playing Tatum's daughter is just horrible and adds credence to the saying 'Never work with animals or children'. In this instance, though, it's because the actress concerned demonstrates to the adults just how inept she is. Ultimately, this cannot even be considered a good bad film. It is with indifference that I pronounce it a resounding dud."
    },
    {
      "rating": "6",
      "text": "This is a REALLY fun movie  basically, Olympus Has Fallen with a little humor and a larger budget.  It is cheeky enough to avoid being tainted by the obvious cliches the movie is riddled with.  Please, don't ruin your experience by thinking about anything  it is meant to be enjoyed without critique.  Things blow up.  People get saved.  A dude becomes a hero to his daughter.  Accept and enjoy life..."
    },
    {
      "rating": "6",
      "text": "My once a week cinema-going experience, Emmerich’s latest tentpole is a doppelgänger of another White House terrorists-attack actioner (at least plot wise), Antoine Fuqua’s OLYMPUS HAS FALLEN (2013), and its North American box office performance has tanked badly ($69,430,120 for WHD Vs. $98,925,640 for OHF so far), which is a rather unlooked-for denouement for the internecine combat, considering from all aspects, the timing and the budget (a summer blockbuster Vs. a spring release), directors’ cachet (Emmerich is a monolith name in the genre) and the cast (Tatum is the hottest leading man in the Hollywood right now and his drawing power has been solidly tested by different genres), it is an impossible battle to lose for WHD, nevertheless the reality has no clemency,   but Chinese market could be its last haven, a sizable income is well expected.\r Generally speaking the film is a safe bet, the retro-80s packed action, a state-of-the-art SFX, a corny but effective father-saving-daughter stock-in-trade, a topical black president with enjoyable banters, and a last-minute twist of revealing the culprit. Scale-wise, the film cannot beat Emmerich’s 2012 (2009, 6/10),  THE DAY AFTER TOMORROW (2004, 5/10) or INDEPENDENCE DAY (1996, 7/10), but it doesn’t prevent it from being a satisfactory pop-corn fest.\r Tatum takes after a young John McClane image from DIE HARD franchise, an unbeatable stud defies all the bullets and weaponry, teamed with a righteous and suave president, with no military background, whose fighting-back is more amusing and anticipating than Tatum’s special agent’s combat skill. Child star Joey King is a new-rising starlet, a politics-enthusiastic and premature girl, an underage heroine is equally praiseworthy as her father. The schemes behind the rebels are half-witted, but Jason Clarke and James Woods are the attention-grabbers, typical villain-design, but introducing their own fiber of insanity in their executions. Maggie Gyllenhaal is engaging but hasn’t been warranted any showboating opportunity in a masculine-dominant bullets-bombarding thriller.\r I cannot say I’m disappointed by the film and anyhow it is a middle-of-the-road output with wide appeal to the general taste of hoi polloi, one thumb up for its verisimilitude of the precise reproduction of the world-famous locale. As a misfire from Emmerich, one could blame audiences’ aesthetic fatigue of the same milieu but a revive of old-fashioned action hero fails to reconnect with the superhero-fed generation and it is something beyond Tatum and Emmerich’s capabilities."
    },
    {
      "rating": "6",
      "text": "In general, I'm no fan of mindless summer tripe, which this is  but for that, it's not so bad.  Of COURSE you have to suspend disbelief to an extreme degree, but we all know that going in.  After all, the director who had Jeff Goldblum and Randy Quaid \"save the world\" isn't exactly prone to Shakespearian plotting.  You've seen EVERY  plot device before, from the wounded child of a divorced family to the cop who has \"something to prove.\"\r But on as many levels as the movie fails, it also succeeds.  The principals are actually given some time to, you know, talk to each other.  For those you have lost track, that's called dialogue, and it used to be sort of important.  No, this isn't Oscar Wilde, but it's moderately witty in points and Emmerich gives us enough slow scenes to make the action scenes more powerful.\r The tipping point for me is when actioners take themselves too seriously.  \"White House Down,\" despite the material, does not.  Buy popcorn.  Settle in.  Enjoy."
    },
    {
      "rating": "8",
      "text": "I will first say if you`re the type that will criticize every detail of a movie, this movie will annoy you at certain points. The reason I won`t give it a 10 is cause it was a fun movie, but had lots of unrealistic stuff that frustrated me.You have to go in it thinking it`s just for fun, or you will be disappointed."
    },
    {
      "rating": "3",
      "text": "The only thing good about this movie is the president of the United States wearing sneakers. White House Down is too cliché and also has terrible writing. The thing that disappointed me the most was the poor CGI, cmon its 2013, pay for a better VFX department."
    },
    {
      "rating": "0",
      "text": "A movie that perpetuates the most offensive racism I have ever seen in a movie. Horribly acted. I can't believe I paid to see this. I felt like taking a needle and gauging my eyes out."
    },
    {
      "rating": "8",
      "text": "A satisfying film that delivers on both the action and humor aspects. The terrorists' possession of Cale's daughter helped keep things meaningful, even if it wasn't the most original way to do it. Though some call it out as having racist tendencies, the status of the terrorists as white seems to point in another direction. The film makers changed things up instead of sticking with the text book Arab terrorists that becomes so typical of movies like this. Additionally, the film addressed actual issues in today's America without over-doing it. President Obama is portrayed in a humorous way that most viewers should enjoy.\r Though the premise of the film as a whole wasn't too unique, the ending delivered big time and should send chills down the spine of any proud American citizen. All in all, White House Down becomes a comedic action-thriller that shouldn't be written off of your watchlist for this summer."
    },
    {
      "rating": "6",
      "text": "light version of OLYMPUS HAS FALLEN. also a better version.\r if your not a \"bloody thing\" fanatic you'll love this movie more. it has a little bit of funny side too which makes it more interesting :D"
    },
    {
      "rating": "8",
      "text": "Loved the movie. A little over the top on the action, but I was not bored for a second. Wondered how much You Tube paid for the plugs.  And of course Nike and the Air Jordans."
    },
    {
      "rating": "7",
      "text": "White House Down is yet another dumb and entertaining popcorn which which fails in blending seriousness with comic relief despite its great leads and action."
    },
    {
      "rating": "7",
      "text": "17 years ago \"Independence Day\" put Will Smith and Roland Emmerich on the map. Will Smith became the summer blockbuster hero while Emmerich became the guy who made popcorn flicks where he got to destroy stuff (most of Washington DC, national monuments, New York City, the world and more).\r This summer both Smith and Emmerich had big movies  \"After Earth\" and \"White House Down.\" Both of these movies had really stupid titles but Roland delivered the goods while Will got sucked into the M Night Shamalayan's sinkhole (box office results notwithstanding).\r White House Down is a blatant rip off of Die Hard, but it tweaks the premise just enough to make it different enough and wildly entertaining. Channing Tatum doesn't try to be Bruce Willis (even if he eventually gets in the same bloodied tank top) but combines his witty \"21 Jump Street\" humor with his \"GI Joe\" bad-ass-ness. The addition of Jamie Foxx as the \"Obama\" president and, no joke, side-kick to Tatum, adds for some great comedic moments.\r Most of Emmerich's films are entertaining. Even Godzilla, his worst movie, is a mostly fun ride. But he seems to have matured to a point that all of his typical formulaic elements are made more cohesive. This formula typically goes: 1) character introduction, 2) action/destroy things, 3) quieter character development, 4) action and then an episodic cycle of 3 and 4 until the ultimate sappy happy-ending climax. The formula is there but it's better integrated and faster-moving. And he's found a way to reduce the sappiness.\r It helps to have the talents of Jamie Foxx, Channing Tatum, Maggie Gyllenhaal, and Six Feet Under's Richard Jenkins who all put in great performances.\r If you wanted \"24\" to be a movie, this is it. They definitely borrow 24's \"the terrorist in the end is not the terrorist in the beginning\" twists and turns.\r Trust me. You will be entertained."
    },
    {
      "rating": "7",
      "text": "Olympus has Fallen does something that White House Down never even thinks of doing, it tries to make sense of an impossible situation. While Olypmus has fallen is failing to persuade you that it isn't a generic thriller, White House Down is having fun and you are too. When armed terrorists seize the White House, visitor John Cale (Channing Tatum) is forced to protect President Sawyer (Jamie Foxx) and try to rescue his daughter Emily (Joey King) from them. The film is big, unpretentious fun which emulates the original Die Hard, not just in story but in its tone. White House Down is funny and has a cast clearly revelling in the experience. Tatum is a good Willis replacement and he shares great chemistry with Foxx who provides most of the films comedy. Directed by Roland Emmerich, the director of other big budget actioners such as 2012 and Independence Day, White House Down isn't subtle, its in your face and it never really slows down as everything is thrown at you at a break neck pace. Filled with cliches aplenty this is big budget B movie film making at its best. Emmerich manages to twist formulas to keep things trundling along as well as display the action in a new and interesting way. The films script by James Vanderbilt isn't terrible but there are more than a few dodgy lines hidden throughout the film. Clearly Emmerich is trying to display himself as a storyteller and while White House Down has a good story and is a gripping thriller it is a completely recycled tale that just follows an outline, an outline laid out by one of the best action films made making it entertaining action but nowhere near original."
    },
    {
      "rating": "6",
      "text": "Car chase--check. Young hunky lead--check. Get his shirt off--check. High body count--check. 500 shots aimed at lead and not one hitting him--check. Movie about 10 minutes too long--check. Hero in a 10 minute fight getting bashed and recovers to over take villain without breathing hard--check. 10 men chasing hero and none catching him-- check. Planes exploding--check. Buildings getting blown up--check. Special effects-- check. Woman as a boss--check. A lot of violence--check. A few curse words--check.  Countdown to the end of the world--check. Impossible, unbelievable situations happening--check. A thumping, heavy music background--check. What makes this movie different, better than the other 6 ‘action’ summer films? It has humor, an eleven year old girl and doesn’t take itself seriously..\r Channing Tatum, as the hero John Cole, is ready and able, and probably has with just this one film, to take over for Bruce Willis, Sylvester Stallone, Tom Cruise and other movie heroes over 50. He has the body, the dancer moves and that impish charm which always helps to make you believe in him. In this movie he has the help of Jamie Foxx as the President of the United States and Joey King as John’s daughter Emily. At first she is annoying, like all 11 year old girls can be but as the film progresses she grows on you. It is always good seeing James Woods and Maggie Gyllenhaal never fails to give a star performance. Nicolas Wright as a White House tour guide is a standout in a role that makes a complete turn by the end of the movie.\r The rest of the cast consists of reliable performers, that hold their own in each scene, such as Richard Jenkins, Lance Reddick, Jason Clark, Jimmi Simpson and Michael Murphey just to name a few.\r The screenplays injects many humorous lines and lookout for the laugh out loud pocket watch scene. Director Roland Emmerich enjoys blowing up the White House, this is his second time, and lets the action carry the film while the cinematography by Anna Foerster will elicit, “How did they do that?” thoughts.\r “White House Down” is a fun action film for a rainy and/or hot summer day and solidifies Channing Tatum role as a leading man. It should be doing a lot more business."
    },
    {
      "rating": "2",
      "text": "If you were a member of Occupy Wall Street, Occupy Seattle, etc.  you MIGHT be oblivious to the goofy cliches that are thrown around. Channing Tatum, Joey King, and James Woods make their screen time enjoyable, but the script and low-information politics had us laughing out loud... and not at the right times. (Nicholas Wright did offer comedic quips that allow you to laugh at appropriate times) Jamie did his best, but weak, Obama imitation generating another chuckle (about the sad situation in Benghazi) when he said we could send drones anywhere in the world in an hour's time, Oops. Avoid the theaters and get it on DVD on discount day."
    },
    {
      "rating": "8",
      "text": "this was a reall good movie to wacth. the other movie about the white house was much better though\rso id rather see that one again. now that i think about it it wasnt so good"
    },
    {
      "rating": "2",
      "text": "While it started out as a predictable yet bearable film, it quickly became a delusional mess in which there is no consistent tone. It was an overlong painful experience sitting though this poorly acted cheesy scripted film."
    },
    {
      "rating": "7",
      "text": "Channing Tatum saves the President (Jamie Foxx) and the country from an attack, while rescuing his own daughter. Yep, it's one of those stories: forget logic and ignore Tatum's seemingly superhuman ability to narrowly escape bullets and bullies. If you can do that, you're in for a well-paced good time. The intricate plot is as terrifying as it is far fetched, but the cast is chocked with strong performers that help make it work. Most of the hand-to-hand action is a blur, but the big effects are cool. After all, Roland Emmerich (:Independence Day,\" \"2012) is directing. Mindless fun."
    },
    {
      "rating": "5",
      "text": "I didn't find it appealing to have a movie with such a serious concept to be taken so lightly. But on the other hand what movie by Roland Emmerich since Independence Day hasn't had its story been turned into a joke."
    },
    {
      "rating": "6",
      "text": "Roland Emmerich’s White House Down (not to be confused with Antoine Fuqua’s Olympus Has Fallen) follows John Cale (Channing Tatum), a US Capitol Police officer assigned with protecting the Speaker of the House (played by Richard Jenkins). Cale’s estranged daughter, Emily (Joey King), is a political junkie and in an effort to win her favor, he applies for a position with the U.S. Secret Service  and joins her for a tour of the White House. However, when a fringe terrorist group lays siege to the White House, Cale manages to free U.S. President James Sawyer (Jamie Foxx) from his captors  unfortunately, Emily is taken hostage in the process. As the paramilitary intruders scour the White House in search of Sawyer, Cale becomes the only person who can both save Emily and escort the President to safety  not to mention, stand between the hostile force and their goals of global devastation. As a director and producer, Emmerich is known for his extensive resume of blockbuster action movies, with enormous CGI spectacle and ensemble casts, including Stargate, Independence Day, Godzilla, The Day After Tomorrow, and 2012, among others. As a result, many moviegoers will likely be expecting the same over-the-top approach and large-scale CGI destruction that has become a staple in his action movie offerings. However, even though White House Down includes memorable blockbuster moments, it’s much more straightforward and focused (though just as eccentric)  sold primarily by the team of Tatum and Foxx, not explosive visuals. As a result, the film is much more akin to the one-man-army formula seen in favorites like Die Hard, as Foxx and Tatum divide their time between sneaking in the shadows and gun/fist fighting (with plenty of cathartic one-liners thrown into the mix). A couple of extravagant set-pieces punctuate the core hide-and-shoot formula to ratchet up the excitement and explosions to summer spectacle level, but anything in between is mostly flimsy filler designed to move the plot forward to the next action encounter. The result is an enjoyable action hero tour of the bullet-riddeled White House grounds  albeit one that will require viewers to switch-off their brains on more than one occasion. Despite some tongue-in-cheek banter between Cale and Sawyer (as well as the main villains), the White House Down story takes itself pretty seriously at times  making an effort to ground the proceedings in contemporary geo-politics. Attempts to center the movie around present-day issues help make twists and turns in the plot relevant, but Emmerich’s sometimes on-the-nose message results in predictable revelations and fallout that might be off-putting to certain viewers (especially anyone who disagrees with the director’s banal characterization of the political arena). Of course, White House Down is not designed to be a provocative drama about political maneuvering, it is (above all else) a silly summer action film. In service of that goal, the core story and characters are competent in their jobs  even if Emmerich spends a bit too much time spinning a web of political corruption. Channing Tatum brings an entertaining mix of campy humor and unrelenting action chops, which should not come as a surprise to viewers who enjoyed seeing the actor flex his comedy wit and/or muscles in 21 Jump Street, Magic Mike, or Haywire, in addition to others. Cale isn’t the most nuanced character that Tatum has played, but he’s a serviceable (although ultimately forgettable) leading man  one that audiences should have no problem following from firefight to fistfight for the majority of the film. Jamie Foxx is equally entertaining as President Sawyer, delivering fun twists to standard commander-in-chief tropes while serving as an especially amusing foil to Cale. Sawyer is behind a number of the White House Down‘s best moments and even though he’s accountable for a few eye-rolling setbacks, his personal quirks and bold stance in the face of uncertainty offset any derivative plot setups. Supporting players are also strong and include Jason Clarke, Maggie Gyllenhaal, James Woods, and (as mentioned) Richard Jenkins, along with several other familiar faces (such as The Wire, Lost, and Fringe alum Lance Reddick). After a string of standout side roles (in Zero Dark Thirty and Lawless, to name a few), Clarke gets to enjoy a bit more screen time this round as mercenary leader, Emil Stenz  a sharp counterpoint to Tatum’s John Cale in both cunning and physical strength. Emmerich has produced a competent (read: not essential) blockbuster thriller that is likely to satisfy filmgoers who were intrigued by the trailers and/or core premise  and the pairing of Tatum and Foxx provides plenty of worthwhile character moments to carry the film through any predictable or underwhelming story beats. However, even with those good points, White House Down ultimately falls short of classic films in the genre (i.e., Die Hard)."
    },
    {
      "rating": "8",
      "text": "Good movie good actors lots of action I liked it because the actors had to act not all this special effects you don't need name actors for special effect movies"
    },
    {
      "rating": "7",
      "text": "White House Down is another Die Hard clone and a decent summer flick. Roland Emmerich has created blockbuster disasters including Independence Day, The Day After Tomorrow, and 2012 and now we have another disaster film where the White House was corrupted by terrorists in Washington D.C. The story is about U.S. Capitol Police Officer, John Cale (Channing Tatum) and his daughter are heading to the White House and he's promoting to become a president's bodyguard; however, the terrorists are planning to take over the White House and plan to kidnap the president, James Sawyer (Jamie Foxx). Both heroes must find the way to get out of the White House and they need to fight over terrorists with big guns and explosives. The action scenes are very impressive like the capitol building was destroyed, the helicopters are firing over the White House, and car chase scene was epic. The actors did very well in the movie including Channing Tatum plays an American Hero like he's becoming a John McClane or acting like Arnold Schwarzenegger in Commando. Jamie Foxx did very well as a president who acts like a Barrack Obama with guns White House is action packed thrill than A Good Day to Die Hard or Olympus Has Fallen. It has a lot fun to enjoy, the scenes are humorous, and it has good old action style like Lethal Weapon or Die Hard, but this movie is good. Thumb Up."
    },
    {
      "rating": "2",
      "text": "Yet another in a string of Hollywood flicks that follow a generic plot line, this one even more forgettable than the last. The 1st problem is Jamie Foxx is too young and hence totally unbelievable as president, then the writers were apparently so afraid of offending another foreign nation, they made up a ridiculous story line about defense contractors as terrorists. Channing Tatum isn't terrible and the girl playing his daughter does a good job, but the final and inevitable fight between Channing's character and his nemesis is so over the top and absurd you just start rolling your eyes and get a strong urge to walk out of the theatre."
    },
    {
      "rating": "5",
      "text": "This movie ripped off 24 in every way possible. Any season or episode of 24 is better and more worth your while than this. Yet this was an OK movie, not bad."
    },
    {
      "rating": "6",
      "text": "Fun but mindless action flick in the style of the '80's'.  If you are a fan of Roland Emmerich, you won't be disappointed. There's enough destruction (this time on a smaller scale) and groan inducing quips to last this film's running length.  Sure, it's Die Hard on the White House...yes, you might have seen a similar film earlier this year.  This one is bigger: have better actors chewing the scenery and has the trademark crazy action that Emmerich is famous for.  Turn of your brain and enjoy."
    },
    {
      "rating": "5",
      "text": "To his credit, Roland Emmerich's \"White House Down\" knows just how completely ludicrous this storyline is, but fully embraces it, and has a lot fun riding it out to its utterly implausible end. Apparently, audiences are very hungry for action concerning terrorist attempts to take over the White House. This storyline is remarkably similar to that of \"Olympus Has Fallen,\" from three months ago, but there are some fundamental differences. \"White House Down\" employs plenty of humor, which allows the viewer to just enjoy the viewing experience. There are many casualties in \"WHD\", but there is hardly any bloodshed. In contrast \"Olympus,\" decided to include graphic violence, making it a challenge to just have fun in nothing more than a brainless blockbuster.\r John Cale (Channing Tatum) is an US Capitol police officer that has struggled to hold a steady job and being a good father to his daughter, Emily (Joey King). She is passionate about politics and with the current US president, James Sawyer (Jamie Foxx). Cale takes Emily to the White House when he applies for a spot on the President's Secret Service, but he is does not get job. Dejected, John and his daughter join a tour through the White House at the same time domestic terrorists take over both the Capitol and the White House. The terrorists gather the tour group as hostages, while simultaneously trapping the president inside the building. With the actual Secret Service incapacitated, it befalls upon John Cale to rescue the president from these villains trying to destroy the American way, and their motives are the usual, standard terrorist demands (money, revenge, etc).\r Despite the dramatic and grave tone of the trailer, \"White House Down\" has about as much fun with the disastrous scenario as respectably possible. There are laughs  mostly cheesy, throughout the entire film, never letting the viewer forget they are here to have a good time. However, its impossible to ignore its glaring faults. You have never seen a more unconvincing president depicted on-screen. While its amusing to show the President wearing Jordan's while shooting a rocket launcher out a car window, any shred of legitimacy left evaporates in name of some laughs. Channing Tatum is respectable as the hero figure, but stiffens up at times in some scenes that require some dramatic finesse.\r When comparing the two films with similar plots, separated by only three months at the box office, \"White House Down\" is the better summer, blockbuster watch when compared to \"Olympus has Fallen\" simply because the latter was just that bad."
    },
    {
      "rating": "0",
      "text": "This movie and Olympus Down are two of the worst movies I've ever seen. That needs to be said. I should have went on here and read some reviews before spending my money on this waste of two hours. I'm a little surprised that a cast of this caliber put out garbage, but it happens.\rAfter this experience I really think there should be a process for people to get refunds."
    },
    {
      "rating": "6",
      "text": "This movie has a lot of similarities with \"olympus has fallen\" the guy saves a kid who knows the white house really well and the president, the guy is not from the president secret service, someone from the secret service betrays the president, the president is used to launch nuclear, etc. the movie is pretty much predictable but its not such a bad movie. Cool and realistic action."
    },
    {
      "rating": "10",
      "text": "This movie is yet another well made film by Roland Emmerich! The destruction of D.C. was so realistic and the special effects were amazing. I would recommend this film to anybody!"
    },
    {
      "rating": "8",
      "text": "Enjoyed the mix of Action, Comedy and little Suspense. Gave an \"Movie\" perspective of White House protocals. Enjoyed the barrage of weapons choice and Vehicle technologies. White House Security technology was probable not to far off. Acting was good not great."
    },
    {
      "rating": "0",
      "text": "I really regret watching this movie.\rExtremely weak story  very weak dialog ,bad casting (no one fits their character/Role) and unconvincing plot .\rThe movie begins by wasting 30 Minutes on the intro  and continues to waste too much time on dialog and leaves very little time for limited actions scenes  while nothing makes sense  not the story nor the dialog not even the action scenes.\rEverything in this movie is done wrong from the beginning to the very end.\rYou can't enjoy a movie if the you don't believe the story  you don't believe the characters and you don't believe the decisions they're making and on top of that you can spot the fake visual effects \"especially the helicopters\"."
    },
    {
      "rating": "4",
      "text": "There is a some fun to be had from White House Down, but the terrible script is to big of a problem to overcome.  This film is just so dumb and as much as you want to say this is mindless action you just can't.  The fun you might have keeps this from being awful though. C"
    },
    {
      "rating": "5",
      "text": "For me, it's safe to say that Roland Emmerich has made his good movies and his bad movies. This one manages to fall in the middle. It's really just a mindless and dumbed down version of \"Olympus Has Fallen\". Most people will go watch this movie for it's mindless, fun action and have a good time with it. But if you're looking for a movie that tells a story, then you've come to the wrong place. The relationship between Channing Tatum's character and Joey King (his daughter) just didn't work for me at all. And how he tries to prove himself worthy of this job is just uninteresting. Plus, Tatum and Foxx  working together on-screen is just completely ridiculous. Let's face it, you're just going to want to see this movie for the action. That's really the only expectation in a Roland Emmerich movie. It's like watching a less extreme \"in a sense\" Michael Bay movie. It also has it's dumb \"so-called \"humorous\" scenes\", which make the story lack in so many ways. Overall, it's a ridiculous and mindless action thriller that serves no purpose."
    },
    {
      "rating": "5",
      "text": "An Ok action movie with predictable plot. That's about it, Fox and Tatum acted alright but nothing outstanding, I even would argue thet James Woods did the best job in this movie. So really an average action!"
    },
    {
      "rating": "8",
      "text": "Very entertainment and worth while with your family in the living room. It has a generic father-daughter bond, keeping the damsel in distress type of movie while also going for the G.I joe feeling for stopping another war."
    },
    {
      "rating": "0",
      "text": "White House Down was okay at the start, but in the end, all we have is just another mindless action movie with a pathetic plot. First of all, the terrorists are not interesting, they are just a bunch of P.M.Cs, nothing else. Second of all, the CGI sucks, this is 2013! And the plot also sucks, it is simply running around, shooting P.M.Cs and run n gun again, feels a lot like a CoD third person gameplay video. The action is okay in this movie but it is simply mindless. I prefer Olympus Has Fallen to this crap."
    },
    {
      "rating": "1",
      "text": "This movie was ridiculous, the story, the script, the acting, all bad. This has everything  a wide eyed Liberal Hollywood zealot would dream of. The evil white supremacist, the evil military industrial complex, alleged home grown terrorists...blah,blah,blah. Add to that the bright eyed street smart President of color who loves Lincoln and walks on water, every time he speaks it is as if Angels are playing harps from heaven. Yes they used every Liberal cliché in this movie ad nauseum. And to top it off at the end after all the evil white guys die, world peace breaks out! What a laugher. Don't waste your time, just turn on MSNBC!"
    },
    {
      "rating": "0",
      "text": "Stupid, stupid, stupid movie.  Cartoonish for quality actors.  They must have needed the money to play in such a poorly produced and directed movie.  Destroy the film."
    },
    {
      "rating": "3",
      "text": "Channing Tatum does OK and there are some nifty explosions. That's about it for the upside. The rest consists of plot cliches, cultural cliches and political cliches, all rolled into a story that's silly and predictable. Of special note is the dumb casting of Maggie Gyllenhaal (usually good!) as a woman who's supposed to be a tightly wound, briskly organized, savvy security wonk. MG lolls around the role, playing her like an apathetic Beverly Hills shop girl who kinda sorta wants to sell something to one of the Kardashians. True, she's given some absurd dialogue, but her laconic delivery just makes it all that much more ridiculous."
    },
    {
      "rating": "7",
      "text": "Action, comedy, suspense are all in this and make it one heck of an enjoyable movie. Channing Tatum, Joey King, and Jamie Foxx are all extremely likable in this film and do a fantastic job. The plot is interesting, the action realistic, and an all around entertaining film. It's not perfect, overused plot threads do bring the film down, but overall they never kept me from enjoying the film. So if you're looking for a good action film then this is worth checking out. I know I sure enjoyed it."
    },
    {
      "rating": "5",
      "text": "White House Down is a fun action movie. It wants to be Die Hard so bad, even referencing that movie several times through quotes or cinematic language. White House Down is nowhere near as good as Die Hard, of course, but it's still a fun, brain-numbing romp."
    },
    {
      "rating": "5",
      "text": "This year there were two films made that were strikingly similar in concept. Both featured the white house being taken over and one man going John McClane on everyone and saving the day. The first film was Olympus Has Fallen and the second film was this one, White House Down. Like Olympus Has Fallen, White House Down had a lot of great action and some cool special effects. Also like it, this movie was a ridiculously unrealistic premise the was the foundation of the entire film and made the immersion nearly impossible. I'm sorry but a handful of guys are not going to single-handedly take over the most secure building in the world, especially not by force. Unlike the other movie, however, this film doesn't take itself too seriously. Mostly thanks to Jamie Foxx, there is a lot of subtle humor that adds a certain sense of comedic relief. While that is a strength, it is also a weakness because it, once again, breaks the immersion in the setting. World War 3 is about to happen and you've got jokes? Sorry, not buying it. Still, it's a decent movie but fails to deliver the intensity and edge of your seat thrill that movies like Die Hard 1 and Speed excelled at."
    },
    {
      "rating": "9",
      "text": "This is a fantastic movie. The action is top quality, there's lots of changes in the situation as the movie goes along, it's a grand time to watch. I mean, yes, the plot is totally silly when you get down to it, but that's totally fine because the lead-up to the scenario isn't really as much the point as the scenario itself. You should watch this movie."
    },
    {
      "rating": "6",
      "text": "Yes it's better than Olympus Has Fallen, but not by a lot.\rYou probably know the plot already, a bunch of terrorists (sort of) take over the White House and one man, Channing Tatum in this case, must save the day. By way of leading men in action movies Channing Tatum does pretty well, he is obviously modelling his character on Bruce Willis from Die Hard but he does it well and stays likable the whole way through. However it's really President Django (Jamie Foxx) who steals the show and delivers one of my favorite movie portrayals of any President ever. Those two team up too defeat the bad guys and save the day, (quoting Jeremy Jahns) and now we have our movie. It's very cheesy and borrows too much from Die Hard, but it's a popcorn action flick what do you expect? As long as there are lots of explosions and it's exciting White House Down has done what it set out too do.\rMuch like Michael Bay's only good movie The Rock, White House Down is enjoyable as long as you are prepared for dumb and totally unrealistic it is."
    },
    {
      "rating": "0",
      "text": "Let's attack the White House! Sounds like a good premise but falls apart in every category, acting especially, this came out along side Olympus has Fallen and even though Olympus was a steaming pile too this movie is just worse. Save your cash this movie isn't worth anyone's time."
    },
    {
      "rating": "4",
      "text": "Los Estadounidenses vuelven a salir con la victoria demostrando su valor y el presidente de un segundo para otro es Superman salvandose de todo, no es nada interesante pero la accion es espeluznante"
    },
    {
      "rating": "7",
      "text": "It's stupid. It's dumb. It's violent. It's loud. It's awesome. I usually hate Roland Emmerich's films, with the exception of Stargate. But this seemed more like a 90s action flick rather than a action film from the 2010's. It's no Die Hard, which it obviously tries to be, and it's no Commando, but it is a lot of fun. Channing Tatum is not one of my favorite action stars, but it does alright in this film. And Jamie Fox's president kicks ass (Literately). it's full of cheesy oneliners, great action scenes and James Woods as a bad guy, what's not to love?"
    },
    {
      "rating": "8",
      "text": "While the loudness and occasional stupidity that lingered in the movie where gunfights would last for about five minutes straight, there's no doubt that a summer action movie like this is quite a fun experience. While not a masterpiece, White House Down is worth the money."
    },
    {
      "rating": "5",
      "text": "I really wanted this movie to be a decent one and I also thought that this was going to be a bit dramatic at some parts, but boy was I wrong. White House Down starts Channing Tatum and Jamie Foxx as the two main characters, they did a good job with their roles but they just had an awful chemistry. The action sequences were good but their were some scenes that weren't necessary. Channing Tatum's daughter in the movie wasn't a good pick, especially with the crying scenes. The movie also lacks some identity, the tone becomes funny, then it becomes serious and serious but then it becomes funny. The movie could' ve used some drama, the experience would've been a lot better. I didn't like White House Down but I didn't hate it, the movie was a fail because of the awful script and that's why I'm going to give White House Down a 5/10."
    },
    {
      "rating": "6",
      "text": "A generic script with good special effects and solid acting from most of the cast. It worked and was decently entertaining but not groundbreaking in any way."
    }
  ]
}