{
  "id": 1386,
  "title": "Widows",
  "starring": [
    "Viola Davis",
    "Michelle Rodriguez"
  ],
  "runtime": 129,
  "genre": [
    "Crime",
    "Thriller"
  ],
  "description": "A police shootout leaves four thieves dead during an explosive armed robbery attempt in Chicago. Their widows have nothing in common except a debt left behind by their spouses' criminal activities. Hoping to forge a future on their own terms, they join forces to pull off a heist.",
  "releaseYear": "2018",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/d31SGJSaX29ba5ZUbZcesGoDE7I.jpg",
  "categories": {
    "plot": 6.1,
    "acting": 5.9,
    "ending": 5.294117647058823,
    "soundtrack": 5.0,
    "cinematography": 7.1,
    "familyFriendly": 3.0,
    "funny": 2.6666666666666665,
    "action": 6.222222222222222
  },
  "reviews": [
    {
      "rating": "5",
      "text": "The film's strong cast aside, \"Widows\" is a cinematic jumble of too many plots trying to fit into one film, coupled with numerous holes in its story and an overall implausibility that's impossible to take seriously. While the action sequences are admittedly well orchestrated, they can't make up for a plethora of other shortcomings that derail this offering from being what it aspires to be. In the end, this is yet another example of a vastly overrated release from a vastly overrated director."
    },
    {
      "rating": "6",
      "text": "drama film. They don`t always blend perfectly. There are a lot of moving pieces in this film. Twists are revealed in a balloon deflating sort of way. So that there are no twists at the end because of this. Some people phone in their parts while others shine. Mix match of two movies tried to combine into one big thing."
    },
    {
      "rating": "5",
      "text": "Looks great, well directed. But apart from the heist scene and a few other moments, it's a bit tedious. With some pretentious camera angles thrown in."
    },
    {
      "rating": "7",
      "text": "Widows is a really fun and gritty heist movie. The ensemble cast spearheaded by Viola Davis is incredible to watch. The camerawork is innovative, and the direction does a fantastic job of capturing the seedy underbelly of Chicago. Gillian Flynn's script is a good follow up to Gone Girl, and does enough differently to experiment and really tell a good story. Not all of the experiments work, and there are some out of place political jabs that slow the movie down. However, this is an engaging story about a group of women who aren't going to lie back and take what life is giving them. Definitely a recommend from me!"
    },
    {
      "rating": "7",
      "text": "Funny to watch the corporate media, whether in shows/movies like this or otherwise, lecture you ethically after Tablet Magazines recent Bombshell article on Racism/radical Islamism financing the women's movement. Mcqueen was a better director in his early day)s (Hunger, before he started exaggerating for Hollywood PR sake, which is pathetic for an artist of his caliber."
    },
    {
      "rating": "7",
      "text": "Entretenida, la vuelta de tuerca a 3/4 de peli esta interesante, las mujeres trabajan bien, aborda varias problematicas. El problema cae en un bache a media peli, las motivaciones de los villanos no quedan bien explicadas. Me gusta como trabaja Kaluya"
    },
    {
      "rating": "0",
      "text": "Langweilig, schlechte Darsteller, träge Handlung, alles sehr in die länge gezogen"
    },
    {
      "rating": "6",
      "text": "It is a heist film coming from a well known director Steve McQueen who has movies such as \"12 Years a Slave\" and \"Hunger\" to his name.With great actor ensemble (Viola Davis, Liam Neeson, Colin Farrell, Robert Duvall just to name a few, and many others) I had high expectations.While actors were great, acting was mediocre. Script was not believable at all and had plenty of ends that led nowhere. Plus it was cliche after cliche after cliche.\"Politicians and criminals are all the same, be it in Chicago or elsewhere\".\"Men are cheaters, especially white ones\". \"Women are great and strong\".Add to the mix exploitation of racism and bad cops, so fashionable in Hollywood today.Emotionally I could not connect to any character in the movie.I expected much, much more, especially with such a great cast and a talented director."
    },
    {
      "rating": "9",
      "text": "\"Widows\"can surprise and leave us satisfied quickly. With a pretty unique story, Viola Davis fits perfectly into the role, but not only her, all cast members, making her experience amazing. In spite of not having a focus message (whose makes a confusing type of film), it concludes very well without leaving loose ends. He deserves full recognition in the awards season. 9.3/10"
    },
    {
      "rating": "5",
      "text": "Am I the only one that thinks that critics nowadays only care about what looks like instead of what actually is? Oh wait, a group of women leaded by a black character making an heist, WOW!! 10 out of 10 so innovative. Nowadays looks like critics are more worried about being politically correct and to not offend anybody instead of giving a proper raw critic (same happened with Black Panther, Moonlight...). Don't get me wrong this movie has potential but it lacks content, has a lot of plot holes and it's a poor attempt of Steve Mcqueen at doing a drama inside a thriller with a society critic in between, and you're left with none. And look the movie it's actually ok, but being acclaimed as if it were something more than it is, it's just hypocrisy. On the other hand amazing performance by Viola Davis."
    },
    {
      "rating": "2",
      "text": "At first it seemed that the film would be interesting. then this feeling gradually dulled. then I realized that the most interesting thing remained at the very beginning. and at the very end I finally realized that it was a comedy. The scene where Liam Neeson meets his wife reminded me of an Indian film in which the father of the main character turned out (oops) to be his mother... very touching scene"
    },
    {
      "rating": "2",
      "text": "So what is this? Women trying to be as bad criminals as their husbands? is this a story of empowerment? why is debt left behind by their dead husband’s crimes the motivator here?Nothing but bad fiction story, do not file under drama."
    },
    {
      "rating": "10",
      "text": "This is the film Spike Lee would kill to direct! Never saw the TV show but the movie is kicking ass, a true female power blended with black-lives-matter and dirty politics in Chicago. Girls in the movie don't act, they simply lived the characters ! I will praise the photography in the movie, those close-ups with Viola Davis are pure classic! Now run to the theater near you and enjoy one of the best movies (if not the best) of the passing year."
    },
    {
      "rating": "2",
      "text": "'Let's Go' exclaims Viola Davis around the 2 hour mark of what has up to this point proved to be a tedious and unexciting venture purportedly based on the British 80's tv series. One suspects that she should have made this remark to director Steve McQueen a lot earlier. The subsequent 20 minutes do nothing to redress the balance and the film ends up a long and pretentious dud demonstrating no 'GO' whatsoever.The cast do their best with Davis demonstrating one pained expression after another and Elizabeth Debicki providing eye catching support. However, it is Robert Duvall who really brings his few scenes to life as the retiring politician disenchanted with the political path being taken by his son (Colin Farrell). McQueen seems to be better at handling more complex/important issues in films like '12 Years a Slave' and 'Shame'. His direction here is as slow as a tethered tortoise lacking any urgency or pace that the genre requires. The routine screenplay doesn't help and the movie ends up feeling messily truncated in many scenes, although at nearly 2 and a quarter hours tighter editing would have been a welcome relief.The final heist is an almost insignificant let down and the film on the whole is a major disappointment. Also what is it about Daniel Kaluuya that has critics reaching for superlatives? His appeal definitely eludes me! The best thing about this misconceived enterprise is the end titles song by Sade called 'The Big Unknown'. On this evidence the film deserves to remain just that!"
    },
    {
      "rating": "2",
      "text": "This movie didn't have a single relatable character in its cast of thousands. As a result, it's deadly dull to sit through.  Several ridiculous plot twists take place about 3/4 through that will wake you up, but the reactions by other characters to these twists are equally preposterous."
    },
    {
      "rating": "9",
      "text": "I had been looking forward to this one for months. It's a VERY good movie, just not something revelatory like I hoped it might be.  Every actress in the film is right on the money (and special shout-out to Jackie Weaver for an incredible job in a very small part). Where it falls just slightly short is in the pacing - about half way through, I thought this was going to be a set-up for a 10-hour TV season. But as a film, it needed to kick in to gear more quickly. It establishes for about 60% and then truly gets moving in the last 20%. But I would certainly recommend this to anyone.  It absolutely deserves its Must-See status."
    },
    {
      "rating": "8",
      "text": "Set in Chicago, four women are left with the debt left behind by their dead husband’s crimes. Rather than sit back and take it Veronica (Viola Davis), Alice (Elizabeth Debicki), Linda (Michelle Rodriguez) and Belle (Cynthia Erivo) take matters into their own hands.Story by Gillian Flynn and directed by Steve McQueen. A thriller with brilliant performances that will have you on the edge of your seat. An original and slightly different take on a heist film. And lets face it the heist genre has been done again and again so it’s refreshing to see one that isn’t just a rehash of Oceans 11. The chemistry between the women is what made this for me, along with the character development. Throw in a slimy politician in the form of Colin Farrell and the generic movie psychopath in the form of Daniel Kaluuya and you’ve got yourself a must see crime thriller. It reels you in with it’s sharp script and realistic characters you don’t sit there questioning the logistics of the plan or the heist you’re fully invested. My only criticism is Liam Neeson, he’s completely miscast and clearly just put in the film to get more people to see it. You’re not going to see this for Liam Neeson, everyone else fit into their parts yet he just stood out the whole time for me. Don’t let that put you off, Widows is worth your time. Dark, gritty and highly recommended."
    },
    {
      "rating": "4",
      "text": "A soulless exercise that unreels like a well-oiled machine, with a mind-numbing bag of plot twists, and acting that is always competent, but never illuminating or hinting at anything real, except occasionally, and inconsequentially, in Colin Ferrel's Jack Mulligan.  The cartoonish enforcer played by Daniel Kaluuya we've seen before, but he is genuinely scarey.Men monstrous and self-absorbed? Check.  Women when empowered capable of amazing things? check.  The bad guys all lose big time (except perhaps for Colin, who in his best speech could be asking for a way out of the film)? Check.  Happy endings for all the women?  Check.  A feel-good moment of redemption at the very end?  Check."
    },
    {
      "rating": "3",
      "text": "Two good performances, by Debicki and Belle, subdued by typically oafish performance by Liam Neeson and typically unremittingly  intense performance by Viola Davis cannot save a plodding film that features a comically improbable heist floated on the foam of 3 or 4 headscratchingly bizarre and obscure subplots. Sigh."
    },
    {
      "rating": "5",
      "text": "A disappointing film, although I am not sure whether the problem is the directing, writing, or editing – or everything. It is certainly not the cast, which is very good and very believable under the circumstances. But things don’t quite make sense (it starts right at the beginning with Colin Farrell). There are gaps and jumps – and mild frustration that becomes disappointment. This excellent cast deserves better. Example: Although this is a heist film, there is almost no tension. When the final reveal happens, it seems like a cheap trick (I can’t be more specific in case you haven’t seen the film yet although I am not keeping anything really clever a secret)."
    },
    {
      "rating": "5",
      "text": "I did not enjoy this movie.  First of all, it is soooo long!  It takes forever to get anywhere and the violence in it was just too much for me.  I do not mind violence if it is directed at the bad guys.  Heck, I will jump in and help bring them down!  But, this was just too much.  I thought this movie got bogged down in the political machinations and took too much away from the women in the story.  There were big holes in the plot that even a few twists a d turns couldn’t save.  It just was not good for me.  Even a great cast cannot save it."
    },
    {
      "rating": "6",
      "text": "Widows story line seemed somewhat disjointed in a few scenes leaving one wondering \"what was that all about?\"  Further, many scenes added no or little value to the movie and could have been edited out, producing a much better overall movie.  Many solid performances by very good actors/actresses.   I thought Viola Davis and Elizabeth Debicki stood out and enjoyed the premise of the movie."
    },
    {
      "rating": "3",
      "text": "Why is it critics cannot spot a bad movie? Because they overvalue writing, they overvalue character development and they overvalue leftist political ideology. Jerky non sequitur scene choices and pacing for a full hour to start the movie? Very bad first half of this movie folks there is no way around it. The second half is better, ....could have been a good heist movie and character study. Instead it falls flat in too many places. Watch this under perform at the box office. Luckily audiences can spot a loser if critics cannot."
    },
    {
      "rating": "6",
      "text": "The cast is great (Kaluuya really shines) and half of the script has the same popping dialogue as Flynn’s “Gone Girl”. Unfortunately, McQueen gets a little pretentious and/or silly with his half of the screenplay, as well as his direction, creating a film that drags before it picks up."
    },
    {
      "rating": "10",
      "text": "Finally a movie with two strong black female leads. Viola Davis and Cynthia Erivo are amazing."
    },
    {
      "rating": "9",
      "text": "LIFF32 (2018) #2“May a man live well-enough and long-enough, to leave many joyful widows behind him.”Remember Ocean's 8? Nah, neither do I.‘Widows’ is an outstanding crime drama from director Steve McQueen. A female driven movie that doesn't glorify itself as such. It's smart and compelling - emotional roller coaster through out. The themes of corruption, politicians, sexism, race relations, privileges, and greed that mirrors society we know. I was hooked from start till finish.Steve McQueen took something that could’ve been a generic mainstream heist movie, but made it so refreshing. Just like ‘First Man’, it’s a complete departure from his other work, but isn’t too different where you can’t believe he directed it. Plenty of long shots, especially how he directed a freestyle rap with the camera spinning around a group of characters. I thought that scene was brilliantly done. There’s a scene where Colin Farrell drives to his house after a election promotion, but McQueen mounts the camera on the hood of the car and we only hear Farrell’s conversation while nothing is visible - which is all done in one shot. Rather than cutting back or forward, but McQueen isn’t flat. His directing is bold and makes every shot engaging.How about the cast? It’s something to die for. Everyone manages to get their time to shine. Viola Davis is excellent as usual and the main center of a crowded cast. I love the little details with her character: Like how she always carries around a white fluffy dog almost like a child. She can express grief and the weight on her shoulders and play it effortlessly. Honestly, she’s one of the greatest actress of this generation.Elizabeth Debicki, Michelle Rodriguez, and Cynthia Erivo command the screen whenever they are on. Just like Davis, these wife’s have nothing in common, which serves as development in character with different backgrounds. Great to see Rodriguez finally showing dramatic range.But Daniel Kaluuya scared the sh*t out of me. The intensity in his presence and brutal killings makes him a true threat. Every Time he appears on screen, you know something horrible is going to happen. Colin Farrell and Robert Duvall are so great together, which surprised me to learn that both of they scenes, according to McQueen was completely improvised. Even Liam Neeson, despite the small screen time, but he’s really good and I wish he did more dramatic work than any other ‘Taken’ movie.The other cast members are also great, but we’ll be here for days when naming them off. I could go on forever.Han Zimmer’s score is nothing short of haunting. Gloomy with a heavy theme of loneliness. However, it picks up pace when the heist shifts in gear and everything from there is tension after tension. The beats gets higher and eventually becomes untamed.For issues: There’s not a lot for complains. Although if I have to pick. Since there’s so much going on, it can sometimes interrupt the flow. Other than that, that’s really it.Overall rating: I really struggled to catch a breath."
    },
    {
      "rating": "8",
      "text": "This was a solid film that had a little bit of everything to offer! A daring heist, criminals and gangsters, corrupt politicians, but most of all: four bold women willing to risk everything, all in the name of justice for themselves and their late husbands who were killed in a heist gone wrong. The film boasts and A-list all-star cast, and every one of them give such great performances that I can't really single anybody out for praise. However, I will say that it was really nice to see the four main women this film centered on given a great opportunity to shine in such a bold and gritty narrative that's almost always reserved for men. Themes of empowerment towards them definitely run heavy throughout the film, but the material and story they're given to work with definitely lives up to its potential and blends very well with said themes. The biggest issue with ensemble films however is that sometimes when there's so many characters and story arcs, it's hard to give equal balance to all of them and they aren't quite fully resolved or given the full closure that they deserve. Such is the case with the final act of this film, which felt a little rushed in many regards, but the rest of the film was definitely compelling with a solid story to tell and a very talented cast to help tell it!"
    },
    {
      "rating": "9",
      "text": "Viola Davis heads this cast of women who must pick up the pieces after their husbands are killed in a robbery gone wrong. Although it screams out of the gate with a furious car chase, the film settles into a robust character drama (with some social commentary for extra punch). The group of women has to deal with their own lives, while trying to manage an elaborate heist. Still, this film is more about the people than the crime. All of the exceptional actors create interesting characters. Director Steve McQueen has included a few technically flashy shots and some surprising twists, but he's imbued every frame with a quiet intensity that keeps it compelling. Although one might be tempted to compare it to \"Oceans 8,\" this is much less glossy and much more thoughtful."
    },
    {
      "rating": "7",
      "text": "Overall, this was an enjoyable movie. Recently, I've seen some boring movies disguised as \"thoughtful\", but this is definitely the opposite. Even in the more \"thought-provoking\" parts of the movie, where the end is being set up, I found that the characters and direction kept me entertained. There are some scenes that only contribute to a sub-plot of the movie, and they are occasionally better than the main plot. This one scene in the car was particularly interesting. I think the main things that grounds this movie are the performances and characters. The plot isn't particularly engaging or action-packed, and the pacing could use some work, but the performances kept me engaged and entertained and I think that kept me feeling it was worth the watch."
    },
    {
      "rating": "10",
      "text": "Greatest film of the year. not only that. but it is also one of the Greatest film of all time ever made. All cast as Awesome especially Viola Davis and Daniel Kaluuya are extraordinary. Another Masterpiece from  Steve Mcqueen after 12 years of slave. You always Make a Great film Mr. Steve"
    },
    {
      "rating": "10",
      "text": "another triggered right-winger group which wants to destroy critics as it already was in get out and black panther- this movie is an instant classic - not like oceans' 8 which can be thrown in the \"poubelle\""
    },
    {
      "rating": "8",
      "text": "Widows is a fabulous heist movie with terrific performances. Steve McQueen directs this film with great detail and while there were a couple of moments that had me puzzled but overall there is a lot to appreciate here. Overall a middle 8 an A-."
    },
    {
      "rating": "9",
      "text": "Original, fast, furious exciting and very well acted. You will be out of breath by the end."
    },
    {
      "rating": "2",
      "text": "im going to show the numbers to this movie to explain how bad this movie is\"worldwide gross of $19.6 million, against a production budget of $42 million.\" This move is barely making half its production value. Also i will say i saw this movie for free, it was long and drawn out and left a bad taste in my mouth. I would have liked to have gotten a refund but i cannot get my time back."
    },
    {
      "rating": "7",
      "text": "I have to think that the critics went for this one because it's by a famed Black Director. It's basically a not very good heist movie that's overly violent, full of plot holes, and some ludicrous suspend belief plotting. It lacks depth, and the action allows one to forget that, and the actual heist takes up less than a couple of minutes. Other than Viola Davis and Debicki the ladies get scant screen time, and they waste the great Carrie Coon, and there is not enough of Erivo, who steals the movie."
    },
    {
      "rating": "7",
      "text": "Acclaimed auteur Steve McQueen follows up his Best-Picture-winning masterpiece \"12 Years A Slave\" with \"Widows,\" one of the year's stronger, yet still frustratingly lacking cinematic experiences. You get so much to chew on as a filmgoer. It's shot and performed adeptly, and features one of the best final acts I've seen in a film so far this year. But if I'm being honest, there were some character dynamics I just didn't care for, and one scene in particular that's just so poorly conceived that I had to drop the film down another half-point. It's not a bad film by any stretch, and I appreciated a lot of the attention to detail (eapcially with the setting) but I just couldn't help but feel a tad disappointed with the final product."
    },
    {
      "rating": "9",
      "text": "Supported by strong cast, is a blow of fresh air for heist movies when you think you seen everything. Based upon a book, the story thief-stels thief has enough for catch your attention without the resources of other movies."
    },
    {
      "rating": "8",
      "text": "Widows did not disappoint, and instead was even better than I expected.Widows starts already banging, letting you know it's serious from the first minute. Viola Davis, Michelle Rodriguez and Elizabeth Debicki are amazing as the leading roles, it's probably the best I've seen Michelle  Rodriguez act... ever.But this doesn't feel like the typical heist movie, it does a lot of character work. The editing is great, in no instance this movie feels dragged out, the scene where the heist is taking place, they put some masks on, and you can hear their heavy breathing, you can feel how nervous they are.There's a scene where Collin Farell gets in a car, but instead of filming the inside of the car, the camera is on the hood of the car, and you just listen to Collin Farell argue with his assistant, I thought it was great, Steve McQueen does a great work directing thisDaniel Kaluuya is terrifying in this movie. Every time he's on screen, you sense something is going down, the way he taunts the people he's going to kill or hurt, is terrifying... just brilliant.The politics in this movie, at times, felt distracting of the real deal going on, but it was quite necessary. Some scenes felt awkward and like they could have been cut out, like Michelle Rodriguez's character simply kissing another man, who's wife just died, I mean, i got the sentiment, but thought it was unnecessary to the movie.Overall a great watch, Steve McQueen after a 5 year break after 12 years a slave, gives us another great movie"
    },
    {
      "rating": "8",
      "text": "Viola Davis's performance was stupendous, one of her best roles. Elizabeth Debicki, Michelle Rodriguez, Daniel Kaluuya, Cynthia Erivo, Colin Farrell, and Robert Duvall also gave amazing performances. The writing, screenplay, and story were terrific, I loved the twist in the movie I never saw it coming. Even though it was slow at times it was still a great movie."
    },
    {
      "rating": "6",
      "text": "Widows is a reminder that new stories and excellent storytelling are waiting in the periphery of the male gaze, that the expansion of interesting storytelling comes from widening the types of characters that can tell their stories. It’s hard to imagine anything less from the likes of Steve McQueen (of 12 Years a Slave) and screenwriter Gillian Flynn (of Sharp Objects and Gone Girl, one of my favorite crime thrillers of all time, funny and pulpy and completely mind-bending), but this movie found its place in the gaps between other heist films. It tells its story through the exquisite beauty of adaptation and underestimation, the negation of action hero archetypes, and (as Slate reviewer Dana Stevens notes) thoughtful commentary about tribal politics and gun laws.Some of the most striking shots are simple ideas like the long, single take shot of the young politician played by Colin Farrell and his aide blowing off steam after a small event, a camera afixed to the hood of the car captures the stark contrast between the neighborhood  where he’s campaigning and the one where his campaign quarters are, all the while his monologue about the transactional, futile nature of local politics accentuates the visuals. Farrell’s perennial visits to his political rival’s HQ in a cramped church building punctuate story with beautiful conversational set pieces, like the choral odes of a Greek tragedy.The actual heist is a bit of an anticlimax, as seems the case with all of the great films of the year (the Sisters Brothers and You Were Never Really Here both employ anticlimax effectively). It’s nice to see the way in which nearly all of the legwork is accomplished by the loan, tall, waifish white woman who makes more money than anyone else going on lavish dinner dates with men she meets online. There’s quite a bit of self-awareness in this script that the racial politics of this film use for comic effect.David Kaluuya is an excellent villain: the scene in the gym is stunning in its construction and trajectory; his scene work while staking the women; listening to pointed but subtly presented news clips and learning Spanish on tape; the bowling alley. The Twists this movie has in store are pretty  impressive. There’s something here for everyone, especially dog-lovers. That white dog better be nominated for an Oscar."
    },
    {
      "rating": "1",
      "text": "Widows is plagued with dull moments and dull scenes. Made in 2018 and is a crime drama and stars Liam Neeson, Viola Davis, Michelle Rodriguez, Daniel Kaluuya and Colin Farrell.... Widows has some good moments such as Daniel Kaluuya's character shooting two guys rapping and attacking a cripple in a bowling alley with a knife which sadly is classed as hilarious by somebody on YouTube as they posted that scene and found it amusing. It's not amusing or funny but it's a damn good scene but besides those two scenes the rest is pretty much fairly dull and mostly boring and it's a film that drags and drags for long periods and feels too long. Daniel Kaluuya's character was excellent and his acting was the best in the whole film in my opinion and some characters in the film felt weaker than watered down vodka and some of the acting was pretty bad. Fell asleep watching this film on all three occasions I watched it which says it all because Heat is a long film that drags but it has a decent story and suspense and develops the characters pretty good unlike Widows that drags and you lose interest and has very little if any redeeming features."
    },
    {
      "rating": "8",
      "text": "I became a fan of Viola Davis's in 2008 when she stole her scenes from Meryl Streep in \"Doubt\" and I am fascinated by what she can do with her face in the \"How To Get Away With Murder\" television series and I never miss an episode. Though I haven't seen any of the \"Fast and Furious\" films in which she has starred I have always felt some empathy for Michelle Rodriguez and her many run-ins with the law. I have heard a lot, both pro and con, about Cynthia Erivo regarding her star-making role on stage in the musicalized version \"The Color Purple\" but this is the first time I have seen her. Talking about the first time, I don't ever recall seeing Elizabeth Debick before but once you do you won't forget her and it would be a spoiler if I said anything more about that introduction!The \"Widows\" is about women taking charge in basically what would be a men's genre, a heist film. Director Steve McQueen, mainly known for \"12 Years A Slave\", directs, and co-wrote the script with Gillian Flynn, author of \"Gone Girl\", keeping the pace quick with some outstanding camera work. There are many twists and turns and at points, just a bit too much regarding sex, race, politics and social issues along with too much unnecessary violence but the film is easy to follow except near the end, which I'll get back to in a minute.  No matter where the film goes the women always hold your interest which makes this a better than average heist film.I do have a couple of questions about the ending but discussing them here would give away some major points and give away some of the surprises so after you have seen the film let's talk!The film could have been tightened up a bit regarding its over 2 hour playing time just by cutting out Robert Duvall's storyline, not that he isn't good but it really doesn't add anything to the film, the storyline or the heist but does add to the Chicago politics of the time.Be prepared for some laughs, certainly a jump out of your seat once or twice and definitely a jolt at some of the violence but \"Widows\" entertains plus allows the audience to watch some fine acting by the actresses. I am not ignoring the men but it is hard talking about their roles without giving spoilers except to say, maybe, that Liam  Neeson is Davis's husband or that Colin Farrell is Duvall's son, etc.Just watching Viola Davis's face is worth the admission alone!"
    },
    {
      "rating": "6",
      "text": "Don't waste your time if you are expecting either a good heist movie, or a unique film with anything new to offer.  This film is neither and was quite cliche and boring for much of the 2nd half.  I am shocked by some of the critic reviews, probably because the director has a previous Oscar win. But his previous films he has said each had a personal meaning, and it seems clear, this one had no meaning.  There is no concise point, and no reason for the film to even exist.  I learned nothing new, was not moved, was not excited much, did not laugh, as the script is very droll, very boring, and much of the characters actions are cliche, the type of thing you can see in any mediocre action or TV show anytime.  The only interesting parts were the first 5 minutes, the last 15 minutes, and a few rare snippets of side characters such as Colin Farrell's.  If the whole film was about Collin Farrell's character, it might have made for an interesting drama.  Instead it is pretty much a cliched heist attempt at a movie, but told through a female perspective, which then adds nothing new to the genre, is less exciting, and with the poor dialogue and directing..it is  not worth wasting time watching unless you enjoy mediocre and cliche average action and TV shows.  From Steve McQueen and the level of actors and here, and the \"positive\" reviews, I expected much, much, more, and was disappointed by the end, and quite frankly bored for much of the last hour. Unfortunately, I would have to officially call this a bomb..."
    },
    {
      "rating": "8",
      "text": "I will tell you what we have here. A good, crime drama, thats what we have. This is movie about real woman who are about discover how to survive in the man dominated world. Against all odds female cast is forced to work together to ensure continuity of their existence. When man dies and our female heroines want to maintain good standard of living instead of going to work, quick cashing in sounds like better alternative for them, right? So we have fantastic acting here. There are lots of stars in this movie, everyone played really well. Among all of the great stars who played in the movie we have brilliant Viola Davis playing Veronica - a brain behind whole operation. Against all odds she unites with Alice ,played by Elizabeth Debicki, Linda, our lovely and all fans favourite Michelle Rodriguez, and Belle, super athletic Cyntia Erivo. All of them lost their husbands in the heist that went wrong and Victoria who inherited her late husband (Liam Neesons) next heist's plans is forced to carry on heist in order to save herself from just a little bit crazy in the head Jatemme played by Daniele Kaluuya. Lets not forget about Collin Farrell and Brian Tyree Henry who are in the movie to remind us that when it comes to money and power, greed and sick ambition do not distinguish between where you come from, when the game's stakes are high you will be dirty just like anyone else. Movie is tense, well directed and I encourage everyone to watch it. Most of the actors are well characterized in their roles and offer genuine, well rounded perspective on how is to try to survive in mighty Chicago. The plot can get little predictable but it does not matter much as movie is masterfully done. I give it 8/10 and encourage you to watch it."
    },
    {
      "rating": "5",
      "text": "Why do critics rave about Widows while many ordinary viewers don’t? Critics love innovation, complexity, unusual camera shots and plot twists which Widows provides in quantity. More casual viewers want to have a sense of what going on as they watch the movie.  Yet the plot of Widows is simple: a gang led by Harry Rawlins ( Liam Neeson) in the opening scene get killed in an attempted heist, highlighted by exploding automobiles careening towards the police. Rawlins wife (Viola Davis) discovers that money taken in the heist is to repay crime boss Jamal Manning (Brian Tryee Henry) who visits her and demands that the 2 million be repaid within the month; which leads the widows, led by Davis, to decide to carry out a heist based on plans left behind by Rawlins. Normal result is heist is carried out, crime boss repaid or killed, and life, maybe, returns to normal.  Not here.  Twists, double-crosses, and devious machinations are introduced with the notable cast garlanding their conversations with multiple F-words and their variations.  Since the scene is Chicago, politics is involved from very rich and cranky Robert Duvall playing an aging pol still calling shots, his son Jack Mulligan (Colin Farrell) running for alderman against black crime boss Manning. For ordinary viewers, this is one movie where one might want to read in advance the outlines of the plot before viewing the film.  Overall, there’s fine acting, unusual camera shots, and occasional action to satisfy most—though there are long stretches of the movie which seem to be grinding gears rather than moving ahead."
    },
    {
      "rating": "6",
      "text": "\"Widows\" seems confused whether it wants to be a heist film or social commentary. It ends up fluffing on both fronts, delivering a final product that while engaging, is all over the place thematically."
    },
    {
      "rating": "6",
      "text": "This is a good movie if you're willing to call it as it is -- a fun, superficial, outlandishly silly heist thriller. The plot feels so contrived, you almost have to have a suspension of disbelief in order to get through the film and take it entirely seriously. I also think they could have cast better for the role of Jamal Manning. The whole thing was just poorly thought out, at the end of the day. What's the the random plotline with Rawlings and Manning? And the charismatic reverend gets a huge introduction and then is never seen again. Then the robbery gets botched, yet somehow there's a car available to them to chase down Jatemme Manning. And they drop her off at the hospital under a fake alias, both dressed in black, with Manning Sr's wife as a witness of how they were dressed and the height and frame of Alice....yet neither of those two women get in trouble. Just preposterous, really."
    },
    {
      "rating": "9",
      "text": "To call this a thrilling heist film would be accurate, yet miss the mark. There is so much more going on than the very entertaining surface. McQueen has a keen eye for brilliant composition and the cast is excellent across the board. Just to pick one small example, there is a \"throw away\" scene shot into the luxury SUV driving Colin Farrell home from a speech in a poor neighborhood. As we learn a little about his cynicism (and the public and private face), the homes outside quickly shift to upper class in a matter of blocks. There is much depth to the story beyond the entertaining genre. McQueen and his cast elevate the film to so much more then a successful heist story. Highly recommended."
    },
    {
      "rating": "7",
      "text": "I feel extremely conflicted with my feelings towards this film and I say this because on one hand I'm very pleased because it's a very good film but on the other hand I'm also very disappointed because it's a minor film coming from Steve McQueen.His first film in 5 years in a way feels like a setback because he had been growing with each film he had been making and here he didn't. It's a very well made film. The cast is phenomenal and McQueen knows how to get the most out of them but I couldn't feel as amazed as I did with all his previous films and that's a shame and big issue.Don't get me wrong Widows is very good film and a very good option to watch any day. Its quality is untouchable and undeniable but it's not the film I expected."
    },
    {
      "rating": "7",
      "text": "McQueen's fourth installment of this amalgamation of pathos dark crime drama is the least McQueen-y up till now.WidowsMcQueen's incongruent tale is perpetually stable in its tone. And it's that stability that helps McQueen stay on the track, no matter how much the narration fluctuates, from escaping gun shots to struggling through a trauma, his language speaks fluently to the audience. The script pretty much revolves around a heist-gone-wrong but it is a character driven feature with characters in aplenty. And often whilst fiddling with these many characters, the grip starts to lose in the narration but this is where McQueen swoops in and saves the day. The messy relationships, hidden past, cutthroat politics, morality conflict is the real ruggedness that keeps it grounded and essentially crispy.On driver's seat, Davis has a tricky part to play. Her, resisting through the trauma and going on an entirely new track is equally competent and sincerely portrayed. Neeson as his supporter gets a lot on his plate than one would imagine and he has held on to it decently. The frustrated character of Farrell whose career is plummeting down and often at the borderline risk of being disclosed of his true self, bodes well with the storyline even though is stereotypical. His conversations with Duvall; who still can overpower anyone on the screen, are one of the finest bits of the film. Debicki, the \"weak\" link of the group, gets almost as wide range as Davis's complex character.She gets to be the reason of the \"pity\" and also an inspiring phoenix natured symbol. Rodriguez's character is often game, and isn't put under any surveillance of crisis, her role is pretty much a bullet shot out from the gun and she delivers up to that. Kaluuya has a gritty role to fill in the shoes he does deliver the chills as far as he is on screen. In fact, his character is the one whose threat ticks behind the screen throughout the course of the feature. Since the lead cast is suffering for the screen time itself, the supporting ones like Bernthal and Coon gets lost into bits and pieces.McQueen's adaptation with his co-writer Flynn is pretty much to make it as cinematic as possible and even though in its second act the script gets slow and non-provocative, the lift up or the elevation is then left to the performers. McQueen's fourth installment of this amalgamation of pathos dark crime drama is the least McQueen-y up till now. He has certainly evolved as a director and kept pushing himself on newer territories to explore. His lens and vision is what rejuvenates this almost a news channel to a compelling drama.The conversations are written explicitly and with a poker face, the writers never explain the structure and aren't clearly ready compromise. Despite of having few cards hidden under the sleeve, the awe struck moments doesn't go as anticipated. This is McQueen's project where even though he offers everyone an equal chance to steal the show, he soars above all. Widows is an art that pulsates for a hearty non-biased sensitive message that is fabricated with blazing gunpowder and unapologetic deceit."
    }
  ]
}