{"id": 4002, "title": "Wild Things", "starring": ["Kevin Bacon", "Matt Dillon"], "runtime": 108, "genre": ["Mystery", "Thriller", "Drama"], "description": "When teen-socialite Kelly Van Ryan and troubled bad girl Suzie Toller accuse guidance counselor Sam Lombardo of rape, he's suspended by the school, rejected by the town, and fighting to get his life back. One cop suspects conspiracy, but nothing is what it seems...", "releaseYear": "1998", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/aaicreJBf7EuwGq3GgUV5ZedlfF.jpg", "categories": {"plot": 7.2, "acting": 6.0, "ending": 2.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 8.0, "action": 5.0}, "reviews": [{"rating": "6", "text": "Wild Things is a fun twisty, turny piece of semi-erotic film noir.. It's good but it isn't a masterwork or anything. Bill Murray's inclusion, however, is delightful."}, {"rating": "6", "text": "Crime. Spoilt rich kid accuses teacher Matt Dillon of rape, but that's the tip of an iceberg. Kevin Bacon investigates through several complexities. Bill Murray enjoys himself as a lawyer. There's a good deal of sex going on and the movie feels a little tacky, like a cheap diner or '80s fashion; but somehow it seems appropriate. Watch through the credits for revealing extra scenes."}, {"rating": "8", "text": "Actually This Is A Pretty Good Movie..\rThe Plot Is Very Well Writen And The Acting By Denise Richards Is Good..\rI'm Not Sure Users Are Saying \"One Of The Best Movies Of All Time\" Because It's Not.. It's A Good Movie.."}, {"rating": "10", "text": "One Of The Best Films Ever Made! Denise Richards Did A Great A+ Job As Well As The Rest Of The Cast.. The Writing Is Very Good.. There Is Really Noting Negative About This Movie @ All!"}, {"rating": "10", "text": "Wild Things is a movie with a Paramount Legend by the name of Kevin Bacon, you gotta see it!"}, {"rating": "2", "text": "For years, people have been talking to me about this smart, sexy thriller, that spawned three sequels. There is also something to be said for mysteries, with twists and turns, that make you think, but a half hour into this thing, it was easy to figure out why none of the stars came back for the sequels. This movie certainly plays up the eye candy angle, with two of the most beautiful women in Hollywood, and at first glance, it seems like it's going to be a pretty good film, but then the twists and turns kick in. Throwing in a twist can make an ordinary film spectacular, but when you do it every five minutes, it just confuses the hell out of the audience, and that's what happened here. By the end of Wild Things, I didn't know what the hell was going on anymore. As for the performances, they range from the brilliant Neve Campbell to the horrid Matt Dillon, and feature a ton of cameos in-between. I wanted to like this movie, there are some very good looking people, who like to take their cloths off, and that does tend to help you focus more, but the question is what are we focusing on? I concluded that there really isn't a reason to watch two hours of pure  when you can find all the naked celebrity pictures you could ever want, in five minutes online."}, {"rating": "6", "text": "Starts out very promising but the plot does get a bit far fetched as it progresses along. There are a few too many twists. This does hurt the credibilty of the film. The cast is good, Denise Richards is a knock out. Great location footage."}, {"rating": "9", "text": "Good entertaining movie with classic elements of a sex thriller, especially Denise Richards was sexy. But in my view there were too many plot twists, that makes the whole story a bit unrealistic. Bill Murray was the best."}, {"rating": "6", "text": "Entertaining, sexy, bull murray and a great mystery come together in this drama with an excellent cast and fascinating screenplay. Sadly the abuse of the double cross heist tactics get taken way too far leading to levels of ridiculousness that detract massively from the impact of the interesting if overcooked character work and world building cinematography."}, {"rating": "4", "text": "Ah faut reconnaître qu'on a une distribution bien sympathique avec en tête de gondole (ça doit être le produit d'appel qui fait \"vendre\" et tourner les têtes) la \"merveilleuse\" Denise Richards découverte par le pervers Paul Verhoeven dans le déjanté Startripes Troufions ! Mentionnons aussi Theresa Russell en cougar hargneuse, ça vaut le coup d'oeil !Denise vaut sûrement à elle seule le détour (elle donne le torticolis à coup sûr) dans un film qui semble à première vue très bien fonctionner : on se rend compte en effet que le scénario s'avère audacieusement machiavélique, puis verse dans la provocation voire l'inconvenant et la gaudriole, pour ne pas dire le salace. On aime bien ça, le salace.Le problème avec ces films qui se croient très malins et multiplient les rebondissements les uns après les autres, c'est qu'on y croit plus du tout... parce qu'on a beau dire, on est pas complètement con non plus et on le voit, nous, qu'on nous raconte des conneries grosses comme des maisons.Bref, le film qui tient presque la corde jusqu'à la moitié (grosso merdo) se délite puis se noie entièrement jusqu'à la fin, la fin tellement grotesque qu'on en pleure de rire. Sauf qu'on rit jaune quand même, car nous n'aimons pas être le dindon de la farce. On se console évidemment avec Denise qui nous montre son silicone et sa belle silhouette : viens nous faire la météo, Deniiiise..."}, {"rating": "8", "text": "Very hilarious movie with a lot crime in it. A regular everyday guy who is a scardy cluts moves into his new big house. It just so happens that he lives next door to a hit man who he tries to befriend."}, {"rating": "7", "text": "The epitome of a guilty pleasure film for me.  Just cheesy enough without being too much.  Actresses playing high schoolers is laughable.  Multiple twists are well executed and hold up quite well 22 years after the fact."}], "recommendations": ["lucky_number_slevin", "parker", "the_italian_job", "contraband", "the_nice_guys", "street_kings", "solace", "seven_psychopaths", "a_walk_among_the_tombstones", "alex_cross", "into_the_blue", "logan_lucky", "cellular", "a_perfect_getaway", "gangster_squad", "red_2", "red_notice", "the_tourist", "the_boy_next_door", "rocknrolla", "the_next_three_days", "red", "man_on_a_ledge", "from_paris_with_love", "16_blocks"]}