{
  "id": 154,
  "title": "Wild Strawberries",
  "starring": [
    "Victor Sjöström",
    "Bibi Andersson"
  ],
  "runtime": 91,
  "genre": [
    "Drama"
  ],
  "description": "Crotchety retired doctor Isak Borg travels from Stockholm to Lund, Sweden, with his pregnant and unhappy daughter-in-law, Marianne, in order to receive an honorary degree from his alma mater. Along the way, they encounter a series of hitchhikers, each of whom causes the elderly doctor to muse upon the pleasures and failures of his own life. These include the vivacious young Sara, a dead ringer for the doctor's own first love.",
  "releaseYear": "1957",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/iyTD2QnySNMPUPE3IedZQipSWfz.jpg",
  "categories": {
    "plot": 5.0,
    "acting": 9.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "A journey of a man's life. With death just looming around the corner, Professor Borg has one thing in mind: to reminisce. We get to see the heartaches, the euphoria. and the success of a to-be-awarded man in a very occupied day. We unravel throughout the day on why his daughter-in-law calls him someone who has a benevolent exterior but in the inside, as hard as nails. This is probably because of Sara choosing his brother over him which was aggravated more by marrying someone he doesn't really love as much as Sara. He may be an accomplished professor but his life is miserable and lonely.This is the first Ingmar Bergman film I have watched and I am amazed how he captured the old man's emotion with the use of dreams and parallelism in the characters. Terror, endearment, regret, kindness, sorrow, care, and satisfaction. All of these emotions captured so well by Bergman and made us feel what Professor Borg felt in his lifetime. These may be the emotions felt by a human being living in this world. A human life may be full of sorrow but in his dying days, he can still be out of his comfort and change someone's life for the better.Professor Borg woke up from a dream being terrorized by the idea of death but he goes back to sleep with a sense of satisfaction, with a smile on his face knowing that he is close in seeing his parents soon, in a better place."
    }
  ]
}