{
  "id": 3385,
  "title": "Wild Wild West",
  "starring": [
    "Will Smith",
    "Kevin Kline"
  ],
  "runtime": 106,
  "genre": [
    "Action",
    "Adventure",
    "Comedy",
    "Science Fiction",
    "Western"
  ],
  "description": "Legless Southern inventor Dr. Arliss Loveless plans to rekindle the Civil War by assassinating President U.S. Grant. Only two men can stop him: gunfighter James West and master-of-disguise and inventor Artemus Gordon. The two must team up to thwart Loveless' plans.",
  "releaseYear": "1999",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/1AUzpDzJSecEBIgwUIPzL5KMuTQ.jpg",
  "categories": {
    "plot": 5.666666666666667,
    "acting": 6.2,
    "ending": 7.0,
    "soundtrack": 3.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 7.166666666666667,
    "action": 7.4
  },
  "reviews": [
    {
      "rating": "8",
      "text": "°¤°¤¤°¤°¤°¤°¤°¤°¤°¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤¤°°°°°°°°°°°°°°°°```````````````````````"
    },
    {
      "rating": "7",
      "text": "While this was a rather entertaining film I found it to be pretty silly overall. Will Smith and Kevin Kline are actually pretty funny together so they are what makes the movie work. As far as the storyline goes there isn't much to it but its somewhat of a clever spin on the old Western films that are out there. There are good jokes and laughs but at the end of the day you can't help but just get that overall sense of being a silly film from watching it, but hey it made for a good laugh."
    },
    {
      "rating": "8",
      "text": "Wild Wild West is a western movie unlike any other western film. The sets and effects are so jawdropping that it really  helps and makes the film standout like what it was like in the western days, I would highly recommend watching this film with  your family as it is a movie that can't be missed or forgotten as having starred Will Smith"
    },
    {
      "rating": "7",
      "text": "Despite allot of criticism this movie has received, I liked it. Good humor, good all round performances, great effects and some really novel ideas. The biggest problems this movie has stem from the fact that you can clearly see that it could have been better and that it does have a really weak overall script. They have the talent. They've got a great director. They have the concept. They have the money to do some great FX. So what went wrong? Crappy writers! Proof that even a strong chain can be broken by its weakest link. Overall: Flaws aside I still had allot of fun watching this movie and I still liked it. Deeply flawed, but enjoyable."
    },
    {
      "rating": "7",
      "text": "This was an entertaining movie.  The real reason that it got such a poor rating is because there are a heap of racists out there who simply can't stand the thought of a \"BLACK\" ( horrors upon horrors) James T. West.  Get over it.  Will Smith did an exemplary job of acting as did Kevin Cline.  Kenneth Branagh was brilliant as Doctor Arliss Loveless and was beautiful and alluring, as always.  I've enjoyed watching this delightful film twice and plan on watching it again."
    },
    {
      "rating": "10",
      "text": "One of my favorite comedy/sci-fi movies of all time."
    },
    {
      "rating": "10",
      "text": "A very strange, hilarious, and ultimately fun popcorn flick, don't believe all of the people who think cinema should be a serious, logical affair, just kick back and enjoy the skeleton-like mix of crazy machinery, random humor and some rather nice shots of the film"
    },
    {
      "rating": "6",
      "text": "Far from the bad movie everyone makes it out to be, It was funny, obviously the script and the film as a whole could have been better but its watchable. Will Smith and Kevin Kline have great chemistry, their banter alone makes the film watchable, The special effects are also very good for their time. All in all, its a funny movie, if laughs are what you looking for then Wild Wild West is for you."
    },
    {
      "rating": "0",
      "text": "It may be me but I do not like this movie (except for Rodney A Grant as Hudson). The story is very thin and the laughs are cheap. The movie contains great actors so it could have been so mush better"
    },
    {
      "rating": "10",
      "text": "A very strange, hilarious, and ultimately fun popcorn flick, don't believe all of the people who think cinema should be a serious, logical affair, just kick back and enjoy the skeleton-like mix of crazy machinery, random humor and some rather nice shots of the film"
    },
    {
      "rating": "10",
      "text": "A very strange, hilarious, and ultimately fun popcorn flick, don't believe all of the people who think cinema should be a serious, logical affair, just kick back and enjoy the skeleton-like mix of crazy machinery, random humor and some rather nice shots of the film"
    },
    {
      "rating": "10",
      "text": "A very strange, hilarious, and ultimately fun popcorn flick, don't believe all of the people who think cinema should be a serious, logical affair, just kick back and enjoy the skeleton-like mix of crazy machinery, random humor and some rather nice shots of the film"
    },
    {
      "rating": "6",
      "text": "An entertaining movie with flaws that is fast forgotten by the viewer. It received a lot of negative ratings and many golden raspberries. While being no masterpiece or good movie it is nowhere near the worst movies of all times. It is a western action comedy with steampunk elements and mad science. It is the story of James West played by Will Smith and Artemus Gordon played by Kevin Kline. Together these different characters have to uncover a plot with mayor impacts for the Wild West and the USA (sorry cant give more details because of spoilers). The setting should be a mayor plus but it feels like half measures. With this I mean they should have lean more in one or the other direction. More steampunk, action or more western. The mixture strangely dilutes all parts. There are many good scenes but strangely again all did not work well enough. The acting is nearly the same. While delivering the characters as intended it feels a bit lifeless. I think that in some scenes the actors were bored or annoyed by the script. Then there is the humor and dialog. There are nearly no good lines and not enough humor that works in the movie. I think with an improved script and better dialog garnered with humor it could be a hit. Shanghai Noon did it far better in each category in the following year. Overall this is watchable but fast forgotten. I recommend Shanghai Noon if you like western action comedies instead or the classics by Sergio Leone or the John Wayne movies instead."
    },
    {
      "rating": "10",
      "text": "A very strange, hilarious, and ultimately fun popcorn flick, don't believe all of the people who think cinema should be a serious, logical affair, just kick back and enjoy the skeleton-like mix of crazy machinery, random humor and some rather nice shots of the film"
    },
    {
      "rating": "10",
      "text": "A very strange, hilarious, and ultimately fun popcorn flick, don't believe all of the people who think cinema should be a serious, logical affair, just kick back and enjoy the skeleton-like mix of crazy machinery, random humor and some rather nice shots of the film"
    },
    {
      "rating": "10",
      "text": "I liked it. Learning Civil War history for me is just as freaky as watching this wild ride of a film and the acting was fantastic. This was my first Kenneth Branagh and Kevin Kline film."
    },
    {
      "rating": "5",
      "text": "Despite great talents and $170 million at Sonnefield's disposal, this film fall flat at being a new kind of western. OK, the tarantula's nice, and some gadgets are cool, and the film does show some creative moments. However, the horrid script and dialogue, ill-defined characters, lack of chemistry, and absolutely lame comedy (with very few exceptions) ultimately kill this film. Overall, Wild Wild West shows what happens when you get the flash (action, special FX, etc.) right but screw up on the basics (script, dialogue). Ultimately, it's a sore missed opportunity to modernize the western, flushing a good production design down the toilet."
    },
    {
      "rating": "9",
      "text": "A steampunk western set after the Civil War where Will Smith and Kevin Kline try to stop a former confederate that is kidnapping America's most prominent scientists and forcing them to build advanced weaponry in an effort to overthrow the U.S. government. Somehow it's even more ridiculous than it sounds. Wild Wild West is never anything less than completely silly all the way through. This may mean that it's a stupid watch, but I never stopped having fun with it. Not even during those few scenes where it was a little too foolish for it's own good. Absurdity is the name of the game. Everything is over-the-top and the characters and their actions are just goofy. This approach ensures laughter is a constant factor, although it comes at the cost of intelligence. I just can't hate it though. The imagination, comedy, and entertaining action sequences kept me thoroughly entertained. Especially thanks to the clever humorous dialog and the effortlessly cool performance from Will Smith. It's definitely not going to be everybody's cup of tea, but I think this is one of those cases where while the movie may be dumb, it's doesn't stop it from being fun. It's also endlessly re-watchable for those who can consider themselves fans."
    },
    {
      "rating": "8",
      "text": "While the plot is a mess, the movie is the perfect summer flick in my opinion. Great action, good humor ( with the exception of the \"tough my breast\" part), fantastic art direction, costume design and special effects, very cool gadgets , and the creative talents of Will Smith, Kevin Kline and Kenneth Branagh. Overall, Wild Wild West is brainless fun at the movies, not anything else. And if all your expectations are to watch a brainless summer film, then Wild Wild West is perfect film for you."
    },
    {
      "rating": "10",
      "text": "A very strange, hilarious, and ultimately fun popcorn flick, don't believe all of the people who think cinema should be a serious, logical affair, just kick back and enjoy the ridiculous mix of crazy machinery, stupid humor and some rather nice shots of Salma Hayek's butt ;)"
    },
    {
      "rating": "2",
      "text": "Another example of lack of ideas who came up with the idea for this dump.  This is one Will Smith undoubtedly regrets.  There's very little to be positive about maybe the giant metal spider.  Wait maybe not."
    },
    {
      "rating": "2",
      "text": "Smith Misfires in 'Wild Wild' Mess!\r The best thing about \"Wild Wild West\" is the jaunty, Stevie Wonder-sampling title tune by Will Smith, and I'm already sick of that. Besides, the movie makes you wait an hour and 47 minutes before it even lets you hear it.\r \"Wild Wild Waste\" is more like it.\r Waste of time, waste of money and colossal waste of talent.\r Let's face it – hordes of people are not going to rush out to a 19th-century costume drama, even one with an 80-foot robot spider, to see Kevin Kline, Kenneth Branagh and Salma Hayek (although Ms. Hayek certainly is easy on the eyes). The real reason anyone wants to watch \"WWW\" is \"MiB.\" You're hoping against hope that pairing superstar Smith with his \"Men in Black\" director Barry Sonnenfeld will produce the same movie magic as their 1997 hit.\r You are wrong.\r Okay, this film based on the 1960s TV comedy/sci-fi/western starring Robert Conrad does have some of the same ingredients as \"Men in Black.\" As special government agent Jim West, Smith gets to wear cool shades, dress in black and shoot guns (albeit the 1869 version of Ray-Bans, a cowboy outfit and a six-shooter). Instead of Tommy Lee Jones, his quasi-adversarial sidekick is the wacky inventor Artemus Gordon (Kline), who keeps him supplied with \"Get Smart\"-style secret weapons like a bayonet that pops out of his boot tip. In the special effects category, West does battle not with aliens but with the evil mastermind and double amputee, Dr. Arliss Loveless (Branagh), who plans to take over the United States with a giant flame-throwing hydraulic robot in the shape of a tarantula.\r Yeah, I know, it sounds terrific, doesn't it?\r Unfortunately, Smith's abundant charm is squandered by making him play second fiddle to a bunch of dumb machines that look like rejected maquettes from a \"Star Wars\" brainstorming session. He's not asked to be much more than a cinematic Carol Merrill here, looking glamorous while displaying a screen full of high-tech gadgets.\r Unfortunately, Smith's abundant charm is squandered by making him play second fiddle to a bunch of dumb machines that look like rejected maquettes from a \"Star Wars\" brainstorming session. He's not asked to be much more than a cinematic Carol Merrill here, looking glamorous while displaying a screen full of high-tech gadgets.\r In fairness, though, he's not the only one. Loveless's henchwomen are also played by a quartet of wooden supermodels (Frederique Van Der Wal, Bai Ling, Musetta Vander and Sofia Eng). What Hayek is doing here I've already forgotten. Oh yeah, she's trying to rescue her scientist father from Loveless, who has kidnapped the world's brains to design his arachnoid kill-bot.\r What worked about the campy old television show was that, despite its unbelievable gadgetry, it still had one foot (all right, maybe only a toe) firmly planted in historical reality. \"WWW\" is so far-fetched (a black secret agent in the racist deep South of the 1860s?) and implausibly futuristic (flying saw blades that act like heat-seeking missiles?) that it has to work twice as hard to make the fanciful premise work.\r West's mission against Loveless is explained as a vendetta dating from the Civil War, when the nefarious Louisianan slaughtered our hero's parents in a settlement of freed slaves. As a child, West of course managed to escape on foot to Utah, where he was raised by wolves, I mean Indians.\r Give it a rest.\r Either make the whole dang thing one big, over-the-top cartoon (forgetting race and melodrama and feeble attempts at sense) or lose some of the bad puns (\"No more Mr. Knife Guy\"), stupid anachronisms like thong underwear and the expression \"butt-ugly,\" and jokes about \"Air Gordon\" and wheelchair access.\r Wasn't \"The Avengers\" punishment enough?"
    },
    {
      "rating": "9",
      "text": "A very strange, hilarious, and ultimately fun popcorn flick, don't believe all of the people who think cinema should be a serious, logical affair, just kick back and enjoy the skeleton-like mix of crazy machinery, random humor and some rather nice shots of the film"
    },
    {
      "rating": "3",
      "text": "Grandiose, showy, but without content.Inspired by a television series from the Sixties, this steampunk-inspired film tried to work but failed.The script, set in the years after the Civil War, is simple: two special government agents are sent to the Wild West to stop a mad, confederate scientist without legs who wants to overthrow President Ulysses Grant and avenge the southern defeat. Surreal, to say the least. But being a comedy with touches of nonsense, the lack of credibility is not a problem. The most obvious problem is the predictability, the poverty of the dialogues and also the bad direction of Barry Sonnenfeld, a director who has even given us very satisfying comedies like \"MIB\", \"The Addams Family\" or \"RV\". Here was a complete disaster.Will Smith and Kevin Kline embody the two protagonists, but they never really shone or managed to give soul to the characters they had in hand. I think it is the director's fault, not so much the two actors, who have already proved their worth in other films. Salma Hayek is a good actress, but here she limited herself to using her body and being the hot girl in the film. Kenneth Branagh brought the great villain to life, but he must have bad memories of this film because he was really decadent and seemed to be hating what he was doing.Technically, the film looks impressive and shows where the budget dollars were spent. A grand soundtrack gives the film an unpleasant feeling of smugness, as if the whole film feels better than what it is. The special effects and CGI are great and the mechanisms created for the film, in the best \"steampunk\" style, are impressive but leave doubts about their practical effectiveness. Still, grandiose and look good on the screen. Equally well done were the sets, costumes and choice of filming locations, with incredible settings like the Grand Canyon.Visually, the film is beautiful, it is impressive, but it is like a balloon: it can be big, it can be showy, but it only has air inside."
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.■》■》■》■》■》■》■》■》■》■》■》■》■■》■》■》■"
    }
  ]
}