{
  "id": 599,
  "title": "Wild Card",
  "starring": [
    "Jason Statham",
    "Michael Angarano"
  ],
  "runtime": 92,
  "genre": [
    "Thriller",
    "Crime",
    "Action"
  ],
  "description": "When a Las Vegas bodyguard with lethal skills and a gambling problem gets in trouble with the mob, he has one last play… and it's all or nothing.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zN80Tlly8oMpKbVJv2TfRIj8dHG.jpg",
  "categories": {
    "plot": 5.137931034482759,
    "acting": 5.222222222222222,
    "ending": 4.25,
    "soundtrack": 5.0,
    "cinematography": 5.5,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.818181818181818
  },
  "reviews": [
    {
      "rating": "5",
      "text": "The trailer for Wild Card is very misleading, the film is not just a revenge movie staring Martial Art expert, ass-kicking, lethal weapon Jason Statham. It's actually surprising, well though-out, and more about Nick Wild's character than mindless fight scenes.\r Well, the problem might not just be the trailer. There are a lot of side stories in this one film, the stories give you context, a get better sense of who Nick Wild (Statham) is, but in this case it's a little bit much. Because if you pick any of the side stories and make trailer of it, you'll have a completely different film, which is why the movie feels like a draft, jumbled, messy. I am aware that I'm saying this about a film written by an academy award winning screenwriter but that's how it is.\r In way it reflects Nick Wild's state of mind and where he's at in his life. The deeper you get into the movie the more layers you find and realize what he's struggling with but as the movie start to scratch the surface it ends. I like Wild Card for one thing because it shown Jason Statham in a new light. He talks as much as he fights in this film and if you like Statham throwing fits and handling knives you'll be pleasantly surprise to him talk.\r Wild Card is a better movie than I expected, don't get me wrong it's not movie of the year, but it's kind of good and entertaining.\r @wornoutspines"
    },
    {
      "rating": "7",
      "text": "Has anyone mentioned that this is a remake of the movie Heat starring Burt Reynolds from the 80's?   I think it's a better rendition of that movie by far,  so don't be so hard on it"
    },
    {
      "rating": "5",
      "text": "Action movies have to do a lot nowadays in order to feel fresh. Simply attaching one of the genres big named stars like Statham to it no longer works. I give the movie props for trying. Rather than just focusing on all out action the movie spends a lot of time talking. The majority of it actually tries to be part character driven drama. However missing bits of backstory and some cheesy moments make the movie feel half-baked.\r The dialog is actually pretty good most of the time outside of some cheesy lies and moments that pop up every once in a while. There are moments of humor in the film brought about by some of the films goofier characters that show it's no taking itself too seriously all of time. The plot isn't a revenge flick like all of the press lead us to believe. It's actually about Statham's character struggling to get out of Vegas. The revenge part just serves as a way to et him into trouble along the way.\r It's the plot that brings the film down. It's not as well written as the dialog. For one the whole part where he seeks revenge for the rape of his friend lacks any sort of impact because we have no idea what these two characters relationship is like. Their past is never discussed. That's a big issue with the film as a whole. So much of this film relies on the character's past. Whenever someone with significance to the plot shows up from his past and talks about what he did for them we are let in the dark wondering why this new character is of any relevance. Mix that with how the movie jumps around from plotline to plotline and you are left with a movie that feels like it's lacking in focus. It's only right at the end that all these pieces finally come together. Even then some other smaller side plots are left without any sort of reason or conclusion.\r It doesn't even get the characters self-destructive tendencies down. The character wants to leave Vegas but never takes the opportunity to do so. Part of this is due to his gambling addiction that is only barely touched upon. Whenever he wins enough to leave he can't stop gambling and loses it all. However that's only part of the problem. At several points in the movie we are given scenes where Statham's character has the opportunity to get at least some of the money he needs, but refuses to take it even though he usually did the job to get it. We are never let known why. It just seems nonsensical for the character to not take the money. There's not even a small bit of explanation for it either.\r It's elements like these that make the story feel poor. That wouldn't have been so bad had the majority of the film had not been so focused on plot. Statham fans looking for a lot of action should look elsewhere. The scenes where he is kicking butt are few and spread out considerably. They still pack the brutal and fast punch Statham movies are known for, but there's not enough of it to satisfy the hardcore action junkies. At least we still have that dialog. I wouldn't call \"Wild Card\" a bad film. The conversations characters have do make it least mildly entertaining. However with not enough action or plot strength what we are left is just mediocre. Because of that it's not one I can recommend. The interesting and humorous bits don't make up for what is basically just a sub-par film."
    },
    {
      "rating": "10",
      "text": "this movie delves into Statham's insanity. how he's being manipulated by his impulsive ex-girlfriend into fixing her problem, and in the process, getting into trouble with the mafia, how's he's constantly looking for a way out of Vegas and to retire in the Mediterranean. and along comes a Wild Card, a crazy rich kid, who gives him a plane ticket out of this madness."
    },
    {
      "rating": "1",
      "text": "This movie is one of the most stupid I have ever seen, the action is just awful and script is all over the place, and the end is just dumb.\rcan someone please pay this Jason Statham dude to stop show up in movies, why umanily have to suffer, why?"
    },
    {
      "rating": "8",
      "text": "This film is a bit more story-driven than your typical Statham flick, which is a roulette game of its own.  Story-driven Statham films have a tendency to flop, but not this one, given that it is a nearly word-for-word remake of Heat with Burt Reynolds.  You still get some great, well-choreographed fight scenes, and with a coherent storyline, I say this is a winner.  Statham movies are a category of their own, a category I enjoy immensely.  I would recommend this movie to any Statham fan."
    },
    {
      "rating": "6",
      "text": "When you watch a Jason Stratham movie, you basically know what you are getting.  Little plot, lots of action, killing, and bone crushing is pretty much a guarantee.  There are no surprises in this movie, and it is easy to see what is coming.  Nothing out of the ordinary for Stratham.   Fun to watch if you don't want to think about what might or might not happen, and want a halfway decent action movie."
    },
    {
      "rating": "7",
      "text": "Jason Statham in a movie scripted by William Goldman? Who'd have thought? Yet despite what seems like a very odd couple the film actually works. Statham does his hardman/sardonic routine as a Vegas fixer, only this time he has Goldmans words as weapons to go alongside the fish knives and ashtrays he uses to dispatch various bad guys. Surrounding Statham with an A list supporting cast always helps and here, with Hope Davies and Stanley Tucci, he couldn't have asked for better."
    },
    {
      "rating": "5",
      "text": "Wild Card is a bizarre movie. It's practically Jason Statham chatting about random stuffs with some people and then brutally mauling other people until their lives are miserable. Strangely, despite the long investment on many characters, the plot never pays off in any satisfying way. Wild Card is one of the movies that leaves audience wondering what were they watching, but not in good Inception way. If this is a complicated plan to elevate Statham's acting, it doesn't work, it would've been more believable if this is documentary of Jason Statham's actual weekend.\r The story is about Nick Wild (Jason Statham), a fixer of some sort who works in Las Vegas, as he goes about his days. Everyone, from diner waitress to blackjack dealer, inexplicably knows him as if he's an action movie star, and in some way or another they are affected by him. Many supporting actors such as Sofia Vergara and Stanley Tucci shows up out of nowhere, seemingly creating sub plots, but they actually don’t provide much. There's no big revelation or twist in Nick Wild's life, he fights, reluctantly yet effectively, and that's it.\r With confusing script, it's hard to feel any sympathy for the characters. They would talk about near philosophical debate about life goal or simple frantic drunk rambling, and these conversations are not much different sometimes. The cinematography for the movie is flashy, albeit still in moderation, unlike some Statham's movies which are flat out implausible. However, it doesn't produce engaging crime story or human drama like Hummingbird either.\r Nevertheless Jason Statham is the lead here, audience can't go home without seeing some poor sods getting hammered senselessly. In this regard Wild Card succeeds by delivering some truly painful and cringe worthy demolitions, and surprisingly beyond psychical agony. The choreography for these excruciating moments are splendid. I felt the anguish from beyond the screen, I know it's fake and entertaining, but I wish it upon no man.\r Any action or Statham fans looking for deep plot, you might want to put your chips elsewhere. Wild Card mainly deals with absurd violence, and impressive length of bar talk."
    },
    {
      "rating": "4",
      "text": "Wild Card is stupendously predictable, violent and trashy entertainment. But all that wouldn't matter if it didnt work as a cheesy action flick. Sadly, Wild Card is too much cheese to work well. Jason Statham's perfromance is the typical fare, the action scenes are awesome, though. Wild Card doesn't add anything new to action genre, it really is another action movie, big whoop."
    },
    {
      "rating": "6",
      "text": "Not one of the best movies I watched, but Jason Statham is a very good actor, manages to impress me all the time. And this story, is ok.    ."
    },
    {
      "rating": "5",
      "text": "A nice film with a good storyline but a little too slow and film noir for my liking."
    },
    {
      "rating": "6",
      "text": "This is a rather disappointing Jason Statham movie.\rIt is one of the lot, as in an industrial production.\rIndeed 2 more films with Statham are in post-production,\rand actually he is acting in yet another movie for release 2017.\rThe script seems to exist of 5 different stories put together."
    },
    {
      "rating": "5",
      "text": "Wild Card is a very bland and forgettable movie with a few nice shots. Jason Statham has given solid performances in previous movies and in this one I thought he was alright, I mean he wasn't great, but not bad. It's an easily forgettable movie that wasn't anything that special when it first came out and it's nothing special now."
    },
    {
      "rating": "9",
      "text": "Well Acted & Great fight choreography, A little some stopped, but have a Great script.........\r A Good C- Movie turn in B+...........................,,,,....."
    },
    {
      "rating": "8",
      "text": "Wild Card is offbeat and entertaining enough to stand a fair chance of achieving cult status in future years.\r Watch this movie online: http://www.watchfree.to/watch-2a130e-Wild-Card-movie-online-free-putlocker.html"
    },
    {
      "rating": "3",
      "text": "When I want to see a good action film I usually turn to a Jason Statham movie, sure beats yet another Liam Neeson film right? Wild Card is predictable, uninspired and surprisingly funny, with way too many slow motion fight scenes that are hilariously terrible. Comes with the usual head crunching fist fights that go on for 20 minutes at a time and the rest of the cast are pretty much pushed to the side with as little screen time as possible. Compared to Statham's other films this one is a load of rubbish but I still consider it to be the lesser of 3 evils (the other two being The Gunman and Run All Night). Recommended if you want a film that requires you to switch your brain off."
    },
    {
      "rating": "6",
      "text": "This is a gritty urban film featuring characters who are mostly hard to feel especially sorry for. There is the cliched female character who is looking for revenge and there's Sofia Vergara who plays DD, a lady who perhaps provides a bit of titillation for some male viewers, while Jason Statham is the main male character, Nick Wild, so may or may not appeal to women but overall, it was an alright watch. It doesn't have much in the way of substance I'd say, it has some nice-ish shots of Vegas and its pretty watchable I suppose but I really didn't connect emotionally to most of the characters and I didn't feel especially interested/bothered/concerned about what any final outcome may be.This is an ok watch, with some decent choreographed fights but its nothing that hasn't been done before and so I wouldn't go out of your way to see it as such, so no, I wouldn't actively recommend it, although there are some instances of decent cinematography and it is somewhat entertaining (if but lightly) for the vast duration. It got a bit slow paced mid-way through, which put me off, although things did heat up a bit towards the end.Oh and also, here's something I hadn't realised about it before I watched it - it appears to be set in Christmas time, as ocassionally people are seen wearing santa hats and the like. Christmas in vegas - I can't say I'd ever thought of what that may be like (which, by the way, is like Vegas normally looks like, only with the ocassional santa hat or Christmas tree thrown in. Go figure, as the Americans say)."
    },
    {
      "rating": "7",
      "text": "An entertains movie, although I’m a sucker for down and out detective (sort of) movies about gamblers."
    }
  ]
}