{
  "id": 4071,
  "title": "Wild Hogs",
  "starring": [
    "Tim Allen",
    "John Travolta"
  ],
  "runtime": 100,
  "genre": [
    "Action",
    "Adventure",
    "Comedy"
  ],
  "description": "Restless and ready for an adventure, four suburban bikers leave the safety of their subdivision and head out on the open road. But complications ensue when they cross paths with an intimidating band of New Mexico bikers known as the Del Fuegos.",
  "releaseYear": "2007",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qYyPCZcpNGZwbyBo1gwdCiW5hHC.jpg",
  "categories": {
    "plot": 7.6,
    "acting": 6.555555555555555,
    "ending": 6.0,
    "soundtrack": 10.0,
    "cinematography": 10.0,
    "familyFriendly": 6.0,
    "funny": 7.638888888888889,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Wild Hogs in not only a funny movie, but it allows a great amount of joy for anyone who watches it. John Travolta, Tim Allen, William H. Macy, and Martin Lawrence take us on a fun ride along through their journey across the states and it is not the usual trip. This movie is full of laughs and you will never get bored watching it. If you are looking for a great laugh, I would highly recommend Wild Hogs. The acting is great, the humor is there and the story is just interesting enough that it is not weird."
    },
    {
      "rating": "6",
      "text": "This movie was so-so. It had it's moments, but wasn't the greatest. I liked it about as much as I liked Norbit which I saw a few weeks back."
    },
    {
      "rating": "8",
      "text": "To all those who gave this movie a low rating all I can say is...what did you expect? This is a comedy and comedies are always kind of stupid. Although it was not wall to wall laugh I thought it was entertaining all along. I always like to see well know actors bunch up together to make that that kind of film."
    },
    {
      "rating": "2",
      "text": "Not nearly as funny as it ought to have been, and overly reliant upon stereotypical humor."
    },
    {
      "rating": "9",
      "text": "This is the largest disagreement that I've ever seen between what the viewers think of the movie and the critics. The viewers are right. The crowd at the theatre was laughing the entire movie. The movie is extremeley funny."
    },
    {
      "rating": "7",
      "text": "A funny movie"
    },
    {
      "rating": "10",
      "text": "Only those with NO sense of humor will fail to enjoy this hilarious comedy! Its on laugh after another and total enjoyment!"
    },
    {
      "rating": "10",
      "text": "I was fortunate enough to go to a screening of WildHogs, I loved it! I hope it has a sequel."
    },
    {
      "rating": "8",
      "text": "It made my wife laugh hysterically, so it was worth the $16.00 it cost to see it."
    },
    {
      "rating": "8",
      "text": "It's not Shakespeare, but it's pretty damn funny, despite the negative reviews!"
    },
    {
      "rating": "8",
      "text": "This movie is really funny, it does go overboard on the homosexual scene, but even that is done in a humorist manor in this movie. I laughed all the way through it."
    },
    {
      "rating": "8",
      "text": "I saw this movie before reading any reviews, and I thought it was very funny. I was VERY surprised to see the overwhelmingly negative reviews this film received from critics."
    },
    {
      "rating": "0",
      "text": "i've crapped better films than this. i know there is a think called \"entertainment,\" and these guys miss it entirely. homophobic jokes (especially with bikers) just don't qualify is humour. for those of you who enjoyed this film in any way, run quick to your local video store and rent \"I Have No Idea What A Good Comedy Is, And I Should Bury Myself In Quicksand.\" But hurry, there are only so many copies."
    },
    {
      "rating": "8",
      "text": "Movie was good.  The movie critics need to get new jobs."
    },
    {
      "rating": "8",
      "text": "I think the critics are missing the point: this movie was ENTERTAINMENT. William H. Macy was terrific and the whole movie was hysterically funny. The critics should lighten up; movies are about entertainment, not Oscars."
    },
    {
      "rating": "0",
      "text": "I think DJ R is missing the point: entertainment, even all CAPS ENTERTAINMENT, can and should be entertaining. And if it's supposed to be a comedy, it should be funny. I imagine the critics were particularly disappointed since all of these actors are good; they range from \"pretty good\" Martin Lawrence all the way up to \"practically guaranteed good\" like Macy and Travolta; that they should do so incredibly poorly is sad."
    },
    {
      "rating": "1",
      "text": "Whe I see some of the user reviews here, I can only imagine the studio paid people to post them. This is the most ridiculous movie I've seen in a long time. Oh, comedies should be ridiculous? Not like this. Horrible plot, elements stupid beyond belief (we threatened the gang with a lawsuit, so now I can punch them in the nads?), no funny jokes, poorly executed repetitive slapstick. And one more Hollywood movie thats main selling point is that all men are stupid and secretly half-gay. Any actual biker would find this movie ultimately insulting."
    },
    {
      "rating": "9",
      "text": "What is it about straight comedies that critics just hate? I suppose they want Oscar Wilde -- wit for intellectuals. It's a CRIME that this movie was universally panned. I mean, this movie was hilarious. I kept expecting it to lose steam, but it was funny from beginning to end. Judging by the audience's constant laugh-out-loud reactions, this is a movie \"for the masses\"... not for conceited, condescending, uppity critics."
    },
    {
      "rating": "10",
      "text": "Wild Hogs is already a classic. Remember watching American Pie, or Old School and you knew you were already watching a classic. Same thing with Wild Hogs. This is one of the funniest movies I have ever seen. The critics are showing their true colors by bashing this film. The audience is already turning on them for their incompetent analysis of the film. You have to wonder if these critics even bothered to watch the film. I was listening to a Chicago movie cynic, I mean critic, on radio saying that within the first 3 minutes he had already decided that it was not funny. It's a comedy. Sit back, relax and take that stick out of your butt and laugh a little. Or in this case a lot. He also went on to say that there was not a single laugh in the entire movie and was urging desperately for people not too see the film. This begs the question, why are critics trying so hard to keep people away from an unbelievably funny movie? Wonder if it touched a nerve with them, or wonder if they just don't like one of the stars of the movie? Something is going on or maybe the critics have lost their minds. Regardless, this is the funniest movie my wife and I have seen in a long time. The audience was laughing hysterically throughout the film. People were outside the theater still laughing, and my wife and I are still laughing about it a couple days later. It even received an ovation at my theater as well as many others I've heard. What comedy receives an ovation? I guess the critics and the audience just don't see eye to eye. See the film and don't rely on a critic to make up your mind for you. And if you do care what other people think then look at what the audience is saying. It's a hysterical film and hope we can see some sequels."
    },
    {
      "rating": "9",
      "text": "I gave this film a 9 out of 10, because it was exactly what I expected it to be. I didn't go see Wild Hogs because I thought it would be high brow humor! It was very cliched, stereotypical, and corny, just like it was suppsed to be."
    },
    {
      "rating": "10",
      "text": "The whole theatre was laughing out loud most of the time. Everyone went away happy. That deserves a 10."
    },
    {
      "rating": "10",
      "text": "Great movie! If you want to be entertained and have a few good laughs, see this movie. The music is also very good, but we can't help wonder why they didn't play \"Born to be Wild\". As for the critics, perhaps they should witness the audience response before they write their inane reviews that are festonned with nonce words."
    },
    {
      "rating": "7",
      "text": "People - this isn't intended to be art - it's light and dumb -don't expect any more from it than that. A little dumb, a litte funny, and the scenes with the gay cop could have been left on the cutting room floor. Otherwise, as entertainment - not up there in the 8 to 10 range, but also no way deserving a '0' or '1' rating."
    },
    {
      "rating": "7",
      "text": "It is overplayed but it sure is hysterical. This is the funniest movie of the year, no doubt. I laughed hysterically about 20 times, and that includes sequences. With all its funny characters, great adventure, things are exciting."
    },
    {
      "rating": "3",
      "text": "The ONLY thing good about this movie is the presence of one of America's truly great yet sadly and vastly underrated actors, Ladies and Gentlemen, Mr Ray Liotta. John Travolta was great in Pulp Fiction, but Ray was much, much greater in Goodfellas. Because of his natural intensity, Ray won't get as many parts as some others may, but he still is one of America's best actors, right up there with Jack, Harvey Keitel, Chris Walken, and Charlie Sheen. (Just kidding about that last one, kids."
    },
    {
      "rating": "10",
      "text": "I don't believe that this movie has got 27 points only!! I loved this movie, it's amazingly funny, screw all the critics."
    },
    {
      "rating": "10",
      "text": "I loved it! it's beautiful and funny, critics give high points only to movies with tearful drama or horror, I bet their life is so miserable."
    },
    {
      "rating": "2",
      "text": "Saw this movie on the plane coming back home. Some good laughs (quite few in my opinion) and lots of missed chances. If you're looking for a movie you don't actually have to listen in order to grasp the storyline fairly (I must have fell dosed on it a couple of times and still perfectly understood what was going on), this on should please you, though I know quite a few more I would recommend first."
    },
    {
      "rating": "0",
      "text": "A bunch of washed up middle aged actors trying to make one last decent film. Failure."
    },
    {
      "rating": "3",
      "text": "Mildly funny, wildly homophobic. Wow, the family values are on display here from Disney: Lots of jokes about over-bearing wives controlling their husbands and gays. Homosexuals take a beating here as a daft cop and a prancing thug are the only gay men represented, add in \"Deliverence\" jokes and this film probably was well-loved by Pat Robertson. I expect Allen, Travolta and Larwrence to do this film, but what is Macy here for? Gosh, he was great in \"Fargo.\""
    },
    {
      "rating": "9",
      "text": "I think Wild Hogs was a good movie. I cant see how on earth it is possible for someone to give the movie a ). The movie was suppose to make people laugh and it achieved that hands down being one of the funniest movies I have seen in a while. \"WILD HOGS!!\""
    },
    {
      "rating": "10",
      "text": "I really just feel sorry for anyone who somehow/someway didn't like this movie. I wish for everyone the all-over \"good feeling\" I had when I left the theater after seeing this show. Quality time spent!"
    },
    {
      "rating": "4",
      "text": "Eh, it made my laugh a bit, though I wouldn't watch it if I had to pay for it."
    },
    {
      "rating": "10",
      "text": "Awesome, funny, and lighthearted. I laughed right through the hilarious credits. I will truly see this again real soon."
    },
    {
      "rating": "1",
      "text": "After fifty minutes of suffering through this offensive, trite, unfunny piece of garbage, I walked out. Shame on every last person who had anything to do with releasing this trash. There was nothing even remotely funny, and a waste of fairly good talent. Travolta, Macy, and Allen have each been much better, but with such a poor script, they were totally lost. Pathetic movie-making."
    },
    {
      "rating": "8",
      "text": "Finally a movie that is lighthearted and funny! Don't listen to the critics on this one! This movie is pure fun! Great cast makes the trip even more entertaining. If you're tired of the depressing doom-and-gloom movies, go see Wild Hogs and leave the theater feeling good!"
    },
    {
      "rating": "8",
      "text": "Pretty solid for what it was. The best part about the movie is that I think all the actors knew what they were getting into, and were able to make fun of themselves because of their middle age which adds a bit of a comedic parody slant for that reason."
    },
    {
      "rating": "7",
      "text": "The reviewers are cynical and jaded. Yes, this was \"City Slickers\" on bikes. So what? It was well made, and quite funny. And don't leave before the credits are done ... QUITE funny!"
    },
    {
      "rating": "0",
      "text": "Stupid dumbies!!! Don't like this movie!!! I'm on my knees typing this and begging you to understand that this movie is the polar opposite of what comedies and film in general should be. Please, come to your senses, general public. Go see Zodiac or something. Not this. Anything but this..."
    },
    {
      "rating": "10",
      "text": "Movie was great we used it as our family movie with our 11 year old and she actually really enjoyed it and was not offended at the language it was all in clean fun. We need more movies like this."
    },
    {
      "rating": "10",
      "text": "Need a LOL, tears down the face, funny, feel good, slapstick, poke fun at yourself and everyone else kind of movie? This is it! Evidently, the critics haven"
    },
    {
      "rating": "8",
      "text": "I haven't laughed this much at the movies in years. It may not be original but it is hilarious. Too many critics think every movie needs to break new ground, lighten up and enjoy!"
    },
    {
      "rating": "9",
      "text": "I went with a group of 14 (all of us bikers) and we absolutely LOVED it!"
    },
    {
      "rating": "9",
      "text": "Almost forty years ago, Hollywood grew up with the release of the blockbuster \"Easy Rider.\" The onset of middle-age for the biker film is commemorated admirably in \"Wild Hogs,\" Walt Becker's homage to freedom, the road, and America. Indeed, Becker goes so far as to include Peter Fonda in a too-short cameo so as to invoke the acid-soaked Sixties. This film is not about nostalgia, though: it is about American Man and his sometimes too late realization that there should be a profound element to his existence. The casting reflects that longing - Tim Allen, Martin Lawrence, and John Travolta all have more years behind them than ahead of them, and the desire for a comeback is palpable. The trio manages to capture the whimsy and conceit of 21st Century biker culture, and imbue it with the urgency of pending death. \"Hogs Wild\" is a film to make Oscar go hog wild."
    },
    {
      "rating": "9",
      "text": "I went to see this movie with my 21 year old daugher and sister. We loved it!! It was very funny!! I agree the critics need to get new jobs."
    },
    {
      "rating": "0",
      "text": "This movie is the definition of horrible. Anyone who thinks otherwise is wrong and clearly lacks any abilty to truly gage actual comedy. This is not funny. I would not see it again if I was paid $50. I would pay $250 to have never seen it. Probably the worst mistake I will make this year. Do not see this movie!!!!!"
    },
    {
      "rating": "7",
      "text": "There are definite reasons why this is, as of now, the #2 box office hit of 2007...even though this admittedly derivative slapstick farce about four middle-agers attempting to recapture their youth, resolve their issues and regain their wildness by going on a cross-country motorcycle odyssey should theoretically have crashed and burned. John Travolta's career has had more ups and downs than a ferris wheel; leaving his universally reviled labor of love Battlefield Earth on the table, the man has taken so many promiscuously chosen projects (The General's Daughter? Domestic Disturbance? Lucky Numbers?) that his agency should be regularly checked for STDs. Buzz Lightyear aside, Tim Allen is a poor man's Ray Romano whose film career (except for Galaxy Quest, Big Trouble and--if you're 10 or under--the Santa Clause movies) is an adventure in viewer sadomasochism, and Martin Lawrence, whose TV sitcom ran about as long as Allen's and was equally mediocre, may be so crazy, but he ain't so funny. Even the movie's \"class\" element, the great William H. Macy, had me initially wondering if he took on this project in an attempt to regain his household breadwinner status and match Felicity Huffman's Desperate Housewives paychecks. Worst of all, director Walt Becker is responsible for National Lampoon's Van Wilder, one of the cruddiest comedies of the last 25 years and one possessing exactly one good gag (a snobbish bad guy college student is slipped an Ex-Lax Mickey Finn and rushes through a crucial multiple choice exam, rapidly checking off nothing but letter \"C\" answers before rushing off to blessed men's room release. You're welcome.) All this should potentially make Wild Hogs one of this year's top Musts to Avoid, but there's one mitigating factor: it's funny. (And charming. And even, at times, surprisingly insightful.) The four guys have some delightful moments both together and separately, with Lawrence's \"condiment showdown\" scene his finest moment ever and Macy, as the one single guy in the group, approaching this with as much skill and commitment as he does anything written by David Mamet; he's so likable here that the final pre-credits gag is unusually satisfying. (And, interestingly, Macy is the only one of the four who's comfortable with onscreen nudity, even when the script calls for it.) But what really makes the hogs hum is the supporting cast: Ray Liotta, in full Something Wild loose-cannon mode, is hilariously unhinged as a \"real\" biker perpetually infuriated by the \"posers\"; Marisa Tomei, whom I've often found a little too self-consciously cute in some of her past performances, strikes the perfect note as a restaurant owner and possible romantic interest for Macy; the offbeat casting of character actors John C. McGinley (TV's Scrubs) and Stephen Tobolowsky (a specialist in playing slimy bureaucratic weasels) as two very different small town cops, yields wonderful comic dividends. I won't deny that Wild Hogs' premise rips off that of City Slickers (albeit with only a third of the soulful navel-gazing and three times the belly laughs), but Becker's ability to stage and sell a gag has improved 1000%--it would almost have to!--and the result is a deserving crowd-pleaser that pleasantly recalls the days when Touchstone Pictures routinely released at least one solid, entertaining audience movie (Splash, Ruthless People, Pretty Woman, etc.) a month. Despite several critics' fevered attempts to convince you otherwise (shouldn't Macy's work alone have been enough to inch this movie into the yellow regions? A score of 27 is a clear case of overkill!) its box-office success, like that of Stir Crazy, the original Porky's and many other \"crowd comedies\" of years past, is proof of absolutely nothing more ominous than millions of moviegoers' perfectly understandable desire to settle down after a long hard week with a fun, feel-good movie. Peter Rainer, Joe Morganstern, Pete Vonder Haar, Ruthe Stein and Rick Groen in particular have responded with a violence and viciousness worthy of Liotta's murderous Jack; maybe a nice, relaxing road trip would do THEM some good!"
    },
    {
      "rating": "8",
      "text": "I feel as if the only people commenting on this movie have no humor at all. That's what it feels like ever since I saw \"Wild Hogs\" myself. \"Wild Hogs\" is by far the funniest and most surprisingly good movie this year, only behind the fantastic \"300\". There are laughs from start to finish ranging from slapstick to homophobicy and many other categories, so everyone has something to laugh at. It seems 95% of the general populace liked it. Why can't the critics?"
    },
    {
      "rating": "5",
      "text": "A diluted \"City Slickers\". There are just enough moments of humor to make the viewer feel they have not totally wasted their time. The guest appearance at the end is the best scene of the entire movie. It feels like an attempt to \"validate\" the movie. It doesn't work. If anything it reminds us how shallow this movie is compared to other \"hit the road\" movies. It just provides a great moment of nostalgia."
    },
    {
      "rating": "9",
      "text": "This movie has no plot and no message. just very funny actors who are good at making people laugh. Shame on the critics for losing touch with us."
    }
  ]
}