{
  "id": 3259,
  "title": "Winchester",
  "starring": [
    "Jason Clarke",
    "Helen Mirren"
  ],
  "runtime": 100,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "San Jose, California, 1906. Isolated in her labyrinthine mansion, eccentric firearm heiress Sarah Winchester believes that she is being haunted by the souls of those killed by the guns manufactured by her company.",
  "releaseYear": "2018",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tHDtskokZeO9B3JBdR1dSH0uqad.jpg",
  "categories": {
    "plot": 4.806451612903226,
    "acting": 5.384615384615385,
    "ending": 4.0,
    "soundtrack": 4.0,
    "cinematography": 4.0,
    "familyFriendly": 3.8,
    "funny": 4.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Quite frankly, the scariest aspect of this film was me wondering just how Dame Helen Mirren could've possibly got involved with this mess. If I had to guess, the coveted Winchester name was probably the only thing that caught her eye. This film really isn't worth getting into, so I'll just say that overall, not only is it rather tedious, it's not scary in the slightest, as it's one of those films where you see the scares coming from miles and miles away, and Dame Mirren and Jason Clarke's talent are completely wasted."
    },
    {
      "rating": "2",
      "text": "The producers probably wanted a classy presence in Helen Mirren, thinking she could bring gravitas to the genre, while softening the blow of this dialogue-heavy script. She plays the heiress to the titular company, best known for their rifles. Her elaborate house has become an unhappy home for the ghosts of anyone who's ever been killed by one of their firearms. A doctor (Jason Clarke) is sent to determine her sanity, but gets expectedly sucked into the hauntings by the unhappy spirits. The period look of the film is attractive, but the story is dull and predictable. Despite a few jump scares, there's no real tension or anything about the film that makes it worth seeing."
    },
    {
      "rating": "5",
      "text": "While this isn't great I can't say there wasn't some decent moments. The performances are all good and there are some genuinely scary scenes. Overall though it's pretty forgettable. C+"
    },
    {
      "rating": "2",
      "text": "Every once in a while you get a horror movie that is so painfully terrible it's funny. Well let me tell you that Winchester is not that kind of horror movie. It takes the real life story of the Winchester mansion, perhaps the most haunted house in the world and turns it into a bland, boring and predictable horror movie not worth your time or money. Helen Mirren plays Sarah Winchester, haunted by the ghosts of people killed by the Winchester rifle. But one ghost isn't like the other ghosts, he won't stay peacefully in his room, no this ghost is here for revenge. The house is under constant construction, dismantling and rebuilding room after room for all these lost souls day and night. Jason Clarke as doctor Eric Price is sent by the Winchester company to assess Helen Mirren's mental state. Similar to all those other haunted house movies you've seen before only this time the house is bigger, there's more ghosts and almost every single scene does that typical horror movie trope were everything goes very quiet while something waits in the darkness to burst out with a bang and give you a fright. \"Are you scared yet?\" jump scare. \"How about now?\" jump scare. \"Ooh you're definitely scared now right?\" Jump scare, jump scare, Wilhelm scream, Helen Mirren gliding around the house like the women in black, guns floating in the air and bang. End scene. Awful, waste of time, avoid it at all costs. I sat through this rubbish so there's no need for anyone else to subject themselves to the worst movie of 2018 so far. Not recommended."
    },
    {
      "rating": "8",
      "text": "From the commercials, I didn't set my hopes too high. The film seemed very average, but it surprised me.Be forewarned this is more of a supernatural drama, like The Lady in Black, than a straight-up balls-to-the-wall horror film. Not to say there aren't any genuine scares in this. There are two really creepy scenes here. It's just that the film focuses on the story behind the characters and it sometimes takes too much time between scares. Still, I appreciate the emphasis on characters and plot in this. The film feels fully realized and it has a strong cast. Credit should also be given to the set, costumes, and props; a lot of detail and color. This film looks like the directors did their research and wanted the film to look historically accurate.ALright, this may not be the best scary movie, but it is a good movie."
    },
    {
      "rating": "7",
      "text": "Having adored the Spierig Brothers 2015 film Predestination (“an unpredictable thrill ride” and “mind-bending trip” with an “awesome” performance by Ethan Hawke), I was expecting a totally different kind of film – an original one that might do with horror what Predestination did with time travel. Nope. Winchester is a tame, nicely crafted and very well-acted haunted house film with no originality whatsoever. I gave it as high a grade as I did because I wasn’t bored and the house itself is interesting, but if you know the Spierig’s first film or love films like The Haunting of Hill House, it is extremely disappointing."
    },
    {
      "rating": "1",
      "text": "This films is nothing but filthy trash!!!Slow, terrible characters, dull and senseless."
    },
    {
      "rating": "3",
      "text": "I'm aware Helen Mirren decided to make this film, I believe it was because of the paycheck but seriously it was terrible, there's no scares, no tension, no suspense, no mystery, not a shred of entertainment, a complete hollow atmosphere. In overall it was bad and boring. It's a sin to waste her talent like this but **** it, she did the film anyway."
    },
    {
      "rating": "2",
      "text": "“Winchester” is based, very loosely based, on the true story of Sarah Winchester, widow of William Westchester, whose family started the famous Winchester rifle.After his death, Sarah was left very rich and lived in a 150+ room house that she constantly worked on it having construction done 24/7. The house, today, is a California magnet for tourists.With such a large house, directors Michael and Peter Spierig, who also helped Tom Vaughn write the screenplay, it all seems to be confined to the same walls, rooms, hallways, windows, stairs and the one big bell clanging.The main story is about Sarah being haunted by the ghosts of the people killed by Winchester rifles and that story is a bunch of clichés that is filled with violence and not a scary moment.When Helen Mirren’s presence can’t make a movie better you know you are in a movie worth skipping."
    },
    {
      "rating": "7",
      "text": "This movie was pretty good. A little to short though for my liking. I gave it a 7."
    },
    {
      "rating": "1",
      "text": "booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooring"
    },
    {
      "rating": "6",
      "text": "A great setting and strong character work keep things going in the face of cliché scare tactics. The majority of my enjoyment with the movie came from Jason Clarke's very charming performance. Sharp dialog makes his interactions with the other characters entertaining and The Spierig Brothers have crafted a satisfying plot arc for him that ties in well with the main issues they've got going on in the Winchester mansion.I found myself very invested in the plot as the characters were intriguing (even if some were given too little to do). The actual horror element left me wanting though. While an effective recreation of the early 1900s visually, there is a notable lack of any sort of haunting atmosphere. The directors try their best to get a rise out of you with their well-crafted jump scares, but made them too overly telegraphed and predictable to give viewers anything more than a minor jolt. Mix that in with the slow pace and you have what many will find to be a rather boring watch.It managed to hold my interest with it's writing though. Things can be a bit goofy in some areas, but I liked how Winchester managed to take actual events and built it's own little horror story around them. Despite the generic approaches taken to try and freak audiences out, it's a solidly executed movie. The Spierig Brothers have proven themselves as talented directors that are capable of bringing their visions to life onscreen. They've just more than not often found themselves in need of better material to work with. This film is unfortunately another example of that, although there are some good qualities to it."
    },
    {
      "rating": "0",
      "text": "I stopped watching after 40 minutes. After a couple of weak, and predictable, jump scares along with the terrible \"acting\" by the cast, I was just turned off by it. And it's not exactly dripping with originality either. It's your typical paranormal film, That's it."
    },
    {
      "rating": "5",
      "text": "A very typical ghost film which includes a character connected to spirits, a skeptic who eventually becomes convinced and a possessed child. Overall not badly made but not adding anything new to the genre."
    },
    {
      "rating": "5",
      "text": "The only thing that is good in this movie is the costumes and montage. The shots are really interesting as the structure of the acts, but apart from that rest we get nothing after early 15 minutes. Tiring dialogues, idiotic jump scares scenes and this feigned horror and tension."
    },
    {
      "rating": "2",
      "text": "Can't think of a less scary horror movie than this. The numerous jump scares are completely ineffective. The attempt to give this film some kind of narrative was useless. The Spierig brothers should stick to SciFi."
    },
    {
      "rating": "9",
      "text": "Perfect example of self important professional reviewers missing the mark. Compared to other ghost story films out there this is an 8 but giving it a 9 to counteract the negative reviews."
    },
    {
      "rating": "4",
      "text": "The idea that a ghost/dead is inclined to kill and haunt a company which created guns which killed his loved ones and himself is really ridiculous. I mean then all those who were killed by the atomic bomb should haunt the bomb's creator and his family. Seriously...The setting is above average, passable for medieval setting. Scares are pretty generic and rather predictable having seen so many horror films. Plot is pretty simple with not much surprises from the beginning to the end. This is an okay movie if you have nothing better to watch at the moment."
    },
    {
      "rating": "4",
      "text": "Are tedious replication and habitual creative absence ghosts for a resurrected horror genre? Aiming to be one of the scariest delectations in the first film semester as far as supernatural horror sub-genre is concerned, Lionsgate's movie ended up being, from a very personal perspective, the first fiasco of the year. Openly, it's shameful and disappointing to accept that two filmmakers, creative goldsmiths for their work, have wasted such colossal talents in a horrible way, with tremendous assembly it's inconceivable that a film of such punishable caliber has been released in theaters.Probably surprising for many, there is wretchedly little to say about this huge disaster, which means a terrible false move for a genre that might well be flirting, again, with the painful irreversibility. Among the noteworthy aspects, without hesitation, the successful, gloomy and faithful cinematography of 20th century. Few films afford to have such visual marvels because of the complexity that these involve, however, now Ben Nott gives an important contribution to present-day cinema. This mansion has nothing to envy the crystal building from \"Thir13en Ghosts\" or the dark famous house from \"The Amityville Horror,\" and even so it's used with lazier creative skill throughout all the runtime, sometimes reach to be moderately enjoyable thanks to the constant insecurity that denotes its walls, its doors, its imposing architecture.Besides, in the middle of its soporific predictability, an uncomplicated but acceptable sequence takes place, it never manages to produce a full impact, but it sets up a successful step by step tension that, odiously, ends with a shocking editing and an insulting jump-scare. The previous factor is the biggest flaw and disappointment of the film, abusing strident and ominous music and poorly accomplished scares that are neither effective nor terrifying, stifle the idea, have no control whatsoever, for the audience, suspense and terror are supported, by 90 percent, on such cheap and unsustainable tricks that  are so common in this kind of work today. Now, not to mention the huge waste of acting talent. Helen Mirren and Jason Clarke should never have accepted a role in a movie like this one. It's not possible to understand Clarke's hardships regarding— spoiler! —the death of his wife or his addiction to medicine, as for the difficulties of the erratic and tormented heiress regarding her deceased husband and daughter occurs the same thing, they're illogical and cold, since their exposure is terribly insipid, the characters don't present a well-shaped background or clever introduction to get some of the principal purposes of the first act, It should be added that the character of Finn Scicluna-O'Prey, Henry Marriott, is used shamelessly as a single-use comic relief, I mean their interventions tend to the unnecessary comedy leading to a boring and incoherent pace. Also, the performance of the kid shows no spark or connection to try to justify his function, another major error.And the worst part is coming. Despite all that, the real big mistake lies in the worst place of all: the script. The movie initially exhibits already-known prototypes: a mysterious widow resides alone in a haunted Victorian mansion; however, the interesting variable here is that, besides the fact that Helen Mirren is who interprets a terrifying lady with a lot of secrets, day after day evil spirits destroy and reconstruct the house, a twist inspired in real life events that could easily add good things to the typical haunted-house stories. It wasn't the case. The script is tempted by superficialities such as unjustified jump-scares or the development of a sub-plot coming from nowhere. Although the story seemed to explore a rich dual discovery journey between the doctor and the widow, it ended up being a family demonic plot, returning without cause to the usual gloomy horror tropes. \"Winchester\" by The Spierig Brothers is a misleading invention that means a false step in the triumphant streak of horror movies, as it drowns itself in a sea of jump-scares and traditions, from which we have wanted to escape for many years. Poorly-structured characters, nugatory sequences, emotionless editions and oversaturation of sound effects and goofy jump-scares compose the real first horror film hodgepodge of the year. What was predicted as a Magnum opus for the genre in the first half of 2018 just encompassed all a horror movie buff really fears: a wasted story, wasted high-scale actors, a fantastic but wasted mise-en-scène and endless and repellent successions of jump-scares. To be honest, in the end, it did turn out to be a real horror experience, but not those that make you suffer with pleasure, but those which you want to lock in a mansion with thousands of passageways and no-exit rooms. Although, all in all, it's doomed to the worst fate: oblivion."
    },
    {
      "rating": "3",
      "text": "\"Winchester\" was a film that did not give the fear that they had to give, and the plot of the mansion is null and understandable and is nullity planned to mix the terror with psychology, therefore it is null in every way, although it also falls into the biographical sub-genre and is salvageable, in addition to the decoration is very good, the story has a mediocre rhythm and the performances were not good, and those are the details that made it lose his caliber."
    },
    {
      "rating": "3",
      "text": "What's this?I don't know.I have nothing to say other than the weird rooms are great... and the story is boringly well told"
    },
    {
      "rating": "4",
      "text": "A very messy and incosistent plot, with information being added during the film that just made it feel like they were just trying to move it along, the movie flowed very forcingly. Relying on jump scares for horror factor was never really a great way to entertain me, if it doesn't have a good story to tell. In the case of this movie it does, but it doesn't tell it well enough to actually make me care for anyone in there."
    },
    {
      "rating": "7",
      "text": "This movie by no means deserves all the negative reviews like its getting. Its honestly not a terrible flick. I really enjoyed it. I am a big fan of horror movies, Hereditary, Abigail Hunting, Black Room, anything to do with dark atmosphere I love. This movie gets a solid 6.5 out of 10."
    },
    {
      "rating": "3",
      "text": "I've expected a lot more from this movie. But It's a cliche story of a believer and a non believer, mixed with jump scares. A too long, naive story, that even Helen Mirren couldn't have saved."
    },
    {
      "rating": "10",
      "text": "There are some things that I don't like about this film, namely the stories that should be packaged for real, but there are some stories written by the director so this film seems no longer based on a true story. Especially at the Winchester mystery house, in San Jose, California there are tours that can visit  Winchester Palace.  Why not just film in the original palace?"
    },
    {
      "rating": "1",
      "text": "'WHERE IS THE HORROR!?'  If this film leaned in to the strangeness of the source story it would have been better. Even being stoned won't save this disaster."
    }
  ],
  "recommendations": [
    "annabelle_creation",
    "lights_out",
    "scary_stories_to_tell_in_the_dark",
    "the_woman_in_black",
    "the_forest",
    "mirrors",
    "ouija_origin_of_evil",
    "the_ritual",
    "oculus",
    "the_conjuring",
    "the_autopsy_of_jane_doe",
    "the_conjuring_2",
    "the_woman_in_black_2_angel_of_death",
    "the_night_house",
    "insidious_chapter_3",
    "the_lodge",
    "the_invisible_man",
    "sinister_2",
    "insidious_the_last_key",
    "the_haunting_in_connecticut_2_ghosts_of_georgia",
    "annabelle_comes_home",
    "antlers",
    "the_boy",
    "the_rental",
    "the_possession_of_hannah_grace"
  ]
}