{
  "id": 4047,
  "title": "Windtalkers",
  "starring": [
    "Nicolas Cage",
    "Adam Beach"
  ],
  "runtime": 134,
  "genre": [
    "War",
    "Drama",
    "Action",
    "History"
  ],
  "description": "Joe Enders is a gung-ho Marine assigned to protect a \"windtalker\" - one of several Navajo Indians who were used to relay messages during World War II because their spoken language was indecipherable to Japanese code breakers.",
  "releaseYear": "2002",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/547q4HXlvEcS06lujfb2yzsTP3H.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 4.0,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "4",
      "text": "Strange that a film with so much bloody carnage could be so unexciting."
    },
    {
      "rating": "6",
      "text": "This is not one of John Woo's strong films, this is one of those middle of road films. It's just exist and I'm just indifferent to this."
    },
    {
      "rating": "4",
      "text": "This war film is very slightly based on the story of Native American soldiers, who contributed to the war effort during World War II by creating a secret military code based on their languages. The code was very important for US military communications during the Pacific conflict, but I don't think the truth of the facts in this film goes much further than this.The film takes place mostly during the fierce Battle of Saipan, in which the Americans and the Japanese fought for control of the Mariana Islands. In the middle of that is Sergeant Joe Enders, back in action after being seriously wounded. He has the mission of protecting a Navajo radio operator specialized in that native secret code, or killing him, if his capture by the Japanese is imminent.Directed by John Woo, it is an action-packed film where most of the time is spent in the heat of combat. Therefore, I believe it will not be surprising if I say that the script is quite flawed and that history is limited to taking us from fight to fight, with breaks for more intimate moments among soldiers, where dialogue and nostalgia abound. At a certain point, we no longer know why they are fighting there. The characters were not very well thought out, as we never cared much for them. In return, the film has enough action to entertain us if we don't think too much about it.The cast does not deserve particular attention either. There are a lot of big names, starting with the obvious protagonist Nicolas Cage, but they haven't done anything remarkable. Cage is similar to dozens of his other works in action films and seems unable to leave that record. Adam Beach did a satisfying but superficial job because he has no material to truly shine deepening his interpretation, nor does his character seem to have been cut out for it. Christian Slater, Mark Ruffalo, Noah Emmerich, Peter Stormare... all were underused and sometimes reduced, virtually, to extras.Technically, the film stands out for the excellent special effects and the sense of realism and authenticity of all those explosions, especially when the camera shows us an overview of the combat. It is likely that these scenes were made on location instead of using the green screen. If not, the CGI used was the best available. The cinematography is also very good and offers us some impressive scenes and sequences. But, in the final, there is so much impressive action that, from some point, it no longer impresses us, being this film a victim of its own recipe for permanent noisy and histrionic action. Good sets and costumes complete the overview of a war movie loaded with action but perfectly forgettable."
    }
  ]
}