{
  "id": 2371,
  "title": "Wind River",
  "starring": [
    "Jeremy Renner",
    "Elizabeth Olsen"
  ],
  "runtime": 107,
  "genre": [
    "Crime",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "description": "An FBI agent teams with the town's veteran game tracker to investigate a murder that occurred on a Native American reservation.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pySivdR845Hom4u4T2WNkJxe6Ad.jpg",
  "categories": {
    "plot": 8.62962962962963,
    "acting": 8.768115942028986,
    "ending": 8.48,
    "soundtrack": 8.666666666666666,
    "cinematography": 8.777777777777779,
    "familyFriendly": 3.0,
    "funny": 7.666666666666667,
    "action": 8.307692307692308
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Wind River is an absolutely incredible film that deserves the acclaim it's receiving. From the tone to the intensity, Wind River is hands down one of the best movies of 2017."
    },
    {
      "rating": "8",
      "text": "Beautiful and gritty it tells the stories of the sexual assault and worse, the native north american women have to put up with. The actors are great and there is not much hope in their eyes, which is understandable.A straightforward story, but very well told.Action is scarce but very intense, and just underlines how **** the situation is..."
    },
    {
      "rating": "8",
      "text": "I found Wind River well done thriller with some nice acting, visuals and emotional moments. It has a slow start followed by an engaging middle part but it definitely drops the ball at the end. I liked Elizabeth Olsen as the out of her depth FBI officer who does her best. Jeremy Renner is also good but seems to lack screen presence. The rest of the cast give a good performance. Overall a decent movie with a good cast but marred by a poor ending and script that doesn't always work well.I will only make a few observations about the weak parts of the movie.Jeremy Renner?Given that the movie is set in an Indian Reservation I found it curious that this role was not given to a native or that there is hardly anything done with the fact that Renner is a white man living among Indians. Specifically because an important theme throughout the movie is that life in an Indian reservation is hard and the natives are treated as second rank citizens. It is one time alluded to that Renner isn't one of them, but most of the movie sees him treated as one of them. In addition Renner is actually a hunter of dangerous wildlife. It almost feels like this should have been played by native but that the studio probably didn't have the balls to cast one as the lead.Renner's additional problem is that he seems to have a weak screen presence in this movie and he is at his best alone. Perhaps this is actually well played.  The problems it that the moment someone else steps into the frame the camera seems to turn away from him, like happens with Graham Greene(the chief of police), Olsen and even his ex wife played by Julia Jones. I am still not certain if that is well done or just his issue.Those infernal pumas.An important part in the movies is played by the elusive pumas. It is searching for them that makes Renner find the first body and lateron he finds via them an important clue about the murder. The confrontation between Renner and the pumas seems inevitable, and I was expecting that this would lead to some kind of payoff near the end. However, nothing is done. In fact it isn't even shown that he kills these predators in the end after he has found them, which feels like someone didn't had the nerve to have them killed and not even have it suggested by having some shots fired?Dropping the ball...This movie is a thriller set in a cold landscape giving you this eerie forlorn feel sometimes changed into beautiful visuals. This contradiction of the deadly blizzards and stunning beautiful landscapes is an important aspect of the movie. It is mirrored in the movie for the people: Renner's happy family before his daughter was killed and his breakup with his wife after. Much of this is alluded to(and might have been even more profound with a better director and script)...then the end happens. The end is a sudden change of pace. Perhaps because this contrasts with the first three quarters of the movie just like a blizzard follows a beautiful wintry landscape. However it feels like they suddenly decided to take a sharp turn and step into another genre. I leave it at this, as to not spoil your fun, but I felt that the ending was not well executed, especially because they just show you what happened scene by scene during the murder. It spoils the thriller/mystery aspect. Like really, was that needed? Like really, can't you solve a case without knowing that you got it right?"
    },
    {
      "rating": "10",
      "text": "This movie really surprised me. I didn't even hear about it in theaters, and when my wife and I came across it browsing for movies to rent at home we passed on it several times. The trailer really made it seem slow, boring, and not really any different from any movie like this that I've already seen. I couldn't have been more wrong. This is one of those movies that punches you in the gut and never lets you back up even after it's over. It's so powerful that I watched it with my best friend and we normally talk through a whole movie while we are at home but we sat in silence, completely gripped by this movie. Jeremy Renner is fantastic, and this movie proved to me that Elizabeth Olsen is a powerhouse actress that is not fairly represented by her role as Scarlet Witch in the MCU. Instantly one of my favorites that I will come back to time and time again."
    },
    {
      "rating": "10",
      "text": "All the cast is perfect, the \"good\" guys are good and the \"bad\" you hate, awesome acting from everyone, the character portraited by Gil Birmingham its amazing, its a thriller/drama that will stay with you."
    },
    {
      "rating": "9",
      "text": "Wind River is mysterious, powerful and absolutely thrilling. It is truly a crime drama that has you guessing from the start."
    },
    {
      "rating": "7",
      "text": "Wind River the most usual drama with the detective's elements. Each element of the movie is executed at the average level, the work there is nothing does not apply. But the realness of the events and lack of a happy ending does this work a little special. The good movie what to look its once."
    },
    {
      "rating": "8",
      "text": "This movie was made for a great cause, and it most certainly followed through with it's message. The director's shooting style was really fit the mystery & suspense genre. The third person always kept me on the edge. Also the cold and raw vibe was present the whole movie. Actors doing their really great job here, they just reflected perfectly on their character's pain and their emotional state, which also the audience can feel here. I certainty had a few moments of dropping tears through my watch through. The Writing was really simple and reflected on the simpleness of the natives, and the rest of the people forced to live those areas. And in my opinion the action had it's perfect flow, and had no pacing issues. Overall it's a very good movie which should be more appreciated."
    },
    {
      "rating": "10",
      "text": "Wind River is a film that gives insight into a culture that isn't often explored in films, this paired with a simple but powerful neo-western mystery set in the bleak Wind River Indian reservation makes for a unique and enthralling watch. A fantastic performance from the entire cast but especially the Native Americans featured, who ooze emotion with authenticity. The setting makes for some excellent cinematography the likes of which haven't been seen for years.The message of the film doesn't feel overplayed, but honest."
    },
    {
      "rating": "9",
      "text": "BREAKDOWNWriting (Taylor Sheridan): The story of 'Wind River' is beautiful and structured flawlessly. I even enjoyed the flashback they threw in to give us the backstory on the crime. It was also a nice little surprise visit from Jon Bernthal. The characters were very well-written and each one was emotionally complex. In addition, that ending was incredibly satisfying. 8/10Performances: The acting is all wonderful, whether it be from the central cast or the supporting. It was beautiful watching the hospital scene and seeing Elizabeth Olsen break down, very similar to the medic scene from Captain Philips. I only saw one problem with the acting and it came from an extra. When Natalie's dead body is lying on the examination table, the actress playing the dead body is seen breathing through the diaphragm. It's small but noticeable. 8/10Cinematography (Ben Richardson): The cinematography is outstanding in this film and goes the extra mile to show off the beautiful scenery of the snow-covered mountains. Absolutely flawless on the part of Richardson. 10/10Editing (Gary Roach): I was surprised to see how great the editing was, especially during some parts where I can imagine it was challenging. The moment of the pepper spray raid was well-edited, as well as the flashback. 10/10Visual Effects: The VFX were well-done and seamless from the practical effects. From the blood running down characters' faces to the look of frostbite to the dead animals. It all looked stunning and is exactly how filmmakers should apply VFX. 10/10Enjoyment: 'Wind River' is a very exciting film that constantly has the audience's attention and curiosity. It even goes the extra mile to make sure it satisfies the viewer with an incredible ending and a connection to the real world we live in. 8/10Musical Score (Nick Cave/Warren Ellis): Cave and Ellis bring it again with a beautiful score after their excellent job on 'Hell or High Water'. The soundtrack is very similar to that soundtrack but supplies some different tracks that help convey the freezing cold of this setting. 9/10Sound Mixing: The sound mixing is very well-done in this flick as we're given a lot of ambiance through the sound alone. Even the gunshots are well done, minus the fact that some of the sound effects they used for the gunshots were ones used in many movies before. However, that was not distracting enough to be a problem. 9/10Production Design (Neil Spisak): The scenes were well-designed from the cabins and trailers to the yards they reside in. Even the natural settings are beautifully crafted. 10/10Overall: 'Wind River' is another excellent film by Taylor Sheridan after my personal favorite of his 'Hell or High Water.' The film is mysterious and jaw-dropping while also opening our eyes to travesties done toward Native American people. 9/10"
    },
    {
      "rating": "8",
      "text": "Excellent and deep thriller / drama / western with a hint of revenge movie. Very interesting story with state-of-the-art cinematography and directing. Strong cast and the original score is absolutely mind-blowing and deserves to be an instant classic from duo Warren Ellis & Nick Cave. I've barely nothing negative to say about it, really well worth the watch."
    },
    {
      "rating": "10",
      "text": "Sad portrayal of true life of communities living away from us and perceived as alien."
    },
    {
      "rating": "9",
      "text": "One of 2017's most underrated films.A movie that is as much about cultural differences as it is a murder mystery."
    },
    {
      "rating": "9",
      "text": "This film was beautifully shot, well written and has some great performances from the main cast. Jeremy Renner has given his best performance to date in my opinion. I sometimes find it hard to watch him as an actor, but he blew me away in this role. Elizabeth Olsen also did a fantastic turn as the young FBI agent trying to do the right thing. It's a very thought-provoking thriller and manages to tell the story clearly without complicated, long-winding plot points. The lives of the characters in the story and how they react to what's happening in their town are very well developed, and it easily encourages you to become invested them.  I hugely enjoyed this movie and would definitely recommend it."
    },
    {
      "rating": "9",
      "text": "I saw this film on a weekday, matinee, and there were only 2 other people in the theatre.  At the end I really really wanted to give it a standing ovation but thought I might look a bit silly.  What a well acted, suspenseful, socially relevant film.  I wasn't quite sure whether Elizabeth Olsen was quite right for her role but warmed up to her a bit more as it played out.  Jeremy Renner is perfect-the role is made for him.  Beautiful cinematography & direction.  Any minor issues I had with the film are just too minor to mention.  Overall a must-see, even though the trailer may not motivate, force yourself.  If you are disappointed, let me know.  I'd be very surprised."
    },
    {
      "rating": "8",
      "text": "Very well acted mystery murder story. At times some of the dialogue was a bit offish but overall a film worth seeing. Negative reviews are unfairly warranted."
    },
    {
      "rating": "8",
      "text": "Disregard average ratings from the critics. They over think a film and look for what isn't perfect. This is a good film. Very different and interesting plot. Great visuals from the Wyoming terrain. You can feel the cold watching the film. Renner is terrific as a Gary Cooper type employee for the Fish and Game Department. He tracks animals that kill the residents livestock but on a hunt, he comes across a young woman frozen in the snow. She turns out to have been his daughter's best friend. The female FBI agent lacks experience and enlists Renner's help. Good plot, nice paced film. Well directed and acted. Has some graphically violent scenes . Most of the movie takes place on an indian reservation and their plight in 21st century America is well depicted"
    },
    {
      "rating": "9",
      "text": "Wind River focuses on the real life problem of missing and murdered Native American women. It features Jeremy Renner as Cory Lambert, a US Fish and Wildlife Service Tracker who, while on a routine patrol in the Wind River Indian Reservation, in the US state of Wyoming, discovers the frozen body of a dead woman, and Elizabeth Olsen as FBI Agent Jane Banner, sent to investigate the victim’s cause of death, who enlists the help of Renner’s character as she does so. The movie is notable for its sweeping aerial scenes of the beautiful Wyoming winter landscape, emotional scenes, one particularly wrenching, involving Olsen’s character, Renner’s character’s grit and Graham Green’s assured supporting performance as Tribal Police Chief Ben. The violence is graphic but not out of place given the subject matter. It is a well made movie."
    },
    {
      "rating": "8",
      "text": "Much better than I thought. The plot may seem like a typical crime story but it is much more and I liked how the place and the weather play a very important role in the film. It has a lot of suspense, intrigue and an excellent turn at the end. Renner is impressive as this character acts to which one easily comes to empathize, Olsen seemed very good to me, but totally eclipsed by his partner. Very good direction, photography and a music that makes you skin on edge. The bad thing is that at times I was a bit dense and Sheridan script has a couple of clicks that we saw in Sicario and Hell or High Water (previous work of this writer)."
    },
    {
      "rating": "10",
      "text": "Clearly the movie of the year so far (Aug 5). Jeremy Renner is amazing in this film - he hasn't been this good since The Hurt Locker.  Beautifully written and directed. With the excellent Native American supporting actors employed here, it feels like the cinematic version of a Longmire episode, which is a huge compliment in my book. Kudos, finally, to Elizabeth Olson for her spare performance, which could have been played up and caricatured. She's subtly terrific in her role."
    },
    {
      "rating": "9",
      "text": "As with \"The Hurt Locker,\" Jeremy Renner gives a performance here that's incredibly real -- but in a film so intense, I probably won't see it twice. (Anyone else think he's underappreciated, for some reason?) The cinematography is captivating, the vast snowy vistas contrast with people's grim lives on and off the reservation. You know there's a deeper tragedy in Cory's life beyond just being a divorced dad with a lonely job, but you get to those deeper layers slowly. Supporting cast is excellent. I like Elizabeth Olsen -- she says a lot just with her eyes -- but can't imagine any FBI office sending this young woman into this situation, and feel an actress with more grit would have been better in that part. Overall, though, a stunning film that stays with you."
    },
    {
      "rating": "8",
      "text": "Props to the great cast from Renner, who more than deserves a best acting nomination for his role here, to the Native American actors and actresses that provided even small supporting roles. The entire film was wonderfully acted and beautifully directed. And all this praise before we even reach the plot, Which was as complete and enjoyable as you would expect from a drama film. It's right on par with the previous works by the writer (Hell or High Water, Sicario), who also directed the film. Go see it, It's fantastic and satisfying from beginning to end."
    },
    {
      "rating": "8",
      "text": "This final piece to Taylor Sheridan's \"modern western\" trilogy is as gloomy, as gut-wrenching, and as effective as any other film in the batch. But, what sets \"Wind River\" apart from both \"Sicario\" and \"Hell Or High Water\" - aside from the fact that this one features Sheridan himself in the director's chair - is just how staggering the message is this time around. True, the statements on the drug war and the housing/financial crisis made for interesting thematic fodder, but I think \"Wind River\" speaks to a topic that has unfortunately gone far less discussed: life on the Native American reservation. Couple these hauntingly illustrated truths with some brilliant performance work from both Jeremy Renner and Elizabeth Olsen, and you end up with one of the year's most underrated films."
    },
    {
      "rating": "8",
      "text": "Wind River is an intense character-driven thriller that is underlined with suspense and mystery as a result of realistic performances and fantastic camera work that truly captures the atmosphere and isolation of the location – resulting in a unique crime thriller that is one of the best of 2017 - 8.5/10"
    },
    {
      "rating": "7",
      "text": "Wind River is a film that is tightly paced, has some good shots, good performances from Jeremy Renner and Elizabeth Olsen, and it has a great message about the modern-day treatment of Native Americans by the United States. Where Wind River TRULY excels is the atmosphere. This thriller has a very real and palpable sense of horror. Parts of the film are truly scary. It'll definitely keep you on the edge of your seat. There are some minor technical issues, like not seeing the actors breath on cold days, and some over-indulgent snowmobile shots, and some weird edits that don't quite look real, but other than that, if you are a fan of thrillers, horror, or even modern-day westerns, you must see this movie."
    },
    {
      "rating": "8",
      "text": "Wind River, I didn’t even know this was a film until my buddy asked me to see it the other day.   The marketing seemed to be nonexistent in my area.  It was an overall good crime mystery on an Indian reservation.   Jeremy Renner and Elizabeth Olsen were good enough in their perspective roles, but I really loved Graham Greene as one of the reservation police.  It’s been a while since I’ve seen him in a film and he was as charismatic as ever.    Though not my favorite film of the year, I  will say that it opened my eyes up to some of the injustices that happen on these Indian reservation.  I recommend looking at some of the statistics online, some of which are very disturbing.  If you like crime mystery or just want to see a good contemporary film, then Wind River is for you."
    },
    {
      "rating": "8",
      "text": "Let me start by saying if Jeremy Renner can win me over in just under two hours then we’ve got a winner here. He was perfect for this type of bitter thriller. Particularly against Elizabeth Olsen he really does rise to the mark. Olsen isn’t terrible by any means but her character never really did much bar showing up, reading her lines and going home. Well done you, at least you tried.An FBI agent teams up with a local hunter to investigate a murder on a Native American reservation. With Taylor Sheridan, the writer of Sicario and Hell or High Water you’re left with the same type of highly atmospheric slow builder. Incredibly tense and interspersed with scenes of shocking violence. You’ll be on the edge of your seat. A brilliantly told story, it’s dark, depressing and is likely to get a reaction from most people. If you like Fargo or Nocturnal Animals then this is right up your street. Highly recommended."
    },
    {
      "rating": "9",
      "text": "Taylor Sheridan is the mastermind writer behind Denis Villeneuve’s “Sicario” (2015) and David Mackenzie’s “Hell or High Water” (2016), in which he was nominated for an Oscar for Best Original Screenplay. Although no continuity, “Wind River” acts as the final chapter in Sheridan’s neo-western frontier trilogy, once again romanticising his passion for western tropes and the gun slinging violence of that era. Western feel aside, Texas-born Sheridan’s previous scripts were topical that provoked thought, discussion and insight into various issues. Wind River is no different. “Sicario” tackled the US war on Mexican drug cartels, trafficking and ambiguity of law enforcement methods and jurisdiction, whilst “Hell or High Water” highlighted the economic plight of West Texas, the US housing crisis and predatory practices of financial institutions. Wind River focuses on American social issues such as the marginalisation of Native Americans, impoverishment, substance abuse and cultural ignorance.This crime thriller mystery opens with a barefoot teenage girl sprinting desperately across a moon soaked snow covered open plain, until she collapses with exhaustion, ultimately crawling to her death. The next day she is discovered by Cory Lambert, a Wyoming tracker played by Jeremy Renner, who immediately recognises her as a friend of his teenage daughter. With the death of the Native American girl occurring on the Wind River Native American Reservation, tribal police become involved, headed by its straight faced chief played by Graham Greene. The death also captures the attention of the FBI and they send their “closest” agent from Las Vegas to help investigate. Elizabeth Olsen joins Renner, her Avengers co-star, playing inexperienced FBI agent Jane Banner. Her girl like demeanor, lack of preparation for the harsh climate and cultural ignorance all brilliantly add to her fish out of water character and the reservations isolation from the outside world. Her character traits remind me of Jodie Foster’s Clarice Starling from The Silence of the Lambs.Banner and Lambert combine to try and solve the mysterious circumstances of Natalie’s death with Lambert motivated by a past family tragedy. The relationship between Banner and Lambert is handled impressively as they both leverage each other’s skill set to move forward with the investigation. Despite her inexperience, Banner is still presented as a strong, equipped female lead, much like Sheridan wrote for Emily Blunt’s character in Sicario. Sheridan also avoids the temptation of making the two love interests, which would have been clichéd and made zero sense in the context of the story and each characters arc, instead establishing more of a mutual respect mentor relationship. Story wise, the rest of the film plays out as your typical police investigation slow burn until a violently intense climax lifted straight from the page of a Tarantino movie. It’s a climax that pays off, especially with an important scene that swerves the story from its seemingly conventional delivery that caught me off guard and was quite impressive and cleverly implemented.This is easily one of Jeremy Renner’s best performances.  It was a refreshing change that steered away from the emotionless brooding failure of Aaron Cross or light-hearted comic relief of a charter from the MCU. Lambert has personal demons that motivate him to help assist the investigation and although stoic for most parts, he has moments that scratch the surface of the heartbreak bubbling underneath. Renner’s best scenes come with Natalie’s grieving father Martin, played by the fantastic Gil Birmingham, also from Hell or High Water,  who acts as a link for the socio-economic problems faced on the reservation. The cinematography captures the landscape perfectly, with some great high shots that emphasize the harsh environment during snow storms and picturesque mountains during the day.Although she was flawless and matched Renner in performance and presence, Elizabeth Olsen’s character had very little back story or motivation other than being an FBI agent stationed in Las Vegas. Sheridan’s character driven scripts usually leave no stone un-turned and whilst it didn’t deter from the movie, it may have been a missed opportunity to strengthen FBI agent Banner’s impact.The symbolism portrayed in the opening scene with Jeremy Renner acting as protector by sniping off a pack of wolves preying on a pack of weak defenceless goats sets the tone for the films narrative. Survival and protection from predators. Sheridan’s directorial debut and third original screenplay Wind River is equal parts impressive and hauntingly dark. Suffering from comic book hero fatigue? With some surprising cameos, an amazing cast and a character driven script, Wind River is a must for fans of original screenplays and contemporary crime thrillers with a western edge."
    },
    {
      "rating": "10",
      "text": "Completely blown away by this film - saw it about 4 hours ago, yet I can't stop thinking about it.  All phases of movie-making are so acutely honed in this picture - I'd be shocked if it weren't a best picture nominee.  If Renner isn't at least considered for Best Actor, then the Academy is as stupid as I already think they are."
    },
    {
      "rating": "9",
      "text": "I thoroughly enjoyed this film because, unlike Hell or High Water, the entire cast was great and balanced (in Hell or High Water, Jeff Bridges dominated and I didn’t like his smart-ass, show-off performance). Jeremy Renner and Elizabeth Olsen were outstanding and the “mystery” plot really worked. Thanks to the superb cast, great script, and interesting setting and direction, I was thoroughly immersed in this  film from start to finish."
    },
    {
      "rating": "8",
      "text": "They say living well’s the best revenge but there’s also something very satisfying about good ol’ bloody revenge itself, at least in the movies.„Wind River“ takes us back in the tough working-class Americana in the middle of nowhere that often makes for an exciting drama and/or action.The people are tough and bitter, nobody plays around, the punches are thrown hard, and even the strongest characters edge at the brink of darkness.A game tracker (Jeremy Renner) teams with FBI agent (Elisaberth Olsen) to investigate a murder that occurred on a Native American reservation. There’s a bunch of smaller characters around but it’s very much about them two, or rather the tracker guy alone.If you have seen (among others) „Winter’s Bone“, „A Single Shot“, „Justified“ or any other story of this type, you can already guess what you’re in for.I would compare „Wind River“ mostly to 2013’s „A Single Shot“ starring Sam Rockwell, this being mostly about one unlikely male hero who has to take matters into his own hands, with a little exciting violence in the end. And both are also about mental and physical isolation, and solving stuff alone.Having written that, an early Nolan work „Insomnia“ also sprung to mind for comparision, which was my favorite Nolan until the mighty „Dunkirk“ arrived.The movie’s mostly about building – characters, their state of mind, sense of place, mood, suspense.The aim is not to dispense fast pleasures or easily digestible entertainment, and there’s no need for that, because once you are able to invest yourself in the story, you’ll probably agree that screenwriter and debuting director Taylor Sheridan is very able to pull it all off.Everybody's not gonna be happy about how they have built up the explosive finale, but I liked it. No problems with that kind of approach, at least in this case.Acting is very good all around, with delicate, nuanceful, and well measured performances from everybody from the central hero to the smallest characters on-screen.„Wind River“ is a cool directorial debut from Taylor Sheridan, who has previously acted in TV but also written screenplays for „Sicario“ and „Hell or High Water“, both unfortunately unwatched by me (and most others) so far. But both have received encouraging word of mouth, and „Wind River“ makes me want to see these even more.It’s a good TV series quality drama, which is highest honor an American movie can receive in 2017. Bleak and depressing but ultimately satisfying stuff."
    },
    {
      "rating": "9",
      "text": "Wind River was written and directed by Taylor Sheridan, who wrote the Oscar nominated Hell or High Water. Wind River stars Jeremy Renner as verteran game tracker, Cory Lambert, who discovers the remains of a young Native American woman while hunting on the Native American Reservation in the mountains of Wyoming. Which then lead to the murder investigation lead by FBI agent Jane Banner played by Elizabeth Olson. Learning that she is out of her element, Banner recruits the helps the help of Lambert to track down the murderers.Taylor really showed his skills as a very talented and solid director with Wind River, from the opening scene it was captivating and intense, leading to a strong roller coaster of emotion and drama. I was blown away by this movie and it's intelligent story telling and it's captivating performances, as wells as the truly beautiful look of this movie.Let's take a look at the best things about this film.1. Tone- The tone of this movie is really something that is known immediately, and Taylor Sheridan didn't back down from it. He used everything in his wheelhouse, including the environment, to create a very dark  and very sinister tone. The realism of this movie is scary and very gripping throughout. It didn't feel like a movie, it felt small and real. I felt like I was going along with these characters attempting to solve this horrific murder along side them.2. Acting- The acting in this movie was something that was truly amazing. Jeremy Renner gave hands down his best performance. Renner truly carried this movie with what I believe to be a truly oscar worthy role. Elizabeth Olson also had the role of her carrier in Wind River. I didn't see either of these characters as \"actors\" I saw them as the characters they were portraying and I felt like they had lives outside of the movie we were watching. The back story to Cory Lambert was so heartfelt and real I felt like I lived it with him. 3. Script- This movie had some of the best conversational scene I have seen in a long time. The dialogue in this movie was masterfully crafted. Nothing felt out of place and all of the dialogue felt like natural everyday conversation. The scene in which Cory tells Jane about his tragic past was one of the most captivating scenes I have scene in a while. Every part of this script just felt well crafted and put together.4. Entertaining- Wind River had a lot of entertainment value to it. It was one of the best murder mysteries I have seen. After Sheridan's Hell or High Water, I was expectant of a pretty good crime thriller. Wind River to me, was more entertaining. Every scene had me sitting closer to the screen and I was sitting on the edge of my seat by the end of it. It also had to really surprising and exciting action scenes.5. Ending- Taylor Sheridan did an amazing job of making this movie have one of the best endings I have seen in a long time. It was satisfying on a really big level. It didn't end in a conventional way, but the ending was cathartic in a lot of ways. The climax of this movie was almost sickening and was very hard to watch. Jeremy Renner really helped sell the ending of this movie in a big way.Overall, Wind River was one of the best movies I have seen this year. From the very beginning of this movie I knew it was going to be something extremely special. Wind River was an excellent movie and very entertaining. Jeremey Renner and Elizabeth Olson both gave the performances of their careers. I highly recommend seeing Wind River. I am going to give Wind River an A."
    },
    {
      "rating": "9",
      "text": "Fantastic movie. Written and directed by the guy who wrote Hell or High Water, which is also a fantastic movie (as well as Sicario, which I am not as high on). Lots of layers, a fresh narrative structure, and loads of great acting. At the very least, it would be nice to see Gil Birmingham get an Oscar nod for supporting actor.This is a movie that trusts the intelligence of the viewer, which means we can take a few perfectly-chosen words and imply paragraphs of emotion and exposition. For example, on the destruction of Native American culture:-Jeremy Renner: “What’s with the paint?”-Gil Birmingham: “This is my death face”-JR: “And how do you know what that is?”-GB: “I don’t. I just made it up. It’s not like there’s anyone around to teach me.”That’s it. No explanation, no further dialog, no righteous lectures. And with that, we know that a father can’t properly mourn his daughter because even that piece of culture been taken from him, along with everything else.Jeremy Renner also excels in a role which seemed made for his toughness and deliberate pacing.  He might even have reached Gus McCrae-level frontier righteousness, which isn’t an easy thing to do.Finally, the entire movie oozes respect for its subject and makes a compelling point without stooping to, as Mr. Birmingham has said in interviews, \"poverty porn.\"An all-around good film, and definitely in my top 5 for this year."
    },
    {
      "rating": "10",
      "text": "One of the best movies I have seen in years. When you see someone on sites like this give a movie a zero, it is advised to look at their profile because you often find they love movies that are trashed by others and hate ones loved by the majority. It is insane that this movie could be given a 0 by anyone with real taste because it has all of the following: fantastic acting; cinematography; script; setting. Give this movie a try, you will be glad you did."
    },
    {
      "rating": "10",
      "text": "a tragic tale filled with courage, determination, and the human spirit.  The acting is top rate and the story line keeps you engaged. In a hopeless town, and a hopeless case....the warrior spirit triumphs."
    },
    {
      "rating": "7",
      "text": "This was a good movie.  I don't know why directors/writers can't get things accurate though.  They could have asked someone from the U.S. Fish and Wildlife Service to review it, but no they would rather be inaccurate. Renner would not be employed by the FWS because they don't kill predators, he would be employed by Wildlife Services, which is Dept. of Agriculture. Except for not seeing peoples breath on supposed cold days, a good movie."
    },
    {
      "rating": "9",
      "text": "Wind River is a really intense crime/thriller film about the mysterious death of a young Native American woman. Corey (Jeremy Renner) and Jane (Elizabeth Olsen) are the main two characters we follow as they try to solve the case. Good insight is given into the characters so that we understand their motivations and why they want to solve the case. As the case continues to be solved the film gets more and more intense, leading up to some really graphic and shocking moments. The direction and performances are what make it all work, making every scene feel so real and grounded. The location the film takes place in is also worth mentioning, Wind River. It is both beautiful yet secluded from civilization, causing the characters to rely on the few people they have to survive."
    },
    {
      "rating": "9",
      "text": "Taylor Sheridan has done it again. I saw Wind River at the Nantucket Film Festival in June and I thought it was excellent. And based on the response of the people around me in the packed theater, I wasn't the only one. The applause at the end was loud and long. (The movie ended up coming in second at the festival, right behind behind The Big Sick) I enjoyed it as much as, if not more than, Hell or High Water. And definitely more than Sicario.The scenery, the score, the dialogue and the acting were all on point. Some of Jeremy Renner's best work. He's been spending so much time playing spy and superhero lately that I think people tend to forget that he was nominated for The Hurt Locker and The Town. His performance here is even better. I will definitely see this again once it's in wide release in my area."
    },
    {
      "rating": "9",
      "text": "A thriller that's more about the idea of people's whereabouts making their choices for them. The look of the film is great and just like Hell or High Water this is a different feeling Western. A"
    },
    {
      "rating": "10",
      "text": "ust like a steam engine going up hill, it gathers a full head of steam, and then takes you for a thrill ride going down the other side.  What a masterpiece, and btw who says there aren't any good movies this summer??  I liked how the movie spoon fed you little tidbits, and let the suspense build.  Jeremy Renner knocks it out of the park as Fish and Wildlife agent Cody Lambert.  He plays the agent with heartfelt emotions as you feel like he is on a mission to make amends for his own daughters untimely death.  Not only lots of action, suspense, and mystery, but it is packed with a lot of emotions.  Gives you the dark side of how our Native American's feel despair.  Also the FBI agent played by Elizabeth Olsen packs a lot of punch, as you get this impression like she is in over her head.  I have to say I went to this movie with expectations and it ended up being all met, as I had a feeling I could have been in for a let down with all the hype, as that has happened in the past.  Not in this case as this movie was a gem!  Hats off to all including the director Taylor Sheridan.  This is one I could go see again and still enjoy....huge thumbs up!!"
    },
    {
      "rating": "10",
      "text": "Wow, so many layers to this movie! I was glued to the screen the whole time. A true life horror, this not only touches on the crimes of our nations past affecting the future, but how nature can be so paradoxically brutal and beautiful at the same time. Every scene seemed authentic. A true drama/crime masterpiece. Oh and the location/cinematography is 10/10 easily."
    },
    {
      "rating": "9",
      "text": "A film to cleanse the palate, this is a tense thriller with stunning cinematography and careful pacing which is utterly compelling and masterfully crafted. Renner and Olsen are exceptional, and the film has a devastating poignancy drawn from the isolation and social complexities of the setting. With a storyline that plays out with delicacy up to the gripping final act, this is a film well worth your attention and time. 9.02/10"
    },
    {
      "rating": "8",
      "text": "Really good movie. Jeremy Reener and Elizabeth Olsen both carry this movie and do excellent jobs. The movie is clearly a mystery thriller and it is done right. You are on the edge of your seat just waiting and wondering to yourself whats going to happen. It's also a very good looking movie and I had a blast watching it. This one could clip under the rug for many people and it shouldn't."
    },
    {
      "rating": "8",
      "text": "A very entertaining thriller right through the credits. The movie is not perfect though, especially when it comes to some of the longer expositional segments where characters have \"deep\" conversations that are supposed to be moving. Many of these feel like they don't hit their mark. Also there is one particular scene that is out of place. It is so nonsensical that it really deflated some of the tension of the movie. Overall though I'd still say this is a great film and worth watching."
    },
    {
      "rating": "10",
      "text": "Glad I read the user reviews and decided to see this movie.   Blown away.   The entire theater including me were on the edges of their seat.  The pacing of the script was perfection.   Nobody got up to use the restroom.   The casting of the supporting cast and pulled me in to the movie.   I mean Jeremy Renner was amazing but so was everyone else as well!   Must see!"
    },
    {
      "rating": "9",
      "text": "simply a tremendous and moving film.  The acting is absolutely top notch and the suspense it builds up after the second act had my heart racing.  It was a little slow in the beginning but once you get past the setting up of the location and characters, you can feel everyone's emotions in each scene.  Great cameo in it as well.  Go out and see this movie"
    },
    {
      "rating": "10",
      "text": "Gripping movie! Though a slow start, once the lady appeared, I was holding my breadth all the way till the end. Gave me the same feel as Sicario - a lady officer being thrown into the deep end of the pool. As I watch, I always wonder what I will do if I were in her position. Knowing I won't survive, it peaks my interest to see how she does it."
    },
    {
      "rating": "7",
      "text": "Few writers have been in a better position to express their voice so clearly than Taylor Sheridan. While just his second directorial effort, Sheridan's voice was brought to life in both Sicario and Hell or High Water to the point that it feels as though both were directed by him. However, in seeing Wind River, the first film he wrote and directed (his debut Vile was just directed by him), it is clear that he does benefit from working with better directors. While Sheridan capably directs the film's strong script, it remains true that in the hands of somebody better, Wind River could have been a classic. As it stands, it is instead a pretty good film with great ideas on its mind that it handles far too bluntly at times. A thrilling and sorrowful film about a murder on an Indian reservation, Wind River works, but not to the degree that it should have, leaving it as a good but disappointing work.In both Sicario and Hell or High Water, it became clear that Sheridan's thematic focus was upon the disenfranchised. In the former, he focused on those living under the thumb of the Cartel in both Mexico and across the border in America. In the latter, he focused upon those left behind in the dust by the financial collapse in the late 2000s. Now, in Wind River, he turns his focus on a group of people all Americans have contributed to the demise of: Native Americans. With a Native American girl, Natalie Hanson (Kelsey Chow), found dead on the reservation by wild life and game tracker Cory Lambert (Jeremy Renner), the murder serves as merely a gateway into the life on the reservation. For FBI agent Jane Banner (Elizabeth Olsen), this functions as if it were another world. Completely isolated and on their own without back-up, the tribal police run by Ben (Graham Greene), operates across a territory the size of Rhode Island with just six officers. With such little police presence, no opportunity for advancement via education or jobs, and readily available drugs and alcohol, the Wind River Indian Reservation is the quintessential depiction of life for Natives in America right now. With missing Native girls reaching astronomical figures, alcoholism running rampant, and drug use throughout, Wind River calls attention to the issues facing Natives in a searing, depressing, and realistic depiction. When handling these issues, Sheridan does so beautifully and skillfully, burying them within average conversations between Cory and men believed to be somewhat connected to the murder. In every home on the reservation, demons reside and it is best to pretend that they are not actually there.Found six miles from the nearest building, Sheridan's ability to use the death of Natalie as a metaphor and symbolism for the life of Natives is perhaps the film's most impressive aspect. Dying not from being raped or killed, but from having her lungs explode due to the cold weather, Sheridan subtly and smartly depicts how the land has even turned against Natives after all these years. Through the turmoil and strife thrust upon them by the whites and their arrival in the Americas, Natives could always count on the lands to sustain them in their time of need. However, with such little territory and animals such as the bison leaving Indian reservations, the staples of Native American life have left them in the lurch to the point that they have nothing to do and are without hope. What were once proud people have been left destitute through their interactions with whites and through the changing of times as crops die and animals leave. While whites led them to their grave with a gun to their head, the land is truly what nailed the final nail in the coffin of Natives in America with the land no longer being sustainable. However, while the situation is hopeless and destitute - just as the one faced by Natalie with her having to run six miles barefoot just to get where she was, which was nowhere - this race of people that have been in the Americas for thousands of years refuse to give up and will fight until their dying breathe.Sheridan, in the course of depicting how the land and circumstance is truly what is killing Native Americans, refuses to let whites off the hook. At the end of the day, the only reason Natives are in this situation to begin with because of whites. It is a central argument in the film that it is impossible to define. With the case of Natalie, she was clearly led to run in the snow by some malevolent force that is certainly guilty of homicide. However, the coroner cannot give the cause of death as homicide, as she died because of her lungs exploding. While it is true that it should be considered a homicide, that is not her cause of death. Though it may be true that the land turning against Natives has only worsened conditions on reservations, the only reason they are there to begin is whites, so how can the blame not be laid at the feet of whites across America who deny culpability in the matter?"
    },
    {
      "rating": "8",
      "text": "Wind River is an important movie for the fact that it depicts a common occurrence is Native American, First Nation and Indigenous communities; the death rate is high and there are no prevention measures. Though there are moments that feel forced this is good picture that is well acted and well written."
    },
    {
      "rating": "8",
      "text": "While the whodunit lacks momentum, \"Wind River\" is a potent examination of various malaises, thanks to richly rendered characters and a beautifully shot setting."
    }
  ]
}