{
  "id": 4366,
  "title": "Winnie the Pooh: Blood and Honey",
  "starring": [
    "Craig David Dowsett",
    "Chris Cordell"
  ],
  "runtime": 84,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Christopher Robin is headed off to college and he has abandoned his old friends, Pooh and Piglet, which then leads to the duo embracing their inner monsters.",
  "releaseYear": "2023",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/fNTtVbqI92abEKAgz2ynurCUne.jpg",
  "categories": {
    "plot": 8.409090909090908,
    "acting": 9.0,
    "ending": 9.0,
    "soundtrack": 9.8,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 8.76923076923077,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Charming, heartwarming, just gorgeous and an animated film most wish they had the talent to make it is just beautiful and s good break from 3D. I give this movie 97%."
    },
    {
      "rating": "10",
      "text": "Taking it back to the roots of 2D animation, Winnie the Pooh and Disney do something that is rare and exciting in film. They make a picture perfect family friendly film that everyone in the house will enjoy. The cartoon like animation is funny and super charming at moments. A well written script helps, but a great script makes this a great film; clean humor that is super rare in cinema. My favorite animated film of the year so far."
    },
    {
      "rating": "10",
      "text": "An absolute modern day classic.  Very cleverly written, well animated, awesome narration and soundtrack.  Loved it Loved it LOVED IT!!!  So did my 3 year old boy, my 17 year old daughter, my 36 year old sister, and my wife!  P.S.  Stay for the credits for a secret surprise at the end....!"
    },
    {
      "rating": "10",
      "text": "Winnie the Pooh is a wonderful animated movie that brings back our memories for nostalgia times in hundred acre hood. This movie brings intention to older and younger viewers to enjoy the 2D animation that drawn perfectly that CG animated movies don't get too exciting as now. What I can only say it brings a lot of memories that it's nice and perfectly well done animated movie that they deserve."
    },
    {
      "rating": "9",
      "text": "Aside from the fact that Christopher Robin sounds like he just got learned to speak (Seriously, in the 1980s TV series, he seemed to be around 11; here he sounds 5) the movie is a wonderful treat. All those critic that say this film is perfect nostalgia are correct. The film is perfect length, accompanied by Oscar worthy short animated films. The traditional animation works well, I think I may have cried if it had been in the same CGI as Pixar and Dreamworks films. That just isn't the Pooh I remember. If Harry Potter's sold out, go see this movie!"
    },
    {
      "rating": "10",
      "text": "It was a very cute movie. My sister, brother-in-law and I took our kids to see this. It was a very cute movie and i loved the plot. I loved Winnie the Pooh as a child and this movie brought back all that wonderful Nostalgia."
    },
    {
      "rating": "10",
      "text": "Everything that you loved about your childhood is finally back on the silver screen. From beginning to end (and hey, even before the film with The Ballad of Loch Ness), a smile was on my face and I found myself bouncing in my chair from the sheer fun of seeing my beloved favorite childhood characters again after so long.The animation is stupendous. For the first time in too long, a film with a theatrical release has been animated on cells, and boy is it refreshing. Colors are crisp and animation is smooth and everything looks just as I remember it from The Blustery Day.The voice acting is terrific. Featuring all new voice talents and some big names such as Craig Ferguson as Owl and Tom Kenny as Rabbit, all the actors fit their roles perfectly and not once did any voice feel out of place.The music was just as good as it's always been; songs are one after another and will likely remain in your head for days to come. Zooey Deschanel did a terrific job covering the opening theme, and the musical sequences provide non-stop grins.In short, it's just great, and anyone who has ever loved Winnie the Pooh at any point in their life will feel right at home. This is the kind of movie that I'd really love to see more of, and after seeing it, I'm certain you'll agree too."
    },
    {
      "rating": "10",
      "text": "A sure classic, this short, but sweet WtP movie is a nostalgic, cute film that I suggest you take your kids to, to say, \"This is the cartoons I liked when I was a child.\" Hopefully, your children will love it as much as I did. This movie is also very calm; the soothing music accompanied by John Cleese's narration welcomed me back to Hundred-acre Wood. Also, the cast was wonderful, even including Cumming from the original cartoons. Al in all, go see this movie."
    },
    {
      "rating": "5",
      "text": "Well done for what it was, though to me it felt like I had seen it all before (many times in fact).  That said, my 6 year old enjoyed it....though not as much as I thought she might."
    },
    {
      "rating": "10",
      "text": "I'm 19 years old, and I was having a blast. I loved Winnie the pooh since I was young, and this movie woke up the sweet memories from my childhood. I laughed all the way, throughout the whole movie. It's a remarkable piece of 2D animation. The script is amazing and the soundtrack is flawless. Recommended."
    },
    {
      "rating": "5",
      "text": "This film is not suitable for all ages, mainly for small children. Here in Cinema is not suitable for this type of movie."
    },
    {
      "rating": "5",
      "text": "Fun and light little film.  I assume that the high scores are being given by people who haven't read too many of the books, or watched all the older films?  This movie pretty much copied the plot from at least 2 of the previous stories, so as a 'grown up', I was bored senseless.  I actually dozed off and I think my two girls found it to be entirely unmemorable..  But hey, to each his own!"
    },
    {
      "rating": "8",
      "text": "Es Winnie the Pooh, no hace falta decir más ni menos para saber que es un peso pesado de Disney."
    },
    {
      "rating": "7",
      "text": "Overall, I enjoyed"
    },
    {
      "rating": "10",
      "text": "I grew up with Winnie the Pooh, so seeing this brilliant reintroduction of the character is one that excited me and filled me with nostalgia. It's charming, funny, and perfectly suitable for all ages. The new voice actors are great and the gorgeous hand-drawn animation is superb. Overall quality wise this movie couldn't be much better. Same goes for content. I really can't think of one family that would not feel entertained by this. People like me who grew up with the bear will be enchanted and entranced. Overall I consider this to be a highly recommendable must watch for all families. That is why I give it a perfect score of 10/10."
    },
    {
      "rating": "9",
      "text": "This film is genius in nearly every aspect. This kind of animation is so beautiful and it brings me back to the old days when I would put my old Winnie the Pooh VHS tapes into the machine! Everything that made the Pooh films so special and unique is present here. However, they missed one key and hilarious character......Gopher! Regardless, I was thoroughly entertained with this film and it was such a pleasure to feel that cuddly warmth of my childhood drifting back into my life for an hour or so. Now I must go because \"I am rumbly in my tumbly!\""
    },
    {
      "rating": "8",
      "text": "This movie was great, classic winnie the pooh. I was laughing so hard throughout the whole movie and im 18! Perfect example of how anyone of any age can enjoy this movie. I have always loved winnie the pooh and this movie was funny, and very enjoyable. My only complaint was the measly 69 minute running time but other than that this movie was very good and heartwarming, 8/10"
    },
    {
      "rating": "10",
      "text": "What a thoroughly enjoyable movie!!! I don't know who enjoyed it more, my two daughters, 7 and 4, or me. It was sweet, funny creative, and a whole lotta fun. I have always enjoyed Winnie the Pooh, and am always a bit worried that the next movie is going to ruin the franchise. But this movie only strengthened the legacy, and I can't wait to own the DVD. I am a bit of a purist, so my ONLY complaint was some of the voice work. It just didn't sound original enough. Still, that is not nearly enough to keep me from rating this movie a very enthusiastic 10. Most enjoyable movie have seen in a couple of years."
    },
    {
      "rating": "8",
      "text": "I'll be honest. I was a bit disappointed. It played out more like an episode from the show rather than an actual movie. And it was only about an hour long. The show hasn't been on in more than a decade so I would have liked to have seen the characters fleshed out more. That being said, the movie does a wonderful job of keeping the spirit of the show. It's absolutely cheery and light-hearted. I'm sure kids would love it. I'm not sure if they got the original cast or not (aside from Rabbit who is clearly impersonated) but the voice actors do a great job with the characters. And I loved the animation. 2D hand-drawn beauty. It looks just like you remember. If you're a fan of the old show (or have kids to entertain) this movie is a great time."
    },
    {
      "rating": "10",
      "text": "This is very interesting!!!The pooh is very funny.\rSo, younger and also older can watch and feel fun!\rI thought I want to it recommend for next generation."
    },
    {
      "rating": "10",
      "text": "I went to see this movie and expected to see a terrible and boring 3D animation films, I brought my phillow and my MP3 to hear some music while I felt asleep, however, I found out that this movie is actually good, awesome, best film adaptation of old drawings, unlike Yogy of those things that sucked as hell."
    },
    {
      "rating": "10",
      "text": "I like Winnie the Pooh very much!\rMy favorite character is Piglet and Tigger.\rAnd, I never watched Pooh's movie before I watched this movie.\rEvery characters were very cute in the movie."
    },
    {
      "rating": "9",
      "text": "Winnie the Pooh is so amazing. I just love it so Jelly much .With all the CGI animated films all over the theater it was so wonderful to see the awesome classic cartoons . I think everyone with good heart will undoubtedly enjoy it .It was funny....so funny and The animation was sooooo  good and really really cute . Winnie the Pooh took me back to the old days which I miss so much .The songs were so catchy and the music's were so honey .Winnie the Pooh is an amazing work of Walt Disney and I would really like to see this Classic Series more .  A House-full of Honey For The One And Only Winnie The...wait for it .............Pooooooooh (love U). Tnx Disney , Stephen J. Anderson ,Don Hall , Peter Del Vecho,Stephen Anderson,Clio Chiang,Don Dougherty,Don Hall,Brian Kesinger,Nicole Mitchell,Jeremy Spears,Kendelle Hoyer & All the Cast and Singer ,Henry Jackman ,Lisa Linder,Julio Macat With of course \"The Man\"A.A. Milne."
    },
    {
      "rating": "8",
      "text": "A very nice story about friendship with the most adorable creatures ever. It was a good movie, interesting at some points, a bit boring at others, but I like it."
    },
    {
      "rating": "6",
      "text": "Pretty good Pooh film though some of the voices and humour is off. Animation is very good."
    },
    {
      "rating": "9",
      "text": "It is no secret that I am a huge fan of Winnie The Pooh. And if it was, it's not any more. So believe me when I say that the latest adaption is one of the very best. The newest installment in the beloved series of Winnie The Pooh films is about, both a search for Eeyore's tale, and a plot to trap a creature that has supposedly captured Christopher Robin. All the charm and fun of the rest of the Winnie The Pooh films are present here. Short songs and nostalgia help as well. The voice cast performs well, though some of the new voices may bother you at first. Jim Cummings plays Pooh and Tigger, and Bud Luckey (who you'll recognize as Chuckles from Toy Story 3, among other Pixar films) has been cast as the ever depressed Eeyore. The other cast members shine as well, once you get used to them that is. The animation is simple and beautiful, but during one musical number, where everything appears to be turning to honey, the animation grows much more detailed. CGI and motion capture are great, but nothing beats the traditional stuff. The music is wonderful as well, and the Winnie The Pooh theme song at the beginning revived many glorious memories. The characters may not be quite as you remembered them, though. Piglet is a bit more chipper. Owl shows a lot of emotion in his eyes. And Rabbit, while still acting superior to the rest, seems to have lost some of his crankiness. Also, Christopher Robin has changed his wardrobe and his eyes are no longer little specks. This, to me, was the change I liked the least, but I didn't mind. Too much. The film is also surprisingly funny. This is easily the most humorous of all the Winnie The Pooh adaptions, and it made me laugh much more than other so called \"comedies\" out there. My only real complaint about Winnie The Pooh is it's run time: An all too short 63 minutes. I know that kids don't have the longest attention span, but this trip down memory lane felt a little short. Winnie The Pooh is just as wonderful as ever, and I do hope this film is only the beginning of another league of movies from our friends at the Hundred Acre Wood."
    },
    {
      "rating": "8",
      "text": "This is one of the very few movies for kids that doesn't have crude humor in it. This movie is great for the whole family. It has a simply plot so it doesn't confuse the young ones. I also like the dialogue. \"No, the word is 'issue' not 'achoo'!\", was my favorite line. Watching this movie made me feel like a kid again. The whole movie is told as if a child is watching it. Owl mistaking the words back soon to be a monster is something I would have done as a child. The characters have to be Disney's best idea. The movie was a little short but it was hand drawn and it is for kids. The best part about this movie is the charm and it's child like feel. I recommend this to all children."
    },
    {
      "rating": "7",
      "text": "The plot is about Pooh trying to get some honey and all the adventures he has along the way with the rest of the cast. The movie starts like the old film with Christopher Robins room, all done in live action. The animation is a delight, it feels very much like an old Pooh cartoon. There sre some interesting things with it as well such as a scene where Pooh is in a Honey wonderland or my favorite sequence The Backson Song which is done all in chalk. And also how they interact with the words in the book.Voice, probably the biggest concern for fans. Well to eliminate that concern, the voices were spot on. They sounded like the characters we grew up with, occasionally though when Rabbit talked you could get hints of Rabbit.Another important part of the Pooh films are the songs. Zoey Deschanel does a good job singing the title song. It still gives me the feel of the older film when it played at the start of the film. Another great song is the Backson song, probably my favorite, it felt like the mob song from Beauty and the Beast, but with more subtle and innocent lyrics. It was a fun number and scene. The other songs are good too, like the Winning song. The best part of a Pooh film is the characters. The characters matter more than the plot. All the characters are back and as lovable as ever. There charm and innocence are still intact. Poohâ"
    },
    {
      "rating": "8",
      "text": "Disney Has Done It Again! Amazing!"
    },
    {
      "rating": "9",
      "text": "This film makes you to return at the time you were 5 years old,it has perfect animation ,good voice work and a script that touches the heart,this movie is a winner"
    },
    {
      "rating": "8",
      "text": "Short, sweet, yet heartwarming. While it doesn't have much depth, it's a delight to any child, and maybe any adult who appreciates old school animation."
    },
    {
      "rating": "10",
      "text": "The more I watch this, and I have 3 toddlers so I watch it A LOT, the more I love it. The characters are fantastically done.  The voices are perfect.  Zooey Deschanel was a perfect choice to do the songs. The writing for this was just brilliant.  It entertained me and my kids at the same time. I especially love the dialogues about the \"issue\" and the \"knot\".\r I hope they make more of these and all the same people are involved from the writers and directors to the actors and, of course, Zooey Deschanel!"
    },
    {
      "rating": "10",
      "text": "The most classical film i have ever seen in my whole life. After 25 years, disney animation bring back this film back to life and i was so curious what the movie look like. Thx so much disney!"
    },
    {
      "rating": "8",
      "text": "Hey, at least for this grand adventure for Winnie the Pooh, they actually done what's supposed to done to a Winnie the Pooh installment ever. It's imaginable and a classic being for you and your children if you have at least one."
    },
    {
      "rating": "9",
      "text": "A Perfect Dream.Winnie The PoohDisney has still got that magic sketch artistry. And yes, it is every bit of enchanting as it should be. From humor to drama, it hits every note perfectly. It covers up the physical sequences of the razzle dazzle that its younger audience craves for and explores themes that will make adults wiser and hooked. And they do it with a humble broad smile on their face and old children's morale tales to create an arc on the storytelling. This is one of those rare collaboration of a bohemian work that fulfills every fanboy fantasies that we could imagine. Primarily because the makers themselves grew up watching these characters and the world they reside in, which glorifies each tiny aspect of the film.The songs are delight to watch and catchy enough to make you hum along. It helps enormously for the writers to prove a point with repetition and expressive nature that these songs easily are. The visual effects, as always, is adorable, plus this time they have managed to blend in the real world and the imaginary one effortlessly with words floating around and each frame depicted as a page of the book. And this is not some new technique to lure the audience in, but a major factor of the narration itself.Among many daft conversations, there are few that would straight out stand alone, the hilarious final act, where the wordplay and the puns grows habitual to you and the dumbness and maturity both loud enough for you to be thoroughly entertained as these characters intertwine with slapstick humor. The voice over cast is undeniably soothing to be heard, from which of course Jim Cummings bubbles undeniably, in his low calm speech that melts you down to your childhood memories where Winnie The Pooh was never a fiction."
    },
    {
      "rating": "8",
      "text": "To be honest, this is an unexpected hidden gem among Disney's catalog. This is a movie noone seems to know about because of poor marketing, and it is a shame because this is a pretty good movie. A really simple and sweet story about Winnie the Pooh just wanting to get some honey to eat. It is not easy for him, however. I see how the overall moral is how we should always earn anything we desire, that sometimes you won't get it immediately after doing good actions and that shouldn't be a reason to give up. The animation looks really good, although the overall presentation look a little flat, almost like a TV movie. It's sad to see that this is currently the last 2D Disney film. It's a shame that Disney doesn't seem to care about 2D anymore. The only things I didn't really like and prevent this movie from getting a 9/10 or a 10/10 is that it's waaay too short. The movie is 1 hour and 3 minutes, but the credits last 10 minutes, so that's barely just over 50 minutes of animation. This is why I think that the movie feels like a TV movie, because of its flat visuals and short runtime. Also the songs are pretty forgettable. I don't see anyone putting any song of this movie in it's Top 10 Disney songs list or anything.Still, this is a great movie. A simple story that works wonders. Full of charm, good humor and heartwarm, that make the resolution of the movie really satisfying. This is one of the best animated Disney movies of the decade. Obviously not of all time, but of the decade, it is. I mean, at least it's better than Frozen, Big Hero 6, Zootopia and Ralph Breaks the Internet."
    },
    {
      "rating": "8",
      "text": "What's better than classic Winnie The Pooh and 2D hand-drawn graphic? Not many things if you ask me. \"Winnie The Pooh\" 2011 is a great movie and a good farewell to 2D animated movie. It's not as good as the original nor \"The Great Search For Christopher Robin\", but it is truly a charming movie"
    },
    {
      "rating": "9",
      "text": "Quintessentially charming with a tad of melancholy.This movie feels like autumn"
    },
    {
      "rating": "10",
      "text": "greatest movie on earth, thisisbecauseofthecharactermaximumthisisbecauseofthecharactermaximumthisisbecauseofthecharactermaximumthisisbecauseofthecharactermaximumthisisbecauseofthecharactermaximumthisisbecauseofthecharactermaximum"
    }
  ]
}