{
  "id": 3343,
  "title": "Wish Upon",
  "starring": [
    "Joey King",
    "Ryan Phillippe"
  ],
  "runtime": 90,
  "genre": [
    "Horror",
    "Thriller",
    "Fantasy"
  ],
  "description": "A teenage girl discovers a box with magical powers, but those powers comes with a deadly price.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/u0vnocj57vJt5DHoBEqUOD1G4SU.jpg",
  "categories": {
    "plot": 5.6923076923076925,
    "acting": 4.714285714285714,
    "ending": 7.166666666666667,
    "soundtrack": 8.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 8.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "It' a horrible horror movie, but it's the funniest film I've seen all year. If you like so bad it's funny movies like troll 2 or the room, you should watch this."
    },
    {
      "rating": "10",
      "text": "It was such a fun film to watch, although not scary it was tense and comedic in just the right places. It's the perfect mix between final destination and mean girls"
    },
    {
      "rating": "7",
      "text": "This is NOT a bad movie!  I went with a friend and we both enjoyed it.  It is definitely not a scary movie, but it does have a good story and it certainly kept our attention throughout.  Someone else said it is kind of like a \"Mean Girls\" movie and that is partially true.  It is definitely a teen movie.  All the main characters are in high school and it covers all the aspects of high school drama you can name.  But, the basic story is interesting and we enjoyed the actors.  Do not leave once the credits start rolling!  There is a little more to the story along with the credits.  Everyone else had left the theater and we were the only ones who were still there when this little tidbit came on.  Perhaps they are setting up for a Wish Upon 2."
    },
    {
      "rating": "8",
      "text": "********************************************************》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》》¡"
    },
    {
      "rating": "8",
      "text": "♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤¡♤》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》¡》》¡》¡》¡》¡"
    },
    {
      "rating": "8",
      "text": "Fun horror movie!This movie is what it promises to be. It's a great pick for horror movie night. It paces itself nicely, it dispenses karma, and it maintains an air of mystery and variation throughout.This being said, some of it is just like Final Destination, but with clumsiness, and is almost blooper funny when it shouldn't be.I'll probably watch this again on Halloween. It isn't a masterpiece, but it is really entertaining."
    },
    {
      "rating": "9",
      "text": "¿Can someone explain me why this movie is being so hated and comparing with others movies? I mean, this has nothing to see with \"Final Destination\", only the fact that are a few deaths (like in a million others movies).Anyways I think is a really good movie and I enjoyed watching it."
    },
    {
      "rating": "8",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●●■●■●■●■●■●■●■÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%$$$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "8",
      "text": "Wish Upon has deft scares & a storyline that is similar to Final Destination. However the movie is thrilling, surprising & enthralling, B+."
    },
    {
      "rating": "8",
      "text": "●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●¡●■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■¡■"
    },
    {
      "rating": "8",
      "text": "@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%@#$%+÷+÷@#$%@#$%@#$%%$$@#%$#%$#%$#%$#@%$#@%$#%$#@%$#@%$#@%$#@%$#@%$#@%$#@%$#"
    },
    {
      "rating": "8",
      "text": "*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:*:☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆°•☆"
    },
    {
      "rating": "8",
      "text": "Wish Upon is a deft horror thriller that mixes Cliver Barker, Final Destination, Goosebumps & Are you Afraid Of The Dark."
    },
    {
      "rating": "8",
      "text": "Now this is a horror movieRight from the start to cast, I enjoyed this movie quite a bit. You can really see a high school girl here and her mentality as she faces various dilemmas, and how her relationships with others progress. That side of vulnerability is so apparent, and that made this movie very enjoyable. Different concept, good jump scares, lovely music, and fantastic filming angles. I will definitely recommend this to everyone."
    },
    {
      "rating": "8",
      "text": "♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥₩¥¥"
    },
    {
      "rating": "7",
      "text": "Some scenes were a bit cringeworthy but the story as a whole was good and different from most horror movies. I would recommend it."
    },
    {
      "rating": "7",
      "text": "This was a fun film that I really enjoyed watching. Unlike so many movies I've seen of late this one has the all important ending actually included so I didn't feel like I'd wasted 90 minutes of my time. The simple story reminded me of old Twilight Zone episodes and I appreciated the makers avoiding the use unnecessary gore. Well worth a watch."
    },
    {
      "rating": "7",
      "text": "พอไปได้ดูรู้สึกว่า ก็โอเคดี สนุกดีพอรับได้สิ่งที่ชอบคือการแสดงของ Joey King มาก นางเล่นดีมากยิ่งองค์ท้ายของหนังนางจัดเต็มมาก ตัวหนังก็มีความลุ้นระทึกสไตล์ Final Destination (Movie) แต่...เสียดายหนังมันได้เรท PG-13 มันเลยไม่โหดสะใจ ไม่น่าจดจำเท่าไร ง่ายๆไม่สยองแต่ลุ้นดี ให้ผ่านๆอ๋อลืมบอก ผกก.คนเดียวกับ แอนนาเบล ภาคแรกที่แอดดูไม่จบเพราะน่าเบื่อมากกกกกกกกกก แต่เรื่องนี้เขาพัฒนาให้เล่ากระซับขี้น เพิ่มชีนลุ้นนิดๆ เพิ่งแค่ยังไม่สุดเท่านั้นเองถึงแม้คนอื่นจะบ่านว่าเป็นหนังโง่ๆ แต่...สำหรับผมกลับได้อะไรกลับมาจากหลังดูเยอะเลย"
    },
    {
      "rating": "2",
      "text": "Don't rely on anything Wish Upon sends to you. If you are completely expected to have nightmares on this poorly-made horror excuse of bait, then you definitely have problems alright. Don't expect the entire film to be this horrifying because, believe it or not, it's not actually horrifying in the first place."
    },
    {
      "rating": "2",
      "text": "On the trailer, they said that this was directed by the same one who did Annabelle.  I definitely was hesitant on this movie, because I wasn't impressed with Annabelle.  The characters aren't terrible, as in about half of the PG-13 rated horror movies, but the movie felt too much like watching Final Destination to me on the death scenes, only not as gory or graphic like those movies.  Definitely a watered-down, yet predictable, \"horror\" movie (more like a thriller than a horror movie)."
    },
    {
      "rating": "1",
      "text": "A second rate knock off of the Final Destination franchise. As someone who really doesn't like that franchise it tells you how awful Wish Upon is. Plus the characters in this film are all awful especially the lead character who's selfishness goes to a whole new level. Everyone should wish this film away from their television. F"
    },
    {
      "rating": "5",
      "text": "The most recent incarnation of the classic Djinni premise, though this one eschews that entirely in favor of a magic Chinese box with a backstory all its own not involving Djinn. I'm not sure why the locality and myth had to change or where this story even comes from - it's not nearly interesting enough to warrant changing up the formulaand it's not like anyone cares all that much anyway. Just get to the mangling of wishes already!Then again, as a result of the changing of the mythology, there are now 7(!) wishes to be granted - 4 more for your guilty watching pleasure. Except that this time, wishes aren't always twisted around. They're applied strongly but hardly in a completely backwards way. The twist is that someone dies every time a wish is granted. That's it. It takes a lot of the fun out of the classic granted wishes premise. The PG-13 rating neuters it (I watched it unrated but it still felt PG- 13). It's just alright with a solid, interesting cast led by the natural and unassuming Joey King, an unrecognizable Ryan Phillippe and Sherilyn Fenn just for ****"
    },
    {
      "rating": "5",
      "text": "If there's one thing this movie gets right it's the cast. Shannon Purser, Ki Hong Lee, Ryan Phillippe, Sydney Park and more. All very charismatic. Towering high of above each and every one of them though is the star of the show, Joey King. No longer the ridiculously talented little girl we once knew, she's grown into an incredibly gifted young actress. So much so that I wish there was a better movie around her.Wish Upon puts a gruesome spin on a typical high-school movie formula. The protagonist finds a means of making all her wildest fantasies come true. Popularity, her dream crush, a lavish lifestyle, and a cooler dad all become hers in the blink of an eye. Only rather than finding out all of these things she thought she wanted don't actually bring her happiness, she instead must deal with the fact that getting everything she's ever wanted is causing people to die.The deaths themselves are rather tepid. As if director John R. Leonetti was afraid to do anything really gruesome because he knew we don't actually want to see most of these people meet a violent end. The thing that's allowed gory horror series like Final Destination to succeed is that we don't really care about anyone onscreen. We may not necessarily dislike them, but there's a certain detachment that makes it easy to revel in their inevitable demise. When someone gets killed here it's just disappointing to see them go.I would have preferred this had it not been a horror movie, but instead a traditional teen flick. It would have been derivative as heck, but at least the better portion of this film would have been front and center. It's kind of fun to watch King awkwardly navigate high school with familiar tropes. She and the rest of the cast almost make this worth watching. Of course I may be a little biased. Ever since she scared the crap out of me in The Conjuring by telling me about the man behind the door I became something of a Joey King fan boy. I don't really think you can deny that the girl can act though. The movie may be mediocre, but she's just as fantastic as ever."
    },
    {
      "rating": "4",
      "text": "As a horror movie it was quite poor as there were actually nothing much of anything scary, even though I watched it not because of that, but because I thought the idea might be promising - a ''box'' that makes your wishes come true, but it has a blood price etc. But they mashed in things which are basically from movies for teens (I mean of course main characters are teens, but still, it is quite bland) and along with that comes so many stupid decisions that main character makes, just to have her wishes granted etc. It is not completely awful, it is still watchable, but only if you have nothing better to do."
    },
    {
      "rating": "4",
      "text": "You may wish you were watching a better movie, but honestly, if you're looking for a movie to laugh at, look no further than this PG-13 cousin of \"Final Destination\" and straight-faced distant relative of \"Drag Me to Hell\"."
    },
    {
      "rating": "3",
      "text": "Lacking any originality or purpose, Wish Upon is largely just a waste of time. The characters are stock, the direction flat, and the \"scares\" (if you can call them that) are incredibly weak. At least the actors are trying, which helps make the film somewhat watchable. However, a poorly written script is the most at fault here. The dialogue, most of which feels forced and out of place, doesn't make sense half the time, and the pacing is grueling. All in all, avoid Wish Upon - at all costs."
    },
    {
      "rating": "4",
      "text": "Highschool-Outsider Clare (Fargo-Tochter Joey King) bekommt von Papa Ryan Phillippe eine uralte chinesische Spieluhr geschenkt – die ihr prompt sieben Wünsche gewährt. Klar, dass der egoistische Teen sich statt dem Weltfrieden nur Boys, Money und Fame herbeiwispert. Die Quittung kommt schnell – denn pro Wunsch stirbt laut AGB eine Person aus Clares Umgebung auf unnatürliche Weise. Doof – aber für Final Destination– und The Ring-Fans im Idealfall eine lustige bis spannende Sache. Wish Upon jedoch hat ein ziemlich schlechtes Drehbuch – und der Film dahinter ist noch viel mieser: Der völlig vorhersehbare Plot ist vom Reißbrett und nahezu alle Figuren sind strunzdumm und nerven mit ständigem Smartphone-Gezücke. Viel schlimmer jedoch: Während die großen Vorbilder in puncto Ableben mit jedem Teil kreativer wurden, startet Wish Upon wieder bei Null – und bietet Genrefans lediglich unspektakuläre und dank 16er-Siegel auch noch unblutige Tode."
    },
    {
      "rating": "5",
      "text": "(Unrated Edition) Wish Upon has an interesting premise and a surprisingly fulfilling dramatic heft to it. Nevertheless, the film exihbits mere plot twists and execution style that you cannot help it but feel contradiction between its excruciating simplicity against its rather smart premise. Therefore, the end result is another PG-13 horror flick that will give its tween audience some appropriate scares, and that is it."
    },
    {
      "rating": "3",
      "text": "Interesting considering the times in which we live where people are no longer impressed by anything, we see movies like this that are announced as horror but now it turns out that we must neglect the scares because they're nonexistent and now we must focus on how stupid the characters are and the dumb way in which the plot advances.Pointless."
    },
    {
      "rating": "5",
      "text": "This wasn't really a horror movie, since they kept mixing teen drama into the mix which didn't feel right to me. And I hate how this movie ended. But it's not the worst movie in the world either..."
    },
    {
      "rating": "5",
      "text": "Girls get a cursed Chinese version of Aladdin's lamp that kills someone for every wish she makes and after a series of terrible wishes, she dies."
    },
    {
      "rating": "8",
      "text": "One of the more decent horror films of 2017This is probably going to be one of the best horror films of 2017 however that's not saying much. I know this year there's the infamous Leatherface returning for what looks like one of the worst in the Texas Chainsaw franchise and in October the Saw franchise will release Jigsaw which most know will be a gorefest with very little story like most of them are. So I can appreciate that this film did try to do an original story unfortunately it's not that original. This was basically the Wishmaster meets Final Destination with elements of The Craft and The Possession all rolled into one. However since they are all good films I think imitating them wasn't a bad thing. I won't bore you with a summary as I'm sure you know what the movie is about I'll just say I think Joey King is growing into a fine leading lady. It was an all-around decent cast and storyline however I do think it would have been more interesting if the demon had actually made an appearance. The death sequences were a little too predictable and I'm not sure how I feel about the ending. While I liked that the ending made sense and I understand why it turned out that way I'm just not sure it was the best finale to the film."
    },
    {
      "rating": "8",
      "text": "Wish Upon is an unsettling horror thriller about a girl who is given a music box. The box caused her mother's suicide that she is unaware of throughout the film. You have 7 wishes & after every wish the box has to kill someone. After all of your wishes are used the box finds a way to dispatch you as well. The movie is very eerie in a clever style and the actors are ace as well. Ryan, Elizabeth and Joey add to the quality of the movie, the movie feels original, fairy taleish and it is highly engrossing, B+."
    },
    {
      "rating": "8",
      "text": "In the vein of Drag me to HellI don't know why this has such low ratings on IMDb, I gave it an 8. I'm a real horror buff and have seen most so I don't rate movies lightly.Similar in concept to Drag me to Hell, I was riveted to the screen for the whole movie. Great story, great acting, and extremely entertaining. Not too much gore but many thrills to be found in this excellent tale. Do not miss!"
    },
    {
      "rating": "8",
      "text": "Wish Upon: Modern day monkeys pawWish Upon is a horror tale that tells the story of a mysterious Chinese music box that grants seven wishes, but at a price.Starring the adorable Joey King alongside Ryan Phillippe and Elisabeth Rohm it's an original piece, though clearly influenced by the classic tale of the monkeys paw. Thankfully I like that old tale so I was excited to see what new twists they brought to the table, and quite frankly I walked away happy though some influence came from Final Destination (2000) as well.It's a well constructed, suitably paced movie with a fantastic cast and more than a sprinkle of good ideas. I find Joey King very likeable, not only the fact that she's adorable but she's a competent actress with hopefully a great career ahead of her and it's about time Phillippe returned to form.If you like alternative horror that doesn't rely on a dude with a knife, ghosts, big scary monsters or demonic themes then this may well be for you. There were elements that left me scratching my head but nothing that wasn't forgivable.Well worth a watch for any fan of horror thrillers."
    },
    {
      "rating": "10",
      "text": "This summer's hit horror flickThis turned out to be the most enjoyable kind of horror movie - a clever story with some humor that links things together. It's not gory either and doesn't rely on cheap shock tactics.A poor tomboyish girl who isn't popular and picked upon by the high school **** gets a present of a Chinese wish box that her dad found in a dumpster. It turns out to grant wishes but there is a price to pay for each wish granted. It's fun when she initially gets her wishes like fixing the school **** and getting money and the guy she likes. There is a gleeful anticipation to see how things will play out even when you can guess what's coming.The likable cast is headed by Joey King - you can see her grow up in horror movies is the right kind of actress for this role - cute and likable. Ryan Phillippe plays her dumpster diving Dad. A notch above the Final Destination series. This should be this summer's hit horror flick."
    },
    {
      "rating": "8",
      "text": "An unpopular but clever girl is given a music box that has a chinese demon inside that grants wishes. The user is given 7 wishes, however with every wish the demon must claim a blood price by killing a random person in a grisly style. When the person is out of wishes they also die."
    },
    {
      "rating": "8",
      "text": "A teenage girl is given an antique music box that her Dad finds. She has 7 wishes of her choosing. The catch is whenever she uses a wish, someone has to die. A demon is inside the music box. The movie is similar to other horror thrillers, but it is refreshing, fun, surprising, visually impressive and diverse."
    }
  ]
}