{
  "id": 781,
  "title": "Wonder Woman",
  "starring": [
    "Gal Gadot",
    "Chris Pine"
  ],
  "runtime": 141,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "An Amazon princess comes to the world of Man in the grips of the First World War to confront the forces of evil and bring an end to human conflict.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/imekS7f1OuHyUP2LAiTEM0zBzUz.jpg",
  "categories": {
    "plot": 5.628571428571429,
    "acting": 4.405405405405405,
    "ending": 4.0476190476190474,
    "soundtrack": 8.0,
    "cinematography": 7.0,
    "familyFriendly": 3.5833333333333335,
    "funny": 3.0,
    "action": 4.428571428571429
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Incredible, breathtaking, flawless. This movie is a game changer. Not just for the DCEU, but for the super-hero movie genre as a whole. It's definitely a must see!"
    },
    {
      "rating": "9",
      "text": "Since Batman Begins, the superhero movie had no other epic origin, Wonder Woman (Gal Gadot) reminds us of Christopher Reeve's Superman with a great nobility, but that represented ideals as justice, freedom, But within a story Like the Christopher Nolan trilogy."
    },
    {
      "rating": "10",
      "text": "Wonder Woman is a successful movie. Gal Gadot in the Wonder Woman part is awesome, the story is interesting and the music is really beautiful. Go see it!"
    },
    {
      "rating": "8",
      "text": "It was better than I was expecting actually, I guess with the string of bad to meh movies in the DCAU my expectations were rock bottom, but wonder women ended up as a pleasant surprise."
    },
    {
      "rating": "6",
      "text": "IT's a solid movie, better than most other very boring \"me-too\" comic book movies we've been subjected too over the last several years. And Gadot is excellent. However, throughout the movie, I kept thinking of Agent Carter.  Thought she was more appealing as a \"super hero\", and had more personality and back story than Wonder Woman. I will say that the supporting cast on the island at he beginning, including Robin Wright, were excellent.  So good, solid movie, but absolutely not among the best movies of the year.  You'd be fooling yourself to think so."
    },
    {
      "rating": "3",
      "text": "This was the first super-hero movie since 2008's The Dark Knight, that I ever wanted to give a go and watch it on the big screen. The result: What I expected, I have to say beforehand that I wasn't expecting much really. The good side of the coin in this one are the outfits and probably the setting. It's great to see that they finally decided to make a female super-hero movie, but unfortunately it fell short not as a super-hero movie but just a movie. On the other hand, on the bad side there are several flops like the lack of charisma in the characters and also the goofiness and sometimes overacting of Gadot. In conclusion, I wouldn't recommend to spend your time and money on this one, you would probably be bored by the first half, or either overwhelmed by its abusive use of slow-mo effects!"
    },
    {
      "rating": "0",
      "text": "A few comments:- Most reviewers overlook the most obvious thing about the fight on the beach: there was nothing villainous about the Germans (who were just chasing a spy), so when the amazons ruthlessly attack them without provocation and slaughter them to the last man, it arguably sets a much darker tone than anything we've seen yet in the DCEU. Contra their self-rhetoric, the amazons seem to revel in warfare and killing and make sport of it (after all, their whole raison d'etre is to hunt down Ares and kill him); note that unlike Batman and Superman  (who fight with grim determination when the situation demands it) Diana actually smirks cheerfully as she slices terrified German infantrymen to mincemeat, even though they're just anonymous people fighting for their country. This was a very shrewd, very dark take on \"empowerment\" as an excuse for celebrating morally gruesome behavior.- Despite Gadot's indifferent performance (she apparently went to the same acting school as Daisy Ridley: \"Open your eyes wider! Scrunch your brow up! Good, now pout! pout!\"), the character of Diana likewise undermines well-worn superhero tropes. She is notable for her feminine passivity and receptivity; powerful she may be, but nothing she does is self-willed. She merely fulfills missions and directives handed down from Hippolyta and Steve, without knowing or caring about the larger picture (what middlebrow critics are calling \"innocence\" and \"moxie\" is really blithe naivete and ignorance). The one thing she does do impulsively is to leap up and gratuitously slaughter some Germans when the opportunity arises, but like I said, the amazons clearly love killing. Her lack of serious inner struggles or flaws to overcome throws her in sharp relief against the other superheroes on offer these days.- Other tropes are undermined. There is almost no cliche more overworked these days than the Hollywood-diverse squad of sidekicks, but the striking thing here is that they're portrayed with wicked wit as mostly-useless caricatures: the grumbling Indian helps by providing SMOKE SIGNALS, the Muslim poses as a bumbling servant, and the Scotsman just babbles and gets in the way. The fact that the writers slip this by without being called out on these problematic blackface performances shows the true subtlety of imagination that went into the script.- Similarly, Diana's mission ultimately fails. Yes, she kills Ares, but so what? It doesn't end the war, it doesn't prevent the next (far worse) war, it really doesn't do anything. This leads to the savagely cynical ending where Diana asserts that \"only love can save the world\" while retiring from heroine work to a life of obscurity (note how when she reappears in BvS no one has ever heard of her). Meanwhile Steve Trevor actually saves the day by destroying the poison gas (a threat Diana repeatedly made clear she didn't care about), making the ultimate heroic sacrifice to actually save lives and change the outcome of the war.- In Man of Steel Clark overcame humanity's mistrust of his alien nature by proving his willingness to abandon loyalty to Krypton and fully assimilate to American society; the movie ends on a hopeful note that he'll be able to use his power to guide humanity toward a brighter future. Wonder Woman ends with Diana more alone and alienated than ever, withdrawing from the world having failed to save anyone or change anything. Again, this is the kind of brilliant subversion that Suicide Squad was supposed to have.- Danny Huston looms hilariously over the movie as a caricature of a generic, scenery-chewing face of evil. I definitely think the filmmakes made some bold choices, but they are far from making \"warfare itself\" the villain as some have proposed; if anything they provide a postmodern critique of that approach by showing how trench warfare -- so horrifying to the men who fought it -- is basically a fun game (and chance to show off) to the indestructible Diana. Huston's deliberately underwhelming and absurd fight with Diana is a blackly comic take on the bloated 3rd act showdown these movies always feel obligated to provide (this is then FURTHER lampshaded by actually giving us a bloated 3rd act showdown, against a literal mustache-twirling Dark Apparition From Nowhere with less gravity than a Final Fantasy villain). - Lastly it was amusing how the Germans were so Nazified despite this being WW1. This itself comments on the absurdity of the whole concept of putting a superheroine (especially a cheesecake lingerie-model superheroine in a padded leather corset) in the middle of a horrific meat grinder historical event like WW1. The point is that the studio is saying \"WW1, WW2, Nazis or not Nazis, what's the difference? You think the proles in Dayton (and Beijing) will care? They're Krauts! They deserve to die!\". This is black humor at its finest, and makes a trenchant jab at the similar dehumanization of the Other seen in movies like Saving Private Ryan."
    },
    {
      "rating": "0",
      "text": "La mejor película del DCEU(que no es decir mucho) y mucho mejor que varias del MCU. Wonder Woman tiene una personalidad muy definida y tiene una química muy buena con steve trevor que le da a la película un aire de romantico comedico. Ademas de que a diferencia de muchas películas del genero de superheroes, esta pelicula transmite un mensaje real sobre la guerra y la maldad en la humanidad(al menos hasta al final de la pelicula.Pero esos son sus mayores meritos, pues realmente esta muy sobre valorada. No es un 8 o un 9 ni bromeando apenas es un 7.Tiene un CGI horrible y un uso EXAGERADO de cámara lenta en la acción que le quita parte de su emoción.Ademas de muchos momentos forzados y con un final muy cliché que rompe con el mensaje de la guerra tan bueno que llevaba manejando realmente bien.Ademas de que abusa de la exposición.Tiene un humor (que aunque aveces funciona y pega) en varios momentos se siente algo forzado como si hubieran hecho chistecitos de marvel.  Le pondría un 7, pero el score actual es mas alto de lo que se merece.Decir que esta peli esta al nivel de Dark knight, es como decir Wonder woman tiene todos sus puntos buenos, y eso ni de broma."
    },
    {
      "rating": "4",
      "text": "This movie can't possibly be rated higher than a 6 and I need to give this a 4.  It doesn't bring anything new and fresh to the table other than a female protagonist.  With recent movies such as Logan and Deadpool it becomes painful watching just another feel-good super hero tale.  The jokes felt forced and more cringe worthy than anything. Yeah she's an amazon but let her get beat up a bit.  Look at games like the new Tomb Raiders to see how a female protagonist should really be done. Gritty and unforgiving, Laura from the movie Logan had more depth than this piece of crap."
    },
    {
      "rating": "9",
      "text": "This movie really impressed me. Despite a runtime of 2 hours and 15 minutes I was completely immersed throughout. It has excellent storytelling, pacing and features a great performance by Gal Gadot. Highly recommended for anyone interested in an excellent action/superhero movie."
    },
    {
      "rating": "3",
      "text": "I wanted to like this so much that I believed the hype.  But apart from Gal Gadot's charismatic performance, the rest of this film is rather ridiculous.  The main villain particularly is a huge failure.  Wish I could say otherwise.  I'm officially done with this generation of DC movies."
    },
    {
      "rating": "1",
      "text": "Painfully bad entry into a painfully bad DC universe. Origin story of Diana ,who doesn't know who she really is,raised by Amazons who have no clue what's outside their little invisible island area.The first hour and a half are incredibly tedious as Diana is at first shielded from harm by her mother not letting her be trained but then ends up being trained to be the 'best there is' .She then saves Steve and goes off into the war with a rag tag group of character actors to find and slay Aries the god of war and end the second world war.The direction is pretty bad in this film as there are lots of inconsistencies in Diana's character.At first she's never seen a man before but a day later she's talking about having read sex manuals.At first she is a confused girl who doesn't fight when the Germans attack Themiscura and a day later she's a cross between Captain America and the Incredible Hulk.They do the 'fish out of water' thing for awhile when she first hits western society which is awkward  and more awkwardness when they mingle sexual tension in as they go along with Steve.It is done very clumsily and rivals Amadala's romance with Anikin Skywalker in Star Wars for cringeworthiness. She has a shield and 'the sword that is the only thing that can kill Aries' but thinks nothing of just handing them to a frumpy government secretary to wander off with.Some warrior.Occasionally during this they go off and we see a bad general and his evil scientist henchwoman who have developed poison gas to kill everyone .Oh and they had to bring the plight of the North American native into it as well which was kind of out of place to say the least.I don't think i'll be watching any more DC films unless they can get Joss Whedon to direct.Gadot still isn't a very good actor to play WW in my opinion as she isn't strong looking enough and hasn't got the acting gravitas to pull it off.When they put her in a suit and hat to disguise she just shrinks out of sight and she and steve do a bit of an I Love Lucy type skit thing in a room with the allied generals.The action isn't all that great either .See this film at your own peril. Dunno how it gets so many good reviews. I couldn't wait to get out of the theatre personally."
    },
    {
      "rating": "3",
      "text": "A super hero origin story we have all seen before which at the end seems pointless since all the characters and relationships built up during the film are all killed off by the end."
    },
    {
      "rating": "0",
      "text": "Rampant misandry aside, the film is at least endurable. However it loses all credibility as it becomes clear that in the wake of \"bad\" DC films like suicide squad and BVS that executives forced this to effectively dance around in the skin of Disney super hero films. Brings the same ridiculousness, rejection of any sort of depth and selling out its own brand originality alienating a large portion of its own gen X fanbase with abundant Anti-grimdark so as to pander to millenials.Only bright spot was Gadot's performance was better than expected despite that she creates a visual disconnect that makes her \"off\" as Diana of Themyscira as she has neither the right physique nor facial structure for Wonder Woman. Close, but uncanny valley level of \"off\". Not quite expressive or emotive enough in scenes where it is appropriate. Honestly it is hard to determine if the problem is her performance is just not quite up to it, Or if it is that she is hamstrung by hokey, cliched writing and/or pandering direction.Had WB execs not been clearly pulling puppet strings trying to make this into a Disney/marvel production, and clearly doing extensive greasing critic palms to ensure glowing pre release reviews trying to trick the public into an inaccurate perception, then the film would have been a 4 or a 5. However all that is really here is a mediocre film trying to pander to so many demographics such as millenials and feminists that it does not grasp exactly who it is offending and just hopes to snag those demos support to carry into being received far better than it actually is.When you whittle away the marketing all you are left with is downright boring. Which is the greatest sin any film can ever make because it is defeating its only purpose. Anyone telling you that this film is anything otherwise is lying to either you or themselves and doing so out of being oblivious to social engineering. It is what it is.0/10 for making a Disney superhero flick with DC properties and trying to pay their way out of anyone noticing before release. Otherwise 4/10"
    },
    {
      "rating": "0",
      "text": "Bunch of problems with this train wreck:- It's dumb and exploitative on multiple levels to make a movie about a scantily clad sword-wielding woman helping to win World War 1- We get it, the Amazons are all huge feminists dripping with contempt and disdain for men and Western civilization generally, what a fun and engaging concept for a movie- \"Doctor Poison\"? Really?- Could they not even get an American actress to play an American icon like Wonder Woman? The Israeli accent was a constant distraction- Gal Gadot is cute, but as BvS proved she's not much of an actress. This is a woman who until just recently was best known for a throwaway eye candy role in Fast & Furious movies.- The action scenes (super strong woman with shield fighting old timey soldiers) were very derivative of the original Captain America movie. With the superhero market so overstuffed these days it'd be nice to have some original visuals and action, but no dice.- Chris Pine is totally unconvincing as a ladies' man. He's a decent actor but it's pretty clear (as it was in Star Trek) that he doesn't actually swing that way in reality."
    },
    {
      "rating": "0",
      "text": "I'll be nice and say it wasn't as bad as Suicide Squad, but that's the best possible spin I can put on it. Gal Gadot is stiff and awkward (not helped at all by the lifeless script), her waifish build makes the action scenes look comical (like if Captain America was a 100lb debutante), the villain is completely generic and forgettable, and the constant little \"women rule, men drool\" digs get really obnoxious and come across as insecurity on the part of the director.I loved Snyder's earlier DC movies, but after this my interest in Justice League is just about at rock bottom."
    },
    {
      "rating": "0",
      "text": "Unfortunately for me I decided NOT to watch the trailer in case there are spoilers and I had huge expectations from this movie. So when I saw it, I was so disappointed with this massive pile of bull fudge they call movie... Absolutely terrible. The story line was good but the way actors played their roles su*ked biiig time. Can I have my money back please?"
    },
    {
      "rating": "7",
      "text": "There are two actresses that play major roles in this movie - one of them wears the same mask for the whole duration, the other one in Dr Poison. This movie could be so much more, if not for Gal Gadot's acting range of a cactus."
    },
    {
      "rating": "8",
      "text": "The Amazonian princess Diana's quest-come-self-discovery!From all the superhero films, this was one of the most anticipated. Mainly because of the woman oriented theme. People were desperate to see the solo woman superhero. Today, we have the great visual effects technology, that anything can be possible to bring on to the screen. And actress like Gal Gadot, even better it gets. Yes, it was a wonderful film. A simple storyline, but a well made film.The Amazonians who are cut off from the rest of the world, is preparing for the battle if Ares returns. All these years nothing has happened, but one day a fighter pilot crash on the cost of their island. Then the princess embark a journey back with him to find, and end the Ares threat forever. But she only ends up in the WWII, and what happens in the following sequence are the rest of the film.Who would have done a better job than Patty Jenkins. She nailed it, and so set to direct the sequel too. Even the supporting cast was good. DC's visuals always high standards and so this one. Action sequences too amazing. There's lots of changes in the character, as well as in everything. Firstly a nice superhero costume. And connections like Diana's father, the island, all pretty nicely written out. The DC universe just got extended. I can't wait to see 'Justice League'.8/10"
    },
    {
      "rating": "8",
      "text": "This is the best DCEU film to date. It really focuses a lot on the plot, which is lacking in many other DCEU films. It also features plenty of action. I really hope this film can save the DCEU."
    },
    {
      "rating": "8",
      "text": "The highest grossing World War 1 film of all time (Yes, I was shocked when I saw the numbers as well.)  Wonder Woman is not just a good comic book movie; it is a great fish out of water origin story.    Gal Godot seems to really be coming into her own in this film and was complimented by one of the best supporting casts I’ve seen for a DC film not named the Dark Knight. A  few honorable mentions to the supporting cast, Chris Pine, Robin Wright, Ewen Bremner, Said Taghmaoui and Elena Anaya were all fantastic. My only gripe with the film is that one of the villains in the film felt like they were miscast for the role.    The film had heart, it was funny and the action scenes were great, exactly what the DC film universe needed to get its fans interested in upcoming movies."
    },
    {
      "rating": "8",
      "text": "I'm giving an 8 for entertainment value as opposed to quality. The technical quality is excellent as you expect but are there a few obvious flaws.The main one being Gil Gadot, She's no Shakespearean actress and for the first bit of the movie is seriously wooden. The plot and dialogue is very one dimensional at the beginning also, school play standard to be honest....but the whole thing really grows on you as it progresses and is extremely entertaining in and of itself. Its an origin story and a morality tale ,  one with holes, but it’s fantasy after all so I wouldn't be too concerned about that. Chris Pine is the best I've seen him, He really is a good actor when given the opportunity.."
    },
    {
      "rating": "6",
      "text": "The beginning was awful on the one side: Feminism, woman are strong, blabla. I was thinking, oh look woman can build up something, there are no intrigues, no drama, everyone is working, haha. Yes, yes. If it was reality, we men would be very thankful and had less problems. There were also many more logical problems in this movie, that made it difficult to get into it. But, I enjoyed the mystic stories in the movie: Like the classic stories, they describes our feelings with legends and gods. So there was hope for the movie, but it was clear, this movie cant be great. Later on I discovered another beautiful element, the critics on our civilization full of lies, hatred, selfishness, loss of empathy to each other, hide our lovely feelings was hard for me, because it touches a truth, that my psyche remembers me every day: It wants to leave this artificial world and return to the natural life, I have already had in my life. Some parts of the movie gave me another motivation to sell everything and move to another country, where people have time to each other, both sexes are loving each other instead of fighting. Gal, the actress of WW is just beautiful, but she failed in the action parts of the movie. In addition the CGI effects were only average. The background music very clichéd."
    },
    {
      "rating": "10",
      "text": "An outstanding movie featuring an amazing Gal Gadot as Wonder Woman. Probably the best motion picture starring a female superhero. Some great and powerful made moments, situations and action scenes, with a lovely and perfect Wonder Woman who stands tall as a true iconic legend. The movie have a lot to be analyze and it's wonderful in every sense. If you're fan of the original movie starring Lynda Carter, you will add Gal Gadot to your list. Also amazing background story with a perfect Robin Wright as a legendary Warrior and teacher for Wonder Woman. Honestly, possible the best DC movie so far alongside Man of Steel."
    },
    {
      "rating": "9",
      "text": "I really loved this movie. I was skeptical about Gal Gadot as Wonder Woman, I grew up with Lynda Carter. I changed my mind after seeing this movie: Gadot is amazing. The whole movie it's very well written, Jenkins is a good director, good music."
    },
    {
      "rating": "4",
      "text": "I biggest complaint about this move is Gal Gadot, I wish they picked Native American actress, with a darker skin, she is also not particularly good actress, if you are true Wonder Women fand will now she wasn't the one. Also, the beach scene is sh*ty."
    },
    {
      "rating": "6",
      "text": "I wouldn't say it was a bad film in any capacity, but like most of the reviews I've been reading: it was nothing special to me.  The big moments of the film seemed telegraphed from the beginning for me.  The slow-mo was used so much that expected at one point during a fight scene Gal Gadot winking at the camera because of how \"cool\" she looked.  I enjoyed the actors, and I enjoyed the plot, but for me I feel like the other DCU films sullied this one.  Had she been given her own stand alone film BEFORE BvS, I think I'd have felt different.  Since her film was already linked to that trainwreck though, I feel like it's \"too little, too late\" for the DCU films.  I'd say Suicide Squad was actually slightly better (only slightly) than this and that's because it was simply a more \"fun\" film.  Should you see it?  YES.  Would I pay to see it a second time/purchase it?  Not personally."
    },
    {
      "rating": "6",
      "text": "Wonder Woman is a bit overrated. Not to say that the movie is bad, far from it. It is indeed a massive improvement over the lackluster Batman vs Superman and the disaster that was Suicide Squad. However, there was just something missing in Wonder Woman that left me feeling a little disappointed. Which is a shame, because this movie had a great foundation. Wonder Woman in World War I, trying to end the war to end all wars. And overall, I did like the characters, I like Diana's and Steve's relationship, I liked the perspective Diana had about the human world. How she had to learn and grow, as anyone would have to.Unfortunately, after a very long two hours, the climax came, and everything the film did right was undone. In a final battle, filled with mediocre CGI, an overly silly villain, and lame action. It didn't help that Gal Gadot's lack of acting experience was massively exposed, especially when paired with seasoned actors like Robin Wright.Believe me, the movie is good. DC is not dead yet. But the film is not the game changer that the reviews will say.Still, I enjoyed it, and I think you will too."
    },
    {
      "rating": "4",
      "text": "Wonder Woman the movie was slow paced, it's characters generic, it's action terrible, it's story forgettable. The villain had no gravitas or interest. I will forget this movie with time."
    },
    {
      "rating": "4",
      "text": "While it surpasses the catastrophe that is Suicide Squad, Wonder Woman's ability to highlight the nonsensicalities and injustices of war cannot assuage the implausibility of the plot, nor its technical shortcomings. Gadot delivers a decent, yet inconsistent performance, whose supporting cast offer little more than partly successful comic relief. The pacing is a bit disjointed and unfortunately, fight scenes do not retain the impressive choreography featured in BvS, opting to depend rather on CG animations, which do not hold up to 2017 standards. Alas, DCEU has yet to produce a film capable of salvaging its shoddy introduction."
    },
    {
      "rating": "7",
      "text": "While the third act suffers from the same messy special effects extravaganza that plagues other DCEU enterprises, the film that preludes it is a mostly successful endeavour. Gal Gadot is mesmerising as the titular heroine; bringing a sense of innocence, curiosity, and badassery to her character. The World War 1 setting is meticulously used as well."
    },
    {
      "rating": "6",
      "text": "Just another superhero movie. And by that I mean that it has a central hook to differentiate itself from other superhero movies (this is basically Thor meets Captain America meets a woman) but is letdown by an especially convoluted and nonsensical neverending ending - not only did it not make sense on a visual level but neither did it on a plot level with some of the \"twists\" and actions undertaken.Some of the bright spots include the casting, the first half for the most part, the rapport between Diana and Steve, and some of the action choreography when it's close quarters.Diana's naivete felt kind of out of place or overdone - sure she doesn't understand certain things about the outside world but she acts like a childish moron sometimes (like Thor without the undercurrent of angst and the general sense that he's that way all the time). Not to mention her \"resolve\" at the end is a bit unfounded considering she was right about Ares. Not only did that reveal make the Amazon women look like idiots but it also justified her belief in people and in a sense let them off the hook from being selfish and evil in their own way. She got to learn a lesson but not too hard of one and she was right anyway so oh well."
    },
    {
      "rating": "7",
      "text": "Even though i disliked Wonder Woman in Batman v Superman i had no expectations for this one. I liked it. I I think it was great but i didn't like the crossover with the world war. I think superhero movies should avoid using such serious real events and instead stick to their fictional universe"
    },
    {
      "rating": "6",
      "text": "Gal Gadot shines as Wonder Woman in what is an average film. The film's strengths lie in its humour, particularly in the back and forth banter between Gal Gadot and Chris Pines' characters during the first act. The film loses itself however in its over the top action sequences, heavy use of slow-motion effects and overwhelming amount of flashback sequences."
    },
    {
      "rating": "10",
      "text": "A lot of people may disagree but this movie was a 10 for me.  I absolutely loved it and Gal Gadot did a stellar job portraying Wonder Woman.  The cinematography was great.  I'm excited for the next Wonder Woman movie."
    },
    {
      "rating": "4",
      "text": "Not sure why people loved this movie, the story was dull and long, the old germans are evil we are good got boring in the last century at least do it well like Wolfenstein series.I have to admit action scenes were good but at the same time find the way amazons fight over the top and probably not good for battle, the way germans invaded the beach was plain stupid.There were also others physics related problems everytime Diana used her super strenght that kept me out of the movie.But the worst problem of the movie, at least in my opinion, is the fact that Chris Pine's character was more a hero than Wonder Woman.Extra points because it wasn't as bad as Suicide Squad."
    },
    {
      "rating": "6",
      "text": "Mediocre movie, grossly overrated because feminism is cool atm. Same old cliches other superhero movies with male leads face: deus ex machina ending in which the hero faces a vastly superior foe but with the power of love/friendship finds in himself/herself so much strength to overcome; weakly developed villain that does villainous things, but stupidly implemented just because the plot; merry squad because somehow always there's a great group of people out there ready to sacrifice for ideals; slowmow fest; forced humor etcThe film's not bad otherwise. It's the best DC movie to date and has a great cinematography and decent acting and SFX. Also, I love how it focuses on small mundane moments to make the characters more as normal humans."
    },
    {
      "rating": "8",
      "text": "I really enjoyed this movie.  Gal Gadot was excellent as the title character.  She was able to be a badass and also be the naive fish out of water.  Sure, the script took liberties with the Wonder Woman back story and was much more reliant on Greek mythology than either the comics or the 1970s Linda Carter TV show (with Debra Winger as little sister Drucilla).  It also changed the present day from WW2 to WW1.  The latter choice was probably due to the first Captain America being set in WW2.  The \"Great War\" setting plays though.  It was cool to see the staging of the WW photo seen in the truly bad Batman v. Superman.  This is by far the best of the DC movies (I don't count the Dark Knight movies as DC movies).  DC has been better at animated films.  This is entertaining and fun and ultimately a great summer movie."
    },
    {
      "rating": "6",
      "text": "While I won't deny that Wonder Woman is a fun and enjoyable move to see, I can't bring myself to give this movie more then an \"Eh\" review. The choreography is impressive, the musical composition isn't garbage, the acting is up to standards but the movie itself is nothing but tired cliches and lazy writing. I understand why the movie is getting good reviews, and that's because I believe the director and writers played it safe. There's nothing spectacular about this movie, nothing interesting or ground breaking, it's just alright. Gal Gadot did a great job, don't get me wrong, but by the end, there was nothing I could talk about to my friends about how amazing it is, no scene that stood out, no actor/actress that deserved more recognition than the rest. So, is Wonder Woman a good movie? Yes, I'd say it's an enjoyable movie to see. Is it a diamond of cinema achievement? I'd say no. It's a story that comes a dime a dozen, and therefore not worth much more than a nice night out with your friends or family."
    },
    {
      "rating": "6",
      "text": "For those not familiar with DC universe this is a good overall story with good twists and turns. Worth watching once but some slow parts, unnecessary scenes and plain dialog. 13 year olds will probably love it.The lead in part was good to give some backstory but a little too long (could have saved 3-4 minutes here). For example, the whole we can't tell her who she really is was overdone. Say it once and be done. The little girl chase scene could have been reduced. The plane crash and saving of him was too long. The beach attack kept pace well -- the slo-mo probably not needed. The bathing scene as I would call it was too long and not needed (but for some, maybe they will enjoy it).Pine does a good job.I thought the special effects were very good.the actors -- some were better than others-- some of the lines may be to blame and at times her attempt to find a balance between super smart Amazon intellect and communicating with normal people left something to be desired. I wasn't sure how to interpret this- WW is brilliant and this is highlighted in the movie, but her communication with \"people\" was just off. I couldn't tell if this was intentional or not but noticeably uncomfortable for me to listen to during the movie.  I liked the ending, and the final battle was not too long (by much anyways). Certainly, this is the best recent DC movie - Would I watch it again at the theater -- no. Worth watching, most certainly."
    },
    {
      "rating": "8",
      "text": "The besy superhero movie I've seen in quite a while. Gil Gadot is perfectly cast as the amazonian heroine. The battle scenes are excellent and there's a great supporting cast. However the CGI is too over the top in parts and the boss battle at the end is quite cheesy. On a side note, I think it's quite shameful how they appropriated General Ludendorff as a psychotic villain, when you consider that he is one of the finest field commanders of the last century. You can imagine the furore if a German film was released where George Washington or General Patton were portrayed as second tier evil henchmen."
    },
    {
      "rating": "9",
      "text": "Best DC movie since Dark Knight trilogy. Story is surrounding and it holds the watcher. Comic relief are very well fitted. WW's sense of justice causes empaty in public. One of the best of past year"
    },
    {
      "rating": "8",
      "text": "Gal Gadot interpreta a la Mujer Maravilla de forma bestial. Me gustó, pero me preocupa que la inflen demasiado. El villano es caca."
    },
    {
      "rating": "10",
      "text": "\"Wonder Woman\" is certainly one of the best (if not THE BEST) superhero adventure recently released by the cinema industry. The film is a comic book on the big screen, with a very well written screenplay and a very attractive and full of action story. The cast is fantastic and Gal Gadot and Chris Pine show a wonderful chemistry with their never boring romance. The beauty of the charming Gal Gadot is exotic and sexy she really \"steals the show\" with her perfect performance. The top-notch special effects is state-of-art and impressive. The direction of Patty Jenkins surprises since this is her first blockbuster work."
    },
    {
      "rating": "8",
      "text": "It's a very amazing movie. Gorgeous visuals and CGI, beautifully filtered. Also great actors brought on board, could not imagine a better cast for the characters. But character development through out the movie is just not as deep, and impacting as expected. In addition we really don't get to much inside on Diana's and Steve's relationship, and why Diana is so attached to him even in the 21'st century. Anyway with all this there where a few plot holes that really raised a lot of questions and a few red flags. But overall it's a very good movie, although sometimes it's a chore to watch."
    },
    {
      "rating": "7",
      "text": "DC's last hope(it might be changed in 100 years). Wonder Woman was the best solo super heroin film I've ever seen. I could see why Gal Gadot is the best casting for Wonder Woman. Only part I hated was she only has power. In marvel universe, they know how to grow but not in just power. Captain learned that by throwing his shield away, Iron Man learned it by exploding his machines. Thor learned it by losing his hammer and eye, Star-Lord gave up his identity as a celestial to save his friends. Wonder Woman just gained more power. I think I should all this francise DC power Universe. I liked the movie, because it was like the last breath of DC and the reason that we could still have hope for Justice League(it failed)."
    },
    {
      "rating": "8",
      "text": "when i saw the trailers of this movie i did not think i was going to like it, i was wrong, this movie is realy good, Amazing story, gal gadot and chris pine did a great job and the action sequences are awesome. my only 2 problems were the villain at the end, i did not realy like that, it felt out of place, and at times the pacing was a little bit slow"
    },
    {
      "rating": "8",
      "text": "Gal Gadot & Chris Pine did a fantastic job in this movie and had fabulous chemistry. The story was fun and engaging. My only complaints: The final conflict in the 3rd act was a little disappointing and I wish Gal Gadot had taken on a Greek accent for the role."
    },
    {
      "rating": "6",
      "text": "Honestly, I didn't enjoy this movie as other people did. I agree Gal Gadot is great as Wonder Woman. Also, the themes are pretty good and the writing is decent. The Wonder Woman theme from Batman v Superman which is used in this movie is very good. But, the action is very forgettable, the villains scuked. And the movie is not very rewatchable."
    },
    {
      "rating": "8",
      "text": "The Short Verdict: It is good, not great.>Related Media: The character (Diana / Wonder Woman) had a cameo in Batman Vs Superman (BVS) recently and before that, in numerous comic books, cartoons and live action TV shows. I know a bit of her backstory.>What’s it like? This is the origin story of Diana growing up on the hidden island of Themyscira, her training, and her entry into our world to help mankind.  >Pros:>1. For a character that has not been covered in detail in a feature-length film, this endeavour is fresh, interesting and has a couple of surprises.>2. The casting of Gal Gadot was perfect. She comes off as beautiful, genuine and caring, the characteristics you would expect of a wonder woman, regardless of whether you had known what Wonder Woman should be like. It's instant recognition, done very well.>3. Many of the action scenes were very well done and the use of slow-motion was executed well. When the same thing was tried on BVS, it looked fake.>Cons:>1. Some of the action scenes looked implausible. I know this is a fantasy film, but my view is that physical laws can be stretched but they should not be broken. That the film chose to break some of them unnecessarily made me feel that the film could have been done better.>2. The film slows down at some points and gets awkward at others. Some details that do not make sense have also been left unexplained or explained poorly. Examples of this include how she was able to speak over 100 languages. Furthermore, she should be keeping the existence of Themyscira secret, but there were several people openly talking about the island and no attempt was made to stop this.>3. There was one instance Diana sent an email to a certain famous person by simply typing the person's name in the To field. This would not work in reality! That name would need to have been underlined to indicate that her email software knows the real email address and has auto-inserted the email address there. >4. Gal Gadot has an accent, and it seems that the director had made all the caucasian characters on Themyscira speak with the same accent, so as to explain Gal Gadot's accent as that of the people of Themyscira. It comes off as a little irritating.>How would the different age groups rate it?Children: ExcellentTeenagers: ExcellentYoung adults: GoodMedium age adults: GoodOld adults: Good>4/5 (No half scores) - Good enough to watch it in the cinema."
    }
  ],
  "recommendations": [
    "x_men_apocalypse",
    "ant_man_and_the_wasp_quantumania",
    "thor",
    "captain_marvel",
    "savages",
    "taken",
    "chaos_walking",
    "no_country_for_old_men",
    "pompeii",
    "bumblebee",
    "elektra",
    "elysium",
    "troy",
    "x_men_days_of_future_past",
    "the_magnificent_seven",
    "captain_america_civil_war",
    "black_widow",
    "man_of_steel",
    "creed_ii",
    "fantastic_beasts_the_secrets_of_dumbledore",
    "the_kid_who_would_be_king",
    "mortal_engines",
    "x_men_origins_wolverine",
    "hellboy_ii_the_golden_army",
    "what_happened_to_monday"
  ]
}