{
  "id": 3890,
  "title": "Wonder Park",
  "starring": [
    "Jennifer Garner",
    "Matthew Broderick"
  ],
  "runtime": 86,
  "genre": [
    "Comedy",
    "Animation",
    "Adventure",
    "Family",
    "Fantasy"
  ],
  "description": "A young girl named June with a big imagination makes an incredible discovery -- the amusement park of her dreams has come to life. Filled with the world's wildest rides operated by fun-loving animals, the excitement never ends. But when trouble hits, June and her misfit team of furry friends begin an unforgettable journey to save the park.",
  "releaseYear": "2019",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8KomINZhIuJeB4oB7k7tkq8tmE.jpg",
  "categories": {
    "plot": 4.7272727272727275,
    "acting": 3.727272727272727,
    "ending": 5.0,
    "soundtrack": 1.0,
    "cinematography": 5.0,
    "familyFriendly": 3.3333333333333335,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Bleah! This movie sucks so much, I simply think it's one of the worst animated films I've ever seen, idiotic and meaningless plot and characters, don't waste money on this bad movie."
    },
    {
      "rating": "2",
      "text": "'Wonder Park' is too hyperactive, even for the boundless energy of its target audience, and so frenetically animated that viewers are more likely to leave with a headache than a smile."
    },
    {
      "rating": "0",
      "text": "Excuse me, but why was this animated movie made in the first place? All I have to say is that it left my head aching and brain cells deteriorating."
    },
    {
      "rating": "9",
      "text": "I thoroughly enjoyed this film. I believe it has a great message about the darkness in our lives. A fun, complex (for a kids film at least) main character in June. Lots of great voice acting by people like John Oliver. Kids will love the colorfulness while the angst ridden teens can love the story about dealing with tough dark times in life."
    },
    {
      "rating": "10",
      "text": "I find this movie to be really great. I don't care what people say, it's a really good animated film. It's got great animation, it has some heart it's about a theme park in the woods, what's not to like? I totally recommend it. I give it 3 Hairy Thumbs Up."
    },
    {
      "rating": "3",
      "text": "Awesome animation, but the downer scene about the mom kills this movie lighthearted tone. I can see the Youtube cartoon critics call it the worst under their New Year reviews."
    },
    {
      "rating": "7",
      "text": "Wonder Park is a pleasing and meaningful animated film, that in some spots, does get confusing but overall is a charming family film which provides enjoyment throughout."
    },
    {
      "rating": "3",
      "text": "Completely Wastes A Great IdeaWonder Park is massively disappointing with it’s overly generic story, stupid humor, and poorly written characters despite great animation."
    },
    {
      "rating": "2",
      "text": "While is isnt the worst thing in the world, in fact it has some amazing moments, it just misses the mark. The sad thing is, it had potential to be Disney Pixar level good..."
    },
    {
      "rating": "5",
      "text": "The movie has a very good and creative storyline but due to its poor presentation and execution, it fails as a whole even affecting the good parts of the film"
    },
    {
      "rating": "4",
      "text": "It might look great with nice animation and visuals, but everything else in this movie is so bland, generic, cliché, uncreative and forgettable. June, the main character is so unlikeable that makes me stop caring about anything in the movie. The rest of the characters are bland and one-note. The movie is filled with really bad and cliché dialogue, hit or miss jokes, like I laughed like twice the whole movie (I hated the porcupine character, he was so annoying and nothing he said made me laugh) and it feels like the movie didn't have any stakes, no tension, no danger, nothing. The emotional moments aren't emotional at all and feel forced. The pacing is really bad, like, I actually felt like the movie was too short! I mean it is far from the worst animated movie of the year (That title goes to Uglydolls or The Lion King, at least so far) but it is actually one of the most disappointing, because it had potential, in fact, the first trailer looked promising! Overall, mediocre movie, with a despicable main character, bland characters, abundance of clichés, dull story, but at least the animation looked great."
    },
    {
      "rating": "6",
      "text": "a good  family film   it touches certain topics other films might neccesarily be afraid to touch whilat remaining playful and in the world of the little girls imagination. it does have a couple sad scenes in it though so i would maybe suggest taking your older kids to see it first so above 6 years old and see what they thinknof it before taking your youngers"
    },
    {
      "rating": "4",
      "text": "Not what I was expecting. But a very cute movie. I'm a animated film lover. My kids loved it and kept their attention , if I knew what to expect I would give 5. But over all very good movie. Touching"
    },
    {
      "rating": "1",
      "text": "Wonder Park might be the WORST thing I ever saw in my years of watching movies. This movie doesn’t even try. Let’s start by pointing out the generic story points in this awful movie - this “movie” is about Judy, a bland Corline look-a-like trying to use her creativity to make A inmaginary Theme Park - her dream literally destroys the entire neighborhood in the process- the Mother gets sick (but doesn’t die)I’m gonna stop here. This movie is a pure insult to everyone involved. The movie wasted GREAT actors who I love:Matthew Broderick, Jennifer Gardener and Mila Kunis are all phenomenal actors in a pure trash movieThe movie is very mean spirited and depressing. It was hard for me to get through this movie. The only reason I rated it a 1 instead of a 0 is because the visuals DO look nice"
    },
    {
      "rating": "6",
      "text": "It was okay. Nothing really all that original. The movie suffers in it's pacing and drastic changes in the mood. We go from a mother and daughter bonding, to the daughter being reckless and not understand the difference of fantasy and reality, to a cliché plot about the mother being ill and the daughter unable to cope with it, to a camping movie, and finally to a movie about saving this amusement park in which the daughter finds out is real... at least it might be?Also, why is the name of the movie \"Wonder Park\" whenever the actually amusement park is called \"Wonderland\"? Is it because they forgot that Alice was a thing and they didn't want people to mistake this as just another retelling of Lewis Caroll's 1865 novel?"
    },
    {
      "rating": "5",
      "text": "Good family movie but that's about it. Not really the kind of movie for me. It had some funny stuff. Just a bunch of animals riding rides at a amusement park."
    },
    {
      "rating": "1",
      "text": "This movie... sucked!!! I can't believe I used to like this ever since I was 19 years old, but nowadays ever since March 26, 2021, I fricking hate it! It's a piece of monkey poop! Getting on to June Bailey! Oh my god, she's so annoying and she's a brat! I cannot stand her being so unlikable like this! The title of this movie is so misleading, because the movie's title is called Wonder Park, but in the whole movie itself, the amusement park that June made is called Wonderland! Mediocre character development, unfunny humor, terrible comedy, predictable story, and uninteresting plot! But the only good things about this movie is the good animation, great voice acting (despite talents being wasted), and good soundtrack by Steven Price. Overall, this movie is so boring, disappointing, a waste of time, and it's the worst animated film of 2019 next to Arctic Dogs and The Addams Family (the CGI version)! And also, this movie can get sent to the Darkness where it belongs! I give it a 1 out of 10! The end!"
    }
  ]
}