{
  "id": 64,
  "title": "Wonder Woman 1984",
  "starring": [
    "Gal Gadot",
    "Chris Pine"
  ],
  "runtime": 151,
  "genre": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "description": "A botched store robbery places Wonder Woman in a global battle against a powerful and mysterious ancient force that puts her powers in jeopardy.",
  "releaseYear": "2020",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8UlWHLMpgZm9bx6QYh0NFoq67TZ.jpg",
  "categories": {
    "plot": 2.5945945945945947,
    "acting": 3.3636363636363638,
    "ending": 1.6666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 2.0,
    "funny": 2.0,
    "action": 3.272727272727273
  },
  "reviews": [
    {
      "rating": "3",
      "text": "Cringe inducing moments that include horrible cgi, terrible story elements, and unbelievable action sequences that make the first movie look perfect by comparison.  The director really undid any credit from the first movie, and I am sure Warner is claiming this is all due to Covid-19 and counting on the bailout to hide this failure.  Given the 10s, the shills are out but nothing can cover-up how bad this is.  Hell, they had to keep Gal showing a lot of skin during the entire movie to keep any interest and distract attention from things like the lasso dissapearing from both her hands and suddenly being coiled on her him in 1/10th of a second, or being normally dressed to being in WW costume in same amount of time (after she hops out of the car mid movie).  This is a parody, not a real movie."
    },
    {
      "rating": "2",
      "text": "I barely made it through!Is this movie really finished? It looks like it’s either half done or rushed...or both."
    },
    {
      "rating": "4",
      "text": "Underwhelming and forgettable. It was like watching the tv series back in the 70’s. Corny and blah..."
    },
    {
      "rating": "0",
      "text": "We didn’t enjoy, but rather we endured this 2 1/2 hour waste of time.  This is a perfect example of all that is wrong with Hollywood."
    },
    {
      "rating": "2",
      "text": "WHAT A DISASTER. It's no wonder they turned this loose for free on HBO.  It's the perfect combination of \"fall asleep\" boredom, \"laugh out loud\" stupidity, and \"check your phone as a distraction\" cringe.   As for the action? I can't decide if it compares better to Superman 3 or Superman 4, but its right at those levels of hilarious cartoonish-ness.  After the first 30 minutes, you will be checking the timer over and over to see how much of the movie is left, and by the time the never-ending climax rolls around you'll be begging for someone to put you out of your misery.  I gave it 2 points for Gal Gadot's occasional smile into the camera, otherwise AVOID AT ALL COSTS."
    },
    {
      "rating": "4",
      "text": "There were plot holes big enough for a WWI pilot to fly a modern jet through.Script was quite poor and the special effects felt unfinished. I think maybe Warner Brothers knew this was going to be a VOD/straight to home release and cheaped out on finishing a quality edit. The first 10 minutes of the movie feel like a film of higher caliber, then it degrades to a made-for-TV movie complete with some Hallmark-channel fake snow."
    },
    {
      "rating": "1",
      "text": "The worst DC movie yet.  The sloppy writing and completely incoherent plot ruins this movie.  Things and rules are established though we both know that magic shouldn't exist in this DC universe from the other movies, but still there are rules.  However, the movie will break its own rules for the sake of progressing the movie, and since we all know everything will be fine since we have Justice League and Batman v Superman in a later timeline, the stakes in 84 don't matter.  The movie is to long and to conveluted to make you care since the outcome is already known.  Sadly as I like all the other DC movies up to this point, this will not be a rewatch and we'll just pretend this never happened."
    },
    {
      "rating": "3",
      "text": "I had anticipated this movie's release and looked forward to the second installment of Wonder Woman after enjoying the first film. I was sadly very disappointed to see that Warner Brothers and DC still haven't gotten the message and continue to squander beloved characters, great casts on poorly executed and poorly written scripts and storylines. Only redeeming qualities are some well choreographed fight scenes that felt reminiscent of the first film and some of the art direction for Cheetah and Wonder Woman key scenes. Gal Gadot is still the picture esque modern Wonder Woman with a heart of gold. Everything else feels poorly pieced together and leaves you confused and left wanting something better. Some moments were almost satirical and I found myself laughing at moments that were designed to create tension (children in a road). Pedro Pascal does well working with a character whose motivations and powers grow faster than character development. Warner Brothers continues their tradition of mediocre superhero movies in a post Avengers world. That said if you are a fan of the superhero genre and already have a HBO Max account watch it with lowered expectations."
    },
    {
      "rating": "0",
      "text": "Unwatcheably bad, an incoherent mess. The whole idea of the \"dreamstone\" is so cheesily and poorly introduced, you don't care what is going on because the plot is so cartoonish. Kristen Wiig was awful, Pedro Pascal completely wasted, nothing in this movie works.  Even the scenes of Diana and Steve Trevor seem meaningless because he isn't really back he is just a figment of her imagination."
    },
    {
      "rating": "2",
      "text": "Doesn’t live up to the original. Convoluted story where nothing happens and the story never really progresses, you feel the runtime with this one. Lack of heart and the innocence Diana had in the first is absent in this one and her chemistry with Steve suffers from that. All in all really disappointing."
    },
    {
      "rating": "3",
      "text": "This movie was terrible there were plot holes and inconsistencies through out the whole movie."
    },
    {
      "rating": "1",
      "text": "Horrible plot.Horrible villains..The first movie was better in every aspect."
    },
    {
      "rating": "3",
      "text": "Folks, This is a long and boring 2 and a half hour movie that just becomes too full of itself at times. The cast does a wonderful job but there is simply no substance in the story to make it worthwhile. If I had gone to see this in theatres, I would have walked out well before it was over. They really should have edited this movie downs some more and make it more bearable to watch."
    },
    {
      "rating": "1",
      "text": "This is the garbage we get after months of being able to fix the film with covid? WB has been a giant disappointment with all the DC movies. I give up!"
    },
    {
      "rating": "0",
      "text": "All of the things that made the first movie so good are removed. Long, boring, joyless and so cheesy most of the movie doesn’t hold up to even the slightest bit of scrutiny. Even for seeing it free I want a refund."
    },
    {
      "rating": "0",
      "text": "What a waste of time,  unbelievably bad and makes sense why it was rushed to hbo max. dismal in every regard and a fatal blow to all involved in its creation."
    },
    {
      "rating": "2",
      "text": "Bad CGI and timeline holes aside, WW84 fails because of poor writing and a very bad/odd story. I really enjoyed the first movie...this was painful to watch."
    },
    {
      "rating": "3",
      "text": "Only reason this gets a 3 is I could see this helping people with insomnia fall asleep. Genuinely the most boring movie of the last 10 years, and there are plot holes that are very confusing. There are 2 minutes of cool action and the first scene is cool but that's about it. The CGI is absolutely terrible as well. I made a metacritic account in the hopes that I could convince someone not to waste 150 valuable minutes of their life watching this putrid film."
    },
    {
      "rating": "1",
      "text": "What a total disaster of a movie... Boring, slow and with terrible jokes that just made you feel like the movie was trying way to hard to be a marvel film. DC cinematic universe needs to find its identity before they too have to be sold to the Disney overlords."
    },
    {
      "rating": "3",
      "text": "Whoa. WW84 is extremely corny. The plot feels like it was ripped from an old Saturday morning cartoon. Feels like the entire point was to find a way to bring Chris Pine back, which IMHO, was not necessary at all and it shows. He does nothing besides crack some \"dude outta time\" jokes, which obviously have been done before and were corny the first hundred times.. There is cringe everywhere. The mall scene feels like a glorified Pepsi commercial. Character motivations make no sense and yet at the same time everything is extremely predictable. The action is fine, and even the acting is ok, but the story is outright terrible. Maybe it's due to the lack of big movie releases in 2020 that so many critics are enjoying this film... That's understandable. As a pure get-away mindless fun time, then this movie passes the test. If you were hoping for anything grander, then you may be disappointed. This movie is not very good and will be forgotten in time. However, since this year has been crap, if you can find enjoyment in it then I envy you."
    },
    {
      "rating": "0",
      "text": "I just spend 2 and a half hours watching this movie and I can say that it is a completly waste of time!"
    },
    {
      "rating": "2",
      "text": "I still sit in disbelief that this movie was so bad.  And I've seen nearly EVERY Nic Cage movie.  DC Comics needs to fire everyone on the movie side and retool."
    },
    {
      "rating": "1",
      "text": "Despite the lesson taught to me by this film, if I could get my hands on that stone, I would most fervently wish for that 2.5 hours back, regardless of the other personal cost."
    },
    {
      "rating": "3",
      "text": "Boring. nothing of substance. rehashing a storyline that didn't need to be made."
    },
    {
      "rating": "3",
      "text": "Extremely cheesy. No consistency in what's going on, even for a super hero movie. She literally gives up the love of her life and immediately moves on into a heroic sequence. Supporting actors then have to play an overly dramatic villainous sequence for literally less than 15 minutes and then are immediately foiled. There was no climax to the movie."
    },
    {
      "rating": "0",
      "text": "I didn’t expect it to be good. But the poor writing and acting was a surprise. The enemies in this movie was sad. The movies coming out of Hollywood have really been disappointing more often than not. I don’t see things getting better anytime soon."
    },
    {
      "rating": "0",
      "text": "What I didn't like was the fact that they bring Steve back as a spirit that possesses some random guy's body, and that Diana and Steve, while possessing this man's body, are not only in this man's home, and trying on his clothes, but she has sex with this possessed man in his bed. If this wish stone made other people's wishes come true, and created giant walls and made other things materialize, then why didn't they just bring Steve back in his own body? Why did he have to take over this random man's life, who basically has no say in the matter? I'll bet you if the roles were reversed, and Batman or Superman wished for a dead lover to come back, and it possessed some random woman's body, and they had a scene with them waking up together in bed, that there would have been an uproar, because isn't that considered rape? Having sex with someone who's drunk or drugged, and not in control of their body or able to give consent, isn't that considered rape? And in the remainder of the movie this man, who is possessed by the spirit of Steve Trevor, is put into various perilous situations and even shot at and I don't think that's cool. Plus, I thought you only get one wish, so why did Barbara get two wishes? Her first wish to become like Diana, then the second wish to become an apex predator/Cheetah? That completely contradicts what we were told in the beginning of the movie. And why are all the men portrayed as catcalling jerks (i.e., except for Steve Trevor)? And why is there a little boy just roaming around unattended in various offices and facilities, and in the one of the last scene's he's stranded and walking alone on a stretch of highway, and at the end comes running out of the woods by himself? Where's his mother or guardian? Also, how does a man (Steve Trevor) who only flew planes in the 1940's able to fly a military jet that has 1980's technology? I think there are too many plot holes and things that make no sense, and that are just wrong and cringeworthy, especially the fact that a superhero has sex with a non-consenting possessed man. That's just wrong on so many levels and this movie is just wrong on so many levels."
    },
    {
      "rating": "0",
      "text": "I wanted to love this movie so much, the first Wonder woman film was amazing and with so much heart, personality and excitement. Wonder woman 1984 is a disaster of a film, so many plot holes, ridiculous concepts and ideas so badly executed. I really wanted to love this film, but it was impossible for me to ignore how bad it was and I was especially disappointed that I saved this to be my first movie theater experience after spending months locked up at home because of the pandemic just to be thoroughly disappointed with such a bad film."
    },
    {
      "rating": "0",
      "text": "The movie was straight buttt crack. Never have I ever seen some buhllshet like that before"
    },
    {
      "rating": "10",
      "text": "incredible movie, beautiful message, a super hero being a super hero! Beautiful and exciting"
    },
    {
      "rating": "4",
      "text": "While the first Wonder Woman movie was a step forward for the DCEU, this one is two steps back."
    },
    {
      "rating": "4",
      "text": "The \"1984\" setting is nothing but a throwaway after-though. Three stories running on three people dealing with their ambitions and increasing powers.  Wonderwoman is  get equal billing with the other two.  And when she's on the screen you just wish she got less dialogue and more action because she's just a terrible actress (Natalie Porter in Star Wars BAD). So, a Wonder Woman film not entirely about Wonder Woman and you're actually relieved it isn't. Not exactly what I expected."
    },
    {
      "rating": "6",
      "text": "I really wanted to enjoy this movie. Honestly it just didn’t do it for me. One can only hope the next one is better assuming there will be one."
    },
    {
      "rating": "5",
      "text": "Very mediocre and a huge step down from the first movie. I was really looking forward to WW1984 but seriously the story is not very clever, the characters are bland and overall the depiction of Wonder Woman is really dull in comparison to her uniqueness in the first movie.You can still enjoy the movie but over the course of 2.5hrs there is a multitude of missed opportunities traded for bad decisions. If this franchise gets continued I really hope they return to their origins because there is huge potential."
    },
    {
      "rating": "1",
      "text": "Cringe inducing moments that include horrible cgi, terrible story elements, and unbelievable action sequences that make the first movie look perfect by comparison. The director really undid any credit from the first movie, and I am sure Warner is claiming this is all due to Covid-19 and counting on the bailout to hide this failure. Given the 10s, the shills are out but nothing can cover-up how bad this is. Hell, they had to keep Gal showing a lot of skin during the entire movie to keep any interest and distract attention from things like the lasso dissapearing from both her hands and suddenly being coiled on her him in 1/10th of a second, or being normally dressed to being in WW costume in same amount of time (after she hops out of the car mid movie). This is a parody, not a real movie"
    },
    {
      "rating": "4",
      "text": "Bad story with  lot of error/plot holes. Inconsistancies with first movie and WB universe. Uninterresting characters, specially the 2 bad guys. Half the movie has no purpose. The dramatic scene is exactl the same as the first movie which completly destroy the rythm. CGI is bad most of the movie. Music from the\" first movie is greatly missing. Not a good sequel, forget it."
    },
    {
      "rating": "0",
      "text": "Boring and made poorly. The first half hour has no plot at all. Fights and action scenes are very boring to see."
    },
    {
      "rating": "5",
      "text": "Wonder Woman 1984 is a gigantic mess. The action and some of the characters are good, and some scenes are shot well, but the movie has way too many plot holes, characters that are flat out useless, underdeveloped emotional moments, and an extremely bloated runtime that holds it back from being as good as the first."
    },
    {
      "rating": "5",
      "text": "A dissappointment. We needed a great and mind-alluring movie, but what was given to us was a regular movie no different from other regular hollywood movies"
    },
    {
      "rating": "4",
      "text": "this movie can not satisfy me and in all aspects of this movie is a big drop after the first version of this movie. the film was very poor"
    },
    {
      "rating": "7",
      "text": "Gives you everything you could possibly want from a superhero movie, even if it gives you a bit *too* much of it. This is a bright, vibrant, optimistic superhero film that feels right out of the Dick Donner Superman or Sam Raimi Spider-Man playbook. With fun, colorful characters, tons of charm, and a hammy, yet relatable villain. Both the stakes and the runtime should have been scaled back, as the film goes way off the rails, but Wonder Woman 1984 gives hope to the post-Zack Snyder DC filmography."
    },
    {
      "rating": "3",
      "text": "This movie is a huge disappointment. Most of the movie is boring and the villians suck."
    },
    {
      "rating": "4",
      "text": "Great action, Kristen Wiig was great, but the writing was pretty terrible, and Pedro Pascal overdid it."
    },
    {
      "rating": "1",
      "text": "Wonder Woman raped a dude without consent nor control of his body. If it was the other way around people would be steamed mad. This tells you a lot about Feminism hypocrisy.Side note: If you didn't notice the holes, inconsistencies of its concept, character and plot at first watch then watch it again"
    },
    {
      "rating": "1",
      "text": "I just wish Hollywood would stop trying so hard to force politics into movies to the exclusion of a good story.  Critics have their back because they make a living off these studios, but user reviews tell it all.  Movies, this one included, are like Legos glued together the wrong way just to force a political narrative and they think we are too stupid to see through the poor cinema to see it.  Hollywood if you want anymore of my money pen a good story for F's sake and stop \"snobbing\" us, we aren't the idiots you make fun of when the cameras aren't rolling.  And try to stop being bottom b**ch for the system, you used to be edgy and counter culture."
    },
    {
      "rating": "4",
      "text": "What the hell happened? The potential lost is really disappointing. Do the people who make these movies not know how bad they are? Another bad thing to add to 2020."
    },
    {
      "rating": "1",
      "text": "One of the worst films i have ever seen. No wonder they put this straight to stream, so boring, stupid plot holes,  poorly acted, CGI was like an 80s movie (not in a good way). The director could not direct a piss up in a brewery.And seriously WTf is the whole body stealing thing?Not cool Paty – it is RAPE!!I do not look forward to anything this director / Writer (lol)  is involved with"
    },
    {
      "rating": "1",
      "text": "This movie shouldn't been made!!! Are you kidding me a Dc trinity movie with Three Twenty minute action scenes. That's Embarrassing!!!"
    },
    {
      "rating": "1",
      "text": "Diabolically bad. I had high Hope's for this movie after the first one but this movie is so bad I actually felt angry after watching it. It is a complete disjointed mess. Terrible plot, script and cgi euhhhh."
    },
    {
      "rating": "3",
      "text": "I loved the first Wonder Woman, though it was often over-the-top and ridiculous.  This movie takes those vices and raises them to 11.  The plots of these types of movies never make too much sense, but this one is far worse than normal: it is completely incoherent.  Even my young children couldn’t stop from voicing plot holes while watching.  When they asked me why something was happening rather than some other course of action, I simply didn’t have an answer.  I love Gal Gadot and I enjoyed the first movie, but this one lost its way."
    }
  ],
  "recommendations": [
    "shadow_in_the_cloud",
    "wanted",
    "doctor_strange_in_the_multiverse_of_madness",
    "2012",
    "transformers_age_of_extinction",
    "transformers_the_last_knight",
    "the_new_mutants",
    "knowing",
    "sanctum",
    "the_old_guard",
    "battleship",
    "teenage_mutant_ninja_turtles",
    "how_it_ends",
    "bird_box",
    "the_matrix_resurrections",
    "suicide_squad",
    "transformers_revenge_of_the_fallen",
    "geostorm",
    "the_twilight_saga_breaking_dawn_part_1",
    "the_tomorrow_war",
    "jurassic_world_dominion",
    "national_treasure_book_of_secrets",
    "legion",
    "skyline",
    "ghost_rider_spirit_of_vengeance"
  ]
}