{
  "id": 3817,
  "title": "Wonder Wheel",
  "starring": [
    "Jim Belushi",
    "Juno Temple"
  ],
  "runtime": 101,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "The story of four characters whose lives intertwine amid the hustle and bustle of the Coney Island amusement park in the 1950s: Ginny, an emotionally volatile former actress now working as a waitress in a clam house; Humpty, Ginny’s rough-hewn carousel operator husband; Mickey, a handsome young lifeguard who dreams of becoming a playwright; and Carolina, Humpty’s long-estranged daughter, who is now hiding out from gangsters at her father’s apartment.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gKYpAL1A01T9a1taGXAyfqXjI5x.jpg",
  "categories": {
    "plot": 6.3,
    "acting": 5.5,
    "ending": 5.0,
    "soundtrack": 2.0,
    "cinematography": 6.333333333333333,
    "familyFriendly": 3.5,
    "funny": 7.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "“Wonder Wheel” is the annual film submission by writer-director Woody Allen and stars Kate Winslet, Juno Temple, Jim Belushi and Justin Timberlake. The film takes place in circa 1950 in Brooklyn’s famed Coney Island section amidst the backdrop of the infamous wheel invented by Mr. Ferris. This writer’s problem with the film stems from, firstly, the history of great films made by Mr.Allen and the tendency to compare each new entry with the gems of the past. Secondly, and on a much more personal note, the little old lady sitting next to me was using a device that displayed closed captioning and was a real distraction to the person sitting next to her, i.e. me. That being entered into the equation, I found the film to be mildly interesting with an all too simple plot. What makes the film standout, however, is the unbelievable acting of Ms. Winslet who dominates the screen whenever she appears and saves the film from the mediocrity to which it might otherwise have been relegated. Outstanding, too, are the performances of Mr. Belushi, Mr. Timberlake and Ms. Temple. But for me, a native Brooklynite and daily summer visitor to Coney Island, the water, beach, rides, boardwalk and the nostalgia they foster make the viewing experience that much more enjoyable. I give the film a 7 rating but wonder (no pun intended) how it would have played without Ms. Winslet and/or the location."
    },
    {
      "rating": "5",
      "text": "Like he did for Cate Blanchett in Blue Jasmine, Woody Allen has given another Kate (Winslet) a role that allows her to go all out. Unfortunately, this character is so unbearably neurotic that's Winslet isn't liable to win an Oscar (as Blanchett did). She plays a waitress in '50s Coney Island who's married to a blustery carousel operator (Jim Belushi). His estranged daughter (Juno Temple) shows up on the lam from gangsters, while the local lifeguard (Justin Timberlake, who also acts as narrator) causes hearts to flutter. The period creation is fun and Vittorio Storaro's gold-infused cinematography adds visual richness. There are obvious parallels to Tennessee Williams and/or Eugene O'Neil, but this screenplay only features continuous conflicts and melodramatic histrionics that lack much depth or emotion. Since it's Allen, there's a level of filmmaking competence, but its flaws outweigh its strenghs."
    },
    {
      "rating": "2",
      "text": "Woody Allen has directed about 53 films, averaging one a year for the past 50 years, and about 1 out of 5 are very good or excellent, 30 bearable to watch and the rest are pretty bad, to which he can add “Wonder Wheel”. It is as if he didn’t give Justin Timberlake any direction and just told Kate Winslet to be Cate Blanchett in “Blue Jasmine”, who was a rip-off of Blanche Dubois in “A Streetcar Named Desire”, and it is the first time I can remember feeling she was just doing a bad acting job or was, at least, in a different movie. Seeing either of them on screen, saying trite sentences, was painful except for some beautiful lit headshots of her. Who sabotages her most is Woody Allen, the writer, with some of the tritest sentences ever uttered on screen with poor imitations of Williams, Eugene O’Neill and others.Jim Belushi seemed to be a combination of Stanley, without the body but the attitude, and Mitch in “Streetcar”, while Juno Temple starts off as an uninteresting part of the film but develops her character nicely as the film comes towards the finish.Now if I could only figure out why Jack Gore, as a child from Winslet’s first husband, is a pyromaniac and why he is even in the movie.Without getting into the whole Woody Allen-Mia Farrow-Dylan Farrow-Soon-Yi Previn aspects which is reflected in today’s news this is definitely one of Allen’s worst pictures as a director and writer and, for the first time, I felt Allen even got the music track wrong, completely annoying.The stars of “Wonder Wheel” are not Allen but cinematographer Vittoria Storaro and Santo Loquasto the production designer."
    },
    {
      "rating": "3",
      "text": "While stunning visually, this latest offering from Woody Allen has to rank among the worst of his films. With leads that are horribly miscast (especially Kate Winslet in a bombastic exercise of overacting), writing that's seriously bloated and in need of retooling, and characters who are neither likable nor believable, the film tells a tale that in many ways feels like a working class 1950s retread of \"Blue Jasmine\" with elements of \"Cafe Society\" thrown in. As much of a fan as I am of the director's work, I whole-heartedly recommend skipping this one -- and hope that he gets back on track with his next project."
    },
    {
      "rating": "9",
      "text": "I really don't get the bad reviews this movie has gotten, I reckon Wonder Wheel is a shockingly underestimated gem, and usually I'm not a huge fan of Allen. But in this movie everything seems perfect to me,starting from the saturated palette created by Vittorio Storaro, which evokes a sense of celebrating nostalgia for the amazing '50s and stresses the dreaming nature of the protagonist (a Kate Winslet in state of grace), a palette that describes the protagonist's feelings, showed through a blue or a golden shade on her persona, Picasso's style. I loved the metatheatrical bits, the numerous references to the Greek tragedy (the movie itself feels like it's a stage play). And this is the best I can do with my second language."
    },
    {
      "rating": "2",
      "text": "If you make the mistake of viewing this film, pay special attention to Justin Timberlake. It's as if he's been possessed by Woody Allen. Even Timberlake's diction is similar to Allen's. Timberlake is Woody Allen by proxy. All in all, a pretty boring flick."
    },
    {
      "rating": "5",
      "text": "'Wonder Wheel' is a gorgeous looking film with terrific acting, but sadly feels uneven. It's more of a stage performance than a movie.It's amazing to me that Woody Allen can bump out a movie each year and make it so rich and old fashion. Unfortunately the film themselves have become a faded memory for me, expect for 'Midnight in Paris'. I don't remember a single thing that happened in his previous movie 'Café Society'. This will suffer the same thing.Allen making a love triangle around a woman and her stepchild isn't the smartest thing to do with his controversial past. You are literally putting light on your issues. Sometimes art itself can't spare it's artiest."
    },
    {
      "rating": "4",
      "text": "Now! We have a manual guide for making horrible movies that is directed by one of the best creators of history of cinema! and seriously i hope somebody explains to me that why Justin Timberlake is one of the main actors here!!!"
    },
    {
      "rating": "6",
      "text": "With this film I have confirmed what I had already thought of Woody Allen's filmography, because since Vicky Cristina Barcelona to the date, ​​the man has fallen into another creative blunder and in nine years he has only delivered two solid films and this is not one of them. And I'm quite disappointed because this one looked promising."
    },
    {
      "rating": "7",
      "text": "Once more Woody Allen returns to one of his favourite themes of moral choice standing in the way of love. It doesn't offer anything new to director's worldview, but will take you on a shiny and humorous ride."
    },
    {
      "rating": "7",
      "text": "Visually stunning, a superb performance from Kate Winslet and a mise en scene that is not only captivating but refreshing. I've enjoyed this latest Woody Allen offering. While not perfect, I think is a worthy addition to his filmography."
    },
    {
      "rating": "8",
      "text": "Allen has hits and misses. Match Point was a hit, and with his other films, there are obvious misses. Wonder Wheel is a hit. It has a great measured pace and lyrical dialogue. Winslet embraces her role fully and it's hard to believe she wasn't nominated for best actor. Aesthetically cohesive it charmingly represents the 1950s. It comes across as a stage play made into a movie as the long monologues of the characters are engaging and revealing of their inner, human flaws. The storyline has a similar theme of his other works but the acting here becomes paramount - especially Winslet - and leaves the viewer less inclined to fault him for this. The Timberlake character does come across as too modern and slightly anachronistic but otherwise, this movie is greatly under-rated. Can't understand how it has received such poor ratings."
    },
    {
      "rating": "6",
      "text": "This reasonibily considered a minor movie by Allen. The screenplay is not as solid as usual. An easibily forgettable movie."
    },
    {
      "rating": "7",
      "text": "\"Wonder Wheel\" is Woody Allen's 48th film, a love triangle set in 1950's Coney Island. The story centers on Ginny (Kate Winslet), a depressed clam bar waitress trapped in a loveless marriage, who begins a secret romance with a lifeguard (Justin Timberlake) while her husband's estranged daughter (Juno Temple) comes to stay with them. The film explores themes of past mistakes and damaged dreams, with a darker tone than Allen's previous works. Kate Winslet gives a standout performance, while the cinematography by Vittorio Storaro captures the vibrant colors of Coney Island. The film's stage-like feel and at times wordy dialogue detracts from the overall experience, but \"Wonder Wheel\" is still a good, toned-down offering from the prolific director._________________________________\"Wonder Wheel\" es la película número 48 de Woody Allen, un triángulo amoroso ambientado en Coney Island en la década de 1950. La historia se centra en Ginny (Kate Winslet), una camarera deprimida atrapada en un matrimonio sin amor, que comienza un romance secreto con un salvavidas (Justin Timberlake) mientras la hija separada de su esposo (Juno Temple) viene a quedarse con ellos. La película explora temas de errores del pasado y sueños dañados, con un tono más oscuro que los trabajos anteriores de Allen. Kate Winslet ofrece una actuación destacada, mientras que la cinematografía de Vittorio Storaro captura los colores vibrantes de Coney Island. La sensación de escenario de la película y, a veces, los diálogos prolijos restan valor a la experiencia general, pero \"Wonder Wheel\" sigue siendo una buena oferta atenuada del prolífico director."
    }
  ],
  "recommendations": [
    "midnight_in_paris",
    "vicky_cristina_barcelona",
    "the_grand_budapest_hotel",
    "notting_hill",
    "fading_gigolo",
    "blue_jasmine",
    "anna_karenina",
    "big_eyes",
    "my_salinger_year",
    "catch_me_if_you_can",
    "phantom_thread",
    "american_hustle",
    "motherless_brooklyn",
    "a_star_is_born",
    "joy",
    "chinatown",
    "murder_on_the_orient_express",
    "the_french_dispatch",
    "the_royal_tenenbaums",
    "the_aviator",
    "youth",
    "the_theory_of_everything",
    "the_only_living_boy_in_new_york",
    "rear_window",
    "the_second_best_exotic_marigold_hotel"
  ]
}