{
  "id": 1156,
  "title": "Wonder",
  "starring": [
    "Jacob Tremblay",
    "Julia Roberts"
  ],
  "runtime": 113,
  "genre": [
    "Drama",
    "Family"
  ],
  "description": "The story of August Pullman – a boy with facial differences – who enters fifth grade, attending a mainstream elementary school for the first time.",
  "releaseYear": "2017",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ouYgAatYH4JzIThj6FI3UYf31RI.jpg",
  "categories": {
    "plot": 7.0344827586206895,
    "acting": 6.818181818181818,
    "ending": 7.666666666666667,
    "soundtrack": 6.0,
    "cinematography": 8.0,
    "familyFriendly": 8.0,
    "funny": 6.0,
    "action": 7.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Incredible, inspiring, heartwarming emotional roller coaster of a movie, a parade of heart tugging moments with the sole intent of leaving you in floods of tears. Not my cup of tea but Wonder is suitable for all ages and definitely worth your time.Jacob Tremblay stars as Auggie, a young boy entering mainstream school for the first time and with that comes the obvious problems. Bullying, making friends etc. It seemed like every scene was trying to outdo the previous, determined to push the viewer to their limit and overwhelm you with emotions. I understand the message the movie is getting across, tolerance, compassion but at times it felt a little much at driving home the point. Wonder practically writes itself, playing out exactly how you'd expect and contains little surprises but it tells the story in a unique way, taking the story of Auggie and looking at it from different perspectives which adds that extra depth that the story definitely needed. The world doesn't always revolve around Auggie and the character development for the rest of the cast was perfect. Tremblay is absolutely brilliant, surrounded by a great supporting cast and tied together with a story you can't help but get drawn into. A real crowd pleaser, recommended and don't forget the tissues."
    },
    {
      "rating": "6",
      "text": "It’s not a bad movie. The story is nice. But the reliance on potty humor really dumbs the story down. It also doesn’t help that despite being a very emotional movie, the characters don’t seem realRating - 61%"
    },
    {
      "rating": "4",
      "text": "Nice message, but it just felt so cliche and terribly corny. Was really disappointed by the makeup for Auggie. Obviously they wouldn't go too over the top for the makeup cause they obviously didn't want anyone off put by it or anything, but I seriously could barely tell that he looked \"different\" unless I looked closer. Again, not terrible, decent for the family, but just not enjoyable and disappointing for a followup to a book that good."
    },
    {
      "rating": "10",
      "text": "“Wonder” might not win any awards, not even mentioned for any, but it is one of the most heartfelt, moving movies of the year. It is a story of many loves: between a mother and son, mother and daughter, father and son, father and daughter, brother and sister along with what it means to be different.In this case Auggie was born facial deformities and had to go through many operations to be able to talk, see, hear, among other things. His mother stepped off her path to home school him which was a must due to all the surgeries but decided at the age of 10 Auggie was ready, had to, join the real world and started him at middle school where most of the kids would also be facing a strange world.Kids can be cruel to each other, especially to those who are different, and Auggie is taunted, classmates being ugly towards him, afraid of touching him thinking he might be contagious, not being friendly to him but ostracizing him, making fun of his looks and generally bullying him. Due to his facial abnormalities he looks forward to Halloween so his face can be covered with the kids not knowing who he is and he can cat, be, one of them.Based on a best-selling young adult novel by R. J. Palacio and adapted for the screen by Stephen Chbosky, Steven Conrad and Jack Thorne “Wonder” it is a film for everyone who have had to deal with problems, people and just life in general. “Wonder” is about children and adults made for children and adults.Jacob Tremblay, as Auggie, had a breakout role in “The Room” and follows that up with a different acting challenge meeting it head on and makes Auggie a real child with all the problems a child faces learning, knowing his deformity is just another one. His older sister Via, played superbly by Izabela Vidovic, loves her brother but knows she had to be shunted aside by her parents while Auggie was in and out of hospitals. As he starts middle school she is just starting high school after her best friend, Danielle Rose Russell, returned from a summer away a different person than the one she was. She also meets Nadji Jeter who introduces her to the school theatre group.Of the other children all come across as children you knew when you went to school. There is Noah Jupe as Jack who befriends Auggie and unknowingly turns his back on him, Bryce Gheisar as Julian the lead bully with his own group of followers who make things worse for Auggie and when Julian is faced with his bullying his parents stand up for him.When it comes to the adults the principal, Mandy Patinkin and his homeroom teacher Daveed Diggs treat Auggie as just another kid while Ali Liebert, a science teacher, backs Auggie’s interest in science and his class project. Sonia Braga’s cameo as Via’s grandmother has an effective scene with her granddaughter.Jacob Tremblay is the star of the movie but Julia Roberts and Owen Wilson, as parents all kids wish they had, contribute not only as loving, supporting parents but parents who deal with the problems their younger son has to face. They are both warm, strong people yet you see the concern as she sends her boy off to school and the realization that both her children may soon be leaving their home. Wilson is the fun dad, the one who can make his kids live safe and who can act as childish as they do yet let them see how much he also loves their mother.Director Stephen Chbosky does an excellent job showing the home life, the school life and the social interactions, both negative and positive, between young people, moving smoothly bringing emotional times, looking at and answering hard questions, while showing the most important lessons both kids and adults need to learn.“Wonder” is a film parents can take their children to without embarrassment and both will be entertained, share recognizable moments from their own relationships with each other and others and during the 133 minutes of the film bringing the audience along for the ride and involve them emotionally."
    },
    {
      "rating": "0",
      "text": "When this book was recommended to me, I was excited because I suffer a genetic glitch, less visible than Auggie's, but I've still faced bullying and discrimination because of it. Reading the book was so severely frustrating for me because it was for the readers who relate to the people around Auggie. Auggie's behavior wasn't realistic and it felt undermining that a fictional 5th grader had more forgiveness and tolerance than I did at his age. The movie made it worse if anything. It's frustrating to me that this book and movie is so celebrated because every time I see it sitting on a shelf, I'm discouraged."
    },
    {
      "rating": "8",
      "text": "I will admit by the end of the movie that while it was done well, and truly draws out genuine emotion out of the viewer (a few guys in the theater were dabbing their eyes, too), I found it almost too realistic in one aspect that was a major part of the story -  bullying.    I was a victim of incessant and relentless bullying as a junior high schooler through about the ninth grade by a bunch of cowardly rednecks who delighted in making miserable anybody who wasn't athletic and especially if they were from somewhere else (my family moved from a Midwest state to the South when I was 12) and were smarter.    While I fortunately didn't have the deformities that afflicts the hero of this picture, I nonetheless recall the horrible treatment I received without any justification, and lived in a virtual state of terror until high school when I grew up a lot, and one of the ringleaders moved.    The rest didn't have the brains to carry on his orders against me.    So, even today at 56 sometimes the memories haunt me.    So while I never reciprocated and bullied anybody younger or weaker than me, seeing that it would be just as bad as those who were harassing me, resentment and anger helped scar my life well into my early '20's.    This is important because \"Wonder\" does a good job of showing how terrible, mean and stupid our \"precious\" kids can be.    While the movie ends well, and is done thoughtfully with fine acting by all involved, it does give us an idea of what some of our kids suffer through, with or without a disability.    In one scene, one particularly mean little jerk is sent to the administrator's office for numerous verbal and other attacks against \"Auggie\", his parents are defensive, belligerent, and refuse to believe their little angel could be capable of the very acts he's committing.    And frankly, in the real world, victimized kids don't turn the school into admirers except maybe for a more compassionate and intelligent friend or two.    I don't recommend this movie for anybody being bullied, or who suffered at the hands of these cretins, boys or girls.    It may be just too painful to relive.    It touched a life long raw nerve with me, and while it's a fine movie, I do not want to see it again.    Society is full of adult bullies too -  bosses, co-worker idiots, stupid neighbors, control freaks, who can't handle anything that isn't their way, abusers of all sorts, etc.    I don't want to pay to see that behavior."
    },
    {
      "rating": "10",
      "text": "I agree with the positive US critics. An unusual film about Emotional Intelligence.  It starts with look-feel of \"based on a true story\" but is in fact from a novel.  As it proceeds, the narrative opens up in a heartfelt and inclusive way towards larger points about the values of friendship and how one person can \"raise the bar\" on Emotional Intelligence in a small community.    As a writer myself, I want to underline how innovative and thoughtful the script.  Thank God the performances do it justice.    The many child actors are all wonderful and--I know unheard of and hard to believe--all major minor actors have actual character arcs (run, get the smelling salts; he passed out!)"
    },
    {
      "rating": "10",
      "text": "This movie from the start reminded me of the older film Mask (1985) featuring Cher and Eric Stoltz with a story that better fit today. The movie turned out to be so much better, absolutely loved it; it's a tear jerker, the cast is perfect!"
    },
    {
      "rating": "8",
      "text": "This is a great movie, let me just say that.Based off the best-selling novel, Wonder centers around a young boy named August Pullman, who was born with facial deformities, as he tries to fit in at his new school, Beecher Prep.The movie is one of the most heart-churning emotional movies I've seen this year. It shows us how the way you look doesn't change who you are on the inside, that we shouldn't judge one another for the way they look or the way they dress or behave, that it's the heart deep down that matters. At least once I saw August face a problem whether it be bullying or trying to fit in, and thought \"Hey, I've had to deal with that once.\". The movie makes us remember the hardships we had to face through school and life as a kid. It makes you look at this young boy and understand the pain he feels, and feel sorry for him. When he's happy, you're happy. When he's sad, you're sad. When he's angry, your angry. The movie masterfully conveys our emotions, which is what drama movies should do.If you're wanting to treat your kids to a movie that gives them good morals, Wonder is your movie."
    },
    {
      "rating": "3",
      "text": "Bland characters, convoluted and uninteresting plot, cheesy drama and forced romance with side characters."
    },
    {
      "rating": "7",
      "text": "For again a film based on a best-selling story, you would expect things to go with the flow. In this film based on a best-selling story, it serves a huge life lesson that you can always fit in something regardless whether you have Treacher Collins syndrome or not. The film takes that life lesson and made it a lot better than what it seems to be. While not the best I have ever seen, it does result in a solid film that holds strong on its best-selling material."
    },
    {
      "rating": "3",
      "text": "This movie went all over the place. It mainly is an emotionally manipulative drama with a plot about a young man with a facial deformity. The characters were pretty bland and they didn't make me invested in the story. The movie has a great message about bullying, but the message would have been more powerful with better acting. I know people just like Auggie, and I can say the character he is portraying is entirely unrealistic. The movie had forced romance, and tiny bits of unfunny, and bland comedy mixed in. I rate dramas based off how emotional they make me feel, and this film did not accomplish its purpose. I appreciate the movies wonderful and kind message, but it just wasn't for me. With better acting, no forced romance, no cheap dusts of comedy, and more realistic character portrayal, we would have a very decent film on our hands. But instead, we get a pile of mushy drama and forced quotes shoved down our throats."
    },
    {
      "rating": "0",
      "text": "This movie was so sucky.! It was completely horrible I dont understand it and it just sucky overall."
    },
    {
      "rating": "3",
      "text": "I found it ironic that Auggie had an obsession with star wars when its biggest problem is the same as rouge one you don't care for the main character but you care for the side characters who get stuffed aside but the difference is Wonder frustratingly acts like it's siding characters have a major role in the story other complaints being this movie has 4 climaxes that could have ended the movie and characters act in the exact way you expect them to there also is a lot of filler and there was this one scene you could just tell they thought no one would like this movie unless it made you cry so they did the saddest thing they could come up with finally this movie only knows 2 emotions happy and sad and they try to cram both of them down your throyght with no succsess at all."
    },
    {
      "rating": "8",
      "text": "Anyone watching this film better bring their Kleenex cause you will be weeping. The film overall is really good and while real life is much more difficult than what they show you here, the film is a important watch for all families. A-"
    },
    {
      "rating": "8",
      "text": "Dripping with sentimentality, this is the epitome of the 'heartwarming family film with a message’ that is exactly what you should expect, but the pleasant surprise comes from the superb rendering of the novel on which it is based, with only very minor changes from the source material. The performances are excellent, and the storyline follows the original virtually beat by beat, which is satisfying, and surprisingly well paced on screen. The saccharine nature of the plot means it was always going to be a schmaltzy crowd pleaser, but thankfully it is also a poignant and generally polished experience that will tug at your heartstrings and resonate with a broad audience. 8.21/10"
    },
    {
      "rating": "8",
      "text": "Wonder tells a heartwarming story about a boy with facial deformities who is struggling to fit in at school. It has a great cast and really good performances that make you care for the characters and the problems they are dealing with. The plot is a bit messy however, as parts of the movie focus too much on some of the side characters. I would have preferred to see the movie focus on Auggie the whole time, with everyone else as the supporting cast. But by the end of the movie the different plot lines work better, as all the characters come together creating a meaningful ending."
    },
    {
      "rating": "9",
      "text": "Wonder was REALLY good. Who wouldn't love a movie about kindness? August \"Auggie\" Pullman is bullied by other people for his face. This movie really teaches a lesson. Very satisfying."
    },
    {
      "rating": "8",
      "text": "Beautiful film, touching and sweet. Cried several times. . . Amazing cast all around. The casting really needs to be appreciated. Every character was perfect for their roles. Touching film, will need to watch again because I  have forgotten much of it, but enjoyed the ride and thought of how much my mum would love this."
    },
    {
      "rating": "9",
      "text": "A pleasant, life affirming movie with a positive message that originates from the source book and is continued in the campaign it spawned; Choose Kind. Acting in the movie is universally great - Owen Wilson plays Owen Wilson as always, and in this case it happens to fit rather well. Although the plot largely lacks surprises, the juxtaposition of the different points of view for some of the major characters, including overlapping some of the timelines of the story works very well, adding a bit of interest to an otherwise linear, albeit entertaining plot. This is simple, feel good popcorn movie fodder, with a message that is particularly needed in current times; \"if you have a choice between being right and being kind, choose kind\"."
    },
    {
      "rating": "7",
      "text": "#ChooseKind is the movement that came from the book that inspired this movie. It's a message of acceptance and kindness that's the core of this story. Jacob Tremblay (the boy in Room) plays Auggie, who was born with facial differences. His homeschooling mom (Julia Roberts) decides it's time for him to go to school with other kids and that's when the conflicts begin. Children can be cruel and this film piles on the unkind acts. The narrative actually veers away from Auggie's plight several times to detail the stories of people in his orbit. This film is a step above Hallmark sentimentality, thanks primarily to strong performances by the entire cast and direction by Stephen Chbosky that generally veers away from taking the maudlin way out. Overall, emotionally involving and sweet."
    },
    {
      "rating": "8",
      "text": "A very moving film. Some great acting especially from the kids. The story is just heartfelt. See it with kids age 11+"
    },
    {
      "rating": "10",
      "text": "Wonderful family film, and not that it's all sugar and spice but in that it could cause a great discussion afterwards. Anyone with children above the 3rd grade should watch this with them to talk about kindness, empathy and bullying."
    },
    {
      "rating": "8",
      "text": "\"Wonder\" was a very good movie, fun and inspiring. Jacob Tremblay has shown us that we should not see things from the outside, but what is inside. I also liked the makeup of the child actor, in addition to his performance. Julia Roberts and Owen Wilson were great as well as the rest of the cast. The plot was good, the story was spectacular, a family movie that is worth seeing."
    },
    {
      "rating": "9",
      "text": "Go damn, this movie is soooo great. Is one of the leastest movies that manges to make me cry. The main character is so sweet and sympathetic, the acting is fantastic and the humor is so funny, especally when it comes to Owen Wilson and Julia Roberts having some of the best performances i ever see. This is defently my favorite movie of 2017."
    },
    {
      "rating": "10",
      "text": "One of best choices of winter 2017. More than an usual feel - good movie, it´s a touching story about friendship, love, tolerance and self-accept. If you watch, do not forget a handkerchief."
    },
    {
      "rating": "9",
      "text": "I expected to enjoy this film, but I loved it! Wonder is such a heartwarming and entertaining film, with compelling characters that we can feel for. This is a film that you will find yourself feeling so happy and warm while watching it, yet feel so down when the characters get dragged through the mud. That is a wonderful (pun intended) thing and exactly what this film needed. We didn't need another sappy and cliched film, which it kinda became a little bit of that near the end. I really recommend Wonder. A"
    },
    {
      "rating": "10",
      "text": "Feel free to watch this movie. It is a masterpiece making you understanding some sides of life. I highly recommend it."
    },
    {
      "rating": "7",
      "text": "Good movie with a great message. Not too too mushy but definitely worth a watch with the family. NOTE: I have not read the book!"
    },
    {
      "rating": "7",
      "text": "It's a feel-good movie in every single aspect, too inclined to sentimentalism and emotional manipulation but it's expected in this kind of films, at least is never too cheesy and the message is good, especially taking into account the bullying.No one in the cast makes an impression except Jacob Tremblay (let's not waste that kid's talent) but everybody is fine and they make a good job. For a weekend it's great, it's forgettable yes but it works well."
    },
    {
      "rating": "10",
      "text": "Wonder contageously teaches us a lesson about being kind, in the book, Auggie does not look so good but in the movie, he looks better. What you look like on the outside does not count, your heart counts."
    },
    {
      "rating": "10",
      "text": "This is a great film of the book! It is a touching and inspirational story that illustrates love conquers all, and beauty is literally only skin deep."
    },
    {
      "rating": "7",
      "text": "I like how Steven Chbosky made an arguably unoriginal story into an original one. How he makes a story for each character is incredible to me. You're going to be hating the antagonist and loving the protagonists. My favorite scene was when Jack Will punched Julian in the face because it left you feeling proud of Jack for standing up to his friend. And the twist where Jack talks bad about Auggie behind his back left you feeling betrayed just like Auggie, and the ending made you feel redemption and it was a real tear-jerker."
    },
    {
      "rating": "9",
      "text": "judging people on appearance is so mean.  its better to talk about it behind their back so no one gets hurt.  this movie touched me in a touching way."
    },
    {
      "rating": "5",
      "text": "It is a good movie if you need to learn something about judging others and bullying, but the writing and the acting was just okay.  There was nothing that surprised me in the movie, nothing that moved me, I cry easily at many movies, but surprisingly didn't during this movie. Walked away thinking that it wasn't a waste of time, but also I really didn't need to go.  You might want to wait and watch this movie at home, unless you have kids or young adults that could benefit, and you don't want the possible distractions if you're watching the movie at home.  Went with my husband and a friend and we had similar feelings about the movie."
    },
    {
      "rating": "8",
      "text": "Wonder is a nice, enjoyable and fuzzy-feeling-left-after sorta film. In all honesty, I like every role that is presented in the movie, it makes me think the characters in the book must have been real fun.I would voraciously disagree with anyone who thinks that is same old spongy sorry sod like story that tries to wring out the tear ducts. In fact to avoid a situation like that, Auggie with problems while still being the center of the universe, the movie is divided off into pieces where his family and friends are given space to be explored. The aspects of school and student life - The overlooked elder sister, the estranged best friend, the jittery friend-to-be, the mother who sacrifices so much, the perfectly beautiful family with seen and unseen scars. It is so well done.There are no easy answers to some curve-balls life will always keep throwing us; but it is so much better to have people around us who care for our existence and are in a symbiotic emotional relationship that positively uplifts us. That is what this movie is all about - about memories, about love, about compassion, about family, about friends, about choices you make and the chances you take and perhaps a few more unsaid things I may have overlooked. I know not if I have convinced and helped you make up mind on what do about this movie, I were to end with here with one last suggestion - Don't judge things by appearances, at least try to be fair, and watch this movie. You'll know how you feel thereon."
    },
    {
      "rating": "6",
      "text": "choice between being right or being kind..Wonder With a mild tone from the background music to the execution, Wonder stands alone in its unpredictability and amusing pitch towards the concept, supported by a great cast with some of their best work especially Owen Wilson."
    },
    {
      "rating": "9",
      "text": "I think the message behind this movie is absolutely inspiring, and I think everyone on the planet needs to watch it. Personally, I cannot think of anything that addresses not just bullying but the bullying of someone that may look different than what people consider \"normal.\" It is great for this to finally be talked about in the open, and it shines light on something that also should be addressed more, which is bullying. It is awesome to see the perspectives of not just the main character, but everyone else in his life as well. Standing up to a bully is much easier said than done, but this movie shows the overcoming of fear to stand up for your friend at a tough age. The only thing that seems controversial to me is that the main character has a pretend face that was created by makeup artists. I almost wish a real person was used to show the real beauty of someone that defies the whole idea of what \"normal\" is."
    },
    {
      "rating": "7",
      "text": "EN: An interesting film from my point of view, it represents very well what Bullying is like in schools. Jacob Tremblay was able to represent his character very well.PT: Um filme interessante no meu ponto de vista, representa muito bem como é o Bullying nas escolas. Jacob Tremblay foi capaz de representar seu personagem muito bem"
    },
    {
      "rating": "10",
      "text": "Going on this adventure with Auggie in theaters was one of the most emotionally devestating things ever. I couldn’t keep my eyes dry. That’s what’s beautiful about this movie. Wonder is a story about a boy born with a facial deficiency who has been homeschooled all his life. His parents decide to enroll him in public school so he can attend the first year of middle school around other kids. However, at the public school he is teased and bullied to no end. Wonder is a heartfelt film that, albeit missing an original story, feels legitimate. We’re watching this in Chorus class today, and I couldn’t be happier to experience this again."
    },
    {
      "rating": "10",
      "text": "that was a wonderful movie. i'm from iran and i liked that so much. thanks from maker..."
    },
    {
      "rating": "7",
      "text": "Aunque puede llegar a parecer pretenciosa por momentos, es muy adorable y tiene un gran homenaje a la amistad dentro de sí misma."
    },
    {
      "rating": "7",
      "text": "It’s difficult to say too much about this sad, funny, poignant movie – could you call it sentimental? Yes. Emotionally persuasive with a touch of cliché? Yes. But, it’s warm, tender, and intelligently thoughtful too!  Movies and TV have become so cynical and ugly these days that it’s often all too easy to forget the importance of being reminded - just how essential human kindness remains.  R.J.Palacio’s perceptive novel has been transferred to the screen with professional production values - inviting us to look back and recall a gentler attitude and how important balanced human relationships are – especially to those less fortunate than most. It’s broken into segments that invite us to understand the motivations of many of its main characters and the complex intertwining relationships they have with each other – this is done cleverly and without feeling episodic.  Some may find it too saccharine (and at times it might be) but, it still made for a refreshing change and was good to be moved to tears by an encounter with human goodness instead of human trash.  This suffering world certainly needs more, and looking at the HUGE box office returns the suffering patrons agreed!Top performances from youngsters Jacob Tremblay (‘Room’ ’15) playing August (who, along with another child actor Jaeden Lieberher -‘The Conformation ’16) bring a professional innocence to their screen characters. Lovely Izabella Vidovic is marvellous as his patient but emotionally suffering sister. Most adult roles also add to this movies special appeal. Want to be reminded of how it could be? - this may just serve that purpose."
    },
    {
      "rating": "7",
      "text": "Wonder, a movie that without a doubt you will not want to miss. In it we see how August Pullman has to fight bullyng on the part of his own companions, overcome their fears and insert themselves into a world for the unknown and full of people who are afraid of their appearance and fear the different. Magistral the performance of Owen Wilson and Julia Roberts as parents of August and Mia to serve as support for this beautiful and emotional story."
    },
    {
      "rating": "10",
      "text": "I enjoyed this movie very much because of the story told about Auggie's life. He is a strong young boy who goes through something most people do not ever have to go through."
    },
    {
      "rating": "8",
      "text": "Fabio paneque    Wonder is Auggie is 10 years old and we can say that he’s a little different he suffers some facial differences and his parents decide that he’s ready to enter normal school who enters fifth grade, but he was still really excited to start school anyway because he never being in one only thing he did not expected that his face would cause so much tumult, but anyway with some time everybody accepted him the way he is.    I think the movie is really good in transmitting the character's emotional and the camera positions always helps on capturing that but while is a emotional movie it's still fun when you see him doing good and it helps us to learn to treat people better more often because sometim es it really impacts some people."
    },
    {
      "rating": "7",
      "text": "Every scene in this movie is designed to make you cry, and I'm not gonna lie, every scene in this movie made me cry.I love the way this movie focuses not just on Auggie, but on everyone around him. Everyone from his sister, his parents, his best friend, his sister's best friend, even the bully to a lesser extent, they all get a chance to be more than they would be in any other movie with this same story.While it definitely relies on very common tropes and clichés, and it can feel a bit emotionally manipulative (one particular subplot felt very forced just for the sake of tears), this was an very emotional experience that I highly reccomend if you just wanna watch something very, very sweet."
    },
    {
      "rating": "9",
      "text": "I knew the basic story of Wonder before I saw it and I assumed it was aimed at kids but I think its the kind of film that works well for both kids and adults. There's certainly a fair amount of food for thought, as it were. Unsurprisingly, it is quite sad and sentimental, although I'm glad to say that I didn't feel it was unnecessarily piled in sugary sweet emotions - it focusses on the childs difficulties starting at a public school and his reaction to being made fun of for his looks. I suppose it is perhaps a little predictable but I thought that it wasn't as tacky as it perhaps could have come across and also I thought that the main cast did pretty well in their respective roles, especially Jacob Tremblay as the main character, August aka Auggie and Julia Roberts as his mum. It deals with bullying, fear/shame and so on - important topics for adolescents certainly.Would I recommend it? yes I would."
    },
    {
      "rating": "8",
      "text": "It's amazing how well the film talks about the delicacy of friendship and kindness."
    },
    {
      "rating": "9",
      "text": "Una experiencia muy buena, es profunda y tiene un muy buen mensaje sobre el respeto."
    }
  ],
  "recommendations": [
    "the_perks_of_being_a_wallflower",
    "captain_fantastic",
    "miracles_from_heaven",
    "the_glass_castle",
    "lady_bird",
    "me_before_you",
    "i_kill_giants",
    "the_florida_project",
    "the_spectacular_now",
    "instant_family",
    "the_big_sick",
    "the_hunt",
    "freedom_writers",
    "christopher_robin",
    "collateral_beauty",
    "midnight_sun",
    "young_adult",
    "flipped",
    "about_a_boy",
    "the_fault_in_our_stars",
    "moonrise_kingdom",
    "the_book_of_henry",
    "blue_valentine",
    "all_the_bright_places",
    "her"
  ]
}