{
  "id": 2536,
  "title": "Woodlawn",
  "starring": [
    "C. Thomas Howell",
    "Sean Astin"
  ],
  "runtime": 123,
  "genre": [
    "Drama"
  ],
  "description": "Love and unity in a school torn by racism and hate in the 1970s. A gifted high school football player must learn to embrace his talent and his faith as he battles racial tensions on and off the field.",
  "releaseYear": "2015",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/BJ1XNBBEiqaCM4SQhHYTrWqCfn.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 10.0,
    "ending": 3.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 8.0,
    "funny": 5.0,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Waaaay to preachy for me. Even came with a 1888jesus20 number at the end for more info on hope and faith lol. Could have been a decent movie if they had dialled it back even just a bit."
    },
    {
      "rating": "10",
      "text": "I'm usually only luke warm about most Christian movies, but this one is really different.  I have to put it in my 10 most favorite family films list, in my top three best football films and the best Christian film I've seen.  Well acted, well casted with a great story based on actual recent events.  Really very moving and had me in tears through most of the film.  You can't help but feel different when it's over.  That's good film making.  Very highly recommended."
    },
    {
      "rating": "10",
      "text": "Woodlawn is one of the best movies of the year. The film transcends the stereotype of Christian movies that are poorly produced, written and acted (ie Nick Cage in Left Behind) with a movie that stands on its own as an excellent film (with star turns from C. Thomas Howell, Jon Voight & Sean Astin) that stays true to its message & does not compromise its values. Caleb Castille is brilliant & brave (ala Jackie Robinson's character in 42) against the demons of racism and intolerance. The plain truth is that all lives matter and that we as a society need to stand brave against what is socially and legally acceptable in a culture for what is moral, right and eternal. Excellent!"
    },
    {
      "rating": "10",
      "text": "Wow ...this movie is awesome. Throughout the entire production the screen is filled with hope. It's a very well done movie based on real life events. It's extremely encouraging, uplifting and sad (emotions run the scale during this film). Woodlawn proves that life is beautiful, when people are beautiful. There's weakness and much strength... there's separation and togetherness. There's hate, breakthrough and love. It's the kind of movie that we (as people) should be proud of. Hopefully we will be seeing more of these types of movies on the big screen."
    },
    {
      "rating": "1",
      "text": "An interesting take on the zombie genre, when you think about it. I'd welcome a muslim remake. Of course, we could use a judaic version too. Fanaticism isn't just a christian thing after all."
    },
    {
      "rating": "6",
      "text": "So I've been asked to pay up a dollar so I can see this movie. I was like... \"Why pay to see a movie when you can make a review of this movie for free?\" Plus, I bet there's some people with copies of this movie in their hands at least some. Woodlawn is too cheesy and predictable to end up in heartwarming, heartbreaking, and breathtaking moments."
    },
    {
      "rating": "10",
      "text": "The reviewer, “cqwt” is a dumbass. He let his feelings get in the way and that’s why he’ll never be an actual reviewer. Just an idiot. Same with, “mboner1”. Sorry... I guess?"
    },
    {
      "rating": "10",
      "text": "Excelent film, really inspiring. A really nice movie based on a real story, I recommend it."
    }
  ]
}