{"id": 4033, "title": "Words on Bathroom Walls", "starring": ["Charlie Plummer", "Molly Parker"], "runtime": 111, "genre": ["Drama", "Romance"], "description": "Diagnosed with a mental illness halfway through his senior year of high school, a witty, introspective teen struggles to keep it a secret while falling in love with a brilliant classmate who inspires him to open his heart and not be defined by his condition.", "releaseYear": "2020", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/mMICdcRBxiEUUpdAFCYRezE3Dy5.jpg", "categories": {"plot": 6.5, "acting": 8.0, "ending": 5.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "8", "text": "This is a drama about a teenager diagnosed with schizophrenia and his efforts to hide it from a potential girlfriend.  No, it is not as maudlin as that sounds, it is very well acted by Charlie Plummer with a good supporting cast  including Andy Garcia, Taylor Russell, and Beth Grant.  It is fairly realistic portrayal of mental illness and how difficult of a time care givers have dealing with the sufferer.  They also show the character being given different drugs that either fail or have terrible side effects.   The problem with mental illness is that is so difficult to get measurable results - that is, if your BP is 145/90 and the doctor gives you a pill and is now 120/80 the pill is working.  It is not so clear with treating mental illness.  And there is a quote (I'm paraphrasing) that really hit home for me:   \"if I had cancer, people would run to help me but if I have mental illness they would run away\".  I know from personal experience that this line is very true as a close personal friend suffering from mental illness said something eerily similar.  Of course there are \"Hollywood\" touches and clichés but I recommend that you see it."}, {"rating": "5", "text": "The better functioning of this film will depend on the criteria of each viewer, and I say this because of the way in which the audience will seek to digest the content of the story, since to me it seemed neglected, considering that in its attempt to make it friendly, I firmly believe it minimizes the effects of a mental disorder, in order to give function to its youthful romantic plot.It's not melodramatic and at least that's appreciated, but the facade of idealism will only take you so far, the rest doesn't do its job."}, {"rating": "5", "text": "(Mauro Lanari)It starts pretty well, then too many things take over: the inevitable biracial relationship, the atrocious Drew Barrymore, van Gogh's sunflowers, the theme of faith, the problem of socio-economic inequality with Maya and her family. Whereupon the classic problems of adolescence, beginning with the oedipal complex, prevail over schizophrenia, and mental illness is resolved into a narrative pretext in an attempt to differentiate the film from the usual coming-of-age story."}, {"rating": "10", "text": "One of the best movies which gives mental illnesses more human perspective. Big, Big, like"}, {"rating": "10", "text": "cok guzeldi.izlemenizi tavsiye ederim.sikmadan izlettiren bir film.puan kiracak bir seyi yoktu. fragmandan zaten ne oldugunu anlarsınız."}, {"rating": "10", "text": "I love movies that have an impact on your real life. You don't have to be schizophrenic to experience certain things. We have to realize something."}], "recommendations": ["swallow", "leave_no_trace", "disobedience", "joe_bell", "the_hunt", "the_reader", "the_miseducation_of_cameron_post", "secretary", "k_pax", "all_the_bright_places", "the_card_counter", "sweat", "ingrid_goes_west", "erin_brockovich", "philadelphia", "elle", "closer", "just_mercy", "the_impossible", "a_time_to_kill", "afternoon_delight", "shame", "i_kill_giants", "come_play", "the_mauritanian"]}