{"id": 4146, "title": "Work It", "starring": ["Sabrina Carpenter", "Liza Koshy"], "runtime": 93, "genre": ["Comedy", "Music"], "description": "A brilliant but clumsy high school senior vows to get into her late father's alma mater by transforming herself and a misfit squad into dance champions.", "releaseYear": "2020", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/b5XfICAvUe8beWExBz97i0Qw4Qh.jpg", "categories": {"plot": 8.0, "acting": 8.0, "ending": 5.0, "soundtrack": 6.5, "cinematography": 6.0, "familyFriendly": 5.0, "funny": 9.333333333333334, "action": 10.0}, "reviews": [{"rating": "3", "text": "this movie is terrible at every single aspect and despite being a dance movie, the movie has a horrendous choreos alongside with its music choice."}, {"rating": "10", "text": "It such an entertaining movie with all the humour and mainly dance ,the story is driven by dance and romance is happening from the dance which is one of the authentic thing in the movie ,the romantic couple is so beautiful and the dance team and the Quinn-Jass friendship is so lovely . The movie is full of dance entertaining stuffs just go for itReally loved it"}, {"rating": "6", "text": "Let start with the positive.  This movie is incredibly charming.  The actors are all great.  The story did all the right things, including throwing some curveballs out.  The writing is super fun.  Yeah, sounds like a real winner, right?  I just don't know what it was.  It might have been the color palette or maybe that a movie about dancing lacked any amazing dance numbers.  If I had just been in a different mood that day, I might have given this movie a B, but today, I am just giving it a C - If you’ve already seen all of the A’s and B’s, but you insist on seeing a movie, try this one out"}, {"rating": "10", "text": "Work It is my favorite dance movie, one of my top 5 favorite Netflix movies of 2020, one of my top 10 favorite movies of 2020, and one of my favorite movies of all time. The choreography was exceptional especially TBD's competition dance. Sabrina Carpenter and Liza Koshy's performances were outstanding. The soundtrack was phenomenal. The costumes were stupendous especially on Sabrina Carpenter, Keiynan Lonsdale, Bianca Asilo, Jordan Fisher, Nathaniel Scarlette, and Liza Koshy. The makeup and hairstyling was excellent especially on Sabrina Carpenter, Bianca Asilo, Keiynan Lonsdale, and Liza Koshy. The writing was terrific and very touching. This was an A+ movie."}, {"rating": "6", "text": "Aunque tiene buenas escenas de baile, la historia que nos cuenta no es muy original."}, {"rating": "8", "text": "\"Work It\" is nothing impressive, but is super entertaining with its comedy, dancing, acting, and romance. The storyline definitely could've used some WORK (hehe see what I did there?), but nonetheless it's a pretty enjoyable film. Props to Liza Koshy for her hilarious performance & the entire cast for their incredible choreography!"}, {"rating": "10", "text": "While the plotline may be more generic than I would like, the acting, humor, and the message it sends more than makes it up for it. It is a light-hearted and entertaining movie that brings a happy feeling that's sorely needed during these times."}, {"rating": "7", "text": "Sabrina Carpenter keeps Work It afloat despite its predictable romance and ending."}, {"rating": "10", "text": "So simple but really great!!!!I loved to watch this movie. Looks like they had a great idea of movie but the prodution was clearly small"}, {"rating": "5", "text": "Lubie nawet filmy o tańcu. chyba dlatego ta 5. Jakiś taki średni ten film, jak na taneczny."}, {"rating": "8", "text": "Although an enjoyable movie, Work It suffers in originality with a predicatble storyline that left you slightly unsatisfied by the movie's end. However, the movie doesn't stop you from smiling and cringing (which can be positive), and will get you dancing no matter if you can or not."}], "recommendations": ["burlesque", "step_up", "the_greatest_showman", "moulin_rouge", "mamma_mia_here_we_go_again", "begin_again", "almost_famous", "cats", "pitch_perfect", "hairspray", "grease", "yesterday", "sweeney_todd_the_demon_barber_of_fleet_street", "music_and_lyrics", "jingle_jangle_a_christmas_journey", "sing_2", "mary_poppins_returns", "stardust", "rio", "into_the_woods", "peter_pan", "mary_poppins", "ghostbusters", "pitch_perfect_2", "step_up_2_the_streets"]}