{"id": 273, "title": "World War Z", "starring": ["Brad Pitt", "Mireille Enos"], "runtime": 116, "genre": ["Action", "Drama", "Horror", "Science Fiction", "Thriller"], "description": "Life for former United Nations investigator Gerry Lane and his family seems content. Suddenly, the world is plagued by a mysterious infection turning whole human populations into rampaging mindless zombies. After barely escaping the chaos, Lane is persuaded to go on a mission to investigate this disease. What follows is a perilous trek around the world where Lane must brave horrific dangers and long odds to find answers before human civilization falls.", "releaseYear": "2013", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/1SWBSYJsnyhdNRfLI1T6RsCxAQ4.jpg", "categories": {"plot": 5.142857142857143, "acting": 5.78125, "ending": 5.7, "soundtrack": 5.0, "cinematography": 0.0, "familyFriendly": 6.0, "funny": 6.2, "action": 6.608695652173913}, "reviews": [{"rating": "1", "text": "For those who DIDN'T read the book: Go ahead, watch it, give money to a genre that I enjoy.\rFor those who DID read the book: Go read the book again, you'll only be sitting in your own anger at the theater. WWZ The Movie is nothing like the book. The movie and the book have exactly 2 things in common: the title and the patient zero hypothesis."}, {"rating": "9", "text": "This is not a horror film, not really a zombie film either.  It's a plague film, and any gore porn fan will be disappointed to find that this is not a scary zombie film filled with guts and gore.  What you will find is a very good story, a well paced and thrilling romp through the mind of a survivor.  The story is solid, and has many harrow and life affirming moments for many of the characters.  Brad Pitt does a very good job in this film, and seems less plasticky than he does in some of his other films for me.  I really liked the gasps from my fellow audience members, and the fact that I was on the edge of my seat during certain parts.  I appreciated the lack of gratuitous gore, as it would have distracted from what this movie is really about, which is the human condition and it's ability to adapt and survive.  It certainly made me want to go home and throw together a doomsday backpack of my own."}, {"rating": "4", "text": "So far removed from the original story by Max Brooks that it shouldn't even share the same name, so far from it in fact that i had to try and dissociate it from the book and appreciate it as the movie itself. Standing on its own this movie is a mediocre zombie film with some reasonable acting and effects, but with virtually no story and many stupid and massive plot holes. How could they of possibly spent £130 million on this movie? its ridiculous.\r Overall im very disappointed by this film, being looking forwards to it for ages as im a big fan of the book. I would definitely suggest staying away from this film if you are fan of max brooks or just a zombie movie fan in general."}, {"rating": "3", "text": "It's absolutely awful. It takes nothing from the incredible source material authored by Max Brooks, discarding it as if it's irreverent. I've been waiting for this film for the last seven years, but i've got to say, I am incredibly disappointed. That said, Brad Pitt puts in a decent performance as the main protagonist ('Gerry Lane, a UN worker), and some of the scenes work well. Where was Yonkers?"}, {"rating": "6", "text": "It has its moments, but they're not enough. The script falls short in places, and it needs more emotion. The film does offer us effective suspense and tension in several scenes, and it will be a good film for zombie fans."}, {"rating": "5", "text": "Not a fan of zombie movies but I asked if Mr. Pitt had the main character look, but I was disappointed, no more than an average movie, even better and more exciting I've seen in this genre."}, {"rating": "0", "text": "A lot of people have explained why this movie is horrible based on the characters and plot, and in relation to the book. I have nothing to add to this line of argument.My review is that even if this weren't the case, and if the story were solid, this movie is utterly unwatchable due to its insanely frantic and random cinematography and editing. Nothing but spastic, close-up, 2-second shots from a bunch of random-ass perspectives, in order to create a manufactured sense of frenetic energy (which end up coming off as totally flimsy and cheap). I couldn't stop comparing this spastic piece of crap to the original (brilliant) \"Dawn of the Dead\" as I watched it, and yearning for just ONE damn scene with a sense of pacing, and gloom, and contemplation. This movie is completely tone-deaf and confused as far as the genre it's going for.  I absolutely hate movies like this. No contemplation. No wide shots. No subtly. The **** camera NEVER stops shifting around and shaking up and down and side to side. It's like what a zombie movie would look like if directed by Michael Bay; but even Michael Bay probably would have done a better job than this. Absolute garbage.Surprising, since the director has actual made a few pretty good movies."}, {"rating": "6", "text": "The visual effects isn't for gathering crowds but is a concern of their own, the storyline, nowadays, that is rare.World War ZSo, poor zombies have been through way too much. By now we have seen them basically every way and everywhere- that's not true. Back then when they started as a witty and witchy horror spectacle to when they were boiled to a mindless harrowing personality to just simply being mindless. Somehow as time travelled, the numerosity became their identity and the only strength they posses. While this is of course not the reality- in a comic con language obviously- there are few spins that has tested well among the audience. Comic being the major one. And then comes this Marc Foster project or more like Brad Pitt project that takes it seriously.For they have a source, Marx Brooks whose book the film is novelizing has managed to come up with a solution that is not a headshot or a parody. And as far as that \"novelization\" genre is concerned the film aces on all levels. The character gets enough room to spread their legs and walk as slow and act as they wish to. And that is the only section where this summer blockbuster is different from any other punching bag game show.And what's medicinal to the film is the concept itself. What they were endorsing about. Very few times do we get a product that gets the identifying quality of it on the spot. And for that scene- you'll know which one am I talking about- this war is worth it. Speaking of it, the title is almost too perfectly titled. The zombies were never previously shown so passionately. Their aggression is their hobby and not something that they are slave of. And hence emerges this description of brutal insensitive images that are painted horrifyingly by the CGI artists where they whispers World War Z instead of screaming."}, {"rating": "0", "text": "\"World War Z\" is a perfect example of how to turn a very good book into a total nonsense, spending in the process a few hundred million dollars.\r The score of 1 is just for the reference to the book. Otherwise it should be ZERO. Or less."}, {"rating": "2", "text": "I sat down to watch this movie with no expectations whatsoever, but it was hard to ignore the fact that this is not a zombie movie at all, because, you know there are some indications in the title that led me to believe that this in fact  will be a zombie movie, so I'll stick with that from now on.\rI did not red the book, I merely saw this sorry excuse for a zombie apocalypse movie  a genre that I love and cherish  as it is. I grew up on George A. Romero's zombie movies, the ones with sluggish undead people craving for human \"braaainz!\". I realize of course that that type of monsters are too slow for our modern movie munching society but consider this, if the British were managed to make a fast paced zombie movie with great action scenes and compelling story from a marginally smaller budget (28 Days Later), then why could not the Americans achieve the same?\rThe protagonist  the average male figure who is just looking out for his loved ones  is common enough in these movies (and video games of the genre), but this movie failed to utilize him the way it meant to be. We got Brad Pitt loosened on a wild goose chase across continents and countries achieving virtually nothing, and without skills relying on sheer luck to survive and magically save the whole world at the end.\rThe story was not engaging and the climax came too late to stimulate my attention, although it would have been great for a family drama, but clearly not for a thriller/horror show.\rMy verdict is that this movie is a one time popcorn movie which did not deserve the £13 fee I had to spend on it."}, {"rating": "0", "text": "BRAD PITT COLLECTS ANOTHER PAYCHECK ....and audiences continue to get dumbed down into paying for lazy trash like wwz\r don't expect to be horrified, expect to be bored and annoyed"}, {"rating": "7", "text": "I want to start by saying that overall I enjoyed the movie and thought it was pretty decent. Having said that however I also feel there was just a ton of lost potential. First, there are some pacing problems. Several scenes are overdone (e.g. when they sneak past a zombie) and some are rushed (e.g. the ending). Secondly, the first half of the film was extremely good especially as things in the world were going to hell. But it seemed to fall apart a little when Pitt started just flying all over the world. Finally, I think the movie suffers from a lack of identity because it wasn't really a thriller or horror and it seemed to try to do a little of both to no real success. So yeah... just a lot of lost potential which was disappointing because I really looked forward to this movie. It was good but not great."}, {"rating": "1", "text": "This movie is an excellent example of how hollywood ruins everything. The book was a New York Times Best Seller for a reason, but this movie is just awful. Even if one ignored how much the movie deviates from what made the book great, the movie alone is pretty bad. The zombies are a joke  terrible computer graphics, and they transform way too quickly. There's a reason this movie isn't doing well and had to have the third act re-written and re-shot. Save yourself from disappointment and read the book instead. It'll be much more exciting, tense, rewarding and ultimately fulfilling."}, {"rating": "9", "text": "This movie was one of the Brad Pitt's fine ones for now. Even though it was not really a parallel, complex and confusing movie yet the CGI and SFX was really a great job. One thing that really good about this movie is how they raise this \"Geo-politic\" issues that happened now. But, even though this zombie war in epic scale movie was great enough for zombies align movie, still no such thing as memorable things and the solution was really cleared in the first state."}, {"rating": "6", "text": "What World War Z has going for it is a massive, global scale outbreak, a variety of infected, and some nice dialogue sprinkled throughout the film. What brings that down is that the story is basically focused on the zombies, they don't utilize a great actor, the story is frankly dumb sometimes, and there aren't any characters to delve into. I like Brad Pitt, but for being the lead and the most focused character, there simply isn't much to him or anyone else in the movie. With that in mind there are definitely some enjoyable scenes that are shot very well. I left the theater just not caring about anyone that I saw, there is no human connection to the film other than Gerry (Brad Pitt) and his family. The action is good, the scares are present, and overall the movie is focused on the zombies and finding a cure. At times it's a pretty generic story set up, but there is a light at the end of the tunnel and some scenes shine."}, {"rating": "8", "text": "World War Z aces as a thrilling action flick with good acting and great action sequences, however, it isn't scary for a horror-action fil and emotion lacks its necessary limelight."}, {"rating": "6", "text": "When the first World War Z book was published it took young readers by storm and climbed to the top of the New York Times Best Sellers list. It was destine to become a movie, especially now, with the popularity of zombies, but ultimately, the highly anticipated film fails to deliver anything different. U.N. Employee, Gerry Lane (Brad Pitt), is out with his family when a recently discovered virus hits the United States and all hell breaks loose. The first 45 minutes of this film were literally like the pilot of The Walking Dead. No one knows what's going on, people are panicking, it was all very predictable. The film does go into a different direction after that, but how many different ways of doing a zombie film are there? Lane starts traveling the world seeking a cure for the disease, while at the same time trying to avoid being attacked. The unfortunate fact is that no matter how good the acting or the writing, there is very little you can actually do with a zombie film. The zombies and the circumstances behind the outbreak are always a little different, but ultimately it becomes about survival or the race to find a cure. Brad Pitt is terrific, and as I have been saying for year, it doesn't matter how good looking the guy is, he belongs in action films! This is the genre where he excels and even though World War Z was painfully predictable, Pitt makes it worth watching. He is the focus of the story and it takes a lot of quick thinking and tremendous stunts to keep him alive. For me that was the best part of the film. There was a lot of hype behind World War Z and it was a very intense film, but like I said, there is very little you can do with an end of the world/zombie film that hasn't been done over and over again. While some what entertaining, World War Z is ultimately just another copy cat."}, {"rating": "6", "text": "OK I am not going to be a geek and analyse the film or point fingers at the direction or anything like that or give away the plot. Basically, this film is better than man of steel in that it's more involving but doesn't have the mega FX.  It's a pretty cool story, but not one you really want to think too hard about otherwise you will start thinking 'well why didn't he just....'  Brad goes off on a mission to save the world and he does a good job, the zombies are both scary as hell but gore-free more or less and weirdly 'family friendly' as they both race around and shuffle and jerk in the time-honoured zombie style. The whole thing is a bit like a adventure video game come to life.  Def one to see on the big screen."}, {"rating": "6", "text": "At one point, I honestly thought Hollywood had lost all hope. Then when I found out that this is based on a book, i was really shocked. After watching this, i was really surprised that it was better than I thought it was. But it barely says much. Most of the time it has its moments. It's an unoriginal story, but with some good elements. The ensemble may not be the best in a movie like this, (I mean, lets face it,  who expected Brad Pitt to star in a zombie movie) but it surprisingly works. The movie does slow down at times, but overall, with it's strange and unoriginal idea, it's still a decent movie."}, {"rating": "6", "text": "As far as thrills and suspense go, it delivers. But originality, not at all. Also the PG-13 rating does make it feel pretty nerf. Its a good summer flick but nothing more."}, {"rating": "6", "text": "Sure, it's not the freshest movie to come out this year (The zombie fad, like zombies themselves, never dies) but it's a fun movie to see and it will keep you entertained the whole way through."}, {"rating": "5", "text": "Not the best zombie movie I've seen but definitely worth a watch if you got no other choice. Quite predictable and open ending... I wonder if there is going to be a second part... probably yes."}, {"rating": "6", "text": "I am not actually sire if I liked or didn't like World War Z. Sure it has great special effects and it has great action scenes and yes it has action from the very first moments, but the vaccine of the virus is completely ridiculous and the the film is made in that way that it seems to be a true story. Couldn't stand that if you have a disease like cancer or something else the zombies won't kill you  Zombies can understand if someone is sick.. ok.... Something that I really liked was the plane scene. That was a good one. In general watch the movie but don't expect something really good. That's what I have to say. If you like Walking Dead you will like the movie ,but there is no comparison between the two of them!"}, {"rating": "6", "text": "Your enjoyment of World War Z doesn't hinge solely on your enjoyment of the book which it claims to be based on, but owes it to anyone who has read the book to disclaim \"loosely based\". That being said, if you've read the book beforehand, the trailers alone should let you know that the film is going in wholly different direction that Max Brooks laid out in his novel.\r I am a huge fan of the zombie franchise, which George Romero essentially put a patent on and dozens of films have branched off from over the years. What \"World War Z\" does is attempt to mesh the behavioral patterns of the \"28 Days Later\" infected undead (I refuse to call them zombies, zombies are the slow, shuffling Romero staple) with the essential ideas behind Brooks' book. It does this admirably, but it's a direction that ultimately didn't need to be taken in order to make the film successful. In my mind, it felt like a lazy way of telling a story that builds itself up, cutting time off of the reel in favor of a more fast-paced, energized film experience.\r Being a huge fan of the book, I refused to shell out the $10 to see it in the theaters; as I said, the trailers told me clearly that the film was going to diverge far enough from the book for me to lower my expectations. As a rental, and for what it is, it's nowhere near terrible. Remove all comparisons to the book it takes minor inspirations from, and Brad Pitt does a solid job of weaving his way through a decently scripted and constructed horror film.\r This ended up being Pitt's highest grossing film to date, and a combination of factors play into that, not least of which being a rather stale list of opposing options in theaters at the time of its release. Still, it's an enjoyable film, however far it deviates from the source material, and however ridiculous some of us may think calling something that runs a zombie. Could have been better...and could have been a whole lot worse."}, {"rating": "7", "text": "When looked at as a movie based off of the source material, fans of the book may be thoroughly disappointed by how thoroughly it disassociates itself from it. However, having said that, director Marc Forster is able to bring chilling suspense and swift thrills, coupled with gripping set pieces located in large cities, and tie it all together with impressive CGI and hard hitting action. Brad Pitt gives a terrific performance in the title role playing \"Gerry Lane,\" a former UN operative tasked with locating the source of the infectious zombie outbreak. All in all, Forster's solid direction alongside Pitt's usual stellar acting is another decent blockbuster addition the to the zombie entertainment genre."}, {"rating": "3", "text": "Give me a break, pitt survives a plane crash. The family in this movie made it tedious. Putting another star in a cage and giving him jibberish to talk at supposedly a south Korean base was complete waste. Why did the guy in the plane take off from Jerusalem? Who created the virus?, still don't know. Why put scenes of mass zombies at the end of the movie whats the point they would have been better at the start.  a pointless waste of talent."}, {"rating": "0", "text": "TERRIBLE! Just  terrible! This movie is an insult to fans of the book and author Max Brooks alike. Aside from the title and that it's a zombie movie there is nothing left of the original book/script in common. Brad Pitt and his studio can seriously go  themselves. The story would be laughable if I wasn't already so pissed off at this abomination. Even if you've never read the books I doubt you'll find anything to enjoy even as just a dumb popcorn flick. Honestly I'm pissed off as a fan of the book and cannot imagine how the author must feel to have his work just raped by Hollywood  Avoid at all costs!"}, {"rating": "4", "text": "I went into this movie expecting to be disappointed, with no expectations or hope. And yes here I am disappointed. This movie is drivel at best. Giant plot holes, cheap scares undeveloped characters and any reason for a $25,000 explosion. It was non-sense. I'm mainly disappointed in the execution compared to the novel this movie is apparently attached to. Threw the entire book into the air. It's as though not a single person who worked on the film read even the synopsis of the book. I suppose if I could get past that, I may have been able to see some entertaining value here. However all I could think was that I was watching a hero out to save the world, teleporting through meaningless shallow dialog and action sequences to inevitably give us a safe generic movie that is not worth your time. I'm sorry."}, {"rating": "3", "text": "If you read the book....Oh man, this was a horrible let down. You can read it in other reviews, the plot holes and clichés are numerous. Being a zombie fanatic, I guess, you really get few aspects of the post apocalyptic humans v. zombies scenario that I expect. I mean sure there are zombies and the world as we know it ends, but when the whole movie theatre laughs when a zombie gets a close up, it kills the essence of the theme. The movie attempts to be character driven but the acting and plot are just plain weak. On top of that, the story literally gets no where. Every new scene seems to be completely disconnected from the previous. I honestly cant think of a moment in the movie that awed me in any way. The positives to this movie are so minuscule. There really are no similar movies to compare this to, but if you have seen the show, The Walking Dead, the quality of screen play and emotions provoked from a zombie apocalypse do not even come close. 3 seems like it may be a rough score but as a fan boy, this movie was a true let down."}, {"rating": "6", "text": "Simple and typical may be what I may describe this movie. World War Z is good enough not to fall on the classification of lousy or awful. At least it does not drag; the movie is engaging and never ever slows down to cause the slightest bit of boredom. At best, it feels like what I imagine would be a perfectly well-made zombie video game adaptation. I'm sure that the movie has some intellectual or subliminal message hidden in and around the movie, or whatever message the writers want to convey. Whatever it may be, we could not really notice that since the pace of the film is fast and hyperactive. But at least it's never chaotic and messy."}, {"rating": "6", "text": "several points off for not being the book by the same name. But still A good movie on its own.\rWhat other studios bid for the rights to the book should be allowed to make that movie.\rThe Max Brooks book that restarted the Zombie Craze should be made."}, {"rating": "6", "text": "Zombies attack on a huge scale but I'm afraid there are no huge scares. 5 minutes into the movie and the fastest zombies ever are bashing there way across a city but immediately the lack of gore and blood is very noticeable. The 12A/PG13 rating really hurts as there is no pay off to seeing zombies killed as you don't get to see it! However the big set piece with zombies climbing a 100 foot wall in the middle of the movie is stunning and well done. I just hope the Bluray/DVD is uncut and we get to see some zombie heads get squashed properly."}, {"rating": "3", "text": "I'm not sure what I was thinking.  Zombie movies are not typically my type of film, but Brad Pitt has chosen (largely) good movies over the past few years, so I thought I'd give it a go.  I enjoyed the set-up, but as the film progressed, I just got more and more bored.  World War Z was World War Zzzzzz."}, {"rating": "9", "text": "World War Z is not a zombie film, it's an action-drama movie with zombie swarm against worldwide armies. I personally don't usually like horror movies because the plot is uninteresting and the characters act idiotically. If you are like me, you are going to like this movie because there is none of this. If you like gore, putrefy zombies and fear, there is none of this, but this movie have other qualities.\r The plot: this time it's not some young collegians trying to escape the building in the middle of a party, it's a worldwide pandemic of zombies that collapse most of governments, had already destroy half of mankind and threaten the rest. So the UN investigator Gerry Lane and best dad of the world must travel around the world to find a way to stop the ``virus``, alongside some allies, the most interesting being Segen, the short-haired woman soldier. the first two acts are of the same qualities: good to great. Big scale battle against zombies, few politics undertone and...people get kill by zombies. The third act is different from the rest and the ending maybe feel anticlimactic, but it's understandable because they remade the entire third act after seeing how bad was the original.\r The cast\rBrad Pitt as Gery Lane: a fifty-year old man playing the protagonist in an sort-of zombie movie is refreshing. Even better, his character isn't dumb. How brilliant it is to see someone in an sort-of horror movie doing clever things. But even if he seem stoical and used to carnage, he lack of personality. But that's not so important.\rDaniella Kertesz the israeli's woman as Segen, the israeli's soldier who go through hell with Gerry. She manage to get a place in the club of side character who get to be almost as attractive as the protagonist, even more for some. She doesn't have many lines of dialogue and come in screen at half of the movie, but her acting is...well, I came to care more about her than Gerry's family, or Gerry himself.\rThe family of Gerry: Who care about them?\r Generalities: The new, swarming-running are way more dangerous than the classic one, so the character don't have to act stupidly to get kill. The CGI effects are great, and this is maybe the clever zombie movie I ever watch.\r Best action part: big battle between armmies and lots, lots, lots of running zombies.\rBest other stuff part: Character (and I mean Segen)."}, {"rating": "10", "text": "This movie was by far the best  zombie movie ever, it had me on the edge of my seat, eyes locket to the screen. Everyone in the theatre was very interactive. And had our complete attention with the crazy action scenes. My favorite part is hard to choose. It made me sad, afraid, and happy all in about 2 hrs. The zombies looked great, the graphics were great. The story line made sense. And It had a satisfying ending. The Scene in Israel with the gate was awesome,  So was the plane scene, and ending scene in the Research facility was awesome. BRad Pitt played a loving husband and father,  striving to keep them safe.  Along with saving  lives  of many others. and i liked that he was just a regular guy, who observed the zombies behavior to come up with a solution  GREAT MOVIE  A MUST SEE"}, {"rating": "3", "text": "This movie was World War Z just in name. I lived the last years dreaming to see the Battle of Yonkers, and it never came up. The CGI was pretty amazing, but apart from that, everything else was just a plain old boring overused theme of zombie survival/apocalypse. The characters, even the main ones, did not click, did not reel you in with their charisma and atop of all... the zombies, the zombies felt just like an unstoppable giant rolling ball running towards every little sound. No human factor no nothing. It might as well been a giant ocean wave coming for Brad Pitt. Oh scratch that, they had already done giant waves, and it also was a fluke. In conclusion I would like to stress that the movie is a further testimony to Hollywood's destruction of great literature with slashes to the original story, flashy CGI and overpaid actors. Not a single link to the books and it brought nothing new and unprecedented features to the zombie genre. It was plain old boring.\rI am giving 3 points because of the effects and sincerely it is the first time i feel like wanting my cash back."}, {"rating": "0", "text": "BORING !!!\r ......NO SCRIPT......annoying characters out of aTommy Hilfiger ad.......and enough already with the hyper caffeinated zombies who can merge into \"wooshes of energy\" and CLIMB WALLS .......that hurt !.....come on guys- I`m not THAT stupid !.............I only wish that whoever wrote the half-baked script for this turkey had had a fraction of the energy and ability to focus as those zombies !.....and finally to all the people who gave this film 9s and 10s and found it A-M-A-Z-I-N-G  I say \"Please get A  Life"}, {"rating": "9", "text": "This was a very entertaining movie. I feel that they could've made the movie about 20 minutes longer and added more to the \"discovery and research.\" I hope the extra content in the DVD/BluRay release has the alternate endings and extra content."}, {"rating": "9", "text": "Ok..I read the book. It's not like the book. Calm down. This was a GREAT movie. Trust me. You will like it. Great popcorn movie. It's not like walking dead. Calm down.  I love the walking dead. I loved the book. And I LOVED THIS MOVIE. Brad Pitt does a good job. Lots of action. See it."}, {"rating": "9", "text": "Smart, immensely entertaining and terrifying to the bone. World War Z is what summer blockbusters should be, limited but intense action with a good story. You probably won't see a better action film this year."}, {"rating": "7", "text": "Relentless pacing. High production values. A desperate situation. It works well. And it gives you more beyond that: a special idea, well stated by a character with an inappropo amused gleam in his eye--that reframes the movie in 30 seconds.  And still more: irony. Very solid entertainment. I ran to the theatre men's room and back."}, {"rating": "9", "text": "I have not read the book so I cannot comment on any parallels or compare the two in any way, shape or form. So for those of you that think that \"the book is way better\" or \"this movie has not done the book justice\" to you all i see \"fair enough but i don't care\"\r I thoroughly enjoyed this movie and considering how much of a troubled production it has had, it has left me astounded that it has turned out so well.\r This movie puts its characters first. Unlike most Zombie movies, this one feels like it has purpose and lets you feel like you are on a journey with Gerry Lane. There is no real blood or gore in the movie at all and this serves the movie very well as it is a story of how will the human race survive this and focuses on the story elements it needs to in order to portray this.\r Its been a while since Pitt has been in a movie (that i have seen anyway) and for me he did very well and was a welcome return to the screen for him. Props too for him partly funding this movie himself if i am not mistaken to help it get finished.\r Hope this film does well at the box office, it deserves to be seen for bringing something fresh to a tired genre."}, {"rating": "3", "text": "Some decent suspense scenes but a real lazy script. Tons of holes throughout the film with characters so bland you wonder if Brad Pitt could have just been talking to cardboard cutouts the entire film. The main reasoning behind the cure is stupid it made just about half the theature laugh. Oh and the zombies teeth chomping got so stupid after seeing it over and over again."}, {"rating": "4", "text": "This movie is driven by a poorly defined, convoluted plot, mixed in with some semi cool action scenes and scenery. The zombies are cool for a while but become laughably goofy upon closer examination near the end of the film. I never read the books however I consider myself a zombie movie fanatic and this movie simply cannot be related with given the absolutely rediculous amount of luck brad pitt survives on(plane crash and aimless trek afterwards.... wtf.) Most of the characters that seem important are in the movie for 5 minutes tops, and the ones that are in no way important are there most of the movie. All said, don't go to this movie expecting a scary tale of a family surviving a zombie apocalypse, expect a weird, often humorous tale of a seemingly invincible man running around a zombie filled earth with no real defined goal. Expect a shallow plot and even shallower back stories, giving you no reason to care for any of the people in the story except for one handless girl who has no reason to even be in the film. Wait until it hits dollar theaters and prepare to laugh."}, {"rating": "3", "text": "World War Z is missing some zzzzzzzzzzz's it its title. Bland plot, Bland characters, Bland performances, even bland zombies.  There is no back story on how the disease spread, no back story on our main protagonist, it's just scenes smashed together to resemble something of a action flick. All the characters say and do stupid things..and the scenes come and go as quickly as you realize this movie was a waste of money. No emotional attachment to anything I saw on screen. 3/10. Wasn't one of the worst movies of the summer, but just ZERO to offer. World War ZERO. World War ZZZZZZ you name it. Be very cautious of the people giving it scores like 9's and 10's. This ain't no \"Thrill Ride\" \"Best zombie movie I've ever seen\". Go get the AMC series Walking Dead and you will find more character depth, action, and suspense in one 40 minute episode."}, {"rating": "7", "text": "World War Z is a film that has so much potential but 'decided' to become simply a film targeted at the teenage 'Resident Evil' crowd. Absolutely great set pieces are framed by a narrative that is too simple, disregarding the heavy morality prevalent in brilliant series 'The Walking Dead' in favor of large scale action. Sure these set pieces are pulse pounding and brilliant, Pitt still the always great leading man and all, but hey... where are all the nuances that made the original novel a masterpiece? Nevertheless, a very watchable film but just leave 'your brain' at the front door of the theater ;p"}, {"rating": "9", "text": "I was simply blown away with how amazing this film really was. It's safe to say it's up there as one of the best zombie films, but its also one of the more unique zombie movies that has been made as they put a real twist on the genre. Brad Pitt leads the way in a cast of no other real stand-outs as family man Gerry trying to get his loved ones to safety along with working out what started an outbreak. It had minor flaws but they were overshadowed by effective scenery & impressive CGI. Top stuff!"}, {"rating": "9", "text": "First off, I have not read the book, but I get what the general idea of it is. I went into this film with low expectations, with Brad Pitt being the main draw for me, but this film was fantastic! It more than exceeded my expectations and features an unusually smart script, a great performance by Brad Pitt, and surprisingly scary and intense sequences. But the biggest shocker of the film is that the PG-13 rating actually works! It forced the filmmakers to be more creative and focus on actual tension and horror, rather than a zombie in the dark chewing on a human arm. The characters in the movie actually call them \"zombies\" unlike every other zombie film where people say \"walkers\" or something along those lines. Overall, a really fun, scary, and smart film that constantly surprises you and, while it doesn't re-define the genre, it effectively freshens up the zombie film genre."}, {"rating": "8", "text": "Good summer movie. They should of made it R rated. CGI could of been better. Script needed more work. But with all that said, it will entertain you. The ending wasn't as bad as some made it out to be, just to abrupt."}, {"rating": "8", "text": "With a world-sweeping plot reminiscent of Steven Soderberg’s Contagion, an intense, kinetic pace tastefully interspersed with snappy dialogue, and a leading man, in Brad Pitt, up to the task of anchoring it all in the realm of suspended disbelief, World War Z may very well be the best modern zombie film yet to grace cinemas.\r To say it was an arduous task to deliver the movie might be this year’s movie-related understatement, and there have been  and there still remain  many doubts as to whether or not it would all be worthwhile.\r Based on the novel, World War Z: An Oral History of the Zombie War, penned by Max Brooks, the son of comedy filmmaking legend Mel Brooks and actress Ann Bancroft, the movie’s script went through several difficult and drastic alterations before filming wrapped in October of last year. Initially adapted in 2008 by sci-fi and comic book scribe J. Michael Straczynski, the screenplay went through a complete overhaul by Matthew Michael Carnahan, whose debut film, The Kingdom, delivered the kind of politically-infused action Paramount Studios and Pitt’s production company, Plan B, were looking for.\r For the rest of the review, please visit:\rhttp://tuffgnarl.com/world-war-z-review/"}], "recommendations": ["maze_runner_the_scorch_trials", "i_am_legend", "daybreakers", "chernobyl_diaries", "army_of_the_dead", "riddick", "underworld_blood_wars", "pandorum", "the_girl_with_all_the_gifts", "the_tomorrow_war", "28_days_later", "bird_box", "the_last_witch_hunter", "the_purge_election_year", "the_mist", "the_maze_runner", "the_book_of_eli", "monsters", "priest", "the_cloverfield_paradox", "surrogates", "independence_day_resurgence", "poseidon", "abraham_lincoln_vampire_hunter", "underworld_awakening"]}