{"id": 3784, "title": "Worth", "starring": ["Michael Keaton", "Amy Ryan"], "runtime": 118, "genre": ["History", "Drama"], "description": "Kenneth Feinberg, a powerful D.C. lawyer appointed Special Master of the 9/11 Fund, fights off the cynicism, bureaucracy, and politics associated with administering government funds and, in doing so, discovers what life is worth.", "releaseYear": "2021", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/xMFKTgRRCxfZGmFQVxBsQYAQufo.jpg", "categories": {"plot": 6.666666666666667, "acting": 6.545454545454546, "ending": 5.0, "soundtrack": 5.0, "cinematography": 8.0, "familyFriendly": 5.0, "funny": 5.0, "action": 5.0}, "reviews": [{"rating": "5", "text": "With material like this, what a shame to see it vastly underserved by a workmanlike script. Scenes written in cliches wasted opportunities to deliver these characters' stories with the specificity and power they deserved. What a disappointment, seeing this particular story manage to drag! Editing would have helped, but the script was too by-the-numbers to salvage this waste of such fine acting and (of course) material. (It even managed to muddy the waters re: our understanding of the terms re: \"worth\" that were eventually left to one scene, a good one but it couldn't clarify more than one aspect.)"}, {"rating": "3", "text": "bad[ bad ]adjective, worse, worst;(Slang) bad·der, bad·dest for 36.not good in any manner or degree."}, {"rating": "6", "text": "A number of documentaries have been released to mark the 20th anniversary of  9/11, but this is a fact-based drama that tackles a unique angle. Michael Keaton creates an involving performance as Kenneth Feinberg, who was assigned the contentious and unenviable task of compensating the families of the attacks. Much of the story involves efforts to cope with the variations on the basic rules, with 2 cases highlighted for a more personal aspect. While there are numerous testimonies about the effect that day, these grueling accounts seldom spark any emotion. The filmmakers alternate between the strategic political machinations and the complex human angles. Even though it lacks the emotional punch you’d expect from this subject, the film proves a fascinating look into this specific outcome from that terrible event."}, {"rating": "8", "text": "La tragedia del 11 de septiembre ahora como la base de un dilema moral, sobre si es correcto valuar las pérdidas humanas como si fueran objetos y el cómo hacerlo y ayudar a las familias en luto mas por compasión que por lucro. El mayor acierto es un Michael Keaton cada vez más maduro."}, {"rating": "6", "text": "''A flat fee would be another optionThe same dollar value for every loss of life.But those towers had CEO's and janitors.They won't all say yes to the same number. ''So even when they died exactly the same, their lives still have a different monetary value?Where some see lives, others just see numbers.Worth is a film that's certainly trying to make something clear, or really just to make a point.The subject demands to be critical, although perhaps it will depend on the viewers to have a preconceived idea about how it should be considering the story it's treating.The problem, regardless of the dramatic quality, is that instead of looking to make it incisive, the narrative gets lost in stretches because of the tiresome folly of loading the subject matter with melodrama, which inevitably detracts from what should be a more genuine emotional response.Needless to say, for that reason this film never progresses from being a completely basic drama.Among the latest Netflix releases, this movie can be considered quite decent. Anchored with a good performance from Michael Keaton, it's a good option. Just don't expect anything great."}, {"rating": "5", "text": "Fine performances by Keaton and Tucci, although for what it's \"worth\", the film itself was a bit of a slouch. While the film fairs well in capturing a true story, it fails to remain interesting and even the slightest bit intense, which was somewhat disappointing for such a powerful story. Sadly, I found it to be a bit of a drag."}, {"rating": "5", "text": "(Mauro Lanari)The movie revolves around a \"formula\" to compensate victims of 9/11: empathy vs. maths, humanity vs. economics. However, much more is missing than someone and something: Sara Colangelo never expands the issue, not even for a hint, to the value of the other cosmic entities (already only for paleoanthropologists, an estimate 120 billion human beings)."}, {"rating": "8", "text": "Good-1) Michael Keaton-good accent, good character work all around.  Love the scene where the camera focuses on his face for about 2 minutes, and he pretty subtly gives you the measure of all his thoughts from a series of uncomfortable micro expressions.\t2) Script-it must have been really hard to construct a compelling narrative from what seems like just a bunch of bureaucratic decision making.  I’m guessing they made a lot of stuff up in terms of interactions between the lawyers and the survivors, but they did a good job of it.  Some cliche driven scenes, but could be worse.\t3) Michael Keaton and Stanley Tucci- these guys are so good together and at their respective character types that, just as in “Spotlight”,  they should become the Crosby and Hope of procedural investigation films.\t4) The scene where they show 9/11 happening from the perspective of Feinberg’s (Keaton) morning commute.  Bad-1) So I’m sure the team working on the compensation fund was probably huge, with too many characters to develop if you want a cohesive story. And maybe the group was also originally super white,super male and super old.  I don’t know.  But when adapting true life material, if you’re going to add second tier characters that have to carry the burden of all your inclusion, please give them something to **** do and say.  And if the original team was not super male white and old there’s even less excuse.2) Feinberg’s wife was so great in her first scene, and then by mid way through the movie she doesn’t even get to sit next to him at the opera.3) More Stanley Tucci please. Always more Stanley Tucci."}], "recommendations": ["mark_felt_the_man_who_brought_down_the_white_house", "beirut", "sicario_day_of_the_soldado", "the_good_shepherd", "the_infiltrator", "no_sudden_move", "the_monuments_men", "morgan", "the_sum_of_all_fears", "white_boy_rick", "broken_city", "a_most_wanted_man", "a_most_violent_year", "suburbicon", "ex_machina", "nocturnal_animals", "the_social_network", "the_equalizer_2", "arbitrage", "21_grams", "enola_holmes_2", "chaos_walking", "body_of_lies", "the_hurricane", "the_big_short"]}