{
  "id": 4045,
  "title": "Would You Rather",
  "starring": [
    "Brittany Snow",
    "Jeffrey Combs"
  ],
  "runtime": 93,
  "genre": [
    "Thriller",
    "Horror"
  ],
  "description": "Desperate to help her ailing brother, a young woman agrees to compete in a deadly game of \"Would You Rather\" hosted by a sadistic aristocrat.",
  "releaseYear": "2012",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/uZQYjmEXeET1fOz1av7GYY7xENG.jpg",
  "categories": {
    "plot": 4.333333333333333,
    "acting": 4.314285714285714,
    "ending": 5.090909090909091,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 4.0,
    "funny": 6.0,
    "action": 6.25
  },
  "reviews": [
    {
      "rating": "6",
      "text": "Forget the critic scores.This movie is mostly enjoyable to horror movie fans. Not to bash the critics, but don't they read the movie description before watching? Wouldn't this line turn them off to the movie, or at least force these critics to put themselves in a horror aficionado's shoes while watching the flick?\r \"she arrives to find herself ... forced to play a sadistic game of Would You Rather, where only the winner will get out alive.\"\r The movie has a great premise AND original story with fine acting to boot (rare in a B-movie). Budget limits are effectively managed so that you barely notice the low budget impact. In fact, because some of the more horrific scenes are not shown they are more cringe-worthy as your mind gets to fill in the details.\r But the standout is Jeffrey Combs of Reanimator/From Beyond fame that plays the host of the WORST DINNER PARTY GAME EVER! He balances his sociopathic morality with a genteel propriety that makes his character stand out of the very-disposable extras.\r The twist ending is predictable and you wish the more dastardly character deaths were more horrific, but overall it is a very entertaining horror flick. The excellent Roger Ebert, God rest his soul, would hate this movie, but I would never use his reviews for horror movies."
    },
    {
      "rating": "5",
      "text": "Released in 2013, this is by far one of my favorite hidden gems on Netflix. I happened upon this movie one night while at my sister’s house, and it has became a Netflix favorite for me since. It is my go to movie when my friends and I can’t think of a fun horror film to watch. It’s not going to be the best horror film you’ve ever seen, but if you like anything similar to Saw, Hostel, or really anything with a torture porn feel, you’ll at least respect this.Starting out we meet protagonist Iris, portrayed by Brittany Snow. She’s down on her luck, trying to find a job anywhere to help take care of her little brother. We learn early on that her parents died in a car accident, and her brother is very sick in need of a bone marrow transplant. In a meeting with his doctor, Lawrence Gillard Jr., about the options they have, we are also introduced to Shepard Lambrick, Jeffrey Combs. Lambrick tells Iris that he has the means to help her and her brother, and all she has to do is attend a dinner party at his house the following evening. If she does this, he can pay off all of her medical debt, and find a suitable bone marrow match for her brother, and even skip all waiting lists. Skeptical, Iris asks Dr. Barden if this is legit, because I agree, it is kind of shady that a man you’ve never met is willing to do all of this in exchange for a dinner party. Iris decides to take the evening to think it over.Later in the evening, Iris receives a call informing her that she didn’t get the job she was interviewing for in the opening sequence. Desperate, she calls and accepts the invitation to Shepard’s dinner party. Arriving at the house, we meet the rest of the cast and learn that there will be a ‘game’ to determine who wins the money. Everything starts out fine, a semi-formal dinner party with good food and service, and most of the other ‘contestants’ seem nice enough.Trouble arises when Iris informs Lambrick that she is a vegetarian and doesn’t eat meat. He offers her ten thousand dollars to eat the steak and liver on her plate, which she reluctantly accepts. Let the games begin. From here on out, things get messy–literally. He challenges the group’s morals and integrity in a twisted game of would you rather. Some of the challenges include slicing open an eye, shocking each other, and basically drowning people. There’s so much more, and I love it. I think it is such a good example of what desperate people will do to get the help that they need.Jeffrey Combs gives an amazing performance of the sadistic ring leader of the game. He is unapologetically cruel and comfortable with what he is doing. He is funny and carefree. He loves seeing the group squirm, and he isn’t afraid to invoke violence on those who need it. Brittany Snow gives a warming performance of Iris, the naive girl who will do anything to help her brother. The rest of the cast is memorable, some more than others–I’m looking at you Enver Gjokaj. Some of the acting among other cast members isn’t great, but overall I think Combs and Snow do a good enough job on their own.You will care about the characters, you will want to cover your eyes, and you’ll gasp at the ending. You won’t be able to help but love Shepard Lambrick and his twisted mind. This won’t be a movie that wins any awards, and most people might not enjoy it as much as I do, but as far as Netflix films go, I think it’s worth the watch. Every so often you stumble across a good one, and this is it for me."
    },
    {
      "rating": "5",
      "text": "Honestly, this film is not good in a lot of ways. The script is a little weak, each character's decisions are predictable in every way possible, and the concept had so much more potential than what the film ended up being. But I watched this film with a group of friends and ended up enjoying it quite a bit. This is definitely one of those films that would be a bit of a disappointment if you watch it alone, but becomes far better if you watch it with a group of people."
    },
    {
      "rating": "9",
      "text": "Este filme é um dos melhores filmes de terror que eu já vi. Dá-nos violência, sangue, suspense e um bom final (um pouco previsível, mas bom). A história é original e o elenco é melhor do que eu esperava. É um must-watch!"
    },
    {
      "rating": "1",
      "text": "The premise of \"Would You Rather\" is superb; my praise, however, ends there. This movie is simply unpleasant to watch. The acting is, for the most part, sub-par; Snow, in particular, comes off very amateurish at times. From start to finish, the movie pushes the viewer away. The entire film is tense, cold, and hopeless, so, when the thrills come, and there are plenty (one of the few areas in which the movie did its job), they feel like little prods to the stomach while one is already experiencing bad indigestion. All the plot twists, and here I use the term lightly, are completely predictable. Movies like this are powerful because they let the viewer get close, even comfortable, and then pull the proverbial rug; \"Would You Rather\" lets all its nastiness hang out from the very moment the game begins. Movies like this also derive power from the close and complex relationships between their characters and their viewers; in \"Would You Rather,\" every time a character dies, it just feels like some awful statistic. This film is very unapproachable; even film franchises like Saw and Hostel are more approachable than this film. \"Would You Rather\" left a bad taste in my mouth, and, yes, I would rather have not watched it."
    },
    {
      "rating": "9",
      "text": "This film is for some reason one of the best horror movies that I have seen. It gives what the audience wants violence,blood, suspense and a really good ending, which was a little predictable but was still really good. The story was truly original and the cast was better than I expected. The whole movie was more sadistic than Saw and it was really shocking and terrifying  I even felt like I was playing that game. If you like the Saw movie you will love Would you rather. This film is one of the most disturbing ,yet entertaining and really good, movie and if you like horror movies this one is a must-watch"
    },
    {
      "rating": "7",
      "text": "'Would You Rather' is a smart and fresh new edition to the torture porn sub-genre  although it doesn't quite fit the criteria of 'Saw' and 'The Collection' but that not necessarily a bad thing, considering Saw was only focused on the deaths and gore, whilst this film focuses a little more on character, bringing more depth to the film. There are elements of 2012 horror 'Truth or Dare (Die)' here, expect Would you Rather is miles ahead on inventiveness, character and overall story. All i can say is that this is one hidden gem that should not be missed"
    },
    {
      "rating": "7",
      "text": "Low budget movie but with a very creative concept. You kinda knew what was gonna happen by the middle of it but this twist on saw (little bit) was fun to see. Its a good movie to watch from red box if one has some time"
    },
    {
      "rating": "0",
      "text": "Oh Jesus Christ!!!! Why do you people like it??? It was an unwatchable mess!!! Rubbish!!! When someone reminds me of that movie I am getting very angry!! Stay away!!!"
    },
    {
      "rating": "2",
      "text": "What absolute dross. Just a painfully bad torture porn flick with little to no real plot. Utterly predictable also, it doesn't take an idiot to work out what will happen to the main character and her brother from five minutes in. Some may find enjoyment, but I imagine that they are those with time to kill and low expectations for movies."
    },
    {
      "rating": "10",
      "text": "i've got to say, i've been hearing plenty of praise for this film, (in the horror circuit, of course), so, coupled with the surprisingly original premise, i was eager to see it... and... well... DAAAAAAAAYUM... this movie is superb. for starters, the acting, especially from jeffrey combs, is great, combs is both unnerving and interesting in equal measure as your otherwise standard crazy millionaire, brittany snow is a good lead, a monumental step up from prom night, sasha grey is good as amy, and whoever played lucas, (his name sounds russian), did a great job.\r and then, there's the fact that this film is SCARY, it is SUSPENSEFUL, there are very few jump scares, and they're mercifully not accompanied by an ear-piercing boost of volume, the suspense also has a good payoff as the things they end up doing are disturbing to watch, and right after it's over, the suspense comes rushing back, the violence is actually handled in a rather tasteful manner, it's not gratuitous, and yet the film manages to maintain it's shock value consistently.\r the way the film looks is also highly commendable, it is shot very well, the mansion looks amazing, (danny boyle could take a few notes), apparently, david guy levy's first film was terrible, if so, this is an incredible change for the better from this director, the script is also very well-written, it's admirably paced, tasteful, the dialogue fluctuates sometimes, but otherwise, it's well-written and incredibly well-directed.\r i seriously can't believe how underrated this film is, it's like ghost rider: spirit of vengeance all over again, if this is bad, and paranormal activity was good, then i will wear my lack of taste like a badge of honor."
    },
    {
      "rating": "10",
      "text": "epic"
    },
    {
      "rating": "8",
      "text": "I really liked this film.  The tension remains with you throughout the film, and the transformation of the main character was especially well done.  8/10."
    },
    {
      "rating": "7",
      "text": "Well, Would you Rather can not be one of the best movies of this year, but the movie has interesting ideas, the development is good and strong, the performances (in my opinion) are great, and the script maybe has some problems, but is good. Would you Rather is a good movie, not perfect, but is good."
    },
    {
      "rating": "0",
      "text": "I could write a better screenplay high on horse sht.........................................................................................horse sht."
    },
    {
      "rating": "2",
      "text": "This movie is bad, and that's a generous title. The only thing that was good was the main character's brother, who needs a bone marrow transplant. It wasnt scary, it was dumb. It seemed to repeat itself over and over again. Just your regular saw knockoff."
    },
    {
      "rating": "8",
      "text": "A really good independent Horror film is worth it's weight in gold. Finding that diamond in the rough makes the hours of sitting through low budget garbage, well worth it. For me, Would You Rather is that diamond, as it is one of the most imaginative Horror films to come along in years. Shepard Lambrick (Jeffrey Combs) is an eccentric millionaire, who wants to help people that are down on their luck, except there's a catch. With a large sum of money at stake, Lambrick invites several down on their luck people to his mansion, where they must play a game in order to win, a deviously twisted game. Would you rather stab yourself or a complete stranger? Would you rather take a razor blade to your eyeball or cut off your own finger? These are some of the challenges involved in this game, which sees the winner go home rich and the losers in worse shape then when they started. Jeffrey Combs of Star Trek fame stars and was absolutely the perfect choice to play the sadistic millionaire. In all his roles he has this crazy twisted side, behind the mask of a very likeable guy. In this film he is paired with the beautiful Brittany Snow, who is there to help her sick brother. As it turns out, she is the logical one, who tries to match wits with Lambrick, making for some terrific dialogue. Would You Rather is creepy and graphic, just when you think you have it all figured out, the story takes a twist, and you're back into the satanic paradise. This film is everything I look for in Horror and will definitely be included in my 2015 Halloween Horrorfest, and it should absolutely be considered for yours."
    },
    {
      "rating": "9",
      "text": "Very good movie. One of the best of this 'type'. You know the type, certain amount of characters are stuck in a room and they have to find a way out or solve how to get out. Similar films? Clue, Cube, Saw 2-7 etc. I found this film very enjoyable and the main 'villain' or well antagonize was hilarious. I'd say its worth a watch. It's not even full of a bunch of blood and gore either. Honestly, I think this movie deserves more love. I gave it a 9.\r Thanks for reading my review. Check it out if you're a fan of...\r 1. Horror films.\r2. So called 'torture porn' eh, I'm not a fan of that term because its honestly seen as negative but this film is more than just people getting tortured. Hope that didn't turn you off from the film.\r3. Characters in a room films. Seriously, I don't know what to call these types of films. Remember the Twilight Zone episode Five Characters In Search of an Exit? I like stuff like that. A bunch of characters stuck in a room and they have to figure out how to get out of the room. Well in this movie they have to play a game. You like the SAW films? Hey you might like this. Or maybe you won't but I still say its worth checking out."
    },
    {
      "rating": "0",
      "text": "A movie that keeps you on the edge of your seat for something great to happen. That moment never comes. Predictably cheesy scenes and characters that serve no purpose."
    },
    {
      "rating": "5",
      "text": "\"Would You Rather\" was interesting, I found It's concept unlike any other. I guess you can say It's a good thing. It is shocking and has plenty of interesting scenes which all come down to the final scene. Which was good. I would not recommend the film, but I would give it a 3/5"
    },
    {
      "rating": "4",
      "text": "The movie was average at best! Not much build up with other characters which would leave kinda just asking why? Decent plot with a few twist that may suprise you but all in all not really worth your time unless you like torture porn in movies!"
    },
    {
      "rating": "7",
      "text": "When I saw the cast, the guy from My name is Earl, Ricky from Trailer park boys, and well... Sasha's Grey, I had very low expectations. I mean two hilarious actors and a porn star in a horror movie just didn't seem like it would work. After watching the film, I was pleasantly surprised. There's nothing really that stands out and the whole thing plays out rather predictably, but I still enjoyed Would you Rather. It's not scary in the slightest, but is entertaining to watch unfold."
    },
    {
      "rating": "8",
      "text": "I really enjoyed this film and don't quite get why many seem to hate on it. The plot is nothing original, but is delivered in a slick, intense and effective way, backed up by strong acting and some nasty but gripping and stomach churning sequences. The ending is predictable, but otherwise this is an enjoyable and classy horror, almost on a par to the original Saw film."
    },
    {
      "rating": "6",
      "text": "I watched this on the recommendation of a friend. It's a very simple movie; there's not much of a story. Would You Rather is about a group of people who are invited to a dinner party with the promise that one of them will win a sum of money if he or she wins a game. Obviously because this is a movie, this game of would you rather isn't going to be your average parlor game. What the contestants have to choose between is life-threatening, and only one person is going to get out alive. Since there's virtually no plot to the movie, it does feel like you're watching one !!+!+% up YouTube challenge at times, but what saves this movie from being completely unbearable is the twists that the host puts on the game. It does make the film rather unpredictable and incredibly intense. Many scenes had me cringing because of the grisly nature of some of the dilemmas. There are a few glaring issues with the entire premise; it is mentioned that this game is played yearly, so why didn't one of the winners call the cops after finishing the game? I mean you were held hostage for a night while you were practically tortured, and seven people ended up dead. I wouldn't call this a particularly enjoyable film, but if you just want a crazy and intense little movie, Would You Rather is a decent choice."
    },
    {
      "rating": "10",
      "text": "I absolutely loved this movie! I loved the plot and the cast. I think Brittany Snow could've done better acting and the guy who played Lucas in the movie did a really good job on acting. His part towards the end where he was forced to slit his eye gave me goosebumps all over. It was so nerve wracking just watching him. And when he actually slit his eye I just had to look away. The whole game throughout this movie was ****   up and I couldn't stand the fact that you legit had to do the choices when they were both harsh and terrifying. If it was me, and I had to choose, I would've just said no and would have rather had the servant guy shoot me than to continue playing that gruesome game. I was also surprised that Snow survived being held underwater for two minutes. I thought she was sure to die, but at the same time the main character really never dies. I wished that Lucas was the one to survive, it would've been a good twist. I didn't like the fact that Snow went through that whole death defying game for her brother just to go home and find out he's dead. He was dead right? I mean, it looked like he was, but he could've just passed out or something. Nevermind, he probably did die, it's just that Snow was screaming \"What did you do?\" and it got me thinking that he might've taken drugs or something and overdosed. But overall, I like the movie and had a good time watching it, no, to better phrase it, I had an exciting time that left me holding my pillow to cover my face. There ya go."
    },
    {
      "rating": "3",
      "text": "It's dull and pointless! What interest could be in such a game? There is no real choice and so no real challenge! People just are victims acting under threat, it doesn't make any intrigue! \"13 Beloved\" and its remake \"13 Sins\" - both are underappreciated - are much better, to say nothing about \"The Game\". THIS one is not about a game, it's about crazy and disgusting psychopaths taking pleasure in killing and torturing, and who on top don't look much interesting and much realistic! There is nothing here that looks much interesting and/or realistic!"
    },
    {
      "rating": "4",
      "text": "Simply put, this movie does not have much going for it. It'll be entertaining if you're in the mood for torture porn, but other than that, it has little redeeming qualities."
    },
    {
      "rating": "7",
      "text": "\"Would you Rather\" is an incredibly well developed movie that will have you on your feet all the way throughout the film, in addition; the amount of nervousness and goosebumps this innovative movie will give you is outstandingly terrifying. (Interestingly, I feel like the film could actually be a \"Black Mirror\" episode, this is due to the way the whole inner plot could be considered a large criticism towards society and the way money can change the identities of many individuals.) In addition, \"Would you Rather\" was directed by a \"pretty new\" film producer / director with a very low budget, but the movie still pays off with a very surprising final outcome."
    },
    {
      "rating": "9",
      "text": "I love this film. One night, I was bored, so I was just browsing through Netflix to see if anything caught my eye and the description, alone, was enough to peak my interest. So I put it on and loved every minute of it. It's not just your typical gore fest jump scare filled horror movie. It's a suspense filled film that dives into the psyche of mankind and shows just what kind of messed up things people can and will do just for the simple chance to earn whatever it is that they desire. Jeffrey Combs as Shepard Lambrick is delightfully twisted as you sit on the edge of your seat, just wondering what sort of torture this man is going to put these desperate individuals through. I'm honestly quite shocked that the critic reviews are so low, personally, but I highly suggest checking this film out if you're bored and looking for something good to watch to kill the time."
    },
    {
      "rating": "7",
      "text": "I enjoyed Would You Rather. I had heard from a friend, that it was an extremely deep and messed up movie. After watching it i was disappointed by the ending they could have drawn it out to show the obvious and horrible after story."
    },
    {
      "rating": "1",
      "text": "Really meaningless movie. Sick plot and so predictable ending. Best word to describe movies like this: grotesque."
    },
    {
      "rating": "7",
      "text": "\"Would You Rather\" dá o que a audiência realmente quer: violência, sangue, suspense e um bom final.7/10"
    },
    {
      "rating": "2",
      "text": "My friend convinced me to watch this film, he said the ending was sad and praised it. I was not hoping for Scream, just something for me to look back on and say \"Hey, I don't regret watching this.\" I regret watching this film. The premise is interesting, that's my praise. The bad stuff starts now. The acting: below average, it isn't atrocious, but it isn't good. The plot: boring and predictable, the twist at the end is so bad (I really can't think of any other words to describe it) that I wanted to throw a brick at the television. The sub-plot of Iris' friend who won the previous torture house goes to save her is so dumbfounding in its plot holes such as \"why doesn't he call the police?\" and \"why did he let her enter the challenge in the first place?\" Not to mention that he has no character so his death, which is treated as an emotional moment, is, well, not emotional. However, the worst offense of this film is the characters, the awful, boring characters. The largest problem I have with this film is how one-dimensional every character is. What gets under my skin is: if you take away one defining characteristic from every character, then who are they? Let me give you a few examples: who is Iris if you take away her brother who has cancer? Who is the alcoholic if you take away the part where he is an alcoholic? Who is the disabled old lady if you take away her disability? The answer is no one. now in a film fueled about us caring about characters an what they do, you need likable characters who we care about, not ones as one dimensional as there characters being summed up in one sentence.This is a long review but only because there is so much garbage in this film. If you like this film then that's fine, but it has a lot of blatant flaws. Just my overlong two cents (or pence where I live.)"
    },
    {
      "rating": "1",
      "text": "Giving it a one means giving it more credit than it deserves. This movie has plot elements straight out of a adult film you would see on playboy. It was full of static characters who's actors seemed to be constantly yearning for the end of the shot they were currently in. The SAW themed ripoff is almost as bad as Ratatoing. The storyline is as bland as a cardboard saltine dipped in water and left to set in the sun through the fall of the roman empire. I had to use the torture device they used in the movie to force myself to watch this heaping pile of garbage. I hated this movie almost as much as that emoticon filled mess called The Emoji Movie.  I would not recommend this to my worst enemy. I can't explain enough how much I despise this THING. There is almost no story progression and it almost seems as if the director wanted to sneak a porno out to the general public. Once again, this is a terrible movie that should never have left the cutting room floor."
    },
    {
      "rating": "5",
      "text": "Torture porn with an actual porn actress in it as a woman needs money to save her sick brother, plays a dangerous game set up by a warped family, wins it but her brother killed himself anyway whilst she was playing."
    },
    {
      "rating": "3",
      "text": "I don't think Would you Rather is bad as some people say, but there is definitely some glaring flaws. First, the characters. I think the actors do a good job at portraying the fear and anxiety of being stuck in a death game. But I felt as if the characters had some room to be fleshed out with their backstories and motivations.Next, the at sometime confusing directing. For Example, the set up for Dr. Barden going to crash the death game is completely pointless. They take multiple scenes to set it up but there's little to no payoff as he's offed practically as soon as he arrives at the manor. Earlier in the movie there is a scene where Iris, the main character helps another one of the characters, Linda into a building. This literally sets up nothing besides a wave between Iris and Linda I guess. Which also does nothing. Those are just some specific examples of pointless scenes, but there's plenty of them across the film. Then the barrel round seems very contrived. If I were them I would take the barrel any day. The average person can breath underwater for 60-90 seconds. I believe it's a much better option than a random punishments. But at some points I did like the at times slower paced parts which  really makes me feel for the characters.Lastly, the ending. To me the ending is extremely unsatisfying to me. It almost makes the main plot as pointless as the Dr. Barden sub-plot. It feels like it's sad just to be sad and it doesn't feel satisfying to the viewer.  There's little to no previous foreshadowing and comes completely out of left field. I feel as if it isn't a good twist and it could of been handled better. If It would've been handled better I would of at least felt more satisfied at the ending. But I think a more bitter-sweet ending where Iris' brother survives would've done the best. An ending where they play into the aftermath where she saves her brother, but she has to deal with the trauma and survivor's guilt of being the winner of death game. Her brothers alive, but at what cost?"
    }
  ],
  "recommendations": [
    "shut_in",
    "brightburn",
    "awake",
    "unfriended",
    "house_at_the_end_of_the_street",
    "stay_alive",
    "devil",
    "chernobyl_diaries",
    "unfriended_dark_web",
    "escape_room",
    "frozen",
    "better_watch_out",
    "happy_death_day",
    "saw_iii",
    "bird_box",
    "paranormal_activity_the_marked_ones",
    "old",
    "dark_skies",
    "mama",
    "paranormal_activity_2",
    "a_perfect_getaway",
    "countdown",
    "limitless",
    "next",
    "the_strangers_prey_at_night"
  ]
}