{
  "id": 25,
  "title": "Wrath of Man",
  "starring": [
    "Jason Statham",
    "Holt McCallany"
  ],
  "runtime": 119,
  "genre": [
    "Action",
    "Crime",
    "Thriller"
  ],
  "description": "A cold and mysterious new security guard for a Los Angeles cash truck company surprises his co-workers when he unleashes precision skills during a heist. The crew is left wondering who he is and where he came from. Soon, the marksman's ultimate motive becomes clear as he takes dramatic and irrevocable steps to settle a score.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/M7SUK85sKjaStg4TKhlAVyGlz3.jpg",
  "categories": {
    "plot": 6.868421052631579,
    "acting": 6.083333333333333,
    "ending": 6.461538461538462,
    "soundtrack": 6.0,
    "cinematography": 7.8,
    "familyFriendly": 3.0,
    "funny": 6.5,
    "action": 6.606060606060606
  },
  "reviews": [
    {
      "rating": "7",
      "text": "My wife and I quite enjoyed this movie. It's incredibly well plotted and amazingly no other reviewer has pointed out the numerous nods to Michael Mann's Heat (1992) and his camera work.Definitely worth checking out- its a satisfying tale, although a little implausible in the era of near-cashless society."
    },
    {
      "rating": "9",
      "text": "First-rate revenge movie. Gritty, dark and violent, with a very satisfying narrative arc ~ it’s a man’s movie, like something Eastwood would make in the 70s, not everyone’s cup of tea but much better than I was expecting, and I was expecting a lot from the always improving Guy Richie and the great Jason Statham ~ who has become one of the biggest movie stars in the world right now. Everything about this movie was high brow and stylish ~ it felt like a GTA heist mission written by Paul Shrader and directed by Martin Scorsese. The lighting, camera movements, soundtrack, casting, plot twists, fire fights ~ the whole production values were A1 and the plot felt cohesive and felt all very grown up. Loved it. Bravo to all involved."
    },
    {
      "rating": "7",
      "text": "Wrath of Man is a decent heist actioner. It doesn’t have a lot of the witty banter director Guy Ritchie is renowned for but it does have a brooding intensity. Jason Statham isn’t in kick-butt action mode here - it is more about gun fights. Statham is Statham. The rest of the performances are great. Good to see Josh Hartnett in this sort of film. The movie Wrath of Man most reminded me of is Den of Thieves. It is not as clever in its twists and turns as that movie but if you want some good action you could do a lot worse. Recommended."
    },
    {
      "rating": "6",
      "text": "Very brutal but sometimes even interesting. I do not understand who might be interested in such a plot."
    },
    {
      "rating": "7",
      "text": "Director Guy Ritchie has crafted some of the best hybrids of Action and Caper films in cinematic history with “Snatch” and “Lock Stock and Two Smoking Barrels”. His latest film “Wrath of Man” for which he also helped write; focuses on a man named H (Jason Statham) who is given the unique moniker by his trainer when he is hired to work for an Armored Transport company.The Soft-Spoken H barely qualifies for his job based on his assessment testing, but when his shipment is hit during his initial run; he shows uncanny skills and deadly precision as he eliminated the robbers.While this makes him a hero at work; there are those who think he actually enjoys it and is hiding something.The film cleverly jumps a few months ahead and then backward before resuming the story as we learn more about H’s past and how he earned those skills and what is motivating the darkness inside him to strike back at all attempted robberies of his shipments with extreme prejudice.This all leads to an interesting confrontation as various elements and factions converge to make for a complicated but action-filled finale.The film is actually lighter on action than I expected as while there is a good amount of it at times, it is spaced out, and do not expect to see Statham using the fighting skills he has shown in “The Expendables:” “Crank” and “Transporter” series as he is happy to let his guns do the bulk of his action sequences.The film does drag in places as while it has a solid supporting cast with Scott Eastwood, Josh Hartnett, and others, cast members such as Andy Garcia barely appear in the film, and elements of his relationship with H are missing.H has an interesting backstory but it is never fully developed in a way that gives the audience a satisfying explanation. We know elements of who he was and why he is doing things but there are deeper questions that are left unanswered.I also kept waiting for a big twist or the trademark humor that is associated with many of Ritchie’s films which I believe was needed to fully round out this film.I can overlook some leaps of logic during the finale and at various points as those are necessary to make films of this type of work, but some of them just seemed like taking the easy way out and not offering even a rudimentary explanation.In the end “Wrath of Man” lacks the sustained action that fans may expect as well as the complex and gripping plots that are the hallmark of good drama.The film is an at times entertaining hybrid that does some things very well; just not enough of them to really make this one stand out.3.5 stars out of 5.Skewed and Reviewed"
    },
    {
      "rating": "9",
      "text": "This is a really well made action movie, well scripted, well paced and well acted. The cinematography is also really well done. Jason Statham gives a good performance as always, quiet and composed he portrays his character excellently. Like any Guy Ritchie film, it has a nicely crafted script and keeps you guessing through the movie, it has a good pay off at the end. One of the best films I've seen this year and more entertaining than most of the mindless popcorn flicks that Hollywood churn out."
    },
    {
      "rating": "7",
      "text": "I'm a Guy Ritchie and Jason Statham fan, so this was a no-brainer for me. Certainly not my favorite Ritchie movie, but I got caught up in the plot and the multi-pov way he told the story."
    },
    {
      "rating": "6",
      "text": "Wildly entertaining as long as you don't think about it too much. Great action scenes, plenty of double-crosses. Revenge is a dish best served cold.  I enjoyed this movie more than I care to admit, but I sure hope to see something better this year."
    },
    {
      "rating": "5",
      "text": "Some good heist moments, but it is so poorly paced and (randomly?) messy. Statham is good."
    },
    {
      "rating": "6",
      "text": "This story falls far short of the best Guy Ritchie can achieve in these fields.The tone for which he's quite known is there, but this time it feels sullen, somewhat disconnected, and that's compounded by Jason Statham's poor acting range, and the far-fetched script, especially when considering the simplicity of the events that unleashed the main issue.I wasn't sure I would give it all three stars, but I do it mostly because it works at entertaining despite its details.However, I can't help but emphasize that Ritchie feels stagnant again, considering that he came from delivering a film as fun and relaxed as The Gentlemen.There are worse, much worse options in the genre, and although that does not justify its weaknesses, its strengths are enough to differentiate it."
    },
    {
      "rating": "8",
      "text": "Expected worse, but I really liked the movie. The heroes cause real feelings of disgust and sympathy. There is some incomprehensibility at the end but still, the movie is worth watching"
    },
    {
      "rating": "6",
      "text": "A fun action movie with a lot of actors I like. It just has one big problem.The finale heist has no exit plan. The characters are fully aware they aren't all going to make it out, but they forget that if even one of them is identified the entire group is going down. These characters are shown to be family men, and are supposedly doing this for them, yet they almost go into this as a suicide mission.That's where it's stuck with me. Not really (actively) rewatchable with this, to me, glaring plothole."
    },
    {
      "rating": "10",
      "text": "It`s amzaing film. From time when we saw Jentelmans it`s the best what i saw!"
    },
    {
      "rating": "10",
      "text": "Great movie. I will gladly say one of ritchies best and also one of stathams. Great revenge/heist thriller with many backstabbings and plot fueled thriller"
    },
    {
      "rating": "8",
      "text": "‪I enjoyed the movie from the beginning to the end. It makes a nice balance of action, while still telling the overall story. It's so worth the watch."
    },
    {
      "rating": "10",
      "text": "Best action some great scenematic shot and new though character of jason and some new story"
    },
    {
      "rating": "0",
      "text": "An overly long movie. Terrible acting from everyone. Jason statue could be replaced by a maniquin. Awful script. Awful plot. Plot holes everywhere. What brainlet gave this garbage anything higher than a star needs his head checked. All my friends fell asleep or traded crypto the whole time. More concerning is the fact that reviews are faked on many sites; the movie they are discussing is not even this movie. Where there is bots posting reviews there is a trail of money. Someone knew this movie would tank and is proping up its corpse. Only good thing about this movie was seeing the naked miner from the Chernobyl series only problem was here he was playing an office worker and he had all his clothes on. Post malones cameo terrible acting aside was better than anything we were given in this movie. Ok bye."
    },
    {
      "rating": "4",
      "text": "Shockingly bad movie, nothing like Guy Richies other movies. Horrible acting, terrible dialogue. Very sad to see Josh Harnett come back to the mainstream for such a bad role. Zero redeeming factors, do not watch."
    },
    {
      "rating": "5",
      "text": "This is the first time that Jason Statham and director Guy Ritchie have teamed up since their series of edgy films in the early 2000s. Sadly, this outing has less of the snap and sass as their earlier collabs. Statham plays his typical stern silent type, who’s hired as a security guard for a cash transportation company. Of course, he shocks everyone (but the audience) when his truck is hijacked and he quickly dispatches the crooks. As expected, his real identity surfaces and things get complicated…but not very interesting. There’s an elaborate heist that forms the crux of the last act, but it’s not especially original. Ultimately, a film like this is about the action and this one is unimpressive. Ritchie’s typical sharp dialogue, snappy editing and frenetic violence are in short supply, leaving a bland caper flick with lots of noisy gun fights and a lackluster Statham."
    },
    {
      "rating": "5",
      "text": "This film follows an armored truck driver (Jason Statham), who happens to be a skilled assassin that has ulterior motives for joining the security company he's recently been hired for. Directed by Guy Ritchie (who also directed Statham in 'Snatch' and 'Lock, Stock, and Two Smoking Barrels'), the film pretty much delivers what anybody familiar with Statham would expect from one of his action flicks, for better or worse. In my case, I found the story rather convoluted, confusing, and hard to follow often times, and even during moments where that wasn't the case, the film was too busy being predictable. The film's beats always felt too familiar, with only a few moments of genuine thrill or unexpected turns to be found. Statham commits himself like always to this kind of role, but he's really just playing himself here again. Overall, some exciting shootouts can't fully make up for a predictable but also confusing and scattered storyline."
    },
    {
      "rating": "7",
      "text": "Neither Ritchie or Statham's best or most unique outing. Wrath of Man is still a solid thriller that isn't quite as paint by the numbers as it could have been.Quite enjoyable"
    },
    {
      "rating": "3",
      "text": "Doesn’t quite know what it is. Borrowed edgy shots sprinkled on a terrible action movie."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)I do not believe at all that the degradation of action movies comes from their video game origin and in particular from that of shooters. Instead, I suppose they are both satisfying the need for a surplus of adrenaline-pumping violence caused by an increase in the daily stress rate. Directors, actors and actresses adapt to market needs and even Ritchie and Sthatam are no longer an exception."
    },
    {
      "rating": "3",
      "text": "Its such a trash movie that even Jason statham couldn't carry the movie with pure action.There is no story no good characters no anything.Also feminism and racial appreciation trash ruins every movie"
    },
    {
      "rating": "7",
      "text": "The film started well enough. But it didn't take long for the plot to get a bit confusing. At least for me. The story actually starts jumping from the present to the past, where the past goes to the future, but still not to the present, until in the finale we get to the present again and I just believe I've already messed with your brain with this one. It probably doesn't even make much sense, and I apologize for that. I just want to say that it jumped around a bit too much here and there in different storylines in my opinion. I'm not saying the movie didn't make sense or anything. This is purely my opinion and my problem that I couldn't get my bearings a little bit here and there. The pacing also fluctuated quite a bit and not much happened for quite some time, but the ending made up for it with some awesome action. As for the story, it's good, just as I mentioned a bit worse timed. To sum it all up. The Angry Man is a good film for me to recommend. It kind of sounds like I'm bashing it here, but I'm not. I'm just mentioning here the biggest problem I had with the film. Otherwise, I was satisfied in the final analysis."
    },
    {
      "rating": "8",
      "text": "Mięsiste, męskie kino akcji pełne napakowanych testosteronem bohaterów. Główna historia może nie jest zbytnio odkrywcza jednak rekompensowana jest przez akcję"
    },
    {
      "rating": "8",
      "text": "excellent[ ek-suh-luhnt ]adjectivepossessing outstanding quality or superior merit; remarkably good."
    },
    {
      "rating": "9",
      "text": "Wrath of man movie completely follows the 3 Act Structure of screenwriting. The most compelling parts are the first act and third act that I enjoyed a lot. This movie never gets boring. It's full of suspense, tension, and action that will keep you watching.There are two stories going in parallel that come together in the 3rd act. There is betrayal and twists and the movie is dark.Jason Statham is brilliant as always in action movies. His character development was excellent. He is a kinda dark, serious, and cool character. He looks comfortable in his role.The use of panning shots is very well done in the first act. Good lighting, script, and acting. The supporting cast was quite good."
    },
    {
      "rating": "3",
      "text": "Some decent action and suspense at the beginning, but a third of the way in the movie starts treating the audience as complete morons, spelling every backstory beat out letter by boring letter, and believability unravels as glorified security guards for insurance purposes make ridiculous decisions to die to protect money while robbers decide to focus on anything other than robbing. It tries desperately to be Heat, but the gunplay and heist planning and characterization doesn't square up. Instead it winds up being more like Taken, with a better protagonist but just as ludicrous in the end -- actually, worse than Taken in some regards, because the ending isn't as satisfying."
    },
    {
      "rating": "8",
      "text": "Quality stuff.  Seems a bit like a couple of other LA robbery flicks, but the twist is welcomed...."
    },
    {
      "rating": "7",
      "text": "Another Richie/Statham joint. You get your bad acting, bad script, bad direction, and fun, over-the-top action. What's not to love? You get EXACTLY what you expect from this collaboration. They never promise more than they deliver."
    },
    {
      "rating": "8",
      "text": "I always like Guy Ritchie when he is doing his action films. He has a certain style that suits this genre. Sure, he seems to like doing his 'talky' crime thrillers, but some of his best work has always been in these type of flicks.  Wrath of Man is no different, a surprisingly great action film that combines the usual revenge flick with a heist film.  It was supposedly based on an older French film, but it feels fresh in my book, with some surprising twists and great action.  Worth a watch."
    },
    {
      "rating": "5",
      "text": "This one doesn't have the trademark Guy touch. No comedic bits, no surprise elements, nothing. Just a plain old B-grade revenge movie. Also, whatta hell was that ending, it was so bad that literally everyone in the theater talked about how shockingly bad it was as soon as it finished"
    },
    {
      "rating": "7",
      "text": "Jason is back. We missed movies from him like this. This is classic JS. Awesome movie."
    },
    {
      "rating": "7",
      "text": "Wrath of man is a well produced action thriller with an engaging plot. Overall i was impressed with the stylised shots and action sequences. The cast was fantastic but ultimately as well made as it was it is one of a thousand in its genre. For genre fans there is alot to like here."
    },
    {
      "rating": "7",
      "text": "I liked Statham movies, so this was a typical one - good action, involved heist, revenge, plot was interesting. Of course some nuances could've been twisted to make it even better but I saw it as a good movie - not the best ever or whatever, but definitely a good movie"
    },
    {
      "rating": "7",
      "text": "Szczerze mnie wciągnął. Nie wiem dlaczego, fabuła, a szczególnie końcówka totalnie poroniona, ale ogląda się przyjemnie. Lubisz naparzanki? Odpalaj bez wahania!!"
    },
    {
      "rating": "7",
      "text": "Wrath of Man classic film by Guy Ritchie. It's all done here, like Guy Ritchie does. It's his piece, and it's great. Yes, Wrath of Man is not as good as The Gentlemen. Here, in fact, Guy Ritchie moved away from several plot branches. She's alone here and as simple as possible. Jason Statham apparently begins to show his acting only when he starred with Guy Ritchie, after Snatch he did not appear in more than one major film of level A."
    },
    {
      "rating": "8",
      "text": "Not one of Guy Ritchie's Best, but still a great fast paced and well plotted movie. Starts of so strong and continues that way for most of the film. The ending was a bit underwhelming/ predictable for me and not the endings were quite used to with Ritchie. Still a great great watch that kept me locked in just not as good as some of his classics. So many great camera shots and the Cinematography was great."
    },
    {
      "rating": "7",
      "text": "The acting can feel a bit wooden, the characters have stupid names and do stupid things, the dialogue is kind of silly and doesn’t fit the tone of the movie, and the story seriously hinges on two burritos.However, the mood and the tone of this film is marvellous. Guy Ritchie combines a generic revenge and heist film but makes it work. Jason Statham is certainly in his element in this film."
    },
    {
      "rating": "8",
      "text": "it shall not just worth your while,so capturing so entertaining, I simply can't find anything wrong with it, but right the opposite, there a lot of things about it to like."
    },
    {
      "rating": "6",
      "text": "This is a bit of a mess of a film with inspired bits. Good to see less showy, more muscular action but much as I enjoy a rapid dispatch (no speeches always a good thing) I think some of the characters were discarded too carelessly - a shame because they were quite interesting parts played very well. I can think of far worse films to pass the time, but I did prefer Ritchie's previous effort, the Gentlemen."
    },
    {
      "rating": "7",
      "text": "This is a pretty basic crime action thriller film, with some good explosions/effects and plenty of tense moments. Its split into different parts, with a slightly confusing chronology but it was certainly an entertaining watch. The cast is decent too, with Jason Stathan, Eddie Marsan and Niamh Algar playing various characters. Slightly cliched perhaps but otherwise this is a decent thriller thats worth a watch if it sounds of interest, yes."
    },
    {
      "rating": "8",
      "text": "Посмотрел недавно \"Гнев человеческий\" и вот решил написать отзыв.Ну, что сказать. Фильм сугубо \"гайричевский\". Сначала мешанина, непонятка, какие то флешбэки, а потом постепенно пазл складывается в общую картину. Если кто то видел такие фильмы этого режиссера как: \"Большой куш\" или \"Джентельмены\" и они вам понравились, то и этот зайдет на 100%.Единственное, что я не понял, посмотрев фильм дважды, это то кем являлся герой Стетома до всей этой котовасии?  ;'-DНо ничего, есть повод оформить хет-трик!"
    },
    {
      "rating": "5",
      "text": "Худший фильм Гея Ричи в за всю его карьеру. Даже Король Артур был логичнее и веселее, чем этот типичный боевик со Стейтемом."
    },
    {
      "rating": "5",
      "text": "Lame, muddled plot. Camera shots too dark to follow. Ending is begging for a sad movie to give up. Poor effort of a descent premise and a lazy ending."
    },
    {
      "rating": "7",
      "text": "overall i liked the movie, it had great acting and great editing/directing. the script/story-plot, however, was not too solid, along with the action itself. the action scenes were a bit underwhelming and the story was a bit… morally contradicting. but still, loved the male lead’s acting and the way the movie was directed/edited. the movie employed a unique way of presenting its story that it kept me engaged even with its weak plot."
    },
    {
      "rating": "6",
      "text": "Wrath of Man is disappointing. It introduces an interesting plot with great music and cool camera shots but is never interesting or action packed enough to keep you from being bored. The first 30 minutes are enjoyable but then it goes into flashbacks for 45 minutes and introduces a completely different set of characters just to tie the story together. The flashbacks over complicate the story to the point that you lose interest. The flashbacks drag with the scenes lasting too long and not really adding much to the movie. In the last 30 minutes it all comes together with a climax that never really has enough tension and mediocre action sequences. I feel like this movie could’ve been better if it was just a fun stupid action thriller about cash trucks or telling the story without spending so long on a random group of characters and tedious flashbacks. I was very excited for this movie but Ritchie’s direction really didn’t serve the concept as well as I hoped."
    },
    {
      "rating": "7",
      "text": "This is a decent action flick but the narrative can be disorienting though the heist scene at the depot makes me a bit anxious."
    },
    {
      "rating": "7",
      "text": "It's a departure from Guy Ritchie's usual style as it's played more straight forward and serious, but it's a solid action-packed revenge story. It's just a premise we've been over-saturated with recently."
    }
  ]
}