{
  "id": 509,
  "title": "Wreck-It Ralph",
  "starring": [
    "John C. Reilly",
    "Sarah Silverman"
  ],
  "runtime": 101,
  "genre": [
    "Family",
    "Animation",
    "Comedy",
    "Adventure"
  ],
  "description": "Wreck-It Ralph is the 9-foot-tall, 643-pound villain of an arcade video game named Fix-It Felix Jr., in which the game's titular hero fixes buildings that Ralph destroys. Wanting to prove he can be a good guy and not just a villain, Ralph escapes his game and lands in Hero's Duty, a first-person shooter where he helps the game's hero battle against alien invaders. He later enters Sugar Rush, a kart racing game set on tracks made of candies, cookies and other sweets. There, Ralph meets Vanellope von Schweetz who has learned that her game is faced with a dire threat that could affect the entire arcade, and one that Ralph may have inadvertently started.",
  "releaseYear": "2012",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zWoIgZ7mgmPkaZjG0102BSKFIqQ.jpg",
  "categories": {
    "plot": 8.94,
    "acting": 8.9375,
    "ending": 9.0,
    "soundtrack": 9.5,
    "cinematography": 9.0,
    "familyFriendly": 8.0,
    "funny": 8.95,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Best movie I have seen in years. Funny quips, nostalgic video game characters, comedy for young and old, heartfelt story line. This movie has it all. Disney has a real winner on it's hands. I saw the movie 2 months before release and couldn't want to line up at a theater to pay my money to go see it again. This is a movie you will have to get on Blu-Ray and pause just to catch all the hidden \"easter eggs' if you will. LIke \"No Campers\" written in graffiti on the walls or coins coming out of Sonic when he gets bumped into. The very opening scene blows you away when you go from 2D view of the Fix it Felix Jr. game into the 3D immersive world. Ralph is a great hero to root for and Vanellopee is lovable and cute with just the right amount of feisty-ness. Over a great cast, many laughs, and a great ride into the world of video games new and old."
    },
    {
      "rating": "10",
      "text": "If you've read my other reviews, you are probably well aware that I love video games and movies.  This movie takes my two favorite things, and throws them into one.  Now the question is: does it work?  The answer is an absolute YES!!!  In fact, this movie is so good, that it is now one of my favorite movies of all time!  It is funny, has memorable characters, great animation, and the most original setting in the history of cinema.  I really have very little to complain about in this movie.  Okay, so there might be one or two little things.  For one, there are several video game characters that I wanted to see in this movie, but weren't there (seriously, Disney shows no love to Mario, Link, Samus or any other heroic Nintendo character).  Yes they did mention Mario at one point, but that doesn't count.  Also, I found the plot to be a little bit unoriginal, and predictable.  A super villain who wants to be good?  I'm pretty sure that's been done before.  It also follows a pattern that I like to call the classic Disney film plot.  In other words, if you have seen any other Disney movie, you can probably guess what this movie's plot is like.  Despite this, the original setting makes you completely forget about the plot.  This really is an excellent movie, and is totally worth watching if you love animation, movies, video games, an original setting, or just want a movie that has quite an adventurous feel behind it."
    },
    {
      "rating": "10",
      "text": "One of the best Movies I have seen in a long times, especially coming from the Disney Animation studio. If you're a video game fan, prepare to at least see the movie twice, or get it on DVD as it is loaded with cameos and Easter eggs. While the story is Disney typical, it respects the video games and even makes fun of itself in the process yet never straying too far from its roots.\r I'm going to go see it again."
    },
    {
      "rating": "9",
      "text": "Wreck-It Ralph is not Toy Story but the experience was the same. Video game references, colorful soundtrack and heartwarming story. Damn, it's one of the best animation this year."
    },
    {
      "rating": "10",
      "text": "WOW!, Wreck-It Ralph is one of the most amazing movies that I have the oportunity to watch this year. The story can sounds simple, but the magic of the movie start when you watching the cameos of all the famous characters that we know. The animation is really incredible, is like watch much movies in one. The screenplay can be the weak point of the movie, but don't have much importance when you watch a funny show, and Wreck-It Ralph is one of the most funny \"shows\" of this year. Amazing movie."
    },
    {
      "rating": "8",
      "text": "Cool and retro. Nice gags and has a great message. Not the best but very good. Why do they make so many wonderful animated movies these days but cannot get live action to get this good vibe to them. Wait for the end of the credits to see the Disney kill screen!"
    },
    {
      "rating": "10",
      "text": "Saw this movie a week after release with my girlfriend. Us both being gamers and suckers for anything that reminded us of our youth. we saw this movie expecting greatness, and what we got was better then that. If you love video games with a religious passion then this movie will make you cry tears of joy at every moment of it (ad we did). the animation, sound, voice actors and plot are all completely solid. i have no complaints about this movie and would gladly watch it again for double the price."
    },
    {
      "rating": "8",
      "text": "This movie was well done, compared to other video game movies that were very unsatisfying and unrelated to the games, technically, this isn't a video game movie, but an arcade movie. This movie had its funnies and didn't mess up. There is only one problem with this movie, because I'm a gamer, and that would be the limited video games showcased in the movie (around 3-5). I also dislike the main place where the movie takes place (Sugar Rush) it makes it seem like this movie was made for girls than guys. Overall, 8.4/10"
    },
    {
      "rating": "9",
      "text": "Wreck it Ralph was a huge surprise to me. Not only it has excellent graphics but it is really touching and moving. I don't really watch animation movies but this movie was a simply perfection. I saw Brave too which was good but not as good as wreck-it Ralph. I can't say something about the acting but all this atmosphere of the games and everything in that film made me feel like a little child again. It is one of the best animation movies that I have ever seen and I would recommend it to everyone regardless their age. Should have won that Oscar as it was much much better than Brave  A must-watch"
    },
    {
      "rating": "8",
      "text": "Far more than just a loving homage to old school video games, Wreck-It Ralph is a joyous, funny, smart and touching story about being comfortable in your own skin.  It's lesson may be older than the numerous video games that are referenced throughout, but it is a lesson that still resonates and is worth repeating."
    },
    {
      "rating": "10",
      "text": "\"Wreck It Ralph is a wonderfully delight, pure imaginative treat. That has set a new bar for Disney films everywhere including PIXAR. It has tons of heart and humor, Without a doubt the best animated film of the year. Maybe even quite possibly a classic.\"  A+"
    },
    {
      "rating": "10",
      "text": "When I saw the trailer for Wreck-It Ralph last year, it didn't excite me too much. Still, I thought I would give it a shot. I am long time gamer after-all. I didn't expect to watch a great nostalgic and heartfelt film. It is my favorite animated film since Toy Story 3."
    },
    {
      "rating": "10",
      "text": "I haven't savoured any animated movies for a while, and I wasn't sure if it was because I was growing up or if they were actually getting worse. Then came this movie, the best animated movie I've seen in a long time. Thanks to some nifty world-building, I fell in love with the video game universe and got nostalgic when watching the video game action scenes, especially those set in Sugar Rush. Sarah Silverman's vocal performance as Vanellope von Schweetz stands as one of the movie's greatest highlights, and the animation and 3D are enticing and colourful. The script and characters are just as smart as some of Pixar's greatest movies, and had they released Wreck-it-Ralph instead of Brave last year, I would've gone as far to say that they made a full recovery from Cars 2. They didn't unfortunately, but Wreck-it-Ralph still emerges as the Toy Story of a new generation and I'd love to see how it'll play out as a franchise."
    },
    {
      "rating": "8",
      "text": "Oh oh Pixar...what's going on? While Brave is a bravura technical achievement, its conventional narrative made it felt pedestrian. Wreck-It Ralph ends up being the best animated film of the year.  It's creative, fun and heart warming.  And for a retro gamer like me, it's a great treat to see all the old game characters of arcade yore making their cameos.  Great stuff!"
    },
    {
      "rating": "10",
      "text": "Wreck-It-Ralph is hilarious, smart, heartwarming, and manages to bring you into a fantastic world. It features great voice acting and clever jokes for all ages. I give this film 96%."
    },
    {
      "rating": "9",
      "text": "I originally had this rated a 7; after watching it again a few times, it's really grown on me.  The film works well, delivering comedy for both parents and children.  A tad predictable, but what Disney move isn't? All in all, one of the better family films to come out in last few years."
    },
    {
      "rating": "9",
      "text": "anyone around the age of 10 to 30 years old will enjoy this movie. Even though it has it's childish jokes, there are some references to some retro games that are just AMAZING, I was laughing for so long and never actually thought anyone would do something like it.\rMay not be a masterpiece, but it's a damn fine movie wort watching if you're a gamer"
    },
    {
      "rating": "10",
      "text": "The reason that I orignally wanted to see this movie, was because it was about video game characters in a games arcade and it featured many cameos from famous game icons. After seeing this film, I can say that it had all of that and more. Having 'Sonic the Hedgehog' appear more than three times in a movie already makes it awesome for me and there's plenty of fan service for everyone else too, ranging from 'Super Street Fighter' to 'Pacman'. There's just so much attention to detail, from the way some characters movements have an extremely low frame-rate like in some retro video-game, to a scene where Ralph pulls out of a sink a 'Super Mario' mushroom, an exlamation mark from 'Metal Gear Solid' and Zangief of 'Super Street-Fighter's unerwear. There are so many other scenes and aspects to the movie that have so much attention in the detail more so than any other movie that revolves around video games would, so I won't spoil it for you by saying any more about this (Besides, if I told you about every detail and reference to real video games in this movie, you'd be reading this for hours, anyway.) So they've definetely got the video-games side of this movie right, but what about the plot. Well, I know a bad guy who is looking to be good to be \"wreck-ognized\" isn't exactly the most original plot. While I haven't seen any movies that have actually used this plot before, I am sure it has been done and it also feels like the typical type of Disney plot. But to be honest, this did not disappoint me. You may think that this is because the video-game elements would distract you from the not-so-original plot, but I have to say, that isn't all. The reason the plot didn't bother me is because it was interpreted so well. Of course an animated movie revolving around video-games is quite a new thing, so this does not feel old. But the plot is just done so well at the same time. I cannot explain exactly how it does it, all I can really say is that you should definetely consider seeing it. If you play video games, don't even consider it. Just see it without question. And if you don't play video-games, the storyline is enough to make this movie worth seeing. I would give this a 9/10, but Metacritic only allow whole numbers, so I'll give it a 10. But to be honest, I have no problem giving it a 10. See it."
    },
    {
      "rating": "5",
      "text": "I'll start by saying I don't like CG movies.  I can never really connect to them.  As a game playing teenager, I was enticed by the nostalgia of seeing some of the games from my youth rendered large.  All I can say is what a missed opportunity.  I thought there was going to be much more game hopping, and more characters featured.  There is the whole history of computer gaming to draw from, and yet hardly any of them are featured.  I suspect that they had licensing issues.  The script wasn't funny and there was nothing in this film for an adult viewer.  The main feature little more than a merchandising opportunity with some crass product placement only just about redeems itself in the last five minutes.  It failed to have the emotional weight of the second film in the toy story franchise, or that one with the fish that proves you can be affected by the digital image.  There was more feeling in the opening 2D short than there was in this entire movie.  Probably worth the entrance fee for that alone.  Schweet."
    },
    {
      "rating": "9",
      "text": "Nicest video-game movie ever made. Just don't forget it's a kids movie.All nods to classic games are fantastic, still, the story stands on it's own. Get your kids to it!"
    },
    {
      "rating": "10",
      "text": "Wreck It-Ralph is one of the best animated movies I have seen, the movie is heartwarming. The story is about Ralph who is on a journey of self discovery. It's a beautiful movie with meaning and a strong message that really makes you think about the importance of being able to accept yourself, who you are and what you do."
    },
    {
      "rating": "10",
      "text": "It has been a long time since Disney has produced something this great of a masterpiece; with an audience suited for anyone, beautiful animation, characters the audiences can relate to, emotional voice acting, a twist that actually surprised me and  to top it all  video game references that were actually relevant to the story. This film deserves all of the 'wreck-ognition' it has achieved."
    },
    {
      "rating": "9",
      "text": "It's a movie by gamers for gamers, and easily the best video game movie ever made. Disney adds polish, flair, and wit throughout the entire movie. There will be numerous references that will ignite memories and the hearts of every gamer. Ralph and Vanelope are likable characters and their journey is a heartfelt one with much purpose. The visuals are fantastic, it really shows how far animation has come, as has gaming. Wreck-It Ralph touches on every genre of game, new and old, it's the perfect tribute and a hilarious movie, balancing out in every area."
    },
    {
      "rating": "9",
      "text": "This movie was adorable,intelligent and Full of memorable characters.\rTakes me back to the earlier Disney movies where you could feel for the characters and there was some emotional depth to them, or maybe there wasn't and I was just 10, but in wreck it ralph there definitely was..\rI'm going to suggest this movie to everyone I know with kids..\r The idea of a videogame movie really appeals to me, Seeing all those arcade characters gave me a wonderful sense of nostalgia while watching this, wreck it ralph is one of those rare childrens movies that can easily be enjoyed by most light hearted adults and man-children"
    },
    {
      "rating": "10",
      "text": "If you are a gamer, and a gamer from the older generation, this movie is for you. All the little tidbits from the Konami code to Zangief's underwear paired with the overall tender story make this movie hilarious and extremely entertaining. In no other film will you see Dr Robotnik, Bison, and Bowser sitting in a support group while Ken and Ryu hit up Tapper's after a long day of work. Innovative, interesting, and of course the movie discusses the general issues surrounding the video game industry in a poignant way. Highly recommended for children and adults alike."
    },
    {
      "rating": "9",
      "text": "I played lots of games at a younger age and not nearly so much now as I am crazy consumed with work and school but, having said all of that, I thoroughly enjoyed the movie! I just saw it last night (11/11) and it was even better than I had anticipated. Loved the reminiscing I got from seeing some of my favorite characters like Storm from Mortal Combat. But, the movie was also very much for adults since the language wasn't totally geared towards tweens which made it even more enjoyable and took away any feeling that I was too old to watch it. I think it's one of the best animated Disney movies (very comparable to Pixar) produced in a long time!"
    },
    {
      "rating": "10",
      "text": "One of the best animated films of 2012."
    },
    {
      "rating": "9",
      "text": "Disney kicks ass with their new cartoon Wreck-it Ralph.\rThis animation film has a lot of emotional moments, good script, great animation and spectacular visual effects.\rIf haven't seen this film yet - reading this review is your excuse. Go see this cartoon on the big screen - you won't regret it."
    },
    {
      "rating": "10",
      "text": "Wreck-It Ralph is one of the best movies of 2012. There were moments when I went \"Awwe\", moments when I went \"Woah!\", moments when I cried, and moments when I was shocked. It was a fantastic movie that you will always remember!"
    },
    {
      "rating": "9",
      "text": "Wreck-it Ralph is an awesome animated film.  I did get a little sick from the spinning bright colors and Sarah Silverman's voice.  Still, the movie is filled with great 8-bit references, yet, don't rely on simple inside jokes to give an entertaining story.  And I have to admit--I don't often respect any animated film that isn't created by Pixar but Wreck-it Ralph pretty much left Brave sucking haggis.\r You won't enjoy this if you don't like movies without cuss words and/or nudity and you'll pretty much hate it if you're an avid opposer to your children playing video games.  But if you are a gamer or at least interactive-curious--I say grab the closest kid and go enjoy this movie!"
    },
    {
      "rating": "8",
      "text": "\"I'm Gonna wreck it!\" Once I saw the trailer for the first time I was hooked and knew I had to see it. I loved the very cool idea of video game characters in an arcade that had homes they went back to after their \"work day\" in the arcade game was over. It is jam packed with references to old school arcade games and being 40 I remember playing Q-bert and Pac-man etc. in the arcade. I like how it fused a character from a more modern game into the plot which was centered on an older 8-bit game. A large part of it takes place in a game called 'Sugar Rush' which was cute and funny but a little too cutsie for me. It seemed to be aimed more at kids than adults, which is a no-brainer but many movies like this have a ton of jokes for adults too and some of the retro game stuff was but it was just very cutsie. The script was good with decently fleshed out main characters and overall it was a good amount of laughs and entertainment."
    },
    {
      "rating": "9",
      "text": "The movie was great. I thought the storyline was well done and the references were spot on. It was funny, witty and something that I will definitely buy on Blu Ray."
    },
    {
      "rating": "10",
      "text": "Fantastic movie. Not only is the soundtrack incredible amazing for an movie (Especially the song AFTER the movie, from Owl City!) The characters are also lovable and interesting, the story is unique in the sense that it makes you think someone is a bad thing and they turn out to be good and it also has a plot twist in the end. And the references to other games like Pacman and Sonic are also amusing and cool. I really love this movie and I suggest every gamer (Even the ones who play Call of Duty, since - SPOILER - there is a Call of Duty reference in the movie..) should go watch it."
    },
    {
      "rating": "9",
      "text": "With deep characters, creative settings, and a surprisingly clever plot, Wreck-It Ralph is definitely one of the biggest (and best) surprises of the year! From start to finish, \"Ralph\" never ceases to deliver enough fun for the younger audience and even succeeds in appealing to the older generation with nostalgic references and a rich, satisfying story. Being \"bad\" has never felt so \"good\" until you watch this movie."
    },
    {
      "rating": "5",
      "text": "This movie was okay, but I don't know why everyone loves it so much.  The storyline was fine, but pretty predictable.  It was good for one viewing, but I don't have any desire to watch it again."
    },
    {
      "rating": "10",
      "text": "This movie is one of the most clever, fun-filled, and original movies I have ever seen. There is rarely a dull moment, and it is family friendly but will be a hit for adults as well. This comedy is sure to make you laugh and connect with the characters as you complete this awesome adventure."
    },
    {
      "rating": "8",
      "text": "After a stomping success in the States, this witty retro gaming homage is the first bow in the Disney Animation Studios’ arrow to be as ardent and artistically ballsy as the work from those neighboring Pixar bigwigs.\r Read the full review here:\rhttp://theframeloop.com/2013/02/06/filmwreck/"
    },
    {
      "rating": "10",
      "text": "Wreck-it-Ralph is a great movie for anyone and everyone. It is fun for kids. It has classic videogame references (for people to point out to eachother- \"ooh look- Pong!\"). It has a great story- it actually cuts kinda deep, emotionally, and that is something I have to give props to Disney for. The CGI is great for a non-Pixar CGI film. This movie is the full package that makes an awesome movie- I'm actually surprised that it did not win the Oscar for best animated feature film this year. I bet the sequel will. I cannot WAIT for Wreck it Ralph 2."
    },
    {
      "rating": "9",
      "text": "Wreck-it Ralph is the best animated film since Toy Story 3.  All the characters in this film help to create a story that could become a very nice franchise."
    },
    {
      "rating": "9",
      "text": "In a year were movies like the avengers and the dark knight and the always present competition of Pixar, it would be crazy to consider an non-pixar animated film one of the best movies of the year. Well, it would have be crazy if not for Wreck it Ralph! It is easily the best animated film of the year and one of my all time favorites from Disney."
    },
    {
      "rating": "8",
      "text": "I LOVED THIS MOVIE. IT WAS REALLY CUTE WHEN VENELOPE CROSSED THE FINISH LINE AND everything went Back To Normal!! Watch the trailer here, http://www.metacritic.com/movie/wreck-it-ralph/trailers"
    },
    {
      "rating": "8",
      "text": "I'll be honest, I went into Wreck It Ralph thinking it would be a cheesy kids movie with little plot, just 90 minutes of childish humor. I admit that I was way off. After seeing this movie four times, I can say that I still laugh and enjoy the film.\r Our main character is Ralph (John C. Reilly) who belongs in the arcade game Wreck It Ralph. Ralph's home is moved and replaced by a complex full of people knows as \"NiceLanders.\" Ralph upset by this wrecks the building and it is fixed by Felix (Jack McBrayer.) That is the game that the arcade users play.\r On the games anniversary, Ralph is not invited and wrecks the building for real this time because all he wants is a medal and to be a good guy for once. He decides to leave his own game and try to win a medal in others. He meets Sergeant Calhoun (Jane Lynch) in one game (Heroes Duty) and takes accidently flies a space pod into a candy racing game, (Sugar Rush) where he meets a girl named Vanellope von Schweetz. (Sarah Silverman)\r We first meet Vanellope when she takes Ralph's medal. Throughout the movie we see her character evolve into a better person. Ralph starts to show emotion toward Vanellope which we can clearly see especially when Ralph teaches her how to drive a racecar. Vanellope usually gets picked on because she is called a glitch. She isn't allowed to race because if she crosses the finish line the entire game resets so she used Ralph's medal to enter the race. The movie takes a very unexpected turn and has a powerful ending.\r I loved Wreck It Ralph enough to see it multiple times with friends and independently and have had great reactions from friends who watched it. Disney/Pixar really got this movie right and I am hoping for a sequel in the future."
    },
    {
      "rating": "10",
      "text": "I love this movie! It's great for kids and adults.(I'm 17-years-old). The voice acting is phenomenal and the animation is terrific! There was never a point in the movie where i felt bored, it was pretty funny and it had a heart-touching story line!! I SERIOUSLY recommend for people of all ages to watch this movie."
    },
    {
      "rating": "10",
      "text": "This is the best Kid's and Family movies I have seen. The storyline was just flawless. It takes place in a Game Centre full of arcades and all that. The characters were awesome, HECK even Bowser appeared! That is just awesome. My favourite part is when cake splats on Pacman's face and I yelled \"Dat Pacman Doe!\" lolololol I mean PacMan is awesome (except for the crappy Atari 2600 game) but it was just hilarious. The humours are hilarious. Wreck it Ralph is a very great movie and if you hate Wreck it Ralph, you're silly as JB. I recommend you watch this."
    },
    {
      "rating": "8",
      "text": "Wreck -it Ralph is an amazing movie where the classic arcade video games have their own life , but no more an affair of the villain is the protagonist, and so remains after Villain , but has a good villain heart of hero."
    },
    {
      "rating": "8",
      "text": "Wreck-it-Ralph is fun, colourful and well made. The characters are developed nicely, the storyline is original (something we rarely get nowadays in Disney films) and the animation is top notch. Although quite a large portion of the movie is set in one of the less-interesting arcade worlds, Wreck-it-Ralph is still an entertaining heartfelt story about a villain who wants to become a good guy. Tops Frozen, if you ask me!"
    },
    {
      "rating": "10",
      "text": "Amazing movie, THE BEST VIDEOGAME movie. Don't watch sequel, watch this. I don't want to spoil at all. Superb"
    },
    {
      "rating": "7",
      "text": "I enjoyed Wreck-It Ralph as a whole, but the story just seems kind of simple. I understand that there has to be a narrative and that they can't just focus on video games, but I wish there was more exploration involved. It sets up a very interesting premise and world, and then just hangs out in one of the games for most of the story. It's solid, but not incredible."
    },
    {
      "rating": "10",
      "text": "Great characters, a captivating setting, beautiful animation, a solid soundtrack, this is one of my favorite Disney movies :)"
    },
    {
      "rating": "10",
      "text": "This movie was a fantastic depiction of the lives and coalescence of many nostalgic video games dating back as far as 1981 (Qix), and as recent as today (Sonic, Bowser, etc.). This makes the film recognizable to the rounded ages of four to forty, given times of development. Go see it."
    }
  ],
  "recommendations": [
    "the_angry_birds_movie",
    "sonic_the_hedgehog_2",
    "the_lego_movie",
    "sonic_the_hedgehog",
    "prince_of_persia_the_sands_of_time",
    "meet_the_robinsons",
    "zootopia",
    "my_little_pony_the_movie",
    "tmnt",
    "home_on_the_range",
    "free_guy",
    "atlantis_the_lost_empire",
    "ralph_breaks_the_internet",
    "the_peanuts_movie",
    "ice_age_the_meltdown",
    "shaun_the_sheep_movie",
    "bolt",
    "how_to_train_your_dragon_2",
    "rio_2",
    "spy_kids_3_d_game_over",
    "jumanji_welcome_to_the_jungle",
    "warcraft",
    "rio",
    "rango",
    "incredibles_2"
  ]
}