{
  "id": 895,
  "title": "Wrong Turn",
  "starring": [
    "Charlotte Vega",
    "Adain Bradley"
  ],
  "runtime": 110,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "Jen and a group of friends set out to hike the Appalachian Trail. Despite warnings to stick to the trail, the hikers stray off course—and cross into land inhabited by The Foundation, a hidden community of mountain dwellers who use deadly means to protect their way of life.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4U1SBHmwHkNA0eHZ2n1CuiC1K1g.jpg",
  "categories": {
    "plot": 4.8,
    "acting": 5.0,
    "ending": 6.0,
    "soundtrack": 5.0,
    "cinematography": 4.0,
    "familyFriendly": 3.0,
    "funny": 2.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Scary and fun at the same time. You'll be riveted watching this. Just know, like me, you will be terrified of West Virginia after watching this. The acting was good, not the best, but the main characters did great. The cannibals were freaky. The movie is like so so so creepy. I recommend :)\r 10/10"
    },
    {
      "rating": "8",
      "text": "Decent disturbing entertaining!story was good but predictable and the core felt like evil dead but without origin like book in evil dead.the blood was less but violence was much and amazing.more of a slasher movie than horror movie!screenplay was good engaging till end runtime was short and it felt like no more dept in story or characters some scenes were amazing like sudden shot at policeman and starting slow scenes it was building up and than the tower and all escape scenes were amazing ending was good with mutant hint although i want to watch more but in little runtime disturbing and Good slasher entertainer!"
    },
    {
      "rating": "9",
      "text": "I've loved this movie since I first saw it in theaters. It came out a little after the chainsaw remake and didn't receive a big release or a lot of publicity. Which is sad because it could have been a hit. It was also the last movie Stan Winston would do before passing. It centers on a young man trying to make an interview and a group of friends who have an accident because of a razor wire trap left in the road. Before you know it they are being hunted by three cannibalistic, inbred brothers who are superhuman, brutal, efficient and very hungry. The film is an electrifying combination of action, horror and sweaty palm inducing suspense. Eliza Dushku is always sultry in the lead, hottie is Desmond Harrington makes for a fine hero and Emmanuel Chirqui and Jeremy Sisto are engaging as a young engaged couple. Kevin Zegers and Lindsay Wallace of the dawn remake also star as a horny couple. The movie is directed confidently by Rob Schmidt of crime and punishment in suburbia and has some of the best, most creative kills of the decade. The cinematography is impressive as well both claustrophobic, innovative and sweeping when it comes to capturing the West Virginia wilderness.Budget: $12.6MBox Office: $28.7M9/10"
    },
    {
      "rating": "10",
      "text": "mmnnbvcxzxbnmkljjhhgdsasfjkopooiuyytreqwdsdfdwzsaxxcbnkljgjonjoojihugyfrdesesdyfhiihihvgtdrzrswwtughijbinknkninh"
    },
    {
      "rating": "8",
      "text": "This movie is far better than what I was expecting.The acting is correct and there is some pretty well known actors like Jeremy Sisto and Emmanuelle Chriqui.The deaths might not be that gruesome but they are still pretty bad ass."
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙````````````````````````````````````````````````````````"
    },
    {
      "rating": "10",
      "text": "~~~~~~~~~~~~~~~~~~~~~~~~~~noononononininniononononojojij##########################+×÷=+×÷÷+=+×÷=+×÷=+×÷÷+×÷+#..."
    },
    {
      "rating": "8",
      "text": "Wrong Turn is a not bad movie. I don't know why a majority of the reviews were negative. It is an interesting story line, and pretty good acting. The only negative thing here is how the first two characters died, they needed it to be visible or at least tell us how the first character died. But all in all, not a bad movie."
    },
    {
      "rating": "10",
      "text": "○●○●○●○●○●○●○●○●○●○●○●○●○●○●○●○●○●○÷.÷.÷.÷.÷.÷.÷.÷.÷.÷,÷,÷,÷,+,+,+,+,+,=,=,=,=,=,=,=,......"
    },
    {
      "rating": "7",
      "text": "Solid horror movie! Not a gamer changer, but something great for a rainy evening."
    },
    {
      "rating": "10",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$.$.$.$.$.$.$.$.$.$.$.$.$.$.●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》●》"
    },
    {
      "rating": "10",
      "text": "♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤¿♤:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;◇◇◇◇◇◇◇◇◇◇◇◇◇◇◇"
    },
    {
      "rating": "10",
      "text": "●°●°●°●●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"
    },
    {
      "rating": "10",
      "text": "⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙●■●■●■●■●■●■●÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%÷%$$$$$$$$$$$$$$$$$$$$"
    },
    {
      "rating": "9",
      "text": "To me this is the only Wrong Turn movie that is deemed watchable. I love how brutal it is right into the beginning and keeps you reeled in all the way through. The location is perfect and the acting was well done. I don't understand why critics underrated it, because it has been one of the better movies I have seen in this genre."
    },
    {
      "rating": "9",
      "text": "This movie totally stands out for me and is an amazing horror film! Don't know why the critics are so low I mean the sequels ARE pretty bad but this one is really good!"
    },
    {
      "rating": "9",
      "text": "One of my favourite Horror films for a number of reasons, but mainly because its a great concept (that has been done to death now, but here's where it began). A group of likable young adults get on the wrong side of three 'mountain men' who are truly terrifying! It's quite graphic and violent but still quite tame compared to what's coming out these days. Dushku does a great job as our leading lady, with Harrington also doing well as Chris. Overall a fantastic Horror film well worth a look!"
    },
    {
      "rating": "7",
      "text": "Good gore effects and a good creepy atmosphere. Easily the best of the franchise."
    },
    {
      "rating": "2",
      "text": "VERY gross material - coming from a horror fan.  If you're into Texas Chainsaw fare, you'll love it. Think Chainsaw mixed with West Virginia Deliverance - starring Eliza Dushku, Emmanuelle Chriqui & Jeremy Sisto.  There are only so many guts in jars that I can stare at in one movie...."
    },
    {
      "rating": "2",
      "text": "No storyline, no sense, no explination, dull plot, weak twist and for sure not gonna see the sequels...The credits ended up to be the Best part in this depressing movie"
    },
    {
      "rating": "7",
      "text": "Better then the so-called American Classic Horror movie \"Psycho\". Wrong Turn so far has 5 films this is the best. I mean every one is acted perfectlly, bloody it was definintly. Watch it."
    },
    {
      "rating": "7",
      "text": "This film gets its politics exactly right: people who scratch your CDs deserve to be murdered by inbred mountain folk."
    },
    {
      "rating": "2",
      "text": "Solid acting by the cast, The entire film was interesting but its sadly just another rip off of another classic horror film and it does nothing to seperate itself from it besides a change in environment"
    },
    {
      "rating": "4",
      "text": "This movie is very clumsy.\r I can appreciate the approach in terms of atmosphere, location and story, but everything about this movie is clumsy; Why are those hill billys so invisible? why the wacky acting? why are the characters so dumb? why is the camera work so awkward? You can argue this are all budget issues but that doesn't excuse the lack of focus this movie has... there have been movies made that have more focus than many other films don't.\r This movie is not awful, is just mediocre in almost everything it does; I say this because I can appreciate the idea, but is just a clumsy movie overall."
    },
    {
      "rating": "3",
      "text": "Teens break down in the woods inhabited by inbred cannibalistic rednecks and get knocked off one-by-one, love Eliza Dushku but this film was below her."
    },
    {
      "rating": "6",
      "text": "Wrong Turn is nothing special with all honesty, you have seen it all before. But it pays homage to the 90's horror movies which makes it very fun to watch."
    },
    {
      "rating": "4",
      "text": "Where do I begin? Oh yes, the acting is fine, nothing impressive, but not bad. The plot is horrendous, no one would ever enter a creepy house in the middle of nowhere like that, also what is up with those people seeing a bunch of human meat and not freaking out? But just like any other horror movie, it takes a chopped off hand to scare people. No way the weird dude with the bow would've caught up with the running guy who runs like an athlete. Unless I missed something. Not going to touch the foreshadowing for who was going to survive. How the heck did they survive being burnt? Oh it's a franchise, I get it."
    },
    {
      "rating": "7",
      "text": "Un clásico indispensable para todos aquellos que amen el cine de horror gore en su justa medida, no hay excesos de nada, ni tan gore, ni tan sangriento, pero si es lo suficientemente decente para llevar el estandarte de toda una saga."
    },
    {
      "rating": "6",
      "text": "Une version navet de Délivrance même s'il est certainement injuste de les comparer directement... d'abord parce qu'ici, ça se passe sur la terre ferme et ensuite parce qu'il faudrait plutôt le mettre en parallèle des \"Collines (qui ont) des \"yeux\" et là, Détour Mortel s'en tire plutôt honorablement !Evidemment, le scénario fait dans la facilité et les comédiens sont assez à la masse, pour ne pas dire plus... Mais les donzelles ont armé leurs wonderbras et **** débardeurs et poussent des cris d'orfraie qui font volontiers ricaner ; elles font office ma foi d'une bien belle chair à canon... ou plutôt de viande à hâcher pour nos ploucs dégénérés consanguins de la forêt.C'est donc souvent drôle et un tantinet gore tout de même (miam), et puis on ne s'ennuie décidément pas, car le film a su rester court et va droit toujours droit à l'essentiel. Enfin, la réalisation est dans l'ensemble très correcte."
    },
    {
      "rating": "5",
      "text": "Grade B movie. Wrong Turn is nothing special with all honesty, you have seen it all before."
    },
    {
      "rating": "1",
      "text": "________________________________________________  1/10 * SSehhhhr lwww!!!!!"
    },
    {
      "rating": "7",
      "text": "This is a good solid horror thriller. There is nothing original here. It has shades of the Texas Chainsaw Massacre and is very similar indeed to the remake. The monsters are very creepy but they are never fully realised. The violence and sadomasochist-violence is excellent with realistic gross-out deaths. It is scary and jumpy and almost a step-up over older horror but that also means that it is a step down as the connection is gone and replaced with slickness. This is a fun slasher."
    },
    {
      "rating": "10",
      "text": "This movie by far the best horror of the year keeps you on your edge of the seat from the begining. anyone who doesn't rate this well needs to really watch this movie again. cant wait for part 2."
    },
    {
      "rating": "3",
      "text": "Stereotypical characters encounter problems with backcountry folk. Picture Deliverance involving a trio of redneck Hannibal Lecters terrorizing horny teens. Lots of fright without the distraction of intelligent content. And, oh yes, death. Lots of death. Gets 3 points for unpretentiousness."
    },
    {
      "rating": "1",
      "text": "This movie is very clumsy.I can appreciate the approach in terms of atmosphere, location and story, but everything about this movie is clumsy; Why are those hill billys so invisible? why the wacky acting? why are the characters so dumb? why is the camera work so awkward? You can argue this are all budget issues but that doesn't excuse the lack of focus this movie has."
    },
    {
      "rating": "10",
      "text": "$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.$.》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "10",
      "text": "°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》°》⊙》°》°》°@:@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;@;"
    },
    {
      "rating": "10",
      "text": "*:*:*:*:*;*;*;**\"*\"*\"*\"*\"**\"¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡¡⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙⊙"
    },
    {
      "rating": "10",
      "text": "♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♤♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡♡¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥¥"
    },
    {
      "rating": "10",
      "text": "¤¡¤¡¤¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¡¤¤¡¤¡¤¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡•¡"
    },
    {
      "rating": "2",
      "text": "Yet another generic white-trash slasher flick from the early 2000's- Wrong Turn proves to be nothing short of a Texas Chainsaw rip off- except with slightly more plot and far less style. It's easy to say I did not enjoy watching this movie. I try to keep an open mind on horror films in general, as many can be quite panned for silly reasons, but honestly I think this one deserves far more crap than it receives. The only good thing I can say about this film is that lead actor and Dexter star Desmond Harrington tries his best in his role. His lines can be written horribly and his character quite generic, but he does truly try throughout the film despite his inescapable character flaws- and is easily the best actor in the films entirety. The other actors vary from being the stereotypical horror cast members and characters we always see, to being annoying little turds that truly just got lucky to be in a film at all. So much of this film is just tedious nonsense, that it was honestly quite hard to sit through. The dialogue is repetitive, each scene is one stupid game of cat and mouse after the next, and none of it is interesting. The cinematography is done incredibly poorly, the look of the film as bland as can be, and the story is almost non-existent. None of it is frightening, very very little of it is amusing, and it's honestly a dud all the way through. It may not be the worst horror movie i've seen, but it is up there."
    }
  ],
  "recommendations": [
    "cabin_fever",
    "malignant",
    "the_collector",
    "the_wolfman",
    "vacancy",
    "the_texas_chainsaw_massacre",
    "annabelle",
    "sinister_2",
    "terrifier",
    "the_possession",
    "p2",
    "dark_skies",
    "the_curse_of_la_llorona",
    "scream",
    "hell_fest",
    "scream_2",
    "it_follows",
    "the_crazies",
    "house_of_1000_corpses",
    "final_destination",
    "insidious_chapter_2",
    "ouija_origin_of_evil",
    "disturbia",
    "clown",
    "the_return_of_the_living_dead"
  ]
}