{"id": 793, "title": "X-Men: Days of Future Past", "starring": ["Hugh Jackman", "James McAvoy"], "runtime": 132, "genre": ["Action", "Adventure", "Science Fiction"], "description": "The ultimate X-Men ensemble fights a war for the survival of the species across two time periods as they join forces with their younger selves in an epic battle that must change the past – to save our future.", "releaseYear": "2014", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/tYfijzolzgoMOtegh1Y7j2Enorg.jpg", "categories": {"plot": 8.89795918367347, "acting": 9.078947368421053, "ending": 9.25, "soundtrack": 9.0, "cinematography": 8.0, "familyFriendly": 6.0, "funny": 9.0, "action": 8.961538461538462}, "reviews": [{"rating": "8", "text": "With such abundance of talents, it's a surprise their powers are not throwing award statues at each other. An all-star ensemble delivers one of the better and more captivating superhero movie in recent time, despite the use of a rather mystifying time travel plot. They do a remarkable job of keeping the audience invested to the characters, each with brimming personality to ensure there's never a dull moment. Visually, the movie is captivating, its contrast tone bridges the colorful 70s and severely bleak future impeccably. It also appropriately utilizes good humor throughout the seemingly melancholy plot.\r X-Men: Days of Future Past is an ambitious movie, it brings the newer cast from First Class as well as the older trilogy, plus Hugh Jackman. The time traveling gimmick could be a puzzling one, and in some occasions there are tricky twists that rely on heavy expositions. However, the movie pulls it off quite neatly with balanced pacing. The complexity doesn't divert the focus away from relationship of characters, most of which are always in peril. Many of the cast are capable to lead a movie by their own, but the movie doesn't feel bloated because they are so many involved. Director Bryan Singer cleverly seams the characters' tales together; the present chemistry produces engaging interaction between them.\r The bulk of the story occurs in 1973, James McAvoy, Michael Fassbender and Jennifer Lawrence take most of the spotlight. They perform admirably, each showcasing emotional baggage and entwined history together. Hugh Jackman fits into the party fairly well, he has been Wolverine for so long, he just naturally meshes together with the younger X-Men. Peter Dinklage provides a unique antagonist. X-Men movies are notoriously filled with military men as villains, it's nice to see someone more dynamic and with less reliance to violence.\r Effects are done beautifully. The future battles are spectacular, not to mention the choreography gracefully combines the mutants' power into the fray. I personally like the intricacy of Blink's ability which allows her to use multiple portals. Her scenes are few, but very well done. The slow motion effect looks wonderful and melee combat is performed effectively, especially Mystique's acrobatic dances. There's lingering retro ambiance for 70s, a simple touch of familiarity. One minor blemish is the lighting for future setting might be a tad too dark at times to fully appreciate the graphic.\r The prevalent flaw of time travel gimmick is the impact actions supposedly have on the future, this movie is no exception. There are a few instances where characters act rather brashly just in case it may hopefully change the future, a couple decisions are questionable as well, it's hard to believe experienced mutants with special powers would do impulsive action. It also tries to add prejudice theme, but seeing Jennifer Lawrence, even with blue skin, having self-confident issue is like seeing a supermodel complaining she's fat. All the flaws are just little hindrance, they barely affect the gripping performance of the talents.\r X-Men: Days of Future Past is arguably the best of the franchise, it will entertain viewers with exquisite acting, finely pace story and delightfully likeable characters."}, {"rating": "10", "text": "This is the best X-Men movie so far, the story is great, the cast is incredible, the action scenes are amazing.  This movie exceeded my expectations and I'm sure it will surprise you from the beginning to the end...  and, I have a new favorite movie now..."}, {"rating": "10", "text": "Best X-men Movie Ever. It has everything. Just watch it. Great characters and the most intriguing plot. One of the best films of this year and surely the best Marvel film. Watch it !"}, {"rating": "9", "text": "I'm gonna be a little too honest here: I bingewatched all the X-Men movies, so I often forget about this movie. Many times I get confused when someone mentions a scene from this movie, and I'm like, \"wait, it happened in THIS movie? I thought it happened in First Class/Apocalypse!\" And I'd prefer admitting that it's my fault than it being the movie's fault.X-Men: Days of the Future Past is what I'd call the movie that bridges X-Men: First Class with the other canonical movies, and at the same time also helps in eliminating the bad movies like The Last Stand and Origins. The movie begins with, as usual, mutants being attacked and eliminated. So to save all of them, Wolverine goes back in time and stop Mystique from killing Bolivar Trask, a defence contractor. Wolverine reached the 1970s, when he was still a mutant without vibranium. And to set planes in motion, he has to find Charlex Xavier, Magneto, Beast and Mystique.Bolivar Trask used Mystique's powers to create Mutant Hunting Robots. In the beginning they were only meant to be used to fight in the Vietnam war, but seeing how Mystique and Magneto revealed themselves, they decided to use the robots to hunt down the mutants itself. They didn't see whether mutants are also sentient beings or not, they just wanted to have them eliminated. And that's when the roles of money and power play. It was on the order of President Nixon that Bolivar decided to make those robots, which President Nixon had ordered only because of Bolivar's influence. So in a way it was a loop of blame.And when Professor X, Wolverine and Quicksilver reach Magneto to save him, we finally get to see the fabled Quicksilver scene, where he takes down all the prison guards single handedly. It was the most iconic moment from the movie, and no amount of appreciation can praise it as much as it deserves. The modern day scenes were also adding to the tension, and in the end when Mystique is left with the choice whether to kill Bolivar or not, it is a quite tense moment whether the mutants in the modern time will survive or not. In the end we see that all the mutants who had died in the previous movies had also come back to life, and the franchise was brought back to where Bryan Singer had left it in X2.Normally it is very difficult to reboot a franchise (read Sonic 06). Not only do you have to understant the major events that need to ve removed in order to fix the franchise, you also have to make the reboot-turning movie really good, otherwise it will just contribute to being the hot garbage that the other movies of the franchise are. And that's the reason why I believe this movie is underrated. It single handedly fixed a failing franchise, joined the acclaimed prequel into the main timeline and became a success both critically and financiallly. It deserves to be one of the most iconic X-Men movies."}, {"rating": "10", "text": "The best part of the franchise in my view: The movie shows a loft of conflicts of the x-men and make the characters deep and interesting. Especially I like the wolverine here, because he is wiser and more quiet. The actors are also brilliant, as usual I like Michael Fassbender. Also the story is good, because you need at least a bit of brain to follow it, because it mixes sci fi story with politics, what I already liked in X-Men First Class. The visual effects are stunning. Respect to Bryan Singer."}, {"rating": "10", "text": "●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●°●=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_=_"}, {"rating": "10", "text": "+++++++++++÷÷÷÷÷÷÷÷÷÷××××××++++++++÷÷÷÷÷÷÷÷÷++++÷÷÷÷÷÷÷÷■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■"}, {"rating": "8", "text": "As a huge x-men fan growing up, I liked this movie a lot; however, I didn't think it was AS great as people are proclaiming it to be.  It's a good story, but it could be difficult for younger viewers to follow.  Also, the movie does deviate from the source material quote a bit, but that's not a big deal.\rAlso worth nothing is that there really isn't that much action in it. That's not to say that the lack of action makes it any less of a movie, but it's just something to note before going into watching this movie.\rOverall, this is a really good movie."}, {"rating": "8", "text": "Despite its weak human villain (Trask), this move is complex, quickly paced & fun and X-Men: Days of Future Past ranks amongst the best of the X-Men franchise. 8.5/10"}, {"rating": "10", "text": "The best superhero movie I've seen; a true masterwork. This is one of the best movies I've ever seen. It is incredibly well written, and acted. The ideas are fascinating and thought provoking. It is, believe it or not, a rather deep movie. It is one of the few 'deep' movies to give a very positive and truly constructive message, but in a way that is believable and heartfelt."}, {"rating": "10", "text": "I would have given a 11 for this, but since the score goes up to 10, that's what I went with. I ony can describe this film in one word: Terrific. I was never really a huge X-Men fan, but because the acting, story and pacing were all well done, it might make me watch the ones that I haven't watched, then re-watch the whole series ready for Apocalypse in 2016."}, {"rating": "10", "text": "X-Men: Days of Future Past is a terrific example of how a superhero movie SHOULD be made. From its terrific dialogue to its amazingly charismatic cast members, DOFP is one of the very best comic book movies ever created."}, {"rating": "10", "text": "The Best X-MEN Movie !!!\rThe action scenes are epic and memorable. With great performances, Incredible special effects and a Spectacular script !!!\rX-men is the best marvel movie forever!"}, {"rating": "9", "text": "I am not all that familiar with X-Men, but this movie was AWESOME! I really liked the time element to it and the best part of the movie is when young Xavier meets old Xavier through Wolverine's head. The action was great, the ending had sort of an Inception feel to it, with multiple climaxes going on at once. My only gripe was that they tried to tie in the Kennedy assassination and the Cuban Missile Crisis into X-Men lore. I found that to be a little cheesy. The sentinels were awesome to watch, and the movie is polished, fun, and entertaining. 9/10"}, {"rating": "10", "text": "This is the best X-Men movie. Great history to reboot the franchise. Amazing Action Scenes, great history.... great characters. My favorite X-Men movie ever."}, {"rating": "10", "text": "DoFP was an amazing movie. It will definitely be put down as one of the best super hero movies. By far better than all other X-Men movies including First Class. This movie is a must see in theatres. But, I recommend catching up on past X-Men movies if you haven't or else the plot could be confusing. DoFP was exciting, funny at the right moments, and had the right amount of action all super hero movies should have. Go see it in theatres before it's to late! I know I'm going back!"}, {"rating": "10", "text": "By far the best X-Men movie with smart plot, genius story lines to tie up loose ends!  Love, love, love it!  And of course,  Mystic, was AMAZING!  Biting my nails and covering my eyes with suspenseful thrill!  Fun, fun!"}, {"rating": "10", "text": "Michael fassbender(magneto)...james mcavoy (professor) gives the emotional TOUCH...wolverine(hugh jackman) balances The story...mystique(jennifer lawrence) Keeps the story moving...Quicksilver PRISON BREAK 1 OF THE BEST SCENE IN THE MOVIE(THE MOST TALKED)....other mutants impress us with their HEROIC fights...1st half is full of fights n action...2nd half drama...music n vfx is big plus.... worth the check...Best x-men part so far.. SATISFIED very much... must watch movie for x-men fans.. DIR.Bryan Singer Had done a great job..he has lead x-men to a new dimension...erasing the previous parts n its flaws making this franchise nearly flawless.....as the events are changed(the past)....and bryan made the audience Lead to high expectations fr X-MEN:APOCALYPSE..will he deliver????"}, {"rating": "10", "text": "My favorite films of this summer so far. Dawn of the Planet of the Apes and,  X-Men: Days of Future Past, and lets see if Guardians of the Galaxy is gonna be a good movie, i'm excited to see Guardians of the Galaxy this August."}, {"rating": "10", "text": "This movie and X-Men 2  are my my favorite movies Its better then  X-Men 3,   this movie was AWESOME!! SUPERB!! , the story and great acting easily the best X-Men film since X2."}, {"rating": "10", "text": "Movie of this year,  Interstellar . Dawn of the Planet of the Apes.  Guardians of the Galaxy.  X-Men: Days of Future Past,  Cant wait for Apocalypse. the cast is incredible in X-Men: Days of Future Past"}, {"rating": "10", "text": "Only the Dark Knight surpasses this film in the genre.  From beginning to the scene after the credits (it is after the full credits, by the way) Days of Future Past does not disappoint as an epic and satisfying conclusion to the earlier films, while setting up lots of new drama and intrigue for the next films.  Almost all of the performances were completely spot on with particularly good performances from Evan Peters (Quicksilver), Fassbender (Magneto) and both versions of Charles Xavier.  In addition, the action was well orchestrated and creative with more than enough drama and power behind it.\r I look forward to any number of sequels, in particular with what they hinted at for the next film."}, {"rating": "9", "text": "One of the better comic book/super-hero movies this millennium at the least. Brilliantly ambitious and innovative plot line. Had me skeptical at first considering the 4 previous X-Men plus the 2 Wolverine movies had their own plot elements that had to be accounted for, but they were incorporated spectacularly. Great action scenes, well rendered CGI while not being too dominating and disenfranchising. Great script and as per usual when you have Ian McKellan and Patrick Stewart, phenomenal acting."}, {"rating": "9", "text": "Fantastic film, I really enjoyed First Class and was eager to see the sequel as soon as it ended. I'm not a huge X-Men fan, and haven't really followed it that much in terms of comics and its previous films. I have seen X-men 1, 2 and 3. But I haven't seen the Wolverine films.\r Days of Future Past is very entertaining throughout the entire film, very well done and enjoyable. Although the storyline isn't complex the action is where the heart of the film is, and I enjoyed every second of the film."}, {"rating": "8", "text": "Easily the best \"X-Men\" film since Singer's original attempts, \"X-Men: Days Of Future Past\" features a challengingly novel narrative structure, intensely engaging set pieces, and a bevy of memorable moments of pathos. And, although the film leaves many questions and thread left to be resolved, it still represents a magnificently satisfying return to form for one of cinema's first superhero franchises."}, {"rating": "10", "text": "This movie was made out of pure excellence. The movie is by far one of the best x-men movies in the franchise. Bryan really did an amazing job with this movie. The acting is really great but my one complaint is that Ian McKellen didn't get much too say in this movie, just a few sentences. However looking past that I don't see more mistakes with it. I am probably gonna re-watch this movie again soon. I recommend this movie to anyone even if your not a huge X-men fan."}, {"rating": "8", "text": "The Great: My favorite part of the film is the speed mutant. It was just so cool to watch him in action. But if he had stuck around for the rest of the film, it would be too easy.\r Great ending as well - we get to see all the changes in the timeline, and showing Jean and Scott as a small tribute and connection to the original X-men trilogy was nice. But most importantly, the older timeline is still remembered by Logan; so the previous timeline we saw still holds some meaning.\r The good: Great humor - especially with Wolverine. Great action. The young versions of the heroes were handled very well - like making Young Charles a drunk / druggie, so he has something to overcome if he wants to save the mutants. They did a good job with building the characters of the three key heroes - Mystique, Xavier, and Magneto. The chemistry between Fassbender and McAvoy was great just like in \"X-men: First Class\", and I liked how even though they reconcile, Magneto still decides to do things his own way and act as the villain.\r The bad: very formulaic story with tons of exposition. Like Young Charles not wanting to help Logan and then agreeing after a 10 second shot of Raven's picture. Or the X-men in real time being attacked right when Logan is about to succeed in his mission. The plot was incredibly predictable and everything is done by the Hollywood formula. Also, some of the character decisions (primarily Magneto) were pretty stupid - if he had just talked to Mystique after they stopped the assassination, there would be no point for the escalation that followed.\r Overall though a very solid entry in the superhero genre and the X-men series."}, {"rating": "9", "text": "X-Men: Days of Future Past is the best X-Men movie to date, and it totally broke my expectations!\r This new X-Men movie is so incredible, there’s so much unique and awesome things that blew my mind of when I saw this film. The return of Brian Singer to the X-Men franchise totally is the reason why this movie is so great, which means that The Last Stand could have been great if he had direct it. Days of Future Past is one heck of a movie, and I never got bored because it’s so damn well made and entertaining! The opening scene is incredible, and both the CGI and the actors are all superb.\r X-Men: Days of Future Past is the best sci-fi movie of the year (to date), and one important aspect is the awesome soundtrack from John Ottman, truly a wonderful soundtrack! The best thing is of course the story, they are changing the past for a better future, and the result of that is so great, because we don’t know how much have changed after the events in DoFP! That’s why I can’t wait until the next X-Men film! There are some downsides like vague CGI at some places, and it got a bit confusing with the time travel, but it’s still an awesome movie!\r This is one of the best films of 2014!\r X-Men: Days of Future Past get a 9/10"}, {"rating": "9", "text": "This was a good movie. The Sentinels were perfect. The only reason that the movie wasn't perfect was because the plot was extremely similar to Terminator 2. It wasn't a straight on copy, but anyone who has seen Terminator 2 before seeing this will know that they're very similar."}, {"rating": "9", "text": "Marvel, man. They have been on a roll! They are pumping out movies nonstop, and in return, money is raining on their heads. Heck, they're now the highest grossing movie franchise EVER now! However, all this   doesn't mean that they rush their movies, nor do they act like they just want money for their movies. They put such care and attention into their films for all their devoted fans. Guess what? X-Men Days of Future Past is just like the other Marvel films in terms of quality, if not better! At the core of every Marvel movie, their true genre is action. One-on-one fight scenes with hero and villain, countless numbers of structures falling down, explosions (not to a Michael Bay degree though), it's awesome action. So of course, DoFP has amazing action with all the X-Men. I loved seeing their mutant powers come to life and then watching in awe as they kicked ass. Speaking of the characters and their powers, all of them are truly brought to life. While the acting is nothing revolutionary, everybody still does a fine job. I especially liked Michael Fassbender's performance as Magneto. He really acts like a menace sometimes (which he will do more than often in the movie), and there's not a better pick for a character that's supposed to be cruel than him. The title of the movie gives you some hints about the storyline, right? Well, what happens is that the world is getting eaten up by the Sentinels, and they are still trying to kill every mutant they can find. The X-Men soon figure out someone must go into the past with Kitty's powers to change what happened. I will not lie, you will have to pay attention most of the time. It wasn't a problem for me, though. While it's not the most original Marvel storyline you've ever heard, it's still interesting enough to keep you entertained. In terms of flaws, I really couldn't detect any. Does that mean it's a 10 out of 10 masterpiece (12 Years a Slave is considered that score imo)? No. Yet still, DoFP is still gonna be one of best Marvel movies you've seen. All these positives really add up into being a great time at the movies. It's worth it. GO SEE IT!"}, {"rating": "9", "text": "The movie is incredibly sexy especially with Hugh Jackman and Jeniffer Lawrence showing off their bodies in ways kids wouldn't understand. If you think about the plot... Don't even start thinking about it. It's mindblowing since it used the element of time. The movie has a good mix of drama and action, just what I would expect from Bryan Singer, the director of the Xmen movies. For Marvel fans out there this movie is a ****\rOverall, it was a great movie for everyone especially the kiddies who enjoy action (just guide them correctly when they start seeing fleshy bodies)."}, {"rating": "10", "text": "X-Men Days of future past is the best X-Men Movies so far.Bryan Singers is back to play with his toys and make a good film out of it tat many of us enjoy watching it.X-Men Days Of Future Past is a great movie to watch."}, {"rating": "10", "text": "Who: Hugh Jackman, Katniss, and a ton of other cool X-Men unlike that lame First Class BS. The coolest mutant in that movie was a dude who shouted at water so he could fly.\rWhat: The best super hero movie ever made hands down\rWhere: A wonderful, wonderful world where both Ian Mckellen and Michael Fassbender can be Magneto\rWhen: May 23, 2014\rWhy: Bryan Singer made this film to make up for the utter garbage that followed X2. What? Some other director ruined the end of my trilogy? What? This new trilogy is off to a shaky start? Let me fix BOTH problems with one movie and restore everybody's faith in the X-Men. Ten minutes into this movie I turned to my friend and said, \"This is gonna be better than Avengers\" and sure enough, I was right. This movie has the best ending to a superhero movie I've ever seen, literal jaw-dropping action, and the best utilization of The F Word in a PG-13 movie."}, {"rating": "5", "text": "If this were not an X-Men movie then it probably deserves a 7 or 8 but the problem is that in the title, it says X-Men. Thus when I review this, I assume it has relations to previous X-Men titles and since that was the reason I went to see this film, the movie fails. Now the question is how do I rate it? Do I rate it as a stand alone movie? Do I rate it as a horrible sequel the previous X-Men films? If someone wanted to write a movie like this, why couldn't they create a new franchise? Why did they need to milk the X-Men name for a few more viewers and take a chance at destroying the franchise (this is one of two reasons why comics died in the 90s)? There was no loyalty to the fans and the companies made it obvious that all they wanted was money when the fans wanted continuity and a good story. This is dishonest in my opinion so I am going to review it as an X-Men film.\r The effects were good but honestly this is the 21st century and those effects really dont pop out any more. I didnt see anything new so no bonus points for innovation.\r As an X-Men film following the X-Men continuity of previous films, there are too many plot holes in the story. I wont go into every detail because the list is much too long but here is quick summary.\r 1 - Xavier is alive. Even if we assumed he jumped bodies, why is he still in a wheelchair? Stupid stupid stupid writing.\r2 - Quicksilver could have accomplished the entire plot goal on his own... but he was not brought along for the ride. They just sent him home to watch tv while the world was on the brink of collapse.\r3 - Stryker is not the same person from older movies yet logan remembers him as the guy from the old movie. Note that in both movies, the time is 70's. In the old movie, he was 40s-50s. In this movie he is in his 20s. What?\r4 - Wolvie got adamantium claws in the future... but he lost them in the Wolverine movie."}, {"rating": "8", "text": "It isn’t just the Xs and Os that make the film special; it’s also the film’s ambition, which cannot be understated.  This film is being released in a post-Avengers world, where culmination is king (see DC/WB’s recent Justice League-related moves as evidence), and the X-Men franchise comes into this picture as considerably fractured.  The original “modern day” team – Wolverine, Professor X, Cyclops, Storm, etc. – petered out with the third entry, only Wolverine has had any success as a stand-alone spinoff, and the First Class “prequel” was immediately hailed as the best of the entire lot, leaving the original to be forgotten.  Rather than reboot the whole shebang or focus on a specific First Class sequel, Singer instead doubles-down and incorporates old and new.  Granted, he mitigates some risk by keeping the focus on only the best characters from the two worlds, but his faith in incorporating anyone from the old world other than Wolverine, and his willingness to cut bait on some of the lesser characters from the new world, speaks to his confidence as a filmmaker."}, {"rating": "10", "text": "I have nothing more to say than pure awesomeness! it was definitely the best movie i 've seen this year. I might even say it was the best marvel movie. the actors were great and i loved that it combined the cast from the trilogy and from the first class. some might say the plot was a bit confusing but i think that it was what it made this movie special. i couldn't ask for anything better from x-men. i highly recommend it. if you love fantasy movies don't even think about it just watch it!"}, {"rating": "8", "text": "X-Men Days of Future Past Is a great movie and a great entry for the X-Men Franchise.The movie has a great plot and a great action sequences.The characters are entertaining and has a great chemistry ,the old and the new cast are fantastic in this film but the old cast are just their helping to stop the robots that can execute mutants but at least they are there.Performances are excellent in this movie.\r The plot is interesting and well realized but It may have an effect on it's timeline and might get confusing.The action scenes were very good especially the new addition Quicksilver , Evan Peters did a good job,which was one of the most memorable scenes in any X-Men franchise ever.\r The characters what makes the X-Men great not the action unlike Apocalypse which they forgot about it.The ensemble of characters here is well delivered and gives some character developments throughout it."}, {"rating": "10", "text": "The perfect summer blockbuster and the best x-men movie yet. I loved this movie and it is my favourite movie of the year so far. ABSOLUTELY PERFECT. YES IT IS THAT GOOD. 9.610."}, {"rating": "10", "text": "No need to do pros/cons for this one I loved Days of Future Past! It is the perfect X-Men movie! Almost as good as First Class. Everyone in this movie put on a great performance, the action/set pieces were great, the story was done very well and that's saying something because it is a time travel movie, and a great underlying message of hope. Bryan Singer did a great job in his return back to the franchise, not sure if he'll ever do one again now, but if he does I'm eagerly awaiting the next instalment."}, {"rating": "10", "text": "I'm gonna start by saying that I'm not a huge X men fan but I am a big fan of Wolverine and Jennifer Lawrence's take on Raven, I've seen every X men movie now and I honestly thought this series wouldn't reach a level that would go higher then X2... but man was I wrong, this movie was excellent in every sense of the word, the pacing was perfect, there was a lot of comedic moments that I didn't expect, I will say that there's a sequence with Quick silver that's worth the ticket price alone, what surprised me the most however is that out of all X men / Wolverine movies this movie by far the least amount of action, proving that these Super hero movies don't need to be filled with wall to wall action to be an excellent Super hero movie, this wasn't just a good comic movie, it was an excellent movie... I've heard this said by a few reviewers but until I saw it I wasn't going to comment on it...\"If this movie doesn't get a best picture nomination I will be appalled\" I agree with that statement, giving this movie a 10 feels like an insult but since that the highest the scale goes it's a 10."}, {"rating": "8", "text": "The writers of this very exciting film were clearly BIG fans of the original Matrix, and, by extension, Plato's Cave.  Beyond the obvious use of the name Sentinels, the future sequences were very similar to the out-of-the-matrix mothership, and the past sequences/locations were similar to the inside-the-matrix sequences.  Not literally, but the sense of urgency and juxtaposition.  See it and decide for yourself.   Beyond that comparison, the acting in this film is superb.  Best superhero flick of the summer - not a tough task."}, {"rating": "10", "text": "In every level this movie has been the most complete marvel movie ever if not the greatest: The scenario is saturated with events that does not seem to distract you away from the main plot, we have a justified and well portrayed villain (magneto) which is non-existant in the marvel universe (except loki who might and probably should be considered as an anti hero after thor 2). I also do not know any other marvel movie that keeps this many characters and does not give you the feeling of the movie is overcrowded with too many shallow characters. The movie is emotional; not in a very dramatic way but it is able capture its thematic emotion: \"Hope\" because you get to feel some of the characters' feelings of desperation and their path of self destruction, you also get to see that this may fail no matter what you do but at the end hope wins and you get to experience this effectively due to great performances of the main characters."}, {"rating": "9", "text": "Best X-men yet. An intriguing plot, likable characters, awesome action and a small dose of humor make this the best flick of the summer so far. The acting was terrific, with great performances from Michael Fassbender, James McAvoy, Hugh Jackman, Peter Dinklage and Evan Peters. Speaking of Peters, Quicksilver was a big surprise and the highlight of the movie, eliminating all earlier complaints about his design. DOFP leaves a tough act to follow for the rest of the summer. Must-Watch"}, {"rating": "10", "text": "X-Men: Days Of Future Past is vibrant and entertaining movie, The effects are incredible and  X-Men: Days Of Future Past has found the right balance, i'm excited for X-Men: Apocalypse (2016)."}, {"rating": "9", "text": "I was pleasantly surprised with this movie. Very entertaining, wonderfully done and was a great way to mix together the two cast. Love it and loved the ending."}, {"rating": "10", "text": "Marvel is really on top of their film game, with a great Captain America, a decent Spiderman, and now a truly excellent X-Men, all in the same few months.  And if you think about it, they are veritably ruling the film world.  Look at the ensemble of actors in this movie.  Where other than a Robert Altman movie are you going to find a cast of people together like Ian McKellan, Hugh Jackman, Halle Berry, Jennifer Lawrence, James McAvoy, Michael Fassbender, Ellen Page - the list goes on and on.  What's more remarkable is that this cast works deftly together in a film that could have been a sloppy disaster.  Time-travel movies when done right are some of the most intriguing movies ever - but if done wrong, they are excruciating.  Luckily, Days of Future Past gets it all right, and the only drawback is all the expository, supporting dialogue the audience must therefore endure along the way in order to understand it.  The bad guys in this movie are truly bad.  If the Sentinels show up, they are going to kill you, and this is established right away in one of the most exciting superhero/villain fight scenes in any comic book movie to date.  Seeing Colossus become full metal at the same time Sunspot flames on at the same time Iceman (finally) goes and stays full Iceman - a very cool moment.  Unfortunately even these powerhouses are no match for the Sentinels.  The only option is for newly-introduced (but now regular X-Man) Blink to keep them moving around until Shadowcat (with a future developed time/spirit manipulation power) can send newly-introduced Bishop just far enough into the past to warn the team that the Sentinels are approaching - so they can not be there when the Sents arrive.  This is layer one.  Layer two then is this first group combining efforts with the other group (Storm, Wolverine, Prof. X, Magneto) to send someone way back in time to before the Sentinels were even created.  This task falls to Wolverine and off he goes into the second layer (the 1970s, pre-Sentinels) in an effort to stop Mystique from.... wow.  The more I write the more I realize how convoluted this plot is.  It's like trying to explain to a non-viewer what's going on in Game of Thrones.  Pretty soon you just throw your hands up and say, \"You know what?  Just watch it!\"  And so that's what I'll do.  What works in this film is the excellent acting, the dark plot, the nearly-full roster of Superheroes, and the best scene in an X-Men movie since Nightcrawler's debut in X2 (hint:  Quicksilver, and anyone dealing with a Quicksilver or Flash-type character in the future must now contend with this scene setting a certain bar for excellence).  There are a few disappointments.  Anna Paquin will show up as Rogue for a second at the end, and I understand her deleted scene(s) will make it onto a DVD/Bluray version.  But for this primary showing, she's notably and confusingly completely absent.  The action scenes in this movie range from the terrifying Sentinel attacks to the now-typical \"huge Magneto scene\" - this time with him moving an entire sports stadium, to a lot of smaller scenes spread throughout - and they all work.  The special effects are fantastic and nothing feels gratuitous (except when they are going for 100% gratuitous, as in the Quicksilver scene).  The story holds together and the dialogue, while mostly expository, is good.  It's my personal favorite of the series so far (you might be surprised to know that The Last Stand was my favorite until now - typically the one everyone hates - but I'm a sucker for new heroes and villains showing up, and X3 brought a lot of new faces into the series - even if Juggernaut was a huge letdown - the Phoenix climax was epic).  Days of Future Past ups the ante on everything and makes me hungry for the next installment.  I think they're being smart with this series - phasing some actors out and others in - because this bodes well for this being a series with a real lifespan well beyond where we're at now.  If you're new to the series, by all means don't start with this one.  Start at the beginning.  But if you're already an X-Fan, you're most likely going to love this movie."}, {"rating": "9", "text": "I love science fiction and I hate superheroes, but I credit the X-Men series with giving me an appreciation for them. X-Men has showed me that in the proper context, with some great writers, superheroes movies don't have to be the lowest form of sci-fi entertainment. Days of Future Past seemed to confuse some people, as it's not part of the trilogy and therefore it's timeline is off. The ending of the film also creates a paradox, which eliminates certain mistakes made in the other films. In layman's terms, some of the things that happen in the other X-Men movies, never happen, because of Days of Future Past. In an undetermined era, sometime between the end of the original film and Last Stand, a new enemy has been targeting mutants. These machines, meant to eliminate the mutants have malfunctioned and are now targeting humans as well. The machines are made with mutant DNA and therefore have the combined forces of all the mutants it's come in contact with, making them unstoppable. The only chance the X-Men have is for one of them to go back in time and stop the machines from ever being built. Wolverine is the only one with a mind strong enough to survive the trip and is sent back to the 1970s, where he meets the cast of X-Men: First Class. While difficult for non-sci-fi aficionados to understand, this film was not only extremely well written, but serves dual purposes for the series. First, it brings both casts together in an extreme fashion and it's a tremendous gift for the fans. Second, it allows the writers to undo mistakes from The Last Stand, which was at the time, set to be the final X-Men film. The ending to Days of Future Past, effectively explain that everything that happened in Last Stand, never happened, as it was part of an alternate timeline. This allows the writers to bring back characters like Prof. X (who is seen killed in that film) for possible future films. It really was an ingenious move for the franchises future, but it also allowed fans to experience the \"old timers\" and the \"new class\" working together, in a huge, diverse, and very impressive cast. Seldom are superheroes films so complicated or as well written as Days of Future Past. The writing is out of this world, the cast is full of stars, and the special effects were absolutely amazing. Love it or hate it, superheroes are part of the science fiction genre, but Days of Future Past was simply incredible and for that, it's our latest must see movie!"}, {"rating": "9", "text": "Even better than its already impressive predecessor, Days of Future Past is definitely Singer in top form - whether its the deft handling of the ensemble cast, sleek visuals or inherently humane story. Definitely the most fun I've had at the movies in a long, long time."}, {"rating": "7", "text": "I was impressed considering these type of movies are not up my alley. The action was consistently engaging and innovative. The story doesn't get weirdly obscure like other similar movies."}, {"rating": "10", "text": "X-Men: Days of Future Past is the best X-Men movie ever. It's big, original and has purpose. It clears the past mistakes of the franchise by promising us a brighter future. The broad cast is as good as they've always been. Unlike, this year's Godzilla, marketing of this movie promised a great movie and it matched its expectations."}], "recommendations": ["x_men_apocalypse", "black_widow", "man_of_steel", "avengers_age_of_ultron", "captain_america_the_first_avenger", "looper", "creed_ii", "edge_of_tomorrow", "super_8", "the_hunger_games_catching_fire", "wonder_woman", "fantastic_beasts_the_secrets_of_dumbledore", "captain_america_the_winter_soldier", "avengers_endgame", "top_gun_maverick", "twelve_monkeys", "back_to_the_future_part_ii", "the_magnificent_seven", "the_13th_warrior", "spider_man_far_from_home", "thor_ragnarok", "thor", "maze_runner_the_death_cure", "eternals", "bumblebee"]}