{
  "id": 4533,
  "title": "X-Men Origins: Wolverine",
  "starring": [
    "Hugh Jackman",
    "Liev Schreiber"
  ],
  "runtime": 107,
  "genre": [
    "Adventure",
    "Action",
    "Thriller",
    "Science Fiction"
  ],
  "description": "After seeking to live a normal life, Logan sets out to avenge the death of his girlfriend by undergoing the mutant Weapon X program and becoming Wolverine.",
  "releaseYear": "2009",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/yj8LbTju1p7CUJg7US2unSBk33s.jpg",
  "categories": {
    "plot": 4.120689655172414,
    "acting": 3.627450980392157,
    "ending": 4.166666666666667,
    "soundtrack": 2.0,
    "cinematography": 5.0,
    "familyFriendly": 3.5,
    "funny": 2.3333333333333335,
    "action": 3.5384615384615383
  },
  "reviews": [
    {
      "rating": "4",
      "text": "It's just a mess. The film rushes through so many things and doesnt give you any time to settle and as a result, you just don't care about most of the characters and some things are hard to follow. The acting and writing has many problems and overall its just hard to enjoy this film."
    },
    {
      "rating": "4",
      "text": "Wolverine is one of my favorite comic book characters that makes this film all the more painful.  Although Hugh Jackman does a great job the story is just silly."
    },
    {
      "rating": "5",
      "text": "I so wanted this to be brilliant, after The Last Stand being average. Well, this film is very average The film is filled with plot holes, like why the hate between wolvie and sabertooth? I understand, wolverine wanted revenge for his love, but if she turned out to fake her death, and died from a guards bullet with wolvie and sabey fighting weapon xi side by side, it doesnt add up to their hatred in x men 1. also, why wait 6 years to enact their plan? and when wolverine hears kaylas cries, then appears to save her, whys his shirt suddenly dissapeered? Gambit wasn't really needed during the last part. All he on the island did was save wolvies live once and see the kids go off. The way Wolverine was made to forget wasn't ridiculous. In the comics, another character (with similar healing abilities) got shot in the head by an adimantium bullet also, and they too lost their memory. The film did seem to key itself into the x men saga, what with cyclops, emma frost and xavier in the film, but it seemed keyed in a little too neatly. The actors played their roles pretty well though. Hugh Jackman, Liev Schrieber, Ryan Reynolds, great acting. Mr Reynolds' portrayal of Deadpool (my fave Marvel character) was pretty good, quipping and the awesome fight scene at the beginning. But once he became Weapon XI, with his mouth sewn up, it became a bad portrayal of the character. Nethertheless, this film has garnered a spin-off Deadpool movie, so we gotta give them props on that. It does seem a little too fan pleasing, giving us all these x men characters within this film, and a few of them seemed to be there just for the hell of it (The Blob, will.i.am and Domonic Monaghauns characters) It should've been better though"
    },
    {
      "rating": "4",
      "text": "Don't give a drama director an action film.  That's a lesson that Hollywood should learn with this stinker. It cost $150 million dollars...and none of it showed on screen. Hugh Jackman is great as always, but the whole film felt like an apology for X Men: Last stand. Liev Schreiber was also quite good in here as Sabretooth. But the whole film felt disjointed and anemic."
    },
    {
      "rating": "4",
      "text": "Disappointing origin story for a character who was already overexposed. The story is lacking, with the only moment of interest being the scene we already knew happened. When Wolverine fights, there is no sense of urgency because he cannot die, a fact that is never explained or developed in any way. The action can be cheesy and the acting mediocre. There are some nice cameos from other X-men characters, such as the Blob and Gambit but this remains an unsatisfying installment in the series."
    },
    {
      "rating": "4",
      "text": "It's a fun action movie but is too light hearted than the previous movies with a simple storyline and boring characters and over the top action scenes. The best part of the movie is that Wolverine has his own movie at last killing bad dudes."
    },
    {
      "rating": "5",
      "text": "Poor and predictable script, Wolverine: Origins wasted chance iconic character tell his start in film full of meaningless action, although Hugh Jackman."
    },
    {
      "rating": "5",
      "text": "X-MEN ORIGINS: WOLVERINE is quite disappointing.  The title hints that it centers on Wolverine (Hugh Jackman), which is totally, absolutely true, but who knew that we wouldn't get to see all the other X-Men that we love in this one?"
    },
    {
      "rating": "2",
      "text": "The worst superhero movie out there by far. Do not watch if you value the X-Men franchise at all. If you don't value the X-Men franchise there are plenty of better dumb blow 'em up movies out there. Written by movie executives as it completely ignores all the origins work done in X-Men 2. Deadpool is reduced to a boss fight. The characters are almost universally dull.\rArrrgh I hated this movie."
    },
    {
      "rating": "4",
      "text": "I'm definitely on Hugh Jackman's side because what Fox did to the Wolverine was making a blah origins story that doesn't need to be tinkered with. I guess The Last Stand was a better but decent advantage of the X-Men films altogether, but Origins: Wolverine is the weakest of them all. I felt that the film was just too rushed to begin filming this snooze and look what they did to Deadpool! Unlike the recent awesome Deadpool movie, Origins, however, was supposed to be a badass spandex-wearing anti-hero (with a mask) who has nothing to do with the entire X-Men crew, but then Deadpool started to go all grumbling and that's why things starting to get even worse. The plot was alright, but the CGI visual effects have run its course. I have nothing to say about Hugh Jackman's performance as Logan/Wolverine. I'm very excited that he nailed it through every segment of the movie. I hope he'll be fine in the now R-rated Wolverine 3 movie and finally sealed the deal on Wolvie's fate. Sucks to be this movie, but it doesn't need to be light, it just doesn't need to be polished, it needs a taste of excitement. Just a matter of time a time to rent this movie and skip it for good until X-Men Apocalypse."
    },
    {
      "rating": "5",
      "text": "This movie is a dissapointment. But is it **** No. You see the movie does answer the overall question: How did Logan become the 'Wolverine'? Hugh Jackman did a good performance though in this film. But the screenpkay is uninspiring and the CGI is poor."
    },
    {
      "rating": "1",
      "text": "Jesus Christ was this terrible. The CG on the claws was laughable and Deadpool, one of my favorite marvel characters, was utterly ruined in foul swoop with this trainwreck. Hopefully The Wolverine can redeem it."
    },
    {
      "rating": "9",
      "text": "\"X-Men Origins: Wolverine\" tells a beautiful originstory of the hardened lone wolf Logan, aka the Wolverine. The humor, the action, the romance, the pacing, it all works out incredibly well. The only downside... is Deadpool. Poor Pooly."
    },
    {
      "rating": "2",
      "text": "The script is dominated by a thorough lack of imagination as well as pointless and cringe-worthy winks at the audience. This film relies so heavily on special effects that it is, ironically, not particularly entertaining."
    },
    {
      "rating": "2",
      "text": "This is the only movie I've ever watched that I could do a better job of directing than the man who actually did it. With excellent actors playing the key roles of Wolverine, Sabretooth, and Deadpool; good actors for the rest of the roles; a decent special effects budget; and a script that could've been a good movie with some minor adjustments.\r The movie isn't absolutely terrible. It would be hard to make something absolutely bad with everything it had going for it. But what it has is inexplicable off-camera deaths, poorly arranged cookie-cutter action scenes that seem to be simply a matter of showcasing people's abilities, and completely insane themes and adjustments.\r A character is implied to have died off-screen, killed by a character who it is difficult to imagine actually hurting them. A seasoned combat professional shown using assault rifles during his military career is shown attempting to defeat someone in unarmed melee combat who he literally cannot cause an injury to in that way. A character is shown climbing a wall at the beginning of a scene before others enter an elevator, and simply vanishes for the rest of it.\r This film's director made numerous terrible, unforgivable mistakes, all of which could have been resolved without substantially altering the budget or storyline, some of them while actually decreasing it, such as a ridiculous scene near the end involving fighting in a power plant with mouth-covering makeup on a character(and actor) known for his witty dialogue."
    },
    {
      "rating": "3",
      "text": "I was slightly disappointed in this film. My expectations were high after having seen the previous X-men. This film did fill in some gaps, but so much of the film consisted of unnecessary scenes. They did the same mistake as in the previous X-men, but to a greater degree: introduction of many new and interesting characters, most of which were underdeveloped. Characters like Bolt, the Blob, Agent Zero..Ryan Reynolds as Wade Wilson! Would you not have liked to see more of him? But no, we get a few minutes of Wade in the beginning, and a few minutes of Deadpool in the end. It seemed like a waste of talent from the actors that played all of the aforementioned characters. I believe it would have been so much better if they had just stuck to the central plot and the central characters: Wolverine, Sabretooth, Stryker, Kayla and a little more of Gambit. The best bit of the film was the relationship between Sabretooth and Wolverine, but even that was underdone by the main culprit  poor writing. At least the action scenes were sorta OK!"
    },
    {
      "rating": "5",
      "text": "Hugh Jackman gives it his all, but unfortunately, the story is too cluttered with unnecessary plot points, failing to go truly in-depth into a real origin story. On the bright side, the film contained plenty of engaging action sequences to keep the mind off the overall sloppy script."
    },
    {
      "rating": "3",
      "text": "After our favorite mutants (and Storm) went head to head with Magneto, government black ops groups and the biggest villain of them all, Brett Ratner, Fox decided to delve itself into the history of the franchise's most popular character. Because demystifying the mutant whose likeability comes from his enigmatic past and personality is the best way to go.\r Also, let's not forget, X-Men Origins came after the hate crime The Last Stand was. So expectations weren't high. People just wanted a decent, entertaining piece of cinema with some good action. And the trailer wasn't that bad, so a glimpse of hope was on the theatrical horizon.\r While it didn't accomplish all of the above... it was still a piece of something (The 'S' doesn't stand for hope in this one).\r The \"plot\" revolves around the history of its title character, how he got to know some of his later foes, allies  like screaming  and his trusty leather jacket. We also witness the way he goes through the well-known Weapon X program and a nuclear power plant. So the epic quest of revenge against its source material goes on.\r Before anyone assumes this is going to be a long movie rant, be calm, that part comes later. First and foremost, let's get the  sort of  good parts out of the way:\r -It killed Will i Am's acting career.\r -The 2 aforementioned actors at least gave an effort. If you like Liev Schreiber (who plays Sabretooth/Victor Creed) in this, go watch Ray Donovan, but if you like him from the show, step away NOW.\r -This bizarrely spawned one of the best movie tie-in games in recent memory.\r -The real life depression documentary of Kevin Durand. Only after his stress eating did they decide to include Blob in the movie.\r Now let's claw our way into the bad:\r I'm still very much inclined here to say everything (which equals screaming and jumping from scene to scene). But what the hell, let's have some fun.\r -The characters/actors  I mentioned Schreiber and Jackman and their attempts, but despite their efforts, there's the dialogue. The difference with the other actors is they just didn't care. Look, its discount Kevin McHale. Just give him that mustache already and let him write Mein Kampf 2 or whatever.\r -And there's a version of Wade Wilson here, played by Ryan Reynolds. Before his transformation, he's a fast talking, snarky crazy person with swords and guns. After then he even tries to get into character. I won't lie, I liked it. But what happens to Deadpool  whose main trait is talking till his enemies go insane  when he gets hit by directorial lightning? If you're answer is HE GETS HIS MOUTH SEWN UP and is given laser eyes, ability to teleport and retractable katana arm bones and you didn't even see the movie, you shouldn't be allowed to have pillows or use door knobs. This is the cinematic version of vegan bacon.\r -The other characters aren't represented better either. They're all unrelatable and unlikable 2 dimensional screaming seizures waiting to happen. Somehow their interactions don't seem organic or entertaining either. From Gambit to the Blob, Emma Frost, Scott Summers, etc. everyone's getting the cinematic middle finger.\r -Awful CGI  Before the movie came out in theaters, a pre-post production screener was leaked online. It all depends on if you like your hookers with just AIDS, or with slight makeup on as well.\r -So this is a mindless action movie with bad action. I too love to eat my cereal after flushing the milk down the toilet.\r - And the formerly practical, now CGI claws look like the director's son loved Wolverine and knew how to use MS Paint.\r -The \"plot\"  As I said, it stripped the mystery from our enigmatic lone wolf AND he even gets 5 minutes of slap-stick comedy with his \"new\" claws (which basically should work the same as before, they're just covered with Adamantium now).\r - For unknown reasons, the Weapon X program wants to kill Wolverine after they turned him into an  even more  unstoppable killing machine. That's almost as smart as trying to stop the Hulk by making him angry.\r - Instead of showing us more than 3 minutes of battle scenes from all the wars Logan fought, we get a special episode of Twilight in the Woods... And they don't even play mutant baseball?!\r - DODGING THE (Adamantium) BULLET. Throw a bath sponge at Sponge Bob's head and he'll get permanent amnesia, because that makes sense. Oh well, at least someone gets the luxury of not remembering this.\r -Oh, and WILL I AM.\r Closing remarks-This is part of why critics won't take comic book movies seriously. I say this movie should've been rated R for mentally challenged. Also, it's sad that after X2 I had to wait 8 years for the time when the nemesis of the X-Men isn't a movie director or screenwriter. I know a comic book series with the same title exists, but from what I read, that's stupid too. You don't have to make pizza out of (rotten) broccoli, okay?\r On a scale of 1 to 10 X-Men Origins: Wolverine gets an invitation to the dead pool."
    },
    {
      "rating": "3",
      "text": "X-Men Origins continues to weaken a once great series.\rNearly everything about this film is a misstep. The casting was completely wrong, the action is between okay and poor, and the story is terrible. The movie's premise itself was unnecessary to the series and with poor execution really damages it. Hugh Jackman just feels like is cashing a paycheck with the group of poor actors put around him."
    },
    {
      "rating": "4",
      "text": "Or so the story is not very interesting, has some script failures, the fight scenes are weak, and made the story of an interesting character, pretty boring tiring, which is a shame."
    },
    {
      "rating": "5",
      "text": "Hugh Jackman is the only thing good about this film. The rest of the film is dumb, filled with massive holes, repetitive, over-familiar, overstuffed, and quite frankly, pretty boring."
    },
    {
      "rating": "4",
      "text": "This movie is the definition of an underwhelming disappointment. 'X-Men Origins: Wolverine' is a CGI-ridden, thinly told, loud and sometimes confusing installment to the \"X-Men\" franchise.\r The movie starts where we see the title character, whose real name is James, as a young child. We also see him with his older brother, Victor Creed, who we later remember as \"Sabretooth\". James sees that there is a strange man lurking in his house who ends up killing who he thought was his father, and the young James ends up growing these sharp-like bones that extend from his knuckles...in anger, he kills this murderer, only later realizing that he just killed his own, real father.\r Victor follows the distressed James and they run away together. We see them fighting in various historical wars as they grow up.\r As time has passed, Wolverine (Hugh Jackman, still giving it his all) and Sabretooth (Liev Schreiber) are asked to join an army led by William Stryker (Danny Huston). In this army, they meet a range of other mutant soldiers including; Agent Zero (Daniel Henney) and Wade Wilson (Ryan Reynolds).\r After seeing how much chaos this army causes, Logan (Jackman) decides to walk away, and years later, we find him living life peacefully with his girlfriend Kayla (Lynn Collins).\r The movie's plot doesn't even start until at least 20 minutes after this, where we see Sabretooth supposedly murdering Kayla, which angers Wolverine and Stryker is able to get him back and experiment on him by placing adamantium metal into his skeleton.\r The first (of many) problems with this movie is the CGI, Wolverine's claws look more animated than a Pixar film and do not seem to match the live-action atmosphere around this movie. The plot is incredibly drawn out for a movie that is roughly just two hours long...and there are just some things that don't make sense when you compare them to the original \"X-Men\" timeline. Plus, without spoiling too much, there is a certain character who appears at the end, it is a famous and iconic character, but what they did here was inexcusable.\r Despite the actors who seem to do a good enough job to make this movie entertaining, 'X-Men Origins: Wolverine' is an astonishing disappointment in every sense of the word. CGI heavy and just too silly for its own good."
    },
    {
      "rating": "5",
      "text": "Насколько же это скучно! Эффекты просто отличные, но диалоги  убогие и неинтересные. Уверен, что если бы у фильма был рейтинг R, то он был бы намного интереснее."
    },
    {
      "rating": "4",
      "text": "It's just a mess. The film rushes through so many things and doesnt give you any time to settle and as a result, you just don't care about most of the characters and some things are hard to follow. The acting and writing has many problems and overall its just hard to enjoy this film."
    },
    {
      "rating": "4",
      "text": "What a complete knockoff for today. Why am I here? Well.... guess what I gave a review in? Yep, that's why I'm here. If you're going to use someone correctly, at least learn the information on that character. Other than that, X-Men Origins: Wolverine is a poor movie."
    },
    {
      "rating": "2",
      "text": "The trouble with X-Men Origins: Wolverine starts, but hardly ends, with its title. Origin stories are a necessary burden for superhero movies, but after starring in three X-Men movies, Hugh Jackman’s Wolverine didn’t really need an introduction. What’s more, Wolverine has always worked best in comics as a high plains drifter of a character whose origins remain shrouded in mystery, even from himself. Still, someone decided the story needed telling, although presumably no one set out to tell it this badly.\r We first meet Wolverine as a sickly child on a 19th century Canadian plantation. In a fit of anger, he pops claws of bone from his fist and kills the man he believes to have killed his father who, with his dying breath, confesses that he’s actually the kid’s father. Confused? Don’t worry about it. The film never really bothers returning to the whys and wherefores of his parentage, instead aging the young mutant and his similarly superpowered half-brother into Hugh Jackman and Liev Schreiber through a montage sequence that shows them fighting their way through American conflicts from the Civil War up through Vietnam. (Only the most famous ones, but maybe the DVD will have images of the beclawed duo charging up San Juan hill or laying the smackdown in Mexico.) After Schreiber, the more mean-tempered of the two, kills a superior in ‘Nam, they’re recruited by Danny Huston’s shifty, vaguely Nixonian Col. Stryker to perform covert ops with a bunch of other mutants.\r Biting commentary on the abuses of military power fails to follow. Instead, director Gavin Hood (Tsotsi) offers a lot of slickly uninvolving action scenes and a dramatic vocabulary on loan from playground recreations of Wrath Of Khan; the film’s so in love with the image of its hero shouting, “Noooooo!!!” to the sky with arms outstretched, it repeats it seemingly every other scene. It’s remarkable, too, how Jackman could be so loose and charming in the other X-Men movies but so hamstrung playing the same character in a script by David Benioff and Skip Woods that requires more emo mopery than anti-hero wit.\r It doesn’t help that he’s stuck in bad company. The usually cerebral Schreiber proves unexpectedly menacing as Jackman’s blood-nemesis, but the film otherwise surrounds him with second-string mutant scrubs who aren’t given much to do and then don’t do generate a lot of interest doing it. Friday Night Lights’ Taylor Kitsch seems unsure where to run with the Cajun playboy Gambit and ends up taking him nowhere while Will.I.Am, in his big-screen debut, treats every line as a fearful surprise. A couple of halfway decent action scenes do little to distract from the story’s mounting ludicrousness—two words: adamantium bullets—or a conclusion that’s only a little more satisfying than a projector breakdown. Maybe."
    },
    {
      "rating": "2",
      "text": "5.3? En serio? Esta película es pura basura, es tan mala que dan ganas de aplastar al director con un camión. Totalmente llena de errores temporales..."
    },
    {
      "rating": "5",
      "text": "This movie is very boring that I almost fell asleep in the middle of the movie the story was bland and generic the only thing this explains is wolverines story and they ruined deadpool"
    },
    {
      "rating": "4",
      "text": "Astonishing opening scene, usually charismatic performance from Hugh Jackman, pretty Vietnam war movies inspired images and ............ that's all in this clichéd silly movie that has all flaws you can imagine from stupid superhero movies."
    },
    {
      "rating": "1",
      "text": "The only thing X-Men: Origins has going for it is Hugh Jackman. He's still amazing as Wolverine. But with horrible CGI, a confusing plot, and of course, the dreaded treatment of Deadpool, this film just sucks."
    },
    {
      "rating": "5",
      "text": "This was a massive letdown after two great X-Men movies. It completely destroys the character of Deadpool, and fails to deliver a coherent script, not the mention some of the terrible CGI."
    },
    {
      "rating": "0",
      "text": "The worst travesty possible against the most bad ass x-man. Wolverine was portrayed as a candy ass in this so called  movie, he is the best there is at what he does even though what he does is not very nice. Did the jackass that made this \"Movie\" ever read a wolverine comic book or for that matter a Dead Pool comic book what a tool find a new career to suck at you bloated hack."
    },
    {
      "rating": "2",
      "text": "X-Men Origins: Wolverine is a seriously flawed film. The first fifteen minutes or so are really quite entertaining - a visually stunning and visceral title sequence with Wolverine and Sabretooth literally running through history, and fighting in the American Civil War, WWI, WWII and Vietnam, whilst being accompanied by Harry Gregson-Williams' suitably epic score. We then have a quick trip to Nigeria, where each member of the elite team of mutants Wolverine joins demonstrates their skills in a spectacular fashion whilst fighting a warlord and his henchmen. After this first act though, the film becomes drab and lifeless, poorly plotted and filled with cliche. The actors' performances are generally sub-par - Hugh Jackman attempts to get by on a variety of grumpy facial expressions, Lynn Collins is wooden, Will.i.am should stick to his music career, and Danny Huston isn't even worthy of being mentioned in the same sentence as Brian Cox, let alone playing the same character Cox so perfectly portrayed in X2. Ryan Reynolds and Kevin Durand are both entertaining enough, but in the film all too briefly, and a character with such fanboy devotion as Gambit deserves to be played by a much better actor than Taylor Kitsch. The only person in the whole cast who really impresses is Liev Schreiber, who develops Sabretooth/Victor Creed from the hulking, brainless henchman he was in X-Men into an intelligent, driven and genuinely frightening antagonist in this film. The film's screenplay, written by David Benioff and Skip Woods is truly woeful. No wonder the film feels so disconnected from any semblance of reality and the dialogue promotes far too many unintended snorts of laughter - the script resembles something a toddler scrawled with crayons. Added to this some rather wobbly visual effects, boring and uncreative action sequences and a truly terrifying cameo by a de-aged Patrick Stewart, X-Men Origins: Wolverine becomes a pretty terrible example of a superhero film. Hugh Jackman and director Gavin Hood (amazingly the same man behind the brilliant South African drama Tsotsi) have succeeded in making the most interesting character in the X-Men canon boring - we now know everything there is to know about the adamantium-clawed amnesiac's past, so he holds no more intrigue. James Howlett, Logan, Wolverine, whatever you want to call him, he's just dull now."
    },
    {
      "rating": "4",
      "text": "In the end, after all that stunning action sequences and frantic chases, \"X Men Origins: Wolverine\" fails to join inside the category of the X Men franchise because of its terrible story and its failure to develop any of the characters within the movie."
    },
    {
      "rating": "4",
      "text": "This movie is a train wreck. Continuity isn't followed, not only from the comics, but even X-Men and X2. It's as though no one at Marvel was thinking when they guided the making of this film. Liev Schreiber was excellent as Victor Creed/Sabretooth and Hugh Jackson continued his perfect version of Logan. While Gambit was great, he was forced, as was Scott Summers and Professor X, even though their whole inclusion implies that they know what happened on 3-Mile Island, not Alkali Lake. Yet...in the X-movies, they have no clue. Logan even awoke from being shot with no memories except what began that moment. And, at that moment, he was on the island where he allegedly got his bones and claws. Wouldn't he remember that?? Idiots."
    },
    {
      "rating": "8",
      "text": "I liked this movie because (as the title suggested) it finally explained all the mysteries surrounding wolverine  that I've wondered about. Where and when he was born, how he got his metal bones, the big gaps in his memory, the \"true\" story behind Three Mile Island (I thought that bit was pretty funny), etc.)The acting, script, and directing were all pretty good too. I'm glad I finally got to see this."
    },
    {
      "rating": "8",
      "text": "It was an interesting story to see how Wolverine became the mutant that he is today. Hugh Jackman's great performance and a lot of action make this worth watching."
    },
    {
      "rating": "2",
      "text": "Wolverine is so lazy, Garfield could've made it. You remember in the first X-Men movie when Wolverine first whipped out his claws? Remember how one pierced his skin and slowly cam out? What a downgrade 9 years later. Wolverine's claws are so fake looking that they don't even seem to move with his body. When a review starts out by complaining about the main character's claws being unconvincing, you know you're in trouble."
    },
    {
      "rating": "4",
      "text": "This is even worse than X-Men 3. Filled with plot holes, laughable visual effects and wearying cliches, this prequel amounts to nothing more than explanations for loose ends in the main trilogy. The plot became really confusing and some of the characters put into this movie were unnecessary. This movie could have been so much more than it amounted to be."
    },
    {
      "rating": "5",
      "text": "A pretty silly movie with a good dose of punts to the groins of Wolverine fans."
    },
    {
      "rating": "6",
      "text": "a ok action flick that does pretty well on the action but not much els. felt like charicters where just tossed in there for fan service instead of just focusing on a few to flush any type of real story out of it.  it was just ok and thats about it."
    },
    {
      "rating": "2",
      "text": "Not without its emotional moments and quite thrilling action pieces, Wolverine still manages to live down the once strong X-Men Franchise.And with horrible bloated dialogue. I give this movie 22%."
    },
    {
      "rating": "6",
      "text": "Entertaining, in that the special effects are well done and it is basically non-stop action. The plot wasn't bad, but left a lot to be desired. I guess I just wish they had done more with the potential they had, especially given that they were working with a character like Wolverine."
    },
    {
      "rating": "9",
      "text": "I think a bunch of people are like sheep, they go along with what everyone else thinks. I loved this movie and have watched it at least 4 times. I bought it on DVD I like it so much. The film is not a mess like fanguychris thinks (one of the sheeple)!"
    },
    {
      "rating": "5",
      "text": "X-Men Origins is not a bad movie, after all, Hugh Jackson is still great, but the poor screenplay and some unconvincing visual effects make this film a large step bellow the first two entries!"
    },
    {
      "rating": "4",
      "text": "This film was not bad, but it wasn't good either. For what I can say, out of all the X-Men films including First Class, this was the weakest. I don't think I can possibly mention many bad points of the lead character, because it's not like Hugh Jackman didn't put in any effort into his character's behalf. He's been playing the god-damned Wolverine since the beginning of the 21st century, so I think he knows what he's doing. Besides him, I think the production team kind of threw some characters against a background and dialogue was added soon after, which is why some of it didn't seem to make much sense. But it's not like I didn't like all of the characters, I liked discovering characters I've seen before and it was quite fascinating seeing a popstar portray themselves as one of the mutants. To sum it up: predictable, violent fun."
    },
    {
      "rating": "3",
      "text": "BAD MOVIE!!!! This was a horrible way to explain what happened to Wolverine. This was horribly scripted, horribly acted, and just overall BAD! Please let the next Wolverine movie be better than this. PLEASE!"
    },
    {
      "rating": "9",
      "text": "Now I a lot of the critics and fans have thrown a lot of hate on this film but I have a hard time understanding why. It's a great superhero film about one of my favorite characters, it gives tons of back story to his complex persona and has loads of great action! The only criticism that I completely understand is what was done with Deadpools character... He starts off great but the ending completely betrays everything his characters is about. However, that is a small complaint to what is otherwise an excellent superhero film!"
    },
    {
      "rating": "7",
      "text": "Good story- Nice to get an early glimpse on the early mutants and how Wolverine came to be. I strongly disagree with most critics who down-right hated this film."
    },
    {
      "rating": "9",
      "text": "I absolutely love this movie. It brings Wraith, Deadpool, Blob, and Gambit to life. What more can you ask for? This has some dull plot transitions, but otherwise, it's an outstanding film that certainly hits home to the comic fans."
    }
  ]
}