{
  "id": 575,
  "title": "X-Men: Apocalypse",
  "starring": [
    "James McAvoy",
    "Jennifer Lawrence"
  ],
  "runtime": 144,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction",
    "Fantasy"
  ],
  "description": "After the re-emergence of the world's first mutant, world-destroyer Apocalypse, the X-Men must unite to defeat his extinction level plan.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/lRxsDK4exeEgKoXqI4zdr0Vl0yk.jpg",
  "categories": {
    "plot": 5.043478260869565,
    "acting": 4.770491803278689,
    "ending": 5.923076923076923,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.416666666666667,
    "funny": 3.6666666666666665,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "0",
      "text": "Visual effects 1/10Plot 0/10Сrowd scene 0/10Acting of main crew from the previous movies 1/10Acting of new cast 0/10Acting of Sophie Turner  -10/10 (minus ten from ten)Narrative 0/10"
    },
    {
      "rating": "10",
      "text": "Critics are too harsh to be honest,this is not a bad movie unlike X3 and Origins but not great as Days Of future past but I give a 10 because it's well executed film with flaws surrounds it.Apocalypse is a good villain but again not great at least is menacing,The characters are a joy to watch and they were well portrayed by the actors especially Quicksilver that stole the movie again.The visuals are okay to say the least.It's an enjoyable flawed superhero movie."
    },
    {
      "rating": "0",
      "text": "Boring,uninteresting and empty.X-Men Apocalypse suffer from a weak villain,too many characters and some horrible visual effects that ruined the film.It is one of the worst film of the franchise."
    },
    {
      "rating": "1",
      "text": "Bryan Singer needs to leave this franchise. He has made the worst superhero movie since 'STEEL' with this one. Truly horrible from start to finish.  I really felt sorry for Fassbender as he is far, far too good for this material.there were some enjoyable moments here but they can't mask the overall stench."
    },
    {
      "rating": "2",
      "text": "I don't even want to talk about this movie because nobody involved in this movie cared at all. For now I'm just gonna say this, this was the worst movie of 2016. If you want to see a good X-Men movie than watch Days of future past if you want a well made drama, if you want a entertaining action movie watch X2, and if you want a dark X-Men movie than go watch Logan. And if you want to see some one stuff all the bad elements of these movies into a giant bloated mess than go watch X-Men: Apocalypse."
    },
    {
      "rating": "0",
      "text": "Man this movie is super bad. Truly disappointing from all angles. Bad story bad characters. And this is the end to the xmen storyline at least we got Logan thank god."
    },
    {
      "rating": "0",
      "text": "Critics are NOT being too harsh about this! It really is just about as bad as Xmen 3. I don't know where they went wrong with this, after finally managing to pull a good movie together two years ago with Days of Future Past. Where to begin with this rubbish: bad acting, incredible cartoonish and laughably weak villain, complete ruination of many good characters from the Series (Storm, Psylocke, and Magneto decide to just become mass murderers because, hey, why not? Munn did absolutely nothing for that character. Massive plot holes aside, Apocalypse fails to make a movie that pushes the series forward in any way."
    },
    {
      "rating": "1",
      "text": "this movie was so unappealing I actually had to stop watching, it was physically painful to seat there and be so bored . this was not entertainment , it was a badly written ,poorly directed movie ... of course they concentrated all their efforts on star power and special effects. It showed..."
    },
    {
      "rating": "0",
      "text": "This movie is just lame. It is extremely boring. This villain just sucks. These visual effects that they added to try to make it all spiffy and cool just ruined it. Not to mention the actors obviously didn't want to be there and showed it in every scene. They, like me were extremely bored and uninterested."
    },
    {
      "rating": "3",
      "text": "This is probably the worst X-Men movie for a long time. It's over extended, boring and contains a lot of crappy realized scenes.\r I understand that It takes place in the 80's but that artificial creation of the mood just don't fit. Colors are like from the disco or a 90s porn movie and stuff like Mortal Kombat costumes in Auschwitz are some kind of a sick joke.\r But the worst thing are the scenes which take place in Poland. I'm from Poland and I can assure you we have laughed out loud of those. Actors trying to build up the mood in foreign language look just silly and I'm sure that's not the kind of atmosphere you want on the screen when drama takes place!\r Also, the main villain is a mix of funny guy and some angry kid who can't even choose his companions wisely. But hey, he can do some mumbo jumbo with his hands and give some nice toys to his mates - so awesome.\r I must admit tho', that the movie has some cool characters and decent scenes (Quicksilver rulez) but that's all. I can't recommend more in this long and rather dull performance of actors lost in their roles. Waste of money."
    },
    {
      "rating": "0",
      "text": "Awful, awful film. Watched the first two (of the new series) then this one and it's just putrid in compassion. The  villain is lame beyond all hell (essentially a Power Rangers villain, but less menacing) and the Xmen are pathetic. Essentially NOTHING happens. Wait no, a town is destroyed. Some c-list Xman dies. Charles goes bald in the most dramatic way possible. And the plot holes holy jesus, there are far too many to count. My personal worst actor goes to Pyslock. She literally has one line in the film and then stands around doing jack. Truly a poor film and way worse then Xmen 3. Those giving it high scores are smoking crack."
    },
    {
      "rating": "3",
      "text": "I loved, *loved* DAYS OF FUTURE PAST, so I knew this wouldn't compare to that, but wow. What a disappointment. It's so boring and lazy and messy and dumb that I just wanted it to be over about 30 minutes in. Skip it if you value your time or opinion of the X-Men."
    },
    {
      "rating": "5",
      "text": "The movie failed to be better than it's predecessors(X-Men first Class,X-Men Days of Future Past) and also Deadpool which is disappointing.The movie ha sit's moments but the whole film in general felt empty,The characters are well portrayed but it the we never have an emotional connection or even care about them but except The professor,Magneto and quicksilver.Quicksilver is good again with his fantastic scene.The others I don't really care.The biggest problem of the movie is that there is so much going on,in each scenes were never focused ,it felt like it just happened.There are so many plot elements or story that never explored or dig in to it and just skip.Apocalypse felt generic like Ultron who always brings qoutes and crap.The only good news is,It's better than X-men Origins but the bad news is that this film felt,atleast for me,like X-men:the last stand again.It's kind a boring for me."
    },
    {
      "rating": "0",
      "text": "The movie was really utter crap. Nothing original to be seen.\r Whilst I really liked days of future past, thought it to be stylish and well-paced, then this trainwreck really is very embarassing from the get-go. This is the 3rd movie in my life-time for which I was really holding myself back from throwing my popcorn and leaving the theater mid-film. Might as well had done that.\r What's really infuriating is that Marvel and 20th Century Fox have this nonsensical grip on the press. How on earth do critics diss the well-done Warcraft movie and tolerate this one (though not saying much, because there's really nothing to praise here)?\r It's the old \"really bad guy from ancient times (Egypt) comes back and tries to take over the wooorld\" trope, with that really being just it. Only action scenes after one another make for puke-inspiring pacing and some really horrific \"few seconds of idyllic life, family gets killed, now Magneto is evil\" crap tropes filled over all the scenes they spared some dialogue on.\r Derp-faces all over.\r Singer should be ashamed. I'm not at all confused as to why Jackman chose to ditch the franchise. It's becoming more and more a crap cash-grap with no shame."
    },
    {
      "rating": "7",
      "text": "Apocalypse gives us the first X-Men movie to feature a classic lineup of the characters coming together in their teenage years to fight evil under the guidance on Prof. Xavier while not being overshadowed by Wolverine. Essentially it's a close as we've gotten to the X-Men film we've all wanted for years now. However given how many steps forward the superhero movie genre has taken over the years, and Brian Singer's reliance on standard tropes, Apocalypse ends up being an odd mixture of better late than never, and too little, too late.There's a lot to like about Apocalypse. We get the return of the great cast from First Class and DoFP like Fassbender and McAvoy, Sophie Turner's Jean Grey, Evan Peters continually enjoyable Quicksilver complete with more of those amazing super-speed action sequences, and it doesn't crap all over Cyclops. It's got some of the best portrayals of these X-Men characters we've seen onscreen so far. The interpretations still aren't perfect mind you. DoFP couldn't fix everything, so things like age and timeline discrepancies keep things from being just as every comic book fan wants to see it. Nothing short of a reboot of the series will fix that. However, this is still the best we've gotten so far in that department.Given that Apocalypse seemingly does so much right by making good on the promise DoFP set the series up for, what keeps it from achieving greatness? That answer is simply that it's too familiar. With the MCU dominating theatres, the DCEU getting up and running, and the X-Men's own lengthy presence on the silver screen we've seen a lot of villains want to destroy the world. And quite frankly, they were more interesting than Apocalypse.The movie just has a very bland villain. Plus we already know how the fight turns out, so Apocalypse just ends up coming off as some dude who isn't really a threat whose sole purpose is just to break stuff. Then there's how underdeveloped he is.The action itself falls short as well. This is a bunch of special effects driven destruction. The likes of which we've seen in a lot of superhero films lately. Not even the constant display and barrage of these character's powers carries the same level of excitement as before. The action still isn't boring to watch, but it's certainly going through the established motions. Then there's the fact that a lot of these special effects look cheap and dated, particularly in the first half of the movie.What hurts Apocalypse the most is simply superhero fatigue. Brain Singer and FOX do their best to give us the X-Men movie we should've received in the first place all those years ago. For the most part they succeed. The issue it's a little late to do that. The superhero genre has taken off and reached heights one could hardly believe. Going back to basics wounds them here. They got off to their post-DoFP timeline with a shaky start.Does any of this mean Apocalypse is an outright bad movie? No, it's just behind the times. A flaw that's easier to forgive when you consider this is a close as we've come to that perfect X-Men lineup. There's a sort of classic X-Men feel to it and it's just nice to see a lot of the original characters like Cyclops, Nightcrawler, and Storm get some real screen-time and actually take part in the action without Hugh Jackman's Wolverine hogging the spotlight. So yeah, it's the most admirable attempt at giving us the perfect X-Men movie that's sadly flawed in key areas. For some this simply isn't going to be enough. For others like myself this will still be a respectable and enjoyable movie. One that still manages to entertain for (finally!) exploring other, original X-Men. The series things to make up for, but it certainly looks like they're trying. The future still has the potential to be bright for these characters.7.4/10"
    },
    {
      "rating": "9",
      "text": "It captures what I liked about the apocalypse franchise when I read the comics as a kid. For that it deserves a high mark.  I think they could have trimmed some of the subtle subplots a bit to make it more cohesive of a plot. While it didn't capture the best human parts of the first two in this series, still a good x-men movie."
    },
    {
      "rating": "8",
      "text": "When I finally went to watch X-men: Apocalypse, I was surprised it didn't suck as much as all those bad reviews led me to believe. It's definitely worse than the prequels but not that awful either. Apocalypse turned out to be a disappointing villain (though I feel like Oscar Isaac did the best he could with the material given), plot was fairly weak, ugly cg floating rubbish and I still think the mystique makeup on Jennifer Lawrence looks terrible. But overall I quite enjoyed the movie: Magneto had a great arc, I liked the new young versions of the x-men and quicksilver is awesome as ever (plus a cool cameo of you know who).  Want to give it a 7.5, but since metacritic doesn't allow decimals in userratings I'll round it up to 8."
    },
    {
      "rating": "7",
      "text": "An OK addition to the franchise. Effects drive much of th action as you'd expect. There's some attempt to emotionally draw one into the main characters, but not as much as in say, First Class."
    },
    {
      "rating": "2",
      "text": "More comic book movie trash. Hopefully this will be Singers last chance at this franchise and it will be handed to someone with a fresh vision because it is creatively and artistically finished. It looks like audiences are getting sick of this s*** too judging by the ever diminishing returns. This is possibly the worst of the bad bunch of X-Men movies. Terrible baddie, terrible heroes. Fassbender is destroying his rep by being in garbage like this and Assassins Creed. He's such a good actor though, such shame. Movies like this are going some way to killing the genre. Please let this franchise die after Logan.Moving forward I think Lord and Miller would make a good choice to re-boot X-Men. Burn everything that's been created so far to the ground and give them absolute creative control and we might be onto something."
    },
    {
      "rating": "1",
      "text": "This movie never failed to make me laugh at the very thought of the situation it was displaying and the dialogue it chose utilise. Problem of course being that is not a comedy movie. I am a big fan of the X Men prequels specifically, but I just have trouble understanding the motivation for a lot of the decisions made in this film. Why is Moira completely clueless? Why is she the one who accidently starts the apocalypse? Why doesn't anybody bother to name Erik's wife? Why were Erik's wife and daughter there, if only to be killed and not brought up again past act 1?Somehow those decisions are not the worst part of Apocalypse. No, that definitely belongs to the category of decisions that have motivations, just either stupid or non storyline based ones. Ex: Moira being brought back into the story, which despite never being mentioned in Days of Future Past, was just because they needed to bring back Charles's obligatory female love interest. Why does Erik have a wife and child, if they don't even get a personality? Well, similarly, they just needed that sweet sweet domestically foiled character motivation. Why is Erik Peter's father? Gotta have that DRAMA. Why does Alex seemingly die? Maybe character motivation for Scott, though it didn't really seem like he needed any more. Stil I was having fun until one very particular decision was made in this movie:How Charles Xavier lost his hair. But we’ll get back to that.Moira MacTaggart was a completely unnecessary part of this film. Wanna know what she does throughout it? Goes “Wow” and “this is so cool”. In First Class, she at least had a personality, and she felt NEEDED to an extent for the story. Why is she here? Well Were just kinda supposed to believe that Charles has actually been hung up on her for, what, 15 years? Despite never mentioning her in Days of Future Past. First Class itself seemed to realise how unnecessary their relationship would be, sending Moira off with a wiped memory as a way out. We see this complete lack of necessariness in the very DRAMATIC moment where Charles gives Moira her memory back of the two of them. Memory being singular. Why? Oh, cause, y’know, they kissed one time. ONCE. For contrast, when Erik reminisces on his relationship with Charles, we are shown a whole two and half memories of them together, and the filmmakers don’t depict THEM of being in a relationship! MAKE IT MAKE SENSE! Moira could have never come up again and I would not have cared, I feel like most people wouldn’t have, but no, Charles needed that obligatory love interest, so we get Moira MacTaggart, who now has a child we’ve never seen, and is amazed by literally everything, which don’t even get me started on how THAT ruins the very bare bones of a character she had in First Class. Now I don't know if you know this, but Charles Xavier is bald in the non prequel films when he is old. Now any logical person would just (rightfully) assume he lost his hair naturally due to aging. But oh no, apparently the execs at Fox decided this was a fan theorised mystery that needed answers. \"HOW DID CHARLES LOSE HIS HAIR?' you may have seen no Reddit thread titled ever, y'know, cause no one cared. Well! Answers my good people! Charles lost his hair because an ancient entity tried to take over his body! This makes no sense and ultimately solidifies this movie as a knee slapping comedy. When we see Apocalypse take over Oscar Isaac's body in the beginning, he is bald, but he is bald BEFORE apocalypse. Can apocalypse not exist in a body with hair? Why? How could Charles keep his eyebrows and stubble? Where did the hair go, it didn't fall out, it seems to turn to dust like everything else Apocalypse used his power on, why? Does apocalypse really hate hair that much? Did the filmmakers not realise how Mr. Clean like James McAvoy would look bald? Like yeah he's been bald in other movies bald that doesn't make it a good idea. WHY? DID? THEY? MAKE? HIM? BALD?   Overall I had one take away: If I were any actor in this movie, I would be pissed. The performances are AMAZING, especially from James McAvoy and Michael Fassbender, but it just can’t save this piece of garbage. Whether this was an introduction or a long awaited conclusion of sorts, no one deserved to be given this piece of trash to work in, except definitely Bryan Singer. I would say this film being as terrible as it is is most likely in part karma from the gods for Bryan Singer, any other explanation can not offer enough grounds for making THIS BAD of a film."
    },
    {
      "rating": "1",
      "text": "The best part of this movie was the opening credits, everything from there downhill. It was so formulaic and cliche. The writer took a handful of characters and a really terrible plot and threw them into a pot and stirred. I love Oscar Isaac but he is majorly miscast as the titular antagonist. Nearly fell asleep, really wish I did."
    },
    {
      "rating": "2",
      "text": "Cast keep the same energy of its predecessors to live up X-Men's classic adventures, but at the end, this is just an unsatisfying mix of style-free action stunts and a thin predictable plot that does not give an unforgettable ending for X-Men's new trilogy."
    },
    {
      "rating": "2",
      "text": "Pathetic, Sophie Turner is Pathetic, everything except wolverine, James McAvoy and Lana Condor (she's really hot btw) is pathetic, I'm sorry for them, fy Bryan Singer really fy"
    },
    {
      "rating": "0",
      "text": "The worst movie franchise and one of the worst in cinema history. Singer as a director is over. He flushed the franchise down the toilet. He, Kinberg and Fassbender made Magneto a pathetic wimp that betrayed the mutantkind."
    },
    {
      "rating": "0",
      "text": "Tasteless. The whole movie had the most generic X-men plot of all time and was exceedingly substanceless. Genuinely one of the worst movies I've watched. The special effects were ok but that didn't really matter when the whole film made me sick."
    },
    {
      "rating": "2",
      "text": "Almost 180 million Dollars worth of bad cosplay and even worse dialogue. The only somewhat intriguing parts include the opening chapter, the final team line-up and introduction of the Danger Room, as well as a speedster's spectacular feats.The most tragic event, Magneto's loss of his family, is cynically viewed as but a plot device to propel the story forward. And once again the horror of Ausschwitz is misappropriated by people who lack the intellectual ability to do anything enlightening with it.A movie such as this, one featuring a multitude of newly-introduced \"mutants\" and warring ideologies, could only ever have succeeded with tight plotting, an intelligent script and confident production design. It lacks in all three accounts. Kinberg is a hack writer. Singer's propensity for casting young aspiring male actors is all the more troubling in light of the allegations of sexual misconduct that surround him.The depiction of Arabs and Slavs is stereotypical, lacking in empathy, and all the more unfortunate seeing as how X-Men movies purport to deal with minority issues and xenophobia - though this cast of almost exclusively white heroes would suggest a white-washing of social issues, anyway.Even the actors acknowledge that they're in a dud by phoning it in. Find another actor or actrice who hates their trademark franchise as much as Jennifer Lawrence hates X-Men at this point. Oscar Isaac is unrecognisable as the main villain, and gives an uninspiring performance. Rose Byrne is completely wasted, unfortunately. The only motivated actors would seem to be James McAvoy and Michael Fassbender, and Magneto's tragic life makes him far too deep a character for this frequently campy film.I lol'd hard at the sight of Wolverine's raggedy... jorts.The MCU reboot can't come soon enough."
    },
    {
      "rating": "3",
      "text": "After three X-Men films that ranged from good to great with X-Men, X2, and Days of Future Past, director Bryan Singer ends his tenure with these memorable mutants with one of the worst films in the entire franchise. X-Men: Apocalypse is overlong and tedious, and at times almost crosses the line into so-bad-it's-good territory."
    },
    {
      "rating": "7",
      "text": "An overly apocalyptic continuation of the X-Men franchise shines with its quick story and visual glamour – but a cliché-ish villain, underdeveloped characters & not that many surprises is a bad fact. The dust has settled from “Days of Future Past”, and for many that might even be the best in the series. “X-Men: Apocalypse” might not surpass DoFP, but it’s still a fine film – for some. The focus is heavily on Magneto & Charles; meanwhile smaller characters are easily left out – development nor inside to them are neither presented in an acceptable amount. Our antagonist is a classic villain from the past but where’s the drama? Where’s the depth? Where’s the understanding? All he gives is destruction. But with destruction comes action; and Brian Singer once again shines with his direction, and Quicksilver. It’s an entertaining film with some clever humor here and there, but it’s not more than that. The plot is acceptable but it doesn’t really feel like an X-Men film. The focus is much more on the plot rather than on the characters — and the objective could have been much better presented; there isn’t a strong want-to for the success of our heroes. A somewhat predictable story and a lack of creativeness is another aspect. But it’s still an enjoyable ride into the world of our beloved heroes – even though the majority are very underdeveloped. It’s no fair comparison against DoFP, and it’s not a bad movie – but not exemplary either.\r Personal rating: 70/100\rCritical rating: 65/100"
    },
    {
      "rating": "7",
      "text": "After reading what a lot of critics said, I went into the film with pretty low expectations and it sort of surprised me.  I could see a lot of the problems they had with the film.  The beginning was trying to weave together too many threads and none of them were particularly strong.  The special effects are kind of suspect and the title villain is by far the weakest part of the film.  William Stryker was a more interesting villain than Apocalypse in the film and he had about 2 minutes of screen time.\r The whole production was still a lot of fun though. The film started off weak, but as soon as you see Quicksilver, the film starts to perk up.  He is once again the best part of the film and balances out extremely uneven performances from some of my otherwise favorite actors like Oscar Issac and Michael Fassbender.  Quicksilver steals every scene he’s in but they still keep him in balance with the other characters.  Sophie Turner also has terrific screen presence and I look forward to seeing this actress come into her own.\r Part of the reason I enjoyed the film was that it had just so many comic characters and nods to avid comic readers.  Yet, this both hurts and helps. Seeing Caliban on screen was pretty great, but the true to the comic outfit for Psylocke (Apocalypse too) made her look extremely out of place in every scene she was in.  While I like that they went for it, all of the other Horsemen get practical armor and she is just wearing the least practical thing available and it’s just all you can look at every time she’s on screen.\r I would recommend this movie if you’re a fan of the film series and the comics, but otherwise I would stay away from it because it is going to be not only confusing, but what works about the movie probably will not work for you."
    },
    {
      "rating": "1",
      "text": "Sadly this could have been a great movie but the producers are trying to do too much.  There are at least five origin stories being told (or retold) in this movie and they are all done in such a convoluted, slapdash way that not only does it ruin this movie; it ruins my appreciation of previous efforts.  Strangely enough not being a fan of this series kind of helps the viewer because they really can't see how badly things were screwed up.   I was really determined to ignore the critics on this one but frankly I think they weren't harsh enough in their criticism."
    },
    {
      "rating": "2",
      "text": "There's no way this can be considered better than much hated Batman v. Superman (which I liked).  The talented actors and director of this movie created a big mess, and they somehow ditched their winning formula from \"future past\" to create \"2012\" meets \"xmen 3\".  If you have kids, they will love it, but this is by no means good cinema."
    },
    {
      "rating": "0",
      "text": "this movie sucks\rCritics are NOT being too harsh about this! It really is just about as bad as Xmen 3. I don't know where they went wrong with this, after finally managing to pull a good movie together two years ago with Days of Future Past. Where to begin with this rubbish: bad acting, incredible cartoonish and laughably weak villain, complete ruination of many good characters from the Series (Storm, Psylocke, and Magneto decide to just become mass murderers because, hey, why not? Munn did absolutely nothing for that character. Massive plot holes aside, Apocalypse fails to make a movie that pushes the series forward in any way"
    },
    {
      "rating": "0",
      "text": "Generic rubbery monster wants to take over the world, and only a group of angsty Halloween-costumed teenagers can stop him. Hard to believe anyone could actually consider this a good movie, beyond giving them an excuse to sit in air conditioned darkness for a couple hours. Just completely bland and uninvolving, with way too many characters, implausible motivations, uninspired action, and ultimately no point at all. Please put this series out of its misery."
    },
    {
      "rating": "10",
      "text": "It obviously doesn't top DOFP, but the movie is good in its own way, i was so excited to see it and it didn't disappoint me as I thought it would do. Great movie :)"
    },
    {
      "rating": "8",
      "text": "It is the least correct level film editing this trilogy, is more fantasy than science fiction, but at the same time is the closest to comics and delivers some great action scenes."
    },
    {
      "rating": "2",
      "text": "Sigh. ***SPOILERS***\r- Terrible directing. Dialogue comes out stilted and unnatural, with awkward performances from much of the cast.\r- Story? Not really bothering with one. Side-stories concerning the characters? Started and then just dropped. Completely dropped.\r- Nonsense changes from the outcome of the last movie. Charles erased Moira's memories of the last event. For no apparent reason. At all. Also... it was basically rape. Mind/memory rape... and everyone seems to think it's just cute and funny that he did that. It's not. It's horrific.\r- They don't seem to understand the powers of the characters in the movie... even after establishing them. Nightcrawler can't go through a wire cage. No, he can't go \"through\" electrical current-areas now. It's... beyond unclear and doesn't make sense. He teleports, director, he doesn't \"go through\" things. That's why he can appear in *places he knows well without having to see it, you explained his powers in the movie yourself*. It's one thing to just change the way a character's powers work... it's another to go out of your way to explain how they work and then actively work against your own explanation.\r- People were upset, in the past, how poorly the Phoenix Saga was represented. Well, the director has listened to our complaints, and straight-up ignored them. Same thing's going on with Jean, she's just crazypants.\r- Writer 1: \"Darn, we ceded too much power to our villain and he has control of Prof. X... what do we do with the story now?\"\rWriter 2: \"Just magically give him the power to fight the villain out of nowhere for what is clearly no good reason except that we don't know where to go with this\".\rThen he's easily defeated, anyway, and that part of the fight is rendered not only non-nonsensical but pointless, as well.\r- Think Beast is a cool character? Meh, he's just some scientist for most of the movie, and is only beast near the end. Oh, the **** version, not an interesting version. Enjoy.\r- Wolverine shows up, and mostly kills some people off-camera before disappearing. One okay spot in the movie. Then he's gone.\r- Prof. X knows that he's teaching a kid, Cyclops, to use his powers and that uncontrollable, powerful lasers come out of his eyes. So they set up beside a pond and have him shoot at a target by a big tree. The tree is destroyed. Prof X puts the kid on a big guilt trip about how his great grandfather planted that tree and it was his favourite spot in all the world. **** you, Xavier, the kid had a blindfold on because of his laser eyes, and you set him up to shred your favourite thing, then blamed him.\r To hell with this movie. Again, this director has zero respect for the source material. No, really, I'm not making that up. He BANNED all comic books from the sets of the X-Men movies."
    },
    {
      "rating": "9",
      "text": "Highly enjoyable movie that's right up there with Civil War. Apocalypse's portrayal was great and you really feel the extent of powers compared to all the other X-Men. Parts have you emotional, some on the edge of your seat, and overall story and premise was good. You don't need to know or see all X-Men movies to like this one."
    },
    {
      "rating": "8",
      "text": "Acts as a direct sequel from the ending of Days of Future Past, Singer continues the main themes of family, struggling to accept oneself and the challenge of letting go of the past in expanding this ambitious mutants universe, though slightly mess up but it is still a competent film. It starts off at a fine pacing with several pieces of subplots to reintroduce the old members, decently surface the villain but due to overloading of stories to tell, there's a lot of flaws especially at the final act as well as some underdeveloped new characters. The story still focuses on the three main characters - Xavier (Professor X), Erik (Magneto) and Raven (Mystique), all deliver promisingly just as previous installments that leads to a very engaging chemistry together with powerful scores by John Ottman, visually stunning effects and a number of fun moments delivered by both Professor X and Quicksilver (although the latter seems to steal the attention much better in two major scenes). The theme of hope might not be quite resonant this time and it might not be the best entry in the trilogy but overall it's more humanly emotional engaging and certainly one of the quite successful superhero trilogy reboot."
    },
    {
      "rating": "7",
      "text": "X-men Apocalypse is a decent follow up to the events of First Class and Days of Future Past even if it doesn't quite reach the same bar as its predecessors. The film does take some time to get rolling but I felt invested in most of the characters that were on the screen. This is because First Class and Days of Future past did such a wonderful job of setting certain characters up. McAvoy and Fassbender reprise their roles as Professor X and Magneto. Their chemistry is still strong and a great source of emotional investment. Jennifer Lawrence returns as Raven (Mystique) along with other familiar faces like Beast, Havoc, and Quicksilver. Quicksilver once again has a wonderful scene and I would go so far as to say it may even be better than the one in DoFP.\r The villain Apocalypse is imposing and feels like a proper threat. To avoid spoilers, as the movie progresses the stakes are exponentially raised. His ensemble of disciples or 'four horsemen' so to speak are just kind of there and seem like they exist because the plot demands it. The only character of these four that receives any form of proper characterization is Fassbender's Magneto. The additions of characters like Angel, Psylocke and Storm feel a bit like they were thrown together in a hurry. Apparently there is another popular X-men character in the film that I completely missed.\r Nightcrawler along with Quicksilver add some nice moments of levity. This levity balances out the destruction that happens elsewhere in the film. The score and visual effects are quite nice as well.\r Apocalypse overall is a flawed but enjoyable film."
    },
    {
      "rating": "8",
      "text": "The superhero genre is not over yet, with 'Deadpool' (2016) delivering all the goods, then came 'Batman v Superman: Dawn of Justice' (2016) which didn't live up to expectations, but were quickly turned around when 'Captain America: Civil War' (2016) promised us everything it can deliver.\r Fourth superhero movie in, and we are only just over half way there. 'X-Men: Apocalypse' is a dark, threatening, and sometimes deliberately paced story. The movie begins somewhere in Egypt where we see En Sabah Nur who used to rule Ancient Egypt, until he is betrayed by his worshippers, and they try to stop him, but his four loyal men die trying to preserve him.\r We cut to 1983, and it seems that the mutants we know as \"X-Men\" are still going their separate ways. We see that Erik aka \"Magneto\" (Michael Fassbender) is living a happy life with his partner and daughter. Charles aka \"Professor X\" (James McAvoy) is taking charge of his school for gifted mutants with Beast (Nicholas Hoult) also looking after the school.\r Mystique (Jennifer Lawrence) is still looking for new mutants and comes across a teleporting mutant who goes by the name \"Nightcrawler\" (Kodi Smit-McPhee) who she takes to Charles' school. Havok (Lucas Till) is back as well, and is concerned for his younger brother Scott (Tye Sheridan) as he cannot control this dangerous laser beam that emerge from his open eyes. Havok decides its time that he goes to Charles' school where he can learn to control these powers. This is also where Scott meets Jean Grey (Sophie Turner), who is having trouble sleeping as she can see/predict the end of the world, which will be caused by Apocalypse (Oscar Isaac).\r There is a lot of this plot to talk about, but to avoid spoiling it, I'm just going to talk about the things that worked and the things that didn't work. What worked the most was the story, I found myself invested in the somewhat scary story of Apocalypse and how he plans on bringing the end of the world, along with his allies including; Magneto, Storm (Alexandra Shipp), Angel (Ben Hardy) and Psylocke (Olivia Munn). I also liked the more darker and violent tone of the movie, probably the darkest since 'X2: X-Men United' (2003), and it is a very trippy experience, especially towards the final battle at the end of the movie.\r Oscar Isaac is great as Apocalypse, he seems menacing, he blends in fully to the role, and when he screams, his voice is convincing enough to lead you to believe that he is truly Apocalypse.\r Evan Peters returns as Quicksilver, the fast and zippy mutant we all loved from 'X-Men: Days of Future Past' (2014), he has another scene stealing moment, and it's arguably better than from the previous movie.\r James McAvoy and Michael Fassbender also commit to their roles as Xavier and Magneto, you still believe their tested friendship, and the way that they seem so drifted apart because of the different things they go through, it's almost heartbreaking when you see what happens with Magneto.\r What didn't work would be the pacing, this is a very unevenly paced movie...but it isn't as disjointed as 'Batman v Superman: Dawn of Justice' (2016), nor does it use all of its characters to their full potential like 'Captain America: Civil War' (2016). There are some mutants, mostly Angel and Psylocke, who aren't seen as much, and they're not as fully fleshed out as I would have wanted them to be.\r The stand-out performance here is 'Game of Thrones' star Sophie Turner as Jean Grey...she commits 100% to her role, and she is definitely memorable in her performance.\r All in all, 'X-Men: Apocalypse' may not be 'X2: X-Men United' (2003) or 'X-Men: Days of Future Past' (2014), but it is definitely nowhere near the poor quality of 'X-Men: The Last Stand' (2006) and 'X-Men Origins: Wolverine' (2009) (a movie I don't like to mention), and certainly nothing like the abysmal 'Fantastic Four' (2015) (a big mistake from Fox). Bryan Singer does what he can with this movie, and at least 70% of the time, he's succeeded. It's better than you would expect."
    },
    {
      "rating": "7",
      "text": "While the movie suffers from heavy lack of character development. The direction and action sequences were able to outshine some of the mistakes in the movie. I didnt think it sucked as much as Civil war because this movie has a conclusion. And the players in the war for the world learn something from the experience. All and all, apocalypse couldve used much more character development, and much more work to its villain. Maybe its time for Bryan Singer to take a little break from the series."
    },
    {
      "rating": "9",
      "text": "I enjoy the movie a lot. It is fun to watch. I have a good time. I try not to spoil anything here. And I do not give a **** with the so call professional critics. I recommended you all to watch it."
    },
    {
      "rating": "10",
      "text": "X Men: Apocalypse completely nails it in what I think is the best X-Men to date. That trailer blew me away and this was actually my most anticipated movie of the year. I was really scared because of the disappointing reviews and boy could I tell you, I absolutely loved nearly every single second of it. It's not a perfect movie but it really has a great script and action sequences. There were so many characters that were fantastic and just the idea of the mutants amazes me. I thought the villain, Apocalypse, was great in this film and he was intense at times. I personally thought the best scenes were either at Xavier's school or in the Egypt area. Man is 2016 rocking it with those superhero movies. The only thing I could say slightly negative about this film was the film length as it was a bit too long, just like any Marvel movie. If you loved X-Men:Days of Future Past (I didn't particularly love that film, but it was okay), then you should like this movie. Go see it and support it as my theater had less people watching this than Captain America: Civil Warm, yet still being nearly full. I really hope this film does well and I look forward to watching it again in DVD. (98/100)"
    },
    {
      "rating": "8",
      "text": "Having viewed all of the prior X-Men movies including the spinoffs, this one was fun but left me wanting a tad more. It felt nice having a villain other than Magneto as the central protagonist but with that said, I expected more from Apocalypse. Also, a few more minutes of his backstory would not have hurt the movie time wise at all. It was also a relief not having Wolverine as the focal point and rather reduced to a cameo/action scene. The acting from the cast is surely not Oscar worthy but they get the job done. All in all, if you're looking for an enjoyable movie with a decent story then check this out. But like I said, do not expect this to be the greatest comic book movie ever."
    },
    {
      "rating": "8",
      "text": "X-Men: Apocalypse was definitely surprised me! I went in expecting this X-Men movie to be a bit mediocre, but overall this was a movie full of great fun. The story was cool, new characters were pretty evenly introduced, the sights and sounds were phenomenal, and there is a lot of room for the next installment in the series! The only problems I really felt were timing and pacing issues. There were times when the movie felt like it was throwing a lot at you in a small amount of time, but as it went on I felt everything was explained pretty well. Also, it was pretty nice knowing about the X-Men before seeing this movie, but I feel people that don't know too much about X-Men can enjoy this movie just as much as I did. If you like X-Men or comic book movies in general I highly recommend X-Men Apocalypse!"
    },
    {
      "rating": "7",
      "text": "It was certainly a fun movie. I enjoyed myself, and it felt shorter than its run time. Yet, some issues I saw really brought down the film for me. I wish that they did more like with DoFP & First Class for the third installment."
    },
    {
      "rating": "10",
      "text": "it isnt better than Days of future past or First class, but I still think this is a good and solid super hero movie, I know they could have been fix the size of the character Apocalypse, but anyway, I like the new cast, Cyclops, Jean Grey, Nightcrawler, the cool scene of Quicksilver, the Wolverine´s cameo, the action, the opening sequence, the music, Fassbender as Magneto, McAvoy as professor, etc.\r I know it has flaws too, but as fan of the x-men movies, I really liked it"
    },
    {
      "rating": "0",
      "text": "I finally got around to seeing this movie. This movie isn't in the same league as Captain America Civil War. With that said , this movie was terrible . I'm not a big comic book reader or anything like that , but I know Apolcalypse isn't 5\"5 feet tall. What Tom Cruise is playing this character ? To let the older actors go and get these younger actors was a terrible decision . This is probably another worst superhero movie made again in 2016"
    },
    {
      "rating": "8",
      "text": "X-Men: Apocalypse is an absolutely visually stunning superhero movie, and has awesome characters in the X-Men universe, and has a ton of fun action sequences."
    },
    {
      "rating": "8",
      "text": "I must say that this movie is definitely fun to watch for core comic book fans, and fans of the X-Men cinematic universe. However, as a casual moviegoer, there lies quite a few problems, rendering it to mixed reviews and being the second lowest rated film (on Rotten Tomatoes) in the entire series. There weren't enough fights between the X-Men and Apocalypse, who again, sounded repetitive and boring most of the time. A lot of key X-Men themes were touched on and never explored again in the film. There was an obvious focus on the future of the X-Men series, rather than the Apocalypse they're facing now. It just didn't seem like the end of the world was near, and that is where my main problem lies with this movie. The inevitable comparisons to Batman v Superman: Dawn of Justice and Captain America: Civil War places this movie right in the middle. Apocalypse definitely accomplished more than Batman v Superman but it didn't deliver as well as Civil War did. All in all, X-Men: Apocalypse is a must see movie. Check more of my articles at movie pilot.com/EJtheG"
    }
  ]
}