{"id": 2874, "title": "xXx", "starring": ["Vin Diesel", "Asia Argento"], "runtime": 124, "genre": ["Action", "Adventure", "Thriller"], "description": "Xander Cage is your standard adrenaline junkie with no fear and a lousy attitude. When the US Government \"recruits\" him to go on a mission, he's not exactly thrilled. His mission: to gather information on an organization that may just be planning the destruction of the world, led by the nihilistic Yorgi.", "releaseYear": "2002", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/86BnliVDBo2TjKmrgQTJIPHxAKd.jpg", "categories": {"plot": 5.5, "acting": 2.2857142857142856, "ending": 2.0, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 6.0, "funny": 4.0, "action": 5.416666666666667}, "reviews": [{"rating": "5", "text": "I should remove the two lowercase X's in xXx to leave myself with X meaning a \"DO NOT WATCH\" sign unless you're a die-hard fan of Vin Diesel or you want to praise its effects like me here."}, {"rating": "7", "text": "iginnojjihhuureqeschgugugugihihinnojjoihhufytdwwrinjojkopkonniinininhiihhiihhiinininihihuiihuiihinuggyygygyguguy"}, {"rating": "5", "text": "Vin Diesel fills this movie with loaded jam-packed high flying action, but because of its nonstopingness, XXX just feels like another boring same old thing action film."}, {"rating": "5", "text": "The action scenes of this movie were terrifically mind-blowing, but the poor plot and mediocre voice acting screwed it up. \"xXx\" isn't a movie that I recommend"}, {"rating": "7", "text": "The film isn’t great by any means, but I still kinda like it. Xander Cage is a very good protagonist because he doesn’t take himself too seriously in a movie that tries to be serious. This movie is a corny, stupid, early 2000s blowout that I just happen to enjoy."}, {"rating": "8", "text": "It's essentially a spy movie with style and attitude of the extreme sports scene that was so popular in the early 2000's. It's a total dudebro movie at times and a little cheesy as a result. The plot is absurd and the stunts are ridiculous. That doesn't make them any less fun to watch though. The thing that holds it all together is it's star. Only Vin Diesel is probably the only person with the charisma to pull this one off. Even when his one-liners are dorky the dude is just still all too cool. He saves the movie from descending into cringe-worthy stupidity and delivers a very enjoyable action movie with exciting, over-the-top stunts. It's even a nice little breath of fresh air in the now all too stale genre of spy movies."}, {"rating": "8", "text": "I thought it was a pretty good action movie. It was action packed from start to finish, original, and rather fun to watch. I enjoyed it and I am rather suprise to see that users didn't enjoy it as well."}, {"rating": "8", "text": "Action fans rejoice, xXx re-engineers Bond for a savvier, more cynical generation. A new hero for a new movie experience without the more dated cliché’s of the 007 empire. Trust me, you’ve never seen stunts like this. Vin Diesel is legit, a titan among ass kickers. Give him his due."}, {"rating": "5", "text": "I enjoyed the movie a bit but the stunts were totally unrealistic. The actors are fine and the plot is pretty good also but just not done well. The downfall I said eariler, the stunts. Imagine a motorcycle being attacked by a helicopter, then jumping a ramp, going over a barn that blows up, and the person is not hurt at all, that is this."}, {"rating": "5", "text": "A film with more action sequences. Why do not really like the special effects, many are rather poorly done    ."}, {"rating": "10", "text": "A threat to the Bond franchise? Not a threat so much as a salute. I don't want James Bond to turn crude and muscular on me; I like the suave style. But I like Xander, too, especially since he seems to have studied Bond so very carefully"}, {"rating": "4", "text": "Yeni çıkacak olan filme gitmeyi düşündüğüm için aradan bunu da çıkarıp, olayın ne olduğunu görüp, öyle gideyim dedim. Fakat umduğumu bulamadım Vin Diesel güzel oyunculuk sergilese de ne konuyu ne de aksiyonu sevmedim. İzlerken sıkılıp ara verdiğim oldu. Zorla sonuna kadar getirsem de asla aradığım heyecanı ve aksiyonu bulamadım. Sanırım aklımda kalan tek sahne Snowboard sahnesiydi. Bu filmden sonra 2. filmde Vin yok diye izleme gereği bile duymadım. Yeni filmine de gitmeyi düşünmüyorum. Bi ara izleyeceğim fakat ne zaman izlerim bilmiyorum."}, {"rating": "10", "text": "A threat to the Bond franchise? Not a threat so much as a salute. I don't want James Bond to turn crude and muscular on me; I like the suave style. But I like Xander, too, especially since he seems to have studied Bond so very carefully."}, {"rating": "10", "text": "A threat to the Bond franchise? Not a threat so much as a salute. I don't want James Bond to turn crude and muscular on me; I like the suave style. But I like Xander, too, especially since he seems to have studied Bond so very carefully."}, {"rating": "4", "text": "xXx is still infected by Cohen with the same chaotic rage of Fast and Furious; however, its not as insufferable, considering the action covers more ground than just aimless car chases."}, {"rating": "3", "text": "Im giving this movie as much as 3/10 only because I enjoyed mediocre performance of Vin Diesel and I believe that some movies serve as parody of real action productions. I didn't feel any bond forming with any character, just a hollow acting and cliches even for 2002. Even being slightly tipsy couldn't make me enjoy this movie and I am not hard to amuse. All scenes and their purpose were enigma to me till the very end. Stereotypical \"badass\" main hero and a woman he meets later that fall in love with each other throughout the movie. Even more stereotypical bad guy. In conclusion I do not recommend watching this, unless you have the lowest of standards and time to waste."}, {"rating": "4", "text": "You tend to know what you are getting when you watch a Vin Diesel movie. With XXX I feel like it was a bit far fetched. The plot and the dialogue was a little out there, even for Vin. I mean, okay, this guy is a stunt man who can do pretty crazy things and not die. How does that qualify him to potentially be an undercover operative for the government? This movie seemed like someone trying to bench too much, slinking one side back and forth, not ever really reaching a full rep. There were a few stunts, pretty women, music, and humor to kind of smooth things over some but ultimately, Its on the lower end of Vin's talent. If you are a action junky, watch it and decide. I have a soft spot for the Des, so I gave it a try, but there's not much I can defend for this one."}, {"rating": "10", "text": "A threat to the Bond franchise? Not a threat so much as a salute. I don't want James Bond to turn crude and muscular on me; I like the suave style. But I like Xander, too, especially since he seems to have studied Bond so very carefully"}, {"rating": "10", "text": "A threat to the Bond franchise? Not a threat so much as a salute. I don't want James Bond to turn crude and muscular on me; I like the suave style. But I like Xander, too, especially since he seems to have studied Bond so very carefully"}, {"rating": "10", "text": "A threat to the Bond franchise? Not a threat so much as a salute. I don't want James Bond to turn crude and muscular on me; I like the suave style. But I like Xander, too, especially since he seems to have studied Bond so very carefully"}, {"rating": "3", "text": "\"xXx\" ?!... mais qu'est-ce que c'est que ce titre à la mords-moi-le noeud ? un film de boules ? ah non, quand même pas ! il s'agit simplement de Monsieur Merdafioul au crâne de piaf, social justice warrior de son triste état, qui se retrouve catapulté agent secret stagiaire à l'insu de son plein gré...\"Triple X\" donc est un pur navet au scénario écrit dans une pochette-surprise (dans un Kinder très probablement) avec notre guignol aux gros bras qui va sauver le monde en compagnie de la charmante Asia Argento. Un navet triple Z certes mais avec le fric d'un triple A et quelques belles cascades... les nombreuses explosions et fusillades peuvent aussi en témoigner.La mise en scène de Rob Cohen est tout-à-fait présentable et en plus, on voit du pays, on fait du tourisme à Prague et on peut rigoler de temps à autre à cette espèce de \"comédie\" surmenée de bêtise presque aussi stupide que les plus mauvais James Bond (et ils sont légion à dire vrai).Hélas, même en laissant sa cervelle au vestiaire, on s'ennuie déjà à la moitié : on est très ennuyé et consterné par le ridicule généralisé des situations et de leurs poncifs poncés jusqu'à la corde ; on est ennuyé puis énervé par Monsieur Mazout lui-même (et son manteau tout aussi ridicule !) qui nous les brise sévère avec sa \"cool attitude\".ça doit être son charisme d'andouille avariée qui fait ça. En hommage à Monsieur Triple, je lui accorde donc finalement une note triple : 3x1 = 3."}, {"rating": "10", "text": "A threat to the Bond franchise? Not a threat so much as a salute. I don't want James Bond to turn crude and muscular on me; I like the suave style. But I like Xander, too, especially since he seems to have studied Bond so very carefully"}, {"rating": "10", "text": "A threat to the Bond franchise? Not a threat so much as a salute. I don't want James Bond to turn crude and muscular on me; I like the suave style. But I like Xander, too, especially since he seems to have studied Bond so very carefully."}, {"rating": "0", "text": "Vin Diesel belongs in videogames, not movies. I don't know how anyone could stand watching this putrid movie. Some of the worst acting I've ever seen, terrible plot, and offensively bad dialogue. Somebody would say that the movie isn't meant to be taken seriously. Neither are James Bond or Die Hard movies and I liked them a hell of a better than this garbage. Avoid this movie like the plague. The ending was an embarrassment to any action movie. Vin Diesel needs to make another Riddick game and drop his acting career. The Boiler Room was the best acting he's ever had and he didn't even play a significant role in that movie. He is convincing as the Riddick character, too bad the only thing the last Riddick movie had going for it was the fantastic Sci-Fi environment. I would give XXX a negative score if I could."}, {"rating": "7", "text": "This was a nice action movie. Although it was not one of Vin Deseil's best movies."}, {"rating": "8", "text": "Love this movie too. Again another one of my favorites. A crap ton of action and suspense. Going undercover to bring down a crime boss."}], "recommendations": ["die_another_day", "xxx_return_of_xander_cage", "casino_royale", "quantum_of_solace", "skyfall", "mechanic_resurrection", "the_last_stand", "safe", "the_mechanic", "demolition_man", "true_lies", "bullet_to_the_head", "spectre", "iron_man_2", "live_free_or_die_hard", "mission_impossible_iii", "angel_has_fallen", "the_expendables_3", "the_fate_of_the_furious", "tomorrow_never_dies", "the_expendables_2", "the_expendables", "red_2", "shooter", "the_losers"]}