{
  "id": 522,
  "title": "xXx: Return of Xander Cage",
  "starring": [
    "Vin Diesel",
    "Donnie Yen"
  ],
  "runtime": 107,
  "genre": [
    "Action",
    "Adventure",
    "Crime"
  ],
  "description": "Extreme athlete turned government operative Xander Cage comes out of self-imposed exile, thought to be long dead, and is set on a collision course with deadly alpha warrior Xiang and his team in a race to recover a sinister and seemingly unstoppable weapon known as Pandora's Box. Recruiting an all-new group of thrill-seeking cohorts, Xander finds himself enmeshed in a deadly conspiracy that points to collusion at the highest levels of world governments.",
  "releaseYear": "2017",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hba8zREJpP1AYhaXgb2oJLQeO0K.jpg",
  "categories": {
    "plot": 4.814814814814815,
    "acting": 4.28,
    "ending": 5.428571428571429,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 5.666666666666667,
    "action": 4.733333333333333
  },
  "reviews": [
    {
      "rating": "4",
      "text": "xXx: Return of Xander Cage is a typical Hollywood action blockbuster. It is loud, dumb, action-packed, light-hearted, and entertaining. Those expecting exactly that will be satisfied while those searching for anything more, including a coherent plot or interesting characters, will be disappointed."
    },
    {
      "rating": "3",
      "text": "Someone Has to Kick This Filmic Mess' AssIn a world lacking of glorious heroes, who better than Neymar to prevent the end of the human race; just with the laughable and banal opening, the film gives a minimum sign of the scabrous experience in which you'll be immersed, no, in this case, the appropriate word is not 'immerse', the correct word would be endure.In front of heterogeneous movie proposals which inaugurate this year, \"xXx\" title itself does not portend no good, and however, for daredevils or unlikely fans of the \"prodigious\" saga who decide to buy a ticket will have to put up with a permanent vulnerability towards your eyes, ears, reality perceptions, aesthetic hyperesthesia, authentic credibility and decency conception.Anyone who considers that \"Fast & Furious\" saga is quite sophisticated or \"James Bond\" franchise pretty misogynist; Hollywood, the place in where anything is contingent, has made a catalog of frivolous films, in which the primary thing is its action scenes of dubious likelihood, that ones pile up on the screen without mercy along by thunderous musical accompaniments.One of the exiguous achievements that the film runs with determination is that it is not imperative to see the hollow prequels since they add new characters and also offer one succinct explanation of \"Triple X\" organization, you must consume it with objective eyes. Xander Cage is now 49 years old, the last time that they mention him was as deceased person, however, this one was simply a pretext for its sequel \"XXX: State of the Union\" (starring by Ice Cube) in order to leave the path free, clearly, it was another legitimate worthless film, both for critics as audience. Now, Cage takes refuge in the Dominican Republic, a country in which he scales a huge power tower, descends a whole jungle in ski and slides along a road in skate, all this for his beloved new community can see a football game, is there something more ineffective and ridiculous? Although the franchise is characterized by delivering vast portions of absurd e implausible components such as its impossible scenes taking fiction to unbearable limits, we do not require more of this, nobody asked for it and perhaps nobody will ever seek it.The Pandora's box, a mechanism operating all satellites orbiting Earth planet, has fallen into wrong hands, for avoiding this, Security National Agency resorts again to services of the agent and extreme sports lover for rescuing it and thus saving to the world of a threat, which does not look like something lethal due to its constant change of position.Cage will set up a team of maladjusted people to achieve his aim: Tennyson (Rory McCann) a Daredevil in the real life, Nicks (Kris Wu) a well versed machinist, Talon (Tony Jaa) a DJ and the best inside this CGI hell, Adele Wolff (Ruby Rose) an attractive and fearless sniper.It expects to be promoted in arduous and demanding celluloid world through celebrities of different subjects: Neymar, he is more than detestable in his role as superman, seriously, if he is a footballer, is a footballer; Ariadna Gutierrez, Colombian miss universe (at least by some seconds), looks like if she was in a video clip, If she is a professional model, is simply a model; Nicki Jam, the Colombian singer, is surplus and is feels superfluous in the story, however, among all that core social, he does well, if he is a singer, is a singer.None of them have acting skills and although the effort of adding cultural diversity to the film has a good heart, it reduces what little has been achieved.Becoming a model to follow for the sexist and English-speaking Hollywood of the 21st century, in the film are only female roles dazzle on screen, being Rose and Bollywood's rising star Deepika Padukone who interpret action sequences and characters as theatrical as memorable, they and irregular Nina Dobrev are those who rescued a portion of the length feature, the rest is missing time.Execrable antagonists, scenes with CGI so palpable that we could even perceive cables and green screens behind Vin Diesel, a script with insignificant punch-lines, a development jam-packed with tedium and boredom and worst of all, a direction palliating negatively the miserable movie. If you want to make an action motion picture with analogous and inexorable dialogs, an interesting story, with real suspense and solid thematic must avoid a simple name at all costs: D. J. Caruso.Boring, unstable, fatiguing, unsustainable and unbearable, \"xXx\" is the first big mess in 2017, nobody asked for it but unceasingly continues arriving. There is no one best way to describe celluloid's substance than Samuel L. Jackson does it: kick some ass, get the girl and try to look dope while you doing it; sadly, leaving \"dope\" to miles away, it gets these three requirements explicitly because are stipulated in the script. Maybe, the next title should have a light and required change: from \"Reactivated\" to \"Deactivated\", please."
    },
    {
      "rating": "5",
      "text": "Xxx: The Return of Xander Cage was a enjoyable, entertaining movie with several characters, and some famous ones like Neymar, Nicky Jam, and Ariadna Gutierrez, the script was good, the story somewhat confused, the action scenes pushed to the limit, and As always Vin Diesel looking good in an action movie, among them also stood out, Nina Dobrev, Deepika Padukone, Toni Collette among others."
    },
    {
      "rating": "1",
      "text": "This movie put the \"D\" in \"Dumb\". My gosh, talking about over the top action that completely defying physics. Story is below average, dialogue is boring, acting is terrible. Worst movie in 2017 hands down. Vin Diesel should not make movies, i repeat. Only watch this movie if you want to lose half your IQ points."
    },
    {
      "rating": "0",
      "text": "Simply the worst movie I've seen in 5 years at least.  No screenplay, no acting, poor action, poor humor. Just a bunch of lazy cut action scenes of 50yo teenager, DJ, hipsters and a couple of tattooed club girls killing a lot of USSOCOM or Russian 'Spetznaz' operatives with no casualties on their side at all... This product looks like kind of Chinese (three of four filmmakers are actually Chinese companies) video game, not a movie. Not even close."
    },
    {
      "rating": "0",
      "text": "This is the worst, most ridiculous movie I have ever seen, man I thought January movies were bad but this was simply the worst and most uninspired, it's so stupid only 2 year-olds can like it, no one else will enjoy this BS."
    },
    {
      "rating": "5",
      "text": "I felt I was watching a b grade Hong Kong action flick starring Vin Diesel.  Great seeing Tony Jaa and Donnie Yen.  The action was good and the movie looked slick, but the dialogue was horrible and there were waaaayy too many half baked, stereotype, sidekicks in this movie.  Would have been a slightly better movie without half the characters in it (or had Yen and JAA the bad guys).  Worth a watch on Netflix when it arrives, but seeing the cheese on the image was hard to swallow..."
    },
    {
      "rating": "6",
      "text": "It's just as ridiculous and over-the-top as you'd expect it to be and then some! Vin Diesel is back in a sequel that nobody really asked for, but nonetheless is here whether we like it or not. I for one went in expecting nothing more than just dumb, good old-fashioned action and explosions galore and came out satisfied as a result. I will admit that I found it to be unexpectedly hilarious as well (seriously this movie felt more like a comedy than an action movie! Me and my friends were in hysterics throughout most of it!) Overall, those who are fans of the first two installments or those who are all but too familiar with Vin Diesel's films and style (and at this point who isn't really?) will more than likely be entertained by this. Seriously, do yourself a huge favor and flip off your brain switch right before watching this and you're sure to get a kick out of it like I did!"
    },
    {
      "rating": "5",
      "text": "Mira que a mí personalmente, me gusta este tipo de cine de evasión, de acción, el típico blockbuster... Pero con esta película no puedo, me parece una gran \"estupidez\" en todos los puntos. El guión tiene poco sentido, no hay quien se la crea desde el minuto 1, pero de una forma escandalosa, es cani, Vin Diesel es muy cani a veces. La necesidad de meter actores de otras culturas con calzador sin aportar nada. El cameo de Neymar, que me cae muy simpático, pero es horroroso el cameo. En cierto punto me recuerda a otra película para \"el olvido\" Point Break, con ese puntito de deportes extremos en los primeros compases del metraje.En conclusión, me ha costado terminar de verla a pesar de durar una hora y media aproximadamente. Llevaba tiempo sin sentir que me estén tomando el pelo en cada escena de una película. La doy un 5, no se porque, no me gusta suspender películas, eso solo lo consigue un hombre: Tom Cruise, aunque Vin Diesel a este ritmo va a ser el siguiente en mi lista de \"Wanted: live or dead\"."
    },
    {
      "rating": "8",
      "text": "xXx : the Fast & the Furious :: Crank : the TransporterI mean this in the best way.xXx's sensibilities are hilariously juvenile; it appears to stem from an idea of \"cool\" that wasn't particularly cool at its peak in the 90's. But it knows that. It knows what it is. The script, the acting, it's all wooden and ridiculous, but in a way that's clearly intentional. The stunts are fun as hell; the plot is secondary and thin but it hits the right beats and provides a rail on which to affix all the ridiculousness.I'm a big believer in taking a movie as seriously as it takes itself: if a film tries to be serious, I'll hold it to that standard – that's why the latest DC Comics movies lost me; their serious tone is not matched by any amount of serious (that is, able to be taken seriously) plot, acting, or dialogue. This movie, in contrast, clearly does not take itself seriously at all: it's clear that everybody involved is just trying to make something ridiculous. In that aim, they succeeded. So I loved this."
    },
    {
      "rating": "7",
      "text": "Perfect movie to go to the cinema, have fun and forget soon after. If you want a movie with cool action scenes and a correct mood, this is the perfect movie."
    },
    {
      "rating": "7",
      "text": "Speaking strictly for myself, Vin Diesel, here coming back to play Xander Cage, the James Bond of skateboarding character he originated in 2002’s “xXx” is the least exciting component of this 3D slam-bang fest."
    },
    {
      "rating": "7",
      "text": "Speaking strictly for myself, Vin Diesel, here coming back to play Xander Cage, the James Bond of skateboarding character he originated in 2002’s “xXx” is the least exciting component of this 3D slam-bang fest."
    },
    {
      "rating": "7",
      "text": "Speaking strictly for myself, Vin Diesel, here coming back to play Xander Cage, the James Bond of skateboarding character he originated in 2002’s “xXx” is the least exciting component of this 3D slam-bang fest."
    },
    {
      "rating": "6",
      "text": "What the heck did I just watch? The first xXx was a spy movie aimed at the teenage male audience. Explosions, extreme sports, and over glorification of video games and masculinity with attitude. This sequel sees the return of Vin Diesel in the starring role. Yet, this is a very different movie than the one he was in way back in 2002. Apparently the people behind the movie wanted to make things as gonzo as possible this time around. It has one the most bizarre tones I have ever witnessed in a movie. Things get so ludicrous you really have no idea what to expect at any given moment.The action scenes are really the only thing that feel like the first xXx. Watching Diesel skateboard and motorbike his way through gunfire and pull off implausible stunts hearken back to the movie that started this series. Even then though this film goes even more over-the-top. Even when it's unbelievable as heck, it's an absolute blast to watch the bullets fly, cars crash, and whatever other crazy crap the movie has in store for us, which is quite a bit.The plot is an absolute sugar rush. Xander Cage puts together a team of other xXx members and sets off to retrieve Pandora's Box, a device that causes satellites to crash from orbit, and avenge the death of a friend. The ensemble cast comes together great. Obviously Diesel gets the spotlight, but the other members of his team are given plenty of chances to shine. This is something last year's Suicide Squad movie could have taken note from. There are actually a lot of characters in this movie. Cage interacts with various contacts who just sort of come and go with little idea as to how they know each other. The plot itself is ridiculous. It features so many people changing sides and moves at a breakneck pace. It's all done with a tongue-in-cheek style that carries over into the dialog. It revels in it's own goofiness. This leads to a sense of unpredictability that's unlike any other action movie I've watched. You half-expect it to have laser sharks at a moments notice. It doesn't, but if it did you wouldn't bat an eye. Things are certainly dumb, but at least you'll never be bored.The acting in this isn't the strongest. Surprisingly Diesel himself feels the most out of place. His age really shows here. He seems too old to be playing this skateboarding, trash talking, tattooed wise-cracker. So like for the first hour or so every attempt to make him seem cool just ends up being kind of dorky. Xander Cage is more personable this time around, and Diesel is just better at playing more reserved action heroes. You eventually get used to it though and Diesel slip into the role better. Of course I may have too busy watching in disbelief at all of the crazy crap happening around him.One of the most absurd, crazy movies I have ever watched. Complete with subpar acting and dialog so bad you can't help but love it. The movie knows it's low-grade schlock though and has a lot of fun with that fact. As a result viewers can as well if they let themselves just get lost with the madness of what they are watching. The people behind this had to be clinically insane to even come up with half of this stuff. None of this changes the fact that it's not really a \"good\" movie. Just one that hasn't got a dull moment. For me, that makes it kind of a guilty pleasure. The kind of movie I like in spite of myself and could actually see myself watching again. Who knows, maybe you'll feel the same way. If you aren't the type to have brainless fun though, don't even bother. 6.2/10"
    },
    {
      "rating": "7",
      "text": "Had little to no expectations for this movie but I was pleasantly surprised just how fun and entertaining this movie turned out to be. It was a dumb action movie, a pure guilty pleasure. Personally, I really enjoyed the addition of Donnie Yen here. He was just really bad-ass and made the movie so much more enjoyable than what I was expecting it to be. I also really enjoyed Nina Dobrev, she was a nice addition and added alot of funny moments in this film."
    },
    {
      "rating": "9",
      "text": "some movies are like video games. in those, you go through twists and turns defeating the bad guys. and most of the time its a lot of fun being the superman against petty bastards. this movie is exactly that: a lot of fun."
    },
    {
      "rating": "10",
      "text": "I’m willing to say the majority of you haven’t heard of this movie. It completely flopped in the US, I’m pretty sure it was only here for one week, but then made boatloads overseas. Just goes to show you how important foreign box office is…  I never in my life had any intention of seeing the third installment of the Xander Cage franchise, nor did I even know it was a franchise. However, they kept talking about just how awful it was on ScreenJunkies and I was sold. There are so many awful moments I could pull for this review but I don’t want to spoil anything; therefore, I will just say in the opening scene, Vin Diesel, using Spanish I had just learned from my third day on Duolingo Spanish, skies in the jungle and then skateboards so fast that there is a fire trail. The dialogue is just as poorly constructed. The actors are mostly monotone (esp. Toni Collette who apparently had an Oscar nomination once?). Mix that in with the weirdest editing where you know there shouldn’t be a cut in the scene when it goes to other sequences and low budget effects, you’re in for a good time. I saw an interview where Vin Diesel said he made this movie to be fun and that’s exactly what it is! I am totally watching the other ones now! #noshame P.S. If you want a movie that is intelligent and not offensive to literally anyone and everyone, this may not be the movie for you."
    },
    {
      "rating": "6",
      "text": "I was a big fan of the original xxx back in the day, it seemed like it was going to be a \"bond for the 21st century\" franchise. The sequel was ok, though nothing brilliant. I was looking forward to vin diesel refilling his famous role. However I came away feeling disappointed. Firstly, the kill-count is far too high, and what's more they end up fighting against the \"good\" guys at the end of the film. Therefore I didn't really feel that they had decent villains. Some of the stunt sequences were ok, though they often strayed into the ridiculous. I don't think bringing back Samuel l Jackson and ice cube also added anything to the film. The whole thing felt like an over the top video game most of the time, and a 50 year old diesel making out with a bunch of women who looked like they just sashayed out of a hip hop video was weird."
    },
    {
      "rating": "2",
      "text": "Wow, this is some woeful garbage that I have just managed to finish watching on my second try.I watched the first two xXx movies back when I was still in school, and I liked those a lot, especially the second one due to all the hip-hop influences, but this just should not exist.Everything here is complete trash: nonsensical plot, awfully cringy jokes, embarrassing one liners, pathetically cheap CGI, bland action sequences, retarded dialogues, actors who do not act. Diesel trying to look fast and agile while being an overweight badly aging walking ballsack is just laughable. And to boost his ego he had to include a group orgy scene with himself, disgusting. I wonder how much were the actresses paid to make out with him. Another particularly annoying actress in my opinion was the Indian woman, who could not act for sh*t (more so than the others) and had a very repulsive accent. The whole flick looks like some sort of a dreadful mix between an early 2000's direct-to-DVD B movie and some Bollywood circus. Kind of like Fast & Furious but even more stupid (which I didn't think was humanly possible) and with a smaller budget.The only two reasons why this is not a 1/10 are Ice Cube's cameo with his own \"Thank God\" playing in the background, and the presence of Nina Dobrev, who is almost too adorable. If you hold any good memory of the first two movies, do yourself a favor and do not watch this piece of sh*t."
    },
    {
      "rating": "5",
      "text": "A new franchise is on making!I was very happy when I heard about a sequel is on the development of Vin Diesel's one of the career early films. I was a teenager, and I remember celebrating it in the theatre with my friends. But, like the T2, it was too late for a sequel. Most of other franchises are going for spin-offs in the similar case. Anyway, it was good to see the original character back in the action. Although not liked changing the title logo. The original is evergreen.Well, the story continued as the same gap between the first and this film. I thought the original concept was like solo action hero kind, but in here, it became a multi-starrer. Like most of the similar themed action film series, it tried to add variety of characters, including clichés like computer hackers and a boss to handle those rogue guys. But there were too many Triple Xes.The story was okay. It only wanted to make a comeback, like a re- introduction of everything. I liked the diversity in the film characters. The casting was from around the world, picking the best team like Donnie Yen from HK, Tony Jaa from Thailand. But I did not understand why Donnie was speaking in Mandarin, instead of Cantonese.From all I did not like Deepika. Yes, she's the real Indian beauty, but not a good actor, especially for actions, she's unsuitable. I would have preferred Priyanka in here. They two should have switched the films between this and 'Baywatch'. Jaa, I did think he had in him his witty character display. He was a completely different person in this. The rest of the guys were too not bad at all, particularly that stunt guy was awesome.When it comes to the action sequences, not some, many were totally impossible. Surely not the really performed stunts they were. Simply a special effects, and it was too much to take on. Because they were not realistically appealing to accept. Those include, non-snow mountain skiing, ocean wave bike surfing, you add it. The good news is, it was okay for watching once, but I'm anticipating the next part to be a game changer in the franchise.5/10"
    },
    {
      "rating": "6",
      "text": "Eye rolling entertainment is the best way I can describe this cancer fiesta.The Action is actually really good, only the Motorcycle on the water sequence has some very bad CGI. Tony Jaa sells his soul again and Tony Gonzales, Michael Bisping and Neymar follow him. Nice surprise at the end"
    },
    {
      "rating": "2",
      "text": "xXx: The Return of Xander Cage, was everything I expected it to be, it’s a terrible waste of time with characters that I didn’t like, a plot that was all over the place and unfocused, terrible dialogue, terrible performances and some terrible action scenes that were shot appallingly.  It’s an absolutely terrible film and it shows just how poisonous an effect Michael Bay’s movies and the Fast and Furious films have had on Hollywood as a whole.  There is a reason it has come out in January, if it had come out any later it would have been outcompeted by Marvel, every step of the way.  Thy could have done an interesting challenge to the current gritty nature of the Bond Films and the original xXx was a challenge to the Bond films.  The problem is, Kingsman already did that 2 years ago and it did it so well, so as a result, it had no choice but to make another Fast and Furious film and I didn’t even really like those films to begin with."
    },
    {
      "rating": "5",
      "text": "This movie is not good in its script and the whole story is quite over the top and dumb at moments. The action though is quite good and I think if you see it in cinema that might be the best part. Acting and all that is bad though, but for Fast and Furious fans, if you enjoy ''acting'' and jokes of Vin Diesel, you might like it. Basically a movie for fun, I just put 5 because I found the action quite good"
    },
    {
      "rating": "5",
      "text": "The triple X gang are back better than ever with new completely unexpected action. Unfortunately, for moviegoers like me, half of them are just clichéd and are ready to be expected the minute before the action even happens. With Return of Xander Cage, they should bring Vin Diesel back to his cage until he (as in his character) gets a great film."
    },
    {
      "rating": "4",
      "text": "Una película que tiene buenas escenas de acción pero es tan poco memorable que no me acordaba que la había visto hasta que la pasaron en la televisión."
    },
    {
      "rating": "4",
      "text": "Return of Xander Cage will satisfy fans of the originals with its non-stop action and cheesy one-liners, but will leave most action junkies wanting more."
    },
    {
      "rating": "6",
      "text": "In a way, Vin Diesel is a unique movie star. He is neither black or white, he is a man of action but also able to do serious stuff although these projects tend to tank hard or go unnoticed. AND the best-known part of his career consists of long-term action franchises which make you forget about realism, favoring big explosions, gravity-defyingly bombastic stunts and enough glamour to make you 12-year old self go green with envy. The world presented here represents pretty much of a teenage boys' fantasy of adulthood. Everybody’s cool, tough and super competent, regardless of their sex.Diesel's best known work is „Fast and the Furious“ and „xXx“ feels like its crazy younger sibling. It has the same structure – Diesel and his trusty crew do dangerous stuff that no one else even dares to think of – and philosophy about the importance of loyalty and \"family\" and how to be the best.But there is less fast cars and setpieces are even more outlandish, which rely so heavily on digital effects that even some of the action movie fans are calling it stupid already. I mean, they go so ballistic this time that comparisions with Bollywood are not far anymore.„Return of Xander Cage“ is too brash and outlandish to earn a comparision with „Mission: Impossible“ or James Bond, but it can be seen as Diesel’s answer to Sylvester Stallone’s „The Expendables“ series. It’s comparably dumb, has comparably weak screenplay and dialogue, and has comparably exciting cast of kickass characters – including two Asian martial arts cinema stars. Donnie Yen and Tony Jaa. Of course, Stallone’s collection of screen legends will always look cooler but Diesel’s crew of young guns is very likable also.So, that’s it. If you like impossible mission spy movies and are able to spend two hours in the world where everything is possible and the good guys are indestructible, you will find a lot to like in the new „xXx“. At nearly two hours, it's probably too long. But enough is happening throughout the movie, to justify spending the time. At least for me.It’s too dumb to be taken seriously but in a world where superhero movies regularly do at least half a billion dollars at box office, there’s surely some room for Vin Diesel’s particular take on the impossible action subgenre."
    },
    {
      "rating": "3",
      "text": "This movie's intention seems just to add more super powers and XTREME situations for Vin Diesel to save humanity from their sins. I went in thinking: \"Ok, this will be like Fast and Furious, only with more Vin Diesel\", but to be honest, even the Fast and Furious movies a least have cool stunts, and a little more intelligence, and I can't believe I just wrote that. All in all, if you just like to see Vin Diesel being Vin Diesel, just wait for the new F&F instead of this, because really, this not only doesn't leave you anything interesting, it made me question how much I'm willing to turn my brain off just to try and enjoy something I paid to see. Move along, nothing to see here."
    },
    {
      "rating": "5",
      "text": "OK, it's silly, it's stupid and in some scenes you can almost see the actors having a hard time keeping a straight face.  They know what they are doing is silly.  But isn't that why you would go to this movie anyway?  If you want to shut your brain off and just watch shooting, explosions, chases, stunts and lots of pretty people this movie is going to be good enough to spend some time watching.  It's 'just' popcorn worthy."
    },
    {
      "rating": "2",
      "text": "I really disliked this movie, I went in with low expectations and was not disappointed. This entire movie was like a 14 years old wet dream. Abysmal acting, a frivolous plot and unbelievably stupid action sequences that hurt my intellect.  The Donnie Yen action scene was the only redeeming factor in this movie...."
    },
    {
      "rating": "6",
      "text": "XxX ReactivatedUn film qui ne prend pas l'action au sérieux #SkiIlTheForest c'est plaisant, mais ça ne fait pas de lui le meilleur film. Pour une soirée tranquille sans réfléchir il passe ;)"
    },
    {
      "rating": "6",
      "text": "Senaryo menaryo yok bam bam bam. Film kısa ve net olarak bu şekilde ilerliyor. Filmin süresi biraz kısa tutulmuş ve direk konuya girmiş bu kısım güzel. İlk filme göre izleyiciyi sıkmadan direk aksiyona sokuyor ve filmin başından sonuna kadar aksiyon içerisinde oluyorsunuz. Filmlerde hata arayan birisi değilim o yüzden mantık hataları varsa da beni pek alakadar etmedi. Konu olarak hiçbir şeyi yok her şey klasik ama sahneler insanı eğlendiriyor. Deniz motosikletleri, amansız çatışmalar, kovalamacalar ve düşen uçakta kavgalar. Filmin izlenmesinin nedenini oyuncu kadrosuna bağlıyorum. Vin Diesel yine güzel iş çıkarıyor. Son zamanların parlayan oyuncusu Ruby Rose yine güzel iş çıkarmış ve ayrı bir tat katmış. Rory McCann tam kendine uygun bir rolde. Kısacası oyuncular güzel fakat konu olarak hiçbir şey katmayan bir yapım olmuş. Yine de bir buçuk saatinizi ayırıp aksiyon ve görsellikle geçirmek isterseniz, filmi izleyebilirsiniz."
    },
    {
      "rating": "6",
      "text": "Honestly there is not too much you can talk about this kind of movie. Best way I can describe it is \"punch punch bang bang boon!!\" It is just a popcorn movie, a very stereotypical one. If you just wann have fun you get it. If you are looking for a decent movie we'll stay away.The plot is Xander Cage played by Vin Diesel is trying to hunt down a secret agent played by Donnie Yen and there were many twists and turns. Right from the opening scene the tone is set, it has Neymar becoming a super agent and then a satellite hit the surface like a scene from Armageddon. WTF. How can you take it seriously. The second most insane scene comes when Vin Diesel has to drive a plane to crush to a satellite. I had no comment.The action were really good especially when Donnie Yen. Every scene he is in you can tell that he is the one making the most effort. I am sure he had a hand in action choreography because it shows the quality. The fights are quick and fluent and that is the strength of the movie. There are some practical stunt work like the opening scene with Xander Cage land skiing and the highway chase and there also some really bad CGI effect.In the end this is a movie where you had fun for a weekend and forget about it. Every 20 minutes you got cool looking characters with no personality and the plot is so ridiculous and generic that you don't even care. But with the ridiculous action sequences you will get your money worth, if you know what are you expecting."
    },
    {
      "rating": "5",
      "text": "The movie is enjoyable, yet very unrealistic. The acting is fine, but some moments of the movie are weak. The special effects are very unrealistic, the beginning was mediocre, the middle was fun, and the ending was forgettable. The movie is fun, but not that good."
    },
    {
      "rating": "0",
      "text": "I stopped watching after 25 minutes. Within those 25 minutes I’ve seen a cliche intro action scene, a not even nearly credible stunt scene, the dullest convince the hero to make a comeback cliche scene and frankly a lot of bad acting. It goes on for another 84 minutes but I’ve had plenty of this nonsense. The franchise was dead for 12 years and it should’ve stayed that way."
    },
    {
      "rating": "4",
      "text": "This is a ridiculously dumb movie that takes itself way too seriously, with a tired storyline and repetitive action."
    },
    {
      "rating": "8",
      "text": "This was better than expected... curious to see how they keep the 'xXx' crew together in future films... if they choose to continue this which I hope they do."
    },
    {
      "rating": "2",
      "text": "This is the worst film I've seen in a long time. I have a soft spot for Donnie Yen and another one for Ice Cube so I give it 2, but beside that, everything is terrible. Vin Diesel needs to retire from action movies, he's just getting too old for this kind of gigs!I am not even going to comment on the \"story\", acting, special effects or even soundtrack, it is simply all terrible."
    },
    {
      "rating": "1",
      "text": "Vin Diesel allegedly wrote this film himself while masturbating to himself in the mirror.Each scene is more irritating than the last, every character speaks only in quips.Watch only if you're on death row and want to feel okay about leaving the world behind."
    },
    {
      "rating": "0",
      "text": "No concept, bad acting by many of the actors. This is so much mis match between actors, like someone's energy is chimp level while others and low as a sloth.A bogus movie over all."
    }
  ]
}