{
  "id": 1130,
  "title": "Yes Day",
  "starring": [
    "Jennifer Garner",
    "Edgar Ramírez"
  ],
  "runtime": 86,
  "genre": [
    "Comedy",
    "Family"
  ],
  "description": "A mom and dad who usually say no decide to say yes to their kids' wildest requests — with a few ground rules — on a whirlwind day of fun and adventure.",
  "releaseYear": "2021",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rejrD9ovTHJbfmpLM0mbEliEPV6.jpg",
  "categories": {
    "plot": 4.333333333333333,
    "acting": 5.5,
    "ending": 5.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 5.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "admirable[ ad-mer-uh-buhl ]adjectiveworthy of admiration; inspiring approval, reverence, or affection."
    },
    {
      "rating": "5",
      "text": "My thoughts: Jennifer Garner is the best mom ever. Its formulatic and not very funny but its harmless (mostly)"
    },
    {
      "rating": "4",
      "text": "The plot is just preposterous, but if you find yourself passing through that threshold, you may be more understanding of what this movie is trying to do, which is just family entertainment of the forgettable kind.Although the most ironic thing of all, is that in this story, the adults are forced to accept whatever crazy stuff their children come up with, and basically the story teaches you - despite being permissive with them - Why, from time to time, you have to say no.Although perhaps that's the lesson, and I only imagined the irony.Another Netflix filler."
    },
    {
      "rating": "0",
      "text": "Esse filme é ridículo, além de ter uma história medíocre, que qualquer pessoa poderia fazer, passa longe de uma realidade possível; como deixar seus filhos fazerem o que quiser? Como deixar uma menina de 14 anos pensar em ir a um festival de música? O filme é um conjunto de cenas ridículas com, com piadas forçadas e sem graça, seria um filme ridículo até mesmo para o Adam Sandler, uma perda de tempo!"
    },
    {
      "rating": "5",
      "text": "Rather unoriginal, though the cast make it more likeable than it would otherwise be.'Yes Day' is exactly what it says on the tin, you will not be shocked to find out what the plot is. It plays out in the most predictable way possible, even the hearty moments are a little too sickly at times. With that said, there are some minor decent bits.Jennifer Garner (Allison) and Édgar Ramírez (Carlos) work well enough together, though Garner definitely stands out more. Jenna Ortega (Katie) does alright in her role, one that isn't too dissimilar to Isabela Merced's in 'Instant Family' - as is the whole film, in actual fact. 'Yes Man', ft. Jim Carrey, also holds slight similarities as you might expect. Both those films are far better, fwiw.Not one I'll be revisiting, but I could see families in particular having a fine time with this. Each to their own, of course."
    },
    {
      "rating": "6",
      "text": "Tiene una trama simple y es predecible; sin embargo, sigue siendo un buen entretenimiento para toda la familia."
    },
    {
      "rating": "1",
      "text": "This film is so cliche and ridiculous that it is unnecessary and far from reality. The main actress (mom) acts the same in the film \"Going On 30\"."
    },
    {
      "rating": "10",
      "text": "I like jenna''s acting .she is  a such cutie pie.I'm really her biggest fan.actually I'm an Asian .please send this message to her.I love you jenna.all the best for your future .one day you will.become a big star. god bless you"
    },
    {
      "rating": "9",
      "text": "Vert Funny.   Mi sono immedesimato un sacco nelle dinamiche famigliari. Ottimo per passare una piacevole serata"
    },
    {
      "rating": "7",
      "text": "laws are flaws, they exist. But the innocence and sweetness of the film make it likable. Yes Day does not overstay its welcome, and knows exactly what it is. Is the concept of Yes Day original? No. But did I enjoy it more than I care to admit? Yes."
    }
  ],
  "recommendations": [
    "17_again",
    "juno",
    "spanglish",
    "we_bought_a_zoo",
    "life_as_we_know_it",
    "no_strings_attached",
    "easy_a",
    "how_to_be_single",
    "evan_almighty",
    "the_blind_side",
    "bedtime_stories",
    "the_perfect_date",
    "the_cobbler",
    "the_holiday",
    "10_things_i_hate_about_you",
    "sisters",
    "the_bucket_list",
    "burn_after_reading",
    "blended",
    "the_break_up",
    "confessions_of_a_shopaholic",
    "sandy_wexler",
    "the_dilemma",
    "zack_and_miri_make_a_porno",
    "you_again"
  ]
}