{"id": 2891, "title": "Yesterday", "starring": ["Himesh Patel", "Lily James"], "runtime": 116, "genre": ["Comedy", "Fantasy", "Music", "Romance"], "description": "Jack Malik is a struggling singer-songwriter in an English seaside town whose dreams of fame are rapidly fading, despite the fierce devotion and support of his childhood best friend, Ellie. After a freak bus accident during a mysterious global blackout, Jack wakes up to discover that he's the only person on Earth who can remember The Beatles.", "releaseYear": "2019", "mpaaRating": "PG-13", "imageUrl": "https://image.tmdb.org/t/p/w500/1rjaRIAqFPQNnMtqSMLtg0VEABi.jpg", "categories": {"plot": 6.3125, "acting": 6.190476190476191, "ending": 5.916666666666667, "soundtrack": 6.0, "cinematography": 6.0, "familyFriendly": 5.857142857142857, "funny": 6.9411764705882355, "action": 5.0}, "reviews": [{"rating": "6", "text": "The premise to Danny Boyle’s ‘Yesterday’—that a struggling musician realizes he's the only person on Earth who can remember The Beatles after a strange worldwide blackout—is incredibly alluring.  Too bad the film itself effectively wastes the opportunity to explore such a novel idea in any sort of resonant or meaningful way.The biggest problem with Boyle’s approach is how formulaic the entire movie is.  There’s the dedicated small town talent manager, the jerk part-time boss, the one supportive fan, and the dopey sidekick.  The performer’s musical career, played by a wonderful Himesh Patel, isn’t going anywhere until the Beatles thing happens.  Then fame, success, and a stereotypical super-agent steps in.  Before we know it the singer-songwriter has everything he ever wanted but is miserable.  There’s no need to dwell on the finer details or the love story because you can probably guess them all already.  Sure, there are a number of things that are disappointing with the film, but most of all it’s that Danny Boyle couldn’t make ‘Yesterday’ something on a similar level as ‘Slumdog Millionaire’ despite ample opportunity to do so."}, {"rating": "9", "text": "Very clever and entertaining movie.  The two leads are wonderfully cast and there is most certainly chemistry between them.  Kate McKinnon hits it out of the ballpark as the obnoxious LA agent/promoter. That lady can play anything as she demonstrates regularly on SNL. Of course, having Beatles music woven throughout the film had us singing and humming along, as it never gets old. And the ending, while somewhat predictable, has a lovely, surprising \"feel good\" twist.  Go see it, you will forget about Trump for 90 minutes and leave happier."}, {"rating": "8", "text": "After a short worldwide blackout, a lone singer/songwriter (Himesh Patel) realizes that the world doesn’t remember the Beatles. As a result, he starts recording and performing their songs, resulting in universal acclaim. To add a romantic twist, his relationship with his manager (Lily James) is tested. There are amusing moments throughout, but Kate McKinnon, as his ruthlessly frank agent, manages most of the funny moments. Fans of the Fab Four will enjoy the hit parade of classics, reinterpreted thru new eyes…or voices (Patel's singing is excellent. The late twist provides a wistful encounter, but I couldn't fathom the logic behind it. There are plenty of sweet moments and sufficient humor to wrap up a package of nostalgia, romance and great music."}, {"rating": "8", "text": "A really, really refreshing movie. I just like how cute and peaceful it is."}, {"rating": "5", "text": "The romance is a distraction along with every other theme, The Beatles and the affection for them keeps it alive.YesterdayBoyle has a treat for us. A desert, to be precise. And even though there are no Michelin stars embedded or awarded to it, the mood is set charmingly by the eternal music of The Beatles and the director, Danny Boyle's not behind-the-stage but inside-the-mind peak of an artist. It is a fun, crowd gathering script. From the germ of it, itself. It places antics in order for the music lovers to drool over. In fact, it basically pits two great musicians in a frame and dares to have a music off. On the left you have Ed Shereen, a 21st century heartthrob. And on the right is The Beatles, carrying the weight of its historical contribution to the rock culture that we live and breathe in.Of course, the film sways towards The Beatles. In fact, now that I think about it, it every time choose that band. Their music. Their legacy. Either a character does so, literally! Or the gist of the film stops its marker on. It is sort of their biography. Just told with a twist of superhero-isc ingredient which would help grab the viewer's attention. My only complaint is that I always thought that the parallel world or alternate reality or newer dimension would at least be engaging.That would be the last thing it would lack. That it would be mory busy. More crowded with not actual crowds but thought provoking innuendos and scenarios that recharges your battery every time the obligatory section of the film puts you to sleep. And don't get me wrong I love a steady film. Calm and confident. In peace. Wearing that posturity as a part of the jewellery. But, the film, the characters, the script has a lot of rush in it. And it isn't free to go anywhere.And for two straight hours, as a result, you are left with an unsettling feeling that the protagonist is going through with you. Coming back to the superhero theme, I love the responsibility part of this event, that is pinned down by the makers. It is not a Spider-Man movie. You are on the wrong screen. Yet, it whispers, \"With great power comes great responsibility.\" This was never art. What Jack Malick, the protagonist, played by Himesh Patel, is embarking his journey upon. He is not the one. He was not chosen. If anything, it is a burden. Something to carry proudly, just Boyle leaves the screen with.Yesterday is a film about today. Boyle sums it up when for the first time, Patel introduces the infamous and my personal favourite song from The Beatles collection, \"Let It Be\" It is a mesmerising scene, when he plays a song to his parents as an audience, as an experiment. Something that Boyle's mind would have been tickling to express, loudly. To not be a part of history, but experiencing something untouched, unfiltered for the first time. And in the end the film is saved because he meant to rub hard on that very note and he did, through various exciting techniques."}, {"rating": "9", "text": "The critics are taking this movie too seriously.It is a love story and I loved it."}, {"rating": "9", "text": "Just a lovely picture, and one that the critics as a whole got wrong.  I mean, how do they like Rocketman more than Yesterday?  That movie is horrid, and this is amazing!  It's a much better Beatles movie than Rocketman is an Elton John movie.  That aside, it's a great love story - a love of music, and a love of that person on in your life who has been there for you, and you just connect with - someone you can't live without.  Lily James is incredible in this film, and I've never seen him before, but Himesh Patel is fantastic.  I'm sure some of the critics are not satisfied by the story's treatment of exactly how the 'incident\" came about or what it means in some scientific respect.  Applesauce!  Just live with the mystery and let it be!"}, {"rating": "8", "text": "Forget the critics. This film is worth your time. There are a couple of points in the third act which are equally as inspired as the premise. Given the level of brilliance in the premise and some of the turns, does it feel like Curtis could have put a little more time and effort into the writing and handling of the film? Sure. Still, there's enough emotional uplift and truly moving moments here as well as re-introductions to the best songs of the past two centuries, that this movie will more than satisfy most viewers."}, {"rating": "7", "text": "When the struggling singer/songwriter Jack Malik is struck by a bus during a mysterious global blackout he awakens to learn that he is the only person in the world that remembers the music of The Beatles!After a strong opening the film begins to tread the familiar Richard Curtis romcom ground, with less musical numbers than you’d expect, until it reaches a finale that most people will see coming from a mile off. Fortunately the chemistry between Himish Patel and the adorable Lily James does help sell what is a pretty unoriginal romance story and there are plenty of laughs to be found throughout. Yesterday is an enjoyable movie but one can’t help but wonder what might have been had the writing been a bit more daring."}, {"rating": "4", "text": "The best part of \"Yesterday\" are the Beatles's song catalogue, though it isn't a 'jukebox musical', and the leading man, Himesh Patel, does a good job of singing them. The main problem with the movie is the  screenplay by Richard Curtis. It starts off with the interesting premise of Jack Malik (Patel), who gets knocked out by a combination of a bus hitting him and a worldwide blackout, waking up missing a few teeth but, obviously, nothing life threatening. It seems he is the only person in the world who has heard of the Beatles and their music or Coca Cola but the screenwriter sort of drops the why of this or what the consequences would be except a man can become rich by claiming to have written all of the Beatles's songs, playing a guitar and singing them without anyone questioning him from his friends to his family to the music company that signs him.One of the first lessons a movie fan learns is that you have to check logic at the movie entrance but there are too many illogical things in this film to ignore them plus a lot takes away your enjoyment of the film. There is very little chemistry between Himesh Patel and his leading lady Lily James though the love story is a given and in spite of trouble with accents and sound that story line is easy enough to follow. In a switch it is the male who goes through a makeover.Both Patel and James are fine in their roles while Kate McKinnon is handed the role (for the old-timers reading this think Eve Arden) of the smart cracking music agent played with each utterance being too shrill. I am not familiar with Joel Fry and his role is a little--heck, a lot--inexplainable, but he is a funny guy. Neither am I familiar with Ed Sheeran and looked him up on Wikipedia being surprised to learn how successful the man is in England. There is a 'mystery' regarding a couple, unknown to each other, and a yellow submarine. There is also a surprise cameo near the end that explains nothing and falls flat.Danny Boyle, successful director and producer of many films including \"Slumdog Millionaire\" and this film, has to take some of the fault for the screenplay and, consequently, this movie.\"Yesterday\" is a disappointing film that doesn't tackle the major premise but does show off the talent of Himesh Patel."}, {"rating": "9", "text": "I TRULY enjoyed the film, especially nostalgia inducing of it, I had some story isues but it's GREAT"}, {"rating": "8", "text": "A terrific movie. Inventive, great cast and production, and heart-warming. One of my favorite movies of the year!"}, {"rating": "7", "text": "I'm sure it's nowhere near as deep and as theoretically satisfying as music and Beatles fans want it to be, and nowhere near as fulfilling and as effective as a Danny Boyle/Richard Curtis pairing can possibly be, but for what \"Yesterday\" really is (a mid-summer dramedy with a wholly fascinating concept and a disposable, yet enjoyable feel) it did the job for me. This is all thanks in no small part to the performances and chemistry at hand between newcomer Himesh Patel and \"Cinderella's\" Lily James. Bolster all of that with Curtis's legendary penchant for rom-com stylings, and a hefty amount of Beatles-centric in-jokes that surprisingly hit the mark, and you get a moderately successful cinematic \"what if\" story."}, {"rating": "7", "text": "Yesterday is a cute film with an interesting premise, it just doesn't push itself hard enough. At times it is quite silly and the inclusion of a certain member of the Beatles not played by said Beatle is just bizarre, but overall a solid 7."}, {"rating": "5", "text": "I was not expecting this film to focus so much on the romantic elements of the story, which isn't a bad thing in itself, I was just expected something more. I did enjoy the film for the most part, it's funny, has a charming cast and of course, GREAT music.I just feel there was potential for something more and it feels a bit wasted."}, {"rating": "7", "text": "This was an enjoyable film. Great premise, fun execution, not perfect but well worth seeing. Has a bit of a Notting Hill quality to the quirky supporting cast. Refreshingly clean movie."}, {"rating": "0", "text": "Uma ótimo argumento transformado em um amontoado de clichês narrativos sem qualquer inspiração estética."}, {"rating": "5", "text": "Under-developed and under-explored, Yesterday takes an amazing premise and turns it into a color-by-numbers romantic drama. What's upsetting to me is that this movie could have been GREAT. The idea that one man can remember The Beatles music and run with it presents so many cool possibilities that the story completely ignores in favor of some really uncomfortably awkward fling. The performances are okay. The story really misunderstands the concept of music, and acts like the songs are good enough to stand on their own without an extremely charismatic performer. The direction is really bland, but does have a stylistic flair that appears out of nowhere for one or two scenes. Overall, this movie is just kind of \"meh.\""}, {"rating": "8", "text": "Yesterday is a nice love letter to the Beatles. Himesh Patel gives a good performance as the lead character, Jack, and sings all the Beatles songs very nicely with his own unique spin. The premise of the this movie is super unique and funny and would be a great watch for any Beatles fan."}, {"rating": "7", "text": "Worth watching if you thought the trailer was interesting. There are decent visuals, comedic moments, and music keeping things afloat. It's just unfortunate that a lot of exploring of the movie's concept (and thusly enjoyment of the film) had to take place in your head instead of on the screen. There are no implications in this world where the Beatles don't exist. There is a simple story of a person making it big when given such an opportunity, and nothing more. Enjoyable to watch and imagine \"what if\" by yourself nevertheless."}, {"rating": "8", "text": "I expected it to be good, it was great.  The opening few minutes are a bit too contrived but it then settles in and is a touching and throughly enjoyable movie."}, {"rating": "5", "text": "First of all I have to get something out of my chest and it's for the producers and writer of this film: **** you!!!And that's because they thought they could do a simple romantic comedy with the Beatles music and they were going to get away with it.This film was written by Richard Curtis and if anyone had told me that he also directed it, I would never have doubted it. That should give you a little idea of ​​where the **** Danny Boyle went with this story.He was going to direct the new James Bond film and instead he ended up delivering this.There's no surprise or revelation in this film. It's a simplistic romantic comedy that doesn't propose anything new nor it tries to do it.The story and the characters are not endearing in any way and maybe the best time of it and probably one that will save it beyond the Beatles music is the scene with Robert Carlyle playing John Lennon (Hey, they managed to make Yoko Ono disappear)Beyond that there isn't much more to say.If new generations discover the Beatles with this film, well that's fine, all the better for it.I assume that for many it was like that with Bohemian Rhapsody for Queen and Rocketman for Elton John but if so, it also depresses me because evidently in musical terms they're not paying attention where they should be"}, {"rating": "5", "text": "Oh boy, how do I review this one.  Well, first off, if you're expecting exciting Danny Boyle and don't care TOO much for the Beatles, don't even bother.  The acting is fine. The idea is great.  The Beatles music is great. It STILL comes out incredibly 2 dimensional. Boyle has such a knack for making things exciting.  For instance 127 Hours has less going on that this film does, and isn't much to the story.  But with the usual Boyleness, it pulls out great excitement and a fun viewing.  'Yesterday' just kinda takes a brilliant idea and meanders around with it. If you're a big Beatles fan, you will find a little charm in it.  I would say for lighthearted viewing for Beatles fans only.  If the music wasn't as good, or the Beatles jokes, I'd likely have given it a 2 rather than a 5.  The Beatles hold this film up, plain and simple."}, {"rating": "10", "text": "If you love Beatles music, you should love this movie. Some critics seem to nitpick the plot, but they are missing the broader picture. I think the writers/directors made excellent choices in what to include. Of course, some threads that might have been interesting to pursue in the alternate reality plot there was just no time for. Nevertheless they included plenty of content to laugh and cry over. I found myself thinking about this movie long after it was over, which is a sign of a great movie."}, {"rating": "8", "text": "I saw this in theaters and absolutely loved it, left the auditorium crying like a baby. I have no qualms to admit crying at movies. Another sweet, positive movie about celebrating imagination and creativity. Patel gives a star-making turn as a failing musician who, after a world-wide black out, seems to be the only one who remembers the music of the Beatles. So he takes it upon himself to make-an-unfailure by passing them off as his own. Patel is utterly charming as a man trying to find his place with a whole new world placed in front of him. Should he keep with the lie and take the fame, scale back a while, or just stay in town with his manger/bestie Lily James, obviously nursing a crush on him. James has a rather thankless role but she’s great as always, and I try to steer away from this but I can’t help it, cute as all hell. We see the love and pain in her eyes and performance.We all know the music of The Beatles is something special, and the film brings that joy of their music in a new way, using them as a celebration of music and love. On this second viewing, it does feel a little of the length in the 2nd act after an astounding first. Many are upset over the end, but I think it works. The actually end is an utter joy, but there is a particular scene with a particular person that is sob-city."}, {"rating": "6", "text": "This is a decent movie that I thoroughly enjoyed. Here are the negatives. Just like Ma and Brightburn, the concept of the film is really good but it isn’t explored enough. You want to know more but it decides to focus on more character drama. Ed Sheeran is not the best actor in the world and he just looks incredibly awkward in this film. In most scenes he is in, it looks like he is incredibly confused. Another aspect would be that there are a lot of plotholes thrown into this film that when you notice them, it starts to take you out of the experience. The editing for this film is not good at all. There are too many cuts for some scenes and scenes just keep cutting away every 2-3 seconds when it shouldn’t. The camera angles are so obnoxious in some scenes that it is distracting. Some scenes are tilted at a 45 degree angle for no apparent reason at all and it is just annoying. The humor is not that funny at all and I only chuckled one joke throughout the entire film. I’m not huge on Kate McKinnon as the primary antagonist in this movie. She just feels out of place surrounded by everyone else. Here are the positives. Himesh Patel and Lily James do a great job and have great chemistry together. Patel’s performance is actually really good. He gives a ton of emotion, he’s a good singer, and he knew what he was doing. Most of the supporting cast does a good job with what they are given. I was surprised about how much heart there was in this film. You genuinely care about the experiences they go through. There is one particular scene that I feel is very very touching. Patel’s character is given an address and he drives to this secluded location where he knocks on the door and John Lennon answers it. He gives some inspirational words to Patel’s character and it is very nice, emotional, and touching. The new renditions of The Beatles songs is actually pretty good. I enjoyed listening to them a lot. The cinematography is good in most areas but it is not special. The tone remains consistent throughout the entire film and it’s also paced really well. Overall, Yesterday is a great Beatles love letter with lots of heart, good acting, and interesting renditions of good songs but is held back by major plot holes, poor editing, weird casting choices, and an underexplored premise. I give Yesterday a 6/10."}, {"rating": "7", "text": "The premise of \"Yesterday,\" a feel good movie from that master of melodrama, Danny Boyle (\"Slumdog Millionaire\") is that only one person in the world remembers The Beatles and their songs. Boyle hauls out the Hollywood meme that one person has knowledge that others don't, and we know that kind of knowledge is power (not to mention fun). There's \"Back to the Future\" (1985) and \"Groundhog Day\" (1993).\"Yesterday\" won't achieve the iconic status of these two films, but it's clever and charming and, through most of its run time, carefully assembled. It's light stuff, rading on nostalgia, and it works. The tension of whether he'll be found out, an understated but compelling performance by Patel, along with the sheer joy of hearing (and watching) the music being re-created and presented to adoring audiences, are the strengths of \"Yesterday.\" Yet it's not a film without flaws. The music, played by a B-list musician, doesn't rise to the level of other recent music-nostalgia films (\"Bohemian Rhapsody,\" \"Rocketman\"). And the secondary characters are all one-dimensional.  Still, it works."}, {"rating": "8", "text": "ABSOLUTELY LOVED THIS MOVIE! It's Simply BRILLIANT! I HAD THIS SILLY SMILE ON MY FACE THROUGHOUT MOST OF THE MOVIE! Really couldn't help it.This film is so moving and such a feel-good movie.The acting performances by each and every single actor is just incredibly good (ED Sheeran who's in it has some seriously good acting chops) especially by Himesh Patel (the lead/protagonist and Lily James, Kate Mckinnon to mention just a few) and the end will make you really blissfully happy and omg the beautiful Beatles songs sung by Himesh Patel himself (the main lead actor) are enchanting, to say the least. It is an Homage to the culture, the art and the amazingly wonderful music of the Beatles. It's also a beautiful Love Story and how simple yet important it is in our lives..more important than money, power or fame. The other aspect of it as I mentioned before is the influence and the musical culture that arguably the most famous band of all time left behind and the crux of this story is that we never realize how important or how valuable or how influential something or someone is, until they are gone"}, {"rating": "4", "text": "(Mauro Lanari)The idea of the second chance thanks to an alternative/parallel world good for the cosmology of the MCU, a lovingly clumsy protagonist for unexplained reasons, the songs of the Fab Four and their epigones considered essential for a better world without any counterfactual. Boyle and Curtis churn out a product with a golden and inconsistent surface. Be careful to scratch off the patina."}, {"rating": "6", "text": "When I went to these movies, I was honestly expecting something else. I expected to see another great music movie like Bohemian Rhpsody or Rocketman. The story and the plot is interesting, but poorly used for me. The end of the film can be guessed in the first 20 minutes. The second third of the film is starting to pull and in my case, I even started to fall asleep, maybe it is just because this film is more for women, it does not mean anything wrong, but just that he would not sit down and enjoy everyone."}, {"rating": "3", "text": "Welp. Now ill never listen to the Beatles again. This failed to catched my eyes so thats why I was playing Smash Ultimate the 1st 1/2 of the flim."}, {"rating": "2", "text": "The movie has an unbelievable boring story. It's just the normal \"successless musicians stuck with a **** job trying to get known and dreaminf about playing the biggest gigs in history\" with the name \"the beatles\" attached to it.The charakters are wirtten pretty bad, there's no depth to them. His best friends are sometimes there and say a couple of sentences ( it was mostly the same bad running gag) and the girl he loves comes by, says he loves him but blablabla and goes away again. This repeats 4 or 5 times and thats it.Also the plot has a lot of holes?! Why do the beatles disappar? Maybe some of you are fine that it doesnt get explained but i think it would be important.Why do things barely related to the beatles disappear, even though they existed before the beatles and why do other things which relate to them more directly dont disappear?Well would watch it again and i would recommend it to anyone, exept your a super big beatler fan. But i also dont think its the movie ever beatles fan dremt of all the time.*Spoiler*The movie has some scene which feel like they were just added to it because it might be good and why not? I talk about the russian guy and the blond british lady. I was actually hoping that there comes some sort of conflict or they would at least explain what happened during the black out but the scene after the concert was just a big disappointment and completely irrelevant."}, {"rating": "7", "text": "A fantasy romance in Fab Four drag, it could stretch its own premise further than it does - but its sheer charms make it an effervescent treat regardless."}, {"rating": "4", "text": "la película tiene un final sin sentido y el trama del tráiler (que la verdad hubiera quedado muy bien) no se mostró, más que de una forma banal"}, {"rating": "3", "text": "Probably the worst script of movie history. Boyle confirms his incapacity to understand if he's doing something good or wrong. An amateur.One of the worst movies of my life. You have the Beatles music in your movie, and you write this? My god."}, {"rating": "1", "text": "Extremely bad script built, a great idea worse executed and in the end looks more like a movie about Ed Sheeran."}, {"rating": "10", "text": "I LOVE this movie.  It is whimsical, charming, fun, and humorous.  Patel does a fabulous job of singing the Beatles songs, and the back-up musicians are great also."}, {"rating": "8", "text": "\"Yesterday\" contains a wonderful premise that stands up to no scrutiny whatsoever, but it's a fun, well-made, well-acted, big-hearted movie filled with many, many songs of the Beatles. I don't know why people, especially professional critics, feel it has to be something more than that in order to be any good or worthy of their blessing. To me, it's an ideal summer entertainment."}, {"rating": "9", "text": "Nice tribute to an Iconic group by proffering a premise what the world, bereft of their music, would have missed.  Sentimental yet not overly sweetly canned formulaic approach to storytelling."}, {"rating": "8", "text": "I’m sure I’m slightly blinded to some of this film’s familiar flaws because I'm such a big Beatles fan, but the charming cast and (usually) witty script, partnered with some of the best songs of all-time, are often enough to keep you entertained."}, {"rating": "5", "text": "Interesting idea. Great music (duh!). The rest - the script, performance, casting, directing - at least mediocre. Overall, a pathetic movie. Not a proper tribute to one of the greatest (if not THE greatest) bands in human history."}, {"rating": "0", "text": "No, giving up your dreams for love and babies doesn't solve your life. Bad movie. Also, too long. Could have gone with that cliche at least an hour sooner."}, {"rating": "9", "text": "Sometimes there comes a movie that despite some flaws or a plot that one might disagree with its charm and personality nonetheless win the viewer over.    If you are a Beatles fan and/or know-it-all you will either accept the movie light heartedly and enjoy its plot premise or you'll be overly defensive of your idols and be inclined to rip the movie to shreds.    I took the light hearted path and thus was very entertained and pleased overall with the film even though it was admittedly gratuitous at times.    To me it simply wasn't worth being overly critical lest it be a self defeating waste of time.    So the story involves one Jack Malik, played very well by Himish Patel , a struggling and average calibre songwriter whom for some reason after a global blackout and a collision with a bus becomes the only person in the world who remembers The Beatles and their music.    After playing a few lines of \"Yesterday\" he discovers this phenomenon, and at first being skeptical his friends really don't remember the Fab Four, decides to \"write\" some of their songs and pass them off as his own.    The results are humorous, somewhat predictable when the film recalls the Beatles history, such as Beatlemania, and a visit to Liverpool to see Strawberry Fields and Penny Lane, but ultimately satisfying with a few interesting twists and turns and humor to keep the movie light hearted.    Overall it's a celebration of what made the Beatles great, their lasting impact on humanity after all these decades with their timeless music, and perhaps a glimpse that might give us a hint of how they would be received if they had started out just a few years ago as opposed to just over 60.    It is a delightful movie, perfect for summer, and a welcome respite from the onslaught of super hero movies, far too many animated films and more than a years' share of clunker movies."}, {"rating": "9", "text": "The critics give this movie and average of 55 and gave BookSmart high ratings. BookSmart was terrible, this is an excellent movie, so don't always trust the critics. Ringo is very wrong. Go to see this one, if you have any love of Beatles music, you will be glad you did. The acting is great, the story is good, not perfect. Danny Boyle is a skilled director and does a good job on this one. Like many movies, this one is a bit too long but there are many great scenes and great characters. The plot is hard to believe, of course, but that shouldn't bother anyone given the sort of movies that exist today. There are so many bad movies, violent movies, sappy movies, incoherent movies, a good comedy with good music is a great thing. Bravo"}, {"rating": "8", "text": "Fui assistir so pelas musicas dos beathes, que  continuam excelentes, mas um ponto negativo nesse filme e o romance, que pra mim desviou totalmente o foco que era as musicas dos beathes, e o final nenhuma surpresa, mas vale a pena pelas musicas dos beathes e pelas piadas/alivio comico que estam bem engracadas."}, {"rating": "8", "text": "A sweet sad happy and surprising time at the movies. Logic issues aside it left me feeling very positive.Well worth your time especially if you're a Beatles fan."}, {"rating": "7", "text": "My husband and I saw this movie and thoroughly enjoyed it!  It is amazing how writers come up with scenarios for movies, and this one is quite unique.  Jack Malik (played perfectly by Himish Patel) is a struggling musician.  During a world wide 12-second blackout, he is hit by a bus in the total darkness.  Afterward, he discovers, much to his amazement, that no one else in the world remembers the Beatles!  What?  How can this be?  He tries desperately to remember all the word to their songs, and begins passing them off as his own.  Eventually, he ends up on the radar of a big star in the music industry, and life starts to get very complicated.  Lily James is always lovely, and here she plays his manager and good friend.  As the movie goes along, there is a running gag that is so much fun.  Look for the last thread as the movie ends.  Very fun!  Also, there is a sweet surprise in the latter part of the film that moved me so much.  This is a sweet, fun movie that, for some reason, made me see so much clearer just how great those songs by the Beatles are.  So much more so than when hearing them on the radio!  Go see it!  I can’t “Imagine” you won’t enjoy it!"}, {"rating": "0", "text": "Yesterday (2019)Sinopsis:Jack Malik es un cantautor británico que sueña con la fama y cuenta con el apoyo incondicional de su amiga Ellie. Tras un accidente, Jack se da cuenta que es la única persona que puede recordar a los Beatles.Opinión:De partida no quería ver esta película porque la trama me parecía absurda y un poco infantil, pero me empezó a picar el gusanito y decidí arriesgarme, lo cual resultó en un error fatal.Para mi fue una completa basura, debo mencionar que no me gustan The Beatles, pero reconozco su trayectoria e impacto cultural y encontré de muy mal gusto que usaran su nombre en una historia tan ridícula, ya sea, un mundo donde obviamente todos conocen a la banda y al otro día solo el protagonista los conoce y canta sus canciones haciéndose famoso, sinceramente mi mente solo sabía procesar rechazo y mas rechazo, además la dupla principal tampoco ayuda a que la experiencia sea amena por lo menos, el tipo que ni recuerdo su nombre es tan buen actor como yo un buen dibujante (no se dibujar) y la amiga del mismo, una tal Lily James tiene el carisma y simpatía de un insecticida sin mencionar que ella misma no se la pudo siendo Cenicienta en la película homónima tal cual tampoco Emma Watson en La Bella y la Bestia.Entre Cats y Yesterday, prefiero que me viole un hámster.Valoración:0 ⭐ de 5 ⭐"}, {"rating": "2", "text": "Conversations in the movie are interrupted about twenty times by a phone ringing or someone walking in to the room by accident. It became hilarious how often this happened. Yesterday is the kind of movie that is so poorly written and trite that it takes an act of will to make it through. The only reason plot lines aren't sewn up quickly is because the main character is made to stutter when trying to express himself.  If he, or anyone else, is about to say something meaningful they're interrupted. Yesterday takes the easy, predictable route at every turn. This was a concept in the ledger of a corporate studio exec, thrown out to a group of staff writers who cranked it out never daring to touch a risk, introspection, or explain much of anything."}, {"rating": "3", "text": "Unfortunately, this film is not half as good as I expected. The story is quite boring and disjointed and there isn't enough of the legendary music. The director seemed to not be taking too much interest in what he was doing. Maybe he was pissed all the time or just so bored and broke he thought he'd give his career one last shot. Beatles fans will appreciate the music but all in all this is definitely not up to expectations."}], "recommendations": ["begin_again", "mamma_mia_here_we_go_again", "into_the_woods", "eddie_the_eagle", "bohemian_rhapsody", "in_the_heights", "we_are_your_friends", "jingle_jangle_a_christmas_journey", "almost_famous", "the_greatest_showman", "the_illusionist", "chef", "cats", "burlesque", "rocketman", "annette", "hugo", "pitch_perfect", "the_lego_movie_2_the_second_part", "eternal_sunshine_of_the_spotless_mind", "hairspray", "cruella", "vanilla_sky", "casablanca", "alice_through_the_looking_glass"]}