{
  "id": 116,
  "title": "Yojimbo",
  "starring": [
    "Toshirō Mifune",
    "Tatsuya Nakadai"
  ],
  "runtime": 110,
  "genre": [
    "Drama",
    "Thriller"
  ],
  "description": "A nameless ronin, or samurai with no master, enters a small village in feudal Japan where two rival businessmen are struggling for control of the local gambling trade. Taking the name Sanjuro Kuwabatake, the ronin convinces both silk merchant Tazaemon and sake merchant Tokuemon to hire him as a personal bodyguard, then artfully sets in motion a full-scale gang war between the two ambitious and unscrupulous men.",
  "releaseYear": "1961",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tN7kYPjRhDolpui9sc9Eq9n5b2O.jpg",
  "categories": {
    "plot": 4.0,
    "acting": 9.0,
    "ending": 4.0,
    "soundtrack": 4.0,
    "cinematography": 4.0,
    "familyFriendly": 4.0,
    "funny": 1.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Sauron's forces have laid siege to Minas Tirith, the capital of Gondor, in their efforts to eliminate the race of men. The once-great kingdom, watched over by a fading steward, has never been in more desperate need of its king. But can Aragorn (Viggo Mortensen) answer the call of his heritage and become what he was born to be? In no small"
    },
    {
      "rating": "9",
      "text": "Amazing performance by Toshiro Mifune. Yojimbo is iconic and Eastwood-esque."
    },
    {
      "rating": "1",
      "text": "L’histoire me disait quelque chose… et à chaque tentative de visionnage de cette vieille connerie, ça me mettait un peu plus la puce à l’oreille… mais oui, c’est bien sûr ! Pour une poignée de yens ! euh… non, je veux dire, Pour une poignée de dollars !On n’en est que plus admiratif de Sergio Leone qui a su transposer et adapter cette fameuse histoire au western, créant d’ailleurs soit dit en passant un tout nouveau genre de western : le western spaghetti !Mais autant, le film italien s’avère brillant, autant le film japonais se révèle d’un ennui… imbattable ! non seulement imbattable mais également d’un humour volontiers imbécile, pour ne pas dire bêtement idiot.Certes, l’acteur préféré de Kurosawa, le fort sympathique Mifune est encore là mais comme trop souvent, il en fait des caisses et manque de sérieux, ce qui n’arrange pas les affaires de ce vieux film de merde. Je donne 1 point quand même pour avoir inspiré (à l’insu de son plein gré) l’excellent western, premier volet de la fameuse trilogie du dollar !"
    }
  ]
}