{
  "id": 2539,
  "title": "You Should Have Left",
  "starring": [
    "Kevin Bacon",
    "Amanda Seyfried"
  ],
  "runtime": 93,
  "genre": [
    "Horror",
    "Thriller"
  ],
  "description": "In an effort to repair their relationship, a couple books a vacation in the countryside for themselves and their daughter. What starts as a perfect retreat begins to fall apart as one loses their grip on reality, and a sinister force tries to tear them apart.",
  "releaseYear": "2020",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tpOwE6xsWnu4lKeKbKW0R3iClM.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.857142857142857,
    "ending": 8.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "In the horror film You Should Have Left based on the German novella by Daniel Kehlmann, a couple (played by Kevin Bacon and Amanda Seyfried) and their young daughter (Avery Tiiu Essex) take a vacation in a rental house in Wales. Soon, the father starts noticing weird things about the place. I thought this was decent.This has a pretty good psychological angle going on as the driving force is the couple's relationship and the husband's past. Even if you can tell where things are going, it's interesting to see things play out.The house helps push the unsettling mood. A lot of this the film is shot during the daytime, but that doesn't detract from the eeriness of the decor. This isn't one of those creepy old houses but a sleek, modern, European one. However, it is still scary due to it's minimalist, austere look and muted colors.Admittedly, the best scare is the first and none of the others quite match. I can't say this is the scariest or most inventive of horror films. However, I felt things worked well enough and there are some nice visuals.I've heard complaints about this being drawn out. Personally, I thought there wasn't anything that felt too superfluous, though the third act could've been cut down a little. I won't lie that this could be too slow for some, but I felt that the movie justified itself more than it didn't and had a nice ending. The dialogue often doesn't quite feel natural. Both Bacon and Seyfried have trouble making it work at times, especially the latter. Child actress Avery Tiiu Essex does a surprisingly good job as their daughter.Overall, I can't say this this is a must-see, but if you like haunted house movies or psychological horror then you may like this. It's a nice time-waster when you're washing the dishes or something."
    },
    {
      "rating": "8",
      "text": "Kevin Bacon is a great actor and he does not let you down in this mind bending thriller. I recommend this to anyone looking for a good movie to watch."
    },
    {
      "rating": "4",
      "text": "Once destined to have a theatrical release, You Should Have Left, it's yet another disappointing horror entry that finds its way into oblivion at the VOD cemetery.I have no doubt that perhaps the film would have recouped its budget and perhaps made a profit in theaters, considering that the kind of horror it presents is the kind of horror that today's audiences tends to avidly consume and most of all, be content with it.And is that You Should Have Left is a film that continues to perpetuate Blumhouse's formula: Spend little, limit the sets and characters, and expect good dividends.But that same minimal effort reflects all its weaknesses and this film is limited, shy and devoid of scares and a real atmosphere.It's not a complete failure, but it must be admitted that the little that can be saved is not enough to validate the whole thing.This film is a reflection of the public and what they currently know as horror and you cannot tell me that it's not, because if it weren't so, these films wouldn't be produced."
    },
    {
      "rating": "3",
      "text": "This movie was trash. Nothing interesting about it. I was looking for a horror fix since I watched every good horror movie that's come out since 2016. When I saw this one I got excited because it looked promising and honestly it was a huge let down. It does what other movies have done before and doesn't even do it very well. Big disappointment I would rate this a 3.5 out of 10."
    },
    {
      "rating": "7",
      "text": "Banker who killed his ex-wife takes his new family to Wales where they get trapped in a badly-designed house."
    },
    {
      "rating": "4",
      "text": "You Should Have Left''Whoa, it's spooky that the movie tried to warn to stay away from watching it, but just like a horror movie, I ignored it."
    },
    {
      "rating": "6",
      "text": "You Should Have Left is very reminiscent of The Lodge, but the writing and directing, although not near perfect at all, are everything the latter wishes to be. Even so, though Koepp does a good job with the usual horror scenes most of the time, other times they are overdone and consequently tedious and in their entirety, never too frightening as one would hope - save for one or two scenes. As for the performances, Avery Essex's is always promising. And whilst Bacon's is questionable many times (as is Seyfried's), he seems to pull through towards the end. It all culminates to a 93-minute horror that is mediocre at best."
    },
    {
      "rating": "5",
      "text": "The first 45 minutes of the movie was so dreadfully common that it was actually aggravating. But once the ball finally got rolling, it became mildly interesting, but even then, there was nothing particularly special about the plot of this film."
    },
    {
      "rating": "8",
      "text": "It should be known that ‘You Should Have Left’ is a psychological horror/thriller film, meaning that the movie focuses on the characters’ mental states and the complexity of their relationships and how this shapes the story. It’s not about cheap scares or loads of blood and guts aka murder, that is all too common in Hollywood horror. It’s about making you uneasy, which You Should Have Left has done quite well.On the psychological end, once the family is at their vacation home the movie sets up a good premise and setting of having you guess as to what’s real and what is only happening inside the character’s mind. While the second half of the story could have been more fleshed out (a lot happens in a little period of time) when you get to the end of the movie you still get answers and feel that things with the main character and the house have come to a satisfying conclusion.The couple of Theo and Susanna are played by Kevin Bacon and Amanda Seyfried and their daughter is played by Avery Tiiu Essex. The acting is well done and believable. Kevin Bacon is as good an actor as ever and was one of the reasons I decided to give this movie a try.Overall, this movie was pretty gripping. It’s definitely worth a watch. Best of all, the movie didn’t leave me with a headache from the stupidity that is most modern movies, especially those in the horror genre."
    },
    {
      "rating": "9",
      "text": "I enjoyed the acting as much as I enjoyed the plot. Wales, and generally the UK, provides more-than-appropriate a scenery for movies of that sort.Imagine that I was not in the greatest mood and thought I give it a try. Next thing I know, after the movie finished I was calm and content.It is a psychological and a horror scenario together.I wish it was more horrorish.Nevertheless, I would recommend it.Thanks for reading and enjoy the movie!"
    },
    {
      "rating": "7",
      "text": "Not a bad ‘thriller’ overall, but definitely short of being a horror film. I enjoyed the plot, and most of the performance. However, there were a few instances where Kevin Bacon wasn’t pulling it off well; the emotion seemed forced. One example is when he’s snooping in ‘her’ technology and makes random, off-the-wall comments. I’d recommend catching it on one of the free services rather than renting or buying."
    }
  ]
}