{
  "id": 4074,
  "title": "You Were Never Really Here",
  "starring": [
    "Joaquin Phoenix",
    "Judith Roberts"
  ],
  "runtime": 89,
  "genre": [
    "Thriller",
    "Drama",
    "Crime"
  ],
  "description": "A traumatised veteran, unafraid of violence, tracks down missing girls for a living. When a job spins out of control, his nightmares overtake him as a conspiracy is uncovered leading to what may be his death trip or his awakening.",
  "releaseYear": "2017",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/px6v0kY4rmHOcBTA7zelfD196Sd.jpg",
  "categories": {
    "plot": 8.236363636363636,
    "acting": 8.462962962962964,
    "ending": 8.25,
    "soundtrack": 7.666666666666667,
    "cinematography": 8.1,
    "familyFriendly": 3.0,
    "funny": 9.0,
    "action": 7.4375
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I think I've found it - the best movie of 2017. After the excellent We Need to Talk About Kevin, Lynne Ramsay has outdone herself with You Were Never Really Here. She has proven herself to be one of the best directors working today. This movie is a tour de force reminiscent of Taxi Driver. It's one of those rare movies in which the acting, direction, and soundtrack combine to create a work of art that is greater than the sum of its parts. Though the movie is often violent and disturbing, there are many moments of beauty as well, such as Nina quietly counting backward while riding in the car or water slowly dripping off of her hair. Joaquin Phoenix, as usual, is a revelation. He absolutely deserved his Best Actor award at Cannes. Also, Jonny Greenwood has created probably his best score to-date for this film. Some of the music reminds me of Remain in Light by Talking Heads. VERY cool. Try to see it while it is still in theaters!!"
    },
    {
      "rating": "9",
      "text": "Enthralling and brutal. It uses terrific visual language and an atmosphere that intelligently mixes subtlety and extremity."
    },
    {
      "rating": "9",
      "text": "While on a first watch I was utterly confused I had the urge to watch it again... then again. This movie may have some small flaws i noticed here and there nothing that ruined the movie for me. While I was a fan of the directors last film \"We Need To Talk About Kevin\" this i feel is a step up for the up and coming director making me excited for her next piece of work."
    },
    {
      "rating": "10",
      "text": "You Were Never Really Here is masterclass filmmaking.  Everything about Lynne Ramsay's film is meticulous and intentional.  Not a single scene is wasted as she paces out the story and character development perfectly.  Every flashback, every brutal beating, every intimate, claustrophobic shot of hair, foot, or scar is handcrafted with immaculate care and beautiful framing and focus.  Lynne Ramsay creates a portrait of abuse and brokenness that feels intensely personal, communicating unspeakable rage, drowning guilt, immense sadness, and dreadful loss.  The music is flawless, blending electronic, urban vibes with tense, idiosyncratic strings and wood basses.If only I could understand a damn word Joaquin Phoenix says."
    },
    {
      "rating": "10",
      "text": "What an incredible film with an outstanding performance from Joaquin Phoenix and great direction from Lynne Ramsay. The best film of 2018 so far in my opinion."
    },
    {
      "rating": "10",
      "text": "There comes a point when a film is so elite in so many ways that it must be called a masterpiece. The absolutely electrifying gifts that both Lynne Ramsay and Joaquin Phoenix give us in You Were Never Really Here unite in such a way that is rarely seen in any medium. This work of art does everything it sets out to do and more; every shot is a painting, every sound is carefully chosen, and every moment brings the audience along in a way that knows better than we do. You Were Never Really Here is a film that doesn’t mind being misunderstood on a surface level because it penetrates its viewers so deeply, it cannot be denied.From the very beginning, You Were Never Really Here displays its artful cinematography and disorienting sound as it takes us through the life of a broken man. Joaquin Phoenix disappears into his role and makes the viewers feel genuinely empathetic and completely terrified at the same time. The seamless and creative editing allows the audience to soak in his ugly life and feel his disjointed reality. This precision in every frame (artfully crafted by Ramsay), in each performance (all paced by Phoenix), and in each sound results in an experience that is unparalleled. I expect You Were Never Really Here to be in the discussion for Best Picture of the Year all year.Writing: 10/10Direction: 10/10Cinematography: 10/10Acting: 10/10Editing: 10/10Sound: 10/10Score/Soundtrack: 9/10Production Design: 8/10Casting: 10/10Effects: 8/10Overall Score: 9.5/10Original Article: https://thefilmguys.blog/reviews/augusts-reviews/you-were-never-really-here-2018/"
    },
    {
      "rating": "8",
      "text": "This movie is a very dark and violent psychological thriller, definitely NOT for every taste.Sometimes you come out of a theater and think to yourself \"what have I just seen?\"Usually an experience like that leaves me irritated or even frustrated about time wasted. Not this movie.It is full of memory flashes some of which might be dreams that never occurred.Reality mixed with a sick mind's hallucinations of a war veteran with PTSD who was abused as a boy.You never have a full picture, only small fragments, and you have to think to make it  whole. That is intriguing in itself since you cannot be sure you got it right.Great performance by Joaquin Phoenix, intense albeit somewhat intrusive sound track, fantastic cinematography.Overall, a piece of art made by talented people."
    },
    {
      "rating": "8",
      "text": "A taut, intense character study of a troubled soul on a noble but troubling path in the seamy underbelly of corrupt politics and child sex trafficking. Joaquin Phoenix delivers one of the best performances of his career as a weary protagonist who's good at his craft but haunted by ghosts from his past, as well as the repulsive nature of the circles in which he travels. Some aspects of the story don't feel as fully fleshed out as they could be, but the nuances are all there to convey the gist of the story. Not an easy film to watch, but one that's powerful in its message and hopeful at the prospect of personal redemption."
    },
    {
      "rating": "9",
      "text": "You Were Never Really Here is the story of an ex-FBI agent turned hired gun named Joe (Joaquin Phoenix). He has been hired by a senator to track down a 13 year old girl who was kidnapped and to inflict as much pain on the kidnappers as possible. But in his attempts to track them down, he seems to fall down a rabbit hole which leads to nothing but more violence and pain. However this story is rarely the focus and instead offers Lynne Ramsay to explore who Joe is and the horrible memories that plague his mind. As a hit-man he’s very effective, taking down his targets with nothing more than a hammer, some duct tape and a plastic bag. But as a person he is a fractured individual who is unable to escape the demons from his violent past.This past as rarely talked about, but instead we have to piece his past through brief glimpses of the person Joe has become. We see this through the physical scars on his back, dark memories of an abusive father and sudden flashbacks of the horrors he witnessed whilst working as an FBI agent. There are often times when Joe will be doing something as mundane as waiting for a train, when we’ll suddenly get the distinct impression that he’s seriously considering jumping on to the tracks. In spite of having relatively little dialogue, Phoenix’s performance sits alongside the greats like Robert DeNiro in Taxi Driver or Christian Bale in American Psycho as a portrait of a man who is unable to escape the dark thoughts which are plaguing his mind. His constant detachment to almost everyone around him mixed with his look of pure anguish shows the hard life he has put himself in, whether he deserves to be there or not. Oddly enough, in spite of how much death and violence happens in the film, we rarely see these acts of violence on screen. Instead we are often left with the visual aftermath of this violence, along with the physical and emotional scars that Joe carries with him. It distinguishes the film from other detective thrillers and mixed with Jonny Greenwood's pulsating score perfectly capturing the rhythm of the films hypnotic imagery. But the main thing that shines through the film is Lynne Ramsay’s vision of this painful life. She never relents on the cold atmosphere of violence that Joe seems to be trapped in and through this creates a powerful feature showing a damaged life, but still somehow leaves enough light at the end of the tunnel to make us think that some kind of redemption or release could still be possible."
    },
    {
      "rating": "9",
      "text": "Joaquin is one of my favorite actors. When I see him brooding in his films, I feel for his character. In this movie, you see his sensitivity with his mother, then he shows his dark side. I wish he would someday act in a movie when he’s smiling and happy. I already know he can sing, so add some dancing, and we would see a very different side of him. Anyway, while the subject matter was very stark and harsh, somehow Joaquin made us care for a character who has many flaws."
    },
    {
      "rating": "10",
      "text": "Impressively stylish, effectively moody and intelligent in its investigation of the frustration of circumstance and loneliness, Ramsay's masterpiece is the real deal as a study of masculinity. Excellently performed - Phoenix is as good here as ever - and wondrously crafted, You Were Never Really Here is, alongside Call Me By Your Name, the cream if 2017's crop."
    },
    {
      "rating": "8",
      "text": "The film, which is a very original combination of Taken and Old Boy films, which combined with the original assembly, great staging solutions and an intense atmosphere, creates one of its kind production. It was not without a reason that the film was awarded the Golden Palm, and Joaquin Phoenix once again showed that he is an exceptional actor."
    },
    {
      "rating": "8",
      "text": "You Were Never Really Here is one of those films that will make you shock and awe of how brilliantly crafted and masterfully shot this film is compared to the qualities of Drive and No Country for Old Men. No wonder why Joaquin Phoenix is making moves on being one of the very best actors in Hollywood history."
    },
    {
      "rating": "9",
      "text": "one of the best cinematic experience of the year. very solid and clean. Phoenix performance is very powerfull and mesmerizing!"
    },
    {
      "rating": "9",
      "text": "Movies like You Were Never Really Here only get good once you finish watching it. Which is a weird compliment, but in this case it is a very high compliment with how many layers and interpretations the film has that after you are done watching you think about what you saw and what it all meant. It festers in your subconscious that you can't help but think about it more and more until it finally bursts and you came to a conclusion on what it all meant...until you hear a theory that makes sense that you go mad about if your interpretation is right or if the other person's interpretation is about! That is definitely a high compliment!Joaquin Phoenix gives a great performance. I won't go as far as to call it his finest work, but he does carry this movie and understands a lot of this character and what the film is getting at. Phoenix is like a chameleon whenever he takes a role. You buy who the character is instead of seeing Joaquin Phoenix, and I bought such an interesting and unique character. Lynne Ramsey also deserves a lot of credit. This is the first movie I seen from her, knowing her from her previous film We Need to Talk About Kevin, one that's been on my watchlist for the longest time. After seeing this movie, I want to watch it. Every shot in this film is crisp and polished, and you get transported in what feels like another world, one that is alien-like but also intense and eerie. There's an atmosphere in this film that is just so off-putting you can't help but be sucked in. A large thanks to this goes to Radiohead's Johnny Greenwood working on the movie score (although it doesn't beat his work with PTA), benefiting with the other worldly score composition. All of which benefits from the brain chewing story where you aren't truly sure what is going on. Like mentioned before, there are so many layers and theories to mull over that it just entices you to truly learn more about what exactly is going on, which makes for a great watch that will surely benefit the more you watch it.There are a few issues I did take with this film. For one, the first act is pretty sluggish. It takes a while until the movie really gets going, but the first act of the film feels more like a slog to get through. Another issue, and admittingly this one is more nit-picky on my end but I know some would take issue with this, is that it is obvious when people aren't being hit.Overall, great movie and definitely one I'll be thinking about for a while now. I know this isn't a movie for everyone, so I will say is that if you are interested in watching a slow but interesting psychological crime thriller that will make you ponder, then give this a watch!"
    },
    {
      "rating": "8",
      "text": "You Were Never Really Here is a fantastic drama/character study and a decent revenge/thriller. Some of the action scenes and kills leave you unsatisfied, the score reminded me of Drive a bit too much and I wasn't the biggest fan of the ending, but overall this film left me enamoured by Lynne Ramsay's beautiful and unique direction and Joaquin's wonderful acting."
    },
    {
      "rating": "9",
      "text": "A new, hallucinating way for narrate a film-noir. Joaquin Phoenix is remarkable as the anti-hero in a search in a place far from Heaven but closer to Hell. The collapsing end will make you wonder if shall watch it again."
    },
    {
      "rating": "8",
      "text": "A film that by itself achieves something incredible, submerge us in the mind of an ex-marine with more traumas than memories, and adding the spectacular soundtrack of Jonny Greenwood, this year we have one of the best dramas, mysteries, thrillers with touches of crime. 86.6 / 100 (8)"
    },
    {
      "rating": "9",
      "text": "Ramsay fez mais sensualmente filmes arrebatadores, mas isso pode ser o mais formalmente exigente: nenhum tiro ou corte aqui é ocioso ou estranho. A câmera calma e fresca de Townend encontra textura rica e contraste em imagens aparentemente comuns, seja uma faixa de sombra passando por uma omoplata quando ela se enrola, ou a ondulação aveludada de um saco de lixo debaixo d'água. A edição do Bini, combinando linhas do tempo e pontos de vista em pinceladas brilhantes, dá ao filme o ritmo de um curto espaço de tempo em uma queima lenta. Enquanto isso, o hipnótico hipnótico personagem de apoio de Greenwood talvez até supere suas colaborações de Paul Thomas Anderson por sua variedade instrumental e sua bravata, passando de gritos para o violão discordante de uma guitarra com o que soa como um par de cordas estaladas. Em um filme de Lynne Ramsay, até mesmo os elementos off-key são perfeitamente escolhidos; um estudo requintado e ansioso em danos, \"You Were Never Really Here\" sabe exatamente o valor de suas cicatrizes."
    },
    {
      "rating": "8",
      "text": "Beautiful cinematography, phenomenal acting and intense scenes.The movie is surprisingly beautiful despite the amount of gritty and grim stuff in the movie.The plot is rather basic with a mix of taken and oldboy to it but it's enough to keep your attention. The movie isn't for everyone. Not much happens in the movie and a lot of the camera shots are purely for visual and doesn't add anything. The movie doesn't hold your hand in telling you what is happening and it is up to you figure it out on your own. The movie is worth a watch and whether you like it or not will depend on you"
    },
    {
      "rating": "8",
      "text": "I have yet to see Joaquin Phoenix give a performance in which he does not completely steal the show. You Were Never Really Here just may be his greatest, most raw work yet. It never, not even for a second, feels like he’s acting. I never once saw an actor on the screen, but a broken, sick man in search of some sort of meaning to his life.You Were Never Really Here is not a film meant for casual viewing. Its dark and brutal subject matter of PTSD, sex trafficking, depression, corruption, abuse of authority, and violence is explored in great detail. But the way it’s portrayed makes for a deeply moving story. The direction style goes for a lot of symbolic storytelling and for the most part, it works. When it does work, it presents a strong commentary on the dark aspects of life and how there’s always some light at the end of the tunnel.But where this film doesn’t really work lies in much of its presentation. There are some plot points and character arcs that feel like they have entire scenes missing from them. The plot synopses of this movie tell us that the main character, Joe, is a Gulf War veteran and an ex-FBI agent but there’s little to no material in the film itself to tell us that. There are some flashback scenes that almost feel unfinished, like they don’t really fulfil their purpose in telling us about the characters. Although the musical score works very well with how the movie is shot, the visual editing is choppy between scenes and the pacing is uneven, often shifting quickly between slow and fast pacing that makes for a confusing experience.But these issues don’t detract from the overall effectiveness that the film shows in delivering its message in a forceful way. The fantastic performances and simplistic, melancholy script immersed me in the life of Joe in such a way that I truly felt he was real, and that made his experiences that much more meaningful and relatable by the end of the story.You Were Never Really Here is an ambitious work of art. It juggles a lot of controversial, uncomfortable themes and even though it sometimes fails to hold them all in place and articulate them to their necessary extent, it manages to come through with a hopeful, emotionally resonant narrative that is essential viewing in these difficult times we live in.Story: 6Acting: 10Script: 8Visuals/Sound: 7.5Entertainment Value: 8.5OVERALL SCORE: 8/10"
    },
    {
      "rating": "8",
      "text": "Story: A middle-aged, ex-military man named Joe (Joaquin Phoenix) spends his days tracking down young girls for their parents, and he's willing to get violent if they're in some kind of trouble. At night, however, he returns to his home with his mother and is a relatively good son. After starting what he thought would be a fairly simple job, an event happens that completely changes everything, and he is forced down a very interesting, and brutal, path. This is a dark and violent story. And I say story because a lot of the actual brutality isn't shown. There's a very violent scene that's shown through security cameras, which lessens the blow of the scene. Also, a lot of the kills are also shown in ways that let the audience know what is happening but don't show them all of the blows like some other films do, such as Drive. I'm not opposed to this kind of stuff being shown on-screen, but I really respect the decision by the director to have such a brutal story but not necessarily show all of the brutality to the audience. I think a big reason for this choice is because the audience isn't necessarily meant to focus on the violence but rather on the story, and how truly dark it is. The director didn't want this to be a typical revenge story that people go to see just for the action. The path Joe ends up on as a result of this job reveals stuff that happens in the real world that we often don't want to think about. The way Joe's backstory and motivation behind what he does is incredibly well done. It's done through little flashbacks throughout the film, and we don't truly understand these flashbacks until we need to. This film also subverts expectations towards the end in a way that I initially made me think \"Ah, man\", but the more I thought about it the more I liked the way the story concluded. However, I think a big reason for the mixed reaction this film has received from general audiences is because of the choices I just mentioned. People who go in expecting lots of on-screen violence? They'll be disappointed. People who can't get over how the little twist towards the end? They'll really make their displeasure known. It is inevitable with films like this one.Characters: Joaquin Phoenix once again puts in a tremendous performance as Joe, and if anything this performance gave me confidence that he's going to do the Joker justice. Sure, he's technically the good guy in this film, but there's a lot of darkness inside his character and he does a really great job of portraying that. Script: This film won best screenplay at the Sundance Film Festival, so it's no surprise that the script is fantastic. Overall: Like most indie films, this one isn't for everyone, but I thought it was very good. Go for the story, not for the violence."
    },
    {
      "rating": "9",
      "text": "I found this film so fantastic, interesting, this is one of the best films of the year, its so quite, fascinating, this i think is a 101 on visual storytelling in my book"
    },
    {
      "rating": "10",
      "text": "Lynne Ramsay has shown herself to be an especially powerful voice in cinema, a filmmaker who prides upon working on her own terms and telling stories she wants to tell. The slight disadvantage of Ramsay’s selective methods mean that we see only sporadic offerings from her… yet when we do get to feast our eyes on a Lynne Ramsay project we’re not in for disappointment. You Were Never Really Here is the writer-director’s fourth film, a favourite at Cannes at 2017 and starring the exceptional Joaquin Phoenix. Based on a novella by Jonathan Ames, this is some of the finest work we have yet seen from Ramsay; harsh, bruising and raw, You Were Never Really Here is the psychological thriller as it’s meant to be done.Phoenix plays Joe, a brutal yet efficient gun for hire who specialises in finding and rescuing missing teens. We first meet Joe in the opening shot as he attempts to asphyxiate himself; it’s an uncompromising and harrowing image that sets the path of what is an uncompromising and harrowing film. Joe is ravaged by thoughts of suicide, tormented by memories of childhood abuse and wartime tragedy. He is hired by a Senator whose daughter has been kidnapped by a sex ring; it seems easy work for Joe until everything starts to go awry in a violent tale of mystery and trauma. It is tough to think of any way to adequately respond to this film other than to applaud it. Lynne Ramsay crafts a measured thriller, reeking with tension and thematic richness. It runs at a brief 90 minutes though doesn’t feel rushed; truth is, there’s no trimmings here… every shot is painstakingly rendered, every flickering look and every burst of remarkably contained violence reasoned and impactful. It’s a film of few words and this is absolutely to its credit- we understand so much more about Joe and his fragile mental state in that cruel silence. On the outset, one expects an action thriller, a Taken revenge story, but Ramsay turns all expectations on their head. You Were Never Really Here is a pure character study of a deeply troubled man. It’s a testimony of grief and mental torment and prefers quiet moments of tension over bloody gore. The film rests entirely on Joaquin Phoenix, who like Ramsay is delivering some of the most compelling work of his whole career. Phoenix utterly immerses himself in a character that is tragically believable and bolstered by an understated performance from the Oscar nom. However stupendous Phoenix is, Ramsay is the true maestro here. Her direction in this film is enough to quench any sceptics of her skill, a daring approach that lingers on moments of profundity but equally gives the audience no time to breathe. Though there are moments of alarming violence, this is not the focus of the film; we’re distanced from Joe’s ‘work’ (one certain sequence is viewed through the prism of a security camera) yet the fractured flashes of Joe’s damaged psyche are as real and horrifying as anything. In this brutality however there’s something eerily beautiful about You Were Never Really Here; it’s a film full of gorgeous and shocking visual poetry that takes an unnervingly surreal approach and blurs the field of reality- how much of what we are seeing is real and how much of is actually the tormented dreams of our troubled protagonist? It’s one of many interesting questions that is raised… but pleasingly never answered. The sparse dialogue here means there is a relieving lack of exposition; Ramsay isn’t leading you by the hand but rather allowing you to sink into the world she creates and form your own perspective. It’s a world conjured in an illusionary style by Thomas Townend’s judicious cinematography and elevated with unsettling vigour by a superbly atonal score by Jonny Greenwood.There’s something remarkable about You Were Never Really Here; lacking in ornamentation, everything on show here has some effect, every seemingly trivial shot meaning something more than it does on the surface. It’s a challenging watch but this is part of what makes this and the rest of Ramsay’s filmography so enthralling. Some will walk away asking deeper questions, others will walk away simply satisfied by an intense thriller. Either way, you’ll appreciate the raw craftsmanship behind it, every aspect perfectly aligned to create an eerie and mesmerising piece of cinema."
    },
    {
      "rating": "9",
      "text": "An extraordinary movie. Written, directed and produced by Lynne Ramsey, and brilliantly edited by Joe Bini. This is not an \"action extravaganza\", and while it is violent, it is not gratuitously so. Phoenix's performance is astounding and nuanced. The camera, lighting and pacing are wonderful. Definitely not for kids or troglodytes."
    },
    {
      "rating": "9",
      "text": "I seem to be driven to write mostly negative reviews, so now I wanted to write a review of a movie I really liked. I watched this movie a year ago and then re-watched after seeing Joker. Phoenix gives a stellar performance in a tale that is dark, possibly too dark for many. The movie works with a positive vibe to working towards and ending that is touching. It made me cry. The acting this in this movie is supported by a story that is well written and centers itself on where it should: the characters. This allows the actors to invest and show us people who feel alive and whom you can connect with and maybe even care for. Phoenix has this remarkable skill to do this, which he also shows with Joker. These aren't easy characters to play. If you can stand unusual characters that might be hard to like or understand, then this is a movie you could try. Personally I would just do because if watching a movie with a story that makes good acting possible. Which in itself is a good reason to watch movies like these."
    },
    {
      "rating": "7",
      "text": "A really different movie than the ones you mostly get to see. Epic performance of Joaquin, solid story and great representation of a PTSD situation.I could only recommend it."
    },
    {
      "rating": "8",
      "text": "Con una premisa que recuerda a Taxi Driver, la película se narra de forma lineal, pero para mostrarnos al personaje de Joe, se vale del uso de \"flashbacks\", que reflejan el estado mental en que el se encuentra a causa de todo lo vivido en la guerra, los abusos que sufrió de niño y todo lo que vio en el mundo de la trata de personas,  un recurso bien utilizado . Al igual que Taxi Driver la película maneja el estilo del cine negro. Con una fotografía y un buen uso de colores la directora crea escenas con un gran impacto visual y con simbolismos.La actuación que le valió a  el premio a mejor actor en la pasada edición del Festival de Cannes, es excepcional, logrando meterse completamente en el personaje atormentado y sombrío que tiene que representar. La película logra sacar la esencia de Taxi Driver y así crear escenas de gran logro estilístico."
    },
    {
      "rating": "10",
      "text": "You Were Never Really Here is one of my favorite films of the year. I saw it for the first time in Palo Alto with a friend shortly before I started this project of writing reviews. I liked it so much that I took a pretty big chunk of Don’t Worry, He Won’t Get Far On Foot to talk about the good year in film that Joaquin Phoenix is having. The film is a study in objectivity. The depiction of violence is clinical, sterile. The would-be climax in any other action film is seen at a distance on grainy security cameras in black and white, or in the blindspot of those cameras, to be more accurate.Much of the first act is more about depicting the act of caring for an aging parent with dementia, even more so than his exploits as a hired gun. The cuts to his troubled home life as a child, hiding with his mother from his drunken father, breathing deeply into a plastic bag, which at first look is disorientingly erotic until it’s clear that the only sex depicted in this world is not sex at all. The erotics of the film are passionless, animated by shame and compulsion, the same forces that drive Joe to wait at the top of the stairs for his bottle of pills.The camera lingers on Joe as he pulls out the domestic items for his violent job–a roll of duct tape, two cans of soda, a bottle of water, some candy. The slick, twee coolness of the ball peen hammer on display in the hardware store has worn off. Instead of the romance of the gun or blade, we have the simplicity and barbarity of this tool-turned-weapon, a swords-to-ploughshares story in reverse.The music and sound are excellently done. The static, digitized filters over the first ten minutes are alienating and eerie, and communicate the trauma of Joe’s most recent skip-tracing job, the images of dead girls in the back of a trailer truck flash through his mind.The title of the movie is itself the lyrics of a song that remain unspoken in the title sequence. They’re meant erotically, but there are so many other applications of the metaphor. The spy trope. His diligence and attachment to secrecy, which prevent him from forming stable relationships.I love the metatheatrical gestures to cinema, Psycho and scary movies, his reenactment of the stabbing in the morning, and the surreal gentleness he shows to the hired gun on his kitchen floor, as they sing the lyrics to an 80s love ballad.The fragmented flashbacks to Iraq, and the short story of the candy bar are a genius bit of storytelling. So much detail is spent on the stories that mundane domestic objects can tell that even the sweets in Joe’s employer’s room, the jellybeans, are freighted with foreshadowed significance. What does he do when he finds his favorite green jellybean? He crushes it.Other arcs of the film are so beautifully original and philosophically provocative: the funeral’s interruption at the vision of the girl. Joe’s apparent change of heart at that moment, with the unloading of rocks. He doesn’t change out of his funeral clothes as he arrives at the mansion. Reality breaks down as surrealist images permeate the visual field. The false bottom ending is a masterful stroke. Joe’s emotional reaction at the discovery makes for such a complex palette of anxiety.You Were Never Really Here is a must see, a beautiful, tragic character study of violence packaged in a popcorny action movie."
    },
    {
      "rating": "9",
      "text": "Joe is a war veteran who has also survived many other battles. At home only his elderly and sick mother awaits him, with whom he has a relationship of great affection and patience. In a desolate New York full of secrets, whose noble profile always remains in the distance, Joe works as a mercenary for those who want to get rid of dangerous enemies but do not have the skill or the courage. His latest assignment is to rescue Nina, the pre-adolescent daughter of a local politician, from a child prostitution ring: an abused and offended creature who mirrors the man's past. Joe appears and disappears, often armed with a hammer, as if he had never been there, slashing and chasing with the same hallucinated intensity the devastating memories, both of his childhood at the mercy of a sadistic father, and of the war crimes committed behind him. the justification of a uniform. Joe's is a universe of lost children raised at the mercy of orcs and often become like them, a world in which man moves like an executioner, trying to patch up his life reduced to a puzzle of sensations and bad memories. Truly wonderful film and full of anguish this film by Lynne Ramsay, which tells a story already seen but always does it by putting the camera in the right place at the right time. An extraordinary performance by Joaquin Phoenix."
    },
    {
      "rating": "9",
      "text": "Easily one of the most original, most interesting, and most shocking films of the last several years. It reminds me a bit of the filmmaking in Good Time from last year - two films that seemed to have come out of nowhere to challenge the stale, predictable theater experience that has dulled our senses recently.  There's nothing like this.  However, it is very different. And the small touches of humor were perhaps a little out of place.  But if you love movies, this is a no-brainer.  Do your best to avoid trailer, too, because they seem to spoil some of the best moments.  Kudos, also, to the young actor playing the girl Joe is attempting to save - excellent performance which had to be challenging."
    },
    {
      "rating": "8",
      "text": "You Were Never Really Here is a tense and dark thriller with a brilliant performance from Joaquin. It has been compared to Taxi Driver because there isn’t really anything else you can compare it to. It’s reminiscent of Taxi Driver particularly when it comes to the main plot and the soundtrack but it almost seems unfair to compare the two, Taxi Driver is the better film.Joaquin Phoenix is chilling, a broken man, suffering from PTSD. He devotes his time to help track down missing girls. His methods are brutal but when he becomes caught up in a bigger case than once appeared things quickly escalate. It’s offbeat and very slow to build. Brutal and disturbing but if you’re expecting to see extreme violence it’s best to know that the majority of it happens off camera. You Were Never Really Here is all about the atmosphere yet what stood out the most was Joaquin Phoenix. This part was perfect for him and if you think I’m going on and on about it then you better find a cinema screening this and see it for yourselves. Very dark, a thriller in its simplest form. Highly recommended."
    },
    {
      "rating": "10",
      "text": "An emotionally shattering film, another masterpiece from Lynne Ramsey (I have never been able to forget her “We Need to Talk about Kevin” – about the devastation and guilt that come from having a son who commits a school massacre). The sadness at the end of this film is overwhelming and you feel totally drained afterwards. Joaquin Phoenix’s pitch-perfect, deeply moving performance is at the center of a wonderful cast – Joe is a man on a mission – but I won’t say anymore since I don’t want to spoil this wonderful film for you. If you love film, you must see this one."
    },
    {
      "rating": "7",
      "text": "You Were Never Really Here is a very experimental neo-noir thriller. While the plot is very muddy, the cinematography is beautiful, very clear, and Joaquin Phoenix's performance is enthralling. The strength of the movie is it's portrayal of a man in torment from PTSD. The flashbacks, hallucinations, suicidal thoughts, and overall sense of anxiety are strikingly realistic, and the fact that we the viewer are never really sure what is real and what isn't really leaves an impression. If you are a fan of experience movies or suspense, definitely give this one a watch."
    },
    {
      "rating": "10",
      "text": "Fantastic film. Elliptical structure works because the pulpy source material has been boiled down to its emotional beats (very reminiscent of “Point Blank” in that respect). Not concerned with plot details, it nevertheless has a propulsive energy that kicks in once the “mission” begins and never lets up. The final scene is incredibly powerful — more thematically lucid than some of the reviews led me to believe. (If those critics really didn’t see the point of this movie, they had no business reviewing it in the first place.) It’s easily Phoenix’s best performance and just one of Ramsay’s several masterpieces — she is the DNA of cinema. But she doesn’t spoon feed. She makes you work for the rewards. I can’t wait to see it again ... in a THEATER. It’s not the kind of movie that will play as well on a TV."
    },
    {
      "rating": "8",
      "text": "If I had a hammer, I'd hammer out of danger, I'd hammer out of warning, all over this land.Atmospheric, brutal, amazing score, acting and photography. There is something that in the story that did not click for me 100% but I cant put my finger on it."
    },
    {
      "rating": "7",
      "text": "I really needed a film like this one and even though in the end it finished below my expectations, still is a very good film.I must say the ridiculous comparison of being the Taxi Driver of the 21st century will make a lot of people to judge it with an unjustified fierceness and although the comparison could be considered somewhat fair because of certain similarities in the story, the truth is that both movies could not be more different from each other. And I'm perfectly aware and I know that I must give credit to the director because she manages to maintain an interesting and stable narrative, despite the fact the story gets some rhythm setbacks but the person who deserves full recognition is Joaquin Phoenix and I say this because his performance is top notch and really committed. He gives the film another face. He's the one who puts it in a different plane and without a doubt offers a bigger showcase for those who don't know Lynne Ramsay's work. Many people said this is her best film but even though I liked it a lot, ''We Need To Talk About Kevin'' will continue as my favorite but ''You Were Never Really Here'' is a film that any film lover should be watching."
    },
    {
      "rating": "9",
      "text": "Breathtakingly harrowing with a performance by Phoenix that burrows under your skin and stays for days afterwards. Directed by Ramsay who knows how and when to allow the visuals tell the story, trusting her audience with a virtual absence of spoonfeeding. A soundtrack that perfectly captures the essence of brutality and a mind crumbling into psychosis. A definite must see and one of my top three films of the year so far. Excellent."
    },
    {
      "rating": "8",
      "text": "This film is PERFECT!Joaquin Phoenix gave such a powerhouse performance. He was the best choice to play the character of Joe who is devastated and traumatized but also very gritty and ruthless.The use of imagery is just incredibly magnificent. I really can't remember any filmmaker who used the allegory that good in maybe the last 5 years like Lynne Ramsay did in this movie. that was so clever and intelligent, and the most important thing is that I haven't felt the metaphors were stilted or something, they were very important to the character development and therefore the story itself; as this movie has a character-driven plot. The strange thing that it seems that the problem I have with this movie maybe has something to do with the use of imagery. I wanted to be more invested in the movie, and as I tend to dramatic themes, I think more engagement was required from me to be 100 percent interested in the characters and the story in such a film that relies heavily on imagery, especially with the slow pacing. That being said, sometimes the movie hit me right in the core of my heart and even almost made me cry!The cinematography and is mesmerizing and beautiful despite the dark atmosphere it has created, and Jonny Greenwood's score is captivating as usual, but the editing, especially the sound editing, is what makes this movie even more special; it is actually plays a vital role in the part of storytelling. I don't want to ruin anything for who haven't seen the movie yet, but all i can say is that the editing in this movie is a requisite tool, nay a technique!Here's something else great about this movie, it paid homages to Taxi Driver, Psycho, No Country for Old Men and maybe other movies, and I have never felt they were forced to the movie or something. Actually all these homages were professionally merged with the plot.(8.5/10)"
    },
    {
      "rating": "5",
      "text": "Not my type of film. Lots of long, dramatic scenes, that are unnecessary for the plot. You could fit the plot synopsis in a paragraph. Not enough happens in the film to my tastes."
    },
    {
      "rating": "3",
      "text": "Could those who gave this a ‘standing ovation’ have been abusing substances or on the payroll of the promoters? This again proves you may be able to fool some of the people, some of the time. I’d suggest the producers, B.F.I., Amazon Studios, etc, would have lost considerable sums of money with this pretend movie. As this overly convoluted maze progresses it makes you wonder how Joaquin Phoenix and other cast, managed to keep a straight face (might have been interesting to have seen their faces while they read the script) At times it looks as if the editor and director threw some footage in the air and spliced it together in the order it landed – then, attempted to copy Kubrick during one of his worst moments.  In one scene, Phoenix jumps into a country lake and proceeds to endlessly sink into the deepest abyss (a-la Atlantic Ocean) who makes these foolish ‘technical’ decisions? The graphic violence (whether on or off screen) is as off-putting as the snail pacing and lack of worthy script - what sparse dialogue is uttered,  is so poorly recorded and articulated most is unintelligible. Director/screenplay writer Lynne Ramsay has to shoulder much of the blame for this morbid failure to connect with a thinking audience (in preference to appealing to a nebulose, artsy bunch). While there may have been some stylish photography much of it looked like the operator forgot to turn off the camera between takes – with someone then thinking it looked so trendy they used it several times over. Mostly for those who want to read more into each scene than is articulated on screen or simply want to justify what they ‘think’ they understood, otherwise, a miserable experience that stretches its 85min R/T into tediously grotesque boredom and wastes a Phoenix performance."
    },
    {
      "rating": "7",
      "text": "Well-thought out cinematography that depicts violence and brutal impulses both in a more visceral and realistic fashion than most \"movies\", focusing on its random, dehumanizing, kinetic force where bodies look like mere lumps of flesh through out-of-focus, half-cut shots as well as the more typical technique of \"showing less to make you imagine more\". Phoenix is obviously the actor that fits the bill since his role in \"the Master\" where he displayed the same hypnotic charisma and, in that film, even has the look of an old wounded lion with his shaggy mane.Maybe what prevents this movie from being truly great is finding a soul or a more solid script. Or maybe it is actually its point: Soulless nihilism..."
    },
    {
      "rating": "5",
      "text": "What started out as such a smooth, intriguing, and flat out cool and promising first half hour quickly went downhill from there for me unfortunately. The good: Joaquin Phoenix and the cool and eerie soundtrack, as well as some 'Taxi Driver' and 'Drive' vibes. The bad: like I said, the first half hour had me so hooked and excited, but after that, the film became very scattershot and aimless, and most of the violent scenes weren't even all that violent or exciting, as it'd always cut away or simply only show the aftermath or the bodies afterwards. Where's the fun in that? And lastly, the ending felt much too open-ended to me, which isn't always a problem for me, but it just didn't work well at all for this film in my opinion. Overall, it was an intriguing concept and had such a cool vibe to it, especially in its first half hour, but it couldn't really keep that momentum or vibe for me much at all after that."
    },
    {
      "rating": "5",
      "text": "This is one of those films where everybody stares meaningfully at everybody else and the dialog occupies about three minutes of the total runtime.  Also, there's a lot of popular music that I'm guessing comes out of the fifties.Maybe it's art.  I'd rather play ping-pong."
    },
    {
      "rating": "3",
      "text": "Slow movie, clap trap, aiming at winning prizes, and it did win some. The movie is a slow burning movie where the protagonist is shown to do nothing for too long far too often. That's artsy it and critics love it. It's a story of a hardened but messed up Gen-x man saving little girls from abductions and being used.It's a very tame movie, nothing happens but some shaky-cam fight scenes and staring at the protagonist doing nothing of interest because - again - that's artsy. More importantly, it's a paper thin movie; Tough son of a gun saves cute teen girl. Does most of the time nothing, does a bit of investigation and saves a girl. End of movie. Standing ovation. Wins prizes. Critics write raving reviews.Also, considering the fact that Hollywood and their faux indie community are infested with pedos, it's eerie to watch a movie about this produced by them."
    },
    {
      "rating": "4",
      "text": "Incredibly boring, slow paced, too much downtime, and tries to be too many things. What I mean is: it has the setup of other similar \"hitman saves girl\" action movies, but the cinematography, audio design, and pacing of an artistic indie movie, but the narrative design of a crime thriller. It succeeds at none of these things. If, like me, you come from the trailer expecting tense and violent action, you'll be disappointed that it all happens basically off-camera. As others have said, far too much time is spent building up scenes with Joaquin Phoenix slowly walking through dimly lit areas taking up 90% of the film. Honestly this movie put me to sleep so I don't know if the ending makes it all worth it. Giving it a 4 because the performances were objectively good."
    },
    {
      "rating": "5",
      "text": "The film begins with a great premise, a mentally scarred veteran who traverses the criminal underground for jobs and drugs. Accompanied with an electrifying and pulsating soundtrack, it promises tense thrills to come. When they do come however, it is often happening off-camera or simply skipped altogether, showing only the aftermath of a conflict. With the thriller aspect of the film missing, all that is left are long and often boring scenes of silent contemplation by the characters. The plot doesn't inspire you to think as it's pretty straightforward: Human trafficking is bad, and murder can make you suicidal. Don't intend to watch again."
    },
    {
      "rating": "3",
      "text": "Joaquin Phoenix seems to be reveling in this self-indulgent character study that's both ambiguous and tedious. He's some kind of hired hammer (which he uses instead of guns) who sets out to retrieve a young girl from sex slavery. But not before we suffer with lots of lingering personal moments and confusing flashbacks. While director Lynne Ramsay has created an elaborate display of technique and style, the experimental approach is more frustrating than enlightening or entertaining. The soundtrack adds another edgy element. This may appeal to hardcore fans of the bearded, burly Phoenix or lovers of unfulfilled weirdness."
    },
    {
      "rating": "3",
      "text": "Slow pacing throughout ruined the film for me.Too much action takes place off screen. The sound design with annoying screeching and seemingly random use of stingers make viewing tedious my party considered walking out.  Thankfully the experience is only a hour and a half."
    },
    {
      "rating": "0",
      "text": "This movie was a big piece of **** devastatingly boring. Just watch the trailer and save yourself a call to the suicide hotline"
    }
  ],
  "recommendations": [
    "the_rover",
    "the_killing_of_a_sacred_deer",
    "ex_machina",
    "the_master",
    "a_history_of_violence",
    "eyes_wide_shut",
    "127_hours",
    "the_walk",
    "the_beguiled",
    "sicario",
    "21_grams",
    "first_man",
    "nocturnal_animals",
    "drive",
    "stoker",
    "a_most_violent_year",
    "titane",
    "black_swan",
    "the_machinist",
    "no_country_for_old_men",
    "sicario_day_of_the_soldado",
    "the_good_shepherd",
    "good_time",
    "the_green_knight",
    "the_guilty"
  ]
}