{
  "id": 4606,
  "title": "You Only Live Twice",
  "starring": [
    "Sean Connery",
    "Akiko Wakabayashi"
  ],
  "runtime": 117,
  "genre": [
    "Action",
    "Thriller",
    "Adventure"
  ],
  "description": "A mysterious spacecraft captures Russian and American space capsules and brings the two superpowers to the brink of war. James Bond investigates the case in Japan and comes face to face with his archenemy Blofeld.",
  "releaseYear": "1967",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8axcRNpDi1W6SQTpK2tblDhcFa8.jpg",
  "categories": {
    "plot": 6.947368421052632,
    "acting": 7.0,
    "ending": 6.428571428571429,
    "soundtrack": 10.0,
    "cinematography": 8.5,
    "familyFriendly": 8.0,
    "funny": 7.25,
    "action": 7.7
  },
  "reviews": [
    {
      "rating": "10",
      "text": "James Bond is awesome!James Bond is awesome!James Bond is awesome!James Bond is awesome!James Bond is awesome!"
    },
    {
      "rating": "8",
      "text": "With a script written by Roald Dahl of Charlie and the Chocolate Factory fame and a great opening theme by Nancy Sinatra, All in all, this is one of the more enjoyable adventures for James Bond, setting the stage for everything else to come post Sean Connery. While it is not the final time we see Connery as Bond, it is his last best effort in the role.https://latetothegame.blog/2019/01/31/key-movies-of-my-life-james-bond-edition-you-only-live-twice-1967/"
    },
    {
      "rating": "3",
      "text": "I tolerate this one slightly more than Thunderball but it's still almost instantly forgettable. Aside from the first onscreen appearance of Blofeld, There is nothing memorable about this movie. It follows the typical Bond formula and features a bland plot and characters.And much like Thunderball, I feel like the second half could have been edited down because it tends to drag a bit, especially towards the end of the film. Also, It was very awkward to see Connery in yellowface."
    },
    {
      "rating": "9",
      "text": "This is the fifth installment of the Bond franchise, with Sean Connery as James Bond, and takes place largely in Japan. The plot has to do with SPECTRE being behind a NASA spacecraft being swallowed up and lands in the Sea of Japan. In the film, Bond is dispatched to Japan after American and Soviet crewed spacecraft disappear mysteriously in orbit, each nation blaming the other amidst the Cold War. Bond travels secretly to a remote Japanese island to find the perpetrators, and comes face-to-face with Ernst Stavro Blofeld, the head of SPECTRE. The film reveals the appearance of Blofeld, who was previously a partially unseen character. SPECTRE is working for the government of an unnamed Asian power, implied to be the People's Republic of China, to provoke war between the superpowers. Blofeld again is seen in his Mao suit and pets his Persian white cat. He has a scar on his right eye and is bald. The movie gets a higher score because it is the first to reveal Blofeld's face. The action and cinematography are fantastic especially for the year the movie was released. Overall, the movie is a fun ride."
    },
    {
      "rating": "7",
      "text": "For the first hour of this movie, I found myself honestly wondering why this particular film wasn't considered amongst the upper echelon of films in the James Bond franchise. The action was terrific, the plot was intriguing, and the setting was a welcomed change of pace for the series at the time. Then, the second half of the film occurred. Now, strictly speaking, it's not \"bad,\" but it does underperform greatly when compared to the prior hour. The story gets a little bit too grand and silly for its britches, the visuals become increasingly more dated, and one of the more problematic elements I've ever seen in a Bond film is introduced and relied upon too heavily for me to ignore. All in all, \"You Only Live Twice\" does feature some fairly dynamite Bond elements throughout (i.e. the theme, the action overall, etc.) but its preposterous second half almost drags it into the depths of self-parody."
    },
    {
      "rating": "6",
      "text": "The beginning of the movie is very good, because it takes place in Japan. But the 2nd part is full of outdated action, sometimes it is even ridiculous. The story is also simple. Sean Connery isnt acting very well like in the former movies also."
    },
    {
      "rating": "9",
      "text": "Having watched 25 Bonds from Dr.No to Spectre, I place You Only Live Twice at 3/25.And let me say right now, it doesn't deserve that rating. It deserves a good rating, but 3rd best?I rate this movie this high because it has 2 elements:- It's a Bond movie from its starter/golden era, where Bond was absolutely amazing- It's set in JapanBond back in the 60s/early 70s had a very strong sense of escapism, and not just from the real world where plots need to make sense, but also from dreary old normal life. Travelling to Istanbul with From Russia With Love, to the Carribean in Dr.No, to Japan in YOLT was just wonderful.You Only Live Twice starts off with Bond being \"killed\" and ends with him meeting the villain in a giant secret Space Station that's hidden in a volcano.\"Mr Bond, I thought you died\"\"Yes this is my second life\"\"You Only Live Twice, Mr Bond\"It's the epitome of these kinds of lines, now seen as cheesy and camp but honestly I think they've kept all of their charm. The visit to 1960s Japan, the Big Evil Secret Volcano Lair, the mad scientist villain, the fights, the girls, the banter, the army of Ninjas, the Rocket That Eats Other Rockets, the gadgets, the stupid ways they try to kill Bond, the everything really.Bond always cared more about a solid amount of fun than a sensible storyline, and it was, back in the 60s, still managing to mostly have both. Here you escape to 1960s Japan with Bond, and you enjoy the ride from start to finish, easily brushing aside the silliness. This movie brings me joy in ways that no later movies in the franchise, and really very few movies, can.The first half is all about escapism, and the latter half about fighting the Evil Villain, and even though I prefer the first half, the whole movie is joyful, witty, charming, all-around adorable and I love it to bits.With that said, let me be a historian here: You Only Live Twice must be marked as the first \"industrial\" Bond movie. I have a personal theory that EON, after Dr.No, FRWL, and the brilliant Goldfinger, tried harder than normal to make an even more exceptional movie, and bombed with the nonsensical, terrible, absolutely ridiculous Thunderball. Thunderball was an immense directing and technical effort for a very boring movie, a stupendously complicated story for a stupendously retarded, nonsensical plot, it was the movie where EON tried its hardest to make a masterpiece and utterly went beyond their skills.Thus out of the first 5 movies, there is the beginner, the reverser (FRWL is ultimately a classic thriller with a Bond coat of paint), the masterpiece, the failure, and the moment where the series just kind of accepts that it found its limits, sets itself in its formula, and keeps going straight forward, just toeing the guidelines the first 3 movies created. Of course, the later actors, especially Moore, the eras changing, and many other elements will demand changes. But the core \"idea\", the core \"style\", it's all set and followed starting this movie.YOLT is the first movie to be an \"industrial\" Bond, being the moment where the franchise stopped being truly original and just applied what it knew and would keep doing it for 40 years and some (the last classic Bond was the last Brosnan, Craig is a really different beast).But Bond was, long before it became this incredibly lengthy, unequal, sometimes decent sometimes bad series, fun. It was with so much banter, charm, wit, and good action for its time that it was just plain fun.You Only Live Twice is where the series rested its feet into the concrete and solidifed. But even if it is the start of one of the longest-running series ever, a series that had its very large share of critics and fans that were increasingly tired of it, it is still carrying that brand of fun, that Bond-ness that is lost on us today.I consider it historical, both the first industrial Bond movie, and the last movie of a golden age that will never return. After this movie, the series will delve into many lead actor changes, and questionable style problems. Bond will not stabilise again until 1977 with Moore's Spy Who Loved Me, a whole 10 years later.It will have some good, and less good movies, but even the best of these movies will not equal the ones from the Golden Age. I can watch Moonraker or Licence to Kill and enjoy them to a point, I can watch You Only Live Twice and enjoy it more.Whether it's for history, as a last dance before the fall, or it is for its own quality, You Only Live Twice is a thoroughly enjoyable piece of Bond silliness and plain enjoyment that deserves to be seen."
    },
    {
      "rating": "10",
      "text": "The fifth movie in the franchise and it is one of my favorite Sean Connery James Bond movies. After a NASA spacecraft is hijacked the USA are suspecting the Soviets as culprits and a mayor conflict is on the horizon. James Bond is tasked with an investigation in Japan as the MI6 had a clue pointing in this direction. Japan as setting is very nice especially for fans of Japanese culture like me (Yes this is also a bias warning). The scenery is amazing as they filmed in Ginza (A district of Tokyo with lots of stores, restaurants and boutiques but also really expensive), used Himeji Castle and the Shinto Shrine in Nachi. As someone who visited Japan I must say it is a beautiful country full of nice people with great sights and so much great food (Less weird than expected however, even Tokyo;-). But back to the movie. The story is immersive from the beginning to the end. You know that failing will lead to a disaster on a scale never seen before. I like the concepts and idea as they make a lot of the setting and have an epic climax. Then there are the actors. Sean Connery has nailed his role a few movies ago and delivers the James Bond we know and cherish. I enjoyed Tiger Tanaka as head of the Japanese secret service. He is skilled, a clever schemer, capable and a man of many talents. I don't know if the praise magnificent bastard for a badass you admire is an insult in some countries or else I would use this description. His special forces are remarkable effective (Bonus point for those who figure out what people in Japan used as elite spies since centuries were called;-). Lets say that females are not well represented in James Bond movies in that time (Especially the names) but this does not mean that Aikko Wakabayashi and Mie Hama do not deliver a really good performance. Again Q becomes my favorite reoccurring character (I like also the banter with Miss Moneypenny and M). This time we got new cool gadgets (Not all are from Q) like an interesting cigarette, a remarkable cracking machine and “Little Nellie”. The “Little Nellie” really exist minus some upgrades in real live. For the soundtrack we have Nancy Sinatra who did a good performance. Overall this is an excellent movie in the franchise. Not as good as Goldfinger but good enough to get a 10/10 rating. It succeed enough for me to justify this rating."
    },
    {
      "rating": "8",
      "text": "After I heard of Sean Connery's death, I watched this movie. I really enjoyed it. I liked Japan in the 1960s. Tokyo was very different from today. I love the villages in Japan. James Bond became a hilarious Japanese. He spoke Japanese very well. Good job!"
    },
    {
      "rating": "8",
      "text": "When world peace hangs in the balance, who else but James Bond to come to the rescue? This chapter may not have the strengths of the previous ones, what is certain is that the intrigue, the action and the exotic settings make the ritual of preparing popcorn not a waste."
    },
    {
      "rating": "3",
      "text": "Gilbert is not the guy to be invited in such a party, just focus on Connery and who knows you might end up having a good time.You Only Live TwiceGilbert is a guest. He is new to it. But that isn't an excuse. It shouldn't be. He has a rough idea on what or how should Bond be, and it is not only wrong but also is commercially motivated. And yes, there is also the script to be blamed, but also Lewis Gilbert, the director, whose agenda apparently is to go for a kiss or a punch or an explosion whenever you feel the viewers getting disenchanted from the screen. What could have been a gripping gritty adventure of half an hour is stretched to an entire two hours of labor that we, as an audience are told to work upon.They are definitely pushing it, especially if the actual plot starts after the clock ticks to a forty five minute of bell, after which too, they dare to take detours. Shorter than the previous chapter, it still feels like a much longer one. I would presume that time has not been nice to it, but it has lost the flamboyant nature in its narration that made its predecessor what it is now. The antagonist that is kept behind the curtains, lacks a face to be feared upon and is why for the huge chunk of the film, you feel like Sean Connery is shooting in the dark and not in a good way.Also, there is no empathy in the characters for us to connect with them. The rituals and traditions that our sung hero follows and adapts while visiting new places and people is also left blank in here; it's like they are not even trying to be better, somehow they have found peace in the everworking formulaic structure. But that didn't make its book famous, You Only Live Twice and you only film once, so let's make it count."
    },
    {
      "rating": "7",
      "text": "Directed by Lewis Gilbert, produced by Harry Saltzman and Albert Broccoli and with a screenplay by Roald Dahl, this is the fifth 007 franchise film, who reached, after \"Thunderball\", a huge peak of popularity. As in previous films, this movie adapts the characters created by Ian Fleming to an issue or problem of the current time, in this case the space conquest, held by US and Soviet Union, and the danger of Cold War, skillfully exploited in the film.In this film, the English agent is in charge of investigating the disappearance of an American spacecraft, apparently abducted by another vessel that re-entered the Earth's atmosphere over the Sea of ​​Japan. In the country of the rising sun, it will collaborate with local intelligence to investigate a chemical industry, concluding that is linked to SPECTRE, an association that he already knows very well. However, disappears another spacecraft, this time belonging to the Soviets, which increases the tension between the two countries. In order to investigate under-covered, Bond will need to take on a second life and identity, infiltrating among the people to discover the enemy base and fulfill his mission.The film has the usual Bond recipe: exotic locations, beautiful women, lots of action and strange and expensive machines. One of the most famous is Little Nelly, a small collapsible helicopter, armed with several gadget's whose Bond uses against his enemies. One of the most popular and iconic scenes is the apparent death and maritime funeral of Bond, an act of MI6 to give more freedom of action to their agent, whose body is quickly rescued by a submarine. Other notable scene are the abduction of each space vessel (US and Russia), swallowed by the larger SPECTRE's ship. In this film, for the first time, we see the face behind this powerful criminal organization: Ernest Stavro Blofeld, with his famous white cat. This film is also the first where James Bond gets married, although the marriage was part of his disguise. The agent, one of the most famous womanizer's in cinema, will only marry again (this time for real) in \"On Her Majesty's Secret Service\".This film has inherited from the previous its central cast, who plays not only Bond but the characters M, Q, and Monneypenny. To the actors who embodied these characters will join Akiko Wakabayashi (in the role of Bond-girl Aki) and Mie Hama (in the role of another bond-girl, Kissy, with which Bond marries); Donald Pleasence incarnated Blofeld, the villain and Tetsuro Tamba played the chief of the Japanese espionage, Tanaka."
    },
    {
      "rating": "7",
      "text": "You Only Live Twice is a great James Bond movie. The movie's got a pretty interesting story, which is about an American space capsule which has been swallowed by a Russian spaceship.After this happens, James Bond discovers SPECTRE is behind the theft and he wants to find out the motive behind it.The movie's got some great acting from all of the cast especially from James Bond (Sean Connery).The pacing throughout this movie is pretty good and most of the scenes are built up pretty well.Also, the action sequences throughout this movie are very clever and very explosive but they're pretty cool.The villain who's called Ernst Stavro Blofeld (Donald Pleasence) does a brilliant job playing the role of the main villain who's in the movie.Finally, the greenscreen effects have dated a bit, you can tell what's real and what's not. You can tell that the greenscreen backgrounds during the car scenes aren't real.The movie's got a few stupid scenes scattered throughout but they're pretty funny though.The movie's got some very funny moments throughout, which work very well in making me laugh.Overall, You Only Live Twice is a great James Bond movie. The movie's got an interesting story, great acting, pretty good pacing, very clever action sequences, a brilliant villain and quite a few funny moments."
    },
    {
      "rating": "10",
      "text": "A fun movie in the series. Sure it’s turning Japanese plot point has aged terribly but it’s only for about 15-20 of the movie. The rest is really fun and a major improvement over the dull Thunderball."
    },
    {
      "rating": "6",
      "text": "ames Bond (Sean Connery) is sent to Japan to team up with their Secret Service to help stop SPECTRE’s Blofeld from starting a third world war by setting America and Russia against each by kidnapping their space crafts."
    },
    {
      "rating": "5",
      "text": "And the first \"bad\" Bond film is here. You Only Live Twice fails in many different ways, it suffers from plot holes and plot conveniences"
    },
    {
      "rating": "7",
      "text": "After the great Thunderball came You Only Live Twice, which wasn't so great anymore, but it was still good. Location not as good as in the previous film, but bad. But the ending is successful and overall it is a good film for me, which I can recommend."
    },
    {
      "rating": "8",
      "text": "After re watching it the other day, YOLT has gone from \"alright\" to one of the better entries in the series for me. I think it's an improvement over Thunderball actually. The cinematography in Japan is absolutely gorgeous, and (Spoiler Alert) the finale in the volcano lair is so well done, easily one of the best set pieces in the series. Pleasence as Blofeld is also very good in this film. While Connery does look very bored, it's an overall good film."
    },
    {
      "rating": "7",
      "text": "Bolstered by its iconic villain, You Only Live Twice is a satisfying finale to Connery's initial run as the British superspy."
    },
    {
      "rating": "9",
      "text": "It is the classic Bond movie. the race to space. A third world war is imminent. a young lady named Kissy Suzuki. Bond battling with ninjas. Sean Connery is at ease in the part and hasn't grown weary of it yet. And at the centre of it all, in a lair hewn from a volcano, is the ultimate Blofeld. This is the material for parodies, and it's done very well here."
    },
    {
      "rating": "2",
      "text": "You can clearly see that Sean Connery had lost most of his passion for playing James Bond here, and the whole movie suffers as a result."
    }
  ]
}