{
  "id": 583,
  "title": "Your Name.",
  "starring": [
    "Ryunosuke Kamiki",
    "Mone Kamishiraishi"
  ],
  "runtime": 106,
  "genre": [
    "Romance",
    "Animation",
    "Drama"
  ],
  "description": "High schoolers Mitsuha and Taki are complete strangers living separate lives. But one night, they suddenly switch places. Mitsuha wakes up in Taki’s body, and he in hers. This bizarre occurrence continues to happen randomly, and the two must adjust their lives around each other.",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/q719jXXEzOoYaps6babgKnONONX.jpg",
  "categories": {
    "plot": 9.522727272727273,
    "acting": 9.736842105263158,
    "ending": 9.307692307692308,
    "soundtrack": 9.666666666666666,
    "cinematography": 9.0,
    "familyFriendly": 8.0,
    "funny": 9.625,
    "action": 9.75
  },
  "reviews": [
    {
      "rating": "10",
      "text": "For the first few minutes I did wonder if this was just going to be a typical comedic gender swap Anime, fortunately Your Name is much more than that and builds to be something memorable. The animation is so beautiful and detailed, the score is wonderful and once the story really kicks in the script subtly shifts in tone from comedy/drama to melancholy. There's some obvious parallels at work here, male/female city/country but they are handled subtly and mostly tend to avoid predictability. Ultimately you'd have to have a heart of stone not to be moved by this."
    },
    {
      "rating": "10",
      "text": "Thank you, Makoto. Absolutely stunning and beautiful. The story grabs my heart like nothing else and left an impact on me for months now. No other anime film even came close to this one story-wise and tempo-wise. A must see, me myself don't mind going to theatre and watch it 5 times."
    },
    {
      "rating": "10",
      "text": "I'm not an anime movie fan, but I saw this movie because in YouTube there were a lot of reviews about it, so I gave it a try. When I started watching it looked like a typical gender swap thing, but then it started to hit me so hard so many times, made my eyes teared multiple times (lost control at the ending). I couldn't believe it, felt embarrassed because of it. Overall this is a beautiful movie, give it a try, you won't ever forget the beauty of this film."
    },
    {
      "rating": "10",
      "text": "A truly special movie that has the power to show everyone how powerful and inspiring an animated movie can be. This deserves an academy award. Go watch it, fellas. You'll not regret it."
    },
    {
      "rating": "10",
      "text": "i am someone who have been watching anime for years and is a huge fan,and i picked this movie not knowing anything about it,and i just finished it and have to say that this movie is,by far,the BEST anime movie i EVER saw. its art sets a new meaning to the word \"Gorgeous\",its story is truly incredible with many twists and turns that i honestly didnt see coming and was shocked,yet it all fits together and is a joy to watch. the (Japanese) voice acting is superb too. my only nitpick,and it is a small nitpick,is how the girl convinced her friends to help her(i wont explain so i wont spoil it),but even that has logical explanations if you think about it. i am astonished,and would recommend this movie to anyone who like great stories and gorgeous art,weather he is an anime fan or not. try it. you most certainly wont be disappointed :)"
    },
    {
      "rating": "10",
      "text": "Related media: This Japanese anime film is based on the manga of the same name, but I haven’t read it. >What's it like?: A comet passes over Japan and the lives of two people are inexplicably linked while a disaster impends. It is like a cross of two film tropes, the first being body-swapping between two people, seen in films such as Freaky Friday and Like Father Like Son, while the second trope is a spoiler. ### Move to the next paragraph now to skip this spoiler. ### The second trope is seen in a Korean film called Il Mare and its American remake called Lake House.>Pros:>1. The concept of the film is rather complex as it merges Japanese culture and its beliefs with the tropes of body-swapping and one other sci-fi trope that is a spoiler. As a result, it is a film that requires a bit of attention. However, the reward at the end is well worth it. If you are into those three elements, then you’ll love this film. However, see Cons #1.>2. I saw the American animated film, Sing, a day after watching this. The gulf in the complexity of the artwork is immense. For example, for a tree, you will see the outlines of the tree, the branches and the trunk in Sing, while the same tree in Your Name has individual leaves. Imagine the effort required to hand draw these. Imagine the effort required to animate them when there is wind! Everything is so beautifully drawn!>3. The use of the second trope in the middle of the film elevates this film from an average-good film to a good-excellent film.>4. Comedic elements covering childhood fantasies, high school angst and dating difficulties were used throughout the film to make this a partial comedy. They are very well done and they break the language barrier for the international audience.>Cons: >1. The complexity of this film makes it harder for younger children or older adults to understand it fully.2. The major problem close to end of the film was solved with a dues ex machina that was not properly explained. It need not be that way.>How would the different age groups rate it?Children: GoodTeenagers: ExcellentYoung adults: ExcellentMedium age adults: ExcellentOld adults: Good.My rating: 5/5 (no half scores). It's worth it to watch it in the cinemas and then buy the DVDs."
    },
    {
      "rating": "10",
      "text": "A must see for anime fans worldwide that is all you need to know.  The only sad part is the limited theater release, so most will have to wait for blu-ray."
    },
    {
      "rating": "10",
      "text": "I can't believe it's been like months since i was here. Well looks like I have ALOT of catching up to do. I'll start with this. I watched this movie back in mid November. I watch anime series more than anime movies and this one was one of the anime films i have watched. This was a very beautiful film to watch and while it wasn't as good as other anime movies like Sprited Away or Grave of the Fireflies, it still kept my eyes glued to the screen til the end.  The visuals were so great to look at. In fact, these were the best part of this film. The characters were likable. The voice actors did a very good job potraying their characters. The story was amazing, there are some parts that are sad. I won't spoil it or anything but let's just say, it'll make your heart drop."
    },
    {
      "rating": "10",
      "text": "This Movie is the BEST ONE of SHINKAI MAKOTO. His solution of so-called 'Shinkai's World' is 《YOUR NAME》. I watched all of his movie, but this movie is most perfect one in his series. Then, I want to say 'I'm so sorry' to the director. I didn't have the slightest inkling that he is SUCH director."
    },
    {
      "rating": "10",
      "text": "I loved the movie. The two main characters are relate-able aswell. The plot is complex and can be a bit confusing at time. However I think that's one of the best part of it.However, I do think the key point of this movie is to play with your emotions which it did pretty well to me.I really recoment watching it."
    },
    {
      "rating": "10",
      "text": "Your Name was one of the films that I saw at the 2016 London Film Festival and it was the highlight of the festival for me.  I absolutely adored this film.  Director Makoto Shinkai gives us an excellent movie, that you can probably nit-pick, but I felt the raw power and emotion in this film and you can tell that Shinkai has done a loving job crafting this film.  Many people have put a lot of emphasis on the body swapping element of the film, which is very well done, but I think it also has the effect of cheapening the rest of the film which is also done brilliantly,  It’s a story of love, regret, and overcoming disaster and adversity and finding the solution when it seems impossible.  It’s one brilliant film and if it doesn’t get a nomination for Best Animated Feature at the Oscars, I will be extremely annoyed.  I’m really looking forward to whatever Makoto Shinkai brings out next since this beautiful animated film is easily his best work to date. Oh and the soundtrack released by the band The Radwimps is fantastic. It’s not currently available, but it will be soon.  Please, please try to see this film, even if you’re not into anime, because I think it will surprise you"
    },
    {
      "rating": "9",
      "text": "A bit of a slow beginning however every second of the movie maters. While it may seem clichéd at some points the entirety of this movie is pure gold. something that is super rare to come out of the anime industry at this point in time."
    },
    {
      "rating": "9",
      "text": "Heartfelt and funny. Beautifully animated. The lighting in particular was exquisite. Hollywood should take note for it's live action movies for it's pacing and those quite moments which make it just as memorable as it's fantastic story."
    },
    {
      "rating": "8",
      "text": "This was beautiful, and romantically satisfying. Though I can't help but feel that the \"evacuate the town\" plot was somehow contrived, I didn't quite believe that it could happen, I was willing to go along to see everyone saved."
    },
    {
      "rating": "10",
      "text": "(Kimi No Na Wa) tells the story of two teenagers with vastly different backgrounds. One is a boy who lived in Tokyo and has the word \"city\" described all around him. One is a girl who lived in rural town far from technology and anything interesting. One morning, somehow, they found out that they have swapped bodies. Together, they must help each other find solution in daily life problems, and solve the mystery of the reason why this whole conundrum started.This may sound like your typical body-swap romantic comedy situation, but you may find yourself on the wrong side of the spectrum as this movie takes you into an incredible journey. With a storytelling so divine, complex, yet understandable, this movie captures the essence of what romantic comedy movies have lost nowadays, a heart and a charm to lure you in.Japanese animation movies tend to have a bit of a stereotype, but the movie successfully shown very little of that. Transitioning from one scene to the other effortlessly, Radwimps deserves an incredible applause for their talents in the movie, as every song and every score fits perfectly to the scene currently shown.Although the movie does end in a predictable way, the voyage to that predictable end is more than enough to keep you satisfied. There are some usage of stock characters and several clichés throughout, something that maybe will drive some of the audiences away or cloud their judgment. But beside all that, the story is still original and well executed.What seems to be a silly premise evolved into something even more trifling. But with its unbearable charm, it worked astonishingly well."
    },
    {
      "rating": "10",
      "text": "Your Name is a lively combination of romance, identity, and culture. I went into the film with a very little understanding of the plot’s complexities. From the trailer, I assumed Your Name would be an anime Freaky Friday love story. The framework of the narrative certainly fits into my initial assumption. Yet, there is a multitude of undercurrents in the film which make Your Name stand out. For starters, Your Name constantly changes themes and mood. Often, I found myself laughing and, a few minutes later, would suddenly be on the verge of tears. The movie’s eclectic flow makes for a constantly engaging experience. The Freaky Friday element is roughly half of the film’s two-hour runtime. In fact, a plot twist in the film literally took my breath away. Your Name is the rare film which combines overwhelming variety and makes everything fit organically. Through variety, the anime earns a conventional ending between protagonists, Mitsuha and Taki. While body switching is the plot's main intrigue, the film adds complexity through its exploration of Japanese culture. Japanese gender identity is explored with such a masterful hand. In subtle strokes, the viewer understands the sheer contrast in the lives of Japanese men and women. For example, a group of men have a crush on a female co-worker; Mitsuha, in Taki’s body, simply initiates conversation with the desired woman and, with ease, sets up a date. When Taki is back to normal the next day, his male coworkers all line up disgusted by his act of group betrayal. The scene effectively demonstrates the strength of the herd like quality of gender in Japan. It’s no surprise then when Taki, in Mitsuha’s body, finds such humorous wonder in the breasts he suddenly gains. A contrast can also be noticed in the struggle between the past and present. The present is Taki’s experience of Tokyo. Likewise, the past is illustrated by Mitsuha’s familial duty to her small town’s local shrine. In other words, the film merges Japanese spirituality with modern sensibilities. A desire to escape and return to the country define the film’s ecliptic take on Japan. Mitsusha is your typical country girl with a thirst for a life in the city. Meanwhile, Taki finds beauty in Mitsuha’s country town. The viewer amusingly experiences each setting (Tokyo and Itomori) through the unique lens of the protagonists. Ultimately, a comet and local god guide the distant figures into a surprising collision course. As a result, fate is sealed by the two somewhat metaphysically dissimilar sources. The forces of science and divinity augment Your Name into making the seemingly fated connection all the more plausible. The film is a testament of the “opposites attract” sentiment. In summary, the film has a real beating heart. I will end my review saying Your Name is the best looking animated film I have ever seen. The colors are always pleasingly vibrant. Additionally, all of the scenes are lovingly rendered and pulsating with life. I haven’t walked out of a theatre with such a positive perspective on life in a long time. If you live in a city, you ought to take the time to experience this anime masterpiece."
    },
    {
      "rating": "9",
      "text": "wow, what a journey, i like anime, all kinds, but not necessary all themes, on the \"dont care at all\" category are the romance ones, so sitting through the first part of the movie i was thinking ... \"hu oh\" with something that looked like a very simple and obvious plot i could not grasp why was considered a must see movie... then the real story start unraveling and oh lord i was for a treat. the character themselves, without been anything special, fit perfectly the movie and the story, music and visuals are gorgeous, but this movie is all about the story itself and how it is told, that is definitely the standout that makes this movie different, and different in a very good way.There is something for everyone in this movie, even i that tend to stay away from everything that is \"love couple\" centrist found enough here to consider it a must watch."
    },
    {
      "rating": "10",
      "text": "Incredible! One of the best movies I've ever seen. The movie has fantastic animation, and the characters are so captivating and the story is out of this world. The movie tugs on your heartstrings and chooses great moments for you to laugh and to cry. It is an emotional roller coaster and fantastic music to go along with it. A must watch for any  movie fan."
    },
    {
      "rating": "10",
      "text": "I finished watching this film literally 10 minutes ago, and it is the first film I ever reviewed on metacritic. I'm sobbing. Literally sobbing. The last time I cried like this was when my grandfather died. 10/10."
    },
    {
      "rating": "10",
      "text": "Best anime film for me so far.Great storyline and yet the pace of this film are quite fast. Some of the part relating with eastern culture could be complicated and maybe difficult to understand for western audience.But if you love this film, you definitely will wish to watch more than 1 time to understand further.However, i'm strongly recommended who interesting with this film but not yet watched, try your best to avoid spoiler, this film can still be enjoyable for who already know the whole story. But the feel of knowing the whole or know nothing when watching this film has a huge different."
    },
    {
      "rating": "7",
      "text": "8/10\"Your name\" is a visually remarkable tale of boy and girl relationship under influence of the comet however it sometimes feel like overstuffed and too fast, it is emotionally paid off."
    },
    {
      "rating": "8",
      "text": "They're no strangers, yet they've never met.Probably the most anticipated anime since the final film of Mr. Miyazaki. Because people know what these guys are capable of. This is one per cent sci-fi and 99 per cent fantasy. The concept is not new for us. From 'Freaky Friday' to 'The Lake House', even the recent American television film 'The Swap', you will remember a handful of names once you read this film's synopsis. Yet the film was so good, because of how well the theme was utilised.We all know the technical brilliance of '5 Centimeters Per Second' and the beautiful romance from 'The Garden of Words'. This is an excellent mix of those two. If love either of them, or both, then you will love it as well. But if you ask me, my favourite is still 'The Garden of Words' from this director. I liked this film, enjoyed thoroughly, so liking it less than that means not a bad flick. Surely a film to recommend for anime fans, as well as for animation's (western audience).The story of two teenagers, one from the rural Japan mountain region and the other one from Tokyo. The plot revolves around a comet that is to pass by very close to the earth. But before that event, the girl is bored with her life, so she dreams of living in a big city and that too as a boy. One day her wish comes true when she wakes up as she swapped bodies, including most of the memories with a boy from Tokyo.For her, it is to live as she wanted and make use of the opportunity. But for him, it is like a curse, hence becomes rebellious. This thing keeps happening frequently for days and weeks. After some times, realising the phenomena is between two, they make a deal and strict order of Dos and Don'ts while away. All this until the day of comet and everything changes forever. Searching for the truth and the result of it leads to the end of the tale.❝Treasure the experience. Dreams fade away after you wake up.❞Unlike Miyazaki, Makot Shinkai's storytelling is quite for the matured audience. It targets adults more than the children. Particularly for not shying away to include naturally occurring events in such situation as the story develops, despite/even though the film revolves around the teens/kids. As for this flick, the concern is not big, but it depends on the nation and its culture you belong to. It is very much acceptable and as the story progress, the best things keep replacing another till the finale. So hooked to it is assured.The film length was good and so the pace of the narration. Well written screenplay, which was based on the book of the same name. But the director admits the inspiration from the previous flicks with similar themes. They have used the real places of the anime version with fictional names, but most of the Tokyo remains same and they all were awesome.In many scenes, the camera panning was a treat. Especially the framerate was high, so no jerks, hence very pleasurable visual experience. Like I mentioned earlier, this is a unique film, despite not a original idea. The film proved the Japan is not overshadowed by Hollywood, particularly after the decline of animes in the recent years. It's up to the quality of the product, if so, then those glory days can be brought back for animes. Anyway, now this film holds the record for highest grossed anime.Apart from technical dominance, the story is also enchanting. If you like romance theme, this will serve you well. A good film for date night. But usually people would skip animation for such occasion and one should not mix up that with anime. Because why I always put apart the anime and animation is, the animes are good at beautiful romance, while its counterpart from the west focus more on comedy and adventure. But the common thing from them is the well explored fantasy theme.Usually the ends are guessable for a film like this and the same case for this in here. Only as a result of the story, you would know what's coming, but not the frame by frame scenes of it. Yeah, I liked this conclusion, the final lines said might bring you tears in your eyes, romantically, if you are an emotional person. One of the best endings, even though it was clichéd. And the credits start to roll up, while you begin to recall everything you just saw in the last 100 minutes. A must see film, so highly recommended by my side. Now I've to wait for another couple of years for such film.8/10"
    },
    {
      "rating": "10",
      "text": "Just plain beautiful, such an amazing surprise the first time you see it, highly recommended."
    },
    {
      "rating": "10",
      "text": "Fascinating. Stunning. Magnificent. Beautiful. Sublime. Wonderful. Astounding. Splendid. Breathtaking. Remarkable. Spectacular. Astonishing. Marvelous."
    },
    {
      "rating": "10",
      "text": "Never watch anime. Watched this as a meme, came out very surprised with the amazing artwork seen in the movie. The story, although generic, kept me on my toes trying to decipher what in the world was going on."
    },
    {
      "rating": "10",
      "text": "Simply amazing, the film work was amazing. No spoilers, but the scene on the lip of the crater is maybe my favorite scene in a movie ever."
    },
    {
      "rating": "10",
      "text": "Unforgettable, wonderfully animated and surprisingly thrilling, Your Name's breathtaking essence easily proves that Makoto Shinkai's great filmography gets even better every time."
    },
    {
      "rating": "9",
      "text": "I felt obligated to write a review for this film after just seeing it, I am literally sobbing as I'm writing this review. Possibly the best anime-anything that I have watched, the visuals and animation are incredible, the music is phenomenal, the voice acting (dubbed version) is excellent and the story both familiar yet unique at the same time. Will be recommending this to everyone I know."
    },
    {
      "rating": "9",
      "text": "The well- known history of switching personalities is resolved in original way, beyond of common comedy, with a correct touch of humor so as to surprise and charm the viewer, not to dissapoint. One of best of Non- Ghibli anime."
    },
    {
      "rating": "10",
      "text": "A very good movie by Makoto Shinkai. He keeps getting better. 5cm per second was good but a bit too melodramatic, here he manages to finds the perfect mix between drama, nostalgia, sadness, love to deliver a truly wonderful story. The script and the directing are clever and entertaining, never falling in the typical clichees of Japanese Anime or youth movies, except in one moment, at the very beginning, which looks like an opening of an anime series"
    },
    {
      "rating": "10",
      "text": "One of the most creative, beautiful and touching tributes to the anime universe. It is absolutely adorable and moving and it certainly deserves worldwide attention."
    },
    {
      "rating": "8",
      "text": "J'ai vu 5 Centimeters Per Second de Makoto ShinkaiLe buzz de Your Name, son dernier film sorti en 2016 et l'effet médiatique qu'il a généré en France m'a porté à m'intéresser à ce réalisateur. Le \"nouveau Miyazaki\" sortit de nulle part alors que les animes sont en général peu médiatisés et réservé à un public de niche, devait être probablement incroyable pour prétendre à sa succession et débouler de la sorte en France. Your Name était magnifique mais pas dénué d'erreurs. J'ai donc vu son deuxième meilleur film 5 Centimeters Per Second qui n'est même pas référencé sur Metacritic (pour le nouveau Miyazaki c'est quand même un comble...). Ce film, scindé en 3 actes, raconte l'histoire d'un garçon, Tataki, pendant trois périodes de sa jeunesse. Au début, il lie une amitié très forte avec une fille Akari avec qui il entretiendra une relation épistolaire très entretenue. Le développement du film raconte alors leur éloignement progressif pour toutes les raisons de la vie pour finir sur une downer-ending. Pour un anime, je me dois de parler de la forme en premier puis nous aborderons le fond. L'animation est magnifique. Celle de Your Name était bluffante et probablement une des meilleures mais on sent déjà cette patte dans 5 Centimeters Per Second pourtant sorti en 2007. C'est une animation généreuse avec beaucoup de plans larges très contemplatifs où on peut perdre nos pensées dans les campagnes et les paysages urbains japonais. Les dessins ne sont pas particulièrement détaillés ou complexes mais sont foisonnant et riches. Petit point négatif pour les personnages qui étaient quand même parfois étrangement dessinés. Globalement on sent vraiment la volonté du réalisateur de montrer le Japon dans tous ses états. Ces deux films presque \"carte postale\" montrent le territoire nippon de jour, de nuit, au crépuscule, à la ville, à la campagne, à toutes les saisons etc. D'ailleurs les personnages sont relativement peu à l'écran et cela nous donne la sensation que nous regardons nous même ces paysages. Les personnages ne sont en réalité pas très importants dans le film. Une pensée pour la musique tout aussi magnifique et composée pour le film. Les dessins et le montage se synchronisent à la musique et cela donne au film une sincérité bienveillante qui donne envie de plonger dedans. Your Name continuera dans cette lignée. A présent parlons du fond. Je n'ai pas aimé 5 Centimeters per Second.Le premier chapitre est étonnamment le plus réussi et le plus beau. Les deux suivants ne sont que des prolongements bancales et mal venus qui sont relativement ennuyeux. Je ne comprends vraiment pas comment ce film reçu de si bonnes critiques (peut-être l'animation a bluffé tout le monde). Un film normalement constitué crée de la tension et de l'attachement aux personnages et à son univers pour que nous nous sentions impliqués dans l'histoire et les péripéties. Le dénouement sera le moment où le spectateur sera le plus impliqué. Ici, paradoxalement, je fus charmé pendant la première partie, la deuxième m'ennuya et la dernière était tout simplement mauvaise. J'ai  beaucoup aimé l'introduction et je fus particulièrement impressionné par la vitesse à laquelle le film arrive à nous faire comprendre les enjeux et la situation des personnages. Cette relation épistolaire complexe se déroule parfaitement devant nous si bien qu'au bout de 15 minutes, quand les personnages vont se rencontrer, nous sommes aspirés et séduis par ce petit couple que l'on à l'impression d'avoir vu grandir. Les deux autres parties manquent d'enjeux et d'intérêt. Je n'ai toujours pas compris la véritable raison de leur existence. Je comprends que le réalisateur voulait nous décrire l'éloignement et comment la vie sépare deux humains qui avaient créé entre eux quelque chose de magnifique. Mais la manière dont il a essayé de nous faire ressentir cela est juste mauvaise et fade. Je suis particulièrement sensible aux belles histoires d'amour et d'amitié que ce soit dans les jeux vidéo ou au cinéma et j'ai rarement senti qu'une oeuvre était \"tire-larme\". Mais ici, les deux dernières parties (surtout la troisième) étaient clairement dans ce registre. Je garderai chaudement le souvenir de cette première partie qui est définitivement une petite capsule poétique et douce où le spectateur devient le témoin invisible d'un amour impossible entre deux enfants japonais avec la vie et ses obstacles devant eux. Vous ai-je dit qu'il y avait une lune géante dans le film ? Elle ne sert à rien.Ma note pour 5 Centimeters Per second : 5/10"
    },
    {
      "rating": "10",
      "text": "Your Name is one of the most beautifully animated films that I have ever seen. Not only does the film manage to out do western animation by miles, but it also manages to have an amazing story with characters who are easy to release to with both characteristics and emotions. The animation is wonderful, and looks for better than most of the generic looking CGI that Disney and Dreamworks use to death. It also doesn't force political beliefs and any forced usage of \"progressive characters of colour\" that most animated films are pushing these days. It's the simple lives of the characters in this world that are relatable unlike SJW disasters like Moana who push a perfect little princess character that nobody can relate with.Simply put it, the film is great. Quit watching western animated films and watch anime films instead."
    },
    {
      "rating": "10",
      "text": "magical. an anime has never let let me feeling like this in a long time. The last time was spirited away. I can't decide between this and spirited away.I went watching the movie without knowing anything about it expect that i was hyped. I was not disappointed."
    },
    {
      "rating": "10",
      "text": "esta película es una preciosidad, es fantástica, el doblaje es excelente, la verdad la he disfrutado un montón y la he visto dos veces, la primera en español y la segunda en japones, sin duda alguna la mejor película de anime que he visto."
    },
    {
      "rating": "10",
      "text": "Perhaps one of the finest movie. The last scene of the movie is something that makes you feel joyous. Even if one is not an \"anime lover\" then also one must watch it."
    },
    {
      "rating": "10",
      "text": "My all time favorite animated movie, and one the best anime ever created; Your Name or Kimi no Na wa is simply a must watch for anyone who enjoys animation, and if you don't enjoy animation, watch it anyways."
    },
    {
      "rating": "10",
      "text": "This beautiful film is filled with stunning art and animation, with a fantastically emotive plot capable of inducing complete elation. A complete masterpiece."
    },
    {
      "rating": "10",
      "text": "This movie is insuperable !! It plays with two fantasy layers: the first one is the swap of identities and it seems so incredible the very first minutes of the film, but shortly after it seems normal.. so normal that this normality is broken by the second fantasy layer: the time shift. This movie is touching , because the feeling of love is anxiously valued and so vivid ! I recommend this little little pearl with all my heart"
    },
    {
      "rating": "10",
      "text": "You fricking did it again Makoto. you made me like a movie that you put out. To be far this movie is flawed to all hell but it was a perfect movie for the uter **** 2016 was"
    },
    {
      "rating": "10",
      "text": "this movie is truly special no other film has managed to draw me in and hold me fast to the story in such a way as this. by the end of the film it took a few minutes to snap back to the real world even now after watching it i do not quite think i am fully back here in this world the film sucks you in and throws you into the world of these two characters and by the time it is done you have trouble leaving it behind the memory of this film will never leave me it is truly a one of a kind film deserving of as many accolades as can be bestowed unto it i only hope this film shows the world just what japanese animation can really be not just epic fight scenes like that of naruto or dragon ball z but a truly heart felt experience that reaches to the very core of your humanity and pulls your very sole into the film"
    },
    {
      "rating": "10",
      "text": "Some of the best animation ever, an amazing soundtrack and a carefully crafted story filled with amazing characters make this movie one of the best animated movies ever. A masterpiece."
    },
    {
      "rating": "10",
      "text": "Fantastically fantastical with a great plot and story-telling, breath-taking graphics and realistic scenes! I love the whole movie"
    },
    {
      "rating": "9",
      "text": "Your name. It is definitely the masterpiece of Makoto Shinkai. A great story, impeccable animation and a devastating ending to my heart and my feelings."
    },
    {
      "rating": "7",
      "text": "(Saga Das Músicas Blog) Dentro do que é proposto e descrito no filme, conseguimos entender qual é a mensagem a ser passada, mas ainda sim não é explicado se Mitsuha e Taki trocam e corpo ao mesmo tempo, ou o que está causando tais fenômenos. Além disso, nada explica a perda de memória deles, que está diretamente atrelada ao título da obra. Ainda sim é uma ótima opção para quem procura uma história mais original e romantica ao mesmo tempo."
    },
    {
      "rating": "10",
      "text": "The movie has really good animation and the concept used is something everyone has wondered about at some point in their life but not many films have been made on it. This movie has combined science fiction and romance in a very beautiful way. You are going to love this movie if you are an anime fan. If you are not an anime fan, you are going to like it anyway."
    },
    {
      "rating": "10",
      "text": "A Really beautiful movie, that touches the heart, the finesse and details in the visuals show the love that went into this movie."
    },
    {
      "rating": "9",
      "text": "Incredibly beautiful and emotional film. After him, Makoto Sinkay's can be called the Miyazaki receiver, this film is ideal for family viewing, like \"Spirited Away\" or \"My neighbor Totoro\"."
    },
    {
      "rating": "10",
      "text": "Your Name is absolutely breathtaking. In the first hour of the film I was thinking in the gorgeous animation and the good music but the plot wasn't anything special. However, when something happens the film completely earn my attention and i was absorbed by the film. It's amazing how well the director tell his story and describe the characters, you totally empathize with them. In conclusion, one of the most beautiful movies i have ever seen"
    },
    {
      "rating": "10",
      "text": "I went into this film with sky high expectations due to the masive hype and some people claiming it even surpassed Spirited Away, and seeing Makoto Shinkai as the director, as The Garden Of Words was so amazing.However all my expectations were surpassed. Your name is easily a modern classic among films generally, not just in the anime genre. Easy 10/10."
    }
  ],
  "recommendations": [
    "soul",
    "kubo_and_the_two_strings",
    "paprika",
    "luca",
    "up",
    "the_little_prince",
    "the_book_of_life",
    "ratatouille",
    "the_incredibles",
    "klaus",
    "wolfwalkers",
    "the_bfg",
    "song_of_the_sea",
    "how_to_train_your_dragon_2",
    "cloud_atlas",
    "onward",
    "spirit_stallion_of_the_cimarron",
    "hugo",
    "the_polar_express",
    "the_fountain",
    "zootopia",
    "the_13th_warrior",
    "beowulf",
    "atlantis_the_lost_empire",
    "brave"
  ]
}