{
  "id": 4826,
  "title": "Youth",
  "starring": [
    "Michael Caine",
    "Harvey Keitel"
  ],
  "runtime": 125,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "Two lifelong friends bond whilst vacationing in a luxury Swiss Alps lodge as they ponder retirement. While Fred has no plans to resume his musical career despite the urging of his loving daughter Lena, Mick is intent on finishing the screenplay for what may be his last important film for his muse Brenda. And where will inspiration lead their younger friend Jimmy, an actor grasping to make sense of his next performance?",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qBGK5jXqNodUS6k6uii79lcIPba.jpg",
  "categories": {
    "plot": 6.454545454545454,
    "acting": 5.814814814814815,
    "ending": 6.571428571428571,
    "soundtrack": 5.75,
    "cinematography": 7.25,
    "familyFriendly": 3.0,
    "funny": 6.0,
    "action": 9.0
  },
  "reviews": [
    {
      "rating": "8",
      "text": "A sublime, thoughtful treatise about youth and aging, what we do with the time in between, and how well we understand it all as we move through the process. With its gorgeous cinematography, its superb performances by Harvey Keitel and Jane Fonda, its diverse and emotive musical score, and its beautifully layered writing, the film is a feast for the senses and leaves viewers with a lot to think about in its wake. Despite a few slow passages in the picture's first hour, \"Youth\" grows on you the further you get into it, wiping away any memories of this shortcoming. Allow yourself to be moved by the experience, and you'll come away richly rewarded."
    },
    {
      "rating": "7",
      "text": "This is an offbeat and charming film that resonates due to skillful writing and beautifully sensitive performances from an eclectically inspired cast. Directed with restraint the film is basically, and simply, an observational slice of life set in a Swiss spa where the characters converge and converse to compelling effect. It’s a true original with a possible career best turn from Michael Caine and great support from Rachel Weisz and Harvey Keitel. Only Jane Fonda disappoints, but that’s probably because all the hype surrounding her one scene leads to the inevitable result of expectations being placed too high. The film also has a wonderful Swiss location and great music that is emotively integrated."
    },
    {
      "rating": "5",
      "text": "If you saw the last film from director Paolo Sorrentino (“The Great Beauty”) you’ll have some idea what to expect here. Michael Caine and Harvey Keitel play successful artists (composer/conductor and movie writer/director) who muse about their past and ponder their future. Some of their conversations and encounters with others are interesting, but they’re interrupted by scenic views of the Swiss Alps, random musical performances and people chilling at the resort. These artistic moments provide lovely images and texture that hinder the progress of the already minimal plot. Caine has some tender moments, but the film is too long, too slow, too pretentious and too scattered."
    },
    {
      "rating": "5",
      "text": "While The Great Beauty had a great deal of charm, fuelled by visuals and philosophical talk, Youth starts on the same premise but ends up in a different direction: that of empty vanity. Sure, visuals are still good, but they lack the mysticism of its predecessor, and the depth.\r One is left wondering (without much urge to do so, though) what exactly is the purpose of this: multiple secondary characters don't come to a resolution, and we don't get why they were featured so prominently, then. Moreover, the philosophical level of the questions raised is common knowledge, something anybody could see and understand.\r All in all, Youth comes off as pretentious and pointless; one could say, it's a visual exercise - but in the history of cinema visual exercises have been a-plenty, and much more focused."
    },
    {
      "rating": "4",
      "text": "There's no real story. A collection of caricatures together by their existence at a holiday resort. Even some of the acting seemed forced to me. The photography is amazing - whether it the people or the scenery. If you're taking your mother to a \"nice\" Michael Caine movie, then they will be disappointed."
    },
    {
      "rating": "8",
      "text": "The youthfulness ever presence, despite the living matter nears to cease.\r Half a year ago the first look poster of this movie's stirred everyone including myself. Not seen such kind of posters for even movies like 'Blue is the Warmest colour' and 'Nymphomaniac I & II'. It is obvious the director of the Oscar, Golden Globe and BAFTA winner for the movie 'The Great Beauty' delivered another similar ordinary concept about extraordinary fictional personalities. And the way of their life, especially when they meet the difficulties at some point of their lives.\r From all, the casting of Michael Caine caught my interest on this. This is another wonderful movie with the hard work of the fine cast and the crew. There is a good chance for the movie in the upcoming Oscar and other prestigious awards node in a couple of categories, including for the Caine's performance. Because it looks like made for awards, rather breaking records at the box office.\r Whatever the topic of the movie is, 'love' stands at the centre of the web. Human affections for each others, losing someone you love and at a same time falling for another. All about passing through 'love' in the life and in which, how strong is our grip on it to carry along with us to the end of the life was illustrated pretty compelling way.\r The theme was bold, and everything shown was realistic. But it also makes some illusions to brief the other side of reality. For instance, a Buddhist monk who demonstrates his peaceful achievement, a fat man kicking a tennis ball high in the air et cetera, all these are the youthfulness of who are no more youths, citing as a desire for beyond their limits which is obviously what the title implies.\r I won't expect everyone like the movie as I did, because it is not made for everyone. But you could try it and then decide your thought on this film. That is one of the way the movies like this can work for the people who are choosy sometimes.\r 8/10"
    },
    {
      "rating": "1",
      "text": "Excellent acting and scenery, but pretentious, awful writing.  The whole movie consists of non-sequiturs full of pseudo profundity. One scene is of Jane Fonda playing an ring actress who flies from LA to Switzerland to tell a director that his movie stinks and she's pulling out. As a result, the plug is pulled. If only the real Jane Fonda had done that in real life with the same result. I love Michael Caine, Rachel Weisz and Harvey Keitel, but they should be embarrassed for lending their talents to this mistake."
    },
    {
      "rating": "6",
      "text": "All dressed up and nowhere to go. Paolo Sorrentino's previous film The Great Beauty was among my favourites of 2013. Youth has much of its style, but none of its substance. It certainly looked gorgeous, but left me feeling empty and unfulfilled.\r The film talks a lot about emotions but it never creates them, just endlessly philosophises about them. Its characters remain not so subtle metaphors, but never real people.\r There's nothing particularly wrong about Youth and at times it is quite enjoyable, its sin is in not achieving greatness which for a drama of this type is an absolute failure. It wants to be a grand statement about life but has nothing meaningful to say. It is still very watchable, specially if you like films of this type. Michael Caine and Harvey Keitel are what makes it so with their fun portrayal of old friends. Beyond that there's not much else that has stuck to my mind about the film. Overall Youth is not a bad film, but there's nothing recommendable about it."
    },
    {
      "rating": "10",
      "text": "A sweet film with captivating and wonderful perfomaces from a magnificent cast.\rmichael Caine deserves all his praises for the best best role in the last years of his amazing carreer, but also the rest of the cast (Weisz over everybody) are great.\rSorrentino together Bigazzy give us their usual beautiful shots, for a little, beautiful movie, less ambitious respect the great beauty but hower vibrant and heartfelt."
    },
    {
      "rating": "9",
      "text": "To every one who call  Youth pretentious, or say there no story , my advice is go to watch Fellini 8 1/2  if the The Great Beauty was a \"modern\" version of  La dolce vita  . again Sorrentino brings a new interpretation of the Fellini universe. Sorrentino is  one of the best thing happened in film in the last decade and every new film is just delightful, shame he is misunderstood for people who only express envy and people who doens't have enough film culture to uderstand where his ideas come from."
    },
    {
      "rating": "4",
      "text": "\"Youth\" is annoyingly pretentious, extremely sluggish, and drained of any charm or emotion. Michael Caine, but can't save this sloppy, unpleasant film."
    },
    {
      "rating": "2",
      "text": "What a difference a year makes! From one of my favorite films The Great Beauty - Sorrentino delivers another 2015 overrated pic - a  plotless pondering pontification on the amount of urine drops peed by the elderly. I'm embarrassed to say I couldn't make it to Jane Fonda's entrance --and I see and sit thru everything. But this disappointment pissed me off."
    },
    {
      "rating": "7",
      "text": "Great actors in major and minor roles.  A joy to watch.  The movie itself, well, maybe I just didn't get it.  Was it the directors choice to make a offbeat independent type movie?  Or did the story line just get mixed up in the cutting room?  Or was the story line about artists and how their brains are just way different from us ordinary folks?"
    },
    {
      "rating": "7",
      "text": "Youth is an everyday life-changing event we go through every single day.... 24 hours a day, 7 days a week, randomized weeks a month, 12 months a year, 365 days a year, 366 days a leap year, 10 years a decade, 100 years a century, 10 decades a century, 1,000 years a millennium, 100 decades a millennium, and 10 centuries a millennium."
    },
    {
      "rating": "8",
      "text": "The lead actor in this director's \"The Great Beauty\" had a world-weary face you could get lost in, and he kept you connected during all of that film's gorgeous weirdness. Caine and Keitel don't quite do that, but their depth and wit do anchor this film admirably. I enjoy thinky-talky movies and so enjoyed this one, which had some of the same types of visual delights and surprises as \"Beauty.\" The plot is not very cohesive and the payoff rather mild. Still, it's a film to experience and enjoy, especially if you're not young anymore."
    },
    {
      "rating": "2",
      "text": "We were attracted to this film by the marvelous cast and the generally positive reviews. What a disappointment! Pretentious does not begin to describe this film. The plot, what there is of it, is needle thin, and wanders all over the lot, introduces characters with no explanation of how they support the story. Then as if the story were insufficiently strange, the director introduces fantasy episodes, such as levitation and cows singing. If we weren't with other people, we would have walked out after a half hour. Or to put it another way, if we got it through Netflix, it would not have lasted 15 minutes."
    },
    {
      "rating": "7",
      "text": "With a powerful aesthetic and a thought-provoking look at life, YOUTH is unusually stunning. Its grandiose cast soars above the Alps - and Jane Fonda will have you wanting more and more."
    },
    {
      "rating": "2",
      "text": "My immediate reaction while watching “Youth” and when the end credits came on was that this was a load of pretentious ‘artistic garbage' but I thought a stronger word! There is so much excess in this film ranging from annoying music tracks, songs that don’t make sense, fantasy images supposedly being taken for real, people that are in another movie just as scenes are thrown in to show the director’s, and film editor’s, expertise but not necessarily for a movie called “Youth”.\r Performances by Michael Caine, Harvey Keitel, Paul Dano and Rachel Weisz are defeated by the script and what they have to say. Younger actors, except for Weisz, are secondary to the plot and are arranged in so many trick shots, as many of the extras are, that the camera, not the actors or screenplay, are the major attraction. Jane Fonda, grotesquely made up, plays a veteran actress who shows that she will do almost anything in a film even if it means being foul mouthed.\r Old people are treated like robots and/or sheep with all treated alike and not able to think for themselves. It all takes place in a spa where people are continuously given massages or spread out in pools or steam rooms. The positive aspects of the movie, where the spa is located, are beautiful scenes of the Swiss alps..\r Both Caine and Fonda are being mentioned for possible Oscar nominations for Best Actor and Best Supporting actress for her few moments on screen. I am big fans of both but I don’t see that happening for either unless watching him conduct a herd of cows which has no humor or seemingly any purpose as we already know he is a conductor/composer of some fame.\r “Youth” is for someone who believes that a man can levitate, which happens, and may be what the movie is about."
    },
    {
      "rating": "9",
      "text": "Wow! Can I just start by saying how incredibly underrated this film is!? I've noticed that the word \"pretentious\" has been thrown around an awful lot when describing this film. That word means nothing to me anymore, as it's become such a cliche word and I've decided that it's simply used by people who don't understand or appreciate art films or beautiful films such as this one and just use the word to dismiss the film and at least sound intelligent or sophisticated by doing so. Regardless of what anyone else thinks of this film, I absolutely loved it! It brings together an absolute top-notch cast, all of which give equally memorable performances! Dare I say that this just may be Sir Michael Caine's best performance of his career! Harvey Keitel, Rachel Weisz, and Paul Dano all deliver grand performances alongside him. Jane Fonda proved to be quite the scene-stealer in her brief, but powerful five-minute scene! As for the rest of the film, what can I say!? Everything about it was breathtaking and beautiful in one way or another! The cinematography, along with the many dazzling slow-motion shots are a feast for the eyes! The score also really stood out to me, especially in the film's final act! Also, the many messages that the film delivered through its though-provoking dialogue and symbolism had me pondering and marvelling the film long after I left the theater! So overall, this is one of the most beautiful, memorable, thought-provoking films I've seen all year, and certainly one of the best I've seen all year period! And honestly, I can't remember the last time a film left this big of an impact on me to the point where I found myself at a loss for words at its sheer beauty by the time the credits rolled!"
    },
    {
      "rating": "9",
      "text": "I just rewatched Youth and changed my score from an 8 to a 9. Youth is surreal, dreamlike, beautiful, poignant, mesmerizing, and melancholy. Paolo Sorrentino has created a moving film unlike any other you will see this or any other year. Mr. Sorrentino is quickly becoming one of the best directors to establish himself in the last 15 years. In addition, all of the actors in Youth turn in superb performances. Youth is a beautifully haunting film that will stun you and linger in your mind for some time after you leave the theater."
    },
    {
      "rating": "8",
      "text": "\"Youth\" is a visual beauty of a film, that's basically show and don't tell. This is the definition of art, with it's gorgeous cinematography and how the film explores love, humanity, wisdom and pain in it's main story. Michael Caine, Rachel Weisz, Paul Dano and Harvey Keitel all give terrific performances.\r The movie dose have some pacing issues, as I felt like some scenes dragged out a little bit, but I'm not sure if that's done on purpose or by mistake since this movie is out of it's mind when it comes to it's style of film making. Some people may think that this movie is too pretentious (some of the reviews I've seen), but I didn't think it was and it didn't bother me that much.\r I highly recommend seeing \"Youth\" if you like movies that are very dreamlike and focuses on it's visuals."
    },
    {
      "rating": "8",
      "text": "As usual, Slant gets it wrong - no surprise there - but Joe Morgenstern of the Wall Street Journal is a bit of a shocker: he usually has taste. At any rate, take out those two reviews and you'll get a good overview of the strengths and weaknesses of the film. Yes, there are scenes that ring false, but what a treat the film is overall, with its passages of surpassing beauty. And not just the visual: the dialogue, the characters, the insight - there are so many deeply true moments - more in this brief 2 hours than there are in a score of other big-budget Hollywood flicks.  On the other hand, you know who you are: if you liked \"The Great Beauty\", you'll appreciate Sorrentino's language and his vision. If you disliked his previous film, there's no sense in spending your time with this one, for it won't make its mark either."
    },
    {
      "rating": "10",
      "text": "Simply a fantastic movie that reminds us that everyone has a future and that we should find  or rekindle passion in life. An amazing cast and many surreal moments."
    },
    {
      "rating": "0",
      "text": "Je  m'attendais à... je ne sais pas trop à quoi je m'attendais en fait. L'affiche est frappante : on dirait une pub pour du viagra. Du coup, j'espérais une sorte de comédie (?) surtout avec ce duo d'acteurs éminents et brillants, incontestablement (on ne les présente plus depuis belle lurette). Et avec un titre pareil, on pouvait s'attendre aussi à des calembours (?) sur la gériatrie, l'impuissance, les soucis de prostate et la maladie d'Alzheimer.Il y a un peu de tout ça, cela dit, avec des filles à poil donc et des mecs aussi. Et même des vieux qui baisent dans les bois. Mais on cherche en vain ce qui pourrait faire (sou)rire (?) dans tout ce fatras de film intello-de-mes-deux dont la réalisation est totalement sénile, à deux à l'heure. Un peu de psychodrame également mais digne d'un  épisode de  \"Plus belle la vie\" sauf que c'est en cinémascope.Et des dialogues, du blabla pour ne rien dire et s'écouter parler, faire le beau et l'intéressant pour attirer l'attention de Positif et Télérama. On dirait un film idéal pour l'asile de Cannes et de tous ses lèche-bottes compassés qui pètent plus haut que leur cul. Il remporterait la \"palme\" à l'aise.Bref, je sais pas qui c'est ce Paolo mais c'est un putain de trou du cul."
    },
    {
      "rating": "10",
      "text": "A truly beautiful movie. Phenomenal cast, great acting. Felt emotional after watching it, both times. It's really atmospheric and not at all plot driven, so I just didn't mind the few WTF moments."
    },
    {
      "rating": "7",
      "text": "At one point during \"youth\", directed by Paolo Sorrentino, a character says, \"focus on some insignificant detail.\" And that's sort of sums up what's wrong with this film. Beautifully shot, well acted, you don't want to quit watching, but the simple-minded dialogue keeps interrupting. And Harvey keitel's character seems to exist for no other reason but to annoy, with his disagreements and dogmatic utterances. I like watching Michael Caine, who plays an accomplished but retired composer, talk about the past, his regrets,  which are interesting, but not inspired as it thinks it is. I was really looking forward to a short scene with Jane Fonda as an aging Diva telling off a long time director friend. But even though she's good in it, it's not very good. The dialogue is cliched and shallow. There's a great scene near the end where Harvey Keitel imagines all of his leading ladies speaking lines of dialogue. From all different time periods. It's interesting and cool and meaningful. But you'll probably reach the end of this movie feeling like you didn't get it. But maybe there wasn't really that much to get."
    },
    {
      "rating": "7",
      "text": "This is a drama film with music as its main theme or element. Other themes include nostalgia, reticence and family. I found myself a bit unsure about this film at first, with the main plot not being made at all clear until a good few scenes in - it seemed unclear what who was who and what was going on, which didn't appear to be a great deal at the time, with people lounging about outside the fancy hotel for most of the time.I felt this was quite an enjoyable, sometimes sad and somehow relatively endearing film once the plot started to build. I reckon there are few people who, once reaching a certain stage in life, say perhaps their mid 30s (which is roughly my age), doesn't look at younger generations and wonder how different life is for those much younger than us, compared to when they were that age themselves and to generally ponder about where they've been in life and whether things were worth it. It is relatively philosophical in parts but its not entirely morbid, thankfully. There are some fairly comedic scenes present, one being when Freds daughter badgers him to say what her ex had told him about her, which, lets just say, is a bit personal but it quickly goes from an embarrassing moment to some shared hilarity. There is a definite feeling, or sense, of absurdity at times, which I'm not entirely sure what to make of. There is also some relatively witty dialogue at times - it is a bit re-assuring in a sense, although its hard to explain quite how.Pace wise, its quite slow and ambling and as such, I wondered if its quite right to categorise it as a drama film but most of the other genres wouldn't fit, with drama being probably the closest match. I somehow found it pleasing that Fred saw that some of his presumed prejudices weren't actually the case, that he learned that some younger people can be surprising - he even helps a very young boy who struggles with his violin playing, which I found quite touching. I liked the way that it seemed Mick and Fred got pleasure from seeing such seemingly small, or insignificant, things.Yes it is certainly sentimental and cheesy in some respects but overall, I felt it was well made and featured a good cast. Cast wise, Michael Caine plays Fred Ballinger, a stoical, philosophical sort, who is quite stubborn and frankly rightfully so! while Harvey Kietel plays Mick Boyle, Freds friend. Other cast members include Rachel Weisz as Freds daughter, Lena, Alex MacQueen as the Queen's Emissary and Paul Dano as Jimmy Tree. Also present are Paloma Faith, who makes a brief appearance and also Jane Fonda, as Brenda (Lena's ex's new 'beau').Unsurprisingly, there is a fair amount of music featured in this film, which is mostly of the classical, some big band but otherwise conducted, type or style. It is quite good - it felt well pitched and thought out. I felt the piece played at the very end, which is mainly a slow vocal piece, sounded really quite haunting, with a bit of an ethereal feel to it.Content wise, the film contains some nudity, with people having stripped to use the facilities in the spa, thats both male and female nudity is featured at times, although not in an especially sexual way. There is a sex scene featured but it isn't particularly graphic. There is some strong language featured and one or two sad scenes. It has been given a 15 rating to reflect this.There were some shots featured in the film which I thought made good use of some perhaps untraditional camera angles, with the camera zooming up from the ground to emphasise what was going on in a particular scene and similar things. Other scenes feature low lighting, with the hotels lighting glowing, it makes some rooms look even more atmospheric and perhaps somehow magical than maybe they might otherwise have. Again, thats hard to explain without you having seen it yourself but suffice to say, I appreciated the cinematography.It kept my interest throughout, which is pretty good going considering slow paced films can bore me sometimes. I liked that it didn't seem to be too patronising towards the main characters, which was a relief, so I felt. One memorable quote from the film is as follows:- \"'I've grown old without ever understanding how I got here\" (spoken by Fred). In that sense, it is really quite reflective and philosophical, more specifically about love and loss although also generally I suppose as well and this won't suit everyone but I certainly enjoyed it.Yes, I would recommend this film. It seemed quite thoughtful, well thought out and features a decent cast, so I would recommend it. However, if you don't care for sentimental and nostalgia based films, then this may not be for you."
    }
  ],
  "recommendations": [
    "the_great_gatsby",
    "annette",
    "phantom_thread",
    "magnolia",
    "black_swan",
    "roma",
    "marie_antoinette",
    "whiplash",
    "the_walk",
    "casablanca",
    "amadeus",
    "the_grand_budapest_hotel",
    "hugo",
    "the_master",
    "the_irishman",
    "the_assassination_of_jesse_james_by_the_coward_robert_ford",
    "a_star_is_born",
    "nocturnal_animals",
    "the_favourite",
    "barry_lyndon",
    "eternal_sunshine_of_the_spotless_mind",
    "belfast",
    "the_place_beyond_the_pines",
    "ammonite",
    "20th_century_women"
  ]
}