{"id": 4334, "title": "Yu-Gi-Oh! The Movie", "starring": ["Dan Green", "Eric Stuart"], "runtime": 90, "genre": ["Animation", "Fantasy", "Action", "Science Fiction"], "description": "After the conclusion of the Battle City Tournament, deep below the sands of Egypt, an ancient evil has awakened. Anubis, who was defeated centuries ago by Yugi’s mysterious alter ego – the ancient Pharaoh – has returned for revenge. Wielding the power of the Eighth Millennium Item, Anubis is determined to destroy Yugi and take over the world.", "releaseYear": "2004", "mpaaRating": "PG", "imageUrl": "https://image.tmdb.org/t/p/w500/3VD5QDTu0rQgRvERBMXtAvg0oIC.jpg", "categories": {"plot": 4.4, "acting": 6.0, "ending": 5.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 5.0, "funny": 6.0, "action": 4.833333333333333}, "reviews": [{"rating": "3", "text": "Falta de genialidade criou-se um filme péssimo."}, {"rating": "5", "text": "I kinda like this franchise, but if you could care less about the Yu-Gi-Oh! cards or show, then this is not right for you. If you are a fan, you will like this movie."}, {"rating": "4", "text": "Well the obsurd plot is definately fun to make fun of while watching, but the overall story is very boring, especially compared to the first anime. The only character that I even cared about was Pegasus cuz he's a boss. Boring villain, boring plot, not very exciting movie"}, {"rating": "1", "text": "Nice images for the animation, it was artistc. Unfortunately the plot made little sense even to someoen that watched the show and did not match the cardgame. Even Yu-gi-oh fans should be very disappointed by this movie and the lame Deus Ex Machine of the Blue eyes shining dragon that 3 times seemed to resolve everything."}, {"rating": "10", "text": "A Very good movie."}, {"rating": "1", "text": "Okay, let me get one thing straight. Yu-Gi-Oh! The Movie sucks. Now, let me get to the positives. While it is true that the movie is basically a one-and-a-half-hour advertisement, there is a bit more action that you would expect from the series -- although that isn't saying much, like if you had said one snake was a lot better because you would die in 45 minutes instead of 30 if it bit you. ...Okay, I don't have much more on the positive side. For negatives, it's the same old Yu-Gi-Oh! crap that we've come to begrudgingly love. The voices, for the most part, suck due to 4Kids being a good anime's worst enemy -- and you can quote me on that -- and the plot is extremely confusing. Shouldn't this just be about adults playing a children's card game? Even a promo card or four received from watching it isn't really worth it, once you realize that most Duel Monsters cards are worth crap now. If you want good Yu-Gi-Oh! action, I recommend buying one of the video games -- they are surprisingly good. Yu-Gi-Oh! The Movie gets 8 plot twists out of 100."}, {"rating": "2", "text": "\"Yu-Gi-Oh: The Movie\" is one massively cliched 90 minute advertisement with a great buy-our-cards-to-save-the-damn-planet strategy. Unless if you're one of those small kids who are obsessed with the show and cards, I suggest not watching it."}, {"rating": "5", "text": "The plot is cliche and the characters are wooden, but the cool thing about Yu-Gi-Oh is seeing how creatively designed some of the creatures are."}, {"rating": "10", "text": "Its so awesome how they break the rules they're such gangsters. They're just like \" Lets play Blue Eyes\" but they can't so they throw the rules right out the window and that's EPICNESSSS!!! Who cares If Yu-Gi has the stupidest hair ever, that just makes this movie more gangster."}, {"rating": "10", "text": "What can I say? If you are a fan, you will enjoy it. Although I would prefer a better plot-line. On the postitive side is that 4Kids used the word 'die' in this movie. I would still have prefered FUNimation dubbing the series."}, {"rating": "4", "text": "Manages to be just as bad as the anime itself."}, {"rating": "9", "text": "I have been a fan of Yugioh for a few years and I liked this movie, so a 15% isn't the appropriate rating for me. A fine 9/10 would be my highest expectations. The animation was good, The characters were great, and the action scenes with the  Yugioh monsters was pretty well built up."}, {"rating": "0", "text": "It's a god-awful movie. I can't belive some moron used my name and said it was good. I used to be a ravid Yu-Gi-Oh fan, but after realizing how lame, pahtetic, and dorky the show and game was, I almost puked when I learened about this movie. Absoloutley dreadful. \"Straight up for the best movie of the year?\" Who gave that guy prozac?"}, {"rating": "3", "text": "The greatest movie about monster-based card games, kids with BIG hair, drawn out card battles, and dramatic monster card based action ever made. Seriously, it's that amazing. I mean, where else can you watch animated kids who look like they should be 30 shout out dramatic lines and literally dictate every card-based move that they do? Also, listen for the On The Waterfront reference, trust me you'll know it when you'll hear it."}, {"rating": "6", "text": "Essentially just an extended episode of the show. Meaning that it's impenetrable for newcomers as it assumes you're watching as an already indoctrinated fan and therefore doesn't bother to explain anything. Admittedly, I've never watched the original series (I was a GX guy), but even as someone who played the card game I was lost part of the time. Largely because it seems content to bend its own rules for the sake of creating some drama whenever it sees fit. Also, I think it's hilarious this only exists because the creators came up with three monsters so powerful they had to introduce a card that's sole purpose is to make it so your opponent can't play them in an effort to restore some balance to the game.As for how I would describe this to the uninitiated, I'd have to say it's like an edgier, darker, and more violent version of Pokémon aimed at teenagers. Protagonist Yugi Mutou's archrival Seto Kaiba, who's superiority complex puts even the likes of Vegeta and Sasuke from Naruto to shame, is manipulated by an outside force into trapping Yugi into a duel that will decide the fate of the world. The real behind-the-scenes villain is actually kind of lame. Finally revealing himself right at the end and getting dispatched pretty easily before the credits roll.The action itself revolves primarily around watching the characters play a card game, albeit a very flashy one as every card they use comes to life. Still, despite how much I loved this as a kid, it's not the most exciting thing to sit through now that I'm older. Partly because the monsters have more personality than the actual people and also due to everyone onscreen feeling the need to say out loud everything that just happened despite the fact that we the audience saw it ourselves WITH. OUR. EYES.Despite all of this though I still had a fun time revisiting it. It's super nostalgic and made me want to call up my old childhood friends, dust off my deck, and d-d-d-d-d-d-d-duel like we did when we were kids. Plus, Kaiba's theme song? *Chef's kiss* Pure 2000's goodness right there. There are even some solid jokes as well! If you're a Yu-Gi-Oh! fan or ever were at one point or another, it's safe to say you'll enjoy this as a reminder of what a blast this multimedia franchise could be, even if the quality does noticeably drop as you get older. If you aren't familiar with the property than this is a pretty poor starting point and quite frankly it's a little odd that you're here to begin with.6.5/10"}, {"rating": "6", "text": "i honestly didn't think this movie was that bad, i mean, it wasn't perfect, but it was good for what it was. something tells me the Japanese version was better though"}, {"rating": "9", "text": "I liked how all they did was bring out their strongest monsters and trash-talk each-other into battle! It doesn't stop there, the movie has merchandise! Yes, they sell cards! This means that if you enjoyed the movie like I did you can experience the magic at home with your friends, Somehow I was entertained even though I don't watch the anime."}, {"rating": "7", "text": "carecio de una historia original pero la batalla estuvo buena pero el argumento no tanto no tiene que ver casi nada con la serie por eso un 7 siendo  sinceros"}, {"rating": "8", "text": "First I find it odd that people rather absoultly hate this movie or ar smitten by it. Nothing will change the fact that the storline is weak. but the animation is at least above average. Especial compared to most of the hand drawn garbage out now. The dueling is confusing. I have never played any card game outside of uno but this last week I started to put the effort into learning so I could play with my 7 year old son and play according to the rules. The confusing mayhem that is the tv movie makes for younger kids blabing out rubbish in an attempt to emulate the cartoon. I have found very little connecting the card game to the tv show outside of a few specialty cards. The parts of the reviews that left me scratching my head is the critics seemed shocked that it was a 90 minute commercial. Everywhere someone is advertising to you. Sporting events, television, even movies that are not nearly as gratutious as Yugioh still use product placement. As adults I figured that was understood. I conclude with I am enjoying playing the card game with my son."}, {"rating": "6", "text": "Only can be properly rated by one who knows the game. if only they took the path that Pokemon took by screwing the battles and getting right down to a decent storyline."}, {"rating": "8", "text": "I think that this movie is underrated. I liked it because its plot made sense and, for Pete's sake, when it came out you got free rare cards! Anyway, I liked it. But I also liked the Mario movie, and since they were both flops... I have odd interests. But I digress. This movie is all right, but not the best thing that I've seen."}, {"rating": "10", "text": "This movie is good for fans, it may have its flaws but it does not deserve that low note."}, {"rating": "5", "text": "I was pleased with production value compared to the TV show. It starts strong but then the forgettable villain shows up and everything pretty much ends abruptly which is disappointing."}], "recommendations": ["the_angry_birds_movie", "doom", "spy_kids_3_d_game_over", "monster_hunter", "silent_hill_revelation_3d", "teenage_mutant_ninja_turtles", "silent_hill", "free_birds", "final_fantasy_the_spirits_within", "transformers_revenge_of_the_fallen", "dragonball_evolution", "the_angry_birds_movie_2", "resident_evil_welcome_to_raccoon_city", "ralph_breaks_the_internet", "hitman", "gamer", "i_am_number_four", "hitman_agent_47", "tmnt", "tomb_raider", "minions", "doctor_strange_in_the_multiverse_of_madness", "space_jam_a_new_legacy", "stay_alive", "my_little_pony_equestria_girls_forgotten_friendship"]}