{"id": 126, "title": "Zack and Miri Make a Porno", "starring": ["Seth Rogen", "Elizabeth Banks"], "runtime": 102, "genre": ["Comedy"], "description": "Lifelong platonic friends Zack and Miri look to solve their respective cash-flow problems by making an adult film together. As the cameras roll, however, the duo begin to sense that they may have more feelings for each other than they previously thought.", "releaseYear": "2008", "mpaaRating": "R", "imageUrl": "https://image.tmdb.org/t/p/w500/40qxr2p2s297Q1mWFJOsRatQPK0.jpg", "categories": {"plot": 5.642857142857143, "acting": 6.222222222222222, "ending": 7.5, "soundtrack": 5.0, "cinematography": 5.0, "familyFriendly": 3.0, "funny": 6.785714285714286, "action": 5.0}, "reviews": [{"rating": "0", "text": "This movie was terrible, of course you get some laughs by default from sexual humor but there is really nothing original about it and it turns in to a love story. The only reason I gave it a 0 was to bring the overall average down because it is way too high. In reality it probably deserves a 3."}, {"rating": "2", "text": "A movie that wants to be funny but just isn't. It should be retitled, \"Kevin Smith Makes a Really Bad Movie.\" Makes American Pie seem like a masterpiece. Ugh."}, {"rating": "0", "text": "Let's not support this kind of Hollywood trash or there will be more of it! Protect our children and our children's children!"}, {"rating": "10", "text": "I absolutely loved this movie. Laughed all the way through, and even came close to tears in a few scenes. Didn't think it was possible, but a movie about a porno may have been the sweetest, most touching movie I've seen in a long time, without being sappy. Kevin Smith is a genius."}, {"rating": "9", "text": "Behind the ridiculous premise, disgusting scenes, and over the top dialogue, the movie has a sincere quality to it that is one of the funniest comedies I've seen.  Elizabeth Banks and Seth Rogen are very funny and shockingly have chemistry. The movie works as a comedy and a love story."}, {"rating": "8", "text": "Hysterical moments (interrupted by the single most gross scene in any motion pcture) characterize this \"making of\" with a heart of gold flick."}, {"rating": "8", "text": "Those making the Apatow comparisons need to realize there would be no Apatow without Kevin Smith. This movie was Smith in familiar territory but at the top of his game in it."}, {"rating": "9", "text": "Only the critics who gave the film three stars have a review that is even close to what this film should be rated...i don't know why critics don't realize that a seemingly vulgar comedy can't be rated highly...most comedies that are similar to this movie are terrible and send out terrible messages to the public. but if you look at comedies the way i do and judge them for only how funny they are and what their underlying thematic message to the mainstream public like i do...this is without a doubt Kevin Smith's best film he's ever made. honestly i gave up on Smith because i thought he was getting stagnant and this movie blew me away...he finally got the right casting for his films and put people into roles they would excell at. he also seems to be backing away from his strict idea of how to say a line which adds this collective feeling that was missing in his earlier movies that were really about himself more than anything else. everyone should see this movie and tell their friends to see it because we all need Kevin Smith to have the ability to do whatever he wants...he's a true comedy auteur...a rare thing to find throughout the history of film."}, {"rating": "10", "text": "I loved this movie! It was funny, dirty and sweet. And I think Seth and Elizabeth have a long career ahead of them. The Tom Hanks/Meg Ryan of the 2000's."}, {"rating": "9", "text": "I found it to a hilariously good time, though I thought Smith was a little too vulgar."}, {"rating": "1", "text": "Saw it with a friend who really insisted. Utter rubbish. Rogen and Banks are good. But the movie is dreadful. And that's with low expectations."}, {"rating": "9", "text": "This is the funniest and most romantic comedy....ever! Seth Rogen should lead the UN and the world into a new age of peace and understanding. Sure, some people think it lacks taste, but that was to be expected. It hits right at home with the likes of me, and there are quite a few that are like me."}, {"rating": "9", "text": "I thought it was good. Not like most Kevin Smith films, but still good. If you're looking for a clerks type movie with Seth Rogen, you won't find it. That doesn't mean it's not good though. Remember, Smith made movies before Apatow."}, {"rating": "9", "text": "In Zack & Miri Make A Porno we see a real break through in directing for Kevin Smith. He has come into an art of comedic writing that is rarely replicated. He is able to stay hip and current but not lose the most essential human emotion. The movie is hillarious and contains quite a few interesting cameos (my favorite being the Apple Guy) - This is Kevin Smith's funniest and most intelligent comedy. This isn't to say he is trying to shove an agenda down your throat like in Dogma (although a brilliant movie in its own right) the movie stays fresh throughout and never boring. Completely worth your time, easily the funniest movie of the year."}, {"rating": "9", "text": "Great Movie! I compare it to a romantic comedy but skewed to the guy side, highly. Boobs and cursing, sure, but a worthwhile story, indeed. This is truly a great movie, sex scenes may linger longer than needed, but it is"}, {"rating": "8", "text": "This truly was a funny comedy. you can def. tell it has the kevin smith touch. def rent this movie at the least."}, {"rating": "8", "text": "Probably the raunchiest romantic comedy I've seen. It's not the traditional romantic comedy but traditional is not always good. It has some great belly laughs and a few gross outs. If you don't mind sailor language with your laughs you'll like this movie."}, {"rating": "8", "text": "I am not the biggest Kevin Smith fan around. I liked his 1st \"Clerks\" movie, but didn't like any of his others, until now. This one was very funny, and refreshingly non-judgemental about porn. In fact it was actually pro-porn, which it practically unheard of when Hollywood deals with the subect of porn. It was also a sweet love story, and Banks and Rogen have good chemistry together. And to Michael B, let's hope that Hollywood does more \"trash\" like this. And what we should protect \"or children and our children's \" from our wannabe censors like you ."}, {"rating": "9", "text": "Hilarious. Vile. Vulgar. Classic."}, {"rating": "0", "text": "Aptow took Smith shtick and does it better. Why watch Smith's half baked failures when you can see the same thing done by a competent director. Smith's work remains uneven and amateurish. None of this is as smart or funny as others would have you believe."}, {"rating": "8", "text": "Being a Kevin Smith fan, i was anxiously awaiting this...mainly because Clerks 2 and Jersey Girl, while entertaining and funny, lacked that certain something found in his best films. Zack and Miri is a film thats both sweet and repulsive at the same time. The characters are likeable one minute but then out of nowhere can shift into sleezy-delinquent-mode...which is oft times hilarious but at other times just....gross. The cast is a split of Smith regulars with the addition of the Apatow crowd, and the combo is a welcome addition to the Smith stable....the characters work with each other effortlessly, so the blend of actors is rather seemless and Craig Robinson is a comedic force that will only gain more and mroe recognition movie after movie he's in. Seth Rogen and Elizabeth Banks are great together as a duo, they really do come off as friends who have oft times wondered without the other knowing, \"what it would be like to be together\" and its nice to see these characters play off each other tit-for-tat, you can tell they were made for each other. The movie ends on a predictably sweet note, which was to be expected EVEN if the movie is downright obnoxious through-out. Smith has delivered us a hilarious bitter-sweet comedy that some with scoff at and others will love....i personally loved it."}, {"rating": "1", "text": "The worst movie I've seen in a while. Overly crude and underly funny. I don't think I laughed once, nor did I buy their love story (or care) at all. Kevin Smith is officially out of ideas. (BTW I loved Knocked Up, Superbad, and Dogma) A true, steaming pile of anti-comedy."}, {"rating": "5", "text": "Mildly entertaining, plot a bit of a stretch and fairly predictable. There are a few funny moments but they come too infrequently."}, {"rating": "10", "text": "Perfect Smith. Welcome back. As funny as the Clerks movies, right down to the donkey. \"She frosted me like a ... \" no one presents over the line in quite the quirky, loving way that Mr Smith does. Much like Pink Floyd's musical path to it's crowning achievement \"The Wall\" - this is one more stone in the road to Kevin Smith's 'piece de resistance'. It may be his \"Meddle\" - all the parts are coming together, we know what to expect. We know what we like from Smith, one of these times - and in the not to distant future - he will hit all the chords just right, the tempo will carry us for the full ride, the symphony of comedy will resonate and we will stand and applaud Kevin Smith's arrival. Then we'll expect every damn movie he makes to be that good, or we'll crucify him - it's what we do."}, {"rating": "10", "text": "I haven't seen this movie but this is to counter out the 0. The average rating is based on the average of everybody's scores. To rate it 0 in order to make it show YOUR opinion is just selfish. Consider this karma."}, {"rating": "0", "text": "I have not walked out of a movie in some time. This was a lazy, pointless and tasteless film. Seth Rogan is trying to capitalize on his fame. Script was predictable and poorly written, the plot riddled with holes and each performance less convincing than the last."}, {"rating": "10", "text": "Zack and Miri Make a Porno is amazing and this is a must see for any Seth Rogan or Kevin Smith fan."}, {"rating": "4", "text": "I'm quite a fan of smith, as well as rogan, but in honesty this movie is poorly written, pretty cliche for the most part. Although there were sparks of originality, its nothing more than \"ok\", there are so many holes in the plot, I'm disappointed that the details weren't that closely watched."}, {"rating": "0", "text": "Don't waste your time. predictable, not that funny."}, {"rating": "3", "text": "Funny until they actually film the porno. After the first taping of the porno, the movie falls flat on its face. How can a movie about a bunch of fools making a porno called \"Show Me Your Cockucinno\" not be funny? Kevin Smith pulls it off."}, {"rating": "7", "text": "The movie started out strong with the high comedy value, but went limp (pun intended) when the story went to a formulated jealousy love story. Rogan and Banks are great together and there are several laughs in the film. Justin Long was awesome. Very funny and great with his improv skills. Total 180 from the Mac guy."}, {"rating": "1", "text": "A dumb film for dumb people. Sad."}, {"rating": "9", "text": "This is the best comedy i've seen since meet the fockers. Don't listen to all these people that said it was immature. The freaking title is zach and miri make a porno. I hate stupidity. I would reccomend this movie for sure"}, {"rating": "8", "text": "This movie made me laugh, and was much better than expected."}, {"rating": "6", "text": "The film itself was funny as hell ... Yes it was . But the whole story seem more or less pointless . Yes it was about making a porno , but i would know how they want to live on , i mean they will be in the same problems because they wont have any money ... but oh well . I say its okay but not really as great as many try to tell here ... its just an average comedy."}, {"rating": "0", "text": "No matter how lame the story, how bad the acting, how flat the writing dumb people are so great in numbers that this garbage will continue to be pumped out. This and Bride Wars are the worst films I have seen this year. Robert if \"this is Kevin Smith's funniest and most intelligent comedy\" then lets just bin the lot. Why is swearing and talking about bodily functions innately funny to these people? Are they mildly retarded?"}, {"rating": "5", "text": "In all fairness to what I've been reading here, Zack & Miri is certainly not utter rubbish, but it's not amazing either. It is Kevin Smith's attempt to make a movie in which the Hollywood Think Tank didn't even want him to use the title! So we get a toned down, ratings-minded edited version of a film that will surely be much better on the directors cut DVD edition. I suggest you wait for that, but if you do go to the theater to see it, stay for the end credits and you.ll see a very funny epilouge about half way through. It really makes the whole thing worth while!"}, {"rating": "8", "text": "The movie was really good. If you like Kevin Smith movies i don't really know how you can complain. The only thing i found bad about the movie was that it was a little by the books Kevin Smith fare. It had a Chasing Amy esque end and included many other characters in that universe other different names. If he wants to escape that universe he created he should make a new not just change a view names. The movie is very funny and well paced. It was good i just wished it wasn't so familiar but different at the same time. I miss Silent Bob."}, {"rating": "7", "text": "Admit it: When it was announced that Elizabeth Banks would be starring in a movie about amateur porno, you were taken aback. There's a kid sister, or maybe it's a high school girlfriend quality about Banks, that makes us sort of uncomfortable with any impending nudity which involves her willowy cheerleader frame; she's the \"homeroom angel\" that Peter Wolf sings about in the J. Geils Band hit \"Centerfold\". She'd be right at home on an Ivory Snow box. After Rosario Dawson reportedly dropped out from the project, the filmmaker must have quickly realized his good fortune in landing Banks. Fresh off her role as the outgoing First Lady in Oliver Stone's \"W.\"; the white house, like the Ivory Snow box, can be said to be a symbol of purity, making Banks a modern-day Marilyn Chambers, the star of Artie and Jim Mitchell's \"Behind the Green Door\"(the second-most famous \"stag\" film from the early-to-mid seventies). When Zack(Seth Rogen) discourages Miri from unbuttoning her blouse during their big moment of truth, you relate with Zack's need to preserve her reputation. Perhaps Prince said it best, only as Prince can, when he sang in his princely falsetto voice, \"I wanna be the only one you come for,\"(from his first chart smash \"I Wanna Be Your Lover\"), which is, of course, Zack in a nutshell. The irony behind the title \"Zack and Miri Make a Porno\" is that the two old friends are more like Donald Sutherland and Julie Christie in Nicholas Roeg's \"Don't Look Now\" than two old pros, or two clumsy amateurs. Talking about \"Boogie Nights\", filmmaker Paul Thomas Anderson, quite naturally, watched a lot of adult films in preparation for his shoot, and came to the conclusion after perusing hours upon hours of bad porn, that the ultimate in method acting is for the actress to look as if she's enjoying herself, in spite of the hot lights, camera, and interested crew. Far from porno, Zack and Miri, during their copulation, the filmmaker(Kevin Smith, that is) makes a case for the \"NC-17\" rating, so often confused with the \"X\". The \"Clerks\" director surreptitiously demonstrates the difference between an adult film, and a pornographic one. The sex they have is in context with their longtime relationship. It just so happens that their simultaneous epiphanies of knowing are being filmed. \"Zack and Miri Makes a Porno\" cleverly references \"Clerks\", the no budget-indie that the MPAA treated like a porno, by slapping it with a \"NC-17\" rating, for language."}, {"rating": "10", "text": "What is most remarkable about this movie, is that I've never seen a genuine romantic love story told in such crude language. Bravo!"}, {"rating": "10", "text": "Probably the funniest and most enjoyable comedy I've seen in years, highly recommended."}, {"rating": "5", "text": "The laughs are frequent, but the story is bland and predictable. Wait for the dvd unless you're just really bored."}, {"rating": "10", "text": "Best Kevin Smith movie I've seen in a very very long time. Almost made me forget about Jersey Girl. Almost."}, {"rating": "2", "text": "The jokes in this movie are immature and forced. Completely unoriginal and at times just downright stupid. Even the story which is supposed to be some sort of love story seems overdone. The acting is also mediocre at best. This movie is one of the worst comedies I've seen in a long time."}, {"rating": "5", "text": "Overall the movie ok, it had some good laughs and I did get my monies worth. The movie turned from a light hearted funny indulgence to a romantic relationship...why. I didn't feel any closure with the Porn video or the next level."}, {"rating": "7", "text": "Comparing Kevin Smith to Judd Apatow is borderline insulting. To Smith, I mean. This movie's only real shortcomings were the lack of closure (as others have noted) and the fact that very early on in the story, the viewer will stop and say \"This is going to turn into a romantic comedy before the end\". If you have a girlfriend with a crude sense of humour, this is a perfect date movie, basically."}, {"rating": "9", "text": "We just saw this movie today and if you liked any other Kevin Smith movie than you'll love this one. I happen to be a big K.S. fan but putting that aside, it was a well thought out, funny (very funny) movie! Obviously predictable, but still quite amusing. Honestly, did not understand the other posts about the awkward relationship btwn Zach & Miri, or the uncomfortableness of the racial humor. Relationships in real life are awkward so why would you expect something different. They had great chemistry on screen and played off each other really well. Honestly, this was a great movie and made my sunday afternoon. If you liked either Seth Rogens / Kevin Smiths other movies, go see this one... You wont be disappointed."}, {"rating": "8", "text": "What a great comedy! It is so funny and the cast is amazing - Seth Rogen is at his best, but it's Elizabeth Banks that makes the film. She is great. Excellent direction by Kevin Smith. It's original and a delight to watch."}, {"rating": "7", "text": "Zach and Miri Make a Porno is a hilarious movie. Not only was I laughing my head off all the time, the movie itself was not half bad. If you are looking for a movie to watch when you are having a bad day, Zach and Miri is the way to go. 7/10 for Z&M."}, {"rating": "9", "text": "Hilarious! I laughed... and laughed some more. Seth Rogen is so funny!! I was happy with the ending even though it was a bit predictable."}], "recommendations": ["forgetting_sarah_marshall", "the_break_up", "the_wedding_ringer", "friends_with_benefits", "step_brothers", "tropic_thunder", "this_is_the_end", "zoolander", "sandy_wexler", "dinner_for_schmucks", "the_longest_yard", "funny_people", "click", "thunder_force", "just_go_with_it", "grown_ups", "hubie_halloween", "50_first_dates", "yes_man", "what_happens_in_vegas", "identity_thief", "knocked_up", "trainwreck", "17_again", "the_proposal"]}