{
  "id": 2045,
  "title": "Zathura: A Space Adventure",
  "starring": [
    "Josh Hutcherson",
    "Jonah Bobo"
  ],
  "runtime": 101,
  "genre": [
    "Science Fiction",
    "Adventure",
    "Family"
  ],
  "description": "After their father is called into work, two young boys, Walter and Danny, are left in the care of their teenage sister, Lisa, and told they must stay inside. Walter and Danny, who anticipate a boring day, are shocked when they begin playing Zathura, a space-themed board game, which they realize has mystical powers when their house is shot into space. With the help of an astronaut, the boys attempt to return home.",
  "releaseYear": "2005",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/g0HLEZfqJp5dRxMzkgZwW9puP7N.jpg",
  "categories": {
    "plot": 6.444444444444445,
    "acting": 6.75,
    "ending": 5.333333333333333,
    "soundtrack": 1.0,
    "cinematography": 5.0,
    "familyFriendly": 7.0,
    "funny": 6.5,
    "action": 7.2
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Awesome movie with great special effects and a great message."
    },
    {
      "rating": "7",
      "text": "Basically Zathura is the Sci-Fi version of Jumanji. While there are several cameos, the young cast carries the movie and you can sort of see why today names like Josh Hutcherson and Kristen Stewart are household names. The young cast does a great job, especially when you consider that most of the special effects were computer generated, and the majority of acting was done in front of a green screen. Zathura is a sweet game and an interesting movie, with an engaging young cast. It's different from what you would typically see and I enjoyed it quite a bit."
    },
    {
      "rating": "4",
      "text": "Zathura is a film that doesn't deserve too much attention. It is pretty much a bad film that has a good story and really bad special effects and ever worse actors which is a shame as it is a great idea and the result is a silly film that will be forgotten in some years as it has nothing special  Such a shame"
    },
    {
      "rating": "6",
      "text": "Man, they sure did destroy that house.'Zathura: A Space Adventure' is a solid family advantage, but man does it have some tense scenes.I was the right age when I watched this movie. I actually remembered seeing this at the pictures. The robot scared me the most. A big hunk of metal with red eyes and a buzz saw for a hand, who is played by the guy who voices Yoda. What's not to be scared about."
    },
    {
      "rating": "7",
      "text": "A cult kids sci-fi movie, Zathura is filled with wacky B-movie fun. It really is a space version of Jumanji, but it is really enjoyable in its own right. It's not half bad! There are a lot of great actors in this movie. It's a wild watch for sure."
    },
    {
      "rating": "8",
      "text": "I wasn't quite sure what to expect from this movie when I first started watching it. I just knew it was a fantasy film with familiar content, and I was pleasantly surprised by it's quality. It's a kind of space \"Jumanji\" in which two brothers, with unresolved household disputes, will play a game that will prove to be a huge space adventure where anything can happen. I liked the way the film seeks to convey a moral of the story, focusing on the importance of brotherly love and the family. Jonah Bobo and Josh Hutcherson were very good at leading roles but the building of their characters was essential, allowing the public, especially the younger ones, to identify with one or the other. Kristen Stewart wasn't as effective as the self-centered, egocentric older sister, but she did provide a few moments of humor. Dax Sheppard was excellent and his performance gave this film its most emotional moments. Last but not least, the very good special effects that the film used, convincing yet discreet enough not to dominate the screen. Still a word to praise the good soundtrack, very competent in her role.In short: this film is excellent, although not very original and recycle the formula already used in another film. It will please easily at any age and is perfect for a family serenade with everyone in the room together watching and spending quality time together. After all, family is just that ... union."
    },
    {
      "rating": "1",
      "text": "You're absolutely right Ken, Jumaji was really good at this. Zathura is just a pitiful copy. Plus, the music at the end drove me crazy!"
    },
    {
      "rating": "10",
      "text": "I loved it.They went to space. They went back home at the end."
    },
    {
      "rating": "2",
      "text": "\"Jumanji\" knew how to do this right. This movie didn't have a clue."
    },
    {
      "rating": "10",
      "text": "This was a very exiting movie."
    },
    {
      "rating": "7",
      "text": "After the past comes the future, after The Flintstones came The Jetsons, and after Jumanji came this. Both Zathura and Jumanji were based on children's books by Polar Express author Chris Van Allsburg, who exploits opposite ends of the same premise: kids get sucked into an unfamiliar, potentially deadly world or universe by playing a mysterious, old-school board game. But while Jumanji was a rather nasty piece of work that relied all too heavily on its unconvincing special effects, Zathura is a surprisingly effective entertainment. Perhaps the director made the difference: Jumanji helmsman Joe Johnston specializes almost exclusively in SFX films (The Rocketeer, Jurassic Park 3) while Zathura's Jon Favreau is first and foremost an actor, which (along with this film's modest budget) allows him to focus on characterizations as he tells the story of two bickering brothers (Jonah Bobo and Josh Hutcherson) who learn some valuable Life Lessons as the game literally whisks them and their house into outer space, where they're forced to do battle with meteors and Zorgons. Favreau makes excellent visual use of light and darkness in building tension and suspense, gets a hilarious performance from Dax Sheppard, who both channels and parodies a slightly dissipated Harrison Ford as a stranded astronaut the boys encounter, and benefits from a solid script that plays fair with the audience as it plants seemingly insignificant clues and plot details that later bloom with some very surprising and satisfying payoffs. Minus points, however, go to Zathura for its noticeable strain of sexism; we see the boys' father (Tim Robbins) but never his mother (which makes the film's choice of golden oldie for its closing credits theme both peculiar and puzzling), and their big sister is depicted as a clueless, boy-crazy ninny who, in the script's one unconvincing aspect, is kept out of the loop as much as can be gotten away with. Nevertheless, Zathura is a witty, diverting thrill ride for audiences of all ages...and if you want evidence to convince your kids that board games are way cooler than video games, it's the perfect audio-visual aid!"
    },
    {
      "rating": "0",
      "text": "The dialogue is so atrociously written, the interplay so out of joint, and the musical scoring so ham-handed as to extinguish any spark of originality. It's worse than bad, it's nothing."
    },
    {
      "rating": "1",
      "text": "Who could root for these two selfish kids who endlssly bicker. I would have cheered if they had been sucked into the molten surface of the Planet Tsouris in the first half hour. What was Sony Pictures thinking ,having a never smiling six and ten year old uttering profanity and throwing in a non essential sister who only answer to her borther and sister's pleas is to strike them. Clearly the author must have come from a broken home (as did I) I suggest he grow up and get over it."
    },
    {
      "rating": "7",
      "text": "Overall, a nice family movie. If you like Jumanji, you'll like this. The effects were good, but i was surprised to learn most of them were practical, not digital, because Jon Favreau wanted the actors to have an interactive environment so they could give their best performances. Shows there's hope for family films yet. Wish there were more ship battles, those were cool."
    },
    {
      "rating": "8",
      "text": "My boys (6, 9, 11) loved it, both my wife and I enjoyed it. Solid family movie, in spite of teenage Lisa being tweaked to give Dad a special reason to watch."
    },
    {
      "rating": "7",
      "text": "Not bad at all. A very original and clever idea. I've never seen Jumanji though, so I'm not sure how similar they are."
    },
    {
      "rating": "8",
      "text": "Both the kids (9+11) loved it, and I thouroughly enjoyed it (vs Chicken Little) Not the 10/10 that Wallace and Grommit got, but v. good still."
    },
    {
      "rating": "8",
      "text": "This actually counts as a combined 3-person vote...and we all give it a unanimous thumbs up! Just as fun as Jumanji with just as much action, suspense and laughs. There's no doubt this'll make big bucks at the box office this weekend and for weeks to come."
    },
    {
      "rating": "6",
      "text": "When the eight-year-old kid calls his older brother a \"d---\", it's your right to be offended that such phallic slang should be uttered in a family film, or you can take it as a homage to \"E.T.\" when Elliot calls his brother \"penis breath\". And since screenwriter David Koepp has collaborated with Spielberg on \"Jurassic Park\", \"The Lost World\", & \"War of the Worlds\", the seemingly anachoristic word might be the case of a scribe chiding his boss for excising \"penis breath\" from the special edition of \"E.T.\" As the older sister, Kristen Stewart is not an adolescent who's desexualized and Disney-fied, which adds a little realism to counterbalance the preposterous notion that a house can fly. The referencing of a Catherine Hardwicke film is a funny aside Jon Favreau might've written-in to remind people that he used to be an indie guy. \"Zathura\" is watchable, largely because the actors aren't overwhelmed by special effects, but it would've been more fun to see Stewart \"hook-up\"."
    },
    {
      "rating": "7",
      "text": "Some very cool effects in this movie. I particularly liked the part where the house was gettng torpedoed by aliens.The only somewhat annoying theme of the movie I guess would be te constant fighting of the two brothers."
    },
    {
      "rating": "8",
      "text": "This movie was a magical romp. It was entertaining, the only boring part being the unnecessary stealth/thriller scene aboard the \"Zorgon\"'s ship, but even that was necessary to offer some variety. I highly recommend this film. It's not just for family. In fact, I don't recommend this for younger children: in the first 5 minutes, an 8-year-old kid intentionally says the \"D-word\" (and that's not the end of the swearing)."
    },
    {
      "rating": "8",
      "text": "not as good as Jumanji, but its very amusing."
    },
    {
      "rating": "6",
      "text": "Its actually a really hearty movie with fantastic effects and great use of the story, even if it can be really predictable. Its still fun to watch."
    },
    {
      "rating": "5",
      "text": "It's extremely far from the best SCI-FI film ever made, but Zathura contains exceptional special effects, often yet spaced excitement and decent performances from Hutcherson, Bobo and Shepard."
    },
    {
      "rating": "5",
      "text": "Average not great, it gets so annoying with these 2 brothers, although it has a great visuals but the important thing is the message beneath this boring movie."
    },
    {
      "rating": "6",
      "text": "Zathura: A Space Adventure is a big spectacle of a movie that doesn't come out of its shell enough for its true potential to show. Instead, it goes for a more family-friendly approach that is good for what it is."
    },
    {
      "rating": "6",
      "text": "\"Zathura: A Space Adventure\" entertains the young viewers with good story and amazing visual effects, however most of the time the movie is boring and very predictable."
    },
    {
      "rating": "8",
      "text": "What makes Zathura so great, beyond the incredible visual designs, tense challenges, and a great director, is the fact that it was adapted from a Chris Van Allburg book. The Polar Express was a visionary adventure, and Jumanji, family fun. Zathura doesn't get to be as thrilling and masterful as the animated film by Robert Zemeckis, but innovates ingredients from Jumanji, while at the same time creating new ones. It is a movie of great adventure, infinite inventiveness, and a screenplay that will please anyone in the whole family. Jon Favreau has an unlimited supply of audacity and he applies every bit of that to Zathura"
    },
    {
      "rating": "7",
      "text": "There shone as Jumanji , another game Zathura , incredible special effects, script and argument comes , have looked once again , did not know that in those movies were a danger games ."
    },
    {
      "rating": "7",
      "text": "A completely entertaining movie about a board game. Just keep your feet moving otherwise you'll lose the game. An exciting space adventure just got wicked."
    },
    {
      "rating": "7",
      "text": "Una película que ame cuando era chico, muy entretenida con una historia de hermanos muy buena."
    },
    {
      "rating": "7",
      "text": "Çocukluğumda televizyonda denk gelip izlediğim bir film kendisi. O zamanlar Sihirli Annem falan izler, zamanı durdurmayı veya çilek gibi okula gitmemeyi falan düşlerdim. Öyle hayallerin üstüne bu filmi izlemek beni çok farklı hayal dünyalarına taşımıştı. Dünyanın en kötü filmi bile olsa benim için Kusursuzdur bu yapım. Çocukluğuma ayrı bir tat katan Zathura seni seviyorum."
    },
    {
      "rating": "10",
      "text": "The effect given by the Zathura film is very perfect, the animation technique given looks very natural and not stiff ... And the best thing in this film is very suitable for children to watch, there are no adult scenes in film and really helps children in their imagination."
    },
    {
      "rating": "8",
      "text": "Le daría un 8,5 pero como Metacritic no me lo deja redondear, se merece un 8. Me encanta. Los personajes me caen muy bien, mas las relaciones entre hermanos (que tienen que superar sus diferencias para salir adelante), los efectos visuales (quitando los \"zorgons\" que se ven mal) están muy bien y el ser una especie de segunda edición de Jumanji y corregir muchos de sus principales defectos. No me la canso de ver! Tienen que aprovechar mas a estos personajes..."
    },
    {
      "rating": "5",
      "text": "Didn't hate it.  Didn't love it.  Enough of a story to keep children entertained.  Story is a pale comparison to Jumanji."
    },
    {
      "rating": "7",
      "text": "Good but no that great!Felt boring till there sister wakes,screenplay was teribble score was okish acting was good especially little one was great some moments were amazing felt really warm with relationship issue with brother!ending was amazing as we'll get to know that astronaut was himself!visuals were great as per year is concerned as per jumanji's universe it was bottom in that!overall a one time watch for acting and visuals!"
    },
    {
      "rating": "8",
      "text": "The Zathura movie makes jumanji look like my dirty **** stained bed sheets."
    },
    {
      "rating": "7",
      "text": "----------------------------------7.4/10-----------------------------------"
    },
    {
      "rating": "10",
      "text": "another amazing movie that was part of my childhood... i was very scared of the robot and the goats with many eyes"
    }
  ],
  "recommendations": [
    "the_kid_who_would_be_king",
    "super_8",
    "the_croods",
    "nanny_mcphee",
    "shazam",
    "incredibles_2",
    "rio_2",
    "ferdinand",
    "tomorrowland",
    "the_house_with_a_clock_in_its_walls",
    "jack_the_giant_slayer",
    "doctor_strange",
    "pan",
    "the_spiderwick_chronicles",
    "bumblebee",
    "race_to_witch_mountain",
    "ghostbusters",
    "thor",
    "the_nutcracker_and_the_four_realms",
    "oz_the_great_and_powerful",
    "jungle_cruise",
    "kung_fu_panda_3",
    "spider_man_far_from_home",
    "the_good_dinosaur",
    "hotel_transylvania_3_summer_vacation"
  ]
}