{
  "id": 2516,
  "title": "Zero Dark Thirty",
  "starring": [
    "Jessica Chastain",
    "Jason Clarke"
  ],
  "runtime": 157,
  "genre": [
    "Thriller",
    "Drama",
    "History"
  ],
  "description": "A chronicle of the decade-long hunt for al-Qaeda terrorist leader Osama bin Laden after the September 2001 attacks, and his death at the hands of the Navy S.E.A.L. Team 6 in May, 2011.",
  "releaseYear": "2012",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/coeTvXKAYZlrcIfsCfYV5Hw1npu.jpg",
  "categories": {
    "plot": 4.576923076923077,
    "acting": 4.9714285714285715,
    "ending": 6.125,
    "soundtrack": 5.0,
    "cinematography": 3.0,
    "familyFriendly": 0.0,
    "funny": 5.333333333333333,
    "action": 6.923076923076923
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Disappointing. In the rush to get a script out, Mark Boal and the producers never found a strong, coherent story to tell. Instead, there's a torture act, an intelligence-procedural act, and an action act that do not cohere."
    },
    {
      "rating": "6",
      "text": "First of all, I'm always amazed at the number of 10 and 0 reviews.  People really need to stop and think about what a 10 and what a 0 implies.  Whatever, just my two cents on user reviews.  ----  As for the movie, I felt like giving it a 4, but that's mostly because my expectations were let down.  I'm not sure what the recent love affair with Kathryn Bigelow is all about?   ZDT is far from extraordinary.  Everything about this movie (script, acting, direction, cinematography--everything) is smart, faultless, and safe.   As such, it's hard to say anything bad about the film, yet, that's exactly why it fails to stand out.  It evokes no emotion and little controversy over such a controversial topic--it's moot art.  ...now I'll go read the reviews to see why I'm wrong."
    },
    {
      "rating": "5",
      "text": "Zero Dark Thirty is a step down in almost every way from the Hurt Locker. Almost no suspense, a main character that has no depth, and a somewhat slow and sluggish first half. I was hoping the first 2 hours were more like the last 30 minutes."
    },
    {
      "rating": "2",
      "text": "Tedious.  Just because something compelling happened in real life doesn't mean it makes for a good movie. For the life of me I can't understand the critical acclaim here. Nothing in this movie feels believable, first and foremost Chastain's performance. She is miscast, shrill, and has no gravitas. I didn't believe for one second she was a \"tough\" high level CIA analyst. Most performances in general felt off and even the amazing Kyle Chandler was reduced to cliche. The movie feels cheap and shallow. There is zero character development, everything feels easy, the torture scenes are gratuitous, and then James Gandolfini comes bobbling in as Leon Pannetta?  Although Homeland on Showtime has far-fetched plot lines, it is a thousand times more compelling and a million times better acted. Just don't get at all what the fuss is. And almost three hours. Ouch."
    },
    {
      "rating": "3",
      "text": "I went to see this movie last night.  The theater was packed.  I watched disjointed torture which dehumanized both the prisoner and the one's doing the torture.  They painted the Obama administration as soft, so what else is new?  They never delved into what makes these CIA agents tick? We watched 7 years leading up to the killing of bin Laden.  They never answered why they killed instead of captured him nor was there any suspense.  I know about as much as what happened then as I do now.  The professional critics are out of their mind as no one said a word leaving the theater.  As PT Barnum said...There is a sucker born every minute.  The subject matter is what attracted us.  You learn nothing new.  Just a waste of time with the camera jumping all over the place.  Yuk!"
    },
    {
      "rating": "10",
      "text": "Simply outstanding. Kathryn Bigelow, now that she's made the character-driven Hurt Locker and this phenomenally-paced thriller, has positioned herself as the dramatic chronicler of record in modern American warfare. No, she's not covering this stuff comprehensively, but the dramatic choices she makes, the slices she and her writers have focused on, so effectively tell the story of this era that I was thinking that we're lucky to have her as the credits of ZDT rolled. Chastain, the chameleon, is terrific in the film and will rightly be praised through the awards season. But I want to give special praise to Jason Clarke, who I've appreciated so thoroughly in Brotherhood and The Chicago code - he was an inspired casting choice. The enhanced interrogation sequences are technically no more difficult to watch than similar scenes in other films (most recently Safe House), but Clarke's ability to represent the interrogator's calculated pinballing between brutality and humanity is powerful. It's not a short movie, but I was riveted throughout.  My audience gave the film a modest round of applause. I think they were more stunned by what they had just seen than anything else."
    },
    {
      "rating": "0",
      "text": "This film bolsters the false impression that the US's engaging in torture, though distasteful, is necessary by painting a false linkage between torture of \"terror suspects\" and the locating of Osama bin Laden. No information leading to the location of bin Laden was obtained via torture."
    },
    {
      "rating": "0",
      "text": "The hollywood sycophants are already drooling all over the movie, hence the ratings. However it is amazing how quickly people forget that the creators betrayed the soldiers they were embedded with, while researching 'The Hurt Locker'. The soldiers portrayed in the movie behaved nothing like real soldiers - the creators claimed artistic license while dishonoring those who were kind enough to allow the civilians an unvarnished view into their world.\r This movie is much the same, again with Kathryn Bigelow and Mark Boal cashing in on the lives of those who give so much, so the rest of us may live out our lives in a safer world. Critics and audiences will rave over this movie because it is \"real and gritty\" - despite the fact they are lucky enough to know nothing about the world the movie claims to portray. This movie is nothing more than a sycophantic attempt by media liberals to burnish President Obama's image, while cashing in on the hard work and sacrifices of those who put their lives on the line for the rest of us. hollywood, Kathryn and Mark should be ashamed. The least they could've done is give an accurate portrayal of what happened."
    },
    {
      "rating": "6",
      "text": "Nothing about this movie warrants anything over a 7/10. Acting is OK, but the 95 critics rating is more out of fear of being called a terrorist supporter or simply being labelled non-patriotic.  It's a hunt, black sites, waterboarding all the things that supposedly never happened all leading up to the op in which they take out Bin Laden.As a movie it only serves as a reminder of what happened. It's not particularly entertaining, and not worth watching a second time."
    },
    {
      "rating": "6",
      "text": "The biggest problem i had with this movie is it delivered exactly what I expected, there were no surprises and stayed too close to Director Kathryn Bigelow's masterpiece The Hurt Locker. Sure the acting was solid and there was all that gritty tension that so many reviewers fall for, but instead of falling over every plot development intent of what would happen next I found myself impatient to get to the inevitable end that one is waiting for."
    },
    {
      "rating": "0",
      "text": "And who is Mia besides a great agent? Who is she as a human character? What’s her backstory? Why is she doing this? Would have been more involved if one of her family members died in the September 11th Attacks or something but the movie won’t go that far because they want to stick to true accounts. The only emotion we see from her other than the eagerness and get Bin Laden is her sadness when Al Qaeda bombed that CIA base that her partner was at and the tears that come out her eye after she confirmed that it was Bin Laden that was shot. It would be great if there was some interesting backstory. If there was a reason she was doing this that could be shown to make the audience like her more. If we take out the context of Al Qaeda and Bin Laden, and just look at the story of Maya fighting terrorists and catching a highly sought after terrorist leader, can her story stand on its own legs? Not to me, it can't.\r Maya’s confidence is a big theme in this movie but the consequences of her being wrong is not addressed in a conflicting or dangerous manner.\r Consequences: The possibility of Bin Laden not actually being in the Abbotobad compound was heavily addressed through the uncertainty of most of the characters beside Maya. However, the consequences were not explored! Because this movie is a true account, we know what is going to happen at the end. But why should we care if we are not sure of the consequences of what could happen? In Argo, we know they’re going to escape but there are some minor consequences we hear about: death by execution, foreigners getting caught in the airport, being hung in the streets. Even those consequences were weakly displayed. But what are the consequences if Bin Laden is not in the compound? Whose head will fall? What effect will it have on America? On the President? On Leon Panetta? On the continued activities of the CIA? Why aren’t people getting angry or playing politics on what could happen? Why is there no serious conflict here? What about other consequences? What if the Pakistani air force attacked them? What if the local police or militia did? Most importantly to the story of the movie, what happens to Maya if she is wrong?\r Put Aside The Story of Maya: Did the film producers create the film because they had this unique story about a young, ambitious, female CIA agent who managed to deduce the location of a highly wanted and highly elusive criminal target? Or did they create the film because they wanted to show the steps taken to find and kill Osama Bin Laden? I think the film producers were “sold” on making the film based on the latter whether or not their interest began with the CIA agent story.\r True Accounts: I read the basic Wikipedia summary on a handful of potential consequences and strategies surrounding the raid and these summary items went in so much more depth than the movie did. What if there was a bunker underneath the house? Why did they choose to do a raid instead of bombing? Or instead of a targeted drone strike? What was going on with Obama during this time? Just like in Argo, where we see nothing strategic and deep with Jimmy Carter, we see nothing interesting with President Obama, who is the final decision-maker in this whole process. We see no strategy in how the U.S. would know if the Pakistanis released the fighter jets because they have a deal with the Pakistanis that the jets given to them by the U.S. would be under 24-hour surveillance? What if Osama was wearing a suicide vest? How would they have handled it? What if there were mines on the doors? And these are just little wikipedia summary items that I skimmed. I expect a producer of a film to do highly extensive research and give me all the good stuff. There’s so much reasoning and strategy that is just dropped from this movie.\r Other Ways To Tell The Story: Telling the story from the perspective of many people instead of the CIA agents would have given the movie a lot more depth. It would have been great to see what Obama, Panetta, the Admiral, and the CIA director were going through. How they didn’t want to be wrong. They could have told this story from many different perspectives and many different people. But they chose the story of Maya which is boring to me."
    },
    {
      "rating": "6",
      "text": "A repetitiveness was definitely realized with this film and almost an exploitation of one of the most major hunts in American history. Acting was very well, but aside from the pay out, nothing is really wonderful with this film."
    },
    {
      "rating": "0",
      "text": "So, moral of the story - Two people arent getting along. One tells the other off. The other slaps the other. Then the slapped person blows up the other ones house. Then the house owner Kills the other. This is a great lesson for our kids. Hate violence kill bomb and cool stuff."
    },
    {
      "rating": "10",
      "text": "Zero Dark Thirty is an excellent film that is based on an actual event that impacted U.S. history and it safe to say that the use of narrative and technical design of this film worked naturally. And Jessica Chastain is a shining diamond throughout this whole film without a doubt. No wonder why Kathryn Bigelow is the best female director of all-time when pulling off such movies like this alongside with a terrific cast and crew that helped make Zero Dark Thirty happen."
    },
    {
      "rating": "3",
      "text": "Zero Dark Thirty is not a film that has aged gracefully at all. The plot is incredibly slow, and feels more like a revenge porn than anything else. The story is incoherent and bogged down with unnecessary characters that you care nothing about. The hunt for Osama Bin Laden should have been an exciting and engaging film, whereas Zero Dark Thirty is a bore."
    },
    {
      "rating": "0",
      "text": "Dragged out and over rated. If you want to watch this movie because you feel it is your patriotic duty to cheer on 'merica for their fine torture skills, just watch the first and last 15 minutes, everything else is just filler. At least it stays true to reality, for most of the hunt for Osama no one is doing anything.\r Also why are American critics ratings counted for this movie? you can not get more biased. most European or Canadian critics would give this a solid 50."
    },
    {
      "rating": "4",
      "text": "Zero Dark Thirty only proves the ability of Hollywood to conflate its own pompous self importance. The hype around this film is totally unwarranted. The narrative comes off like a flat reading of a history book. Zero Dark Thirty chokes under its own self-importance, and the obvious ego of its sub-par director."
    },
    {
      "rating": "0",
      "text": "Worst movie I have ever wasted money on. I lost all faith in humanity when this garbage won awards and was given positive reviews. I hope no one actually thinks this is close to being realistic."
    },
    {
      "rating": "5",
      "text": "In the end it's just not a well told story.  Too long, too many incomprehensible names to make sense of, no suspense, and worst offense of all, you just don't care about anybody.  No, I was not in a bad mood, I was looking forward to it as a big fan of Hurt Locker.\r I'm really curious why this movie gets such great reviews, especially from the professional critics.  It's just not well written.  Why does it get such great reviews??? It's almost a B movie (though maybe not quite owing to its scale.)"
    },
    {
      "rating": "0",
      "text": "It was bland, boring and featured a horribly unemotional female lead. I honestly can't believe this movie was nominated for 5 Academy Awards, while superior films (Django Unchained) were left with table scraps.\r The entire movie portrays the Americans in a terrible light. There are multiple events throughout the story in which a number of Pakistani or Afghani citizens are killed, but the only time there is any mourning or empathy whatsoever is when a group of monkeys are killed, offscreen.\r And a nomination for best screenplay? I laughed my ass of when the gruff American interrogator quipped \"Everybody breaks, bro. It's biology.\" Seriously? The entire thing is a confused mess that is about as historically accurate as Alvin and the Chipmunks: Chipwrecked."
    },
    {
      "rating": "4",
      "text": "A very disappointing movie. I have no idea what the critics are on about. The only acting with any depth was the bit part by Fares Fares, the rest were quiet, gentle, dimensionless drones representing the CIA and army personnel calmly going about their business (right)."
    },
    {
      "rating": "0",
      "text": "Over-hyped United States rubbish. Even if you see past the jingoistic propaganda you're left with a poorly executed tedious B-movie. Yawn. Avoid at all costs."
    },
    {
      "rating": "6",
      "text": "Its pretty obvious after seeing this film that  Kathryn have some real issues with men. All you hvae seen his latest(all) movies. They are centered mens world. She is trying so hard to show that \" fuxx man\" attitude. In this flick example .. notice the head star pushing the negotiator and in many scenes shes dominating the male cia agents. its just disturbing to see how he puts things, theres like  2 lesbian cia agents running the show. and most laughable part in the movie when she writes numbers on the window and acts like a baby.. AND then comes the father figure, after she have told him \" this motherxxxxx...\" wuuuut?? i was laughing so hard.. And what,, she maked those navy seals operators look so stupid.... NOOOOOO.... ok. its not a bad movie. but bigelows personal issues just make it little ankward to watch."
    },
    {
      "rating": "10",
      "text": "Excellent movie!  hands down the best movie of 2012. full of suspense with a great performance from Jessica Chastain and wonderful direction from kathryn bigelow"
    },
    {
      "rating": "5",
      "text": "Not impressed, as I was not impressed with Hurt Locker. Bigelow goes through the motions but does not tell a compelling story. What are compelling in both movies are the topics, and that seems to give a boost to the buzz about  the movies. I am confused why this movie receiving such high marks from critics. As for Jessica Chastain, nothing wrong with the performance: just not much for her to do.[ I haven't seen all nominees, but female performance I remember enjoying the most this year: Anne Hathaway in The Dark Knight Rises.]"
    },
    {
      "rating": "9",
      "text": "After seeing this film all I can say is.... wow. She knocked it out of the park again. Kathryn Bigelow created a drama that involves almost the entire war on terror, although may seem dragged out to some, seems totally necessary to me. Two wars, 6,616 American troops killed, and one mastermind of terror brought down. The scenes of torture may seem too intense for some but are needed to convey the action took to bring down this man. Jessica Chastain gives an Academy award worthy portrayal of the CIA agent Maya that will leave an impact on you.  I seriously recommend that any American who was impacted over the last decade by 9/11 or the war on terror to go see this. It will put things into prospective.\r Best film of 2012 by far and away."
    },
    {
      "rating": "5",
      "text": "it's no hurt locker.  the timeline gaps water down the story. the 95 critic rating is BS.  i don't see it. there are many better pictures in theaters right now.  It is watchable but not powerful or memorable like hurt locker was.  prepare for disappointment and you may come out ok."
    },
    {
      "rating": "0",
      "text": "horrible film that shows senseless perverted violence and doesn't even bother to make a point\ras a documentary it fails to answer or even stab at the real question WHY? Why did the US with all the resources of richest country could not locate a single man and/or destroy organization which he stood behind.\rThis film's entertainment value is nonexistent"
    },
    {
      "rating": "10",
      "text": "Bigelow's new film is an example of (what it seems to me) a new trend, new wave for the American film production. It is about time for some things to start to change! ZDT is not pretentious moral story carefully crafted and polished to be liked by large infantile and sterile audiences! ZDT is not a compromise and it is not conclusive, it doesn't make it's own statements, it doesn't provide quick and false answers and it doesn't take moral stand behind what it depicts which is by my opinion its greatest strength. This is not sterile work like many amusement-seeking moviegoers and \"eminent\" journalists wished it to be! Are Boal and Bigelow to be blamed that these consumers won't be able to see Maya's chin and nose up in the air as the proud motherf**ker who killed bin Laden? NO!!! And what they get at the end? Only Maya's tears!\rZDT is intellectually challenging work of art, meant to trigger conversation, to provide options. It insists that people should be able to build their own opinions about what they see. I completely understand that some of those opinions may not be positive, i get that. But claiming that ZDT with all of its ambiguity is just a propaganda or that it glorifies torture, is desperate, outrageous, conservative and shameful backlash! As a cinematic experience it is thrilling, dark, mournful, strange and uncompromisingly beautiful! As an artistic achievement I see it as ingenious polemical statement against the Hollywood based dis-empowerment of the spectator! As a screenplay and dialogue, it is a work of a genius since it provides the audience with political ambiguity and ambivalence.  As a film, it is probably one of the greatest American films ever made. Thank you Bigelow and thank you Boal for this bold masterpiece."
    },
    {
      "rating": "4",
      "text": "I expected much more. Torture yeah yeah we know it's nessecary but not really enjoyable to watch. Someone said \"Just because a women directed it doesn't mean its bad' what she got to do with this its still bad I have scene female directed films that wer 8 stars."
    },
    {
      "rating": "1",
      "text": "Did not particularly enjoy it.  Painstakingly slow with no real suspense . I thought when the actual raid occurred it would at least have made the movie somewhat worth seeing but even that didn't help. I just feel the whole movie was not overly believable. Obviously only a handful of people know what really happened but i felt like there was too much creative/artistic license afforded by the director. All I really wanted was for the movie to have a crisp flow with lots of suspense and be somewhat believable and most of all entertaining. I'm afraid it failed on all accounts."
    },
    {
      "rating": "10",
      "text": "Zero Dark Thirty is an incredible achievement, and in my mind candidate for best film made so far this decade. It has brought about an important debate, but more significantly it covers ten years of the war on terror in prime fashion. Chastain's Maya, a breathtaking performance of sheer will and determination, is one of the best of modern film acting male or female. Bigelow plays for high realism but she also knows how to create great drama by stretching but never breaking those confines. Every scene belongs for a purpose and never does it feel like one is missing; that in itself is an incredible achievement. Credit her direction, the cast, and the great script by Mark Boal."
    },
    {
      "rating": "10",
      "text": "Gritty stuff. Facts aside, you couldn't pen a script that seethes as much as the true story behind the hunt for Bin Laden. Weaved together are historical boiling points from around the globe that lead to the climactic crescendo of how the  went down. The frame of the puzzle is laid in the first half of the film, then as the connections are made the tension builds to whistle-boiling intensity as the final act begins. You don't need to be an American to realise the impact of the actions contained in the storyline, the direction from Bigelow and the admirable tenacity given over by Chastain grab your attention and build the wholly thrilling journey to an applaud worthy crescendo. Movie of the year!"
    },
    {
      "rating": "8",
      "text": "Zero Dark Thirty was not the movie I expected. I went in expecting more of an international thriller involving the capture of Osama Bin Laden but the movie has much more of a crime drama feel to it. It's very slow and has almost no action whatsoever. That's not necessarily a bad thing it's just not what I expected based on the trailers for the film. I will also say this: The critics have highly overrated this film. Now don't get me wrong, I do not mean to make this review sound negative because I thought it was a really well made movie. The acting, especially by Jessica Chastain was superb. She's truly one of the best female actresses out there and I expect her to have many more leading roles in the near future. I also thought that the way the movie focused on her struggles to fight for her stance was well done. Lastly, I loved how the film ignored any political bias whatsoever. I was worried that there would be a slight liberal slant in the film and I didn't think there was any. With the way media is today, that was refreshing. The only negatives I had were that the ending wasn't done as well as it could've been and didn't feel like it fit with the tone of the movie. Also, the director decided to break up the movie into chapters for some reason and that was a terrible decision. The film flowed just fine without it but that added an episodic element that made a long movie feel even longer. Nonetheless, it was a good movie that was enjoyable, albeit long, to watch."
    },
    {
      "rating": "8",
      "text": "I'll start off by saying that this movie should be considered an action documentary and nothing more.  There is no character development, the plot randomly jumps forward in time, there is constantly new information being added, and the movie is rather long.  That being said, it was highly entertaining."
    },
    {
      "rating": "5",
      "text": "When Kathryn Bigelow went on American TV recently to address the controversy that had built up concerning the torture scenes in Zero Dark Thirty, her main defence for the film was that it is a movie and not a documentary. This statement is fair enough in itself, but a movie is first meant to be entertainment and other considerations are secondary. A documentary, on the other hand, is first factual and then hopefully also entertaining. Zero Dark Thirty is for the most part too complex to be easily understood from a historical point of view and, on the whole, to slow too be first rate entertainment. Even the last 30 minutes or so which shows the navy seals storming the suspected hideaway fortress of Bin Laden fails to be either as exciting or as informative as a recent documentary on the subject called ' Bin Laden: Shoot to Kill'. For me this documentary steals Bigelows thunder with its richly detailed reconstructions and dazzling insights into the whole operation. Zero Dark Thirty, unfortunately, never gets to cinematic grips with an unsatisfactory script that whilst not pandering to its audience, nevertheless treats them with contempt by leaving out many more interesting and revelatory details than it puts in."
    },
    {
      "rating": "5",
      "text": "Zero Dark Thirty starts strong. The tension is palpable and evokes all the appropriate emotions--in the beginning. But as the movie roles on it almost seems like it's forgets what story it's trying to tell or why it's important to tell it and seems to miss it's own point behind tired military cliches which often appears as a substitute to actual character development. \"I believe I was spared do I could finish this.\" This being killing Osama. It's this lame, lazy attempt at character development makes all the characters feel like flat, one dimensional unlikeable people with any specific motivation beyond Jessica Chastain's character eventually deciding halfway through the movie on revenge. The acting is solid all around and, even though I am a fan of hers (Tree of Life, The Help), the great performance isn't Chastain, who comes across as stiff and not believable as a tough C.I.A interrogator (adequate at best and mediocre at her worst). It's Reda Kateb the man who is tortured for the first third of the movie and the only character you ever feel anything for or who comes across as a complex, real human being. As a fan of The Hurt Locker I was ready to like this movie. I was ready to LOVE it. Unfortunately it falls short in almost every way and often it's just plain boring. With all that having been said I do think people should see this movie because I think the real life details it offers are important, it's just everything about the presentation that leaves a lot to be desired. You'll get 'em next time Kathy Bigelow."
    },
    {
      "rating": "0",
      "text": "The CIA trained and funded Bin Laden as part of their effort to create militant Islamic ideology to combat the Soviet Union and Marxism back in the 70s and 80s. This agency gleefully provided torture coaching and assistance to Pinochet and the Argentinian Junta. It concocted false evidence and testimonies in the run up to both of the Gulf wars, and has been further destroying America's reputation worldwide for over a decade by torturing and murdering its way through the Middle East. And now it has somehow been allowed to make an undisputed, seemingly authoritative account of history in a way that both serves as PR for the CIA, but also makes a serious case to absolve the agency of its crimes by pointing to their utilitarian necessity.\r Imagine a film about a serial killer, who in the early stages of his life, and indeed throughout his initial murders is trained, and assisted both in tactics and funding by the cops, the good guys who spend the rest of the film chasing the killer and finally capturing him. It would make you feel conflicted, and would raise questions about who the 'good' guys are, and just how 'good' they happen to be. Now consider how Zero Dark Thirty avoids the difficult task of confronting the reality. It relies on ostentatious badassery aimed at teenage boys who think the word  must be met with obligatory laughter. It strives to induce war-nerd boners among cargo-pant wearing gamers. And it reduces a contentious moment in U.S.history, the true events of which is kept under lock and key by an agency apparently incapable of acting morally or even legally, to your common or garden variety of detective fiction."
    },
    {
      "rating": "10",
      "text": "Like Daniel Day Lewis in Lincoln, Jessica Chastain was perfect in this film. I was 13 years old when September 11th happened, It was my first glimpse of hatred in this world. For many kids my age we felt our innocence taken away from us on that day. \"Who would do such a thing to our country and why?\" Was a thought i wrestled with for weeks. For me, Zero Dark Thirty was an insight into the situation that left many of us feeling helpless. The torture in this film brought some controversy to it, Is it saying torture helped? I don't think so. I think that part of the film was used to show the tenderness of Chastain's character. A strong woman living in a world dominated by violence and men. In the end, it was Chastain's never quite attitude and determination to find Americas number one enemy that prevailed. The Raid was very effective. I remember being so into it as if we were really watching OBL coming to his end. Powerful Film."
    },
    {
      "rating": "0",
      "text": "Doesn't play Aesop Rock's 'Zero Dark Thirty' in the end. LOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOLOL"
    },
    {
      "rating": "5",
      "text": "No love for OBL and I'm glad he's dead. The shame is that the pursuit of him after 9/11 was sidetracked by the Iraq War, an unwarranted and unnecessary slog that has done no good to anyone involved. Kudos to the people who brought him to justice, specifically the members of the SEAL team who took the biggest risks, but what about the intelligence community? This film highlights the length we were willing to go to find one man. The rules we broke to do that. If you're putting this that high up on the list you're either a) condoning that behavior or b) this movie was so well shot and acted, the subject matter was irrelevant. I can't see either. It's a wrote techno-thriller that happens to be about true events. I'm dubious as to him being buried at see too."
    },
    {
      "rating": "5",
      "text": "TL;DR Brainless propaganda that will have you clapping to the national anthem with a  hard-on for Merica and freedom.\r Good action movie, that part is undeniable. However, the premise of the movie is locked in a struggle with pure fantasy and is greatly over exaggerated, obviously to make for Hollywood standards."
    },
    {
      "rating": "0",
      "text": "This movie is a plot hole mess from start to finish. Is it trying to justify torture? Is it trying to tell me the US Government didn't know where Bin Laden was all the while? Propaganda horse **** This is the land of the free right? Not communist Russia. FFS."
    },
    {
      "rating": "8",
      "text": "Great film, but I wouldn't put it past Hollywood to have had its screenplay exaggerated and all--it's events don't match up to the ones that occurred in real life. It is effective as entertainment though."
    },
    {
      "rating": "5",
      "text": "Starts and ends well but the core of the film is mediocrity at its finest in film form. The problem with this film is that, Bigelow and Boal want to say so much and yet, they confine themselves too a two and a half hour window. Boal shows just how much a fish out of water he really is here. The script is a tempermental mess, introducing one character only too abandon them for another as soon as any character development begins to form. The story itself jumps from plot point to plot point with out any real meat between the set peices. The closest comparison would be a Michael Bay film, in terms of the organization of the film. You see their is really no plot development, no actual emotional connection to anything one sees in this film. Instead, what you get is a series of events held together with padding. Like Bay it seems Boal wrote the big set pieces first and then linked them through shoddy narrative structure. The set peices mind you are amazing, but everything in between is just lazy filler. At least Bay tries to infuse his filler with some energy but ZDT, nope. The padding is a barren waste off missed opportunity. Jessica Chaistain is the most evident in this sense of dull acting. She just stands around and looks mildly discomforted by everything. Mark Strong and Jason Clarke are the only ones who really do any acting. In fact there are only two scenes that really have any life too them, the first being the one where Strong's character, George is first introduced. There is fire there is energy, life and then... Bigelows drops it all and goes back to morose mild discomfort until the last chunk of the film. The end of the film is really well done. And that is where you see that beyond the ending, this film is simply just another Body of Lies. It's almost as if Boal wrote this first, in a flurry off maddening genius and Bigelow directed five minutes after he handed it too her and then they wrote the rest of the film. All their energy gone into that last forty minutes, Though as much as I lambaste this film, considering the overly generous praise given to it (especially considering the high quality of The Hurt Locker), it does present an interesting premise. It would have made one hell of a miniseries! Boal even separates the individual acts almost as if they were episodes. And Bigelow directs each act as if it is an episode of an HBO miniseries, yet sadly, its not. Instead we have a bloated film, from a writer who couldn't figure out how to write this story beyond scripting the Abbotobad raid. It's a great story. It's just on the wrong screen."
    },
    {
      "rating": "10",
      "text": "If your a red blooded patriotic American and not freaked out by the sight of terrorists having a little water dribbled on their face your going to love this film. If your thin skinned ACLU dues paying liberal your still going to love this film, (but for all the wrong reasons.) If you are squeamish at the sight of intense violence you might have to cover your eyes for big chunks of this film but see it anyway because its that great. Adapting a major historical event (especially one shrouded in classified information) to the big screen and making it totally plausible and so compelling you don't want it's 2 hours and 40 minutes to end is a minor miracle. I'll pay full fare to see it again this weekend."
    },
    {
      "rating": "0",
      "text": "The first bad movie of 2013, this movie was so hard to watch. The only reason I can find as to why the critics are in love with this movie is because of what the movie itself is about. The man was a monster, the movie doesn't do the act any justice. I understand they put this together out of the information available, quite frankly if this is how it went down it was a very sloppy mission. This movie serves more as an attempt at Sony trying to cash in on the monsters death, I honestly cannot see any other reason for them to award this movie with such high regard. I would not recommend this movie to anyone, and it's ok to dislike a movie like this and be patriotic and against all forms of terror at the same time, Go Watch Something Else!"
    },
    {
      "rating": "3",
      "text": "The film has no real plot or development, it almost feels like Prometheus it never gives good reasoning for anything, its huge time gaps arent confusing but makes it even more tedious. Movie skips through time and just presents situation without any background information like the audience is supposed to know everything to do with everyone and every location. The torture wasnt bad, depending on your tolerance, and it was definitely not a pro-Obama political film. The film is just about Maia and her arrogance and her acting bothered me, great, but vague. Film has tons of plot holes and mistakes yet the critics love it once again."
    },
    {
      "rating": "5",
      "text": "Incredibly over-rated. It was like an episode of Homeland without the talented cast or surprises. The lead actress even reminds me of Claire Daines during some parts of the film. Interesting because of the \"how it happened\" aspect of the story but mostly disappointing. I think a documentary would have been just as effective."
    },
    {
      "rating": "1",
      "text": "Terrible.  Slow, choppy, and boring.  I found myself wanting to leave half way through and wish I had.  The acting was at best mediocre and the script was just not believable.  First, the film was obviously rushed to production, as it premiered only 20 months after the actual event.  In that time, the movie had to be researched, the script drafted, the scenes shot, and the film edited.   In addition, much of the material the movie would have to rely on is undoubtedly still classified.  Given that, can anyone really believe that the film is at all accurate?  No way.  It would have been better to wait a few years for material to be declassified, let the historians write the books and shoot the documentaries, and then 10 to 15 years from now shoot a quality film based on accurate material.  There was no need for Hollywood to rush this movie to the theaters.  Has anyone seen Argo?"
    }
  ]
}