{
  "id": 2389,
  "title": "Zodiac",
  "starring": [
    "Jake Gyllenhaal",
    "Mark Ruffalo"
  ],
  "runtime": 157,
  "genre": [
    "Crime",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "description": "A cartoonist teams up with an ace reporter and a law enforcement officer to track down an elusive serial killer.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/wIgn28v2X91mnCylwIoE7KFHVfb.jpg",
  "categories": {
    "plot": 8.419354838709678,
    "acting": 8.633333333333333,
    "ending": 9.142857142857142,
    "soundtrack": 9.0,
    "cinematography": 7.0,
    "familyFriendly": 3.0,
    "funny": 6.5,
    "action": 9.5
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Knowing the way David Fincher's movies work, I was expecting a twist at the end, and I was disappointed when there wasn't one. However, Zodiac is still terrifyingly creepy, eerie, and its suspense level rises into Hitchcockian territory. Fincher's refusal to tie up loose ends in the movie as far as leads doesn't seek to confuse; instead, it seeks for the viewer to try to solve this case in his/her head. And for that fact alone, this movie stands out above the average genre fare."
    },
    {
      "rating": "9",
      "text": "Treating James Vanderbilt's screenplay  with a natural talent of a capable filmmaker by mixing suspenseful sequences with haunting pauses, David Fincher makes of Zodiac a good addition to the thriller genre."
    },
    {
      "rating": "10",
      "text": "Incredible film. Suspenseful, engrossing, chilling. Everything about it (acting, script, cinematography, score) is brilliant. Fincher at his absolute best."
    },
    {
      "rating": "10",
      "text": "This movie was amazing. The movie was ver long, but through out the whole movie I never wanted it to end. I was hooked from start to finish. Robert Downey Jr. was incredible. David Fincher is an amazing director (Fight Club is his best work). This movie was terryfing and suspenseful throught the whole movie. I just watched last night, but I could watch it again today and be just as excited about it."
    },
    {
      "rating": "8",
      "text": "This is a hard movie for me to rate, for a myriad of reasons. Zodiac is based on a true story; Robert Graysmith's book of the same name. To be able to take such a convoluted story and condense it into a movie is an achievement in itself. The acting is fantastic from all parties, with Jake Gyllenhaal playing the main role of both naive cartoonist and possessed civilian-detective to a fault. The script is good; it even manages to throw in a laugh here or there, and the cinematography, at some points, is excellent. Then there's the plot, which could easily be separated into two (and a half) parts. There's the beginning, while the murders are happening and the case it hot, which to me, this is easily the weaker portion of the film. The story at that point is slow and laborious, with too many people saying too many different things each with not enough airtime. The middle (the half part) is the three seconds the film takes to jump four years, during which it becomes a cold case. Then comes the end, which is entirely focused on Robert Graysmith's (Gyllenhaal) hunt for the Zodiac Killer. Not only then does Zodiac become suspenseful, but it almost reaches the Olympian heights of Fincher's other serial killer thriller, Se7en. In the end, the pros outweigh the cons, and leave you with a movie that is a bit too long and just maybe a bit too true... but nonetheless an entertaining and sometimes fascinating film."
    },
    {
      "rating": "9",
      "text": "Zodiac is a near perfect film. While it takes on the same manner of story telling as All the President's Men, it does not quite match the classic film's essence, but all in all it becomes something great. It is a rarity to see a film about a serial killer in today's market not filled with gore and violence for the sake of gore and violence. It also becomes rarer when that film focuses on the characters on the outside looking in: the news reporters, the police, etc. Again it becomes rarer when the actors have the capacity to truly bring out their respective character's persona and do so not just well, but beyond the viewer's expectations. Zodiac manages to do all of this while blending together terrific directing and a pace that just flows with the two and a half hour length so that the film remains an interesting, though all around disturbing, tale of humanity's deepest depths of violence and hatred rather than a sluggish bore, even without a focus on gallons of blood and severed limbs. In the end, this is a film that stands in contrast to Saw, Hostel, and all the other blood baths being pushed in front of us. It is a film that is actually good, perhaps more than good."
    },
    {
      "rating": "9",
      "text": "Amazing film. The eerie mood created by Fincher leaves you on the edge of your seat the entire time. There may not be much action, but the story still manages to hook you in and keep you interested for the full 150+ minutes. On that note, it may be 150+ minutes, but it certainly does not feel like that in the least."
    },
    {
      "rating": "9",
      "text": "Zodiac is an ingenious labyrinth of a film that conveniently hits its climax just as we think its slowing down on us. This is great filmmaking from David Fincher, one of the greats of our time."
    },
    {
      "rating": "10",
      "text": "David Fincher delivers a pretty entertaining thriller with \"Zodiac\". The story follows several men who become obsessed with the infamous Zodiac Killer and his reign of terror over the San Francisco Bay area during the 60s and 70s. The movie delves deep into what happens to investigators when their cases go unsolved, and how far they'll go to uncover the truth. All in all, I felt that \"Zodiac\" was a pretty well-crafted film - especially in a technical sense. David Fincher implements a number of convoluted CG techniques to recreate the Zodiac Killer murders and certain areas of San Francisco. Fincher also filmed the majority film using the digital Thomsom Viper camera, something that, at the time, was relatively innovative. The acting was pretty great, I felt that every actor delivered their roles with the utmost accuracty. Also, the script seemed very well written and fairly convincing. As a film, \"Zodiac\" really does it's job of making you feel as though you are chasing after the elusive killer himself."
    },
    {
      "rating": "8",
      "text": "Now that the criminal mastermind flick has become a set type, widely overdone, this film tends to get easily shrugged off as yet another film about an ultra-intelligent serial killer who is always one step ahead of the cops, yes just like Seven. Still though, this film is quite different. Zodiac has nowhere near as much internal darkness bursting from its seams.\r But Zodiac is dark, just not Seven dark. Even though Zodiac is still a murder-thriller, it’s tone compared to Seven, is a like a lovely ray of sunshine. Being that this storyline is all loosely based on actual events, enacting the film out in the time period during which it occurred, the late 60’s-early 70’s gives the film a freshness, a nostalgia that seems to come with those decades.\r The plot: In an age before mail bombs and anthrax scares, a killer toys with his pursuers by leaving complex clues just above their tracker’s radars, just out of reach of their capabilities, the chase then becomes perpetual, the madness wide spread- reporters, cops, victim’s families, all exposed to the madness. Society engulfing.\r The lighting, the darkness, the shadows, the string dissonance, and the rain of course: all hugely important to Fincher’s work, perhaps his most important set of tricks, perhaps they could even be called Finchinian, or would it be Ficheresque? They pop up in all this films.\r In the real tense bits we get close, claustrophobic shots, bare-bones dialogue, tense body\r language, the potential victim’s fear seeping almost literally thought the screen, then BAM! Scene complete. No sentimentality.\r None of Fincher’s tactics in creating suspense come across as clichés. These are textbook lessons in how to frame a successful suspense scene. In a thriller the actor is a part of the puzzle. Like a part of complex musical arrangement, all the players need to play their parts perfectly.\r In thrillers the character is thrown into an extreme situation, an abyss created by the filmmaker, and Zodiac, unlike Panic Room, is a bottomless abyss. Great performances are made by the actor’s that find the rawest, ravenous ways to claw their ways out, even if the character fails.\r During Zodiac, Jake Gyllehaal was still coming up in the ranks. He had not fully moved on to the badass action hero roles he plays today and in his underling position in the film, as a cartoonist constantly getting in the way of the “real” reporters, he becomes an interesting underdog of a main character, even though he’s not supposed to be the main attraction. A pleasure to watch, we know, and he knows, he is in a subservient role and he never breaks out of it .\r Thrillers are the king of film as the symphony is king of music. Great symphonies are difficult to execute. So many elements, so many moving parts, everything must align perfectly, so when that moment of suspense is created, in both thriller and symphony, whether scene of movement, we stand in awe.\r Zodiac has those moments."
    },
    {
      "rating": "10",
      "text": "This isn't your typical Hollywood drivel dominated by special effects, and it's not a film for your typical short-attention-span-moviegoers; instead, it's a riveting analysis of the most definitive evidence in the case. I guess some people found it lacking in the typical blockbuster flash, but in my book that's a really GOOD thing. The characters are all very well-acted, and the screenplay was quite good. As they say, the truth is stranger than fiction, and this presentation of the Zodiac case is truly as compelling as they come. Excellent job."
    },
    {
      "rating": "7",
      "text": "A good movie....climax is not up to the mark...well narrated... every fincher fan may be disappointed at last with such an end...but based on a true story..only this could be possible..."
    },
    {
      "rating": "7",
      "text": "Based on a true and in my opinion interesting one, the movie will let you disappointed with its two and a half hours inconsistency, unclear dialogues and interrelations between people, as well as not good directing. Today, there are so many unsolved crimes and uncaught criminals, who are known to be guilty, but without material evidence. To me, it was interesting to see that problem in a movie, but it could have been made much better. By the way, there are crazy idiots yet, who choose to dress like the Zodiac from the movie on Halloween. Abhorrent.."
    },
    {
      "rating": "8",
      "text": "I wouldn't say this is the best Fincher could do, but I can assure you that if you cannot enjoy watching this, none of Fincher's creation would satisfy you."
    },
    {
      "rating": "10",
      "text": "A work of genius in storytelling by David Fincher in what is a phenominal adaption of the killings of the Zodiac killer. Clever casting for the lead roles leads to some outstanding performances by Jake Gyllenhall, Robert Downey Jr. and Mark Ruffalo. The film itself is long, some might say to long but the every detail, big and small is so precise and is key to Fincher conveying his take on events and also in showing the effects the Zodiac has on each character. But don't let how long the film is put you off because its so compelling and intense yet intriguing that it keeps you following the story and wanting to see whats going to happen next. Ofcourse the main point of story is based on the murders of the Zodiac killer but the main theme is how the killings affect each character and gradually wares them down with initially, the lack evidence to identify a suspect and then later to make a proper conviction. Downey dazzles as a journalist investigating the murders that brings him new found popularity which leads him down the drugs route due to the frustration and inability to find the man responsible, Ruffalo is is fantastic form and delivers a magestic performance as a cop tasked with finding the Zodiac, Gyllenhall is the surprise of the show for me, his portray of a strange and peculiar yet inspiring cartoonist, Robert, is tremendous, but Finchers choice in John Carroll Lynch as Arthur Leigh Arthur was genius as his depiction of the prime suspect is fabulously creepy and encapsulates the reason why he is the prime suspect to perfection. All in all Zodiac is a truely exceptional piece of filmmaking and something that you simply cannot afford to miss out on."
    },
    {
      "rating": "9",
      "text": "Excellent film. The atmosphere and attention to detail effectively recreate one of the most interesting and unsolved serial killer cases in U.S. history. Fincher did an excellent job with the story."
    },
    {
      "rating": "10",
      "text": "Definitely a great movie. One of the best that I've seen recently. Accurate on the facts, suspenseful. Definitely a must see."
    },
    {
      "rating": "10",
      "text": "Excellent movie, one of the best i've seen in a long time. FIncher is back! Only complaint is that there are no special features/bonuses on this dvd."
    },
    {
      "rating": "10",
      "text": "One of the best American movies of recent years, a deep regard into the United States after the September 11th (even if it runs in previous decades)"
    },
    {
      "rating": "7",
      "text": "I thought it was good and it did keep your interest through out the film. Yet it didnt offer anything new to the legend that is the Zodiac. Just was really just a re-telling of an old theory that was fitted for the big screen. The star studded cast definently raised this film above what it should have been and the acting was solid through out. Overall it was worth the watch if you want to understand the Zodiac more but if you are familiar with it then chances are you wont learn anything new."
    },
    {
      "rating": "5",
      "text": "It feels more like a Private Eye-tutorial doc than an artsy movie. And that's a compliment, since its comprehensive detail is overly impressive--to the point of a BBC/PBS doc or an Atlantic/Harper's article. Yet its dexterity to tell a compelling and purposeful story is absent--the characters are self-indulged in Zodiac-obsession, the characters only do Zodiac-related talk, things exemplified are too-plot concerned."
    },
    {
      "rating": "0",
      "text": "What a horrible movie. Me and my friend just sat there waiting for it to end. This was the most boring film I have ever seen, par none. It felt like it was 6 hours long."
    },
    {
      "rating": "4",
      "text": "They should have paid me to sit through that bullsh.t."
    },
    {
      "rating": "0",
      "text": "I like movies where I have to think. but this movie was just soooo boring!!! After an 1 hour of watching this borefest, I had enough!!"
    },
    {
      "rating": "0",
      "text": "This movie kicks off with a bang and then it is sooooo freeaaaking boring."
    },
    {
      "rating": "4",
      "text": "BORING! Gotta say, I'm a huge Fincher fan, but he missed the boat on this one. Not enough plot, no real suspense, and I didn't care for any of the characters after the first 30 minutes. The acting was great, but this movie seemed to take itself too seriously. Fincher did a great job of condensing all that info into a movie that people could follow, but it would have been better served as a documentary on the case rather than a feature movie. Seems like there was no real need to make this movie."
    },
    {
      "rating": "2",
      "text": "As a huge fan of Se7en I couldn't wait to see David Fincher's latest film, Zodiac. After over two and a half hours of the movie I walked out of the theater stunned"
    },
    {
      "rating": "3",
      "text": "The movie is too long and there is no action. The story is too confusing, though Robert Downey Jr. is a GREAT actor, and becuase of him we didn't fall asleep in the cinema."
    },
    {
      "rating": "0",
      "text": "Oh my god, total snorefest. I wish I would have spent that two and a half to three hours doing something productive instead of watching this piece of junk. You watch a guy read books and talk to people for 99.9% of the movie, the other 0.1% is seeing the actual killer do something."
    },
    {
      "rating": "10",
      "text": "Hi I liked the movie. Gyllenhall, Downey Jr and Ruffalo's performances are fabulous. But the scene stealer is John Carroll Lynch as Arthur Leigh Allen. Although, he is there for only 5-6 minutes he is too creepy. Brilliant movie by Fincher who also directed the brilliant Seven and Fight Club(1999). Although it is a bit slow, it is rewarding. DO not expect anything, you will be singing its raves. Those who way it is bakwaas are people who either do not like such intricate and grim movies or those who have very short attention span(no offense to anybody, it is your taste). Brilliant!"
    },
    {
      "rating": "9",
      "text": "Beautifully done, has me guessing the whole way not much better movies out there!"
    },
    {
      "rating": "10",
      "text": "Master storytelling - impecable acting."
    },
    {
      "rating": "9",
      "text": "A grown-up movie for once from Fincher, which is not meant as an insult. Fight Club is great and Seven has its' charms, but Zodiac is the sight of a filmmaker finding the humanity in his characters and giving them the respect they deserve. the first ten minutes will absolutely terrify you, and from there you are riveted, more or less or the next two hours. Fincher doesn't flinch from the violence (has he ever?), but he doesn't linger either, like he did previously. It isn't perfect, due to a few scenes not quite adding up or adding to the plot, which may have been the point. One gets the sense this is a multiple viewing technique that will pay dividends in the future."
    },
    {
      "rating": "9",
      "text": "God, what a bunch of pinheads critics can be. Zodiac is \"unsatisfying\"? \"No resolution\"? \"About a writer rather than a killer?\" Newsflash...the crime was never solved! This is a brilliant, subtle film by sledgehammer director Fincher, and it's a welcome change. With enough \"Se7en\" clones to fill an entire video store, how nice to be cerebrally challenged! This, none the less, is one of the creepiest film in recent memory--gave me honest to God nightmares. Bravo to Fincher and the uniformly excellent cast. And whoever chose \"Hurdy Gurdy Man\" as soundtrack material is a genius--I'll never be able to listen to Donovan again."
    },
    {
      "rating": "10",
      "text": "for anyone expecting to sit down for a 90 minute hyper-stylized blood orgy, i can understand some people checking their watches. but if you go in ready to invest three hours in an intricate and brilliantly sequenced crime drama i guarantee you will be totally blown away. i loved everything about this movie; the pacing, the acting, the cinematography, and screenplay were all tuned to perfection. i have as much OCD and ADD as the rest of those living in western society and this movie still kept me on the edge of my seat just through the sheer passion of the characters themselves. fight club and se7en were great of course but i thought this really stood out as a masterpiece for david fincher and a mature piece of really highly focused storytelling that doesn't drag for a second."
    },
    {
      "rating": "8",
      "text": "***may contain slight spoilers if not familiar with the subject matter start to finish***\r pros: masterfully executed, easily among the best work to date from primary cast & crew (downey, ruffalo, fincher), great suspense during the sparse moments when it's allowed to creep in, was rather painless to watch despite the running time (save for a few flinching scenes), and engaging start to finish\r cons:  not as cohesive or gripping as I had hoped, most will find it a bit too long, the built-in realities leave viewers aching for more progress and closure throughout, meanders a bit in some spots, and ultimately I think it remains to be seen whether zodiac becomes the instant classic that all the short-term praise would seem to suggest\r well done, but ultimately less memorable than something like se7en (or lambs) due to a lack of several essential hooks you'll find among the instant classics in the genre - the great news is I can say that I look forward to more work like this from both the director and some cast members"
    },
    {
      "rating": "10",
      "text": "They started the meeting without him. You hear the off-camera voice of the editor-in-chief as Robert(Jake Gyllenhaal) enters the San Francisco Chronicle building; a pan finally delivers him into the conference room. He's tardy, but it doesn't matter. The movie can get by without him, for now. \"Zodiac\", up to this point, is a police procedural and a workplace drama. How the screenplay transforms the cartoonist into a pro-active character for the stretch run is what makes \"Zodiac\" so exciting; to see the low-man at the Chronicle emerge out of Paul Avery's shadow. \"Zodiac\" is really an underdog story. It's kind of like watching \"Rudy\"."
    },
    {
      "rating": "10",
      "text": "Fincher's best film to date. His depiction of the havoc wreaked by Zodiak upon those given the task or personal obsession of catching him, in many ways psychologically akin to The Shinning, is so devastating that he wisely gives little time to the actual killings. We watch the pursuing characters as their task gradually grinds them down, and Fincher's attention to the details, large and small, reveals a confidence in his choice of the film's direction which places him among the very best of his profession. Gambling with a fairly long running time, Fincher's excellent cast executes the director's plan almost flawlessly. I've never been a fan of Mark Ruffalo or his acting, but Fincher puts him squarely in the spotlight and he delivers the performance of his life. Some may see this film as a boring, overlong police procedural , lacking the intensity generated by the expected blood-letting, but I don't.. Fincher's made some very decent films, but nothing like this. It's a renewed pleasure to find a director whose films are identified by his name a la Stanley Kubrick. Now let's see if Fincher can consistently produce a product at least equal to this film."
    },
    {
      "rating": "8",
      "text": "This is superb!! If you like intelligent murder thrillers you won't be disappointed."
    },
    {
      "rating": "10",
      "text": "To be honest, I did check my watch, but only because I thought we were hitting the climax (which we were an hour away from.) Beautiful looking, never boring, great performances, SPECTACULAR storyline (and huge bonus that its true.)"
    },
    {
      "rating": "4",
      "text": "This is a great movie but a 3 hour movie and the middle part of it gets boring as hell and it is predictable based on a true story and the zodiac killer was never caught and the movie was featured on americas most wanted if you watch that episode it will tell you everything that happened in the movie."
    },
    {
      "rating": "10",
      "text": "A sprawling masterpiece by the one and only David Fincher. He digs deep beneath our skins and creates a film for the ages. It features oscar worthy performaces from Jake Gyllenhaal, Mark Ruffalo, and Robert Downey Jr.. The story takes hold of us and refuses to let go until the very end which is left open ended. Was Leigh the killer or was it someone else. The obsession that took over these people ruined their lives anthe press egged it on. Their own obsession with getting the scoop transformed the Zodiac into a celebrity. They messed with everyone's minds and clues were messed around and people gave false testimonials only turning the case into a twisted never ending Labyrinth. Come oscar time next year this film should definitely be remebered. It is taut and thrilling and meticulous. Fincher, welcome to perfection."
    },
    {
      "rating": "10",
      "text": "Go into this film with the right attitude, expecting to have to think and you'll find one of the most rewarding films of the past 10 years."
    },
    {
      "rating": "5",
      "text": "This was a sub-par movie should have been like hour and a half but stretched it out for like 3 hours. It did have some funny dialogue but overall it was an average movie."
    },
    {
      "rating": "10",
      "text": "Zodiac is more than a thriller, it´s definetly THE thriller. Fincher builds a huge, monumental story where there isn´t such a thing. He invades your mind with tones of information that never shows itself confusing, but brilliantly dispensed. Mark Ruffalo demonstrates once again the great actor he is, while Jake Gyllenhaal stand the weight of a relevant role efficiently. Summaring, Zodiac cannot be considered anything but a masterpiece of a director that loves his work and cinema. (the lake couple assassination, best filmed murder in history)."
    },
    {
      "rating": "10",
      "text": "This strange, obsessive film by David Fincher is the perfect match of material and directorial personality. Given to compulsive retakes and meticulous preparation and long shoots, Mr. Fincher finds his alter ego in his characters compulsions yielding a masterwork nearly unmatched in recent cinema. One of the 3 or 4 best films of 2007."
    },
    {
      "rating": "7",
      "text": "I can guarantee two things to the avid movie goer about this movie: the first, it will grip you at the beginning, the second, you WILL fall in love with Robert Downey Jr. Not to mention that you are bound to get freaked out by all of the killings. Director David Fincher does it again, his camera work is worth your money alone, not to mention the fact that he somehow gets great performances out of everyone he puts on screen. The second half of the movie drags on, I think it is supposed to however, since the end of the investigation dragged on for years. It was most definitely unique...And most definitely worth seeing,"
    },
    {
      "rating": "10",
      "text": "When I went to see Zodiac, I went alone, driven by boredom; at the time I just wanted something to do, so I thought I'd go see a movie, didn't think there was anything playing, but I noticed Zodiac had very favorable reviews, so I decided to see that, but I was NOT expecting what I saw. Zodiac is one of the most finely crafted motion pictures of all-time, I can't believe that's not even more praised by the critics and audience circles. The film is absolute brilliance, armed only with what was written in the books, and what the evidence tells us, the film manages to keep you mesmerized throughout it's entire 150+ running time (that is if you're mature enough to handle it). And even though i went in knowing that there wouldn't be any conclusion, somehow the film kept making me think \"they're gonna fin him this time\". And even though they didn't, I came out not remembering the last time I was so satisfied by a film. Probably the best I've seen since Sideways (which came out late in 04')."
    },
    {
      "rating": "6",
      "text": "the movie started out good and played great, but it had a real is-that-it ending, and that spoiled the experience a bit for me."
    },
    {
      "rating": "10",
      "text": "While there have been other attempts to create the Zodiac killer's reign of terror on the big screen, none quite compare to David Fincher's Zodiac. The film itself is very long, but it doesn't stop for one second at keeping you entertained and keeping you on the edge of your seat in suspense as Fincher explores every precise little detail, both big and small of the events that take place during the Zodiac's murderous run. The casting of Jake Gyllenhall dazzles as he is easily one of the best actors in the film as you feel his journalistic obsession at finding out who the Zodiac is come to light. The rest of the cast, more specifically Downey Jr and Ruffalo shine as well making this eerily, creepy thriller a welcomed edition to the horror genre."
    }
  ],
  "recommendations": [
    "the_raven",
    "minority_report",
    "shutter_island",
    "10_cloverfield_lane",
    "bad_times_at_the_el_royale",
    "prisoners",
    "the_little_things",
    "the_experiment",
    "memento",
    "good_time",
    "breach",
    "the_machinist",
    "the_next_three_days",
    "the_invisible_man",
    "a_walk_among_the_tombstones",
    "trance",
    "the_call",
    "child_44",
    "the_prestige",
    "looper",
    "enemy",
    "blackhat",
    "the_usual_suspects",
    "cube",
    "tinker_tailor_soldier_spy"
  ]
}