{
  "id": 773,
  "title": "Zombieland: Double Tap",
  "starring": [
    "Woody Harrelson",
    "Jesse Eisenberg"
  ],
  "runtime": 99,
  "genre": [
    "Comedy",
    "Horror"
  ],
  "description": "Columbus, Tallahassee, Wichita, and Little Rock move to the American heartland as they face off against evolved zombies, fellow survivors, and the growing pains of the snarky makeshift family.",
  "releaseYear": "2019",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dtRbVsUb5O12WWO54SRpiMtHKC0.jpg",
  "categories": {
    "plot": 6.2894736842105265,
    "acting": 6.594594594594595,
    "ending": 5.666666666666667,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.809523809523809,
    "action": 6.428571428571429
  },
  "reviews": [
    {
      "rating": "0",
      "text": "A lanky, nerd who gets the girls... hilarious but in all the wrong ways. Plot is unimaginative and the writing is garbage. Subversive undertones are also very \"on the nose\" ;)"
    },
    {
      "rating": "5",
      "text": "After a hiatus of 10 years, the original director, 2 writers and the main cast are all back, but the thrill is gone. Even though the chemistry is still there and there are plenty of snarky comments, the magic is missing. Primarily, because the action takes a back seat to relationships (yawn). The main quartet splits up several times, as they cope with new breeds of zombies and their own personal issues. Some fresh faces pop up, but Thomas Middleditch is the only one who adds any fun. There aren’t even many fight scenes and most of the killings aren't clever or original. Don't get me wrong, I love a good zombie chop, but \"The Walking Dead\" does a lot better job of that. My review of the first movie called it \"pure popcorn pleasure,\" but this one rates as a high-spirited but ultimately tired retread. NOTE: Stay thru the credits for an additional gag."
    },
    {
      "rating": "6",
      "text": "Overall, I liked the movie. The characters were really good, but the story was poorly paced and a bit predictable. The movie just seemed to drag on a bit, and certain sequences lasted too long. It stinks, because I waited for a sequel for a long time, and the story for this movie just fell flat."
    },
    {
      "rating": "6",
      "text": "I want to give a higher score to balance off the negative review bombing, but I would rather be honest. This movie is perfectly okay. Enjoyable while it lasts, but nothing more, which is a far cry from the really memorable original.Also, a bit sad that there is no Twinky in this movie."
    },
    {
      "rating": "6",
      "text": "Zombieland from 2009 is a good movie that is thoroughly entertaining. So how does the sequel stand up to the original. Eh, it’s okay. It’s entertaining but you will probably forget about it after you see it. The film unfortunately feels way too familiar to the first to the point where you feel like it’s almost a copy of the original which is unfortunate because there are some interesting new elements that they added to the film. One of those elements would be the zombie types. It’s a cool idea but it doesn’t go anywhere. There are two moments with the zombie types that are pretty funny but that’s about it. I liked Luke Wilson and Thomas Middleditch’s characters but they are only there for about 5 minutes and then they are gone. Those two are the only new characters I enjoyed. I found Zoey Deutch’s character to be incredibly annoying. I know that’s what the film was going for but she was just way too annoying. The humor was hit or miss for me. I found some of the jokes to be pretty funny while others I thought were terrible. The first Zombieland was definitely much funnier but this film does have a hilarious post credit scene with a celebrity. The one aspect that holds this film up high would be the acting and chemistry between Woody Harrelson, Jesse Eisenberg, Emma Stone, and Abigail Breslin. Just from their performance and chemistry alone, you can tell that they really wanted to make this sequel. Double Tap definitely feels like a Zombieland movie even if it’s a tad bit familiar. As I said earlier, 50 percent of the jokes are pretty funny. They have a segment that comes into play 2 or 3 times called Zombie Kill of the Year that is hilarious. Some of the segments in the film are really good. The opening sequence is brilliant. It’s the main characters battling zombies in front of The White House with Metallica’s Master of Puppets playing and it’s fantastic. Another segment would be a zombie attack scene in an Elvis themed hotel. It’s not a one shot take but it’s made to look like one but it’s great and creative which is definitely what the film needed. Double Tap is much more gory than its 2009 counterpart which is used for mostly comedic value which works most of the time. Overall, Zombieland: Double Tap has great acting and chemistry from the leads and some hilarious moments but it is a little too familiar to its 2009 counterpart and is mostly forgettable. I give Zombieland: Double Tap a 6/10."
    },
    {
      "rating": "2",
      "text": "Unfunny and annoying throughout.  I wish I could have the hour and a half of my life back"
    },
    {
      "rating": "4",
      "text": "If you watch the first film, this film will feel quite mixed because the joke will be easier to get to us (rather than for new audiences who are completely unfamiliar with the Zombieland storytelling concept) so watching it is more fun, but at the same time quite boring because there isn't much difference in plot of the character. Conversely, new viewers may not laugh too often, but rather enjoy the story and the adventures and characters."
    },
    {
      "rating": "5",
      "text": "Zombieland double tap review:10 years after one of the greatest comedic actors of our time was both mistaken for a zombie and shot dead, zombieland double tap delivers an averagely funny but slightly messy experience that feeds off of forced humor and references to the first film. 2009s Zombieland is perhaps one of if not my favorite zombie movies of all time, featuring hilarious performances from the likes of Woody Harrelson and Emma stone, but unfortunately the sequel doesn’t really live up to the hype. It has a lot of laugh out loud moments, but doesn’t manage to capture the essence of what made the first film so great which was the dynamic between such contrasting characters who were completely unfamiliar with one another. Sure they brought back many recognizable features of the original, such as a new version of zombie kill of the week and several reused lines, but it ultimately feels unoriginal compared to its vastly superior predecessor. There were other gaping flaws in the film, for example; right off the bat we are introduced to three new types of zombies who are each given their own introductions. Usually when these things happen in movies they serve a purpose, such as there being a scene later on in the film where the protagonists encounter these specimen, yet two of these three zombies are never again referenced for the rest of the movie. Another issue I had was with the new character Madison. The only reason she existed in this film was to introduce another style of humor, which is making fun of complete stupidity and it annoyed the hell out of me! This movie really suffers from that familiar sequel problem. It doesn’t live up to the original, not only because the original was so great, but because it feels like the whole film just didn’t need to happen. Aside from my many gripes with zombieland 2, the film isn’t bad and is certainly entertaining. You’ll never feel bored and it’s still very enjoyable throughout, and because of this I give it a 5/10"
    },
    {
      "rating": "2",
      "text": "I know its a comedy but its jokes are very much trihard ones, most of them fall flat and the relationship being the driving force behind this movie is very overused in films these days. The plot wasn't fantastic in the 1st one more so the chemistry only for it to be destroyed in 10 mins in this one. I don't care for the bimbo/hippies. Just infect me now I'd rather die."
    },
    {
      "rating": "6",
      "text": "Zoey Deutch is a fresh, fun addition to the cast. And it's nice to see Luke Wilson in a movie anytime. As for the rest, well, it's dull."
    },
    {
      "rating": "7",
      "text": "While movie itself was ok, I dont see much point in them making sequel if it ended up bringing not much new really. Plus what it did bring wasn't that interesting - like new types of zombies maybe couldve been good but they fought them off really easily still in the end. I mean movie itself was good but I think it didnt change much from first one."
    },
    {
      "rating": "2",
      "text": "Well I think we won't be seeing Abigail Breslin ever again and if God is good, we wouldn't be seeing Jesse Eisenberg and his Woody Allen lite stich again either, but I fear we will. Man this was hackneyed trite stuff indeed. I was nodding off it was so uninvolving. The Blonde Becky was the only half-decent character. Money grab plain and simple, not even an itsy bitsy bit funny. Hard to believe the 4 leads are all Oscar nominees and one Oscar winner, but there you go."
    },
    {
      "rating": "6",
      "text": "I just wanted it and no it's not bad. It's definitely not 3 or less /10.  I have no idea who these people are giving negative reviews. Did they even watch the  first one? What did they expect? Don't expect much from a sequel because it is does typical sequel-mistakes. The problem of the movie was underdeveloped, the story – half baked, -pace – not good, I could literally predict every single next step they would take, became boring but fun spectacle. The jokes would go for a little too long and the best parts of the movie were in the trailer ...The meta jokes were ok, I mean the self-aware shtick with movie works just not as good as before.Mid-credits scene was awesome.Yes, as a fan of the first one, I am disappointed but it's not a NEGATIVE review worthy."
    },
    {
      "rating": "6",
      "text": "All the freshness was lost but it was to be expected, even with the very long time gap between films. However the chemistry between the 4 main characters is still working and although it was natural to expect that the sequel would seek to expand the scale of the story with new characters and a bigger glimpse of their zombie world, the film manages to do it in a good way and it doesn't feel like an unnecessary addition.There's nothing special in Zombieland: Double Tap but it's good entertainment and if you liked the first one then the trip here despite the wait is still worth it."
    },
    {
      "rating": "6",
      "text": "I have to say that was a little underwhelmed. The movie was funny enough, but I was just expecting a bit more. For it to at least be as funny as it's predecessor if not more. A few random funny spots & some random stars and not much else. Definitely a rental flick in my opinion."
    },
    {
      "rating": "2",
      "text": "I waited upwards of a decade for this movie, I honestly at some point hoped they would just leave this franchise as a single movie hit and that's it, it didn't need any more screen time. But nonetheless they did make a sequel, and I was excited to at least be able to see something Zombieland related. Well I was wrong. Within the first 5 minutes I can tell that the humor hasn't matured a bit, like I'm cool with immature humor but this stuff was just like fart jokes and on the same level as \"attack helicopter\" jokes. I tapped out about 20 minutes after Madison was introduced, the last thing this movie needed was the most annoying valley girl type character to do exactly what you'd expect her to do. It was sad to watch, and now it makes me question if the first zombieland was even good in the first place..."
    },
    {
      "rating": "4",
      "text": "I like the first film enough, but there’s clearly a reason this took 10 years to get made. It looks ugly (the CGI and green screen would appear fake by 2009 standards) and the jokes are cheap and lazy. Disappointing, but not surprising."
    },
    {
      "rating": "4",
      "text": "I didn't like it. Sure it a sequel to one of my favorite movies of all time. Yet this sequel just fails my expectations. Felt underwhelming and out of place in 2019. If it wasn't a 10 year wait and more of a 3 year wait I would have been a bit more fogiving with the score. The script is very basic in my opinion and the ending or the climax was rushed out and didn't feel enjoyable to watch."
    },
    {
      "rating": "7",
      "text": "It's almost as fun as the first film. I enjoyed it more than I expected. The cast still has great chemistry, and the new cast members are decent additions to the mix. It doesn't do the mistake of taking itself seriously. It's a short, funny, and fun movie. It's not as fresh as the first one, I'll give that. I was never bored, so 'Double Tap' did its job."
    },
    {
      "rating": "4",
      "text": "This movie is so desperate to redo a lot of what the original did that it just ends up flat and awkward. The whole zombie kill of the year thing is a good example of this. In the original it was a quirky out of nowhere skit whereas here they do it about 6 times and not a single one is funny"
    },
    {
      "rating": "10",
      "text": "So only two of the 31 people that didn't like it bothered to say why?  Ahh, it seems that there is a small contingent of people review bombing this for its \"2009 misogyny\" - oh and some reviewers as well...  Don't pay attention to them, it is a fun movie, and pretty much more of the same - which is not the a bad thing."
    },
    {
      "rating": "8",
      "text": "This movie is getting unfair reviews. It is nowhere near as bad as some of these sheeple are saying. I loved the first one so it goes without saying that I enjoyed this one as well. The characters are back and their chemistry is better than ever. It's way funnier than the original and the finale was insanely over the top. Overall I loved this film. Was it perfect? No but it was still a very fun watch. Give it a chance before being swayed by these negative reviews."
    },
    {
      "rating": "6",
      "text": "This is one I'd been waiting for for 10 years, and I was pretty excited to catch up with these hilarious characters and their zombie-killing antics. And while it does have its enjoyable moments and throwbacks to the first, I simply found myself a little more underwhelmed by it than I anticipated. Maybe my expectations were a bit too high and I expected it to be slightly funnier, but I also felt as though the risks/stakes weren't as high in this one. Certain scenes/jokes also felt drawn out a little too much, and I was surprised at certain running gags from the first that didn't make it into this one (not a single mention of Tallahassee's love for Twinkies in this one.) On the plus side though, the four main actors all work great together once again, with some new funny additions and a cameo or two here and there that's pretty fun too (stick around till the very end of the credits to see what I mean.) Overall, it didn't quite live up to the first film for me, as it lacks a whole lot of new ideas and feels pretty straightforward, but if your nostalgia level from the first is pretty high, it should satisfy for the most part (seriously though, I hope I'm not the only one that's disappointed with the absence of the Twinkie joke with Woody Harrelson from the first film, cause I thought that was one of the funnier aspects of the first film!)"
    },
    {
      "rating": "8",
      "text": "I came here to see what people thought of this movie, and I am legitimately shocked that the critics score is so low. This was definitely a good movie, the story was solid. Sure, it's far fetched but that's how this movie is made in design. The comedy is great, and the action is solid too. I thought this movie was great! Even better than the first one. Don't listen to them critics."
    },
    {
      "rating": "3",
      "text": "This wasted some great acting talent  on a witless script.  It had the feel of bad improv, when you hear crickets after a weak line at the club.  No nifty comebacks in this script.  Appropriately, it was the witless blonde played by Zoey Deutch that provides the best laughs.  And boring, unless you care for countless ways to cause blood to spurt.  None of cleverness of the original, which I enjoyed very much.  Puzzling, since the writers and director are the same.  Very disappointing."
    },
    {
      "rating": "8",
      "text": "Where's the hate coming from? This movie is hilarious. Did you like Zombieland? Because this movie is true to its characters and continues their story. I see critcism of poor effects that I have no idea the source of. Critcisms of the ending or script? This is not meant to be a complicated movie, it is meant to satisfy with a serviceable plot, characters you can care about and some hilarious zombie killing.I liked the addition of Madison, I thought she was great. It can't be easy to pull off dumb blonde that outrageously and still hit all your comic marks that well.Maybe critics didn't like that the SJW asshat got told he was going to be the first to die. Or maybe they genuinely see bad where I see hilarious.Currently two of twenty-eight negative reviewers have bothered to say what they didn't like about the movie. What does that tell you about whether this is being review bombed or not?"
    },
    {
      "rating": "9",
      "text": "It's less of a story but more of the characters and I don't hate it. Zoey Deutch completely showcased her comedic chops here and will definitely be remembered as the highlight of the film"
    },
    {
      "rating": "7",
      "text": "When reviewing films, it's important to not just look at the film, but to take in what it's purpose is. I see that critics are not giving this nearly the same praise as the first, and why should they. BUT.... with that said, this is no ordinary sequel.  Double Tap has a certain satirical self-awareness that yes, it is a sequel, and kinda spoofs all the proper tropes and gags.  This is a film with no ulterior motives other than to keep giving what the audience of the first film would want. That would be zombie killing, quotability and great pop culture ref gags.  Zombieland Double Tap is a sequel yes... but it's not one that diminishes the work proceeding.  I'll go a notch higher with this forgiveness in mind and call it 7/10.  Woody always delivers.  And I must admit, there are a few LOLs to be had. It's a sequel that works, and works well.  With that said, if you're looking for something heady or thinky.... you're in the wrong place.  But you WILL have fun!"
    },
    {
      "rating": "8",
      "text": "A fun time at the movies. I was laughing the whole movie there was so many jokes even small subtle ones that you really had to pay attention to get. Not quite as good as the first, as the story lacked a little bit. A standout performance by one of my favorite actors Woody Harrelson. If your looking for a good laugh and some pretty wicked zombie killings definitely check this one out."
    },
    {
      "rating": "7",
      "text": "Zombieland: Double Tap is directed by Ruben Fleischer, same director of the first movie, and written by Dave Callaham, Rhett Reese and Paul Wernick, And starring Woody Harrelson, Jesse Eisenberg, Emma Stone and Abigail Breslin.Zombieland: Double Tap takes place a decade after the first one, and in the sequel the four slayers must face off against the many new kinds of zombies that have evolved since the first movie, as well as some new human survivors. But most of all, they have to face the growing pains of their own snarky, makeshift family.Zombieland was a great movie, I think it's one of the best zombie-comedies, it was really funny, and well-crafted with amazing performances and great cameos!Zland: Double Tap is another fun movie to add to the first one, it's still funny, charismatic, has good cameos and some cool zombie-sequences.The performances are great, everyone gave a great performance, all the new characters are welcome, but Breslin on the other hand isn't that good as she was in the first one, she's by far my least favorite part of this movie, I think she did a bad job in this movie, but fortunately she doesn't have lots of scenes as she did in the first one.Madison's character, played by Zoey Deutch, is that dumb character that could annoy some people, she's so cliched, but still she has some fine laughs during the movie, but most of her screen-time, I couldn't help it, I was so annoyed of her character.This movie is as simple as the first one was, and that's really good, because what made the first so one a cult classic, is that it wasn't serious nor grim, it was simple, funny and violent... The plot, which is a subplot in other movies, is delightful, it was really good to see them all reunited again on the big screen!Woody Harrelson is once again the MVP of this movie, just like how he was in the first movie, he's so funny and his character is still the one that has depth, even if it's lower than what we saw in the first one, but it's still so good to see that character again, and to see how they developed him, because sadly, there isn't that much of development in this movie over the first one when it comes to characters, there's even another runaway from the same characters, but I loved what they did to Tallahassee, and I'm so happy to see more of him!Fleischer did another great job directing this movie, he made some cool shots, for instance, there's a shot when a couple of moneybags were shot, and money started to flew in the air, and the character just passed beside it and didn't care, because it's Zombieland, what could money do to them? I think he really did a great job capturing this apocalyptic world, just like how he did in the first movie.There isn't really that much to say about a movie like this, it's just a zombie-comedy movie, and it did that really well, but it's not as cohesive as the first one, nor as good as it was, but still really enjoyable!The reason why the first one works better than this one is that the first one wasn't that much about zombies, they were there, but the movie focused more on our 4 main characters, and showed us how they're acting during those situations, this one here, cared more about zombies, and it gave them more character than what we needed.When it comes to flaws, beside the stuff I said above, I think it's not as sick, weird or silly as the first one was, it got a little bit self-aware, and that's not what we wanted to see from a zombie-comedy.Still Zombieland: Double Tap is a an enjoyable movie, if you liked the first one you would probably enjoy yourself in this one too, even though I would watch the first one over this one.I'm gonna give Zombieland: Double Tap a B.Thank you, guys as always for reading my reviews, and if you liked this, you can click on my name up above and see all of my reviews."
    },
    {
      "rating": "7",
      "text": "Zombieland: Double Tap is a good sequel to the original that manages to pack in some good action and humor. It is not as good as the previous movie, but it is still entertaining."
    },
    {
      "rating": "3",
      "text": "The movie actually put me to sleep. Not worth your money or your time. Jokes fail to land and the plot is nonsensical"
    },
    {
      "rating": "10",
      "text": "Ignore the overly harsh reviews. Honestly, this movie is true to the first and everything I expected. The action scenes were filmed beautifully, it pays respect to previous zombie films and even shout outs flaws with the zombie universe. The movie is a bit self aware and the comedy is very 2009, but it works for the movie and does it justice! There's a good amount of shout outs to the first films and all in all it's a fantastic movie. You'll definitely love it if you were a fan of the first!"
    },
    {
      "rating": "10",
      "text": "Just an awesome movie! I have enjoyed it. The movie makes you laugh, scare and even think of your own life. I do recommend this movie."
    },
    {
      "rating": "6",
      "text": "Much like the follow-up to their 2016 smash hit \"Deadpool,\" screenwriting duo Rhett Reese & Paul Wernick return to the world of a beloved film that honestly did so much for comedy, action, and the craft of screenwriting altogether; all to uninspiring results. Indeed, in a manner similar to that of \"Deadpool 2,\" \"Zombieland: Double Tap\" is at its best a decent doodle of the spirit and magic that drew laughs, gasps, and even tears for some back in 2009. Not an evocation. Not even close. At its worst, \"Zombieland: Double Tap\" is a shallow, comedically confused, narratively uninspired retread through jokes, plot points, and scares we've seen done better elsewhere. Like this film's predecessor, for one.Look, I get it. Writing movies is a rough racket. Especially when the film you're writing is the sequel to a movie as novel and as refreshing as the first \"Zombieland.\" You can't put that genie back in its proverbial bottle. It's impossible. But you could've either put more effort into delivering a solid follow-up anyway or opted for a more timely release. Or -- better yet -- perhaps you could've forgone the idea of a sequel entirely, simply succumbing to the time that's already slipped by."
    },
    {
      "rating": "7",
      "text": "Zombieland 2 is a strange beast that tries really hard to recreate the magic of the first film but ultimately does what every sequel does, adds far too many characters and copies some of the original plotlines. Not bad, just not great."
    },
    {
      "rating": "4",
      "text": "Es muy aburrida aunque la salva algunas escenas de acción y la comedia regular"
    },
    {
      "rating": "10",
      "text": "Really more of a 6 but just to help the unfair review bombing this movie is experiencing...first was definitely better though this was a fun film and had some good moments for suresadly the gag from the trailer re: the \"clinton administration\" was oddly not in the actual filmto echo MichelB - I definitely appreciated Little Rock's rack as well"
    },
    {
      "rating": "10",
      "text": "Loved it just as good as the first movie.  Good time today. Great o'Neil era and script development was fantastic."
    },
    {
      "rating": "7",
      "text": "Zombieland: Double Tap is almost as fun as the first film. It's about 10 years overdue but its still a solid sequel. The mid credits scene is fantastic, make sure you stay for that."
    },
    {
      "rating": "10",
      "text": "I loved this movie.  It was pretty hilarious.  I don't understand all the negative reviews either.  I loved the first movie and yes this one is different.  That's a good thing though.  Who wants the same thing all over again?  E.g. One guy is complaining that there was no mention of Tallahassee's love for Twinkies.  This movies takes place years after the first movie, which was right after the outbreak.  Twinkies would be long gone by then.  They are not going to last several years.  That ship has sailed.If you go into this movie looking for a repeat of the first, you might be disappointed, but if you go with an open mind, you'll love it.  That's how I feel at least.  Seriously... My jaw dropped to see all the negative user reviews.  I was completely surprised by them."
    },
    {
      "rating": "8",
      "text": "Nearly as good as the first. If you enjoyed the first you should enjoy the sequel. 7.5/10."
    },
    {
      "rating": "8",
      "text": "Fun!Zoey Dutch you stole the show and every single character does that too!lot of blood and fbombs real R rated flick true to zombie genre!"
    },
    {
      "rating": "8",
      "text": "Really enjoyed the movie highly recommend 8/10 I enjoyed how they addressed the time skip of 10 years"
    },
    {
      "rating": "10",
      "text": "Wonderful movie overall! The characters really expressed themselves in this movie and expanded their relationship. So much deeper meaning in this movie than people perceive it to be. For example the lack of Twinkie’s on this movie refers to Tallahassee  finding his true family in Z-Land. Along with his constant hate for vans also is a reference from the first film to when he expressed his anger. One more interpretation I picked up on was his despise for the pacifists is due to the loss of his family from the apocalypse. The only way he can express his emotion is through violence. Just something to think about but definitely a movie to enjoy!"
    },
    {
      "rating": "7",
      "text": "This was a pretty good sequel. Good cast, lots of laughs. Zoey Deutch killed it!"
    },
    {
      "rating": "10",
      "text": "Hi not a bot and i wasn’t paid to say this , maybe it was the joint i had before the movie but ...Every scene was hilarious i loved Jesse , Woody was fantastic, and Emma has a new fan i hated her for being in Spiderman but now we’re cool. Kid rock has huge **** that was nice.Amazing cameos who added didn’t take away from the movie lots of twists and turns it’s a comedy first thriller second Loved it"
    },
    {
      "rating": "0",
      "text": "First much better. Horrible ending, weak script. I expected much more from this sequel."
    },
    {
      "rating": "10",
      "text": "Great Movie does not deserve the bombing it is receiving. A great sequel to the first Zombieland movie"
    },
    {
      "rating": "9",
      "text": "For a movie we saw simply because our current movie wasn't playing at the time, this was an absolutely hysterical movie that I really liked. I don't really remember the first one but I'd fully recommend this to anyone needing a good laugh."
    }
  ]
}