{
  "id": 546,
  "title": "Zombieland",
  "starring": [
    "Woody Harrelson",
    "Jesse Eisenberg"
  ],
  "runtime": 88,
  "genre": [
    "Comedy",
    "Horror"
  ],
  "description": "Columbus has made a habit of running from what scares him. Tallahassee doesn't have fears. If he did, he'd kick their ever-living ass. In a world overrun by zombies, these two are perfectly evolved survivors. But now, they're about to stare down the most terrifying prospect of all: each other.",
  "releaseYear": "2009",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/dUkAmAyPVqubSBNRjRqCgHggZcK.jpg",
  "categories": {
    "plot": 6.958333333333333,
    "acting": 7.388888888888889,
    "ending": 9.0,
    "soundtrack": 5.0,
    "cinematography": 10.0,
    "familyFriendly": 3.0,
    "funny": 8.264150943396226,
    "action": 9.11111111111111
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Great zombie comedy/horror film besides Shaun of the Dead. Jesse Eisenberg is great and Woody Harrelson is funny."
    },
    {
      "rating": "8",
      "text": "Funny is a word that is utilized for stuff that are funny, and Zombieland can take part of the word and fuse it with action. Zombieland rivals Shaun of the Dead , so maybe both have similarities . But who cares, as long as you laugh you will be happy."
    },
    {
      "rating": "8",
      "text": "One hell of a zombie flick! Finally something innovative and new. This movie was amazingly well done and had GREAT humour! I enjoyed every minute of it."
    },
    {
      "rating": "9",
      "text": "More Funny Than Scary!\rStill A Really Good Movie!"
    },
    {
      "rating": "9",
      "text": "If you like Shaun of the Dead then you'll love Zombieland. It is the best zombie-film yet and as well as being filled with horror, gore and action it is also filled with comedy.\rOne great thing about the film which really stands out is the writers choice of characters. For example the main charcter, Columbus, (Jesse Eisenberg) is a very good charcter because he's scared of loads of things like the rags people use to clean tables. These silly fears that Columbus has make him seem weak and keep the viewer wondering if he'll survive Zombieland. Little Rock (Abigail Breslin) and Wichita (Emma Stone) are also great characters who keep you interested because they're not very trustworthy, which makes you wonder which is harder for the last survivors of Zombieland to trust eachother or for them to survive the flesh-eating zombies?\rThe film also shows you the personality of these charcters in a very unique and entertaining way. It shows the personality of Columbus in a funny and action-packed scene which ends with him being chased by a zombie. This chase scene is not only action-packed but also funny and very gory. The film also shows the personality of Little Rock and Wichita in a very unique and funny way which tells us what they used to do before the world got taken over by zombies. This scene is funny but there is no action or gore in it which the viewer might be expecting after they've seen the gory way Columbus' personlity was introduced. So this scene is funny but it can leave the viewer feeling unsatisifed.\rThe film's plot is also quite simple which stops the viewer from feeling confused and lost. The plot is that the world has been taken over by zombies and Columbus is one of the last survivors. Soon Columbus finds Tallahasse (Woody Harrelson) who is also a great character because he is seen as a man who is hell-bent on killing zombies and also has a big weakness. Together they find Little Rock and Wichita just after an exhilirating fight scene between Tallhasse, Columbus and three hungry zombies, who are trying to get to a place which is rumoured to have no zombies in it.\rBut one bad bit of the film is shortly after the scene where the gang decide to live in Bill Murray's house. After this scene the film gets very slow and starts to lack action. Although during these scenes the film does try to keep the viewer entertained by throwing in a few funny jokes.\rOn the other hand the end scenes of the film more than make up for this boring mistake. During these last scenes the viewer is kept on the edge of their seat by the thrilling chase scenes which are made even better by the magnificent special effects. These scenes re-emphasise how dangerous Zombieland is and leave you wondering if the four will survive.\rI would give this film 9/10 and I defintely would recommend it to fans of Shaun of the Dead and other horror/comedy films."
    },
    {
      "rating": "10",
      "text": "The greatest comedy of the decade!! Forget the Hangover. I've never seen a zombie movie before, but after watching this, I've become addicted to them!! A fun blast, this movie has many awesome factors. Right from the start, it plunges you right into the simple but hilarious plot. After explaining the hilarious rules, it shows some of the best slo mo I've ever seen. Then, it shows you the characters and launches you into the story. First off, the cast is brilliant. The badass Woody Harrelson, the nerdy Jesse Eisenberg, the smoking hot Emma Stone, and the sassy Abigail Breslin all bring comedy and heart to this movie. Second, the script and dialouge are witty and hilarious. Third, the gore and action are great. The ways they figure out how to kill the zombies are original and hilarious!! Overall, standing out as its own movie rather than just a Romero tribute, Zombieland features a great cast, a great script, and great action than makes it a total blast!!!"
    },
    {
      "rating": "9",
      "text": "World taken over by Zombies, surviving teenager gets ride from Zombie killer, goes after Twinkies, meet some girls, Zombiefest!Very well done comedy horror (people are calling it the US Shaun of the Dead) with an excellent script, great set pieces and OTT gore.Never takes itself seriously, moves at a decent pace, killer cameo & has a tremendously good soundtrack."
    },
    {
      "rating": "9",
      "text": "The humor in this movie makes up for the lack of a plot and therefore i give it a 9 because the humor is everything in a movie and i love it but i deducted a point because the plot wasn't very good and i gave it a 9 because Tallahassee is awesome and i love columbus he is a nerdy little spit *#%$ and i love him for that and the humor in this movie is really good"
    },
    {
      "rating": "9",
      "text": "Zombieland: A darn good zomcom From the opening moments, you know this film is gonna be one fun ride. Zombieland shows the ongoing zombie apocalypse, from the point of view of four characters. Nervous Columbus is the typical unlikely hero, but he and his list are entertaining to watch, especially when the many items pop up at various places throughout the movie. Woody Harrelson basically steals the film as gun-toting, Twinkie loving Tallahassee. His dialogue sparks. The revealation that he lost his son really makes you feel for the character. The sisters, Little Rock and Witchita, run cons on the two males many times through the movie, with them stealing the boys trucks three times. Their chemistry really sparks, and you believe that these two could be sisters, as they set off through the zombie wasteland to visit the theme park they enjoyed back in happier times. And the cameo! Bill Murray appears, scaring Tallahassee and Witchita as he pretends to be a zombie. His cameo was seriously genius, making you laugh throughout all of his scenes. Tallahassee going all geek boy during meeting him is funny as, with them smoking from a bong, to dressing up as ghostbusters. Shame Columbus accidently shoots him, thinking he was really a zombie. To be honest, if Zombies do infest the world, there should be a lot more. Especially running to Tallahassee when hes unloading bullets after finding the redneck truck. Also, some of Columbus' early dialogue had me cringing a bit. The finale: Fighting zombies at the amusement park, from Talahassee on the rollercoaster to locked in the booth whilst surrounded, this ranks up there with the best film zombie fights. Gotta love when the zombies chasing after Columbus get hit by the swinging ride (dunno its name). And the zombie clown. Win! All in all, this was a brilliant zombie film. If it wasn't for Shaun Of The Dead, this would be the best zombie comedy film. Oh well"
    },
    {
      "rating": "10",
      "text": "This movie is a must see for any and all zombie fans. There is wonderful camera work, chemistry between the actors and some fantastic zombie effects. Let's not forget the generous nods to great horror flicks of old, and a very special cameo. It's fun and witty, and is one of my new favorite films. Go see this, it is worth every bit."
    },
    {
      "rating": "9",
      "text": "While it misses some opportunities to be funny, it's still a fantastic zombie movie do to the actors, they actually are believable because they act like real people (except maybe Tallahassee), this is still one of my favorite zombie movies, and a must see for fans of the genre."
    },
    {
      "rating": "10",
      "text": "Maybe if comedy movies are like this, critics will respect its genre and can get a highly positive review. Every elements in this movie is perfect. All casts ensemble each character in a great way. The zombies were funny and scary. Its very different to all zombie movies, maybe because it is comedy. No thanks to movies of Jason Friedberg and Aaron Seltzer because its kinda rough and stupid. \"Zombieland\" is better than \"The Hangover\", I can say. I hope the sequel will still average the goodness of its predecessor."
    },
    {
      "rating": "9",
      "text": "ZOMBIES! What else do you need to know? Has to be one of the best zombie flicks out there. AWESOME music, AWESOME cast, AWESOME effects. Dont get much better then this. If you like blood and zombies then this is purely right down your alley."
    },
    {
      "rating": "10",
      "text": "Twinkies, zombies, Woody Harrelson playing a total badass and two hot chicks. Plus a nerdy computer geek. What could possibly go wrong. When I first saw the trailer back in 2009, I thought it was just another dumb comedy movie, but instead I was given eye candy every minute, and loved it enough to include it in my countdown of my top favorite movies of all time. Ruben Fleischer should receive a medal. In the words of Tallahassee, time to nut up or shut up!"
    },
    {
      "rating": "9",
      "text": "hahahahahahahahahahahaahahahahahahahahahahahahahahahahahahahahahahah funny movie.  Jesse eisenberg is great.   woody harrelson always will be great.  Bill Murray was hilarious."
    },
    {
      "rating": "10",
      "text": "Completely innovative and refreshing using a completely stale and unimaginative setting -- a Zombie Apocalypse.  The character development was satisfying and the comedy was very entertaining.  This is still one of my favorite comedies in my 22 years of living.  The chemistry between Harrelson and Eisenberg is one that I hope to see again in the near future."
    },
    {
      "rating": "10",
      "text": "All I can say is, firgin hilarious!!!! Very quotable. I find myself accidentally reciting lines from this movie all the time. Good flick to own and enjoy more than once."
    },
    {
      "rating": "9",
      "text": "A great zombie movie, who knows comedy and horror merge in the right dose, no words to describe, everything fits perfectly in this film, you want excitement? watch this movie, you want comedy? watch this movie, you want to terror? watch this movie!"
    },
    {
      "rating": "10",
      "text": "Finally something has come along to rival the brilliance of Shaun of the Dead. Zombieland stars Jesse Eisenberg, Wood Harrelson, Emma Stone and Abigail Breslin as they embark on finding a safe zone away from their post-apocalyptic nightmare, but all the trouble isn't necessarily from the undead.\rEisenberg narrates an ingenious script, outlining different ways to stay alive, such cardio, in other words out-running the undead, all these 'rules' run throughout the film and are simply hilarious, another being to enjoy the little things of there no longer being any rules on earth.\rEach character is never properly named in the film, instead being named after where they are from or going to, Eisenberg is Columbus, who runs into Tallahassee (Harrelson), a larger than life man who appears to have been anticipating such an occurrence, he is longing for a Twinkie, and will not stop bashing the heads of obese zombies until he finds one.\rThey run into Wichita (Stone) and Little Rock (Breslin) who are con artists, and quite good at it. They manage to steal the two mens truck, but it is short lived and they all end up embarking on a journey to Pacific Playland in LA, allegedly free of zombies.\rZombieland combines all the apocalyptic elements of a zombie film but sweetens the film with excellent comedy and wonderfully timed acting.\rHarrelson is brilliant as Tallahassee who is endlessly searching for the one Twinkie, but he also holds a different secret that is torturing him inside. The only performance to rival is brilliant and comedic turn was that of Bill Murray, who has an out of this world cameo as himself, it is just laughter perfection.\rIt raises the barrier and takes away the doom and gloom for a while and almost seems to fulfil a bucket list type film that shows what people would like to think they would do when the world was plunged into chaos, wreck shops, steal cars etc.\rThe film doesn't change anything in regards to the genre itself, but its brings forward a ver welcome attempt to humorously describe how different people may react to such an occurrence.\rDefinitely one of the standout comedies in a while, one that has the heart and soul of characters but with a very surreal genre of how this development comes around, and of course a wonderfully funny Bill Murray cameo."
    },
    {
      "rating": "10",
      "text": "this movie was awsomely funny it deliverd in every way possible. im glad i payed to see this movie. it had action, comedy, and cutegirls how could any other movie be this good.... beside the Scream Franchise"
    },
    {
      "rating": "10",
      "text": "I love the idea of the movie, it is definitely aimed for teenagers and that's what I am. This is the best zombie comedy out there (I don't take this as a horror movie) with it's stereotypical faces and outstanding storytelling (I fell in love with the style).I didn't wait this movie to be so good when I first time saw it, actually I was shocked about how good it was, I'm an old school zombie movie fan, I mostly watch Romero's movies, but when you have watched them, there's no helping it. And another plus is the rewatching bonus it gives, this is a movie you can watch alone, with friends or even with family, and it does always give good laughs."
    },
    {
      "rating": "10",
      "text": "A phenomenal film which belongs in the same league as Shaun of the Dead when comparing horror/comedies. Woody Harrelson was fantastic as was Jessie Eissenberg. They complement each other very well and obviously are juxtaposed to Emma Stone and Abigail Breslin. I thought that the pacing as well as the emotional arc suffered by a few of the characters really suited the film. This will surely become an all-time classic."
    },
    {
      "rating": "10",
      "text": "In my opinion this is the perfect film. There is comedy, action, sadness, romance and bromance all rapped up with a well acted believable cast with a well thought out plot to entertain anyone that isn't a complete idiot. I understand that everyone's taste in films is different but anyone who puts rates this film any less than a 7/10 clearly has some personal issues with something associated with the film and needs to be ignored because the film itself has very few flaws. I'm not going to list flaws because if I do you will just spend the whole film looking for them and you won't be able to enjoy it properly. I'm not usually one for watching films more than once or twice unless they are very good but I've watched this one at least a dozen times which shows that this is truly the most entertaining film you will see for a long time."
    },
    {
      "rating": "10",
      "text": "Utilizing a killer blend of exceptional humor and eye-catching violence, \"Zombieland\" is an immaculate modern comedy featuring some utterly lovable characters."
    },
    {
      "rating": "9",
      "text": "A solid comedy blended nicely with Horror to make one heck of a film! I've seen it quite a few times now but it never gets old and it is thoroughly entertaining despite only really featuring four characters, all whom do a great job. There is enough clever comedy in there to keep you laughing, as well as watching out for the zombies ready to give you a good jump! It won't be a film for everyone, but I think it's one that most would find it hard not to enjoy!"
    },
    {
      "rating": "8",
      "text": "100% still holds up. Here's a list of things this movie had that Double Tap didn't, with examples.1. Well written comedy with good timing- Intro rules sequence with varying locations and examples of broken rules- Columbus chase around the gas station- Grocery store clearing- Entire Bill Murray sequence2. Actually heartfelt moments with emotionally driven characters- Columbus having to kill his neighbor, \"406\"- Enjoy the little things Native American shop destruction montage- Tallahassee's dead son reveal- Columbus/Wichita bonding scene- Columbus 'Be A hero' moment3. Fun and visually exciting action set pieces- Killing 406 with bathroom items scene- Intro rules sequence- Entire carnival sequence Is it cheating to set your final set piece sequence in a carnival? Maybe. It still makes for some great moments, though. So much praise for this movie."
    },
    {
      "rating": "7",
      "text": "Enjoyable zombie movie! Not too gross nor too intense!Everything seems perfectly fit! Enjoyable! Tbh, a zombie is never my preference coz usually has too much blood & too intense. BUT, this movie hits me differently.Zombieland is a worldwide situation where almost everyone becomes a zombie. Then, the movie's main plot is to survive zombies whether alone or together.In the beginning, it's a typical movie intro with running text to display actors, actresses, directors, producers, etc. Rarely love this, but I love this one. Then, I love movie narration too, which is consistent and easy to understand. The chars are also well-developed & well-performed.Besides, the visuals are also great, not too offensive or too much blood. And, the fresh jokes with a few bit dramatic scenes which are good. Almost everything is funny and appropriate. Lastly, this movie is very short, only"
    },
    {
      "rating": "9",
      "text": "Zombieland is a very funny horror comedy similar to Shaun Of The Dead. The movie is America's version\rof Shaun Of The Dead basically. The cast is fabulous in their roles and the movie never hits a dull or\runeven moment. Definitely one of the best horror comedies in years."
    },
    {
      "rating": "3",
      "text": "Zombieland was an utter failure. Saying that it was bad or tired or bland or uninteresting doesn't go far enough in expressing how poor a film it is; it flat-out fails on every generic level which could arguably be ascribed to it. It's not quite a road movie, it's about half of a teen comedy, and it's miles fucking away from what could be considered a proper, or even satirical, zombie flick. It seemed like nothing so much as a desperate attempt to cash in on a niche trope that's experienced something of a renaissance in recent years; the filmmakers obviously had no love for nor understanding of the things that make the genre great. Everything that made Shaun of the Dead so smart and sharp is missing, and what you're left with is a nutless 90 minutes that sort of disinterestedly wanders toward a conclusion without a sense of its own narrative stakes. Which is pretty appropriate, actually, because Zombieland doesn't have stakes. To have stakes you have to follow your film's internal logic, play by the rules you've set out yourself. It never even comes close. There's a cameo smack in the middle of the film that's good for ~10 minutes of chuckles, but the rest is basically filler. In a bad zombie movie, you're at least due some good gruesome fun, but Zombieland doesn't even deliver in that department. And the gratuitous use of the Z-word (and the movie's title, which I think is repeated two or three dozen times) drove me fucking batty."
    },
    {
      "rating": "10",
      "text": "With Zombieland's incredible cast, and its cool, visual style, and Zombieland managing to be funny, scary, and a great action movie. Zombieland brought life back to the Zombie genre. I give this movie 96%."
    },
    {
      "rating": "7",
      "text": "\"Zombieland\" is a rare movie that actually criticizes the world with its laughs and scare. It's a movie you would despise first and love later."
    },
    {
      "rating": "0",
      "text": "Not scary, not funny. Another geek-love movie that roll out like the all too self-assured romantic comedies of worse years."
    },
    {
      "rating": "1",
      "text": "Whoa, this one sucks ass! Zombies in this film: bad actors with gore makeup shouting and grinning like idiots. They didn't feel like real menace. Wimpy main character also annoys the shit out of me, and makes this movie again less believeable. No way in hell someone like him could survive more than a day... \"Fat ones died first\". What about nerds with poor physical shape who fuel up with coke and cereals? Jokes were stupid and not funny, they made me dead serious It all just feels too Hollywoodish... see Shaun of the dead, it got it right."
    },
    {
      "rating": "0",
      "text": "This movie was terrible! It is another cookie cutter movie based on over-done big hollywood cliches. It drags, the plot is boring. This movie sucks!"
    },
    {
      "rating": "1",
      "text": "Not scary, not funny. Another geek-love movie that roll out like the all too self-assured romantic comedies of worse years. I'm sure people love this film since there are great actors in it doing the best with a dumb plot. I wanted to leave early. OVER-HYPED."
    },
    {
      "rating": "1",
      "text": "Let's face it. The Net has been taken over by marketing a-holes. We can believe neither so-called serious critics, nor \"the public\". This movie, in truth, deserves a 5 or 6 but I wanted to lower the rating. It's not terrible, it's just so-so. But after all the hype I was hoping for something better. As a comedy zombie flick it just doesn't bring it home. So aimless, so lazy, so lame. Watch Shaun of the Dead if you want to see it done well. To its credit, the cast give 100%. The DP is pretty good, too. The director and writer should be shot at dawn., if not before And as for those damn marketing b*stards? Shooting them would be a waste of good bullets. Oh, and Bill Murray? He's fine. But this little cameo ain't gonna be appearing on any \"greatest moments\" show, believe me. How I wish I could earn his fee for wandering on-set in silly makeup and slurring three or four lines! Truly, 2009 has been the worst year for movies in my entire life."
    },
    {
      "rating": "10",
      "text": "One of the most entertaining movies i've seen in a long time. Along with a great cast comes a simple yet very funny and spectacular plot. Continuous laughter and fun. Very good movie."
    },
    {
      "rating": "9",
      "text": "A little cliche? Sure. But Zombieland is one hell of a good time, in fact, one of the best comedies I have seen in a long time. Thanks to a strong cast and characters, awesome action, awesome dumb slapstick as well as smart dark humor, it is ingenious and entertaining. See it"
    },
    {
      "rating": "7",
      "text": "I think the movie is a tad overrated in some aspects. It's a good movie, but not THAT good. It's got what you would expect from a zombie movie, blood and guts and weapons and YES, zombies! The bad thing is for me, this is not a  film that I could watch again and again. The storyline is okay and some parts are quite funny, but the moments aren't as good anymore when you watch it for a  second time, which is disappointing. A good zombie movie, though there are better ones out there."
    },
    {
      "rating": "8",
      "text": "Who would have thought this would be so good?! It is hardly scary - there are a few scenes, but overall it is rather comical, actually. A very smart comedy, with excellent dialogue and some rather funny plot. The performances are pretty decent, and Bill Murray's cameo performance definitely stands out as one of the most memorable parts of the film. Very funny comedy, worth while!"
    },
    {
      "rating": "2",
      "text": "It's basically a rip off of Shaun Of The Dead but not as clever, witty or original."
    },
    {
      "rating": "5",
      "text": "Initially enjoyable undead farce, but loses pace mid way and descend into looney-tunes denouement. The appearance of Bill Murray is an entertaining novelty, but is hardly 'genius' parody."
    },
    {
      "rating": "6",
      "text": "As you might expect for this genre, it's quite gory, so don't go expecting a light 'R' rating. But if you can handle some bloodshed, no, make that a substantial amount of bloodshed  but perhaps I should add in a comic environment  there's some pretty funny stuff here. Woody Harreleson and Jesse Eisenberg make an amusing odd couple and Emma Stone was fine for this material, although she and Abigale Breslin had slightly less to do."
    },
    {
      "rating": "3",
      "text": "Its ok but far from perfect. While the premise of the film was good and the first few minutes were good, It all goes swiftly down hill and actually gets really really boring."
    },
    {
      "rating": "3",
      "text": "A sick and stupid film. Zombieland tries to be funny but just comes across as a  stupid movie with lots of gore. Nothing different then any other zombie movie except this one tries to be funny. What a shame."
    },
    {
      "rating": "2",
      "text": "1 point for super slow motion, 1 point for \"he just kills me\". Otherwise, crap."
    },
    {
      "rating": "3",
      "text": "This movie was not funny at all. Who cares if Bill Murray was in the film? i dont. Woody's character did not make me laugh one time. After the first five minutes of the movie it became nothing more than trash. Shaun of the Dead is the best comedy zombie flick ever made and this movie did not even scrape the surface of that one. Barely any zombies in the film, mostly about some punk from the movie Adventureland that is not funny at all, he is horrible. It is a love story in a way. i was not impressed at all."
    },
    {
      "rating": "0",
      "text": "First 20 minutes were spectacular, after that it just kinda fizzled in a lame contrivance of yet another boy meets girl story with a frontman more feminine than his love interest."
    },
    {
      "rating": "10",
      "text": "A lot of fun."
    },
    {
      "rating": "3",
      "text": "The perfect film for the 12 to 16 year old male who has no social life and no girl friend.This just happens to be a character in the film as well. Even for a zombie movie this seems pitifly stupid.Does Woody Harrelson have any decent films to his credit besides No Country For old Men?"
    }
  ],
  "recommendations": [
    "shaun_of_the_dead",
    "scouts_guide_to_the_zombie_apocalypse",
    "the_babysitter",
    "hot_fuzz",
    "army_of_darkness",
    "zombieland_double_tap",
    "cabin_fever",
    "cooties",
    "deadpool_2",
    "baywatch",
    "deadpool",
    "22_jump_street",
    "crank",
    "piranha_3dd",
    "scream_4",
    "minions",
    "scary_movie_2",
    "the_hangover_part_ii",
    "guardians_of_the_galaxy",
    "scary_movie_4",
    "this_is_the_end",
    "the_happytime_murders",
    "paul",
    "ready_or_not",
    "thor_ragnarok"
  ]
}