{
  "id": 14,
  "title": "Zone 414",
  "starring": [
    "Guy Pearce",
    "Matilda Lutz"
  ],
  "runtime": 98,
  "genre": [
    "Science Fiction",
    "Thriller",
    "Mystery"
  ],
  "description": "In the near future on a colony of state-of-the-art robots, a private investigator is hired by the colony's creator to bring his missing daughter home.",
  "releaseYear": "2021",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bJIq2UwwrrVP033Mk3G5paUwYnp.jpg",
  "categories": {
    "plot": 4.555555555555555,
    "acting": 4.0,
    "ending": 7.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 3.0,
    "funny": 5.0,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "7",
      "text": "Zone 414 is a science fiction film of the noir-film-noir genre with a twist of steam punk.I wanted to watch this film to see whatever Travis Fimmel came up with for his Marlon Veidt character - and, I was not disappointed.The plot is yet another take on android existential angst.  For me that is something that never gets old - but, perhaps for some it is difficult to continue probing that metaphysical riddle once again.  From my viewpoint it is the question - for others it is a \"whatever\"... please get to the next car chase scene, relationship conflict, etc.The concept of androids has been used as a plot device since the 1700s.  I remember finding a 1950s science fiction anthology at my local library when I was 10 years old.  The philosophical issues it generates has always fascinated me.  Obviously, no one is going to deliver any breakthrough insights on something that has been analyzed thousands of times. But Zone 414 generated a fresh angle from my perspective - and I've seen this plot device hundreds of times.The acting is off-beat.  The directing is off-beat.  The casting is superb.  The story and script are intriguing.  The production values are in line with its smaller budget.Obviously, this is a thinking person's kind of film and does not fit into the purely recreational category."
    },
    {
      "rating": "3",
      "text": "Zone 414 is a film that could perhaps use as a defense, or rather as an attribute that it doesn't look as cheap as its budget might make you think. After all, that may provide it a larger window of attention.However, in the end, that will turn out to be pointless, because its narrative attributes are just boring and completely predictable."
    },
    {
      "rating": "5",
      "text": "(Mauro Lanari)This $5 million budget debut by Baird rivals Villeneuve's remake and its $150 million budget: a B movie that would have held its own very well if it hadn't been ruined by a poorly finished script."
    },
    {
      "rating": "1",
      "text": "I like AI powered robots, and I like cyber punk, so it should have been a low bar for this movie to entertain me. It didn't. It was boring, predictable, and all the characters were uninteresting. But what really upset me was how it choose to keep to the brain-dead trend of making robots EXACTLY like humans. A lot of shows do this now. They make robots look and act exactly like humans to the point that, to use this movie as an example, they cry, they resent their place in life, they hate their jobs, and need a little \"me\" time to relax and get through the day. Almost nothing seems to separate them from people or makes them different. I think this all lacks imagination and creativity when it comes to AI and robots. It's the lazy way out for science fiction movies as make up artists don't need to do anything drastic, actors don't need to imagine not being a human, and the story writers get to use the word \"robot\" for their story and call it \"science fiction\". If we really want to push the concept, then I would ask, If we could design AI or the mechanical figure of it's body, why would we need to make them exactly like us? Why could they not think or look entirely different? Imagine an AI purposefully programmed to love a terrible day; the worse it is, the happier it gets. Or maybe one is programmed to think what is considered ugly is beautiful and vice versa. We could also imagine it's body differently. Why must it have a body with two arms, two legs, and a head? Perhaps it could have 3 arms, 5 legs, the body of an ant, and the head of a cat (actually, don't make that. That sounds creepy) The ideas are endless, and some good science fiction writers have come up with many good ones. The creators of Zone 414 did not and the movie falls into the heap of sci-fi that is labeled for the uninspired, and uncreative."
    },
    {
      "rating": "8",
      "text": "beautifully made neo-noirdont understand all the negative reviewsstunning cast and echoes the world of cyber punk"
    }
  ],
  "recommendations": [
    "lucy",
    "prometheus",
    "sunshine",
    "europa_report",
    "annihilation",
    "monsters",
    "time_trap",
    "the_cloverfield_paradox",
    "snowpiercer",
    "avatar",
    "arrival",
    "the_last_days_on_mars",
    "mortal_engines",
    "coherence",
    "the_core",
    "the_tomorrow_war",
    "district_9",
    "science_fiction_volume_one_the_osiris_child",
    "source_code",
    "elysium",
    "interstellar",
    "the_first_purge",
    "the_girl_with_all_the_gifts",
    "the_midnight_sky",
    "anon"
  ]
}