{
  "id": 3861,
  "title": "Zoolander",
  "starring": [
    "Ben Stiller",
    "Owen Wilson"
  ],
  "runtime": 90,
  "genre": [
    "Comedy"
  ],
  "description": "Clear the runway for Derek Zoolander, VH1's three-time male model of the year. His face falls when hippie-chic Hansel scooters in to steal this year's award. The evil fashion guru Mugatu seizes the opportunity to turn Derek into a killing machine. It's a well-designed conspiracy and only with the help of Hansel and a few well-chosen accessories like Matilda can Derek make the world safe for male models everywhere.",
  "releaseYear": "2001",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/7J0ny1bbWO1II7KMquzE7iB3rP8.jpg",
  "categories": {
    "plot": 6.368421052631579,
    "acting": 6.117647058823529,
    "ending": 7.333333333333333,
    "soundtrack": 7.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 6.647058823529412,
    "action": 5.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": ":;:;:;:;:;:;\";:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;:;::;:;:,,,,,,,,,,,,,,,,..............☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆☆"
    },
    {
      "rating": "7",
      "text": "Zoolander was funnier than most comedies iv'e seen made in the past decade. Occasionally, you need to leave reality behind and just have fun at the movies"
    },
    {
      "rating": "7",
      "text": "Zoolander is a hilarious satire on the fashion industry. Ben Stiller does a great job and so does Owen Wilson but the real scene-stealer is Will Ferrell. He was just hilarious. I did find that it had a bit of a slow beginning but it produced enough laughs to make up for that. Ben Stiller's performance as the film's clueless main character was fun to watch and might just be his best role to date. David Duchoveny's cameo was also very funny. If you don't like these \"deliberately stupid\" comedies, then this isn't for you but if you do, I'd recommend it. Let's hope the sequel lives up to the hype!"
    },
    {
      "rating": "10",
      "text": "A very good comedy with a lot of funny actors. And too all the comments calling this a social message, ITS A FREAKING COMEDY MOVIE, if you take this seriously then there is something really really wrong with your head its meant to be funny and not to be taken seriously, were all looking at you \"Poor K.\""
    },
    {
      "rating": "7",
      "text": "Good and entertaining movie. Certainly plenty of funny moments complimented with an interesting storyline and good performances from the quite star-studded cast (Stiller, Wilson, Farrell)."
    },
    {
      "rating": "8",
      "text": "Quite possibly the greatest comedy Ben Stiller has ever starred in, \"Zoolander\" finds itself within a hilarious middle-ground between goofy and satirical."
    },
    {
      "rating": "7",
      "text": "Although slightly disappointing, 'Zoolander' is still a fun comedy to watch in your spare time. It starts out a little slow, and most of the LOL jokes come in slightly later in the movie. Also, the story meandered from time to time, especially towards the end.\r In short, 'Zoolander' is a relatively funny flick to watch in your spare time, but not necessarily something to put a day aside for."
    },
    {
      "rating": "7",
      "text": "Zoolander is a hilarious satire on the fashion industry. Ben Stiller does a great job and so does Owen Wilson but the real scene-stealer is Will Ferrell. He was just hilarious. I did find that it had a bit of a slow beginning but it produced enough laughs to make up for that. Ben Stiller's performance as the film's clueless main character was fun to watch and might just be his best role to date. David Duchoveny's cameo was also very funny. If you don't like these \"deliberately stupid\" comedies, then this isn't for you but if you do, I'd recommend it."
    },
    {
      "rating": "7",
      "text": "I'm only here because of Zoolander 2. Zoolander actually works to be a better comedy workout for your average movie collection. Hoping Zoolander 2 can be this good as the first one."
    },
    {
      "rating": "6",
      "text": "This movie somehow ends up being funny and good. I don't know how Stiller pulled it off though, managing to eke out a watchable movie out of one of the weirdest plots I've ever experiences and the blatant cultural offense. Actors give convincing enough performances (for the most part), but Ferrell is great. Overall, an ok movie."
    },
    {
      "rating": "2",
      "text": "This movie isn't worth watching. It's boring and the jokes made throughout the film don't land. Most of the jokes play off of the character Zoolander being idiotic because of his status as a fashion model. There is an uncomfortable threesome scene, not heavily graphic, but not done well and seems to also be used as a comedic device. If you enjoyed Anchorman or Dodgeball, I would recommend this film for you."
    },
    {
      "rating": "9",
      "text": "Award winning male model Derek Zoolander suddenly finds his world turned upside down when his 4 year run as Male Model of the Year comes to an embarrassing end thanks to his rival Hansel. His three best friends are then killed in a freak accident. Seeing his opportunity crazy fashion designer Mugatu plans to brainwash him into murdering the Prime Minister of Malaysia in order to stop new child labor laws being introduced. This being a Ben Stiller Movie it will come as no surprise to learn that the rest of the film is just as ridiculous as the plot suggests. Not every joke completely lands but there are arguably as many laugh out loud moments spread throughout this film as any other I can think of and some excellent cameos, such as David Duchovny as an ex-hand model, also help keep the laughter flowing.    Of course the film won’t be to everyone’s taste but as long as you don’t go into this movie expecting anything other than a slightly bizarre, but very funny, comedy you won’t be disappointed."
    },
    {
      "rating": "9",
      "text": "Over-the-top characters, an absurd premise, and \"stupid\" humor are all present here. However smart satire keeps the while thing afloat. Ben Stiller (who wrote and directed this as well) has crafted a hilarious movie. One that does go to goofy extremes to get it's laughs, but succeeds because of it. I also can't help but love the plethora of great cameos.\r My total score for the movie is a 9.3/10."
    },
    {
      "rating": "7",
      "text": "Zoolander is one weird movie, but you have to admit, it's insanely hilarious. The storyline is good, but for a short movie, it getsthrown in different directions. The characters do make-up for the story's off guide. They may be stupid, but they seem to put a smile on our face, especially Ben Stiller (Derek Zoolander) and Will Ferrell (Mugatu). Even though Ben has his funny moments he also has his retarded moments, but c'mon, you got to enjoy his idiotic performance. Overall, for a short movie and a weird storyline, you'll still enjoy this silly comedy."
    },
    {
      "rating": "9",
      "text": "hrrhhtyjndyngnryryjjryryjryergfqeertenetrthytmtukkututiutjnrydthrewfasfwrgethtrykuttuk"
    },
    {
      "rating": "7",
      "text": "Zoolander is full of classic comedy actors that are at their top of their game. Of course this film is a little stupid but it makes up for being funny. I'm looking forward to the long awaited sequel to this film. Ben Stiller and Owen Wilson are at their buddy comedy best in Zoolander."
    },
    {
      "rating": "7",
      "text": "I do give this movie points for trying to do something a little different. Yet, as usual, Stiller comes off a bit to dry and his performance feels forced most of the time.\r But him aside, the premise is interesting, the humor is childish but entertaining and the characters are something different.\r Overall:\rThe movie could have used a stronger lead and someone who can do physical comedy (Stiller can't.) Other than that I still enjoyed the movie and it was something different."
    },
    {
      "rating": "7",
      "text": "good music up in here. Liked the movie, stiller is    always good"
    },
    {
      "rating": "0",
      "text": "Watching this movie was a deeply sickening experience that will haunt me to the day I die (and maybe in the after-life). I can't believe none of the reviews I read took the movie to task for the unbelievably naive, stupid, ridiculous, misleading, dangerous ideas it espouses - all the while pretending to be a feel-good do-good movie. I cannot fathom the self-serving diatribe against 'sweat shops' in developing countries. Sure, it might benefit some of the lower skilled workers in rich countries if we stopped buying from third world countries, but what happens to those third world country workers after the factories close down??? This movie has an even more outrageous and mind-numbing solution, pass a law in third world countries raising pay for everyone! Oh horray horray! How simple! So all the poor developing countries in the world could become instantly rich and prosperous overnight if their government would only pass a law mandating that everyone should get paid a million dollars a day! Wow! I have seen the light! What a sure and solid grasp of economic fundamentals! And why don't all the governments of the world just do this? Surely it would ensure the undying gratitude and votes of the masses that would ensure you stayed in power forever. You would go down in posterity and people would be naming their grandchildren after you long after you've passed away! So why not? Because they are getting pressure from evil big business? The convenient bogeyman and favourite bad guy of simplistic and morally smug movies from Hollywood. Oh it all makes sense now! Really, movies have their role as entertainment, but when they get into deep social messages - they usually do more harm than good."
    },
    {
      "rating": "7",
      "text": "Zoolander is a very fun movie to watch. Its full of cheesy jokes and dialogue but it never takes itself too seriously. Its a generic comedy movie but a good one at that."
    },
    {
      "rating": "7",
      "text": "'Zoolander' is a bit of a guilty pleasure...a movie I shouldn't really like, but ended up surprising me more than I expected.\r Ben Stiller plays an iconic fashion model named Derek Zoolander, who rises from his fame and becomes one of the hottest faces in the country, but then his stardom falls. This is due to his rival named Hansel McDonald (Own Wilson) who ends up winning an award one night that Zoolander thought he was going to win.\r Embarrassed and humiliated from this event, Derek tries to rebuild himself when the eager businessman that is Mugatu (Will Ferrell) wants to train him to assassinate the Malaysian Prime Minister.\r That is the plot, crazy as it may seem, but that is the plot of this dark comedy.\r Stiller directs this movie with a dark and sometimes warped tone, he also plays the character of Zoolander with some kind of dorky, loser feel to him. He is very simple minded and his background includes his dad (played by Jon Voight) hates him, and is ashamed that his son is a male model.\r The funny moments in this film are extremely funny, and while it does go a little off the rails in terms of its plot and writing, this is a dumb comedy where you're meant to have fun and just roll with it."
    },
    {
      "rating": "5",
      "text": "Its one of those films that is just so stupid that its good. There is nothing really good about this film - The story is stupid yet original, The acting is decent but not as good as you would expect, and there was a few laughable parts in it. Chances are if you laugh at fart jokes then you will laugh at this."
    },
    {
      "rating": "10",
      "text": "People must not understand what satire is. This movie is one of the funniest satirical movies I have ever seen."
    },
    {
      "rating": "1",
      "text": "Truly one of the worst films I have ever seen. And what's with all the apparently deliberate offense towards Malaysia? Avoid at all costs."
    },
    {
      "rating": "0",
      "text": "I couldn't watch through the first time. Tried watching it again today, and I still couldn't finish through the end. It's that bad. Its one of those movies that try too hard to force you to get the joke in every scene. You think the all-star cast/cameos that signed into the project read the script knew better. But it sucks. If K-mart or Old Navy were to produced movies, it would be this. The movie wasn't stupid-funny, but stupid-lame."
    },
    {
      "rating": "5",
      "text": "An average comedy as far as comedies go. This movie is worth quite a few guilty laughs... which brings me to the fact that Poor K. really needs to lower the blood pressure. Getting all worked up like that over this silly movie is like getting mad at an 8 year old child for calling you Poopface. Please calm down, you are embarrassing yourself... it's just a (stupid) movie."
    },
    {
      "rating": "0",
      "text": "As Roger Ebert said in his review of this film - it is a good example why the world hates America. Well, Ebert was a bit too harsh, I'd say, but this is definitely a disgrace to Hollywood and humankind in general, I'd say. So shallow, so stupid and so over-the-top that it induces vomit. 'Zoolander' is one of the worst films I have ever seen in my life. Yes, I will admit it had a few funny scenes, but quite frankly after watching it I just could not control the discomfort I felt. It is just a bad bad film, and is one of the reasons why I've disliked Ben Stiller for years after. I would definitely not recommend it - bad story, bad acting (quite atrocious, actually), bad dialogue, bad..everything."
    },
    {
      "rating": "10",
      "text": "This one of my most favorite films. It is satire at its best. The chemistry itself is a reason to watch, for the way Stiller and Wilson work so very well together. Yes, silly, but done in the best way possible!"
    },
    {
      "rating": "0",
      "text": "Huge disappointment.   Just another comedy that was not funny.  I couldn't watch this again if I tried.  I wish David Bowie had never been in it and perhaps he feels the same."
    },
    {
      "rating": "6",
      "text": "A completely accurate documentary about the intelligence level of male fashion models.  Very educational."
    },
    {
      "rating": "3",
      "text": "As a parody of the fashion industry and the often shallow state of the world, Zoolander is average. On all other fronts, including Ben Stiller's direction and performance, the film runs flat."
    },
    {
      "rating": "3",
      "text": "I can admire Ben Stiller's parody of the fashion industry. What I cannot and will never admire is the clunky screenplay, overly-hammy (too much on-purpose cheesiness) acting, and lack of comedy that is instead replaced by sheer stupidity and absurdity of the dialogue."
    },
    {
      "rating": "7",
      "text": "Copies \"Austin Powers\" but still has its own unique brand of comedy. Owen Wilson is great. This film has the funniest orgy scene I've ever seen."
    },
    {
      "rating": "10",
      "text": "This is one of the best comedies out there. If you want a quick laugh without thinking, watch this."
    },
    {
      "rating": "9",
      "text": "If you like Ben Stiller and Owen Wilson then this is a must-see. It's a very funny film. @ Poor K. - you're taking it too seriously! It's a comedy film, not a socio-economic commentary. Next you'll be complaining that Spiderman doesn't portray spiders justly."
    },
    {
      "rating": "6",
      "text": "I laughed at several scenes, but not uproariously. Once you get the joke, it seems to repeat itself over and over. Not to be missed so long as it's at the matinee or entertainment book price."
    },
    {
      "rating": "10",
      "text": "This is my favorite movie of all time. Ben Stiller is a genius."
    },
    {
      "rating": "10",
      "text": "Absolutely hilarious. It's been 6 months since the last time of many that I've seen this movie, and I'm laughing just thinking about it."
    },
    {
      "rating": "9",
      "text": "This movie was so funny owen wilson + Ben stiller = hilarious."
    },
    {
      "rating": "8",
      "text": "I am still laughing."
    },
    {
      "rating": "10",
      "text": "I can't understand some people's extreme dislike for this movie. I loved every minute of this movie and I'm sorry if it was too wacky for some, but that's the point."
    },
    {
      "rating": "8",
      "text": "My brother made me watch this movie coz he loved it SO much. And I must admit, it is very funny. A creative idea executed to near highest standards. V. Good."
    },
    {
      "rating": "6",
      "text": "Many people have accused Zoolander of being overly silly and way too juvenile for it's own good. Personally I think that one of the reasons it is so enjoyable is because Ben Stiller and the writers know that it is not intelligent whatsoever and use this as a way of getting laughs. Which I don't think there is anything wrong with. Dumb fun."
    },
    {
      "rating": "8",
      "text": "A dumb, wacky comedy that ensures a good time even if most of the jokes grow on you ironically and have more of a awkward but at the same time hysterical feel to them."
    },
    {
      "rating": "5",
      "text": "The movie does not meet the expectations and the comedy situations seem silly. Though perfomance from Ben is good the storyline and screenplay does not compromise each other."
    },
    {
      "rating": "4",
      "text": "I have tried to watch “Zoolander” several times over the years and failed, because the opening scene just did not interest me in any way.  I finally forced myself to stick it out, and I hope I never have to do that again. There is just nothing about this movie that appeals to me. The really weird part is that “Zoolander” is full of my favorite actors, but for whatever reason, nothing they did entertained me.   I realize this movie is considered a cult classic by many, but I just did not get it.  I give it a D, just don’t bother."
    },
    {
      "rating": "3",
      "text": "I get that it's funny to some but it was never watchable to me. It's easily one of Ben Stiller's worst film's in my opinion"
    },
    {
      "rating": "6",
      "text": "Ben Stiller's movie about stereotypical male model with a ridiculous story makes an entertaining comedy making fun of the male model industry. A stupid plot with good supporting cast combine with good soundtrack. Throughout the movie each actors have funny lines are easily quotable and the best scenes is combined with well placed songs like the gas station and the runaway battle. Not a great or amazing movie but not bad an enjoyable satire directed and written by Ben Stiller.\r The plot is given at the opening sequence with Mugatu played by Will Ferrell planning an assassination on the new prime minister of Malaysia because he would raise the minimum wage and get rid of child labor laws. Ben Stiller's character Derek Zoolander is a three time model of the year but for some reason can not turn left. Hansel a role written for Owen Wilson by Ben Stiller is a hippie like model whos career is rising. After losing the model of the year to Hansel he reconsider if there anything besides being really really good looking and retire. Looking for a model to assassinated the prime minister Magatu hires Derek Zoolander for a new fashion line and brainwashing to the song \"Relax\"."
    },
    {
      "rating": "10",
      "text": "Hilarious movie love Ben Stiller, Owen Wilson and Will Ferrell a great pick can't stop watching it  can not wait for the second one hopefully it will be even better than this one a 100% by Aidan"
    },
    {
      "rating": "4",
      "text": "i don't wanna hear your excuses..ZoolanderIt's stupid and ridiculous and still not funny even though Ben goes all-in; he hardly makes a point."
    }
  ],
  "recommendations": [
    "dodgeball_a_true_underdog_story",
    "the_wedding_ringer",
    "step_brothers",
    "get_hard",
    "thunder_force",
    "identity_thief",
    "the_ridiculous_6",
    "zack_and_miri_make_a_porno",
    "paul_blart_mall_cop",
    "grown_ups",
    "neighbors",
    "masterminds",
    "ted",
    "dinner_for_schmucks",
    "tropic_thunder",
    "forgetting_sarah_marshall",
    "central_intelligence",
    "30_minutes_or_less",
    "little_fockers",
    "the_hangover",
    "dirty_grandpa",
    "zoolander_2",
    "the_longest_yard",
    "the_watch",
    "horrible_bosses_2"
  ]
}