{
  "id": 4788,
  "title": "Zoolander 2",
  "starring": [
    "Ben Stiller",
    "Owen Wilson"
  ],
  "runtime": 100,
  "genre": [
    "Comedy",
    "Adventure",
    "Action"
  ],
  "description": "Derek and Hansel are modelling again when an opposing company attempts to take them out from the business.",
  "releaseYear": "2016",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/e0sHfnIDANQtuqgn7UIupdJni3O.jpg",
  "categories": {
    "plot": 3.8,
    "acting": 3.6956521739130435,
    "ending": 4.0,
    "soundtrack": 5.0,
    "cinematography": 5.0,
    "familyFriendly": 6.0,
    "funny": 4.017857142857143,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "3",
      "text": "'Zoolander No. 2' is many things: its stupid, boring, repetitive, lazy, a cash grab... but it is not funny. Not even Will Ferrel can carry Ben Stiller's disappointing mess of a sequel."
    },
    {
      "rating": "4",
      "text": "Instead of genuinely funny stuff, this film’s major shortcoming is that it relies so heavily on cameos (30+ ranging from Valentino to Willie Nelson to Neil deGrasse Tyson). Ben Stiller (who also directed and co-wrote) and Owen Wilson return as vacuous models, who after years of seclusion, find out that they’re no longer in vogue. The first half spoofs the fashion industry (to mostly lame effect), but when Will Farrell appears as the villain, the focus shifts to an equally unexciting attempt at becoming an action flick. There are a few amusing moments and lots of energy, but the majority of this selfie falls flat. Sadly, the cameos are the most fun thing about it."
    },
    {
      "rating": "4",
      "text": "Zoolander 2 suffers from a certain thing called sequel syndrome. A lot of the jokes in it were stolen from the first one, overused and made redundant. Any original jokes they did have for the most part weren’t very funny to start with, and got less and less bearable as the film went on. This was partly thanks to the actors performing the jokes, though, as none of the new characters were likable. Even Ben Stiller and Owen Wilson didn’t look like they were enjoying the film-making process, as they and Will Ferrell weren’t at their best. Even though the film started strongly, the bad jokes and in-originality along with the bombardment of pointless celebrity cameos and unsure actors meant the rest of the film didn’t fair well, to say the least.\r It’s a comedy film, so people are supposed to laugh. I didn’t hear much laughing.\r 39/100 (rounded to 4/10)."
    },
    {
      "rating": "4",
      "text": "Cameos left and right only go so far to in this stupid film. 15 years in the making and Hollywood comes up with this lazy dumb film? The only saving grace is Will Farrell at the end."
    },
    {
      "rating": "3",
      "text": "I didn't see Zoolander 1 during it's time, and because of that I don't share the love that it gets from most others. And Zoolander 2 features the same overdone performance from Ben Stiller, some occasionally funny and weird stuff with Owen Wilson, a ton of celebrity cameos (some good, some utterly pointless) and some often funny lines. And that's the problem, it's only funny here and there. It never made my laugh out loud and the final act is just terrible. This is probably the worst film of 2016 so far."
    },
    {
      "rating": "2",
      "text": "Being a huge fan of the first Zoolander, I was not only disappointed in the sequel. I was disgusted.\r Zoolander 2 is not only obnoxiously unfunny on its own, but damages the original. The characters have lost all realism and have become annoying caricatures. Ben Stiller is really, really, ridiculously awful here. As is the actor playing his horribly grating son. The plot is stupid, the writing is completely flat, and it's just not funny at all. I laughed a few times and they were all from Will Ferrell as Mugatu, but even he didn't live up to the potential of his brilliant character in the first film. Penelope Cruz and Kristen Wiig are hardly in it and don't really offer anything other than star power for marketing. It's filled with all-star celebrity cameos, but nothing interesting comes from them. I was thoroughly disappointed with Zoolander 2 as a whole and expected so much more from Stiller and gang."
    },
    {
      "rating": "0",
      "text": "Worst movie I believe I ever saw.  Saw 3 couple walk out until we coundt take it anymore either and did the same. No stories, bad acting and stupid all around.  Dont waste your money."
    },
    {
      "rating": "3",
      "text": "While its filled with absurd cameos from every celebrity you can think of, Zoolander 2 has no plot and lacks the comedy needed for this sequel to succeed.  What this movie comes down to is Stiller and Wilson trying to scrape the bottom of an empty barrel of jokes, and the film falls terribly flat."
    },
    {
      "rating": "3",
      "text": "Remember what I said about Zoolander 2 on my review of Zoolander? \"Hoping Zoolander 2 can be this good as the first one.\" Yeah, about that... I was hoping Zoolander 2 would be good and I was planning to give it a good score, but nope. This movie betrayed me and it makes the original look bad. You would want to start watching the original more often."
    },
    {
      "rating": "1",
      "text": "The new Zoolander is nothing like the first one. The film is so boring, and barely funny. As oppose to the first Zoolander, which was so stupid that it was funny, the second one isn't even funny. It's just stupid."
    },
    {
      "rating": "5",
      "text": "Zoolander 2 is an unnecessary sequel. So much so, that it even recycles its main villain.  There are some funny bits and pieces, but the jokes are so out of date, that despite the stars' best efforts, it's just not enough. Stiller needs to lay down on his so called pet projects. They just don't work anymore."
    },
    {
      "rating": "2",
      "text": "You know a movie is bad when the best acting is a cameo by Justin Beaver. Really now, this was a poorly written show. I was so looking forward to it, but was sorely disappointed."
    },
    {
      "rating": "0",
      "text": "Awful, disastrous & messy sum up the words for..... for.... whatever it was that I wasted my life watching. I can't even come to terms to even call it a movie as it doesn't deserve the recognition or come under the bracket of a movie as this will be far too distasteful to those that put the time and effort into making something worth watching.\rAvoid like this movie like the plague."
    },
    {
      "rating": "4",
      "text": "I am a big Zoolander fan so I was excited to see these characters again, unfortunately the results are under whelming.  I admit I laughed some but not nearly enough to justify seeing it again.  C"
    },
    {
      "rating": "1",
      "text": "A lot of talented actors, some cute cameos but the movie is as funny as cancer. I am not saying Zoolander 1 was a great comedy but it had it moments, it was funny at times, unfortunately Zoolander 2 is a complete wast e of time."
    },
    {
      "rating": "7",
      "text": "Admittedly, I can see why a lot of people don't like it-it was stupid, unnecessary and sometimes quite messy-but for the most part, I enjoyed it. The problem with it was that while the first one was more focused on lampooning the fashion industry, the second one spends about half an hour making jokes about how weird modern fashion is, before suddenly becoming a spy movie. That said, it was still funny. Ben Stiller and Owen Wilson did great jobs, but as with the first, Will Ferrell stole the show. He was absolutely hilarious. And Justin Bieber's death scene was one of the greatest movie beginnings in the history of cinema (do I have to explain why?). So overall, while not as good as the first one, Zoolander 2 is a mostly satisfying sequel with enough laughs to overcome its flaws."
    },
    {
      "rating": "0",
      "text": "First movie I walked out of in a very long time.  The entire cast and crew should be ashamed of themselves for making this movie.  You would have to be a very special person to even remotely enjoy Zoolander 2."
    },
    {
      "rating": "7",
      "text": "Great film. If you liked the first, you'll like this - more of the same, and that's not a bad thing. Some moments are amazing, like Mugatu's exit from the prison. Ultimately I don't think the series could sustain a third film, but this was fantastic. Kind of relies on having seen the first to get a lot of the humour. Well done team!"
    },
    {
      "rating": "1",
      "text": "Last week my girlfriend brought me to an art gallery fo a date. This week I chose to bring my girlfriend to see this movie... The film was so bad I thought she was going to break up with me! I was so embaressed that this poorly chosen film would somehow falsely give her insight into my character. Tasteless, cheap, not funny and lacking any smart humor.\r Ill timed jokes, A plot that seems written in one cafe sitting between Ben and others. Too many cameos, which take away from the film. And, again, really bad jokes."
    },
    {
      "rating": "0",
      "text": "Unfunny as hell,they are trying so hard to land every jokes to us and it's unfunny,predictable and just stupid.The first film is good enough doesn't mean the movie needs a sequel.The film is an unnecessary comedy sequel with annoying **** characters,bad pacing and a terrible **** dialogue."
    },
    {
      "rating": "2",
      "text": "Co jest k…?!\r Zoolander 2 to film beznadziejny. Jego celem było ukazanie zepsutego i absurdalnego świata mody, a nie beznadziejnych żartów, które wyprowadzają z równowagi aniżeli do śmiechu. Jedyne sceny, które wywołały u mnie śmiech były pod koniec. Reasumując, nienawidzę tego \"filmu\"."
    },
    {
      "rating": "4",
      "text": "There are laughs to be had here, mainly as a result of the many celebrity cameo's that form the basis of this film, but that is all that can be said about this otherwise poorly realised sequel. The 'storyline' has a number of plot lines that are set up and then ignored, the pacing just leaps briskly between seemingly random ideas, which is unsatisfying and irritating. This fails to capture the withering commentary on the industry of the first film, and whilst there are moments of hilarity, the overall experience is decidedly meh. 4.88/10"
    },
    {
      "rating": "0",
      "text": "Well, it can Ben Stiller's laziest and worst  film made. First, a dull and dark beginning, Justin Bieber dying? If you are a fan of Justin Bieber, I recommend you not to watch the film. Well, another bad side of this film is the cameo of Benedict Cumberbatch as a lesbian model and fashion designers like Tommy Hilfiger being cannibals."
    },
    {
      "rating": "1",
      "text": "This was just another pathetic excuse to give a big budget film to a mediocre ,white and unfunny so called actor.The worst film i have ever seen in my life. I left after 30 mins into the film after putting myself through horrible acting, dialogues, etc! The screenplay was just horrid! I'm glad the film was a disaster at the box office."
    },
    {
      "rating": "8",
      "text": "In Zoolander, we had a small commentary on the child labour industry on fashion, but in Zoolander 2, we get a commentary about how fashion has gone from weird to extravagantly bizarre. Just like our sweet and stupid protagonist of it all, Zoolander 2 is intensely hilarious. Sure, I'll admit that the narrative shifts like a stumbling horse, but the encapsulation of madness overwhelms the senses and almost drugs you into laughing. It's thrilling. We get just what made the first one so brilliant and more, some especially excellent cameos. Be warned, those who didn't like the first Zoolander will hate this one even more I fear...Yet for those of us finding the sort of OTT and strange zoolander comedy in the first one, this is really really ridiculously good fun."
    },
    {
      "rating": "10",
      "text": "Hilarious!!!! Lol seeing my mentor Anna Wintour and My dear Ariana Grande ... in the same film? lol this is why I'm happy. Give it and chance is good and kinda guffy but that's the spirit of zoolander..."
    },
    {
      "rating": "5",
      "text": "Even as a huge fan of the first Zoolander I found this sequel to be incredibly disappointing. Let's be honest, there was really no reason for it. Especially not after all these years. Ben Stiller proves this by returning as director, writer, and star all the while lacking any truly worthwhile ideas.\r The whole thing just seems like Stiller came up with a few good jokes over the years that could fit the Zoolander character, but ultimately not enough to make a complete movie. He then proceeded to make the movie anyway. Rather lazily at that too. In order to fill in the rest of the pieces required to make a Zoolander 2, Stiller threw together a haphazard plot, tossed in some cheap jokes, and filled the movie with a plethora of cameos with the hopes that nobody would notice the lack of genuine humor. It all just feels so cheap.\r The world of Zoolander is much more gonzo this time around. It's got so many over-the-top characters and absurd environments. It all not only looks fake, but feels fake as well. A case of style over substance. It's obvious the budget wasn't that high. You can tell the majority of the movie was filmed in front of the world's most obvious green screens.\r I do appreciate Stiller's sense of imagination though. He's content to take nothing seriously and has crafted a world where anything can and probably will happen. It's also nice to see a genuine character comedy nowadays. It's just a shame it isn't that funny.\r It does it's funny moments though. I can say that the movie did get a few laughs from me. The problem is that they are few and far between. The time in between these gags is spent following a pointless plot and watching countless other jokes fall flat on their face thanks to how obvious they are. I got to give the film credit for Kyle Mooney though. He was a consistently funny presence.\r The area where Zoolander 2 disappointed me the most was with it's lack of satire. There are some moments where it pokes fun at hipsters, political correctness, and the except everybody movement, but it's largely lacking in any legit social commentary. Stiller seems to forget what a crucial element that was to the first movie's success.\r Zoolander didn't need a sequel. While not entirely bad, Zoolander 2 certainly proves that. It largely forgets what made it's predecessor so great. As a result it's remarkably less funny. I do appreciate that 2001 sense of humor it so desperately tries to bring back into modern times. However Stiller's need to go bigger in order to hide the lack of quality content prevents that from happening. It's a subpar sequel and comedy. One that isn't even likely to satisfy fans of the original. I know it didn't this one."
    },
    {
      "rating": "3",
      "text": "An unnecessary follow up! Foolander!\r Everything I wrote was just my personal opinion, definitely not intended to offend anybody. Ben Stiller is a good actor, but a fine filmmaker, His directional ventures were awesome, especially after his last film 'Walter Mitty' the expectation was very high on this, but I did not think it'll end like this. It hits the rock bottom, the lowest point in his directional career. His odd film experiment had failed, just for one project and I know he will come back strong. But as an actor, he still got the star value and I'm looking forward for his upcoming project.\r It has been 15 years since the original film and I don't remember much of it. But before this, I had a very quick re-view, so I'm to get a clean flow for a better understanding. Anyway, the film gave a brief report about the past events in the beginning, but when I saw the first face in the opening scene I knew it will going to suck and it did.\r Okay, the first, the story was decent, but not the jokes. And the next, there are too many cameos that kind of ruined its pace to keep quiet for sometime and to focus on actual story development. From all those, the best part and where I actually had a brief laugh was to see Neil deGrasse Tyson. The second films are always very crucial, because it is a bridge between the original film and numerous follow-ups to set up a franchise status. So clearly this film stumbled and I don't think there will be any more films in this series.\r The original 'Zoolander' had its own brand appeal, but with this bad film it got lost. The production was very good and so the performances, but the humours were average. No offense, there are some people who still liked it, but I did not, so I won't recommend it for the 'Zoolander' fans as well as if you're looking for a good comedy. But like I always say who knows you might like it, so think twice in which one is if you're reading this review and the second is analyse it before to decide anything.\r 3/10"
    },
    {
      "rating": "10",
      "text": "A very under appreciated film that was an overly hyped sensation and that inevitably led to it's failure in capturing the audience it was looking for. The movie does some re-treads for nostalgia's sake but manages to keep the ball rolling and not confuse newcomers. The plot, although hard to follow at times is an extremely solid satire of both the modelling industry and overly sensitive people. The movie is all hits as far as comedy goes for anyone except who the film is putting under fire (Another reason why the movie got panned, it offended pansy's and those kind of people lie in the critic and blogging industry).\r Ben Stiller, Owen Wilson and Will Ferrell are as amazing as you'd expect in their returning roles. The acting and delivery is what really makes this movie succeed in quality. The celebrity cameos are also  better executed than expected, being really witty and clever.\r Overall, this movie is hilarious and hits all the right spots."
    },
    {
      "rating": "8",
      "text": "I had very low expectation about this product ...normaly it isn't my kind of comedy....I watched It because It cost about 3 Euros in a cinema promotion.......but I gotta say, I was surprised by how much I laughed.\rThe jokes were satire and often in the background but they do their job.\rThere are a lot of quotes (often mocking) of other movie, good visual, good costumes, a lots of cameos by actors-musicians-stylists that are willing to making fun of themselves (For example Susan Sarandon that auto quote herself from Janet Weiss character) in a good mix.\rI didn't watch the first one so I can't compare."
    },
    {
      "rating": "0",
      "text": "The worst movie I've ever seen, I mean is so stupid the history and the protagonist is so stupid, is not even funny at all. I expected more for this movie"
    },
    {
      "rating": "4",
      "text": "Funny to watch once, but pretty dumb. Found myself laughing at parts and just cringing at others. On par with the first Zoolander I think. I wouldn't rewatch it though."
    },
    {
      "rating": "5",
      "text": "Great cast, high production values, good soundtrack. A big wad of money was thrown at this film. Unfortunately they forgot to add the jokes. Quite liked the first one. This... not so much."
    },
    {
      "rating": "1",
      "text": "What is happening with Ben Stiller ?? What a bad movie !!! Please do not waste time watching this non-sense. Starky and Huthc please don't do that again !"
    },
    {
      "rating": "5",
      "text": "This film could have been the best B-movie ever made however it doesn't get 'good-bad' it gets progressively bad-bad. Not only do all the characters from the original return but a slew of new and underdeveloped characters as well."
    },
    {
      "rating": "2",
      "text": "Zoolander 2 has more cameos than laughs and recycles too much elements of its predecessor to create an unnecessary, over-the-top, unfunny mess for Ben Stiller and co."
    },
    {
      "rating": "6",
      "text": "Look this is a basic feel good movie. Many of the jokes harken back to the original, and the list of cameos is quite extrodinary. It's more of a snicker film than a laugh out loud movie like the first one was. Wil Farrell carries the movie in the end (he's still got it), but a number of the jokes are cringeworthy, and just feel a little awkward. You'll enjoy this if you go and see it but don't expect more than that"
    },
    {
      "rating": "5",
      "text": "Zoolander 2 wasn't terrible but it wasn't good either. What was up with Mugatu's voice, did he get castrated in jail? I like how off-hand comments are major plot points, like Sting getting mentioned once in the first movie and then becoming a major character in the sequel. There were some glimpses of what made Zoolander a great movie but they were too few and far between in the sequel. The plot was a bit weak in parts and  it defiantly needed Jon Voight (his line about not being a professional film and TV actor is the funnest line from any movie ever). It was disappointing because Zoolander 2 could have been a lot better."
    },
    {
      "rating": "5",
      "text": "Zoolander 2 had a very mediocre story. If it was an English project in school, it would fail. Miserably. But the characters are still as lovable and the movie still makes you laugh your ass off."
    },
    {
      "rating": "2",
      "text": "Ben Stiller's  track recond of movies it pretty decent for the most part but this movie is something I'm sure even he wish turned out better. Most people look back at the first Zoolander movie and love it, so most people who where hoping this movie to be good are going to be let down. Lots of jokes just fall flat and feel weird. Most of it feels like it should of just been re written. Lots of celebrity cameos just feel forced/pointless and don't really add anything to the film. Story is really bad and I know you don't go to this type of movie for story but this was a let down even for a comedy of this level. Overall I was let down with this film and sadly fans of the original will probably feel the same."
    },
    {
      "rating": "7",
      "text": "I watched this movie recently, my thoughts are if you just watch this it's not so great by itself... but if you watched zoolander  and then this movie you won't hate it as much, I liked the first movie over this one personally, but this movie is good as a sequel...anyway I felt some points of the movie could have been better edited acted and devised to work together more seamlessly, and some acting moments are over the top at times, but It is a sequel movie, so they expect us to know how part of how the world of zoolander works already, overall I felt this movie was not bad, it could be better in some ways, but I've seen worse movie sequels."
    },
    {
      "rating": "4",
      "text": "This movie wasn't as interesting as I thought it will be - basically it had lots of cameos, but not as much funny moments, plus the whole story was quite dumb - that was expected though, but it was only dumb without many funny moments, which is the bad part. I think they could have went without sequel at all. If you liked first one you can watch this, but otherwise not sure"
    },
    {
      "rating": "2",
      "text": "Ben Stiller, Owen Wilson and Will Ferrell all return for a sequel that never needed to happen. And oh boy don't they know how to act dumb. The movie is unfunny and idiotic. The first one was average at best. Why make a second one? No wonder why it bombed in the box office."
    },
    {
      "rating": "6",
      "text": "Zoolander 2 is infrequently hilarious, and does a fine job continuing the spirit of the first movie. ben Stiller is great, and the jokes are beautifully stupid. Lots of dumb fun. My kind of stupid humor."
    },
    {
      "rating": "1",
      "text": "When you lose all hope and drug yourself beyond the limits of your entire life and slowly glide towards a nearby black hole; some imagery may flash before your hallucinating eyes. That is exactly the experience you get while watching Zoolander 2. Even if your senses may try to feed a logic by plucking it from the darkest place of your imagination; that it might be a parody of some sort....still the movie embarks it's existence as the parody of the genre of parody itself. Sadly I have nothing more to say as it deserves not even mentioning. A sad excuse in the name of entertainment."
    },
    {
      "rating": "4",
      "text": "The original movie was clearly an overstretched, zany SNL skit...but with a lot of charm. It was a light-hearted, fluffy bit of light relief that was quite clever in its witty take-down of the glitzy celebrity/fashion world. At the centre of this ridiculously glossy ham fest was the dynamite duo of the blonde, hippy-esque, Hansel, and the brunette, Tom Cruise-esque, Derek Zoolander. Both vacant, narcissistic, world famous male models clashing head to head for the grand number one spot in the fashion universe. Oh as a side plot, the evil Mugatu was trying to use Zoolander in order to assassinate a world leader. So what has changed for this belated sequel? well not much frankly. The plot actually follows in the same steps as before with Zoolander once again quitting the modelling world and then once again being forced back into it, this time to gain custody of his son. At the same time, Hansel has done pretty much the same thing and is also dragged back into the modelling world after his orgy partners all turn up pregnant. Both are invited back to 'civilisation' by the mysterious Billy Zane who is apparently still looking for that big break back into Hollywood (just like the original). Oh and Mugatu is still up to his old tricks.\r I think the first thing that hit me was how lame the jokes were, I mean really seriously lame and forced. Within the first ten minutes of the film Billy Zane hands Zoolander his Netflix, 'whoa! Jack Ryan...and Jack Reacher! Tonight's gonna be a total jack-off'. Are you groaning? you must be, surely you must be! Remember now, within the first ten flippin' minutes! Anyway as you can imagine things don't really get any better than that for the rest of the run time. There are barely any moments that did make me actually smile, the main one being the death sequence of Justin Bieber which I'm sure came at the top of most people's list. Another was a quick quip from a news report at the start of the movie, where the reporter speaks about the 3.7 million high school graduates of 2016 not knowing what a fax machine was, and couldn't name a caucasian President.\r The only other oddly amusing things that stood out (stood out in the sense that they were mocking modern society) was Benedict Cumberbatch playing some weird, eyebrow-less, mono-sexual/pan- sexual...model person, who claims not to be confined by binary constructs and has married himself (mono-marriage, is that actually a thing?? really wouldn't surprise me). It was strangely realistic considering today's current trends, as was both Zoolander and Hansel hesitantly agreeing to it all, not liking labels and supporting it all etc...And then you had the character of Don Atari who was pretty much the face of modern youth I guess. You're not suppose to understand half of what he says because he speaks in this modern youth tongue that's kinda like speaking in reverse, whilst taking the p*ss out of everything 'old'. Highly annoying, I know that's the idea but nonetheless, highly annoying.\r The rest of the movie is completely stuffed with one big cameo after another as if you were watching some millionaires fanboy flick (I suppose you are). Zoolander has a son who of course turns out to be fat and ugly, whilst also resenting him for not being a good father. Mugatu once again has some evil, dastardly, Bond-esque scheme to...well I'm not sure really, kill all the leading people in the fashion industry I think it was. This involves kidnapping Zoolander's son under the guise of some ancient prophecy about the fountain of youth in order to lure all the bigwigs of fashion to one place...or whatever. And Hansel...doesn't really do anything except help out here and there or have breakdowns over his pregnant orgy family. Basically Hansel is replaced by Valentina Valencia played by Penelope Cruz in a stereotypically spoof Bond-esque role. Hell everything here is a stereotypical Bond spoof, its basically Austin Powers with loads of cameos.\r Of course the movie isn't supposed to be remotely serious, its virtually a spoof, and in terms of hitting its targets...well I guess it does. The problem is none of this is funny anymore, apart from the odd lone gag its all terribly clichéd, bloated, self- indulgent and cringeworthy. I mean come on! I've never seen so many cameos, but what for?? they don't add anything to the movie, they don't make it funnier or cooler, they just stick out as, at times, badly crowbarred in cameos. This movie REALLY did feel like a sketch that had been padded out tremendously, the only remaining plus points that spring to mind are the inclusion of Ariana Grande in a latex catsuit and hood, and Milla Jovovich looking hot as hell in her Dominatrix attire. So for mature and adolescent male boner fuel...full marks! For witty social commentary...half marks, everything else..dross."
    },
    {
      "rating": "2",
      "text": "We didn't need the first film, and we definitely didn't need a sequel. Empty story, lame jokes and atrocious acting from the entire cast. Stiller & Wilson should be ashamed of themselves..."
    },
    {
      "rating": "0",
      "text": "I usually make my reviews marking The good, the bad, and the ugly things in the movie. Let's start:\r The Good: Justin Bieber gets killed. Apart from that, nothing.\r The Bad: Poor plot. Horrible acting. Sexual jokes make the movie unsuitable for anyone below 12, but those jokes are so inmature that they make the movie too stupid for anyone over 12, so the movie doesn't have a target age. The plot is poor. But what I consider the worst is the horrible developing of the characters: From nonsense accents used along the movie, passing through nonsense, stupid exaggerations, to clothes choosing.\r The ugly: Benedict Cumberbatch character. Seriously, What The F*ck is up with that character!? Also the horrible accents and acting exaggerations. Jesus Christ the actors interpreting the bad guys shout everything they say!\r Verdict: Do yourself a favor: DON'T WATCH THIS MOVIE."
    },
    {
      "rating": "3",
      "text": "Zoolander is another example of Hollywood's lack of originality in the past few years so they just polish up some old good movies and make a remake just to make money or pass time. I enjoyed the first one, I really disliked the second one. Bad story, not half as funny as the first one and not even good acting. Some movies are meant not to have sequels and all these movies had sequels in the past few years. Please stop making unwanted sequels and reboots."
    },
    {
      "rating": "6",
      "text": "Clearly not as good as the first, which is a classic in my estimation.  But this is still so packed with strong images and cheery lunacy, that you can brush off the numerous fizzles and flops."
    }
  ]
}