{
  "id": 778,
  "title": "Zootopia",
  "starring": [
    "Jason Bateman",
    "Ginnifer Goodwin"
  ],
  "runtime": 109,
  "genre": [
    "Animation",
    "Adventure",
    "Family",
    "Comedy"
  ],
  "description": "Determined to prove herself, Officer Judy Hopps, the first bunny on Zootopia's police force, jumps at the chance to crack her first case - even if it means partnering with scam-artist fox Nick Wilde to solve the mystery.",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hlK0e0wAQ3VLuJcsfIYPvb4JVud.jpg",
  "categories": {
    "plot": 9.320754716981131,
    "acting": 9.172413793103448,
    "ending": 9.0,
    "soundtrack": 10.0,
    "cinematography": 10.0,
    "familyFriendly": 8.0,
    "funny": 9.130434782608695,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "What may be the year's best film so far(I haven't seen Deadpool), the movie totally lives up to the hype. I was expecting a lot based on the really high rotten tomatoes score, at one point it was at 100%. It is really something you never seen before because it's an animated movie. However this movie is creative, dark, silly, fun, entertaining, touching, scary, and even surprising at times. The plot was very well constructed and it really does give a great message to everyone. It's also very creative at times and something's were mindblowing. However, I think the biggest win for the film is its humor. If you've seen the trailer, you'd probably know what I'm talking about. However, there's a lot more throughout the movie, espicially the ending. All the voices also fitted perfectly and the film was also very touching, and sad. I think this film should at least deserve an oscar nomination for best animated film. I really think this is one of the very best disney films out there and it is certainly the best animated film of the year. I even enjoyed this more than inside out!\r(Fingers crossed on Finding Dory). (100/100)"
    },
    {
      "rating": "10",
      "text": "For the very first time, I watched a film in theater twice. It's really funny with brilliantly scripted, also a surprised twist. Kids, teenagers and even adults would definitely love this film, because this contains some \"only-adult\" moments. A big step for Disney and i'm sure it has entered the Oscar race next year."
    },
    {
      "rating": "8",
      "text": "Having to be succeeded by the awful Frozen and the great Big Hero 6, Zootopia manages to keep in the fun with the many adventures of a bunny who dreams of being in the police force and a red fox who often scams in the many adventures of an animal world filled with no humans."
    },
    {
      "rating": "6",
      "text": "+Looks fanatastic 4k HDR+Interesting concept-Fits into the 'average disney CG film' campI must say watching this with my son I was very entertained, that said the lofty moral concepts it discusses dont seem to fit into the screenplay comfortably leading to some very akward dialogue between (entirely anthropomorphised cg animals in clothes).... Seems like it tried too hard to go to deep with its concept and misses the opportunity to better motivate and flesh out the secondary characters.... That being said, you'd have to be having a bad day not to enjoy watching this one with your kids!"
    },
    {
      "rating": "10",
      "text": "Very cool cartoon watch it very beautiful, watch it again. The first time I saw him, it gave me the creeps."
    },
    {
      "rating": "7",
      "text": "Nice story and cute characters - I like this fluffy movie. It will a good idea for watching it in evening after work"
    },
    {
      "rating": "10",
      "text": "The Greatest Animated Movie of All Time!This movie is an absolute masterpiece, not only because its wonderful way that gives its many messages in; but also because the importance of its messages in themselves and how smart they are and relevant to nowadays, and also how much the children really need these morals nowadays. Also, it's beautifully animated and the talented cast voices suit their characters perfectly. It has a plenty of funny scenes which we didn't watch before in any animated movie or even a live-action movie. This movie is like a comedy-adventure-action-crime movie and despite that it never made the viewers feel confused while watching it. The characters are definitely the most complicated characters I've ever seen in an animated movie, each character has its own point of view due to the experiences they get through and that makes each character has different motives and feelings.(10/10)"
    },
    {
      "rating": "7",
      "text": "Bueno, puedo decir que Zootopia me impresiono bastante, ya que al ver la caratula de la película pensé que simplemente seria un musical o algo así... Que equivocado que estaba! Los dos personajes principales (Nick Wilde y Judy Hopps) me encantaron, fueron las estrellas de la película, contando con una gran relación afectiva que se va desarrollando poco a poco mientras progresa la trama, carisma y un diseño que me gusta bastante, ya que es muy \"cute\". Sin embargo, el resto de los personajes a nivel de diseño es algo genérico, y el final deja que desear, ya que la antagonista principal: Bellwether nunca se revelan sus verdaderas intenciones de manera explicita. Todo eso de la operación montada que se revela al final de la película no parece tener mucho sentido. Hay una teoría que dice que ella lo hizo por venganza por ser maltratada de niña por los depredadores, y que ella quería deshacerse de ellos para siempre de Zootopia, pero eso no es canon al no ser oficial, es simplemente una teoría. Una teoría por fans. De todas formas, Zootopia me gusto bastante, con una trama muy original (innovadora) y eso en películas animadas, es raro y es digno de verse. El potencial estaba ahí, depredadores y presas conviviendo en un mismo mundo... La recomiendo."
    },
    {
      "rating": "7",
      "text": "Zootopia is a brilliant animated movie. zootopia is marketed as a family movie with both themes for other and younger people. Zootopia is a movie that is for both kids and adults like. it teaches us that discrimination in any sense is wrong but the humor is bit on the bad side on some times."
    },
    {
      "rating": "8",
      "text": "Zootopia is fine. It's not a masterpiece, nor a terrible movie, it's not obnoxious and annoying like an Illumination movie by any means, but it's far from Disney's best work. I will not deny that Zootopia, the city, actually feels like another character. It is filled with creative concepts and ideas. The animation is great, as expected from Disney and the characters are filled with tons of personality thanks to creative character design. They aren't cute for the sake of being cute nor look like generic animal characters like some other animated movie with cute animals that came out the same year (CofcofSingcofcof) and the story actually takes advantage of the fact that they are animals. Also, this is a really funny movie. I always have a blast with this movie everytime I watch it, there are so many genuinely funny moments that I really enjoyed. Nick and Judy, the main characters, have a great dynamic, and are so fun to watch together. For the most part it is well written...For the most part, I said. My problems with this movie are with the script. The social commentary and the racism allegories are soooo on the nose and obvious, you might think that \"it's okay because it's a kids movie\", but I disagree, because there are kids movies with subtle social commentary and parallels to the real world, like Chicken Run, I mean it's not like they had a character explain to the audience that they are in a concentration camp or something, and that is how Zootopia feels. It gets so on the nose at one point that it becomes cheesy instead of shocking. I was also not a really big fan of some obvious furry pandering stuff, like the animal nudist club scene or the weirdly sensual dancing tigers at the dancing number at the end, those moments were awkward...Speaking about that, I hated the ending, it was so cringeworthy. It ended great but no...They needed a dance scene, because that is DEFINETLY not an animated kids movie cliché!Overall, I don't hate this movie. It's pretty good actually, but definetly not a great movie. I agree with people that say that it didn't deserve the Oscar, it should've gone to Moana, which is a far superior film in almost every aspect. Regardless, Zootopia is one of the better modern Disney films, I mean, at least it's better than Frozen, Big Hero 6 and Ralph Breaks the Internet"
    },
    {
      "rating": "7",
      "text": "Great movie, would recomend to anyone. Would be great for the whole family."
    },
    {
      "rating": "10",
      "text": "So many good things to list about this movie it would take too long, just make sure you watch it!"
    },
    {
      "rating": "8",
      "text": "Zootopia is one of the best comedy animation films in recent years . Released in 2016, it stars  Jennifer Godin, Jason pitman, Jenny slate and add to the famous  singer Shakira. The expectations for this film were the highest  by people in year 2016 .if you want to laugh, watch this  movie , it’s very funny. I think most of people agree with me the best scenes in the film is when koala is talking slowly . I am really  into this part of film, I don’t mind repeating again and again the direction , production and uisual effects are all amazing. I would highly recommend zootopia, especially if you are keen on animation films. It will make you laugh all the time ."
    },
    {
      "rating": "10",
      "text": "To begin with, Zootopia/Zootropolis is really a great movie. It tackles a large number of social issues (racism, bullying, prejudice, sexism, inequality, stereotyping, etc.). Zootopia's world is inhabited by two main groups of mammals: predators and preys. The beautiful thing about this movie is that it depicts racism and prejudice in a very \"equal\" way: predators and preys do not correspond to any human race existing on this planet. The directors and the staff have been very sensitive and clever in my opinion for doing that. It gives the movie a sense of universality. This movie is plenty of details, references, puns, etc. It is definitely very funny, entertaining and the computer graphics are just stunning. The movie also has sad/emotional scenes and that makes you feel empathy towards the main characters, Judy and Nick (who are simply AMAZING), but they also help create a bond between them. The message at the end of this film also had a huge impact on me. It may sound cliché but it is definitely beautiful and praiseworthy. One last thing, I highly highly highly recommend this movie to both kids and (especially) adults (but also teenagers XD)!"
    },
    {
      "rating": "3",
      "text": "There's hardly anything to like about this film. It only exists as a means for Disney to push an agenda on the current generation to politically radicalise them into leftism. The characters were plain at best and the comedy often fell flat or was cringe inducing at the worst of scenes. The movie hardly deserved the praise it received from the public for being \"a kids movie tackling important societal issues\", when it shouldn't have relied on being political to be a good kids movie. The only positive thing about this film is its well done CGI. That's it."
    },
    {
      "rating": "10",
      "text": "Zootropolis, like it's animals, have a panorama of personalities as well as advantages and disadvantages, it is by no means a perfect film, but it pits itself so well not to be, that it turns out to be just a little less than that.Try and brighten up someone's day and try to understand that we're all different. We might as well stop fear stirring between us and understand that their is no 'Zootopia' really, but you can puzzle piece one together for yourself from people you love."
    },
    {
      "rating": "9",
      "text": "One of the best animated movies of this year\rClever writing, it has an excellent voice acting and the animation, the ideas, the zootopia itself are damn amazing.\rIt has some downsides, like the villain of the movie (i wint reveal who it is), but it manages to be a great film.\rThe best part is the friendship beetween the two main characters, they are really interesting, as the plot.\rI recommend it"
    },
    {
      "rating": "9",
      "text": "Yet another top-of-the-line installment in Disney Animation Studios' already impressive filmography, Zootopia is a beautifully animated, high octane adventure film that boasts outstanding voice acting and a stellar plot that will entertain the whole family."
    },
    {
      "rating": "9",
      "text": "Very good movie with humour,intense moments and teaches us about values.The plot moves around just ok and the plot holes were almost un-noticeable .Great movie for everyone."
    },
    {
      "rating": "10",
      "text": "Best mult what i ever seen realy!!!\rEveryone should see ZooTopia realy, mult of year !!!\rThis mult gives only positive emotions!!!\rDisney on top now, thanks!!!"
    },
    {
      "rating": "9",
      "text": "Esta era una de las películas que más tenía ganas de ver solamente por la aprobación del público, porque Disney no le dio mucha publicidad como si fuera una película de media calidad. \"Zootopia\" me encantó, es divertida, muy vistosa, pero sobretodo es muy inteligente, porque el mensaje de aceptación e igualdad es algo muy poco visto en el género infantil o animado.\rNos introduce Judy Hoops, una coneja con sueños de ser policía que desafían los roles de la sociedad. Tras cumplir con el arduo labor de graduarse se muda a la gran ciudad donde descubre que las cosas no son tan favorecedoras para un pequeño mamífero, con compañeros que no la toman en serio y trabajos sin reconocimiento. Con hambre de hacer algo significativo decide actuar fuera de la palabra su superior y se involucra en un caso de secuestros, donde su única pista y ayuda es el zorro, Nick Wilde.\rDe ahí la película se transforma en un interesante misterio con muchas sorpresas y giros argumentales, en general la película es atrapante ya sea por los grandes detalles que tiene la animación, el encanto y el humor de los personajes o la intrigante misión. Lo más destacable es el mensaje de tolerancia y aceptación, en cada momento la película muestra ejemplos de intolerancia donde uno puede verlo desde un punto vista más neutral ya que los animales no se clasifican por un color, creencia o género.\rLes recomiendo totalmente esta película a quien no la haya visto, es entretenida, colorida y sobretodo innova en lo que quiere decir."
    },
    {
      "rating": "10",
      "text": "Where so many other films tired and failed this year a film from March of all times is still the best film of the year. And I'm normally a person who doesn't enjoy the Disney fare! So that must say something really postive for this film!"
    },
    {
      "rating": "10",
      "text": "Loved the Movie. Lots of Fun. Great and colour for kids. Lots of adult related humour. Overall very satisfactory. enjoyed it heaps must recommend to everyone"
    },
    {
      "rating": "10",
      "text": "Zootopia was a awesome the story makes sence and coinsist with the characters (fits in)  it has a great rating of 8.3 or 8.9 stars , awesome rating the movie is great for kids! 10/10 rating"
    },
    {
      "rating": "10",
      "text": "Zootopia, what to say about this masterpiece.The plot is incredible, the voice actors especially Goodwin and Bateman shine. The plot twist hit me harder than puberty did (badum-tssss). All jokes aside best animated movie in ages, and is bound to get the\"Best Animated Feature\", award."
    },
    {
      "rating": "9",
      "text": "Near on perfect animation! Great and touching story that fits well into our own society, very relatable characters that I wanted to know more about after the films end, and amazing amimation! By far the best film of the year animated or otherwise."
    },
    {
      "rating": "10",
      "text": "Great animations, layered plot, interesting characters, beautiful settings, real-world issues, and original humor... all of which makes an entertaining movie for people of all ages.  A must-watch for sure."
    },
    {
      "rating": "10",
      "text": "Best animated movie in years.\r ......................................................................................................................."
    },
    {
      "rating": "10",
      "text": "Now thats a Disney movie that deserve a Oscar! not Frozen kinda way! great characters, beautiful and rich visuals with tiny details of how the animals would live in a society, great plot..........man, Im so happy that I could see this movie without seeing any trailers and get blown away!"
    },
    {
      "rating": "10",
      "text": "This Was Probably one of the best movies i have ever seen, such a good movie i actually spent time on researching the movie, the movie from what caught after watching it three...Three! Times in theaters was that the movie wasn't just trying to be a family movie but a family movie that children and adults could enjoy all round, while trying to make a impact on you with displaying some modern issues with the modern world, and after the research i found just how hard it was to make and create a story out of ideas the people at Disney who worked so hard to create a master piece with actual characters i could care about, a story which is thrilling to watch, and a expanisve world that feels like you could immerse yourself in imagining the possibilities, and  has some much potential for more, compared to another world like for example Frozen: Once the story was over and you start to think about it there not very much left in the world that they could 'go' from, While Zootopia on the other hand has so much left in the world where, heck they could literally make a TV series, or possibly another movie, (which fans of the movie would Love), and the possibilities of the World of Zootopia just continues, if the main protagonist get boring (Nick And Judy, which i highly doubt, just go look at he fan-fic archive that place is booming) then they could switch the protagonist , So the possibilities are just endless, so in the end, I loved the movie, so much i decided to take 35-40 minutes of my life (slow type even though i'm on he computer like 5 times week for like three-five hours, weird) that I'll never get back to write a review just to rate, show how i care about the movie, and further more just recommend, if you haven't seen this, I ask you to go and watch this, and if you don't just leave midway of the movie, word of advice, if you leave during the movie but not near the end most theaters will give you your money back or a free movie pass, how i know....*Cough, Dawn Of Justice. But i highly doubt you will dislike this movie and if you did watch this, well...Go watch it again. Plus I ship them *whispers if you know what i mean, even the Directors and actors are in it ;D"
    },
    {
      "rating": "10",
      "text": "Don't be fooled by \"troll reviews\" and scores here. Zootopia is not only the best animated film of the year it's the best film PEROID! I was so deeply touched when I first seen this amazing film and even though both me and my partner have watched it lord knows how many times now I still laugh and cry at all the right parts!\r The only people that give this film a negative review are doing so out of biais, politics, or they simply lack normal human emotions."
    },
    {
      "rating": "10",
      "text": "Frankly speaking, this is 2016's best animated film. The powerful and eloquent message delivered through the use of anthropomorphic animals is something quite unique that Disney has accomplished in this movie. The funny delivery on jokes and parodies on established clichés empower the movie's delight. The stunning visuals, the on point voice acting, and the amusing plot are simply cherries on top. Although the film is fairly straight forward, given its a Disney movie targeted towards a very wide audience, the simplicity won't take away from the wonder that the entirety of film brings. This movie was a marvel among the already great animated movies of 2016."
    },
    {
      "rating": "10",
      "text": "This movie has characters that are approved for meme material. The story is constantly interesting and the soundtracks is great. The movie fully delivers on humor and perspective, and more humor.\r I never liked Disney animations but I do like this one. Probably because it's not even like a Disney animation."
    },
    {
      "rating": "10",
      "text": "It was like the good and old animations came back in a movie: Zootopia. There's nothing to complain about: Cheerful story, gorgeous lore and, above them all, charismatic characters. It also criticizes modern problems we face in society that makes the watcher think about it.\rPerfect movie."
    },
    {
      "rating": "10",
      "text": "This is the best Disney Animation movie Ever .And I wait for Zootopia 2.\rA very amazing  movie .\rDubbing:\rEnglish: 10/10\rGerman: 10/10\rPolish :    8/10"
    },
    {
      "rating": "10",
      "text": "All I can say is: Great. great, great and great. Disney made an exceptional script for people of all ages. The humour suits both adults and kids, while not feeling forced."
    },
    {
      "rating": "10",
      "text": "This movie will for sure warm your heart and leaving you wanting to watch it again when you leave the theatre. I am a teenager, and I haven't seen a children's movie when I was eight, when my parents decided I had finally grown out of it. I personally do not enjoy modern day children's movies, but this one is different. Brilliant movie, funny characters, unique plot, and twists here and there to keep you wondering what my come next. Highly recommend that you watch this movie."
    },
    {
      "rating": "10",
      "text": "Changed my life, warmed my heart, I laughed, I cried, I felt more than I've felt in years. Didn't even know I was human anymore. Apparently I am. Not joking"
    },
    {
      "rating": "10",
      "text": "I would say: \"This movie was way better than I expected it to be!  It had amazing story development, beautiful art/design, rich characterization, and outstanding animation.  I'm so glad that it's having success in theaters!\""
    },
    {
      "rating": "9",
      "text": "With a well constructed and layered plot that shares parallelism to the real world, Zootopia is more than just an entertaining, well animated, well acted animated feature but instead transcends boundaries of the genre."
    },
    {
      "rating": "10",
      "text": "Zootopia is yet more evidence that sometimes the best way to tell a human narrative is to use non-human characters.  Beautiful visuals, a fantastic cast, and a modern tale about prejudice all combine into what has become my favorite Disney film of the past 14 years.  There are hidden gems of adult humor, references to popular entertainment, and current events throughout.  It's a film that's as much for adults as it is kids, and will appeal to a very wide audience.\r The plot is a story we've heard before, but told supremely well.  It hits very close to home for anyone who's been a victim of prejudice, and serves as a powerful reminder that even if you think you aren't prejudiced, you still might be.  Yet despite the film's serious \"message\" it's not delivered in a ham-handed or overbearing way.  It's interwoven into a story about acknowledging your limitations, and trying to overcome them anyway, despite what others might say.\r My only complaint is actually a hidden compliment:\rThe world of Zootopia and its characters is so unbelievably well-constructed and vibrant that we can't help but want more of it.  The movie's short runtime doesn't allow the deep exploration of the side characters and environments that I desperately crave after seeing it.  There's a massive amount of sub-plots and tantalizing details we don't get a chance to delve into, which makes me a bit sad.  However, the polished end result is so fantastic that I can hardly use it as a true \"negative\".\r Hands-down, this is Disney's best animated film since \"Lilo and Stitch\" and deserves high praise. Go see it!"
    },
    {
      "rating": "10",
      "text": "I really loved this movie! I feel really shocked that it is only the \"#19 best movie of 2016\" on this website right now. As a kid you can enjoy the cute animals and the interesting story; and as an adult you can try to find the brilliant references to other movies or shows, try to dig out the metaphors, or just simply relax yourself..."
    },
    {
      "rating": "9",
      "text": "Really well done in almost every single aspect. Cute, exciting, funny and educative. The chemistry between two main characters is unbelievable and entertaining. Zootopia showed a visionary world of surprises to raise the game of a mediocre crime drama."
    },
    {
      "rating": "10",
      "text": "It was such a good movie. First time in a while that I read fanfic on a movie. Only problem was it was too short and I really want to see a Zootopia 2!!"
    },
    {
      "rating": "10",
      "text": "To start things off ... A great set of characters, great animation, great dialogue, really funny jokes, great details of almost everything and a great plot and twist, the whole Disney package. Zootopia, a story of love and friendship and prejudice. For the little ones, we have the characters and jokes. For the grown ups, a dark plot about every real world problem. If you haven't watched the movie yet, then stop reading and start watching!"
    },
    {
      "rating": "10",
      "text": "This movie is absolute ten out of ten. I have never before in my life seen a movie twice, but this is the first movie that I will be viewing multiple times in the movie theater.\r I have never felt so genuinely happy as when I was watching this movie. This is probably the best movie Disney has put out yet. FANTASTIC characters, BEAUTIFUL animations, and humor that is suitable for adults and for kids. I'd say Judy Hopps is adorable, but everyone (and I mean absolutely every character from start to finish) is absolutely amazing.\r Really, I don't want to spoil the plot - this is something that will warm you up regardless of what age you are and make you want to go out, accomplish your dreams, and make the world a better place. This movie is a definitive 10/10, and I hope Disney puts out some stellar sequels."
    },
    {
      "rating": "9",
      "text": "Best Disney's animation ever  since  the lion king. Story telling , design and character simply perfection. This movie bring back the good old day disney's character homanoid animal with serious cop story  . If you love Disney animation style but tired of  \"true love kiss\" ex machina i urgent you to see this."
    },
    {
      "rating": "10",
      "text": "Disney has made yet another modern Disney classic! A great movie filled with great characters and great voice cast, a well thought out story, and plenty of humor and emotion. One of 2016's must see films. And for all those Shakira and Breaking Bad fans, Zootopia was able to fit those Easter eggs into the plot!"
    },
    {
      "rating": "10",
      "text": "Normally I wait before I hand out a 10/10 but this is a rare situation. This is by far the best animated movie I have seen all year. It is cleaver, well written and has a wonderful message in it about prejudice. I highly recommend everyone to see it."
    },
    {
      "rating": "10",
      "text": "It's excellent!\rZootopia looked like just another animated film that the kids will enjoy, but I still enjoyed the heck out of it!  I didn't have any high expectations for the film, considering Norm of the North left a bad taste in my mouth, but I was genuinely surprised.  The movie is relentlessly entertaining, the characters were likable, the music was great, the animation was fantastic, and the story is surprisingly deep.  What this film does better than any other Disney film is that it touches on a lot of serious subjects like racism, drugs, black markets, etc.  However, it combines that with hilarious writing and  lovable characters in Nick and Judy.  Honestly, I can't think of anything Zootopia did wrong.  Sure, I have a few complaints here and there, but overall, this movie is not only one of the best movies of 2016 so far, it may be one of my favorite Disney films ever made.  Whether you're a kid, teenager, or an adult, you need to see this movie, it really is that good.\r Zootopia gets a 10/10."
    }
  ]
}