{
  "id": 42,
  "title": "Apocalypse Now",
  "starring": [
    "Marlon Brando",
    "Robert Duvall"
  ],
  "runtime": 147,
  "genre": [
    "Drama",
    "War"
  ],
  "description": "At the height of the Vietnam war, Captain Benjamin Willard is sent on a dangerous mission that, officially, \"does not exist, nor will it ever exist.\" His goal is to locate - and eliminate - a mysterious Green Beret Colonel named Walter Kurtz, who has been leading his personal army on illegal guerrilla missions into enemy territory.",
  "releaseYear": "1979",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gQB8Y5RCMkv2zwzFHbUJX3kAhvA.jpg",
  "categories": {
    "plot": 8.916666666666666,
    "acting": 9.130434782608695,
    "ending": 9.615384615384615,
    "soundtrack": 5.0,
    "cinematography": 9.666666666666666,
    "familyFriendly": 7.0,
    "funny": 10.0,
    "action": 8.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "What is left to say ? Nothing, I think. It's the best war movie ever, so that it belongs to the 10 best pictures of all time. Everybody who has never seen this one has missed a piece of culture !!!"
    },
    {
      "rating": "8",
      "text": "Well, my favorite movie of all time is Apocalypse Now. But I mean the original theatrical cut, this Redux version is okay, but all the added scenes is really pointless and they can really do without."
    },
    {
      "rating": "10",
      "text": "Best film ever... Wonderful depiction of human psyche transmitted by making you feel the message."
    },
    {
      "rating": "10",
      "text": "Never saw it until it popped up on Netflix and I am glad that I did. It's such a fantastic movie, I really have no complaints about it and that's pretty rare. Glad I watched the extended cut too because it really does help tie the film together."
    },
    {
      "rating": "9",
      "text": "This movie can show what a movie can be. It is dark, violent andamazing. I will reccomend it to everyone tht is thinking of watching it. It is absolutely amazing."
    },
    {
      "rating": "8",
      "text": "To what extent should you go to tell your story or finish your work? Francis says, hands down forty years to just begin with.Apocalypse NowFrancis Ford Coppola might possibly the only director whose multiple films come under hot debates like, \"Which film should be considered the best among the entire cinematic history?\" It goes without saying that Apocalypse Now is a top contender. And not for the amount of work that went just in production and post production- the editing factor is still the most changingly controversial aspect of the film, there have been three versions where actually none of them matches the huge length of the original shot. Leaving all those post success debates behind, the film in its entirety is a battle for sure; mind you, I am taking all the versions into account and also no matter what I say, some of this or all of this has already been said about this classic over the years and even generations.The film communicates the threat of the battle by challenging its audience first and foremost. And you'd think that it is not fair, since the film is the one with the voice and the stage. Francis even describes this unfair advantage in the narration by changing the perspective of the viewers about war. And the horror strikes you then, when you realize how easy the war was.How Francis has crafted the most sinister deeds easily accessible. The chilling sound effects of the helicopter is your secondary concern, the primary is its ability to mask itself as God and snatch the basic rights of a civilization. Another thing to note here is how the terror of war is not only expressed as a form of an attack but a defence mechanism too. The most natural instinct is burned to an infernal excuse to breathe. Easily, the film is not for everyone. It makes you think how completely different certificate should be allowed to such classics."
    },
    {
      "rating": "8",
      "text": "Francis Ford Coppola played the sorcerer's apprentice in this movie but, contrary to what happened with the legendary apprentice, the magic went very well. But this film is not about reality or the real Vietnam War. We may regard it as a parody or a joke, but I think its deeper than that, its a statement of the director's opinion regarding the war, in particular Vietnam. And Coppola's statement is crystal clear: war was a total disaster where thousands of Americans died in vain and any war is always the apocalypse. Coppola wanted to give the public a view of this through this movies and we can prove this not only by the shocking graphic violence that punctuates it but also by the dystopic form as the conflict is portrayed and narrated. This way of facing the war is also evident in some of the dialogues. Its as if the war transformed the human being into the worst and raw of the animals, according to Coppola's mind. At first, the film was largely softened with various cuts but, recently, a DVD with an extended version appeared on the market. I understand the reasons: at the time, Vietnam was a hot topic, Coppola wanted to raise awareness and show what he thought about it but he might not want to hurt social morality. But today things are different. The scenes with the Playboy bunnies, however, seem to be left in the film, though they look as animalistic as the soldiers, as if they were objects and not real women.The film features an extraordinary Marlon Brando (for me, it is his best film after \"The Godfather\") and a good Martin Sheen, alongside Robert Duvall (who would specialize in action films and hard characters), Laurence Fishburne , Harrison Ford (still far from stardom), Dennis Hopper and Scott Glenn. All the actors have been quite well. The film has a constantly very heavy environment and the combat scenes were filmed quite realistically. I know some older people who have been at war (not in Vietnam but in Portuguese Africa) and cannot stand it because they feel again at war and awakens traumatic memories. So I'll leave the warning: if you cannot handle violent movies, if you're sensitive, suggestible or underage, do not watch this movie. Giving good advice never hurts, does it?"
    },
    {
      "rating": "9",
      "text": "Francis Coppola's haunting war movie \"Apocalypse Now\" presents (obviously) powerful performance from Marlon Brando and a lasting appeal. Easily one of the greatest, and possibly the darkest, war movie I have ever encountered. -REDUX VERSION-The movie once again throws us off the hook with chilling cinematography and realism. However, most of the added parts are trivial and have no depth in scene compared to the original scenes of \"Apocalypse Now\"."
    },
    {
      "rating": "10",
      "text": "Best film ever made. Simple as that. The effect it has on your emotions, one minute you're smiling and laughing along, then it will suddenly skip to silence, and death, and horror... The horror. You can't miss this one."
    },
    {
      "rating": "10",
      "text": "The BEST movie ever."
    },
    {
      "rating": "10",
      "text": "Apocalypse Now is one of the most awe-inspiring films of all time. It truly is, in every sense of the word, a masterpiece."
    },
    {
      "rating": "10",
      "text": "THE Vietnam movie, yet it's below Inside Out? I struggle to see the logic in that, given the scope and magnitude of this movie. War/military movies aren't for everyone nor is this, but it's jarring at the very least. I prefer the Redux version, because it includes the French colonist bit that is important when we're talking about Vietnam, but even the documentary about the film is better than a good dozen films above this on the list. If you haven't seen it, you simply must, if only for Brando's Kurtz. I suggest you read Heart of Darkness first, but it's not a necessity."
    },
    {
      "rating": "10",
      "text": "My personal favorite film of all time. It changed the way I view film, art, and even life. The acting is flawless, it has the most beautiful cinematography in the history of film, the messages are powerful and haunting. It stays with you the rest of your life. Which is something not many films can claim."
    },
    {
      "rating": "3",
      "text": "Apocalypse Now was bizarre, and I didn't understand it or enjoy it. I got the feeling that it was supposed to be the skewed memories of a mentally ill soldier's experiences in the Vietnam War, and it was somewhat interesting in that light, but that aspect didn't keep me interested for the entire two-and-a-half-hour running time. It was slow, weird, and boring at parts, and at others it was too fast and saturated with ridiculous action shots. The entire thing, though, was confusing to me. Every character seemed to act so strangely with no given explanation as to why, and while this would make sense if the movie was indeed shown through the eyes of a madman (or if everyone was a madman), it was still be frustrating to watch. There were also lots of fireworks posing as rockets and gunfire, and there was a good deal of cheesy synthesizer music that didn't help the movie. I couldn't find much to actually enjoy or appreciate in Apocalypse Now. I seem to be a small minority in my opinion of this film, I do realize, but I just want to make my voice heard so new viewers don't think that this movie's supposed \"universal acclaim\" is actually universal."
    },
    {
      "rating": "0",
      "text": "The original was a classic. Flawed, but still a classic. This new version adds 49 minutes that's virtually worthless, not to mention tedious - a French plantation sequence seems to go on forever while adding little to the picture. Rent it and watch it ONCE, but don't count on loving this version more than the original."
    },
    {
      "rating": "5",
      "text": "There are really good things in this film. It is really original, and I love the way it reaches such an spiritual atmosphere without ever losing the sense of reality. Nevertheless, this long version of the film is terribly slow and boring. I kind of lose interest very early."
    },
    {
      "rating": "8",
      "text": "I'd love to say this movie is great. I really would. The message that is trying to be delivered is valient, and I applaude Coppola for his efforts. And the explosions. Oh the explosions. The action is AMAZING. I loved it. But there is a reason this movie doesnt get a 9, or even a 10. The sheer weird factor. I know thats part of the whole Apocalypse Now vibe, but this movie is surreal to the point of annoyence. A rent. Just watch it, and be disturbed."
    },
    {
      "rating": "7",
      "text": "It's never quite the film it wants to be. It's more than just the river in this film that is full of meanders and the final 40 minutes of the film is no help what so ever. Still, there are some mesmerising sequences, not least of those being the air attack to the soundtrack of \"Ride of the Valkyries\". The photography is also gorgeous."
    },
    {
      "rating": "5",
      "text": "The original balanced all the elements out nicely to make a terrifying, disturbing and utterly brilliant film. The redux version messes up this fragile balance by adding too much uninteresting new material that ruins the pace of the movie completly. I was particularly disappointed with the playboy bunny reprise- sheen and co are supposed to be in hell..there are no obliging playboy bunnies in hell. And the French colonists scene was so boring- it served no purpose. I fear this version has almost ruined the original for me!"
    },
    {
      "rating": "7",
      "text": "Sent on a mission to assassinate a rouge officer, Captain Willard (Sheen), must head deep into enemy territory, coming face to face with the horrors of war.\r A superb central performance from Martin Sheen helps Apocalypse Now through a sometimes uneven script and lack of pacing meaning the film largely still stands up today."
    },
    {
      "rating": "4",
      "text": "This movie is really boring and made me sleep in 10 seconds. Its just a bunch of poor Japanese getting nuked by Americans. Really, no point of watching it."
    },
    {
      "rating": "0",
      "text": "this movies was unbelievably slow and long i got sleepy half of the movie marlon brando was just money grabbing **** ,of course this get so much praise because it's the godfather film's director ,the title of movie should have been \"drunk american got crazy\""
    },
    {
      "rating": "9",
      "text": "The movie, with or without the redux, is brilliant. It starts off with a very real perception of PTSD and progresses into showing the madness of war and what it does to the mind. Martin Sheen along with the rest of the crew do an outstanding job of portraying these characters. I believe the best part is towards the end with Marlon Brando. He does a great job of showing the mind of a man who is otherwise broken but can see some truths to our society. I thought the part with the hollow men and the books that they reference were a nice touch and conveys the point well. The only problem with this movie is that it feels a bit dragged out at some parts especially with the french dinner scene. With that said it's still a fantastic movie and definitely worth watching!"
    },
    {
      "rating": "10",
      "text": "Y llegó la hora del apocalipsis, la película que me estaba guardando para la ocasión. Y por supuesto, no defraudó, ya desde el primer plano al ritmo de \"The Doors\". Magistral. La película narra el HORROR de la guerra. Aún así, no llega nunca a ser la típica película bélica. Con momentos muy oscuros dentro de la misma. algunos más que el fervor de la batalla reside en algunas conversaciones. Y todo esto por no mencionar la excelente manera que se nos narra la historia a través de los ojos y con la voz en off del capitán Willard.Un capitán Willard que está sensacionalmente interpretado por Martin Sheen como todos sus compañeros de 'viaje'. Y al final con el personaje de Brando, que mucha gente difiere en él, a mí me parece sensacional. Realmente es el protagonista de esta \"historia\". Tiene un momento monólogo que es de lo mejor de la película.A partir de aquí, iré al grano. El final, ¿me parece muy extraño? Sí. Pero no por eso me parece malo, pero ni mucho menos. Es cuando Coppola decide darle de verdad en tono de oscuridad visual a la película que va en concordancia a lo que está contando durante la misma.En conclusión, 'Apocalipsis now' se convirtió en una de mis 5 películas favoritas. El momento helicopteros. El momento espectáculo. Para mí, este film es el mejor bélico que se ha hecho nunca y una de las mejores películas de la historia del cine. Una obra maestra. Un 10 absoluto."
    },
    {
      "rating": "0",
      "text": "A pretentious load of nonsense, badly acted and full of ham-acting performances. It is hard to say whether it is meant to be a satire , or is just a third-rate puerile comedy. Of course tosh like this, masquerading as \"Art\" is beloved by critics who wouldn't know a good film if it slapped them round the face with a wet kipper. Josef Konrad must be turning in his grave."
    },
    {
      "rating": "10",
      "text": "Dr. Ryan Stone (Sandra Bullock) is a brilliant medical engineer on her first shuttle mission, with veteran astronaut Matt Kowalsky (George Clooney) in command of his last flight before retiring. But on a seemingly routine spacewalk, disaster strikes. The shuttle is destroyed, leaving Stone and Kowalsky completely alone - tethered to nothing"
    },
    {
      "rating": "10",
      "text": "Apocalypse Now rushes at you like a bolt of lightning. By the beginning your confused and by the end let's just say your even more distraught. This classic by Francis Ford Coppola is genuine and brilliant in many ways. The movie obviously based on the novel Heart of Darkness by Joseph Conrad is very violent in a disturbing way but shows the reality and pain war causes. The movie has an all star cast including Marlon Brando, Martin Sheen, Robert Duvall and Dennis Hopper who all do fabulous but don't forget about Little Laurence Fishburne who does a great job himself. The movie is a portrayal of mental objectives in a way. The themes that leave you awestruck in the movie are the themes that at times are the most brutal. One is war is total .... . [***SPOILERS***] By all the deaths that took place in this movie and the controversy of Marlon Brando's character Colonel Kurtz. The other theme that left me stunned that was really brought out through the whole movie but you only understood near the end when Kurtz is talking to Willard ( Sheen ). Death can only be your friends by the way you take actions towards people but if not the correct way death is your enemy. Which is definitely a very thought provoking and extremely disturbing idea. Still the movie suceeds in every aspect."
    },
    {
      "rating": "9",
      "text": "I loved this movie and recommend it to many from young-adult to adult. I enjoy Apocalypse now and it is one of my all time favorite movies"
    },
    {
      "rating": "9",
      "text": "I find this film stunning. I also recall seeing the original version in high school and thinking it was terrible and disjointed (compared to a film I loved at the time and still do, Full Metal Jacket). I said as much to my high school English teacher, who told me I didn't know what I was talking about. He was right. This isn't a movie that most teenagers can appreciate. Now at age 32, I think it's one of the best-realized meditations on war and insanity ever made. I strongly disagree with the handful of critics who pan Brandon's performance and dismiss the final 40 minutes of the film. I found the added material in \"Redux\" to be enriching, not excessive. Martin Sheen is amazing throughout. This is one of those great movies that is also addictively watchable, because of its stunning visuals, genuine excitement, and serious consideration of how human beings can be tempted to play God."
    },
    {
      "rating": "10",
      "text": "A perfect ten. One of the greatest movies of all time is now longer and even more surreal. I can see why many people would find the original to be better, but I think this gives us more of what was already great."
    },
    {
      "rating": "10",
      "text": "Reminds us that cinema can truly be literary. A masterwork made much better!"
    },
    {
      "rating": "10",
      "text": "I was only disappointed that the movie ended. I could have watched hours more. The added scenes were all outstanding especially the additional Kilgore material. Even more than Platoon, it sums up my own Vietnam experience. Now where's Hearts of Darkness?"
    },
    {
      "rating": "6",
      "text": "It is the best Vietnam movie. But no war movie which presents only war facts and no morality apart of the 'who won is the best' has nothing worth to see."
    },
    {
      "rating": "9",
      "text": "This film is filled with so many visual metaphors that it will make your head spin. There is so much depth, and meticulous craft that overwhelms and intoxicates you as you watch. In some ways, this film isn't about the Vietnam War at all and is really just about how deep in the bowls of one's one subconscious one must dig to really figure out if they're insane or not. And even then, it's left answered ambiguously strengthening your feeling of unresolve."
    },
    {
      "rating": "10",
      "text": "A cinematic triumph in every way, excellent writing, superb cast and wonderfully acted (Sheen, Brando and Duvall and all excellent) I've only recently watched this for the first time as I purchased the collector's edition blu ray and haven't yet watched Redux, but the original is the best war film I have ever seen, and it has firmly put itself in my top 10 all time favourite movies"
    },
    {
      "rating": "10",
      "text": "Richly dark and beautifully hallucinatory, Apocalypse Now like the greatest war movies picks no side, but rightfully informs us of the horrors of war on an primordially human level."
    },
    {
      "rating": "10",
      "text": "One of my favorite movies of all-time. It is absolutely unrelenting in maintaining a constant disorientation and incredibly disturbing tone throughout."
    },
    {
      "rating": "10",
      "text": "The time comes for everyone. Never at the same time or under the same circumstances. But it does arrive. Loss is unavoidable. Whether it's our sanity. Our dreams. Our hopes. The very identity of who we once were. Definitely friends and family. Those usually go or rearrange themselves into a new unexpected landscape. Loss. One way or another. Whether we admit it or choose to live in denial. Loss is there to stay.Milius and Coppola made it clear. Their message of loss and madness stays with you in a haunting way. You just can't wash it off. \"The horrors,\" Brando insists. The things we see. We experience. We find ourselves doing. Who are these new men we've become along the way. Where is that guy I left behind when I started? Is there ever a true way back? And if so, to where?There is no doubt the content of the film carries a truly emotional and psychological impact. Yes. The context is war. The most extreme of violent acts. A perfect metaphor for the loss of innocence and the discovery of life's real intent. It turns out life doesn't always have your back. No matter how good you are. No matter how good a side you fight for. Sometimes life just doesn't have your back. All characters are great studies of humanity's journey. But some of the more obvious ones can't be avoided. Like those Playboy models. So glossy and hopeful in their early arrival. Fireworks was the theme. The object of everyone's dreams. Dreams finally buried in mud and despair inside that rain soaked tent. Innocent beauties confessing their sacrifices while handing over their honor as if it was a buffet. Tall price to pay for one's dreams. \"They made me do all kinds of horrible things,\" she says. \"I just want a simple boy to like me... Are you a simple boy?\" And then the next guy interrupts, \"I'm next madam.\" The things we sold along the way. And to make the irony colder let's not forget that those girls traveled to the front lines to 'help' the soldiers. They just didn't know how deep a sale this was going to be.Remember the French? Holding on to their family land next to the river? There for generations? But they do say they came from France, brought the supplies from Brazil, and taught the locals to work with them. To save them, as they say. Was this education in exchange for slavery? I didn't see any Vietnamese workers at that lavish dinner table. Are the once ignorant locals glad to be enslaved? Whose land is it then? Perhaps the French will die in this land after all. Perhaps someone will educate them on a new form of slavery. The slavery to your land that was never yours.The final discovery of Marlon Brando was epic. You can feel that man's energy jumping out of the screen. Each and every one of his words perfectly calculated. Telling us of the propaganda of war. The perpetuity and necessity of the lies. The machine that moves all of us. Influences us. Tricks us to participate willingly. Is this war just a backdrop for life's journey. Who do we lie to? Others? Ourselves? One day this war will end. And then what? There is always room for fresh new lies to believe.Martin Sheen was amazingly handsome in this movie. Great shape. A man's man. I always forget Martin was once a great good looking stud. He seems to have aged fast into his more mature roles of late. Regardless, the acting was on point at all times. As if made of steel. Where do you take your acting career from that? Perhaps that's why his role seemed to mature so quickly after Apocalypse.Marlon Brando can't truly be congratulated in words. The man's talents are pure art in motion. You simply surrender to the beast and let him take you whole. He's barely in the movie, yet there were times when I though he was going to reach out of the screen and grab me. Amazing.The rest of the cast was rounded to perfection. Who could forget Robert Duvall? Genius! The part reads as if written expressly for him. I would have given him back the surf board. Don't wanna mess with that guy.The film made me a bit nostalgic of older movies. We have to keep in mind this production took place before digital imagery was the soup of the day at fifty cents a pop. Those explosions are real. The groups of helicopters are real. The airplanes doing fly overs and blowing up crap, well, they are real. That's film making with balls. Coppola had the privilege of directing the real thing. No green screen in sight. It must have been an amazing experience. Although, if we put the time of production in perspective, that is, the seventies, Francis was probably doing business as it should be done. \"OK. We need a dozen helicopters over there!\" Awesome. What balls."
    },
    {
      "rating": "10",
      "text": "A masterfully done movie. A nearly flawless modern adaptation of Heart of Darkness. Great writing, great acting and great directing. The only notable problem is that Brando is packing on just a few too many pounds to be a perfect Kurtz."
    },
    {
      "rating": "9",
      "text": "The original film is engrossing, riveting, brilliantly directed, and superbly acted. Easily the best films I have ever seenandalso one of the weirdest films I have seen in general."
    },
    {
      "rating": "9",
      "text": "Being unique is not always a positive attribute for a film, but with Apocalypse Now, Francis Ford Coppola’s devastating portrayal of the Vietnam War, it most certainly is. At least in my opinion however, the two-and-a-half-hour-long depiction of war’s atrocities is not that great when regarded simply as a film; it’s much more a work of art, drastically showcasing the futility of this notorious bloodshed, resulting in millions of casualties over its duration of almost 20 years. Apocalypse Now fuels hatred and incomprehension for these happenings in the audience and makes a major pacifistic statement through the metaphorical journey of one man. But apart from the stunning cinematography, the 1979 epic lacks some cinematic traits to make it a thoroughly thrilling and rewatchable experience and can thus not get a top rating from me when regarded as a film."
    },
    {
      "rating": "10",
      "text": "The best war movie ever made."
    },
    {
      "rating": "8",
      "text": "Part inspired successor to Joseph Conrad's classic novella \"Heart Of Darkness,\" part pulse-pounding portrait of an era/place all too rife with chaos, and part expressionist fever dream of all the worst, yet still somehow beautiful looking imagery you could possibly imagine baring witness to, Francis Ford Coppola's \"Apocalypse Now\" really needs no academic, film fan, or Joe Shmoe to confirm its resonance as a cinematic classic. But, if I were to try my hand at doing so, I'd say that it really, truly is all of the aforementioned. It's nightmarish, eerie, undeniably well-performed, incredibly well-staged, and featuring some supremely keen set piece design. There's almost nothing about this movie that doesn't feel like it could have been made yesterday. Except for the music. Yes, I'm going to be that guy. And, no, I'm not talking about the brilliant, temporally evocative usage of The Doors' classic hit, \"The End.\" I'm mostly just talking about the synth-heavy score, which -- although ahead of its time as per the film's release -- simply isn't as timeless as everything else on display. Still though, the overall experience is nothing short of revelatory. If you've been busy being a fool like I've been for the past two decades and haven't seen this; get to work. You won't soon forget any of it."
    },
    {
      "rating": "10",
      "text": "The moment we are introduced to the main character, it's clear what the war has done to his mind. He is in a haze. Part of special operations, his tasks often involve assassinating people deemed hazardous to the war effort. He is not expected to think for himself. Actually the dossier he is given over his next target he only opens to read once he has set off for the mission, and it's instantly clear that even if he could find sympathy for his target, he must at all costs finish the mission.\r The focus here is of course on the Vietnam War. A colonel has gone renegade and needs to be killed. A captain is sent to do the job. On his way he comes across various units, one of whom treats war as a picnic outing. Human nature, it would seem, would politicize almost anything. Video cameras roll as soldiers pretend to be caught in an ambush. Officers having their pictures taken for publicity stunts. This would have been disturbing in itself, this total disregard for human suffering, of the people of the land they have invaded and their own wounded and killed. But it is apparent that these men only do these things to feel normal, or whatever passes for normal during a bloody war.\r As the captain travels up the river, the banks are littered with unattended dead. No one has the time and the interest to bury them. The whole pointlessness of war is shown with poignant imagery. One would think two wars that caused the deaths of tens of millions would have been enough to teach mankind the lesson of a lifetime. Still about one and a half million Vietnamese had to perish, not to count the dead of several other wars. And the lesson is still not learnt.\r It becomes more disturbing as Captain Willard goes deeper and closer to the source of the conflict. Command structures have completely vanished. A mass hysteria seems to have gripped these men. They joke and laugh like maniacs and kill with complete apathy. This before Willard has even reached his destination. But nothing prepares you for what awaits him at the end of his journey. The colonel has gathered himself a cult following of native Cambodians and Vietnamese among some Americans too. That place gave me the creeps.\r The film explored how the violence and cruelty of war alters the nature of men fighting it, especially wars of an imperial nature. How the soldiers become desensitized and dehumanize everyone, suspect everyone, kill with impunity. They may not be aware of this at the moment, but killing a human being, even one you will always consider somewhere between your pets and an insect, will have an effect on you. Coppola succeeds in showing this message loud and clear.\r Martin Sheen tackles his character with a relaxed laid-back approach. He is in no rush to reach his destination. The journey is the real part of the story. But when he does reach the colonel, even after everything he has seen on the way, including his own slip of character, he still is surprised at the colonel's doings. Marlon Brando plays a lunatic with extreme precision.\r This being a war movie, the scale of the human involvement and military machinery was captured effectively. The costumes and make up department did a wondrous job. The equatorial climate has everyone perspiring constantly. You know that they hate the weather, the country, the jungles, and most disturbingly of all, the people. Their dead count for nothing and they lie and rot.\r I must admit that this movie made me very uncomfortable and unsettled at times. The way some of the characters seem to lose their minds is palpable and frightening, like losing it is itself chosen as a way to remain sane in the face of such devastation of human lives."
    },
    {
      "rating": "10",
      "text": "This is my favorite Martin Sheen movie! I think I saw him on TV recently as I channel-surfed. I think the show was called Breakthroughs with Martin Sheen."
    },
    {
      "rating": "8",
      "text": "A philosophical movie about the Vietnam War/American War. A good, strong cast of characters  but there are far too many and most are only on screen for 10 minutes meaning that development amongst characters is minimal if present at all  and the third act is much weaker than the rest of the film  and is also quite horrific. Unpleasant at times, but offers a realistic insight into a historic moment. Generally over-hyped, but overall a decent effort."
    },
    {
      "rating": "9",
      "text": "One of the greatest war movies of all-time with many of the most iconic moments and quotes in cinema. This film took so many hardships to make and Francis Ford Coppola definitely made history."
    },
    {
      "rating": "10",
      "text": "A Phenomenal triumph! Haunting, powerful and an outstanding piece of cinema. A very dark and psychological war film, with a great, powerful and memorable performance from Marlon Brando, as well as the rest of the cast who are all terrific. The action, destruction and every little detail is tremendously captured on camera. Rarely in movies can the film makers make such tension between characters, using superb lighting and soundtrack. The air assault on the village never gets old, love it! Classic masterpiece!"
    },
    {
      "rating": "10",
      "text": "Anyone reading this now is reading my full honest review of this legendary picture, and while the original is classic the Redux is Legend...\r Obviously any film enthusiast can agree that \"Apocalypse Now\" is essentially a War film like no other.\r A tense hullucinogenic, physically exhausting movie which can be only be described as part War, part something that doesn't really have a Genre, Apocalypse Now is something indescribable unless you see it and even then it's hard to put into words, as Roger Ebert said in a statement too true: \"Longer or shorter, redux or not, Apocalypse Now is one of the central events of my life as a filmgoer\".\r Again one thing i love about this movie is the success it had after going against all odds in Pre-Production, for those who don't know Brando showed up way too overweight and was reportedly very hard to work with and would require a body double, Martin Sheen had a Heart Attack at the age of 36 and returned to work a month later, What would be a 16-week shooting took over 239 days of torture, Typhoon Olga destroyed many expensive sets, extras and crew all got malaria and disease, Sam Bottoms (The actor who plays Lance) was constantly on drugs while shooting, Martin Sheen's brother did half of the Voice-Over Narrative due to his Brother's Sickness, the killing of the water buffalo attracted obvious animal protection laws, the ending was re-written countless times, Coppola had to make a film out of 2300 hours of recorded footage and of course for obvious reasons Francis Ford Coppola threatened suicide countless times.\r That's just a handful of problems and stuff that happened (if you're interested in learning more go watch his wife's Documentary about the movie, \"Hearts of Darkness: A Filmaker's Apocalypse\").\r Finally beginning the movie Hellicopters fly across a burning jungle all while \"The End  The Doors\" plays out, Captain Benjamin Willard (Martin Sheen) is Drunk, Drugged out and wasting away in a room in Saigon (Anyone anctious to know this was shot on Martin's 36th Birthday who actually WAS drunk and drugged out, he told Copolla to film what was happening and leave him to it, what happened as you saw he actually broke the mirror, bled out then reportedly attacked Francis, who's crew were so frightened they wanted to stop yet Coppola ordered to continue.)\r Being called upon by Generals (most notably a cameo by Harrison Ford under the name General. Lucas \"wink\") he is ordered to exterminate \"with extreme prejudice\" General Walter Kurtz (Marlon Brando), A Green Barret who's literally gone off the deep end.\r What follows is Willard's mission up the Vietnamese river on the boat narrating his views on the war and Kurtz in the Dossier given to him questioning his respect for Kurtz as well as his mission.\r With his crew (among them Laurence Fishburne's first role), there all of them witness the horrors of the war and a vital lesson: Never get off the boat.\r On their journey they encounter kind,yet nutcase Seargent. Kilgore (a manic performance by Robert Duvall) who utters my favourite quote \"I love the smell of napalm in the morning, A Tiger, Playboy Bunnies (including real-life playmate of the Year Cynthia Wood) A Sanpan, abandoned troops, the French (In a mansion scene which should have stayed out the redux) and finally at the \"Heart of Darkness\" (arriving at Kurtz's location)\r Arriving at the location where Kurtz is, is like jumping into a whole new movie, the natives see Kurtz as a God-like figure who constantly offer his views on life, war and everything in general one person who takes it too literally is an american photographer known only as \"the photojournalist\" (an expertly casted Dennis Hopper), Seeing Kurtz for the first time is probably one of the most chilling, tense, surreal moments in Motion Picture History.\r The ending reflects the beginning with \"The End\" blaring out again as well as luckily being able to hear Kurtz's view like we did Willard's.\r Not giving away the ending it is, in the sickest sense beautiful, unexplainable, and left me as physically exhausted as the soldiers (It should be noted that many people who have seen it have declared it so very accurate to how it was like experiencing Vietnam.\r Martin Sheen and Marlon Brando are unforgetable characters, Sheen to me represents the every day soldier, ultimately he decides to just go with the flow and do what is neccesary to survive no matter how truly horrible it is. Brando on the other hand playing such a high ranking officer has seen more and therefore lost all hope for humanity and above all himself, making me wonder at the end will Willard be destined to follow in Kurtz's footsteps?...\r Aside from that everything is just incredible, the supporting actors, the destroyed jungle, villages, vehicles \"The Attack of the Valkyries\" helicopter Scene is something i don't think i'll ever forget and though the Redux is in a sense too extended for it's own good, it will forever be a question to me what my opinion would be had i seen the original version first.\r Final Verdict: Francis Ford Coppola Thank you, Thank you Sir for one of the greatest experiences me as a film fan and movie goer could possibly have. there's really no way to end this review due to it's magnitude, but please do see this movie as soon as, it's so incredibly hard to find on DVD in the UK and that's wierd considering it just had a sudden re-release in theatres last April."
    },
    {
      "rating": "10",
      "text": "Classic anti war movie, that focus on the destroyed psychos of the soldiers. Sometimes the scenes are too long, but some are legendary. There are many top and famous actors also (did you recognize Laurence Fishborne?)."
    }
  ]
}