{
  "id": 35,
  "title": "Casablanca",
  "starring": [
    "Humphrey Bogart",
    "Ingrid Bergman"
  ],
  "runtime": 102,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "In Casablanca, Morocco in December 1941, a cynical American expatriate meets a former lover, with unforeseen complications.",
  "releaseYear": "1942",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/5K7cOHoay2mZusSLezBOY0Qxh8a.jpg",
  "categories": {
    "plot": 9.333333333333334,
    "acting": 9.210526315789474,
    "ending": 9.0,
    "soundtrack": 9.0,
    "cinematography": 10.0,
    "familyFriendly": 4.0,
    "funny": 4.0,
    "action": 9.333333333333334
  },
  "reviews": [
    {
      "rating": "10",
      "text": "“Casablanca” is a wonderful movie.  For reference, I just watched it for the first time ever in 2021.  “Casablanca” is a story of convictions, romance, and lost love.  Right from the beginning it throws so much at you that it is hard to keep up, and the story goes in so many unexpected directions.  There are a ton of characters, and yet somehow, every one of them, with the exception of the Nazis, won me over.  This movie is super heavy on dialog, but unlike modern cinema where characters talk just to fill time, the dialog in “Casablanca” feels like it is all in support of the plot, which forces you to hang on every word or else you will get lost. Anyone with a tolerance of full framed black and white should be able to take something enjoyable away from this movie.  I give it an A - Make a point to go see this movie."
    },
    {
      "rating": "8",
      "text": "This was a great movie, I really enjoyed it. I hope they come up with a sequel"
    },
    {
      "rating": "10",
      "text": "Casablanca is just an extraordinary film, if I had to describe it in one word, it would have to be perfection! I honestly don't care that it's an old film, I personally think that's not a convincing enough excuse for hating a film as wonderful as this , because you are seriously missing out, if you haven't seen it. The cinematography is just fantastic, with clever brooding camera-work. The music by Max Steiner is outstanding, from the sweeping haunting love theme As Time Goes By, to the excerpts of the french national anthem. The scene where everyone starts singing in the café was extraordinary and one of the many highlights of the film. The screenplay is unquestionably one of the finest in the history of cinema, right up there with Shawshank Redemption and All About Eve, containing great memorable lines such as \"seems as though Destiny is at hand\". The performances were superlative, Humphrey Bogart giving one of cinema's greatest lead performances as the \"cynical sentimentalist\" Rick Blain. Also superb are Ingrid Bergman who positively lights up the screen as Ilsa, the young woman who breaks his heart, Paul Henreid as the fugitive husband, and Claude Rains as Captain Renault. The plot is a little complicated, but I couldn't help being impressed with the performances and the screenplay. Not to mention a timeless love story that I don't think has ever been topped. Overall, a masterpiece, that quite rightly received an academy award for best picture. 10/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "This is truly one of the greatest movies of all time. It is the start of so many trends that are taken as commonplace now in filmmaking. The characters and how they develop are so amazing, and it's impossible to watch without  empathizing with the resistance.I wonder, is this the first movie with a surprise twist at the end? If you haven't seen it, do yourself a favor and watch this one immediately!"
    },
    {
      "rating": "9",
      "text": "I had to try watching this movie twice. First try I can't stand it. Felt bored. But years later I try it again and it worked. The story becomes quite interesting since Ingrid Bergman show up and the ending, omg, one of the best ending ever!"
    },
    {
      "rating": "10",
      "text": "A time-lapse video, gentle and romantic song, warm and deep song.  In the light, Rick once said that there are so many cities and so many pubs in the world, but she just walked into mine.  Oh, many flaming love words.  And I suddenly remembered a flower called Casablanca. Some people said it was the most beautiful lily in the world."
    },
    {
      "rating": "10",
      "text": "As Time Goes By, even in a 100 years, Casablanca is Casablanca, the movie with full of greatness, a Masterpiece, smart, beautiful, and simply one of the greatest movie i've ever watch."
    },
    {
      "rating": "10",
      "text": "Embarrassingly, I first saw this film on a 5 x 5 inch screen on the back of a bus seat coming back from a ski trip, but it was still one of my all-time favorite movies after that first viewing.  The writing is incredible, the acting brilliant, and just the feel - the elegance of it all - was amazing. And I didn't even take into account exactly when the movie was released at that point.  Remarkable."
    },
    {
      "rating": "3",
      "text": "Boring. I'm glad that it's only 1h40min long. But, for the 40s, it was a good movie, I guess."
    },
    {
      "rating": "3",
      "text": "Does not live up to the hype. I'm guessing a lot of people who lived through WWII saw this and lost their sh&t, but it does nothing for me. Nothing grabs my attention here, iconic though it may be. I'm surprised it's fallen so low. It used to be the numero uno on every list."
    },
    {
      "rating": "6",
      "text": "Can't really see its significance but bravo! Americans can bring peace to a foreign family in turmoil."
    },
    {
      "rating": "3",
      "text": "It's a three-way wartime love story. The acting is superb. The script minimal but iconic. The plot lacks plausibility but it moves along. The director uses black-and-white to great effect. Enjoyable but dated."
    },
    {
      "rating": "0",
      "text": "What a miserable and overrated movie. I'm not even counting the fact that the film itself is quite biased. Don't spend your precious time watching it."
    },
    {
      "rating": "10",
      "text": "one of the films I have seen countless number of times.  Romantic, thrilling, wartime intrigue....  BOGART & BERGMAN - warner brothers at their 40's best!"
    },
    {
      "rating": "10",
      "text": "The timeless story of two lovers separated by World War II, and reunited by chance, and a need of life and death; give her beloved and her husband a safe-conduct to Lisbon, and from there to America. An immortal must to see. What also makes it special are the songs on the piano, and Bogart."
    },
    {
      "rating": "10",
      "text": "Exquisite. The plot appears so slow, yet it is stingingly quick at the same time. Clever, witty, and self-aware, the performances give Casablanca its justice. It indeed remains a stellar example of the Golden Age of Hollywood."
    },
    {
      "rating": "10",
      "text": "Yang kasih rate 0-3 berarti sengaja menjatuhkan karya orang lain, lu pikir bikin film itu mudah ? lu pikir penilaian sebuah film bagus atau tidak cuma dinilai dari plot nya / ceritanya saja misalnya ? kalo mau kontribusi kasih rate yang objektif lah, pertimbangkan aspek2 lain dalam film tersebut (unsur2 intrinsik film).  Saya pribadi sangat tidak suka dengan orang2 yang tidak menghargai karya orang lain, dengan melakukan penilaian hanya dari aspek2 tertentu, tidak menilainya secara keseluruhan (semua aspek yg ada dinilai) serta memberikan penilaian secara obyektif, bukannya berdasarkan emosi/perasaan sendiri semata, alias subyektif."
    },
    {
      "rating": "10",
      "text": "this is a best movie ever, one of the best movie ever, very recommended movie to watch and to learning."
    },
    {
      "rating": "10",
      "text": "Casablanca. Love and war. A perfect example of the fact that even after 80 years, Casablanca is a great movie. The main and secondary actors played their characters perfectly. Plot on A +."
    },
    {
      "rating": "8",
      "text": "A complex wartime story of morality versus desire as Bogart and Bergman flawlessly portray their roles of two characters who both have to stay true to their duty of standing up for what they believe in, despite their own underlying emotions.  You will be left guessing until the very end."
    },
    {
      "rating": "8",
      "text": "Bogart and Bergman are changing history, witness it now or a century later, something so pure as such, doesn't get rusty.CasablancaCurtiz is light on his feet and smooth as the Jazz that is continuously and melodiously played in the hotel. And I think it is his supervision that blends in sacrifice in romance, so pure and irreplaceable, that drama is overshadowed by its crowd pleasing concept. The director, Michael Curtiz installs tiny notions in the script that carves a momentum of live hotel and the do's and don'ts of a hotelier especially the magnetic reputation he or she juggles by dipping his or her hands on both the side of the dirt.The Robin Hood figure, is their way in, and with Humphrey Bogart playing one of the most iconic character, the first act of the film is building up his figure that is latter to be shattered with such fragility. But the final act is brimmed with charm, so where they actually had to work was the introduction. And choreographed like some exotic dance, the entire hotel that is mapped out in front of us, makes us feel like home something that has aged well over the years. Personally, I prefer the sacrifice of his hotel's fairness regarding the gambling policies.To me, that would always be the game changer, not only the actress's performance but the tone that shifts with such calculative baby steps that you are sinking in deliberately in those twinkling eyes. And if Bogart is boasting off with some of his best work then Ingrid Bergman definitely casts the magic powerful enough to rubble him down in a blink. Their equation is like some wine, you are buzzed with the aftermath soberness rather than their poetic romantic vacation. Casablanca defines the Hollywood version of Americana set in a different location, it was ahead of its time then and it is now; all hail the classic dish serving one purpose and one only."
    },
    {
      "rating": "10",
      "text": "I always say that almost every other love drama is based on this movie. Great actors, great lines, great music. Classic."
    },
    {
      "rating": "10",
      "text": "Watched Feb 10, 2018Needs no introduction, but what a film! I swear this has more iconic lines than possibly any other film."
    },
    {
      "rating": "10",
      "text": "Seventy-five year's later there is nothing more romantic than \"Casablanca\"."
    },
    {
      "rating": "9",
      "text": "My score 97Metascore / User score 100 / 92Tomatometer / Audience score 97 / 95IMDB 85(94.3)"
    },
    {
      "rating": "10",
      "text": "The best, GREATEST thrilling and inspiring romance movie ever made! Or is it the best, GREATEST inspiring and thrilling romance movie ever made? With 2 of the best movie characters ever portrayed: Humphrey Bogart as Richard Blaine and Conrad Veidt as Maj. Heinrich Strasser! Plus the best movie song ever sung: As Time Goes By! Also, 7 of the best movie quotes ever spoken: \"Play it, Sam. Play 'As Time Goes By'.\", \"Of all the gin joints in all the towns in all the world... ...she walks into mine.\", \"Here's looking at you, kid.\", \"We'll always have Paris.\", \"Ilsa, I'm no good at being noble. But it doesn't take much to see that the problems of three little people... ...don't amount to a hill of beans in this crazy world.\", \"Round up the usual suspects.\", and \"Louis, I think this is the beginning of a beautiful friendship.\" And the best movie score ever composed!"
    },
    {
      "rating": "10",
      "text": "I could write a 50k word review on this film because it is so masterfully made. But you should just see for yourself. Take the time to appreciate the characters, the atmosphere, the tension, and all this amazing film has to offer."
    },
    {
      "rating": "10",
      "text": "If looking to be entertained; if looking for classic Hollywood art; if looking for a stirring story; if looking for a classic romance; if looking for just an incredible movie in every aspect you needn't look further, Casablanca is what you have been looking for."
    },
    {
      "rating": "10",
      "text": "This is a movie that you simply must watch.It's the perfect combination of things you would expect from 40's Hollywood, but no movie embodied that old Hollywood feel better than this one. If it ever feels clichéd (and it does), there's a big chance this movie started that cliché.It can feel dated, but there's still a lot of power to it. An entire bar playing \"La Marseillaise\" to drown out the sounds of a group of nazis is as powerful as you can get while still maintaining just the right amount of Hollywood sentimentalism. And it all works wonderfully."
    },
    {
      "rating": "10",
      "text": "Casablanca. A wonderful film about love, honor and pride at one difficult time. Great acting was especially enjoyed by Captain Louis Renault by Claude Rains with Bogurt and Ingrid . An interesting story with a good ending."
    },
    {
      "rating": "8",
      "text": "This is, of course, a real film classic. I thought the music and the somewhat suave script stood out for me. It has quite a wistful feel about it. It features some classic lines of dialogue 'of all the bars in all the towns in the world, she walks into mine' etc. Its quite a laidback, easy watch. A good example of a classic black and white film, I would recommend it, yes."
    },
    {
      "rating": "10",
      "text": "The greatest romance tale ever. There is no denying it's just a gem, an absolute perfection , an exemplary artefact of cinema. Besides that what it is, is thought provoking, emotional, intriguing,melsncholic snd to top it off FLAWLESS. There isn't a single flaw. Story : Perfectly set, not to complicated, heartfelt precise Casablanca : part 1 HERE'S LOOKING AT YOU KID! The first part is fantastic the iconic scenes The  glass while kissing. The kiss The train sequence  The letter in the rain The saloon scenes The scene of tearsShe apporaching Rick for letters. The final here's looking at you kid. The fantastic twist ending. The brilliant screenplay, how perfectly everything ended up together This movie had me in tears, when the first al \"HERE'S LOOKING AT YOU KID, WE BOTH LOVE EACH OTHER, THIS IS THE BEGINNING OF A EAURIFUL FRIENDSHIP\"CASABLANCA IS MY FAVOURITE MOVIE OF ALL TIME IT'S A  PERFECT frickin 10Here's the CASABLANCA review:  10+/10The greatest movie of all time acc to me! Story and mood : Absolute perfection  10/10The beautiful story, the twist ending, the characters wow. Just perfection Cinematography: EYES TALK and that's what they do when you look at Casablanca, the tears, the emotions, the camera panning, the zoom, the wide shot, everything was shot to absolute impeccable perfection. 10+++/10. Even Schindler's list is inspired form it. It's just FABULOUS, VIVID, THE DEFINITION OF ELEGANT, THE CONVEYANCE OF EMOTIONS. WOOOOOW!!!!  Screenplay : you can define the impeccable quality of it by stating the fact that every single scene shot from the movie seems like it's just a  \"flowing river with a Reynolds number of 1000. The absolute impeccable piece that binds these jigsaw puzzle to quantum level precison. Idk  what I'm saying I'm dumbfound by it!! Even the bet of 10000 francs leading to \" The beginning of s beautiful friendship\" This movie is beyond WORDS.THE EPITOME OF SCREEN WRITING. THE GREATEST SCREENPLAY EVER WRITTEN. 10000000000000+++/10DIRECTION: the way the mood has been set snd everything directed, and the everest of craftsmanship shown by theNo of ￼iconic scenes this movie has . These are just few. Have 132 in total and even they don't do it justice. This movie is thought provoking, that s man does the righteous thing, the most cynical of all does the most sacred of rituals \" Let's his love go for her sake\" , becomes selfless. A woman who wasn't wrong by herself but time tuned the  tides on her. Evne the Russian bartender is fantastic AN ABSOLUTE MUST WATCH."
    },
    {
      "rating": "10",
      "text": "10/10........................................................................."
    },
    {
      "rating": "7",
      "text": "Talking about this film, i can`t say it deserves 100 or 10/10.I like it,but i still think it`s slightly overrated."
    },
    {
      "rating": "9",
      "text": "Hitchcock challenges our moral scruples with this mysterious thriller. The very natural talent of Stewart plays L.B. Jefferies, an adventurous man confined to his New York appartment through injury. The incredibly talented Kelly, plays his"
    },
    {
      "rating": "10",
      "text": "My fav movie of all time; love, war, music, interpersonal relationships, all-star movie within a tightly written script. In black & white & I understand that much of the script was written the night before they were filming."
    },
    {
      "rating": "9",
      "text": "An all-time classic that holds up 80 years later. In occupied Morocco, the decision to have every player in a major war together in one bar is pure brilliance."
    },
    {
      "rating": "10",
      "text": "If you don't like this film...................................................................................................................................................................................oh wait, how can anyone not like this film?"
    },
    {
      "rating": "7",
      "text": "I feel very bad with myself giving just a 7/10 to this, but I just didn't empathise with the characters."
    },
    {
      "rating": "10",
      "text": "Simply one of the best films ever made.  Humphrey Bogart and Ingrid Bergman are at their absolute best in this top-notch romantic drama film.  A must-see."
    },
    {
      "rating": "9",
      "text": "It's a classic, and I can't deny that, but I feel like it's gotten stale over time."
    },
    {
      "rating": "5",
      "text": "Just not seeing it with this classic, A little too slow and dragging for me."
    }
  ]
}