{
  "id": 141,
  "title": "Catch Me If You Can",
  "starring": [
    "Leonardo DiCaprio",
    "Tom Hanks"
  ],
  "runtime": 141,
  "genre": [
    "Drama",
    "Crime"
  ],
  "description": "A true story about Frank Abagnale Jr. who, before his 19th birthday, successfully conned millions of dollars worth of checks as a Pan Am pilot, doctor, and legal prosecutor. An FBI agent makes it his mission to put him behind bars. But Frank not only eludes capture, he revels in the pursuit.",
  "releaseYear": "2002",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/sdYgEkKCDPWNU6KnoL4qd8xZ4w7.jpg",
  "categories": {
    "plot": 8.73469387755102,
    "acting": 8.829268292682928,
    "ending": 7.8,
    "soundtrack": 8.0,
    "cinematography": 9.666666666666666,
    "familyFriendly": 8.8,
    "funny": 8.857142857142858,
    "action": 8.333333333333334
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Catch Me If You Can is a breezy, light Spielberg film full o charm and great performances, especially DiCaprio and Walken. Hanks plays the slightly inept FBI agent, and the move closes with a surprisingly fulfilling ending. It is 140 minutes of entertainment, and maybe even some themes in there somewhere."
    },
    {
      "rating": "10",
      "text": "Why hasn't DiCaprio gotten an Academy Award? Ever since I saw this film that question has hung over me. \"Catch Me If You Can\" is brilliant, a beautifully delivered movie in all ways. This film has it all, great actors, realistic and witty dialogue, amazing cinematography, flawless execution and the list goes on and on. Out of all of Spielberg's films, I have to say that this one is my favorite. A very entertaining and emotionally stimulating film that carries some of the most memorable performances I have seen ever."
    },
    {
      "rating": "9",
      "text": "This is easily the most underrated movie ever"
    },
    {
      "rating": "10",
      "text": "Catch Me If You Can is a true story and a triumph. This is a very different story and it's that uniqueness that lets you know it has to be true. You can't make this stuff up! Leo DiCaprio is amazing, showing the birth of one of the the countries all-time best con men, in a time when it was relatively easy to do. Tom Hanks is equally as good as the guy who's chasing him, showing once again why he has the reputation that he does. This is one of the best films I've seen in a long time, don't be a fool, you have to see this!"
    },
    {
      "rating": "8",
      "text": "A very entertaining and emotionally stimulating watch. Wouldn't say the film was unmissable but definitely a good use of some spare time. An interesting study of the sly and cunning of a legendary con artist , also on how simply appearance and sincerity on the exterior can affect human behaviour and confidence in the most powerful ways."
    },
    {
      "rating": "9",
      "text": "Starting with tasteful credits, and ending in one of the most iconic film pursuits."
    },
    {
      "rating": "9",
      "text": "Recently watched the movie, its entertaining, funny, gets you to think that with proper motivation you can achieve anything and in summary very well made film."
    },
    {
      "rating": "9",
      "text": "I watched this movie for a second time, and I still really enjoyed it. Though I must admit I do get a little fidgety at the start, finding it easy to lose interest for a few seconds, this movie never fails to catch my interest right back. The fact that it is a true story still amazes me, the movie portraying the story very well. It is a very fun and exciting movie to watch and the characters are played very well throughout the entirety of the film!"
    },
    {
      "rating": "8",
      "text": "This one is a Steven Spielberg biographic classic. The story of a con-man in the 1960s who conned millions of checks and took the role of becoming a Pan Am Pilot, a doctor and a legal prosecuter is very interesting to watch. To me, it was interesting to see Frank basically just go all over the place. The movie has some very talented actors like Christopher Walken, Tom Hanks and especially Leonardo DiCaprio. This is easily one DiCaprio's top 5 films of all time. He really plays the role perfectly and has that kid like sense in him that we haven't seen since \"What's Eating Gilbert Grape\". Plus, Tom Hanks was a great supporting actor. I've never seen him as one of those \"side characters\". However, he manages to give a great performance as Carl Handratty. As far as storyline goes, it's all over the place. There's just so much to keep up with, but with Steven Spielberg,  you're on a great journey with this likeable character. The movie does slow down at the end once Frank gets thrown in prison and eventually starts to work with the FBI, but other than that, the movie sets a good pace. Overall, it's an interesting biography on one of the biggest con-artist's in America."
    },
    {
      "rating": "10",
      "text": "The seductive real life drama of the meteoric carrer of the youngest artist of con. Absorbing and magneting Leonardo Di Caprio supported by strong casts of Walken and Hanks. Pay attention for cultural references and intro sequence."
    },
    {
      "rating": "10",
      "text": "Although too slight to make a serious dent, Catch Me If You Can is a very entertaining effort from Spielberg. I say 'effort', but it all seems so effortless. Everything combines excellently in this movie; the excellent performances, the breezy pacing, the tight script, the sumptuous period detail... It might not be epic or even particularly deep, but Catch Me If You Can makes for a fantastic popcorn flick."
    },
    {
      "rating": "8",
      "text": "Although too slight to make a serious dent, Catch Me If You Can is a very entertaining effort from Spielberg. I say 'effort', but it all seems so effortless. Everything combines excellently in this movie; the excellent performances, the breezy pacing, the tight script, the sumptuous period detail... It might not be epic or even particularly deep, but Catch Me If You Can makes for a fantastic popcorn flick."
    },
    {
      "rating": "8",
      "text": "This was the turning point of DiCaprio's career and when he went from a heartthrob to a legit actor. He matched Hank's tit for tat the entire film, Even one upping Hank's many times through out the film. It's truly well acted and quite interesting plot wise as well."
    },
    {
      "rating": "8",
      "text": "Catch Me If You Can is a very well made film who's greatest strength is its enjoyability. A very easy watch, this one is simply a fun and fast paced film that tells a riveting story that really hooks you in from the get go. Steven Spielberg directs this one brilliantly as usual and really tells the story of Frank Abagnale is a unique and enjoyable way. Leonardo DiCaprio is phenomenal here, as are Tom Hanks, Christopher Walken, Amy Adams, and Martin Sheen. Really great cast on paper and they all did a great job in practice. The film does a really good job painting Abagnale as neither a bad guy or a good guy, rather you just feel sympathy for him since he is so smart, but uses his brains to steal, which is too bad and, plus, his rough home life certainly makes him even more sympathetic. Overall, Catch Me If You Can is a really well told, well acted, and well directed, film, that is just infinitely fun to watch."
    },
    {
      "rating": "9",
      "text": "\"Breezy\" is a word I've seen thrown around a lot in delineating the chief merits of Steven Spielberg's \"Catch Me If You Can,\" and this is most definitely fun, rife with personality, and well acted on a comedic front. But let's not short the movie of its own dramatic worth. At its heart, \"Catch Me If You Can\" is not just the story of a young man forging convincing checks. It's the heart-breaking tale of the fallout that a broken home can leave lingering within the lives of its children, with the fallout in Frank Abagnale Jr.'s life namely resembling an addictive urge to cheat, steal, and run. The movie really wants us to remember this and I'm glad it does. This is also magnificently structured and executed on a screenplay front, featuring numerous twists, turns, and surprising scene dynamics that made me jealous as a screenwriter. And Spielberg's effectively expressive, period-focused direction almost needs no mention -- it's terrific work as per usual. In fact, this whole film is a terrific ride from start to finish."
    },
    {
      "rating": "8",
      "text": "Can glamor, style, beauty and charisma are better than the gross substance? Yes, Spielberg shows us that yes in its flash and as a director artificial version (took me to believe that he was the director  until you see the final) DiCaprio and Hanks form a formidable duo in an almost platonic friendship, the cast of support does their role well (especially C.Walken illustrating the figure of the patriarch example for family, good pint but insecure and flawed) catapulting stars at the time were mere adjuncts or doubt himself as DI Caprio, and Amy Adams (who knew) Jennifer Gardner.\rIts main defects are the means swollen end, and a certain indecision tonic, because it is not as funny as a comédiae not serious for a drama, but nothing that affects too, say that he is one of those movies that extol the quality of a director for its contrast with his previous films (which is not to say that the film is a masterpiece, but that impresses with versatility director, who is admit Spielberg)."
    },
    {
      "rating": "10",
      "text": "Extremely funny and genial. Abagnale's (Masterfully interpreted by DiCaprio) tricks near to forced out, but character's charisma and clever plot makes movie doesn't need to explain it."
    },
    {
      "rating": "10",
      "text": "Directed by Steven Spielberg and starring Tom Hanks, Leonardo Di Caprio, Christopher Walken, what more could anybody ask for ? Strongly acted, beautifully filmed, Catch Me If You Can successfully conveys a warm-hearted message not only about how the life of the probably most incredible con artist of 20th century, Frank Abagnale Jr. turned upside down due to the influence his father's lifestyle and personality had on him, which raised sympathy rather than hatred but also about an unbelievable friendship between him, a criminal, and an FBI agent who, while attempting to have him arrested, realized his potential to become the world's leader in financial crime investigation. This is such a masterpiece that i am shocked by the fact that Leo didn't win the Academy Award for Best Actor."
    },
    {
      "rating": "8",
      "text": "While the story is not entirely true, it's only inspired by the real story, this is still a very good movie. The acting performances were exceptionally great, the soundtrack was good, the story was interesting and well made and the movie was very entertaining. If you want a good con movie, you should definitely watch it."
    },
    {
      "rating": "8",
      "text": "Very well put together movie. This is a drama film that  will have you guessing what's to come. The conclusion is great, the acting is well done. The dialog in this is well written great movie highly recommend a viewing 8.9/10"
    },
    {
      "rating": "9",
      "text": "Catch Me if You Can is fun, energetic, and surprisingly touching. Leonardo DiCaprio and Tom Hanks both did outstanding in this movie and so did Christopher Walken. Catch Me if You Can is another great Steven Spielberg movie."
    },
    {
      "rating": "9",
      "text": "'Catch Me If You Can' is the most fun and intelligent movie I've ever seen, director Steven Spielberg has managed to craft a coherent and educational film that tells the amazing life of Frank Abagnale Jr. (Leonardo DiCaprio).\r Spielberg, DiCaprio, Tom Hanks and Christopher Walken clearly had a lot of fun making this movie and this is one of the reasons why I love the movies. I could watch this again and again and again. I have never had so much fun just watching someone lie their way to success."
    },
    {
      "rating": "9",
      "text": "'Catch Me if You Can' has such a talented cast, the true story is a fascinating one and while Steven Spielberg is an inconsistent director he was a big childhood influence and he has proved several times that he is capable of masterpieces of iconic status.While 'Catch Me if You Can' is not quite one of Spielberg's best films (in a list that sees the likes of 'Schindler's List', 'Jaws', 'Raiders of the Lost Ark' and 'ET'), it is one of his better later films, for me that's since 'Schindler's List'. There are occasional lapses into overly-sentimental schmaltz with the depiction of Abagnale's family life, not the first or last time with Spielberg and a long way from the worst case, but that is the one fault that was had for me.Spielberg directs impeccably, both in visual style and dramatic momentum, a directorial job that just screams of pure class. 'Catch Me if You Can' further benefits from as always beautiful cinematography from Janusz Kaminski and 60s period detail that not only looks sumptuously handsome but also evocative to make one think that it is more than just a film with a 60s setting.John Williams' score is not one of his best or most memorable, but still fits really well and has the right amount of slick jazziness, whimsy and understated pathos without over-emphasising (over-emphasis was the reason why his score for 'Amistad' was a rare misfire from him). The story takes a fascinating story and makes a ceaselessly engrossing film out of it, from the ingenious opening credits sequence to the heartfelt ending, the film is long but never feels it.This is further helped by a script that has a deft mix of genuinely funny comedy, poignant emotional moments and nail-biting suspense. The characters are intriguing. Can't praise the performances enough. Leonardo DiCaprio is movie star charisma personified, and brings wit, larceny and charm to a character that is a true crook in every sense but it is easy to see why one would fall for his actions.It is easy to overlook Tom Hanks, due to the role being not as colourful or as showy, but he brings charismatic command, generosity and doggedness in a role that could have been really bland and annoying in lesser hands. Of a sterling supporting cast, Christopher Walken is especially superb, particularly in the latter parts of the film as his life is ruined. Martin Sheen and Amy Adams are memorable, and Nathalie Bye solid.Overall, even if 'Catch Me if You Can' is not one of Spielberg's masterpieces it is one of his better later films and one of his most purely enjoyable ones. Well worth catching. 9/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "Great movie, awesome cast. Frank Jr, learns the craft of the con from Frank Sr. and perfects it. Jennifer Garner can use this as a springboard to bigger and better things. Perhaps someday Leonardo will be as revered and versatile as Tom Hanks is today but it's still a wonderful performance. The film slowed a bit in parts but it shows why Frank Jr. decides that he can not live with his parents."
    },
    {
      "rating": "8",
      "text": "Directed by Steven Spielberg and starring both Tom Hanks and Leonardo DiCaprio for like one of the best both Tom Hanks and Leonardo DiCaprio movies you'll ever see."
    },
    {
      "rating": "8",
      "text": "WHAT I LIKED: The story. Lots of films lack in that department, and this one certainly doesn't. With plenty of thrilling twists and turns you wont believe 'Catch me if you can is real.' What's more both lead roles are played brilliantly, and the characters are well developed by their actors and Spielberg alike\rWHAT I DIDN'T LIKE: Like many of Spielberg's films, this is too much crammed into one picture\rVERDICT: Splielberg's best film exceeds in so many ways: a thrilling story that you wont believe is true."
    },
    {
      "rating": "8",
      "text": "The larky \"Catch Me if You Can\" is like a trot around the track for the thoroughbreds involved, and one of the results is that it takes them far too long to get to the finish line. A good 40 minutes too long, this amiable account of the true story of teenage con man Frank Abagnale Jr. is a case in which the talented players could have won big had they cashed out much earlier; you can literally feel the returns diminishing the longer the game is extended.\r Abagnale’s autobiographical book recounts a youth so fantastic that it’s amazing it took Hollywood 20 years to get around to putting it on the screen. Reeling from his beloved parents’ divorce, the 16-year-old left home and discovered talents for survival that he readily turned into a genius for scamming. Playing out a string for an amazing five years, Abagnale successfully passed himself off as a Pan Am co-pilot, surgeon and lawyer while becoming a true master in one field in particular — that of writing bad checks.\r Although the film reps a lightweight breather between the darker and more grandiose projects Spielberg is taking on these days, there may also lurk a personal connection for the director with the subject of the film. After all, at the very same time Abagnale was pulling his stunts, the teenage Spielberg was dressing in coat and tie and trying to palm himself off as an executive on the Universal lot, a ploy that paid off when he got a TV directing gig by age 21.\r Setting a fizzy mood via some very mid-’60s animated opening credits and a jazzy John Williams theme that harks back to his “Johnny” Williams days as pianist for Henry Mancini’s orchestra, pic gets off to a jaunty start as DiCaprio’s Abagnale is introduced as one of three contestants on the venerable gameshow “To Tell the Truth.” Unfortunately, neither is the mood consistently maintained nor is the climax of the TV show ever shown.\r After beginning with a framing scene of FBI Special Agent Carl Hanratty (Hanks) coming to return Abagnale from his Marseilles prison cell to the U.S. in 1969, action flips back six years to New Rochelle, N.Y. Local businessman Frank Sr. (Christopher Walken) is a romantic, better at dreaming and scheming than at supporting his family. His proudest achievement is having brought back a French girl (Nathalie Baye) as his bride after WWII, so both he and his son are brought low when her infidelity triggers divorce, a matter exacerbated by dad’s troubles with the IRS.\r The FBI is on to Abagnale before long, but he proves remarkably elusive. Even when Hanratty corners the “Skyway Man,” gun drawn, in a Hollywood hotel room, Abagnale is able to turn the tables on his pursuer and slip away to continue his spree, this time in Atlanta.\r Spielberg and screenwriter Jeff Nathanson (the “Rush Hour” pics) might have taken this as a cue to begin wrapping things up themselves, but instead elaborate a great deal of follow-up material to more-is-less effect.\r Info about how Abagnale, under Hanratty’s tutelage, came to become a check fraud expert for the FBI after serving but part of his prison sentence is interesting and satisfyingly ironic, but could have been dispensed in a fraction of the time. Ultimately, the film pays for the excess baggage it takes on, suggesting this would have been a very good occasion for Spielberg to make his first under-two-hour film since “E.T.”\r Lively and appealingly retro as the picture may be, it has other problems as well. Attempt to give the story more dimensions than provided by the outlandish narrative result in a wobbly tone. While Abagnale’s love for his father and evident desire to succeed where the older man has failed provides plausible psychological motivation for the son’s exploits, the darkening of their relationship as the story progresses adds little and sidelines the narrative at times.\r More vexing still are the film’s visuals. Due to the cues received from the opening credits, the era involved and the serio-comic approach, the viewer could reasonably expect a high-gloss studio look in the manner of a Blake Edwards picture of the period; a bright, artificially polished style would have just added to the fun.\r Instead, cinematographer Janusz Kaminski eschews old-school elegance for gobs of blown backlight cascading through windows and other sources, even to the point of obscuring faces in the foregrounds. No one in Hollywood shot movies in this fashion until the ’70s, and the disjuncture here provides a big disappointment given the possibilities for period precision provided by the diverse locations, Jeannine Oppewall’s resourceful production design and Mary Zophres’ costumes.\r Charming, clean-cut and blessing his con man with an optimism that assumes the best possible outcome no matter how dire the dilemma, DiCaprio betrays not a speck of the sullenness he exhibited in “Celebrity” and “The Beach,” nor the stoic toughness he used in “Gangs of New York.”"
    },
    {
      "rating": "9",
      "text": "Catch Me If You Can is an enthralling film, built with some of the best pacing I’ve experienced in a film, and brilliant performances from Leonardo DiCaprio and Tom Hanks. This film knows exactly what it wants to be, which is a blend between comedy and drama and features very bright tones throughout, expressing the film as a sort of real life Tom and Jerry. This film doesn’t rely on fast, action sequences and car chases but expresses a depth of interest based on the truly intellectual Frank Abagnale J.R, who really grabs your interest as you’re left baffled at how such a young man can surpass the police skills of an agent and earn such a high quantity of money before the age of 18. This film not only succeeds as a cat and mouse drama but as a biopic – this film introduces DiCaprio’s character in such a way that it really elevates the feeling you’re on this personal crime journey with him; though the emotional power this film really fleshes out the true reasons why he is selecting the dangerous side of life and that can make you smile and almost respect the character. As I first mentioned, this film has some of the best pacing I’ve ever seen, no scenes feel too drawn out or too short, and that’s another factor that really increases the intrigue. Overall, this is a great watch and definitely one of Spielberg’s best films. Therefore, I’m going to give this a 9/10 – 94%"
    },
    {
      "rating": "10",
      "text": "Another Great 2002 Spielberg FilmCatch Me If You Can is a very good watch."
    },
    {
      "rating": "10",
      "text": "This was my all time favourite movie for a long time. But I find myself saying a bunch of movies are now. So I will just say it's in my top 10. It's a movie I connected with for a couple reasons. The relationship Frank had with his dad and his parents divorce. My relationship with my dad was similar. I was friends with mine. And when my parents got divorced it was crushing. So when Frank's parents got divorced I felt his pain and confusion. I understood why he ran away. And years later since I first seen the movie I can now relate to when he found out about his father passing away. These things make his character relatable. They get you emotionally invested in the story. And Leonardo DiCaprio is my all time favourite actor and always has been. I think he's brilliant. This is such a great story based on the life of Frank Abagnale Jr. I love movies based on true stories. I always feel more invested and immersed in the movie."
    },
    {
      "rating": "8",
      "text": "Spielberg's caper runaway adaptation of Frank Abignale couldn't be more thrilling and irresistable. Carried by near perfect performances by both Leo DiCaprio and Tom Hanks, it's a cat and mouse game that works on all levels of comedy, drama, romance and suspense. Leaving a film that reeks of rewatchability and influence."
    },
    {
      "rating": "10",
      "text": "Cinematography: 9/10Plot: 10/10Characters: 10/10Acting: 10/10Music: 9/10"
    },
    {
      "rating": "10",
      "text": "Entertains and amuses the audience.Directed by Steven Spielberg, who achieves with this film another success for his already long list of cinematic successes, this film is based very slightly on the life of Frank Abagnale, Jr., a well-known American con man who, in his youth , stood out for the skill with which he forged checks, to the point of working today as a security consultant in this sector. The film follows the origins and life of the main character, as well as the original and daring way in which he escapes justice until he is invariably caught.In addition to being an extremely fun movie to watch, with a game of cat and mouse full of comedic moments and some familiar melodrama to add some dramatic density to the main character, it has two extraordinary actors at an excellent time in their careers: Leonardo Di Caprio is charismatic, talented, and still young enough to give life to a teenage character; Tom Hanks appears more restrained and in a role of maturity but charged with charisma and personality Both actors are good and complement each other, sharing the protagonism and creating a good and pleasant collaboration to feel. The film also features Christopher Walken and Martin Sheen in secondary roles. Walken stands out particularly, with an appealing character and dialogues loaded with impact and meaning.I didn't feel that the film stood out for the more technical aspects. Its value is based on the performance of the actors, the story told and the way it entertains and entertains us. However, it is a film directed by Spielberg and that usually means quality: in fact, the film has excellent cinematography and was very well shot. The color, the light, all the camera work and editing were done with excellence and attention to detail. Because it is a film set in the Sixties, it also has a series of details that transport us to that time (used cars, scenarios and furniture that are emerging, the presence of some iconic brands and emblems of the time, namely in what concerns commercial aviation, clothes and costumes, fashion and hairstyles), which exude credibility, verisimilitude and historical rigor. I believe that I must also highlight the ingenious and fun way in which the initial credits were conceived, being an element that, right from the beginning, announces the tone and ambience of the film we are going to see. Last but not least, the good soundtrack, signed by John Williams."
    },
    {
      "rating": "9",
      "text": "good movie.brilliant...and explain education theory.leo play well in this movie."
    },
    {
      "rating": "8",
      "text": "Steven Spielberg knows what we like, what we enjoy, and when we get thrilled. It jus doesn't let any of us to leave during this film. Also, it's a bit underrated by critics. It should be in Steven Spielberg top 10 list."
    },
    {
      "rating": "10",
      "text": "Great Steven Spielberg movie. Leonardo DiCaprio showed that he was on the right path to becoming the actor he is today. And Tom Hanks has proven that it does not matter if the role is starring or supporting, it wins the public's attention. Christopher Walken also delivers one of the best performances of his career, in the role of the protagonist's father. Highlight also for Amy Adams, still in ascension at that time."
    },
    {
      "rating": "7",
      "text": "The beginning is really slow and does not perfectly explain the entire reason as to why our main character decides to become a forger. The meaty parts were the middle and ending which were really awesome and partially showing us how some of the forgeries were made. The relationship with his father for me personally felt very awkward and not that well made.Decent movie which you should check if you haven't already."
    },
    {
      "rating": "7",
      "text": "Starring Tom Hanks and Leonardo Di Caprio and directed by Steven Spielberg Catch me if you can is a breezy drama based on real life events. A jaunty caper movie inspired by real-life events, Catch Me if You Can never takes itself or its subjects too seriously, and contains more genuinely funny material than about 90% of the so-called \"comedies\" found in multiplexes these days. It also helps that in his two leads, Leonardo DiCaprio and Tom Hanks, Spielberg has actors who are capable of switching effortlessly between drama and comedy. The result is an enjoyable, although not ambitious, holiday outing. At 140 minutes, Catch Me if You Can is a little on the long side. Although, for the most part, it moves quickly, the final fifteen minutes are protracted and arguably unnecessary. In his attempts to redeem Frank, Spielberg may go too far and let the movie continue past the point where it begins to run out of steam.(Breezy comic drama by superstars)."
    },
    {
      "rating": "8",
      "text": "Steven Spielberg sabe como contar uma historia...Apesar de não ser um filme de suspense, um certo tipo de tensão ocorre em toda a obra. O protagonista, protagonizado pelo DiCaprio, é esperto, inteligente e muito criativo, e ele não para até que finalmente peguem ele - pra valer. Suas atitudes surpreendem e todo desenvolvimento dele é valido, deixando o personagem complexo - logo, humano.DiCaprio dá um show de interpretação, dando vida ao personagem e levando muito bem as cenas onde a carisma do mesmo era necessária para sair de uma situação. Tom Hanks convence no papel, passando seriedade mas mesmo assim sendo divertido as vezes - principalmente quando ele se dá mal. A ost do filme é muito boa também, fora todo storytelling que funciona muito bem."
    },
    {
      "rating": "10",
      "text": "This movie is amazing. And Leo DiCaprio's acting is just superb as always. I don't understand how his only oscar is from The Revenant."
    },
    {
      "rating": "10",
      "text": "spilbergs crafted sweet dish!!really smooth scrrenplay background score is great and acting is a goddam great thing both the legends lived the character nicely!!"
    },
    {
      "rating": "10",
      "text": "Tiene una trama muy entretenida que atrapa al espectador de principio hasta fin.¡MUY RECOMENDADA!"
    },
    {
      "rating": "8",
      "text": "\"Catch me if you can\" elevates thanks to great performances and beautiful DiCaprio-Walken / DiCaprio-Hanks dynamics. Really fun script and, as always, impeccable score by John Williams. I'm not really sure about how memorable this film will be."
    },
    {
      "rating": "10",
      "text": "One of the best movies I have ever seen. Although dramatized, “Catch Me If You Can” is a riveting and non-fictional tale of a man who successfully conned his way through several high profile jobs. I have never seen a movie with more sub plots, so in my opinion this keeps things very interesting. Still waiting to see another movie as exiting as this one."
    },
    {
      "rating": "9",
      "text": ",,,,,,,,,,,,,,,,,,,,,,,+×÷=__/€£()*&^%$#@++,.?!;:::\"'-`~☆⊙°•¤《》¡¿♧◇♡♡♤•□■●○▪}[]{>"
    },
    {
      "rating": "10",
      "text": "Spielberg's sure know how to pick a great and interesting true story into a film, this is a very fascinating story and movie, Catch Me If You Can is one of those film that is just so perfect and so good, i have no words to describe it anymore, it's already great, amazing, and incredible, everybody was great, there is no negative thing in the movie, Catch Me If You Can is just another fantastic and incredible work from Spielberg's."
    },
    {
      "rating": "9",
      "text": "$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,$,》●》●》●》●》●》●》●》●》■》■》■》■》■》■》■》■"
    },
    {
      "rating": "8",
      "text": "Barely 21 yet, Frank is a skilled forger who has passed as a doctor, lawyer and pilot. FBI agent Carl becomes obsessed with tracking down the con man, who only revels in the pursuit. (8)"
    },
    {
      "rating": "9",
      "text": "----------------------------------9.2/10-----------------------------------"
    },
    {
      "rating": "9",
      "text": "This is a crime picture, about the FBI chasing a young scammer. But for a movie like that, Catch Me if You Can takes its time on the stacked but fully developed characters and its fascinating narrative. The performances are all brilliant and contribute to the entertainment value of the film."
    }
  ]
}