{
  "id": 190,
  "title": "Cool Hand Luke",
  "starring": [
    "Paul Newman",
    "George Kennedy"
  ],
  "runtime": 127,
  "genre": [
    "Crime",
    "Drama"
  ],
  "description": "When petty criminal Luke Jackson is sentenced to two years in a Florida prison farm, he doesn't play by the rules of either the sadistic warden or the yard's resident heavy, Dragline, who ends up admiring the new guy's unbreakable will. Luke's bravado, even in the face of repeated stints in the prison's dreaded solitary confinement cell, \"the box,\" make him a rebel hero to his fellow convicts and a thorn in the side of the prison officers.",
  "releaseYear": "1967",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4ykzTiHKLamh3eZJ8orVICtU2Jp.jpg",
  "categories": {
    "plot": 9.0,
    "acting": 10.0,
    "ending": 10.0,
    "soundtrack": 4.0,
    "cinematography": 10.0,
    "familyFriendly": 10.0,
    "funny": 9.5,
    "action": 6.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "This film got me from the first frame to the last. It's not even because of the story (which I love, of course) - it's just so very well made. And so modern. The kind of angles and perspectives the camera uses, the way it zooms in and out or even allows itself (literally) to get dirty - the way this whole picture was shot is just something I haven't seen in an American film released prior to this one."
    },
    {
      "rating": "9",
      "text": "Cool Hand Luke is the first Paul Newman movie that I have seen, and is generally older than the films I watch, but I greatly enjoyed it. It's a prison movie where a newcomer rebel changes up the way things go around the prison, earning the respect and admiration of the biggest/baddest guy in the prison, as well as everyone else. There are some comedic moments (the eggs), some heartwarming moments (between Luke & Dragline), and moments of inspiration of Luke's determination. This movie reminds me a lot of Shawshank Redemption in those ways, though with very different outcomes. It's an excellent movie that grew on me as it continued."
    },
    {
      "rating": "6",
      "text": "I love old movies and saw the great reviews of this one and I love Newman so i gave it a shot. Acting was perfect, well done...cinematography was great...but the story draaaaaaged..I kept thinking ok something exciting will happen......nada......waited some more and found that movie ended. Lacked excitement for me that’s all. I love Newman and will watch his other older movies."
    },
    {
      "rating": "10",
      "text": "All-time favorite movie!  Newman is a national treasure, full of humor in this inspirational epic!"
    },
    {
      "rating": "10",
      "text": "Cool Hand Luke is a 1967 drama film, I guess crime is another genre you could stick it under... I think they are stuck inside a prison but not sure but anyway, Cool Hand Luke stars Paul Newman and George Kennedy... Cool Hand Luke is a film I grew up with as a child so I'm very familiar with the film and I surely remember it well. The acting is excellent especially from Paul Newman and all the actors are great in the film and it's full of excellent characters even the people who are dislikeable. The carwash scene is genius but the ending is a bit sad but didn't ruin the film. Only negative I have about Cool Hand Luke is we didn't know if Luke (Paul Newman) lived or died at the end of the movie after he got shot because it didn't show us so that was a shocker but besides that this film is perfect. A classic in all departments."
    }
  ]
}