{
  "id": 97,
  "title": "Dangal",
  "starring": [
    "Aamir Khan",
    "Fatima Sana Shaikh"
  ],
  "runtime": 161,
  "genre": [
    "Drama",
    "Family",
    "Comedy",
    "Action"
  ],
  "description": "Dangal is an extraordinary true story based on the life of Mahavir Singh and his two daughters, Geeta and Babita Phogat. The film traces the inspirational journey of a father who trains his daughters to become world class wrestlers.",
  "releaseYear": "2016",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/p2lVAcPuRPSO8Al6hDDGw0OgMi8.jpg",
  "categories": {
    "plot": 8.0,
    "acting": 6.0,
    "ending": 4.0,
    "soundtrack": 6.0,
    "cinematography": 4.0,
    "familyFriendly": 10.0,
    "funny": 4.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "A great movie and a very heart touching! The relation of father and daughter is really emotional."
    },
    {
      "rating": "6",
      "text": "Nitesh Tiwari's Dangal follows the tried and tested formula of a sports biopic to maximum effect. While this causes the plot to be predictable, the characters, emotion and music overwhelm the flaws until the end."
    },
    {
      "rating": "9",
      "text": "Offcourse its aamir sir so naturally movie was goin to be great but liked and respect the women empowerment facet and its smart yet unpreaching implementaion in the movie.Will thankfully bring some change in a society struggling to with issues of gender eqaulity"
    },
    {
      "rating": "10",
      "text": "The movie is based on real life incidents of the life of an Indian Wrestler 'Mahavir Singh Phogat' and his two daughters - Geeta and Babita, who are wrestlers too. With that the movie also sets a strong message against the feudal thinking where girl child is less desirable to have."
    },
    {
      "rating": "10",
      "text": "Es una de la mejores películas en la historia de la India; la trama es muy buena, las actuaciones son excelentes y la música está bastante bien. ¡TOTALMENTE RECOMENDADA!"
    },
    {
      "rating": "10",
      "text": "A strict father demands his two girls excel. The girls excel.Although there were some predictable and implausible plot twists, the film choked me up."
    }
  ]
}