{
  "id": 132,
  "title": "Dial M for Murder",
  "starring": [
    "Ray Milland",
    "Grace Kelly"
  ],
  "runtime": 105,
  "genre": [
    "Crime",
    "Thriller"
  ],
  "description": "An ex-tennis pro carries out a plot to have his wife murdered after discovering she is having an affair, and assumes she will soon leave him for the other man anyway. When things go wrong, he improvises a new plan—to frame her for murder instead.",
  "releaseYear": "1954",
  "mpaaRating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/4KKiFDvtEusJzqzlwHp7iMceXKS.jpg",
  "categories": {
    "plot": 7.0,
    "acting": 7.833333333333333,
    "ending": 7.5,
    "soundtrack": 7.5,
    "cinematography": 4.0,
    "familyFriendly": 7.0,
    "funny": 4.0,
    "action": 8.666666666666666
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Dial M for Murder is one of those Hitchcock films that you can't sit still for do to all the captivating scenes, and this movie is one of the reasons that Hitchcock remains to be number one on my top ten directors list."
    },
    {
      "rating": "10",
      "text": "Paced superbly with thrilling climax and the standard **** finesse, Dial M for Murder is a surprisingly enchanting for a movie that is mostly spoken word."
    },
    {
      "rating": "10",
      "text": "Dial M For Murder is a timeless classic Hitchcock thriller that is suspenseful and well-made, just as you'd expect. The performances, the story, and the faithfulness to the play are all there."
    },
    {
      "rating": "8",
      "text": "A nice suspenseful movie by Alfred Hitchcock. This tale about a cheating wife and her husband with a plan to kill her has been remade in 1998 under the title A Perfect Murder with Michael Douglas. Both films are very good and have a beautiful leading lady: Grace Kelly and Gwyneth Paltrow."
    },
    {
      "rating": "10",
      "text": "One of my favourite Hitchies. The cast is superb. And it's Grace Kelly, who was always beautifully photographed by Hitch."
    },
    {
      "rating": "8",
      "text": "Excellent Alfred Hitchcock suspense thriller, and it is brimming with his classic touches. Great atmosphere and the pace is excellent, well produced. Grace Kelly is terrific as the innocent wife, Ray Milland does a good job as well."
    },
    {
      "rating": "8",
      "text": "It is based off a play so the film is sort of play-like. The cast is essentially just down to Milland, Kelly and Cummings and they all give strong performances from start to finish. Without a doubt one of my favorite Hitchcock films and still stands up after all these years."
    },
    {
      "rating": "9",
      "text": "Every step engrosses. This is candy for the analytic brain. It looks great. Kelly is angelic,  but Milland and Williams shine. I'm so depressed when I consider what pictures in this genre are like now."
    },
    {
      "rating": "8",
      "text": "Dial M for Murder depicts the carrying out and consequences of a husband's perfect murder scheme. The dialogue is fast-paced, witty and excellently delivered by the entire cast. This is fortunate because Dial M for Murder is a very dialogue-heavy film. It pulls you in, and though the climax occurs early you are kept guessing as to how events will turn out until the very end. By no means is this  finest film but it is still brilliant in its own right."
    },
    {
      "rating": "9",
      "text": "Dial M for Murder was pure Hitchcock, just like Vertigo, Psycho, North by Northwest etc. It wasn't his very best, but it damn sure was a very great movie."
    },
    {
      "rating": "9",
      "text": "Alfred Hitchcock is a wonderful director, directing classics such as Psycho, North by Northwest and Rebecca. While not his best, Dial M For Murder has so much to recommend it. First of all, is the breathtaking cinematography, which is nearly always the best thing in a Hitchcock film. The script is a gem, showing that you are capable of anything, and most of the time, it is very tense and rarely slips. That said, my only complaint, is that one or two scenes such as the ending do fall flat, compared to the rest of the film. However, the film also has a wonderful music score, and fantastic performances from the entire cast. Ray Milland, an actor I really want to get more familiar with, is excellent as Tony Wendice, the husband planning to murder his wife, and make it a perfect murder. As Margot, the beautiful Grace Kelly is the picture of beauty and vulnerability in a wonderful understated performance, perhaps outshining her co-star. Everyone else acquitted themselves well too, even Robert Cummings as Mark Halliday and John Williams as Inspector Hubbard. Overall, an excellent film, not Hitchcock's best, but well looking out for. 9/10 Bethany Cox."
    },
    {
      "rating": "5",
      "text": "Voici un Columbo bien avant l'heure émanant directement du \"Maître\" du suspense, Alfred Hitchcock ; il y est d'ailleurs question d'imperméables et de quelques \"détails\" qui tombent comme un cheveu dans la soupe à la toute fin lorsque le fameux inspecteur démontre par a+b qui est l'assassin (que l'on connaît déjà).Ce n'est pas Peter Falk mais un inspecteur de Scotland Yard qui vient faire sa démonstration et si on veut se montrer magnanime vis-à-vis d'une série dont les pochettes-surprises sont le fond de commerce, on ne peut que s'étonner que de telles sornettes puissent se balader tranquillement dans un film du \"Maître\". Du reste, les aberrations du scénario ne sont certainement pas en reste, car on tombe dessus assez souvent sans crier gare dans ce crime très imparfait...Sans mentionner bien entendu Grace, la douce Grace qui se débrouille très bien avec le malotru et même en supposant qu'elle soit tombée sur le cave des caves, là encore, on nous prend bien pour des jambons...Cela étant dit, on ne s'ennuie pas le moins du monde dans ce film du Maître, ce qui nous en bouche sérieusement un coin, étant donné le passif du bonhomme dans son domaine, c'est-à-dire le domaine de l'ennui et du baillement. Bravo au Maître donc qui a su nous tenir éveillé du début à la fin. La musique y participe également, elle qui est très énervée pour un oui ou pour un non et qui nous a peu énervé aussi, nous devons l'avouer.Plutôt distrayant et assez intéressant, le film se prend donc les pieds dans le tapis à de nombreuses reprises avec en point d'orgue cette fin qui confine à un certain ridicule pour ne pas dire un ridicule certain. Mais un film moyen du Maître est certainement déjà un chef-d'oeuvre en soi, car tout est très relatif dans sa filmographie habituellement épouvantable."
    },
    {
      "rating": "6",
      "text": "What is told repetitively, what is romanticized, what is pure, is the final trick.Dial M For MurderAlfred Hitchcock is a great adapter. From books to plays, his adaptation is simply ingenious. And maybe, only because he never lets it lose the essence of where it comes from. What the source is. Which then of course can be argued as both an advantage or a disastrous disadvantage. And Dial M For Murder suffers the same consequences that Rope does. The play is written with very few scenes in mind. Scenes with long conversations in mind and long conversation that swoops in every behind the stage activity occurring both before and after the sequence. It can be a bit cheesy, fortunately it is not here.And this is how Hitchcock dodges all the social rigmarole that a structure of this film comes with. More than 90% of the film is staged in one set piece only. The hall, the main room, the entrance room of this murderous apartment. So why do we despite knowing all these issues that are about to come, still fall for its topsy turvy script. Only because, Hitchcock frames exactly what the audience is going through. That is why he is still loved. Even decades later, his films are satisfying.Walking in on the murder mystery film, every audience member appoints itself to be the detective of the case, the film. And what all it, the audience, wants to do is analyse every last detail of that crime scene. And Hitchcock gives them exactly what they want. Split into three acts, the first act is the planning of that crime scene. The second is the crime scene going wrong just as it was planned and was to be narrated to the executioners. And the third is justifying the wrong doers deed. And it is a finale in the sense that we aren't told how this will go down unlike the previous acts."
    },
    {
      "rating": "6",
      "text": "This film tells the story of Tony and Margot Wendice. She's married, but ends up having an affair with Mark Halliday, an American writer of detective novels. Therefore, and to avoid giving up her fortune, Tom decides to murder her but his plan goes wrong and Margo kills, in self-defense, the man who would kill her. Tom, to avoid the risk of being discovered, quickly creates a plan to take his wife to be sentenced to death.Directed by the great Alfred Hitchcock (one of the most brilliant directors of all time), this film, like others he directed (\"Rear Window,\" \"Psycho\", \"The Rope\" etc.), is based on a police investigation, and the dramatic tension of the plot resides in its development, putting the audience in expectation, waiting to see when the killer will be unmasked in their eagerness to try to save himself. That's a formula that Hitchcock used so often in his movies that it's difficult today to see this movie and don't feel that disappointment of those who expected something more, or something different. Nevertheless, this movie is good, is very well done and has a great cast (headed by Grace Kelly, Ray Milland and Robert Cummings, respectively in the role of Margot, Tony and Mark Halliday) toasting the audience with great interpretations. The technical aspects (photography, soundtrack etc.) also seems faultless.\"Dial M for Murder\" is a film that already has a few years, and probably we've already seen it on the small screen. Despite this, and despite not being one of the best films of this director and being totally unable to cause us astonishment or surprise, it's a nice movie to see, or review."
    },
    {
      "rating": "7",
      "text": "I have been watching Alfred Hitchcock's movie nowadays. His movies are so different and fun to watch. He made movies which were ahead of it's time including this one.This movie had everything a crime mystery drama should have. It was nicely made. The direction, performances by the actors, story.... everything was good. There is thrill and suspense till the end. Movie tries to confuse you due to which you are unable to predict the ending.There were some things that I didn't like about the movie. First, movie started in uneven manner. It takes time to figure out what is happening. Second, the conclusion part was little bit confusing to understand. Other than that it's a good watch.Overall, it is a good crime drama thriller which will keep you bounded till the end."
    }
  ]
}