{
  "id": 81,
  "title": "Double Indemnity",
  "starring": [
    "Fred MacMurray",
    "Barbara Stanwyck"
  ],
  "runtime": 107,
  "genre": [
    "Crime",
    "Drama",
    "Mystery",
    "Thriller"
  ],
  "description": "A rich woman and a calculating insurance agent plot to kill her unsuspecting husband after he signs a double indemnity policy. Against a backdrop of distinctly Californian settings, the partners in crime plan the perfect murder to collect the insurance, which pays double if the death is accidental.",
  "releaseYear": "1944",
  "mpaaRating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/kkfKLeOTo7RjS9TxHKpknlL7huS.jpg",
  "categories": {
    "plot": 8.4,
    "acting": 8.833333333333334,
    "ending": 4.0,
    "soundtrack": 4.0,
    "cinematography": 4.0,
    "familyFriendly": 8.0,
    "funny": 4.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "9",
      "text": "One of the best filmed and recognized movies of all time. Double Indemnity explores the depths of greed and lust and was the film that mainstreamed the femme fatale. Wonderfully acted and as gritty as they come."
    },
    {
      "rating": "8",
      "text": "My favorite film noir.  Instantly rewatcable tale of greed and lust that pulls no punches. Barbara Stanwyck rules the summit of femme fatales.  So much fun watching Fred MacMurray, who thinks he's the smartest man in the room,  and then slowly realizes he is the biggest chump of all.  Edward G Robinson's calm clear, headed insurance investigator nicely contrasts all the wacky sinful deeds going on."
    },
    {
      "rating": "10",
      "text": "Absolutely astonishing quality of script, direction, production values and some astronomical central acting from Stanwyck, who chews up the sets and her scenes with such skill and professional gravitas that she seems to lamp out of the screen at you, leaving you transfixed, mesmerised and deeply impressed.This gem of a noir movie is groundbreaking, with a cut to the marrow script and the actors locking on to the central plot like they had lived it for real. This is the very best any movie can get - any genre. I defy anyone to compare it to any other noir movie ever made. Simply sublime perfection and definitely right up there in the top ten best movies ever made.Highly Recommended."
    },
    {
      "rating": "8",
      "text": "With overtones of moral failure that almost make you remorse on behalf of the protagonist, undertones of lust, crackling dialogue that's as cynical as it's extremely classy and sharp-witted, a grim atmosphere of impending doom created by the stunning black-and-white photography, it's safe to say that my first Billy Wilder has all the trademarks of film-noir.That said, I wouldn't be wrong in saying that this film is kinda subversive; only on its own terms. In saying that, I mean that the jaw-dropping nuances Wilder has sizzled this film with, and the painstaking attention to details gave Double Indemnity unique taste, and made it stand out from all the films of its kind. Giving away the plot synopsis usually tarnishes the experience of watching your typical film noir because the toughness of them are their small details, let alone doing so with this one in addition to explaining why I find the subtlety of it so mesmerizing. Watch Double Indemnity and you’ll know what I mean straight away!Alas, It seems that this very meticulous attention to detail came at the expense of making the most important the most crucial moments and the turning points convincing. The academic nature of the film's plotting made a lot of decisive moments a bit hard to swallow. It also made the movie drag, surprisingly, at what should have been the most intriguing part.All the performances here are fine, but it's Edward G. Robinson who steals the show for me. He plays the quick-witted, determined investigator, Barton Keyes, who may be a bit too smart and clever to be believable; but thanks to Robinson's fierce performance, Keyes hands down is my favorite character in the movie.Double Indemnity is an extremely well-crafted moody crime film that transcends the nature of its plotting with an unprecedented, unmatched, unsurpassable subtlety that made the main characters lifelike, and made the story thought-provoking in the first place. It raised the bar and set the standard for film-noir making at its time, and continues to inspire every neo-noir film, nay every crime film to this day.(8.5/10)"
    },
    {
      "rating": "9",
      "text": "O eterno clássico do cinema noir dirigido pelo incontornável Billy Wilder. Já o vi há uns anitos mas ficou-me na memória como umas das melhores fitas que vi. Aqui temos todos os elementos do noir de forma perfeita: história não convencional, personagens com moral duvidosa, femme fatale como antagonista, fotografia impecável, iconografia inconfundível, narrador em 2º plano e claro um protagonista caído em desgraça, mergulhado numa narrativa fatalista…Destaque ainda para o actor principal Fred MacMurray, que consegue fazer qualquer um aproximar-se do anti-herói desta história."
    },
    {
      "rating": "8",
      "text": "So enjoyable, greatly acted and written. Billy Wilder absolutely never dissapoints."
    }
  ]
}