{
  "id": 10,
  "title": "Fight Club",
  "starring": [
    "Edward Norton",
    "Brad Pitt"
  ],
  "runtime": 139,
  "genre": [
    "Drama",
    "Thriller",
    "Comedy"
  ],
  "description": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.",
  "releaseYear": "1999",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pB8BM7pdSp6B6Ih7QZ4DrQ3PmJK.jpg",
  "categories": {
    "plot": 9.735294117647058,
    "acting": 9.470588235294118,
    "ending": 9.909090909090908,
    "soundtrack": 10.0,
    "cinematography": 9.5,
    "familyFriendly": 10.0,
    "funny": 10.0,
    "action": 9.285714285714286
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Great film; negative reviews here often reflect a sloppy or down-right non-existent understanding of the movie. Case in point: \"..spend two hours wondering why the characters would rather punch each other than do something useful with their time and energy.\" - Alexander G. Now obviously, anyone who was actually attentive to the movie knows that they DID do something useful, and they fought for a reason."
    },
    {
      "rating": "9",
      "text": "\"The things you own end up owning you.\" - Tyler Durden\r A multi faced movie about  a men who is deeply unsatisfed with his life in a modern age.\r ."
    },
    {
      "rating": "10",
      "text": "Nearly everyone knows the rules, number one of which I’m about to break.\r What do you do if you’re sick of your boring, pathetic life? In the most cathartic, DIY approach possible, Fight Club answers this question: you change it. The absolute prototype of an existential thriller, it wouldn’t be taking too much of a leap to suggest that Fight Club is one of the best films ever made.\r Jim Uhls’ excellently adapted screenplay of Chuck Palahniuk’s novel (this is the only major work by Uhls that I can find), this thriller has been exciting male audiences the world over since its release in 1999. Even Palahniuk himself said the film was amazing. In fact, he admitted that film was so good, the book in comparison made him feel ashamed.\r A nameless, pitiful, seemingly friend and family-less Office worker (Edward Norton) suffers from insomnia. True to Palahniuk’s style, the solution to the insomnia comes in a bizarre way. He finds relief by attending support groups for diseases, diseases he doesn’t have; these people really listen to him, and afterwards, he sleeps. At these meetings he meets Marla Singer (Helena Bonham Character), a nemesis and lover, and it is through her that Mr. Office worker discovers his true self, but not until after he’s transformed more than just his own life.\r Mr. Pitiful Office worker meets Tyler Durden (Brad Pitt). Durden helps Mr. Pitiful Office worker admit to his misery once and for all. Channeling their suppressed male aggression in its rawest form, they start fighting each other. Soon Mr. Pitiful Office worker realizes that he and Durden are not alone.\r Men, downtrodden, tired of their insignificance as worthless individuals all aim to do something greater. They jump at the chance to vent their primal steam, and the solo fights turn into group fights.\r Durden’s vision eventually transcends aggression in its physical form and becomes something much greater, a community where the individual ceases to exist. As part of this whole, every unnamed member is an equal and significant contributor, and it is through the whole that the individual finds meaning. As part of the whole they are changing the future together.\r This movie is a directing marvel. With time shifts, psychological manipulations, and very meticulous scene planning, we are kept on the edge of our seats for the entire film. Accompanied by the pounding soundtrack composed by the Dust Brothers, Fincher achieves the rarity of making a movie better than a book. Fincher turns the concrete basement of Lou’s Tavern into perhaps the most famous arena in all of modern film. The house on Paper Street, a lone abandoned mansion, becomes a factory of redefinition, of reinvention. In the final scene an amazing mesh between the visuals and the music, The Pixies’ “Where is my Mind,” Fincher creates one of the most stunning combinations of sight and sound in all of film. And it's a pretty damn good ending to the plot too.\r The most memorable scene is when Durden is behind the wheel of a car full of passengers. He buckles up, pins the gas, and lets go of the wheel. The car veers off the road and crashes, flipping multiple times. We are force fed the hard truth here. The Fight Club mantra: to change to our lives we need to rid ourselves of our past failures, forget the job, the kids, the car, the living room, the flat screen HDTV, and just let go.\r You are not your f'cking khakis."
    },
    {
      "rating": "10",
      "text": "Fight Club is the best movie if you can understand it. If not, it sucks. That's why we have a very big range here. If you rated negatively go and watch the movie again, search the deeper meanings about the system, understand the movie and come back here to hate yourself."
    },
    {
      "rating": "10",
      "text": "One of the best movies i have ever seen. It took me a long time to watch it and when i finally did i can say  If you haven't watched it yet, do it as fast as you possibly can."
    },
    {
      "rating": "10",
      "text": "A film that can really hit you seductively and fascinate you in a humor way. If you think that this film is serious, you got it all wrong. A ride with the best actors into a dark tragedy but somehow charming. The most significant film that can really make you amazed in many ways. Finishing this great work by the best ending ever totally blown me off. What also makes this film special is the main character, after all, doesn't 'solve' the problem like other films. It was a cinematic experience, and frankly speaking, it took me a while to confirm that this is the best film I've ever seen so far."
    },
    {
      "rating": "10",
      "text": "This cult classic is on my top 10 list. Due to its original and creative plot and directing styles. The movie is quite shocking and brutal, but what is most shocking are the negative reviews on it. I have over-viewed lots of these bad reviews and all they talk about is how much violence is in it, and judge little to nothing on the story and/or film quality. Needless to say i shall ignore those reviews due to their plain ignorant critics. Anyways, The story captures you quickly and is very fun to watch. The characters are interesting and fun, the shots are great, the plot is captivating, to sum it all up what isn't their to like about this movie."
    },
    {
      "rating": "10",
      "text": "There are so many kinds of violent dramas, but, Fight Club, for long, shows the best.\rIt´s a combination of incredible mind-blowing scenes and incredible quotes for the script talking about life and self destruction doing what we don´t want. Brad Pitt shows the most epic way for rolling the mean paper of the movie. For different kinds of reasons, Edward Norton´s actuation was one of the best I´ve seen ever, so so so so great,\r Fight club is special making people think about their lives. For me, Fight Club made a change in my way of living, it gives a bubblegum stock in one of your shoes, a bubblegum that will follow you all your life long.\r As in Se7en, Pitt´s deserves an Oscar for his paper, and Fight Club should won the Best Picture one, this movie can cause special effects in the people´s mind, giving them a light to follow. Before this movie, I couldn´t guess that a girl can act so good, obviously talking about Helena Bonham Carter.\r In some words, the movie is, in my opinion, unique, epic, special, mind-blowing, astonishing, and necessary to see before rest in peace."
    },
    {
      "rating": "10",
      "text": "I'd say all praises to the book. But, having revisited this film twice, I've decided it's a ten. The storylines are correct although do feature some changes, the writing is exceptionally fine. The tone of the book has been grasped by writing staff exquisitely though there is little focus on one of the roots of the main character's overall issue: the abscence of a certain family member (the book covered that part more sufficiently). All in all, this movie gave me a new look at my life and my place in it being a rather complex visualization of the book written by Chuck Palahniuk. The soundtrack is worth to be praised on its own: I have listened to it many times while doing homework (not the one depicted in the film) and thinking about life. That's all I have to say for my other feelings for that movie (and the book combined) can't be transferred into words. Watch it."
    },
    {
      "rating": "9",
      "text": "66 metascore in this masterpiece? are you people crazy? It was insane! The best part of the movie was Edward Norton's acting. I loved it! One of my favorite movies.. even better than Se7en."
    },
    {
      "rating": "10",
      "text": "This one of my all-time favorite audiovisual experiences, not only movies, and I love this movie with all of my heart. Everything is just SO GOOD! The direction is of the world, being able to not let attent viewers confused, not revealing anything until the end of the movie but letting some hints before the reveal at the end so we can feel like we have been fooled even when the clues were right on our faces all along. The acting is amazing! Edward Norton, Brad Pitt, and Helena Bonham Carter excel at showing off their unique characters, which are all oozing with personality. The soundtrack is amazing, the tone is consistent during the whole movie, and the pacing is really good. But now let's talk about the movie's best attribute, the story. HOLY. F*@KING. SH%T. It was one of the smartest things I ever saw in a movie, and if you stop to analyze it is pretty simple, a guy with two personalities has its life changed when one of the personalities start to influence him and it creates a whole army to accomplish a revolutionary goal, the key that made the story work is the way that we are told about the things, we see everything through the eyes of the unnamed narrator (which I will refer as Jack), so we never understand some things because, like him, we are unaware that Tyler Durden is, in fact, another personality he created without knowing it, which is another masterful idea, the fact that Jack is unaware that Tyler Durden is not a real person, which makes sense considering that he would more likely be influenced by someone who is not just another version of himself but a brand new human being. Like I said previously, how we are told the stuff that happens is what makes the story so great if we know from the beginning about Tyler's plan, he would be way less shocked when he discovered about it, the same can be said about Tyler reveal as not being real, if the hints were not so subtle we would have all figured it all before Jack and this would have ruined the shock completely, there is also the idea of 'toxic masculinity' around this movie, and the more I thought about it, the more it made sense, of course, Jack idea of a 'manly man' would be someone as confident, violent and careless as Tyler, it just works so well I am honestly shocked. Overall, this movie is fantastic, I would rewatch it all the time if I could. 10/10 Masterpiece."
    },
    {
      "rating": "9",
      "text": "Decided to watch this due to the massive following it seems to have, and somehow despite all the hype i wasn't left underwhelmed by it. The story was very engaging and forces you to want to know more throughout, much like the main character himself does. Definitely worth watching."
    },
    {
      "rating": "9",
      "text": "Fight Club is an odd movie. When you first hear about it, it sounds anything but spectacular. What's so interesting about guys fighting each other in a basement? The movie sounds boring.\rWRONG\rAfter watching Fight Club a solid six times, I can safely assure everyone that it is one of the best movies ever. I can't explain why, but it's just an awesome movie, and I'd argue that it's one of Pitt's best movies.\rJust watch it. Do yourself a favor."
    },
    {
      "rating": "8",
      "text": "Fight club is a very interesting film to talk about, seeing in how it talks about such a hot subject and has lots of messages and meanings. I will try however to try and simplify as much as I can. Fight club is about an insomniac who meets this guy who then gets him to form a fight club. From that it sounds pretty simple, but in actuality it's a bit more complex. He starts joining therapy sessions merely for the thrill, I know it's strange right? But apparently the thrill is that he can finally try and show some emotions. I guess that this is here to later show up in the film, like how they talk about his life is meaningless and he only goes along with curve to get by. A lot like the catcher in the Rye. Once we are introduced to Tyler Durden the film starts to become much more interesting, and I think that's a good joke as well. Brad Pitt does a great job of being this leader of anarchy, he's charismatic, and has the right attitude to approaching people to join his cause. Edward Norton however is uninteresting, but that's the point, and I guess that's a pass in my book. One of the most famous parts of this movie figuring out who Tyler Durden really is, and when you find know it makes everything you just scene even more weird. Also the themes it tries to convey are bit too complicated or not that well thought out. I really do like this film, and I think it is a very good movie, but I think again that it may be saying a bit too much or not making sense."
    },
    {
      "rating": "10",
      "text": "WHAT? I don't have time to write a review, but THE CRITICS ARE BS! I'll say that again.\rTHE CRITICS ARE ****\rThis movie is my favorite movie, it's amazing in all the right way, WATCH IT RIGHT NOW  screw the critics."
    },
    {
      "rating": "9",
      "text": "Fight Club delivers a slowly escalating story about an underground fight club. It is dark and brutal. Edward Norton delivers a good performance as a depressed young man who's life is going nowhere. Brad Pitt does a fantastic job of playing a man who is not attached to objects. He's all about experience. This movie's story keeps the viewer enthralled in it's twisted world. It also has a terrifying and amazing ending."
    },
    {
      "rating": "10",
      "text": "David Fincher has earned respect by many for Fight Club, The Social Network and other great films he has directed but easily this is his best. Fight Club starts out great, with cool edgy music and great narration and this movie only gets better from there. Throughout I want this movie to go on forever and when you reach the end and you realize what this movie has been leading up to thats when you realize that this movie has an incredible plot, script, and is acted out by Norton and Pitt very vividly and thought out. Fight Club leaves you wanting more, and sadly it cannot provide for that but with great directing by Fincher, a great plot and script Fight Club is definetly one of my favorite movies of all time. 10/10"
    },
    {
      "rating": "9",
      "text": "Fight Club delivers a kick to the head of excellence, a sensational film with an astounding performance by both Edward Norton and Brad Pitt. Simply a must see."
    },
    {
      "rating": "9",
      "text": "I would write a review about Fight Club, but...first rule about fight club...\rJust kidding. This movie has fantastic performances from the entire cast, great twists and turns and is definitely a must watch."
    },
    {
      "rating": "10",
      "text": "This is one of my all time favourite films. One with identity and how one can interwind with our own life, despite how different they can be, yet so similar..."
    },
    {
      "rating": "10",
      "text": "Awesome movie. My favorite film. Cool plot with unexpected plot twists. Cool shot for 1999. The atmosphere in this movie is awesome. The music is awesome. The film looks at one go. In principle, this movie has no minuses. It is a pity that this film when he came out did not understand it. He could get an Oscar. Evaluation of my favorite movie 10/10"
    },
    {
      "rating": "10",
      "text": "'Infantile philosophizing'? There's no wonder America hates Fight Club, because of its harsh, brutal reality that truly makes you question life's values and your 'goals'. Fincher's, Norton's and Pitt's greatest movie, ever."
    },
    {
      "rating": "10",
      "text": "that becomes one of my top rated movies, even after 18 years after it's debut it plays a huge role in basic movie collection which every person should've seen."
    },
    {
      "rating": "9",
      "text": "Fight Club is a truly great film in several aspects. Not only is David Fincher's direction spot-on, with every nuance working just the way it should to get the message across, but Brad Pitt and Ed Norton both give excellent performances as the film's protagonists.\rThe story and visual style tap into the human mind on certain primal levels. Not only does the film itself release aggression, but it helps viewers do the same. Everything works just right to get a brilliant message across, resulting in a very entertaining and very well made film."
    },
    {
      "rating": "9",
      "text": "Scene in the hotel when Edward Norton realises what is going on with Brad Pitt sitting in front of him still gives me goosebumps. Epic solution to a weird story. The Pixie Song at the Ende plus the Ende Scene are so dark and yet very satisfing."
    },
    {
      "rating": "10",
      "text": "One of my top 10 movies of all time! A Fincher movie that will not dissapoint you! Brad Pitt's and Edward Norton's performances were amazing. The plot twist at the end is breath-taking with the last scene, which is one of the best final scenes ever put on screen. It is worth of watching every goddamn month  dozens of times!"
    },
    {
      "rating": "9",
      "text": "This is one of those movies that promises a lot less than it offers, making it a pleasant surprise. Personally, I had low expectations when I saw this movie, but in fact I had read virtually nothing about it before I saw it.The ingenious script is based on the strange and somewhat masochistic friendship between two very different men. One is very shy and the other very rebellious and iconoclastic. Both create a discreet, strict-rule fight club that evolves into a sort of secret society of anarchist contours. The story has a lot of twists and turns, surprising us, catching our attention. However, its not a perfect movie and there are really logical gaps and credibility issues in the story, not to mention that, at some point, the audience no longer really knows what is true in everything they saw. I believe this is intentional, and I recognize that its a feature that has its charm, but it may disappoint some people (personally I dealt with it reasonably well).A decidedly good point in this movie is the gigantic performances of Brad Pitt and Edward Norton. Both are great actors, when they have space and material to evolve, and that's what happened here. Both actors were brilliant and developed throughout the film a bizarrely perfect partnership, with a touch of sadism, repressed homosexuality and predatory instinct. David Fincher, the director, also deserves congratulations, as he's the hand that guides everything and manages, with this film, to present to the world what (so far) is the masterpiece of his career as a film director.Technically, the movie is quite good. The shadowy cinematography and the use of high contrast between light and dark were well used features, and the shooting and framing angles are very clever. The soundtrack, discreetly, also helped to accentuate the film's surrealism at the right times. Of course, its an action movie about an underground fighting club, so there are plenty of scenes of gratuitous violence, some of them quite brutal, as well as nudity and dialogues loaded with insults and profanity. So, I leave my warning to parents: its not a children's movie at all, and even teenagers should only watch it with great caution as its really a violent movie."
    },
    {
      "rating": "10",
      "text": "Best movie of all time. Period. Seen it more than 28 times. Its a bible of what we have to learn. I say you are not your clothes. You are not the brands u wear,  even when u think they re part of ur personality.  Comb your hair. I ll tell everyone here the end of the movie, but that its not what this movie is about. First rule of fight club is... you do not talk about fight club. And if u havent seen this film then you are a hollow shell. Become human again and start by watching this lesson."
    },
    {
      "rating": "10",
      "text": "such a good movie with an interesting premise and message, the semi non-linear story definitely does it justice. I'd recommend it to anyone... maybe not a kid though."
    },
    {
      "rating": "10",
      "text": "Modern america.This movie has never been more accurate.If only it was real."
    },
    {
      "rating": "10",
      "text": "Meaningful in so so many levels. Sums up the 20/21st century society its problems and its fears in a realistic way. Freud once said \"civilization is the source of unhappiness\", and boy does that movie demonstrates that. Also check out the mass effect, check out the anonymity cities provide. Check out a lonely person finding his personal Jesus. Check out how a project can get out of hand and lose its purpose and identity. Not to mention the astonishing acting and directing. This may be the only movie worth the \"10\""
    },
    {
      "rating": "10",
      "text": "as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso as asjbasu ãsóasu as[asãso"
    },
    {
      "rating": "10",
      "text": "the most mindblowing plot twist in the history of Hollywood. The first time I watched this movie I had to sit down and just think for 30 minutes before I could move on with my day, and still, it would constantly come back to my mind for weeks. The movie sucked me into the story which made the twist more hard-hitting than anything else I have ever watched. 10/10 no question."
    },
    {
      "rating": "10",
      "text": "Fight Club ist ein düsteres Drama vom Regisseur David Fincher. Es handelt von einem namenlosen Protagonisten (Edward Norton), der sich mithilfe des Seifenverkäufers Tyler Durden (Brad Pitt) aus dem alltäglichen Korsett aus Konsum, Büroarbeit, und Schlaflosigkeit befreien will. Der Film ist nicht nur durchgängig spannend, sondern schafft es Sozialkritik, männliche Identitätsfindung, psychische Krankheiten und viele andere Themen zu berühren, ohne dabei jemals langweilig zu werden oder hochtrabend zu wirken. Auch visuell ist der Film stimmig und beeindruckt mit seinen Kamerafahrten, glaubwürdigen Kampfeinlagen, und einem stimmigen Gesamtbild. Fight Club vermittelt nicht nur rohe Brutalität, sondern hinterlässt einen Sinn von Melancholie beim Zuschauer, wozu sowohl der stimmige Soundtrack, die meisterhafte Inszenierung als auch die hochkarätige Besetzung beitragen. Das actionreiche Drama schafft es die Balance zwischen Unterhaltsamkeit und Tiefsinn zu halten, und ist wegen seiner hohen Qualität in allen Aspekten einer meiner absoluten Favoriten."
    },
    {
      "rating": "10",
      "text": "I want you to hit me as hard as you can.  Fight club is a great movie that will leave you questioning many things in your life. Well done team, well done."
    },
    {
      "rating": "9",
      "text": "This is the type of movie that makes you feel the NEED of watching it again right after finishing it. Really enjoy the clever way in which criticizes society. Outstanding Pitt and Norton."
    },
    {
      "rating": "10",
      "text": "Hands down best movie ever made and if you dont know why please1. kill urself2. kill urself3. go to the hospital coz u have **** brain cancer"
    },
    {
      "rating": "10",
      "text": "Honestly, this is the best movie I'v ever seen. Well one of them. First of all, for the idiot critic that said he didn't like the comedy. It's not supposed to be a comedy. Moron. And to the other critic that said we'd be troubled to think this movie made a point of significance. It's not supposed to make a point. not every movie does. What point does the Godfather make? No one bad-talks that. Critics are dumb."
    },
    {
      "rating": "10",
      "text": "\"The theme is about how modern society has reduced males into enneuchs and how this warps our subconscious into anarcho-fascist mode.\" No. No No No. Also, the people that say that the movie was good up until the \"second-half\" say that because the sole humor of the first part becomes entangled with the complexity of the entire film. In this film there isn't a first and second half, it is a full length movie plain and simple (and believe me, I do understand that they just say that to divide parts of the movie for easier reference). The movie is supposed to be thought like this to show the adaptation of the plot. Please people, seriously! Even the actual critics have ruined what should be an almost, if not completely, perfect score. The scores that some of these critics give leave their comments to \"sick, twisted humor\" or something of the sort - WHAT?! Go critique somewhere else please, because, although the movie is supposed to be humorous (which can be understood by the more deeper thinkers) it is not only a comedy with a crazy plot twist. This movie of course will be liked by some more than others, but if you don't understand the actual plot line and what it really is, then just leave your comments to yourself or share them with a friend, and if you really want to see what the movie conveys, then read some of these reviews or watch the movie again or something! The movie uses so many great techniques, not only in dialogue but also in camera usage and almost eveyr single possible ability that could be used in a movie, really. Oh yeah and back to the quote that I used to start this off (a quote from one of the other users), the movie is not just about \"The theme is about how modern society has reduced males into enneuchs and how this warps our subconscious into anarcho-fascist mode\" (did you not notice the entire appearance of the character Marla Singer?) although it may sound sort of corny, the theme could be considered more along the lines of \"There is a Tyler Durden in all of us\" kind of thing. There is way too much detail to go into for such a well thought out and socially complex movie for me to put in here. Watch the movie again, and if you don't get it - watch it again. An element of the movie that is so genius is that although it is deep and all, the actual approach to the movie and the plot and the entire film, really, is that it doesn't have an \"artsy-fartsy\" kind of setting and dialogue (to some extent yes it does, but you get the point.. I hope) it uses a more down-to-earth realistic view of ourselves, and I say ourselves as everyone, and the actual fabric of human nature and how some things affect the subconscious. Fight Club is really a very, very good movie."
    },
    {
      "rating": "10",
      "text": "Beautifully damaged characters."
    },
    {
      "rating": "10",
      "text": "Awesome is all can say, I've got nothing bad to say about it, its all awesome. It's a must watch."
    },
    {
      "rating": "10",
      "text": "It's a long shot to say this is the greatest movie ever made, but the argument can be made by anyone who sees it and truly gets it. I've never written a review for any film before, but even 9 years after its release, Fight Club has earned it. Violent, yes, of course. It's called Fight Club. But strangely enough, that's a misleading title. It's the most ambiguous fable ever, in that the moral is whatever you make it out to be. This movie solidified Edward Norton to me as a top-tier actor capable of sheer brilliance, and Brad Pitt is amazing as well, cool and scary and ridiculously funny with his red leather jacket. Which brings me to my next point, if you've heard the word \"comedy\" used in relation to Fight Club, you heard correctly. It points out the hilarious nature of society's individuals to try desperately to reach some form of perfection, but of course we know this is impossible. Almost every motif you could think of in a great satirical tale is present in Fight Club. The one I never hear people mention is addiction. (Society"
    },
    {
      "rating": "10",
      "text": "Fight Club is one of the best thrillers in the world cinema. One of the best films of the golden era of the 90s. The best role of Edwarth Northan in his career and perhaps one of the most interesting finals, turning the plot 180 degrees. It's hard to find a more benchmark thriller, David Fincher has done a great job. Fight Club is an out-of-time movie, a classic of the thriller genre that will always be relevant."
    },
    {
      "rating": "9",
      "text": "This is a film where you feel that M. Night Shyamalan watched it and then built his his career off it, a very clever and original film. A deserved classic and one of my favourite films"
    },
    {
      "rating": "9",
      "text": "A film that can really hit you in an enticing and fascinating way. If you think that this film is serious, you got it all wrong. A ride with the best actors into a dark tragedy that is somehow morbidly charming. The most significant film that can really make you amazed in many ways. Finishing this great work with one of the best conclusions ever, leaves you mind  blown. What also makes this film special is the main character, after all, doesn't 'solve' the problem like other films. It was a cinematic experience, and frankly speaking, it took me a while to confirm that this is one of the best films I've ever seen so far."
    },
    {
      "rating": "9",
      "text": "After having finally witnessed and analyzed this smart story myself, the film has enough audacity to explore resonating and intellectual topics such as mental health, consumerism, dissociative identity, human life fulfillment, ethical dilemmas, and mind control.\u2028 It is further bolstered by superb editing, sharp writing, and sublime performances by Norton, Pitt, Bonham-Carter, and Meatloaf.\u2028 I cannot quite give it the five star treatment as its last act hastily concludes on some sour notes which don't ring on the same sweeping melody as its first two-thirds.\u2028 Now, do us all a favour, and don't talk about this picture to anyone else."
    },
    {
      "rating": "10",
      "text": "I was surprised to see this movie! Especially the last part was so amazing I couldn't breathe! This movie is the best!"
    },
    {
      "rating": "10",
      "text": "This is a movie that has alot to tell you and takes its time to do so. What impress me the most apart from its themes is the creativity of the details you can find in it."
    },
    {
      "rating": "9",
      "text": "Игра актёров, сюжет, философский поссыл, побуждение пересматривать фильм. Блестяще"
    },
    {
      "rating": "10",
      "text": "Increíble de principio a fin, y mejora cuando te enteras de que contiene ideas filosóficas. Simplemente peliculaza.Aunque quizás la primera media hora no termina de gustar mucho porque no sabes muy bien a lo que va la peli, pero despues va escalando hasta tener un final bastante bueno en mi opinión."
    }
  ]
}