{
  "id": 12,
  "title": "Inception",
  "starring": [
    "Leonardo DiCaprio",
    "Joseph Gordon-Levitt"
  ],
  "runtime": 148,
  "genre": [
    "Action",
    "Science Fiction",
    "Adventure"
  ],
  "description": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
  "releaseYear": "2010",
  "mpaaRating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/edv5CZvWj09upOsy2Y6IwDhK8bt.jpg",
  "categories": {
    "plot": 7.184210526315789,
    "acting": 7.25,
    "ending": 8.285714285714286,
    "soundtrack": 4.0,
    "cinematography": 8.0,
    "familyFriendly": 7.333333333333333,
    "funny": 7.5,
    "action": 7.6875
  },
  "reviews": [
    {
      "rating": "8",
      "text": "I'd like to keep my review rather to the point.Pros:1. its theme - dream is a fascinating topic to say the least. There are a lot of unknowns in the dreamworld.2. its plot - there are several sweet twists and unpredictable turns.3. its edgy drive - although you know what's coming next but still you feel jumpy about it.4. its fast storyline - the story moves fast from one scene to another, making the viewers feel like on a roller coaster ride. At times, it's hard to keep up, even at the second viewing.5. its sophistication - there is a lot of information to remember and digest. This is the very thing the modern moviegoers are after, I believe.6. its realism - okay, pun intended. The movie explains (or at least tries to) the ins and outs of what dream is about and how it functions, some of which are very familiar with and dear to us.Cons:1. its poor character development - although the acting was convincing enough there was not enough of character development. I wonder how many people really felt connected to the main character(s) after watching the movie. Yes, the movie talks about emotional struggles but it was more of an action film, if you ask me.2. too many distractions - I found that the movie had more than enough characters than necessary. They may play some roles in the plot but they seemed more of distraction than anything else. I wish the movie was more focused.3. a bit preachy - I noticed the characters would explain things about the dreamworld and then the exact things happen later in the movie. I'm afraid, Inception overused this trick.In conclusion, its theme is fascinating but its delivery is not without room for improvement.I highly recommend you to go and read Somewhere carnal over 40 winks, if you dig this kind of flicks.Cheers!"
    },
    {
      "rating": "8",
      "text": "Inception is a daring original, and mind-provoking film. One of 2010's best."
    },
    {
      "rating": "10",
      "text": "What makes Inception so special is that it's not your typical straight forward summer blockbuster. Nolan gives you bits and pieces of information, and as the movie plays out the viewer begins to put the pieces together and the picture gradually becomes clearer. Chris Nolan doesn't dumb down the movie for the audience like most Hollywood movies do these days, he expects us to keep up with him. And when we do, the reward is extremely gratifying. And the visuals were amazing."
    },
    {
      "rating": "4",
      "text": "I was hoping to give it a better score. I'll need to see it on Blu Ray later. It's one of those films that if you don't like it people think you're not cool. I'm not thick but I kept losing the plot.. Charactors had no depth. Film too long. Music too loud [although good] and you could only hear about 20% of the dialogue, so it was easy to lose your way. You couldn't hear ONE word that the Japanese chap said! Looked good with good actors but to be honest it left me cold. It became a' nightmare'. I will give it another go because Michael Cane was in it and Leonardo, two greats. By the way I thought Dark Knight was crap. Nolan seems to be a pretentious, self indulgent, up his own dark place, kind of person. Bring back the good old psycological 'Hitchcockian' thriller. I've just realized I'm overful of 'special effects'. This is just bilge dressed up, isn't it? Dissolusioned, yet again."
    },
    {
      "rating": "1",
      "text": "Funny how people think complex equals smart and intellectual. This movie was a big bag of hot wind. Matrix was better."
    },
    {
      "rating": "5",
      "text": "Not very good really. I've heard the word visionary thrown Nolan's way, but this film was the work of a rather sterile imagination. Yes, it had many layers of narrative cleverly interweaved with eachother, but there was little to compel me at its core. The root cause of Cobb's state of mind just didn't grab me - partly as this relationship was never given the chance to develop to a tangible level. The elements of subconscious displayed were tame and the approach to the dreamworld rather banal - focusing as it did mainly on bland designs, bendy gimmicks and exploding things. There was little edge to Nolan's vision, he seemed quite happy to drown us in relentless exposition and unimaginative slow-mo shots. Scenes were very quick and at no point approached the atmosphere and interest of a real dream. A shame, because at their best, this is what films can do - engineer the quality of a waking dream. Compare Inception to the more intriguing work of Lynch, where scenes seduce with the perfect balance of the real and surreal, and whose images tend to linger in the mind. On top of this, Nolan is simply not a very good director of action; he is quite loose with the camera, and I yearned for more flair and invention in these scenes. Instead, he relied on an incredibly insistent score to give the action some punch. For a film about dreams and the subconscious, it was curiously impersonal and mechanical. Certainly, the real danger and sexuality of the subconscious might scare off mainstream audiences, but Nolan was given free reign to do what he wanted - so why not do something more interesting? Freud and Jung would find little to interest them here, as the film is less concerned with psychology and more with the narrative possibilities afforded by a convoluted dreamworld fiction. Perhaps Nolan does dream of corporate worlds and Bond fortresses. Unfortunately, such things don't interest me."
    },
    {
      "rating": "2",
      "text": "I thought this movie was not as good as people are saying.  Because we knew it was dreams inside dreams the over the top fight scenes had no bearing.  Who cared?  As a result the movie became boring and repetitious.  I would be very hard pressed to recommend this movie to anyone.  Stay away."
    },
    {
      "rating": "10",
      "text": "One of the greatest achievements of Christopher Nolan; slumberland experience that excels The Matrix due a masterly camera job and efficent use of special effects. One of best roles of Leonardo Di Caprio."
    },
    {
      "rating": "6",
      "text": "This film was completely monotonous, and far too long. The characters had no depth at all. When you think about what 'plot' means, you would be able to see that the plot of Inception was so plain and thoughtless that it insults every viewer it hands out its complimentary rose shades to. Inception may have amounted to something of substance if it had spent more time thinking about what it was lacking and less time running around in zero gravity squealing 'Yay! Look at what I can do!'"
    },
    {
      "rating": "6",
      "text": "It's started out very well but the rest of the movie is merely set pieces for the actions before returning to the main storyline of a man trying to get home to his children. For a movie dealing with dreams, the logic is too logical after a while and all the wonderful ability in dreams is no longer explored. Like one of the character said, \"why not dream bigger?\""
    },
    {
      "rating": "5",
      "text": "This movie draws an 84 score?  No way.  Plot is too complicated and goofy to be followed by anyone who wants some context with reality.  Ellen Page is annoying as the new talent brought into the IM force as the last minute and turns out to be the smartest one of the bunch while playing a game she didn't even know about a few days earlier.  Best way to watch this move, if you must, is with the CC on so you can follow the thin plot somewhat.  For my money, watch \"12 Monkeys\" again."
    },
    {
      "rating": "10",
      "text": "Incredible film, it provided me with the opportunity to escape into a new world. Why should I complain? Christopher Nolan has a Brilliant Mind."
    },
    {
      "rating": "4",
      "text": "The special effects are the best part of this movie. The movie is basically taking naps with other people and joining their dream. that's goofy."
    },
    {
      "rating": "4",
      "text": "Where are the ratings of 10 coming from? Special effects were awsome. The plot was absurd and boring at times. It's no Matrix more along the lines of Total Recall. Leonardo DeCaprio's tortured soul characters are getting old. I must have dreamed this was going to be a better movie. Apparently a lot of the reviewers are still dreaming as well."
    },
    {
      "rating": "10",
      "text": "A mind-bending roller coaster of a movie. I was on the edge of my seat the entire time. Cast was inspired, ensemble acting."
    },
    {
      "rating": "10",
      "text": "Fantastic movie. No, it isn't a truly original concept, but nothing is. I don't see how anyone could think this was boring, as there was action throughout most of the movie and the stakes were higher than death. So glad Hollywood made a movie that's not a sequel. You have to be paying attention and thinking about what's going on at all levels of the dreams to really understand what's going on, which might put off some people, but it really enhances the film. I love non-linear storytelling, though, so I might be biased. Great acting as well. Glad to see Ellen Page and Joseph Gordon-Levitt (aka chick from Juno and dude from (500) Days of Summer/Third Rock from the Sun) do some action roles to show they have chops outside pseudo-indie hipster movies. Worth seeing again."
    },
    {
      "rating": "4",
      "text": "This movie had promise, the story was awesome, and the special effects were great. But, it was so long, boring, and confusing. That I wanted to leave the whole time, and get my $9.50 back. I don't know what these people are on who give this movie 9's and 10's. Don't get me wrong, i love a psychological thriller here and there, but this movie was just plain headache inducing. So many people walked out of the theatre with a migraine after that 2 and a half hour piece of garbage. Oh yeah, the acting was good. Yet not good enough to save this matrix wannabe."
    },
    {
      "rating": "6",
      "text": "I loved the film but at the end of the day a dream sequence is a dream sequence and I detest dream sequences. Otherwise a really good film but still it can't completely redeem itself"
    },
    {
      "rating": "6",
      "text": "After the Dark Knight I was expecting something as impressive if not more.  Alas it's not to be.  Not the hugest DiCaprio fan in the world for a start.  He seems to play the same character in every film he's in nowadays. My main problem with the film itself is that its just too overly complicated to be truly entertaining.  There are some clever ideas such as the dream within a dream concept and how this can affect the physics of that dream world.  You really have to pay close attention though. The sub plot involving Marion Cotillard's character is more intriguing."
    },
    {
      "rating": "10",
      "text": "This film does not need any more reviews, but I wanted a vote. It's awesome, clean, polished, intelligent, exciting, Deserves film of the year. Best film in last 3 years,"
    },
    {
      "rating": "10",
      "text": "Now I could go on for ages about this film, thats why I'll keep it brief. No brief overview from me (storyline if you will), you'll have to find that out for yourself. Since films began way back in the late 1920's there has been many classics, such as, Gone With The Wind, Casablanca, The Sound Of Music, The Great Escape, The Godfather, and Shawshank Redemption, to name a few. And rightly so they all deserve there praise and plaudits galore. But after seeing this film now five times, twice in the cinema and three on dvd, many will agree this is cinema redefined. Christopher Nolan is quite new to some people, but what he has done here is taken the money Warner Bros. have given him for the two Batman films he made and he has created something quite extraodrinary. Its a complicated film which for some may be quite long and boring, but for most its most incredible 144 minutes ever in the history of cinema. Thats why I've given Inception this bold remark, THE GREATEST FILM ACHIEVEMENT IN ALL HISTORY!!! My ratings in whatever format; 5/5, 10/10, 100%/100%, *****!!!"
    },
    {
      "rating": "5",
      "text": "Nolan had a good idea to work with here but it fell far short of such high expectations.  He never lets DiCaprio act and he never lets any true emotion seep into the film to give it any lasting value.  People will and have commended this movie for being such an original and risky film released in the middle of the summer.  But, that aside, will it really hold its own as a seminal piece of film making in even a year? Probably not because it is too self indulgent on Nolan's part, it almost seems like a rough outline of a movie that had the potential to be way better."
    },
    {
      "rating": "5",
      "text": "Inception a bladderful of a movie. It's long. As befits a film written and directed by the guy who made Batman cool again, it's heavy on the action and visual arts. As befits a film written and directed by the guy behind Memento, it has a mind-bending plot. What's the movie about? The most basic of questions: what is reality? It plays with us by sending its characters into ever-deeper layers of dream states in search of a MacGuffin. And while the film ostensibly delivers the obvious enigmatic ending, it's scattered with hints that suggest a further hidden layer. How clever. By the time my bladder had insistently declared its presence, I was bored with the spectacle. For the film is indeed a spectacular, the sort of thing Hollywood does well. It's also an example of what Hollywood spectaculars often don't do well; it fails to connect with the emotions, with our sense of empathy. This, despite a plot in which the love interest is a central device. Ellen Page is terrific as the spunky, wisecracking, rule-breaking girl who gets pregan.... wait, let me start over; Ellen Page is terrific as the spunky, wisecracking, rule-breaking sidekick. She's also at risk of getting typecast as a spunky, wise.. well, you get the idea. Leonardo DiCaprio is excellent as the thinking man's tortured action hero. He looks great. Everyone else is a cipher, including the aforementioned love interest.  I'm sure that Inception is a visually stunning, intellectually intriguing movie.  I'm not sure it earned the right to test my bladder's breaking point."
    },
    {
      "rating": "6",
      "text": "really great for all the technicians aspects of the movie......(obviously) impressive...(with such names in the crew)...but about the screenplay...check south park!"
    },
    {
      "rating": "5",
      "text": "One thing for sure the movie will mess with your head. But it was slow and a bit dull for my likings. But it's definitely worth a watch just to see if you can figure out what the hell is going on."
    },
    {
      "rating": "6",
      "text": "Dreams layered on top of dreams makes this a difficult movie to follow.  The great action is inhibited by the confusing layers of dreams.  Let the confusion be your friend and enjoy the action."
    },
    {
      "rating": "10",
      "text": "Best movie of 2010... Great story and cast with 5 star graphics and the action and suspence non stop and a movie that will get you thinking movie well worth getting on DVD"
    },
    {
      "rating": "10",
      "text": "Inception...... a dream within a dream..... a new concept... a new idea... much more intriguing than actually any other movie in 2010 which was either based on comics, d internet... an others with weak storylines and fake plots...dis is reall...puttin an idea into someone's head wen in ur own dream...brilliant i give dis a 10.99999999999 christopher nolan also loved the drama created in dark knight ...epic!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "I just watched this film for the second time, and I can honestly say I enjoyed it more than the first.  Not to say I didn't enjoy it the first time around.  It's just that watching it for a second time I could follow everything that was going on, and hence I felt a lot more engaged in the story.  This really is a brilliant film that challenges the notions of space and time, reality and dreams, and truth and ideas.  And it does it in an action-packed way. The dream sequences (which make up more than half the film) are also very beautiful to look at.  It reminds me a little of David Lynch's \"Mulholland Drive\", which also polarised critics, and also took a couple of viewings to fully grasp.  However Inception may be a little more accessible with its more familiar cast.  I wish there were more films like this, that get you thinking, instead of the dumbed down fare we mostly get out of Hollywood.  We know that films like this can be made, but its more often about box-office takings these days, and beautiful people.  Thankfully films like this have a high replay value."
    },
    {
      "rating": "5",
      "text": "In an industry filled with sequels and remakes Inception dare to be original, and for the most part it delivered!!! The only problem that I had with this movie is that it was way to long, and the ending was a little far fetched even in a fantasy world."
    },
    {
      "rating": "10",
      "text": "Hello. If by any chance what so ever you hated this movie then you should probably reread this at list a couple times. Inception is by far the best freaking movie of the decade. just as the decade has ended.whenever I see someone who doesn't like this movie is because they just don't understand it at all. Then they get all mad and just makes fun of it any way that they can like, '' it was a waste of time or money.'' well let me just tell you that there was plenty of action  and actually a few funny  parts in it as well( definitely more then the dark knight.). It was the '' total package '' and it is a movie that I think everyone on the planet should see it to just notice that nolan made it all by himself. The whole dream fiasco, the whole idea of it is incredible and that it doesn't just blow still amazes me to this very day. And we all had a decent dream once, right? Can't we just love Inception and get along?"
    },
    {
      "rating": "10",
      "text": "this is the best movie ive ever watched.Nolan brings out his writing and directing ability in this movie.its quite sad he wasn't nominated for best director. :("
    },
    {
      "rating": "10",
      "text": "Inception has its weak points and its strengths. What makes Inception good is the fact that it explores a generally unexplored movie subject. The mind. Coupled with great action and acting this movie is a wonderful. The plot may be confusing and hard to follow, and by the end leaves you questions, however the movie does its best to convey the message of the film."
    },
    {
      "rating": "10",
      "text": "I can't believe someone actually said that the Matrix was better............  I must admit the first Matrix was awesome, but then by the next two sequels it went \"Hollywood\" I swear those fight scenes in Reloaded looked like Keanu Reeves was on \"Dancing with the stars\"  It was like no one on the set even attempted to make the fight scenes look real. (It looked like really bad dance moves especially with the sountrack blazing in the background behind each fight scene)  Now Inception obviously came from a Hollywood that has become \"Matrixed\" out(And I'll give that much for the matrix trilogy, for setting a new standard) But Inception has a really great flow about it, its quite smooth in its distribution, Its like walking right into a dream that someone has created. The creators of this film obviously truly thought this film through, which today doesn't seem to happen much, the truth of this is that by the end of the film , you realize that they were the \"Architects\" and you were the patsy whose mind they've manipulated by a dream they've created."
    },
    {
      "rating": "10",
      "text": "A mind-bending, intricately constructed film.  Nolan's surreal imagery, deeply layered story telling, and compelling visual style make this a must-see.  Top-notch acting, superb direction, and fantastic special effects."
    },
    {
      "rating": "6",
      "text": "Inception should have opened to Mark Twain's famous quote; \"other people's dreams are dreadfully wearisome\". Thanks to the media machine surrounding Inception, it became impossible for me to approach without wanting to cast aspersions on the whole film. Yes, it's more intricate than the majority of run-of-the-mill action films that are released year after year, but that isn't saying much. It's an OK film, if a little boring and with its head firmly up its own arse, but throughout I was reminded of examples where the subject matter was tackled far more effectively. It's sort of like The Matrix of its time; here's a dream, a world of complete imagination! Now, let's solve our problems with automatic weapons."
    },
    {
      "rating": "9",
      "text": "It is not Nolan's masterpiece (this title belongs to \"The Dark Knight\"), but \"Inception\" amazed me with its powerful cast, inventive story and spellbinding visual effects."
    },
    {
      "rating": "9",
      "text": "El origen (Inception): reseña en castellano / español.\r ___«El origen» [en inglés «Inception»] es una de las películas más interesantes que vi hasta ahora. Cristopher Nolan, su director [Memento, El caballero de la noche/Dark Night] es respetuoso con el espectador, no exagera y tampoco ofrece contenido gratuito que desmerezca las capacidades intelectuales de su público. La historia está presentada de manera prácticamente impecable porque no deja cabos sueltos y los que quedan trascienden el argumento volviéndose irrelevantes [cómo funciona la tecnología para invadir sueños, en qué marco temporal transcurre la historia o el pasado de algunos personajes de los que el mismo no es relevante para el argumento]. La trama aborda los procesos oníricos de una manera muy interesante y científicamente «plausible» sin embargo se tomaron algunas licencias para justificar los sucedido en la pantalla y eso está muy bien para la historia y muy bien por parte del director porque nos permite construir con mayor fidelidad y veracidad la fantasía que surge como exposición al contenido del film. Aquellos que estén familiarizados con los procesos oníricos así como la mitología y el psicoanálisis [con fuertes raíces mitológicas] se van a deleitar con las referencias expresas, algunas de ellas tan sutiles como los sueños:\r *Ariadne, el personaje de Ellen Page que se encarga de la construcción de los laberintos oníricos, toma su nombre del personaje mitológico griego, la hija del rey Minos, que le da a Teseo una bovina con hilo para que desenrolle y pueda salir del laberinto del minotauro a medida que lo incursiona.\r *El uso del agua como conducto entre el mundo de los sueños y el real, al igual que la fuerza de gravedad que suele ser un fenómeno que despierta a la gente con bastante frecuencia.\r *El empleo de la canción «Non, je ne regrette rien» de Edith Piaf como alerta que tienen los personajes para salir de los sueños porque Marion Cotillard [Mal, la esposa de Cobb] ganó el oscar como mejor actriz protagónica en 2009 por el rol principal en la adaptación cinematográfica de la vida de dicha cantante «La vie en rose».\r *El hecho de que la esposa de Cobb se llame Mal y represente la fuerza destructora del inconsciente de Cobb; fuerza que puede ser comparada al arquetipo de la sombra en la psicología Jungiana.\r *La ralentización de la percepción del tiempo en el estado onírico y su factorización exponencial a medida que se incrementan los niveles de profundidad del sueño.\r *La preparación anticipada que hace Cobb a Fisher antes de la inmersión en el inconsciente de este último: lo hace recordar a su padre y procesar cierta información respecto del mismo para que sea lo último que recuerde antes de dormirse y lo utilice como material de acceso inmediato en la construcción de su realidad onírica.\r *El personaje principal representado por Leonardo Di Caprio se llama «Cobb» [un tipo de araña] y su función es moverse por los laberintos construidos cual telas de araña para confundir a su presa, atraparla y obligarla a que se rinda para que ceda la idea que está buscando.\r ___Si bien en ciertos puntos se puede comparar esta película con la trilogía «Matrix», sólo puede hacerse si uno se basa el similitud de algunos conceptos como el de las realidades irreales y la presencia de mecanismos de defensa dentro de cada realidad que se manifiestan como proyecciones antropomórficas no obstante «El origen» ofrece una experiencia diferente que está basada en el conflicto interno que surge cuando la realidad que nos rodea es amarga e indeseable y una realidad alternativa es lo que más se añora, la capacidad que se tiene para influir la vida de los demás con una simple idea y las consecuencias catastróficas existenciales que eso puede tener tanto para la víctima como morales para el victimario.\r ___«El origen» es un film que debe ser visto porque es generoso, respetuoso, delicado y gratificante aun si su final no es lo suficientemente contundente después de todo lo que hay que atevesar como espectadores; toda la experiencia vale sus 146 minutos de duración. La realidad fantástica que nos propone Cristopher Nolan requiere de una módica cuota de voluntad y atención considerable pero retribuye con la sensación de haber visto algo complejo en un lenguaje simple, rico y directo que sin duda alguna gratificará a muchos.\r (c) Palfrei. 2010-08-16.\r Reseña completa [técnica]: http://palfrei.blogspot.com.ar/2010/08/ooxiii-resena-el-origen-inception-esp.html"
    },
    {
      "rating": "8",
      "text": "Inception is visually dazzling and original and fantastically entertaining. And it features acceptable performances, but I can't help but feel the whole idea of the film gets lost in the main characters own dreams. I give this film 76%."
    },
    {
      "rating": "9",
      "text": "\"Inception\" Is the ideal movie to watch on 1080p bluray for an extreme-kindly-logic adventure to the three layers of inception to two man's mind, and each one of them is full with secrets that have long wait to be revealed.After two hours of the movie, I was sure it went only 1 minute from my life, and I believe in some point, that the movie has managed to plant the seed deep in my mind, truly a great idea for the perfect movie."
    },
    {
      "rating": "9",
      "text": "INCEPTION is a brilliant and entirely original film from the director of  MEMENTO and THE DARK KNIGHT. It explores the fantastic world of dreams and what lies between in an elegant and complex crime caper that will capture your attention and imagination several times over. Nominated for 8 Academy Awards."
    },
    {
      "rating": "9",
      "text": "Well i know this movie has been out a while now but i saw some of the reviews on here and really can't believe it. For one what is so difficult to understand? They tell you everything you need to know in the movie. The only thing you should be questioning is the ending as far if he is in a dream or in reality. Other than that I don't see how many movies could deserve a 0....especially one with such high production values as this. This movie is an enjoyable journey, well acted, especially the scene stealing Tom Hardy. I honestly do feel bad if you don't enjoy this movie because I believe it to be one of the better of recent history."
    },
    {
      "rating": "6",
      "text": "Kind of enjoyed this movie. The concept behind the movie was good but i felt the execution of it wasn't. The story was average and i didn't really like any of the characters."
    },
    {
      "rating": "6",
      "text": "Meh. A good cast and a good premise wasted. I went and watched this expecting cool action with some psychological twist, what I got was arbitrary mechanics not too far from The Matrix and a movie that doesn't even manage to respect its own set of rules. Once again, Nolan is acclaimed for doing something incredibly average and adorning it with its dark film colors and serious acting to make it look like it's something more than what it is.\r Also, open endings really grind my gears, to me they shout \"we want to keep the public guessing so that they'll talk about the movie, even though we didn't put thought at all into this scene, but whatever they'll just think it's intentional and deep and that it stimulates critical thinking!\"."
    },
    {
      "rating": "9",
      "text": "Inception can be summed up in one word, brilliant. The way in which the storyline is structured is very impressive and the casting has been carefully thought through which is something most blockbuster films have failed to accomplish in recent years. Page's performance as Ariadne is debatable but nothing worth 'over-ranting' about. The CGI in the movie is magnificent but isn't over done, making it very appropriate and entertaining when used. One thing is for certain and that is that Nolan has definitely brought the best out of the actors in Inception, particular Tom Hardy who plays the role of Eames near enough pitch perfect. With a combination of stars, effects, performances, action, strong narrative & superb direction, it's hard to pick out any major faults with Inception. A must, must see."
    },
    {
      "rating": "9",
      "text": "The movie is great, easy to understand, after the beginning at least, and very well acted and directed. I recommend this movie to people who doubt. the concept of the movie was amazing, and the story was genius."
    },
    {
      "rating": "9",
      "text": "I thoroughly enjoyed myself on this rollercoaster of a blockbuster which has to be one of the films of this decade. It has everything you could possibly want and to be honest, it was not very difficult to follow. The only thing stopping me from giving a ten is just that the idea is a tiny bit far-fetched. Upon first viewing I would have given it a ten but now I think a nine will suffice. The Dark Knight is still, in my opinion, Nolan's masterpiece."
    },
    {
      "rating": "9",
      "text": "'Inception' is one of the most unique films I have ever seen. The concept is complex, well thought out and engaging. The visuals are brilliant and really do display HD at it's greatest. The acting is superb, as is the cast. 'Inception', I think, deserves to be called a masterpeice.\rThe ending also has you asking yourself \"Was it a dream?\" and that is the greatest part about this film, it provides so much backstory and depth to the characters but still has you questioning the entire thing, allowing the audience to create their own interpretation and conclusion."
    },
    {
      "rating": "9",
      "text": "Interesting movie, kinda reminds me of an epic Rage-Comic for some reason. Because it's your real-life problems \"epicified\" into a movie. And the way you're getting trolled at the end, it's like waking up from a dream. Luckily, I'm intelligent enough to \"kind of\" understand the movie sequences. Epic movie, go watch it :D"
    },
    {
      "rating": "9",
      "text": "Inception never fails to deliver its great premise through the stylish narrative, the emotionally captivating characters, and, most of all, the extraordinarily stunning visuals."
    }
  ]
}