{
  "id": 162,
  "title": "Mad Max: Fury Road",
  "starring": [
    "Tom Hardy",
    "Charlize Theron"
  ],
  "runtime": 121,
  "genre": [
    "Action",
    "Adventure",
    "Science Fiction"
  ],
  "description": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.",
  "releaseYear": "2015",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hA2ple9q4qnwxp3hKVNhroipsir.jpg",
  "categories": {
    "plot": 7.387755102040816,
    "acting": 7.2105263157894735,
    "ending": 4.444444444444445,
    "soundtrack": 6.8,
    "cinematography": 5.333333333333333,
    "familyFriendly": 8.23076923076923,
    "funny": 5.333333333333333,
    "action": 8.981818181818182
  },
  "reviews": [
    {
      "rating": "10",
      "text": "It's a disaster. For other action movies this decade. After over 30 years past the latest installment of Mad Max series, George Miller returns with his greatest ideas in his mind, resulting in raising the bar in all terms for the genre - colorful characters, satisfactory plot, delightful setting, enigmatic character and story backgrounds, multiple references to other movies of the series, and enough of personal and overall human drama. It's only May, but we already have our movie of the year."
    },
    {
      "rating": "9",
      "text": "I grew up with my brother watching the old Mad Max movie. I Loved it then and I'm glad to say the legacy Lives on and it doesn't disappoint. I wasn't able to sit back at all during the movie, the constant action and twists had me either on the edge of my seat or jumping up and down with my brother screaming. The only thing I feel could have been improved upon was diving more into the past of Max himself, he is one of the most iconic characters ever for many Action movie fans and yet, in a movie made to continue his Glory, he was explained very little. Those who know of his past of course understood some of the finer points in the film. All in all, I truly enjoyed my experience and I will definitely be buying it upon release. 9 out of 10."
    },
    {
      "rating": "10",
      "text": "A true masterpiece! Honestly I was a bit worried when I first sat in the cinema to watch this movie because I was unsure if the movie will live up to my expectation based on what I'd seen on the trailer or not. This is because most of the movies I watched previously only appears really interesting in the trailer but not in real premiere. However, this one totally blew me off. It is super duper cool and worth it! I haven't watched previous Mad Max series and when I heard that since this is going to be a sequel to past Mad Max series, I thought I wouldn't understand the plot but it turns out there's not much to understand anyway. The plot is straightforward although there are some parts which leaves me into question but I guess I might need to refer that to past series. Anyway to be honest the plot is just normal to me but I do give top marks for the action of this movie. I mean this is literally a full action movie. Right from the beginning to the end there's always action scenes which leaves the audience in awe and I think with this kind of movie, the plot don't mind that much to me. This movie is like the apocalypse version of Fast and Furious and for gamers who have played apocalyptic games, this reminds me a lot about games such as Rage or Twisted Metal. I would love to see another sequel to this!"
    },
    {
      "rating": "10",
      "text": "\"Mad Max Fury Road\" has everything to be the best film of the year, I find it hard to get someone to be better than that, more than exceeded all expectativas.A flawless film photograph is perspetivável minimal use of special effects used by George Miller also Mitou's time to put the public's disposal a comprehensive history and flowing very well for those who first had contact with the universe of Mad Max.Assim as was being shown from the first film publicity materials production makeup and costumes worked well highlighting the designs used in the film everything that appears on the screen is extremely beautiful and attractive visibly surprising you every time something new comes on the olhos.Resumindo \"Mad Max fury road\" is pleasant at all way, the kind of movie that makes you feel like watching it again as soon as the lights come on."
    },
    {
      "rating": "9",
      "text": "Holy crap, what did i just watch?! Wow i never seen something that much intense and epic, seriously Mr Miller is a genius.\rI really recommend this action master piece to all modern epic action lovers.\rIts totally good."
    },
    {
      "rating": "8",
      "text": "A much more solid movie than I was expecting. It managed to keep all the ridiculousness of the old Mad Max movies and still managed to be fun but not feel out of place or incredibly stupid while doing so. Charlize Theron did a great job, which I'm glad to see after the last few stinkers she's been in. It's pretty much nothing but action for 2.5 hours straight, but it worked in its own way.\r If you're going to see an action movie this summer, I'd say choose either this or Age of Ultron, but this was definitely the superior movie."
    },
    {
      "rating": "9",
      "text": "\"Mad Max: Fury Road\" 10 Scale Rating: 9.0 (Fantastic) ...\r The Good: Quite possibly one of the greatest action films of the last 20 years, if not of all time. The film retains the gritty tone of the original films, but with updated effects and choreography that is mind-blowing. \"Pulse-pounding\" and \"edge of your seat action\" are terms that get thrown around a lot in reviews of films like this one, but they are completely appropriate here. Almost the entirety of the movie is spent on one \"war rig\", but there is a certain level of twisted beauty in the simplicity of it all. The vehicles are fascinating beasts of twisted metal and gasoline. The characters are hopeless, yet determined. The world itself is barren, hot, and unforgiving. This all sets the tone perfectly as you watch the protagonists struggle through it all in a series of brilliantly designed chases, brutal battles, and bloody deaths. Hardy was well cast as the titular Mad Max, grunting and fighting while uttering few words. Nicholas Hoult is unrecognizable as Nux, one of Immortan Joe's (the main villain of the film) \"War Boys\". When he's on-screen, he definitely stands out and Hoult is becoming quite the character actor. The real star of the film, however, was Charlize Theron. If anyone ever wondered if she could pull off an action film, wonder no longer. She not only pulls it off, but excels. Entertaining from start to finish, Mad Max: Fury Road is already in the running for best film of 2015.\r The Bad: Not that it matters TOO much, but the plot is not only paper thin, but mostly non-existent. It's a small detail, but prevents the film from being absolutely perfect. Aside from that, some of \"the Wives\", who are a plot device that helps drive the film, were somewhat annoying and uninteresting."
    },
    {
      "rating": "10",
      "text": "Finally, a movie that lives up the hype. It has been a while since a movie actually lived up to all fuss. If you have enjoyed any of the previous Mad Max movies, this is well worth seeing. If you like action movies, this is well worth seeing.\r Was it perfect, no, but it was really good. They struck a nice balance between realism and fantasy physics. The story did not get to complex or retread the previous movies story lines. It fit the Mad Max universe.\r I am willing to say Fury Road is the best of the Mad Max series. Loved Road Warrior, but Fury Road got to take advantage of a higher budget and more modern effects.\r The only thing that kind of annoyed me was the children memory thing. They over did that at times.\r Did I miss Mel Gibson, nope. Tom Hardy is a great replacement for Mad Mel."
    },
    {
      "rating": "10",
      "text": "REALLY good and intense movie throughout. The part when one of the wives dies is really sad. Also, Immortan Joe is very creepy and the movie is more violent than a normal r-rated movie. This movie would have been nothing without Furiosa. Tom Hardy is excellent as Max and from the beginning to the end, Mad Max: Fury Road was very intense. I even got a poster when I saw it in 3D."
    },
    {
      "rating": "10",
      "text": "What a movie\rWhat a lovely movie\r This is how action films should be, not high emotion drama bullsh*t. Sometimes, you just wanna see a guy with a guitar on top of a monster truck shoot flames out of the neck. And that was in this film. Sometimes the weirdness gets a bit uncomfortable but that's just to show how society had degraded from the old world. Watch this movie now."
    },
    {
      "rating": "9",
      "text": "Mad Max Fury Road is a non stop action thrill ride that barely pauses, and never disappoints. I would feel remiss if I did not mention that if you're a person who dislikes the wacky and weird this is not for you. The characters are all very interesting and well developed, the action sequences are amazing, the pacing is almost non stop, and the villain is almost like a combination between Darth Vader and a possessed Santa Claus. While the film may not be quite as good as Road warrior, it comes very close which is an accomplishment in its own right. In essence Mad Max Fury Road is a great time at the theaters, one that I suggest you see in theaters, because it's such a great experience."
    },
    {
      "rating": "10",
      "text": "Oh, man. I don't have words for this film yet. Maybe there are no words, since what George Miller and his team put onscreen defies description and transcends language. But here's my attempt.\r With technical precision that seems effortless but must surely have taken a small army to manage, Miller weaves his unique, fantastic vision of post-apocalyptic chaos and carnage into a work of piston-pumping poetry, all set to Junkie XL's adrenaline-fueled soundtrack. Without hyperbole, I can say right now that this one of the all-time great action movies. It makes Furious 7 look like a badly edited Mario Kart replay.\r I'm not gonna lie, there was a moment of vehicular mayhem where I shed a manly tear. T'was one of hope, for my heart had almost forgotten what heights pure cinema was capable of. It's got a minimum of CGI, fantastic stunt work, great set design and art direction, breathtaking locations, and strong performances, even from the supporting cast. This is the movie I've been waiting for my whole life, ever since I smashed little Matchbox vehicles against one another as a child and made comics about sentient cars.\r There's no prior franchise experience necessary. If you're a connoisseur of action films, you miiiight want to try being in the best theater you can find this weekend. I just can't wait to see it again and am gonna do so as soon as possible.\r As far as performances, Tom Hardy makes a fine Max, Charlize Theron's Furiosa is up there with Ripley as one of the most badass women in sci-fi, and Nicholas Hoult's Nux is very entertaining. The dude who plays Immortan Joe (he was in the first Mad Max, too) is just perfect, the kind of larger-than-life big boss whom you can imagine inspiring lifelong devotion. Whether or not the story boasts a \"feminist agenda\" in having a number of strong female characters is up to the eye of the beholder, but it didn't bother this cis, straight man. If you want my real opinion, I think the gender-war-fueled backlash is all hyperbole designed to sell more tickets, and anyone offended enough to not want to see THE FIRST MAD MAX FILM IN 30 YEARS probably needs to have their man card snapped in half.\r I really want to congratulate everyone involved in the production of this film. I don't even mind if this ends up being the last great action film, but wouldn't it be grand if this was really just the start of a new breed of action films? I'm really, really hoping that Miller gets a chance to make the sequels that he already has scripts and storyboards for. Tom Hardy is apparently signed on for another three films. I say BRING 'EM ON! Valhalla awaits!!"
    },
    {
      "rating": "8",
      "text": "Up front, I enjoyed it. Puts the Fast and Furious movies to complete shame. And I enjoyed the original too. It’s an entertaining series, and we’ve got some worthy new lead actors to carry the story forward. Kudos to the production.\rHowever, I’m shooting for the tires of all those “10” ratings out there.\rFirst, the movie is essentially a car (truck) chase, which makes it difficult to give dynamic range to the drama – it’s always on pretty loud.\rSecond, the performances are good given this context, but hardly stand as masterpieces of character acting.\rThird, let’s keep our powder dry and acknowledge that 8 or 9 is a worthy score for this movie. If you give Fury Road a 10, what does Raging Bull, or The Godfather Part II, or, if you want to stick to sci-fi, Inception or The Terminator, deserve? Or, if you want a bizarre, violent chase out of the Western genre, what does The Good, The Bad and The Ugly get, if this is a 10?\rFourth, the action-heavy and dialogue-light nature of this genre – and this is a genre film – leaves you with few memorable lines. Without that, it is harder to have memorable scenes. How do we build a shared shorthand around this “classic”? Do we use phrases like “the scene where he got the mask off his face” or “when Max gave her the gun because she was the better shot”? It is not impossible, but it is difficult.\rSo, go to this movie and enjoy its entertainment value, but let’s not elevate too many comics to classics."
    },
    {
      "rating": "10",
      "text": "Believe the hype. It's a visual masterpiece. Almost a single two hour action scene. There isn't a moment that goes by that the scenery isn't jaw dropping, the soundtrack stirring, and the action blistering. If you like your movies long and slowly building, maybe stay at home, this will probably give you a heart-attack."
    },
    {
      "rating": "10",
      "text": "As good as a summer blockbuster can get, stunts you've never seen before WITHOUT CGI, fantastic performances, beautifully shot and set, good to great plot. Not one wrong note. The 70 year-old writer/director George Miller showing all you young shooters how to get a flick done. Prediction: Most Oscar-nominated action film in history. This film is perfect."
    },
    {
      "rating": "10",
      "text": "I would give this 100/10 if I could, I found the movie to be beautiful in every way. This is how to make an entertaining film. This is also a film I can watch over and over again."
    },
    {
      "rating": "10",
      "text": "Easily the best action movie of the last 20 odd years and the first franchise movie in recent memory that deserves getting a reboot. Fury Road features stunt work that makes all the superhero flicks look like Mattel commercials in comparison. The hype is real, guys."
    },
    {
      "rating": "8",
      "text": "If you're a fan of the previous Mad Max films, then go see this one. This movie was absolutely stunning in every way. From the magnificent scorching sands to the high exhilarating car chases. Don't expect too much talking from Mad Max Fury Road, because when it comes to Mad Max, it's all about the EXPLOSIVE ADRENALINE!!!"
    },
    {
      "rating": "10",
      "text": "Mad Max Fury Road is a fantastic Film. The action scenes is crazy and the characters are bad-ass! This movie is enjoyable to watch and it is definitely an action blockbuster! The Premise is simple but the execution of the movie is fantastic.George Miller did a great Job directing the movie,The action is pretty sweet and I can still remember,This is a 2 hours action sequence that may be good for the average movie goers but if you don't like explosions and post -apocalyptic movie this isn't for you."
    },
    {
      "rating": "9",
      "text": "Walking out of this movie, so many superlatives were competing for attention in my brain. The movie is an absolute must-see - let's get that out of the way from the top. For me, it's probably the best, most artistic action film since the original Matrix. Furiosa (Charlize Theron) is clearly the best heroine since Ripley in the Alien films. Going in, I figured the action would be fatiguing, and the desert backdrop would get samey after a while, but I couldn't have been more wrong on both counts. Miller's inventiveness knows know bounds. If I had to point to a slightly weak link in the chain, it would be the Immortan Joe character. No doubt, he's fun to look at and provides some of the comedy, but as a character, he is not nearly as personally threatening as the chief baddies in the original Mad Max and Road Warrior flicks.  But the supreme creativity and the acrobatics in the driving sequences are so over-the-top phenomenal, you'll be conscious of the silly grin on your face when things finally let up and you allow yourself to exhale."
    },
    {
      "rating": "1",
      "text": "I respect the opinions of others but I'm sorry I just don't see how this movie is getting the high ratings it is.  There is absolutely no dialogue, no character development, no acting, zippo, nada, nothing!  This flick is a non stop shoot up video game for teenage children with ADD.  Scene after scene repeated ad nausea with the bad guys falling like ducks in a shooting gallery.  The good guys outnumbered 1000-1 no direct hits.  I felt like I was watching two hours of Ninetendo's Space Invaders or Asteroids.  Then in the end they threw in some Circus Soleil spectaculars with the goonies swinging back and forth on tall bamboo stilts as sitting targets.  Sorry I just don't get it.  I guess if you like end to end shoot em up, blow em up, loud explosion ridiculous car chase scenes for 2 hours then this is the movie for you.  Exactly why were they chasing them?  Don't bother answering as I could care less.  If you must see this check your brains in at the door.  Avoid."
    },
    {
      "rating": "10",
      "text": "Near perfection in an action film has been achieved in this film. Better than The Road Warrior. The cinematography in the beginning is unique and stunning, the stunts are mind-boggling, and the characterization is PERFECTION. Plus the message, as subtle as it is, is breathtaking. This is a Best Picture candidate here, and if the Academy does not realize it, they are being smug elitists."
    },
    {
      "rating": "0",
      "text": "I'm not sure what movie all of these critics saw but it most definitely was not the movie I endured.  I found it to be boring, predictable, and horribly acted.  I would have left if not for the fact that I was at a dine-in theater and had to wait on my food.  One of the worst movies I have seen in a movie theater."
    },
    {
      "rating": "10",
      "text": "As a huge fan of the previous films and having high expectations for Fury Road, I must say I was NOT disappointed. It's amazing and simply the best action film I've ever seen. When it really gets going, it's more frantic and pulse pounding than any video game I've ever played.\rMovie of the year so far."
    },
    {
      "rating": "10",
      "text": "This is the action film the world NEEDS right now! I was lucky enough to see the premiere so I pray this does well at the box office and sends a message to Hollywood execs to up their game. My one and only gripe is the constant blaring of orchestral strings in each and every scene.\r Mad Max: Fury Road truly is an action masterpiece from genius George Miller."
    },
    {
      "rating": "10",
      "text": "Alright this movies trailers did not lie. This is action packed octane fueled testosterone powered madness. Many people complain of the lack of character development in this movie, (mainly those who haven't seen the originals) and that is true, but George Miller puts you in his crazy world and you just gotta accept it for what it is and enjoy the ride. 10/10"
    },
    {
      "rating": "3",
      "text": "Very disappointing. Did I watch a completely different film than everyone else, or is the general movie going public just easily entertained by wrecks and explosions? Having waited for a year to see it, I hated it. The framing, color grading, practical effects, and stunt work were all astonishing. But, the acting (except for Hoult), characters, story, camera, matte work, compositing, were terrible."
    },
    {
      "rating": "3",
      "text": "I was really disappointed in Mad Max. The budget is certainly apparent on screen, which is pretty to look at, but it felt wasted against a bland story with no plot.\r Where the first 2 Mad Max movies pull you in, Thunderdome and this one are not of the same Canon. I cant remember a single line that Max says, and to be honest, I don't get the hype for Theron. She never seemed that crazed, threatening, or powerful to me. Who are we really supposed to care for here?\r The movie certainly is not without its good attributes. It is colored and shot beautifully, but is so thin every where else, the stunts and practical effects are wasted.\r I wanted more Max, I wanted a follow up to that great scene at the end of \"Road Warrior\" where its just Max and the \"Road\".  This outing borders on cartoonish, and isn't brutal in any way. Where we are supposed to feel fear, and stress at the mass of pursuit vehicles, all i kept thinking was, \"Where do they get all the headlights?\", or \"for an apocalyptic wasteland, they seem to have no lack of tires or car parts\". It just didn't feel in anyway remotely believable.\r Many others have already said that it felt like a two-hour movie trailer. Save your money and just watch the trailer on repeat for an hour and you have it.\r Bummed."
    },
    {
      "rating": "10",
      "text": "Absolute MASTERCLASS.  The Cirque du Soleil of chaos... seeped in beautiful brutality and revved with engine noise.  Surprisingly though, it's the quiet moments, lush detail, and unparalleled creativity that leave the most distinguishable tracks in the sand.  The ride is loud without being abusive, violent without being gruesome, touching without being cheesy, and frenzied without ever losing it's fun-factor.  Hats off Mr. Miller!  You have set the bar for action films.   P.S. Charlize... Furiosa, with her grit and heart, managed to out 'bad-ass' both Ripley and Sarah Connor with only one arm and a single \"one-liner.\"  \"I REMEMBER YOU!\" :)"
    },
    {
      "rating": "10",
      "text": "Mad Max Fury Road is a movie that any action movie fan must go see. The bigger the screen the better theres so much to soak in. Story is great and  the actors killed it just a epically great movie!"
    },
    {
      "rating": "10",
      "text": "Cinematic game-changer here for all filmmakers and especially the entire action genre. Beautiful chaos. This is also one of the strongest feminist movies ever made. So many movies still to come out this year to look forward to, but I don't think any of them will impact cinematic history as much as this one."
    },
    {
      "rating": "10",
      "text": "'Mad Max: Fury Road' - Brilliantly executed by George Miller for a post apocalyptic genre in both story narrative and set-piece style. The War Rig, Furiosa(Charlize Theron) and Max(Tom Hardy) being the highlights for the octane 'Carmageddon' action. A big screen 3D viewing is recommended and a loo break at your own risk."
    },
    {
      "rating": "10",
      "text": "George Miller has created a new language for action movies. The movie delivers the best breath-taking scenes. There is art in each take. The movie speaks by itself -- it is one of the rarest cases in which there is no need to explain about the movie."
    },
    {
      "rating": "10",
      "text": "This movie literally had me on the edge of my seat the entire time! With the slower scenes feeling more like it was placed there for you to catch your breath and have your heartbeat return to normal.  Tom Hardy becomes even more bad-a$$ in his performance as Max.  Charlize Theron casually reminds the world how amazing she is with a flawless performance!\r Overall a must watch.  The movie is pretty much a 2 hour EPIC chase scene. Yeah there are a few moments of \"hmm I guess it's okay they didn't totally acknowledge why a certain character is so quick to accept a few things given their background\" but if they addressed every little thing then we would have a very different movie.  Go See Mad Max in theaters, you won't regret it!"
    },
    {
      "rating": "1",
      "text": "I saw this movie yesterday at the biggest cinema in Norway in 3D. I have to say the plot it ridiculous, and the characters are one dimensional. Who are these People? Why are they suffering? It makes no sense to me. The younger generatios have no recollection of the Movies made in 79 and the 80's I would presume, so based on this as a standalone Movie is maybe worse than if i were not. It got great reviews in Norway, I don't see it . Really dissapointed that this is a Movie made by the originally director....."
    },
    {
      "rating": "4",
      "text": "This movie is the poster child for style over substance. The costumes, sets, and character designs are gorgeous. The humor and spectacle of the film really stand out.\r Unfortunately, all of this style never amounts to anything more than a car chase. The characters look great, but we don't know much about them besides where they live and how they dress. Furiosa and Max are like blanks where I suppose the viewer is supposed to fill themselves in. You're meant to want to BE Furiosa or Max, not KNOW the characters.\r Underneath all of this caked on superficiality, there's a vague anti-authoritarian message that's drowned out by guitar-flamethrowers and revving engines. I was really interested to learn more about that and to see Max, Furiosa, and Nux do something besides fight, drive, and shoot."
    },
    {
      "rating": "10",
      "text": "I could say I'd never been in cinema before! This movie brings you a strong boner for the entire 2 hours! Never thought there's something that could impress me so much, you simple cannot miss it!"
    },
    {
      "rating": "10",
      "text": "I often rate movies 10 because they're really good, this is getting a 10 because it is AMAZING. I'd say its the best, most epic, car chase in the history of cinema.\r It has an interesting, unique, plot but the plot is really just there to drive the action and WOW what an action movie it is. Its one of the best I've ever seen, from start\r to end the pacing is spot on, it builds and builds to an epic climax, then gives you a minute to get your breath back and then off it goes again. Tom Hardy suits the\r character of Max brilliantly, he doesn't have a lot to say, but its not really that kind of movie with long exposition and dialogue, for the first part of the movie he has\r a clamp around his face so his mannerisms and actions say more than his words. Charlize Theron plays a really strong character as Furiosa and pulls it off perfectly, the\r two characters work really well together and some of the other characters are surprisingly good.\r It looks like a Max Max film should, the sets, costumes, special effects and stunts fit the Mad Max world perfectly and it all fits together to make it an absolute blast to\r watch. Dont miss this! I'll be going back to watch it a second time in a 4DX theater."
    },
    {
      "rating": "10",
      "text": "Marvelous, so far the best film I've watched this year & something tells me it'll remain that way, watched the 3D version & visuals are captivating from beginning to end. It's loud and cool like rock 'n roll."
    },
    {
      "rating": "10",
      "text": "Forget what you heard, this movie exceeded even my wildest expectations, and I was already ridiculously overhyped for it. From start to finish this movie had me incredulously saying to myself, \"This is the best movie ever made. No one will ever top this.\" From the cinematography, to the costume, stunt, and grip work, Mad Max delivers in ways I never expected it would.\r My life aspiration is now to be that dude rocking the guitar on the music car."
    },
    {
      "rating": "10",
      "text": "The long awaited 4th installment of Mad Max series does not disappoint, George miller and his team put great efforts on the screen to make a pure masterpiece of car chase movie and created a truly crazy world, a fabulous vision of post apocalyptic world that served 2 hours of non-stop action & excitement,\rwe have suffered from the regular action movies through the last few years. but this one finally comes with something that is really fresh & epic.\rVery fine acting, Tom hardy once again proves that he is one of the best actors of his generation and really did a badass & tough Max, Charlize Theron shined with Furiosa and put her soul to appreciate this heroine, remember this little kid from the movie \" about a boy \" who called Nicholas Hoult ! in Fury Road you will see him as you never seen him before when you watch his very insane portrayal of Nux. and that Toecutter who called Hugh Keays-Byrne surely will give you a boner with Immortan Joe because his performance was very terrifying but in a good way.\rThis movie owes a lot to his bloody incredible stunts, if the academy award made a new category for stunts even for once ! this movie should win it.\rthe soundtrack & the visuals are awesome and fit the crazy world of the wasteland.\ra highly recommended for everyone, especially the fans of the original Mad Max trilogy. I guarantee you won't waste your time\rBelieve the hype, this movie is not only the best one of this summer. honestly this the best action movie of the decade and establish his position as one of the best action movies ever made. putting his name alongside huge flicks like Terminator 2 & The Matrix.\rI don't always go a geek, but when I do ! I do it for one like this."
    },
    {
      "rating": "2",
      "text": "I saw as a screener (for free), without any real expectations, and having not looked into any early reviews. In the end I spent most of the movie making snide comments to my friends and laughing at how implausible and poorly thought out it was, wishing there was a plot. It did become so ridiculous it was fun once in a while, but mostly it was just pointless and weird. I proceeded to check the reviews online when I got home thinking \"this movie is going to get destroyed\" - but no, everyone LOVES it?!! After reading about the \"practical\" stunts etc. - sure I'm impressed, but I still think overall the movie is so stupid that I signed up for a metacritic account just to say so! I could generate a list of 100 ways this is ridiculous (like if bullets and gas were in limited supply, why is everyone shooting guns and flamethrowers into the sky?) I truly felt nothing for these characters and was quite glad when it ended (with the \"good guys\" just dumping all the water into the desert!). There are other reviews here that more accurately capture why this movie makes no sense (look for the red reviews) - I just wanted to express my confusion as to the widespread acclaim for this movie. I guess I just missed the point."
    },
    {
      "rating": "0",
      "text": "I have the gut feeling, some of the reviewers are overblowing the reviews, because they have an inner desire that all cinema will be like this.... a not sot veiled feminist propaganda piece (I mean come on, you can see a mile away that the message \"man bad, woman good and in comunion with nature\" is all over the place)\r Acting is non existant... if you want to see theron act, go see monster instead.\r Stunts were great... but if that is all there is to it... then you should go to a circus instead...."
    },
    {
      "rating": "4",
      "text": "What you get, if you mix very old franchise, simple action movie, rock music video, \"art\" movie, great effects, very simple feminist message, circus, and I don't even know what?\rFantastic movie according to most people, kind of crappy not function mess according to others.\r Why the artistic spin in the middle of the movie? We switch rock music, explosions and car races for symphonic music, monochromatic shots and \"deep\" life messages? That part broke the movie for me.\rThen we continue with more explosions and races, but now with circus performance like stunts? Where that come from and why it is in mad max?\rWhy is there this feminist narrative : evil old diseased white guys destroyed the world and with army of violent fanatic white guys enslaved people. luckily are brought down by few of virtuous women.\rso deep message, so progressive, so original...\rLets not skip plot holes and realism, it was supposed to be action movie.\r But seriously, what the duck?"
    },
    {
      "rating": "2",
      "text": "What a disappointing re-boot of a classic, low budget original.In fact, it disrespects the original. In the original Mad Max, the lead character was actually mad, angry. In this re-boot he isn't even the lead. Furiosa is , and she is the Alpha. Mad max is along for a ride in this uber feminist take on this idea of a post apocalyptic, gas obsessed world. But wait, you say, the idea behind this film is that strong women can stand up to tyranny and create a better world, one that doesn't even contain men. Ok, so why is the Utopian green place dry up, most of the women dead, and their solution is to  turned back to take over Joes' empire? Isn't this ending a slap in the face of feminism, as portrayed in this film? Women couldn't do it on their own so they took what a man created, but they are going to make it a better, gentler place? Don't get me started on the symbolism of the hot wives, in the desert, spraying themselves with the second most important liquid in this fantasy world, water , spilling it all over, drinking it , spitting it out. A symbolism for male seed and the value, or lack their of, that the modern feminist movement places on men? You decide. There are lots of little anti-male nuggets in this film.\r Come on! First, feminism, by its very definition is equal pay for equal work. period. It's NOT about male roles vs female roles ( or stereotypes ). Second, who says women are kinder and gentler in an post apocalyptic world? Lots of examples of women that get drunk on money and power in today's society, why are they held in a better light in Mad Max vs the men? This is all misguided feminism. I guess, since women are better at their core then men, they really don't fart or pop either. Stupid drivel."
    },
    {
      "rating": "3",
      "text": "The action in this movie was kick ass yes! But every single thing else sucked.. **** plot, **** acting (for the most part), disgraceful dialogue, some of the worst characters and absolutely zero character development is present..  The fact that the action in this movie is awesome is not even close to bringing it back to redemption. And calling one of the best movies of all time?  I know your biased but dude, dude...... Dude.... You cant be serious, no way can you be serious.. 3/10.. Take away all dialogue and characters and leave only the action and you got a solid 8 but jesus was it bad.."
    },
    {
      "rating": "0",
      "text": "If you have the mind of a 10 year old, and think a glorified 80s music video is a perfect movie, by all means, go watch this movie..... then you can go and watch a michael bay one after that."
    },
    {
      "rating": "3",
      "text": "The art of nothing or an ode to skin heads, would've been a more appropriate title rather than Mad Max. I don't think the audience got a good grasp on how Max was Mad. Maybe part 2 will further unravel his character. Aside from the skin heads and the demonic s***, I really enjoyed the 2 hour long action pack car chase movie. I love the cinematography and the too hot sex slaves, in addition to the Salvador Dali surrealism feel to it. But as a minority, I didn't know rather to be offended or entertained."
    },
    {
      "rating": "4",
      "text": "In spite of the spectacular and mesmerizing stunts and effects, in spite of an amazing Charlize Theron, my enjoyment was inhibited by other more internal feelings. First, it’s a dystopian world, squalor, misery, disease and oppression, I get it. However, these (and I use the word loosely) people, were so grotesque, so monstrous, so gruesome, so aberrant, they presented a world that I could not even root for the protagonists to survive in. It was such a world of dread and vulgar mutants my depression overwhelmed my ability to separate it out and simply enjoy the visuals.  Speaking of visuals, there were stunts like we’ve never seen before.  However, to achieve this never seen before quality, the stunts were totally preposterous. Every law of physics, gravity, logic, cause and effect, were breathtakingly violated. In this world seemingly comprised of only rabid dogs shaped into human form, who the hell refined the infinite amount of gasoline they used? Who were the mechanics and auto body experts that built and maintained all of the crap they used??? What did the multitude of thousands of depraved  thirst starved inhabitants do when they were not all gathered at the rock tower of water dispensation?  Farmers? Factory workers? Business owners? This world assaulted my logic to the degree that it pulled me out of the mindset the storyteller wanted me to lose myself in. Overall? Simply depressing."
    },
    {
      "rating": "3",
      "text": "I can't remember the last time I was so disappointed in a move. I expected to love this movie - I love the originals specifically (first two more than the third, obviously) and sci-fi and post apocalyptic movies generally. I don't demand more than the skimpiest of plots in them as long as I care about whether the people live or die as we go on their journey with them. And in this movie I really didn't care.\r In the original movies, I cared about Max and understood his pain. In 1, I knew why he was in the situation he was in and I knew why he did what he did, even while I wanted him to be better. In 2, I cared about the other people in the settlement and I wanted them to understand that Max was a good guy deep down and wanted them to accept him. I cared about Max's dog and what happened to him more than I cared about any human character at all in this new movie.\r Yes, the movie looked incredible, but all it did was take a bunch of undeniably incredible set pieces and then flap about looking for a plot to string them together. This was like a two hour trailer for a movie I felt I WOULD like to watch, because in the actual movie there would have been something to make me care one jot for the people in it. And I just didn't."
    }
  ]
}