{
  "id": 122,
  "title": "Naked Rashomon",
  "starring": [
    "Hitomi Kozue",
    "Moeko Ezawa"
  ],
  "runtime": 72,
  "genre": [
    "Drama",
    "Romance"
  ],
  "description": "Roman Porno from 1973.",
  "releaseYear": "1973",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/4HrdA8yAcZef8fw9qstzRz5NiLy.jpg",
  "categories": {
    "plot": 5.5,
    "acting": 10.0,
    "ending": 4.0,
    "soundtrack": 4.0,
    "cinematography": 10.0,
    "familyFriendly": 4.0,
    "funny": 4.0,
    "action": 4.0
  },
  "reviews": [
    {
      "rating": "5",
      "text": "Movie gets points for groundbreaking narrative,  stylish camerabatics, and strong performances.  But only gets a 5 overall from me because, no matter whose story you believe, all their motivations and personalities are all so wacky, it really made it hard to empathize with anyone."
    },
    {
      "rating": "10",
      "text": "The movie shows that right and wrong and truth is a matter of perspective. One of the best of all time."
    },
    {
      "rating": "10",
      "text": "While not my favourite Akira Kurasawa(for not only Japan's greatest director, but one of the finest directors there was) film, like Seven Samurai closely followed by Ran, Rashomon is still a fantastic film. No Kurasawa film is the same without great scenery and cinematography, and Rashomon is no disappointment in that regard. The camera is always moving but never feels like too much due to how subtly composed they (and the editing) are, and the scenery especially the beautifully lit jungle is just as striking, not as epic as Seven Samurai but still making its mark. The music, though I may prefer Ran's score when it comes to scores for Kurasawa's films, is always fitting with the mood and atmosphere of the film, and with its exploration of the relativity of truth the four accounts of the woodland encounter between a bandit and a wealthy couple is written in a compelling and completely credible manner. Kurasawa's direction as ever is superb, as are the performances of Machiko Kyo and Toshiru Mifune. Overall, a truly remarkable film. 10/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "A ghastly crime has occurred, but who knows what really happened? This is the common thread of one of the most outstanding films of Japanese cinema. From the beginning it is inevitable to closely follow the perspectives and then draw your own conclusions, with an unexpected ending."
    },
    {
      "rating": "6",
      "text": "THE GOOD: I found the conversations between the three travelers in the temple really profound and interesting. The other subplot is sustained by a great Toshiro Mifune. Ahead of its time on a technical level.THE BAD: I didn't really care about what happened in the woods. I hope it had more moral complexity. Simply disappointed, good but I thought it would be better."
    },
    {
      "rating": "2",
      "text": "Une enquête, un polar chez les samouraïs alors que passent trois individus dans la forêt : deux hommes et une femme… Un drame s’est produit et on aura de façon étonnamment originale chacun des points de vue de l’impromptu trio, puis celui d’un témoin, le troisième homme…C’est ce que nous raconte ce témoin en compagnie de deux autres gars qui nous relatent également ces « drôles » d’évènements alors qu’ils attendent, abrités, que la pluie diluvienne cesse. J’ai mis des guillemets à « drôle », car ce film est bien plus bizarre que drôle en raison des réactions de chacun des membres du trio dans la forêt : le mari, sa femme et le bandit…Leurs réactions sont en effet absurdes et illogiques et lorsqu’une réaction pourrait se justifier, deux autres lui succèdent, contraires, illogiques et absurdes comme dans un asile de fous qui tourne en boucle. Tout ça pour légitimer cette espèce de « fable » poussive sur l’égoïsme…Les acteurs en font des tonnes mais cela fait partie de la démonstration, ce qui n’en est pas moins fatigant : Mifune cabotine, la geisha est hystérique, le mari méprise, les conteurs font les gros yeux et s’interrogent. Rien à faire, on ne peut adhérer à tout cela même si on reconnaît les qualités de mise en scène mais aussi le ridicule des « duels » (pour mieux montrer la peur au combat, sans doute) qui tournent aux pantomimes désordonnés… A force de se fixer sur les intentions toujours aussi démonstratives, le film tombe donc régulièrement dans la caricature."
    },
    {
      "rating": "10",
      "text": "Absolutely striking film.This  is very important for cinema film.Kurosawa`s masterpiece.If you are true cinema fan,you have to check it asap!"
    },
    {
      "rating": "7",
      "text": "This film noir portrait of corruption and morally-compromised obsessions stars Welles as Hank Quinlan, a crooked police chief who frames a Mexican youth as part of an intricate criminal plot. Charlton Heston plays an honorable Mexican narcotics investigator who clashes with the bigoted Quinlan after probing into his dark past. A memorable"
    }
  ]
}