{
  "id": 120,
  "title": "No Country for Old Men",
  "starring": [
    "Josh Brolin",
    "Javier Bardem"
  ],
  "runtime": 122,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "Llewelyn Moss stumbles upon dead bodies, $2 million and a hoard of heroin in a Texas desert, but methodical killer Anton Chigurh comes looking for it, with local sheriff Ed Tom Bell hot on his trail. The roles of prey and predator blur as the violent pursuit of money and justice collide.",
  "releaseYear": "2007",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/bj1v6YKF8yHqA489VFfnQvOJpnc.jpg",
  "categories": {
    "plot": 8.980392156862745,
    "acting": 9.0,
    "ending": 7.896551724137931,
    "soundtrack": 8.0,
    "cinematography": 10.0,
    "familyFriendly": 6.555555555555555,
    "funny": 8.5,
    "action": 8.5
  },
  "reviews": [
    {
      "rating": "10",
      "text": "My favorite movie. A misunderstood masterpiece. As complex as it is simple. As vague as it is clear. I have seen it eight times and it never gets old."
    },
    {
      "rating": "8",
      "text": "brilliant masterpiece! The acting performed by Bardem is excellent. The touches of unexpected moments make it really entertaining. Might be a little dissapointing in the end for some."
    },
    {
      "rating": "10",
      "text": "No Country for Old Men was an amazing adaptation of the book by Cormac McCarthy. (I've actually read the book. That's why I can say that) The story was great, and the actors were extraordinary (mainly Javier Bardem)."
    },
    {
      "rating": "8",
      "text": "Gripping and tense throughout, I found myself engrossed in the plot. The only disappointment was the painfully realistic ending. I felt they should have made it more apparent that the Sheriff was the main protagonist, which would have made the ending less peculiar. I felt I had to do some research to fully understand the decisions made in terms of plot, as the story motifs are a bit lost in translation as a result of film adaptation. In terms of screenplay, it was a incredibly shot and acted film that I enjoyed a great deal."
    },
    {
      "rating": "10",
      "text": "Some reasons why this movie is great... that the haters just seem to utterly miss. a) Superb cinematography focused on a bleak southern landscape that easily reflects the movie's naturalistic theme b) Motifs such as different portrayals of money determining fate c) Pithy dialogue in which the Coens' derive cornpone wisdom out of people who have seen too much (love the scene with the two retired lawmen in the desert shack near the end) d) Tommy Lee Jones, all wrinkled and angst-ridden about the state of the world when he should be looking forward to retirement. e) lots more but you can read critics reviews to find out what those reasons are. I'm not prone to giving out 10s unless something deserves it. I've seen this three times and it's as perfect as movies come. Some of the haters here are just downright pretentious while others really are too dumb to get a great piece of film making like this."
    },
    {
      "rating": "8",
      "text": "Javier Bardem really makes this film, His performance is not only haunting but its amazing. His supporting cast is good as well. The film is interesting ,as is the plot, but I just cant put it up there with other top films. Its the performances that make this film and it shows through out."
    },
    {
      "rating": "7",
      "text": "Not a bad film, and since the film seems to be a faithful adaption of the novel then the actual ending couldn't change. It is a subtle ending which, to some that might have got gripped by the Chigurh Vs Moss scenes may have got lost on, the film's opening lines spoken by Sherriff Tom Bell are crucial, but I can reasonable imagine that after 2 and a half hours most viewers would be a pains to remember what was said! That aside the film was well made but not quite the perfect film that some here have held it up to be. There are a few plot holds and scenes which didn't make much sence and wouldn't really happen in reality although this could be a critism of the writer of the original novel. Spoilers: Why did Moss go back with water to the injured man in the truck? Assuming that he did manage to survive after Moss left him, water alone wouldn't save the man. When the Chigurh come calling on Moss, why did Moss, a man that goes hunting not take some sort of cover or different position rather than sit squarely oin the bed so that Chigurh wouldn't be able to get a clean shot off first? Woody Haroldson's character also seemed to be rather pointless. Moss's off screen demise was truely anticlimatic having followed the guy's trials for much of the movie. Was this decision to do Moss death offscreen just done in that manner just to be different and suprising... perhaps but it still was very anticlimatical all the same. In conclusion No Country For Old Men was good but could have been better."
    },
    {
      "rating": "7",
      "text": "The only movie I've seen that really lets the viewer know what living in Texas is like. No one speaks English, the best you will get out of an average person is something close to Pidgin, Woody's character on Cheers is smarter than the local sheriff, there are guns always going off, every old person you meet thinks a hispanic in a suit is strange and there is at least one Anton Chigurh in every county. Very realistic!"
    },
    {
      "rating": "6",
      "text": "Some interesting characters..... after that it is a story that has little point, and is one of the most overrated films of all time.\r What is it with film critics and their \"best movie I've seen this year,\"  both the top movies of 2007 I've seen kind of suck. Acadamy worthy acting, but light years from acanamy worthy movie."
    },
    {
      "rating": "8",
      "text": "The Coen Brothers get serious. With \"No Country for Old Men\", Joel and Ethan Coen answer critics' charges that they favor style over substance. The stylized(read: witty) dialogue is still there, but this time, the regional characters seem less like unwitting punchlines for urbanites to laugh at. When a deputy laughs, then checks himself, after the sheriff(Tommy Lee Jones) makes a pithy comment about a newspaper article, there's the unmistakable feel that the Coen Brothers are performing a mea culpa, an admission of self-awareness that they do sometimes treat rural folks a bit unfairly. Make no mistake: \"No Country for Old Men\" is not \"O Brother Where Art Thou\". Although Jones has occasional fits of long-windedness that stops the film cold in its tracks, \"No Country for Old Men\" is mostly engrossing, droll(not ha-ha funny) and bloody."
    },
    {
      "rating": "6",
      "text": "awesome middle, brimming with tension and brilliant acting. crap last half hour though and a real let down was when you don't even see llewelyn die. Really it's crap from there on out."
    },
    {
      "rating": "6",
      "text": "This seems to be a love it or hate it kind of movie. I experienced neither emotion. But I'm not sure that I understand what all the critical fuss is about. I like the Coen Bros. and their films. I love serious and artistic films. I even went to one of the best film schools in the country and studied film criticism. And yet this film left me cold. One thing that bothers me about many of the comments posted here by those who loved the film is the inference that you must be an idiot if don't like it, that you must only appreciate mindless action films if you don't love No Country for Old Men. As I stated above, I know a lot about film and appreciate films of all kind and I'm certainly not an idiot (for a career I publish and editor a well regarded independent music and entertainment magazine, if that means anything), and yet I can't get behind No Country for Old Men as one of the absolute best films of the year. The basic premise/plot (stolen drug money and the assassin on the trail of the money) has been done many times before. But obviously the Coen Bros. twist the conventions of the genre in somewhat interesting ways. I found the movie engaging for the first two-thirds or three-fourths, but then it lost me. The final ending itself did nothing for me what-so-ever. Based on the Oscar contenders that I've seen thus far this year, I'd much prefer that There Will Be Blood or Atonement win best picture, two films that affected me emotionally much more than No Country for Old Men did. From an intellectual perspective I could appreciate No Country for Old Men, although I still don't understand why so many critics and audience members seem to have such undying love for it, but I truly feel that both Atonement and There Will Be Blood are better made films in all facets. Still, you should definitely see this one for yourself and form your own opinion either way."
    },
    {
      "rating": "4",
      "text": "The first 90 minutes of this film had me on the edge of my seat. Then within 5 minutes and two scenes, everything that had been building up was ruined by an incredibly poor and ill constructed twist. After watching Broken Flowers, which also had no ending, i must say im becoming somewhat disillusioned by the film industry at this moment in time."
    },
    {
      "rating": "10",
      "text": "Flawless!"
    },
    {
      "rating": "10",
      "text": "I absolutely LOVE this movie, it has some of the greatest acting I've seen, they either make you love them, or hate them, theres no in between.  The intensity is so great, keeps you on the edge of your seat the entire time.  The ending is the only part that I don't like, there are so many questions and loose end that need to answered, it makes me so mad."
    },
    {
      "rating": "6",
      "text": "It's a well done movie, that's all. I don't understand why it's getting so many awards, there have been better movies this year (Eastern Promises, for example)."
    },
    {
      "rating": "10",
      "text": "This movie was awesome! And as a Texan, the use of language and personality really hit home. It was great!"
    },
    {
      "rating": "10",
      "text": "Best movie of the year, (so far). Well acted, and a great screenplay."
    },
    {
      "rating": "9",
      "text": "A truely unique movie. An effective thriller and much more besides. Visually a joy. Perfect casting for the three male leads. Has the stamp of the Coen Bros: gentle humor slipping underneath great drama (and great violence)."
    },
    {
      "rating": "7",
      "text": "A thrilling film most of the way through with an outstanding performance from Javier Bardem that disappoints with a finale which may have great meaning and suit the story but falls flat from a entertaining point of view. Don't let a disappointing albeit unique finale turn you off what is a great film."
    },
    {
      "rating": "10",
      "text": "Absolutely amazing film. This was probably the first movie that ever actually affected me in a big way. Perfect casting, amazing performance from Javier and a perfect use of pretty much no musical score whatsoever. It's a western, but not the type of western I had expected. So different from any other film I had ever seen before it, I really was blown away by the amazing direction. This is the type of movie I love. It isn't really moved along with action and suspense (though it has plenty of both), but by character interaction and dialogue. Potentially the best western of all time."
    },
    {
      "rating": "10",
      "text": "No Country for Old Men is an incredibly taut thrill ride. It starts off with Sheriff Ed Bell (Tommy Lee Jones) discussing to the audience the story about a 14 year old girl who was murdered by her teenage lover because of the fact that he had been in the state of killing someone for an enduring time. This really sets the mood for No Country for Old Men as Sheriff Bell quickly summarizes the evil that lies deep in our hearts, his voice is flat, calm, and delegate. This in turn he is able to grasp and pull in the audience to forebode what terror may lie ahead. Then we're able to witness a gruesome murder in the hands of Anton Chigurh, the antagonist. What's so strong about this whole opening act is that Bell analyzes the very true nature of mankind, and then we're able to witness it as a whole ourselves. This act is brilliant, truly brilliant. Jones delivers his small speech with such clarity and confidence that it all seems too real. The plot is mostly focused on the 3 main characters Sheriff Ed Tom Bell (Tommy Lee Jones), Llewelyn Moss (Josh Brolin), and Anton Chigurh (Javier Bardem). While hunting antelope in the Texan desert, Moss stumbles upon an unusual scene of a drug deal gone really wrong. There are a few scattered bodies everywhere and a dead dog. After finding at least a dozen kilos of drugs neatly placed in the back of a truck, Moss figures that the money is probably somewhere near. He makes his way from the site and finds a deceased man with a briefcase in his lap; the contents are 2 million dollars. Moss makes off with the money and leaves town. Chigurh, the most evil soul in films since Hannibal Lecter, tries to hunt down Moss at all costs to get the money back that he thinks is his own, Sheriff Bell is hot on the trail of both trying to hunt down Chigurh and trying to find Moss before Chigurh does. It sounds like a typical cat and mouse game but it really isn't. The Coen brothers formula works yet again and they are able to deliver a true one of a kind gem. The three main actors are simply flawless and amazing, Chigurh being the best villain since Hannibal Lecter, as said above. Jones is his normal self taking on a character that is broken and flawed and Brolin is simply dazzling. All three characters are intelligent, each depicting a different personality that exhibits each of their downfall later near the climax of the story. That saying, Chigurh is unbelievably evil, unbelievably obsessed with his prey, unbelievably haunting, and unbelievably funny. Never have I seen a character as creepy as Bardem's Chigurh that I have cringed and laughed at the same time, he is truly perfect. The many different shootouts that occur in the film either between Brolin and Bardem, or other characters alike, are mesmerizing at times. The quiet shots of the alleyway shootout between the two is astounding because the quietness leaves so much suspense that you're literally on the edge of your seat waiting for the next shot to be fired. That famous Coen dialogue is in here as well. There are key moments where it really comes to light, especially the gas station scene with Chigurh and the clerk he tries to play the fate of life with. The interactions between each character is flawless, they all display emotions, react to those emotions, and ultimately deliver a brilliant scene. What I think is the strongest part of the film, though, is about the last half hour. In that timespan we're able to see these 3 characters for who they really are and what their ultimate goal really is, though the predicaments they face make them fail ultimately and none of the trio really find and take what they were going for the entire time, and almost all three make away with something else entirely. What's great about that whole scene is that it leaves you to wonder after viewing how these characters fail. Could they have succeeded? Could they have crossed a fatal path with each other? Who knows, and this is what makes it all worth while and it makes you think long after. After many viewings its easy to spot the discrepancy of the characters and what makes them who they really are and you could easily spot the solutions that they could have accomplished in order to have succeeded in their quests. The ending is debatable of course but what's so achieving about it is that it ends abruptly, so abruptly like a smack to the face. It leaves you to wonder why it does that, why it ends on such a low depressing note that leaves you in darkness, and why it leaves you to decide wholefully. No Country for Old Men is a marvel to films, a simple masterpiece that pushes itself far beyond the other boundaries that other films have tried to accomplish. It's underrated in some aspects of course, mostly because of the ending but all in all it is a truly miraculous film that's simply flawless and simply astounding. It's a twisted story with beautiful moments that delves deep into the dark roots of human nature."
    },
    {
      "rating": "8",
      "text": "No Country for Old Men is an example of how a chase movie should be done. When I first saw this film I thought that it was distinctly average, yet upon re-watching it I found it much more enjoyable. The film is gripping and tense, with all the performances being fantastic, particularly Javier Bardem whose performance is nothing short of chilling. Indeed, Bardem is involved in all of the films best scenes and helps massively to elevate the film above the average. The only major flaw with this movie is that the ending speech given by Tommy Lee Jones is immensely hard to understand, and after seeing the film twice I still don't get it. Nevertheless, No Country for Old Men is a great film and definitely well worth watching."
    },
    {
      "rating": "8",
      "text": "Llewelyn Moss stumbles upon the remains of a drug deal gone bad in the Texas desert including a case containing two million dollars. He decides the keep the money for himself but soon finds he has a dangerous man on his trail.\r Part crime drama, part western No Country for Old Men is undoubtedly the Coen brothers best movie since Fargo. Telling a cracking story and featuring a number of truly memorable performances this is one movie that truly deserves the critical acclaim it has received."
    },
    {
      "rating": "10",
      "text": "Cormac McCarthy's national bestseller help the coen brothers make their first and finest adaption. No Country For Old Men, the bloodiest hell ride that shows the horror of the notorious psychopath kilter, named Anton Chigurh. This madman soon chases this guy named llewelyn Moss, a Vietnam veteran who finds a truckload of mexican brown dope and a case filled with ten million dollars in cash, with dead bodies laying around him. So llewellyn tries to keep the ten million so his wife can have all that she needs, then thats when chigurh comes in. The man in back of the situation is Ed Tom Bell, an old sheriff thats new to these kind of crimes (hence the title of movie), with 1980s mexican border problems, much more murders happen.These three men are never really filmed together throughout the movie, even though its a chase movie, but it shows how the creative mind of the coens put a unique their in there movie, which makes it not very visible to you. I've also heard that it stayed true to the book, and has set a great visual to it as well. The originality of this film definitely makes it a much watch, and its the bloodiest from the coens I've seen yet. Javier Bardem shows his skills in new type of work, being Chigurh. His creepy looks (mostly the haircut) shows that the character is insane, has no sense of humor, and no sense of compassion or regret. His weapons are as unique as him, being some strange air tank that shoots through locks, and this shotgon with a gigantic silencer, which probably makes most of the gore in the movie. Nobody can play a better role as Llewelyn than Josh Brolin. growing up as a country man made this role easy for him, just acting like himself will be perfect acting. Tommy Lee Jones plays sheriff Ed Tom Bell, which Jones also said that the character he was playing was a lot like him as well as Brolin, like some of the parts was just like a natural conversation to him. No Country For Old Men has inspired me in so many levels. A movie this original, could be one of the best. This movie is one of the best of the decade, very close to \"There Will Be Blood\", and thats one good compliment."
    },
    {
      "rating": "10",
      "text": "The best movie I have seen in years.  The story was compelling and the acting was incredible.  The story and plot is not that predictable like other Hollywood movies -- so I was entirely hooked while watching it.  Very well done!"
    },
    {
      "rating": "10",
      "text": "Powerful, stunning, horrific, it must be another Coen movie!\rThe Coen brothers pull the concept of this film off so well that it was more intense to see Tommy Lee Jones anxiety when approaching a crime scene than actually seeing any of said occurrence actually happen.\r Another notable scene within the film is when Anton Chigurh (Javier Bardem)walks into a gas station and responds to the shop"
    },
    {
      "rating": "10",
      "text": "No Country for Old Men is the best Coen Brothers movie since Fargo.  The highlight of the movie is the amazing cast, particularly Javier Bardem as the ruthless killer Anton Chigurh.  His haircut alone will give you nightmares.  Then there is the always great Tommy Lee Jones, Josh Brolin, Woody Harrelson, and Kelly McDonald.  But this is more than just a showcase of great acting, it is a technical masterpiece with amazing sound effects and film editing that really maximizes intensity and suspense.  The story is one that has been told a thousand times before, but it's never been told quite like this.  It doesn't follow the typical mold of a get away film.  The good guys don't always win, and the bad guy doesn't always find justice.  Furthermore, No Country has one of the best film endings of all time, even if others often claim it is anticlimactic or whatever it is they accuse it of being.  I won't spoil the ending, but it fits perfectly and it has an allegorical meaning that really ties the whole movie together."
    },
    {
      "rating": "7",
      "text": "A strange ending, but it keeps you hooked throughout the movie. Great acting, definitely worth seeing."
    },
    {
      "rating": "10",
      "text": "First off, this is a 10 out of 10. It's an amazing masterpiece. Acting is amazing. Everyone gives Oscar worthy performances. There's not that much music but that adds to the intensity, and when there is, it's great. The story is phenomical. Its so intense and you just want to stay around to see what'll happen next. Overall, this is a masterpiece. No country for old men is a great thriller, great western, and a even better movie. This is highly recommended for anyone wanting to watch a good movie."
    },
    {
      "rating": "10",
      "text": "Absolutely outstanding! The acting is spot on in all parts. It's magnificently written and manages to shock you and keep you on the edge of your seat the entire time. At the same time the writing manages to show many different walks of life in a heavily realistic fashion. The writing also amazing show cases the character progression of the villain, played by Javier Bardem and his performance solidifies his character as possibly one of the most memorable movie characters of all time. This film is a must watch plain and simple."
    },
    {
      "rating": "8",
      "text": "the film has an original story. brilliant film. javier bardem's performance is perfect, I was scared from Javier on this film, this is very important for this film's reality."
    },
    {
      "rating": "8",
      "text": "Bardem seizes the attention grabbing opportunity like no one.No Country For Old MenCoen Brothers' magic is actually, literally a magic act in here. In every sense, this gritty mirroring drama of the western genre set in the 80s is purposefully and profoundly unfathomable. To be fair, most of the time it seems unfathomable, is because you are not revealed to what has happened or happening in that crime scene. And that's your exhibit A. This shocking therapy may not be advised but is evidently one of it's best element, where Coen Brothers are also using the game of thought provoking assumptions along with flabbergasting treats.Exhibit B. The physical sequences. The awe inspiring aspect of the film is not only a challenge for the writer but also the director. Since not only it has to be an engaging but also crisp clean when it maps and runs on that track. There is very little the film expresses verbally and when it does, the monologues are usually whispering the gist of the action or describing the terror or emotional state of these characters. Now, in order to use these actions creatively and deeply resonating they have to use props, behavior and even the actions as an evolving arc.And in order to do so effectively and effortlessly- unlike these thoughts of mine about the film that are annoyingly filled with adjectives- they are using these elements with different perspective which leads to our final exhibit C. The props. Juggling with these three key elements and unearthly- or probably the most earthly- mortality wins, Coen Brothers marks their maturity on filmmaking and storytelling skills, especially in contrast to The Fargo who has more levity in its language then this thrilling horror. No Country For Old Men concerns for a common man tangled in an uncalled war, surviving, breathing and dreaming."
    },
    {
      "rating": "10",
      "text": "The crowning achievement of Coen Brothers. The slow pacing and the angst that is delivered through multiple scenes keeps you on your toes for the entire duration of the movie. Simply breathtaking."
    },
    {
      "rating": "9",
      "text": "The story works at a few levels and some folks were only looking at the basic plot and hence disliked the compressed narrative near the end. Some stories concern themselves with more than just the relating of plot. This movie is one of the more complicated movies. If you're looking for shooting action with a bad guy and a hero, you'll be disappointed and give this movie a low score."
    },
    {
      "rating": "10",
      "text": "Unsatisfactory resolution? Unclear plot and character motivations? Only if you are incapable of thinking for yourself. This is not a movie that everyone will like (obviously) but it is a fantastic movie for those who are willing to think about what they've just seen. One of the strongest points of this film is the sound/music editing, notably the strong role of silence in sound//music editing in the film. In the absence of the usual barrage of sound, every click, scuff, and shuffle take on an unrivaled immediacy."
    },
    {
      "rating": "8",
      "text": "Hunter/cowboy bloke stumbles across a load of cash after a drug deal shootout in the middle of the Texas desert. Javier Bardem comes after him.Very well acted & shot & the scenes with Bardem are fantastic. The \"Where does he work?\" & Gas Station scenes are just superb.The only problem was the last half hour which went a bit up it's own arse."
    },
    {
      "rating": "9",
      "text": "The Coen Brothers did it again; \"No Country for Old Men\" proceeds its way to the oscars as a quiet, deep movie that strikes the core of tension, a true masterpiece."
    },
    {
      "rating": "10",
      "text": "My personal pick for best film of the 2000's. The Coen brothers made their finest film here (yes that includes \"Fargo\") by perfectly adapting McArthy's novel into a Southern lament about fate and circumstance. I love the way the characters grow closer and closer and their stories twist tighter and tighter but never get to see each other. I love the way the Coens lead the audience deeper and deeper into an abyss of nightmares and darkness, forcing us to watch as Llewellyn is slowly but surely found and killed. I love the performances, not giving too much away, but letting its classical philosophies float throughout the air and recur multiple times before the end of the film in its beautiful poetic dialogue that is individualized so perfectly that we could never imagine another character trying to speak their words. I love the ambiguous ending, showing that the film is more about philosophy rather than \"who lived, who didn't\", and forcing modern audiences to realize that sometimes it's simply better to just not kno. I love this movie."
    },
    {
      "rating": "10",
      "text": "A stunning piece of cinema, personally, I think it's one of the best movies of the decade. The superb acting, to the minimalist, yet deep narrative that forced you to watch it mindfully and last but not least the immense amount of symbolism and deeper meaning elevate it to heights I thought unreachable for today's mainstream cinema. The ending was superb, it got my mind racing, even if most questions were answered more or less. The final 20 minutes were far from boring either, the insights into Chigurh's fatalistic mindset, establishing his role as a quasi-angel-of-vengeance as well as the role of greed in the movie thrilled me. Highly recommended, even if I can't guarantee you'll like it - but that's how it is with art, it is discourse put into form. Where entertainment tries to please the masses, art seeks to challenge the mind."
    },
    {
      "rating": "0",
      "text": "Horrid movie. What you have is a psychopath running amok, killing 3 random people before he even eats his breakfast. Meanwhile, out of all the law enforcement in the U.S., it seems that only one chronically depressed sheriff even cares to try to track the guy down... but apparently he isn't smart enough to look for fingerprints on that glass of milk. Somehow the critics were fooled by the various displays of technical expertise into thinking this was a good movie. In reality, all these shining little aspects can't save the movie from its own dismal plot."
    },
    {
      "rating": "10",
      "text": "When it comes to great moving films that hook you up from the beginning to end, The Coen Brothers have it all. No Country For Old Men is so good you will clap at the climax, you will remember this movie for the rest of your life."
    },
    {
      "rating": "10",
      "text": "Reading the reviews, there seems to be a clear divide between those who require their movie experience to be one where they can turn off their brains, go on autopilot and be spoonfed a neat little predictable package, and those who are bored by this approach and instead appreciate something with more depth and theme. The poor reviews, almost without exception, complain about gratuitous violence, the early demise of the protagonist and especially the ending, which they perceive as a non-ending. In my opinion, the ending was perfect and brought home the whole point of the movie. Any other \"neat\" ending that some folks seem to crave would have made this a completely different kind of movie - a movie of cheap, gratuitous violence - and I'm sure they would have loved it. Basically, if you need everything spelled out for you in obvious, simplistic terms - you will hate this movie. Most everyone else will love it."
    },
    {
      "rating": "10",
      "text": "No Country For Old Men follows an antelope hunter, a man named Llewlyn Moss, who stumbles on a drug deal gone bad and takes a satchel stuffed full of money (Around two million dollars overall.) and from there on is relentlessly hunted down by Mexican criminals and a ruthless assassin named Anton Chigurh. Now, this might sound almost like a thin story, but it is pulled off perfectly. The film takes place just after the Vietnam War in Texas. The movie has some amazing moments- you'll be on the edge of your seat as Anton chases Moss through the empty night streets of a Texan city, firing at the hunter with a silenced shotgun. But the movie isn't all guns and action, though those scenes are pulled off effortlessly. There are many meaningful characters, like Sheriff Bell, who is struggling to piece together the mass murders erupting on his streets. Really, I found my favorite character to be Anton Chigurh, the psychotic, incredibly intelligent character. Javier Bardem is so good at his role, it is simply shocking to see him in action. And the ending isn't a happy-crappy one where Moss becomes the big hero at the end and takes down his assassins; instead it is cold and almost slightly depressing. If you like action movies, a flick with a good story, or, hell, if you like movies in general, this is for you."
    },
    {
      "rating": "5",
      "text": "The ending sucked, because there wasn't one. The whole movie is a set-up for a non-existent ending. It's like driving two hours to go to a theme park only to find a big hole in the ground. If that sounds like your kind of thing then I strongly suggest seeing this movie."
    },
    {
      "rating": "3",
      "text": "Unsatisfying ending."
    },
    {
      "rating": "3",
      "text": "Good performances, interesting enough characters with a nice tone of its own. I was really enjoying it, feeling the tension build and build and then whoosh the cohens whip the rug out from under you and as you sit there lying on your back going \"Hey what the hell happened?\" the two brothers pull down their pants and take a nice big steaming dump on your face. While shouting \"Ha Ha fuck you consumer, fuck you. You want closure? You want an ending that is in some way satisfying to the viewer? You want to at least have a final denouement between one of the protagonists and the psycho? Fuck you moron eat our filth!!\" That's how I felt anyway. A film that could have been great totally destroyed by the most horrendous \"bait and switch\" I've ever had the misfortune to see. In a word \"Disgusting\"."
    },
    {
      "rating": "0",
      "text": "Good movie, but the ranking needs to go down because of the ending, no way it should be 8.0 more like 5 or 6."
    },
    {
      "rating": "3",
      "text": "The end of the movie was honestly the most awkward experience I have ever had at the movies. People of all ages and levels of maturity were left dumbfounded. We all sat there looking at the screen waiting for the film to resume, but it never did. This movie is getting great reviews and I in no doubt assume it to be a bad story. I do in fact claim that this film is a terrible representation of that story. It left me bored and lost, when it should have left me in a spot where I am not having to try to understand what the hell the point is. For the majority of movie goers I would recommend seeing a film that presents itself to the audience, unless of course they are just looking for a cool gun."
    },
    {
      "rating": "3",
      "text": "Intriguing but not a movie I would say was enjoyable. The acting was incredibly good but the ending left me with no closure which I so desperately was looking for in a movie that was convoluted in many ways. Too many unanswered questions for me and I would not recommend this movie and do not understand all the hype it has received."
    }
  ]
}