{
  "id": 107,
  "title": "Ran",
  "starring": [],
  "runtime": 20,
  "genre": [],
  "description": "The movie follows Ran's journey, whose main desire is to fulfill his potential. He is ready to deal with difficult experiences of not being accepted by his family and friends, physical and emotional changes, and even dangers to his health, but he is not willing to give up on himself and his happiness.",
  "releaseYear": "2018",
  "mpaaRating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/FepaiApo8Yr6pNIZIeYG5kW06J.jpg",
  "categories": {
    "plot": 10.0,
    "acting": 10.0,
    "ending": 10.0,
    "soundtrack": 10.0,
    "cinematography": 10.0,
    "familyFriendly": 10.0,
    "funny": 4.0,
    "action": 10.0
  },
  "reviews": [
    {
      "rating": "10",
      "text": "Ran is a masterpiece. Personally, I do not give out perfect ratings often. Every few months, maybe more, a film comes along that stuns me so thoroughly that a rating that is not a perfect score feels like heresy. Ran is that kind of film. From the story to the score to the cinematography to the colors, the film is a lyrical and poetic masterpiece from director Akira Kurosawa. Based on King Lear, Ran depicts the transfer of power from an old Lord to his eldest son, only for him to be subjected to watching his three sons destroy all that he built. A film about chaos of the mind and the world, Ran develops themes of family, respect, honor, nihilism, and postmodernism. An epic of profound scope, delicately brought to life by Kurosawa, Ran  is a film that immediately becomes one of my personal favorites.Depicting the fall of the House of Ichimonji (fake), Ran is an exercise in trusting and respecting those that you what is on their mind, rather than lie to your face but cover it in complimentary words. In this way, Great Lord Hidetora (Tatsuya Nakadai) is doomed to watch his lands fall to ruin after opting to trust those that to lie to him, if only because they bowed before him when they did it. Though the sons will be blamed for fracturing the family, in many ways, Hidetora fractured the family and the family was always doomed to fail. As he had three sons, the power struggle would have continued no matter when Hidetora died. In many ways, this could be described as Ran's way of showing that our actions do not mean anything (nihilism) and everything is pre-determined for us (free-will or lack thereof). This is even mentioned by one character who says to not blame the gods for what occurs because everything has already been determined. Thus, it can certainly be concluded that the Ichimonji were doomed from the start to fracture. However, by trusting his unfaithful sons over his most faithful son because he spoke his mind, Hidetora merely sped up the demise.Additionally, Ran is an exercise in violence begetting violence. Towards the end, when Hidetora's life is one again struck with tragedy at the hands of his son's violence towards one another, he asks \"Is there no justice?\" Though his pain is authentic and he is incredibly sympathetic, Hidetora losing his sons to war is justice in its purest form. Throughout the film, we see castles of lords killed by Hidetora. We are introduced to daughters that were witnesses to Hidetora slaughtering their families, only to then be married off to one of Hidetora's sons. For Hidetora to suffer as he made others suffer - by watching his family be destroyed - is justice and demonstrates that you \"reap what you sow\" and \"violence begets violence\".Ran also heavily discusses chaos. In fact, its title translates to \"chaos\". Yet, the chaos in the film is two-fold: of the mind and of the world. As he family falls apart, Hidetora goes mad. His mind is very literally chaos. Though he has moments of lucidity, his insanity destroys his mind and memory, causing him to forget what his sons look like and forgetting who a faithful servant was. All of these moments are painful to see, in particular with the servant. Faithful from the beginning, Kyoami (Shinnosuke Ikehata) is distraught to see his master forget who he is and the audience certainly feels his pain. The madness of Hidetora, however, is matched by the now war torn region he is surrounded by. With bloodshed, plots for power, and intrafamily conflicts, there is very little chaos and the film reflects this with long, drawn out battle sequences highlighting every element of brutality. Though chaos appears to happen quickly from the outside, it actually comes from very precise and small steps and Ran goes to great lengths to show the slow descent into chaos experienced by the House of Ichimonji. From plotting wives to power hungry siblings, the collapse is hardly a gradual one.As with many Japanese films, Ran also delves into themes of family, respect, and loyalty. In particular, respect and loyalty are a large element of the film. With long scenes of men showcasing their loyalty by bowing or following their master into battle, Ran develops a constant theme of loyalty. Though some loyal men die, their loyalty is always celebrated, in particular when they do not stay quiet and instead speak their minds. Even if rebuked, they are proven to be right in the end and their original objections were proven to be justified. Had their warnings been headed, the collapse of the Ichimonj would not have happened. As such, Ran could be called a celebration of contrarians. Though they are unpopular figures, the words they speak come from the heart and should be heard clearly, in order to avoid making a fatal error."
    },
    {
      "rating": "10",
      "text": "Akira Kurosawa's final epic, Ran, takes on William Shakespeare's King Lear. To me, from head to toe, this Kurosawa's picture which symbolizes downfall is absolute stunning  such gorgeousness in a film is utterly rare, and of course, it is one of the Kurosawa's many best films. Ran is a success  having nominated for Academy Awards for best art direction, best cinematography, best costume design and best direction and won one. Ran was also nominated for a Golden Globe for Best Foreign Language Film.\r I repeat this  Ran, from head to toe, is absolutely stunning, and of course this movie is perfect. The film's cinematography, which is top notch, is a killer. The way Kurosawa captured the images of burning castle, a moving horses, dead soldiers, battle scenes are all undeniably respectable, and sublime too, and one great example would be the scenes where the attack of the third castle was occurring. Very much in evidence that Kurosawa's talent in film-making is transcending. The film's script which was being written by Kurosawa himself, Hideo Oguni and Masato Ide is yet admirable. The exploitation on poetic lines are proved to be effective and fitting for the movie.\r One would see great performances in Ran. Good acting by the players, but to me, the two actors who stood up above the rest are Tatsuya Nakadai and Mieko Harada. Tatsuya Nakadai plays the great lord Tatsuya Nakadai. The great lord is old, fragile and somewhat defenseless and the character is well characterized by him. Mieko Harada plays a female villain Lady Kaede, whose character is hungry for revenge. Her amazing performance which is raw and gripping, plays a very important part for the success of the movie.\r Surely there are several movie elements which are worthy to be carried out for discussions, but to me, the main highlight of Ran is its cinematography, and it is one hell of a show.\r [10/10]\r Facebook (http://facebook.com/alex.desmall) Twitter (@Alex_DeSmall) (http://www.rottentomatoes.com/member/AlexDesmall)"
    },
    {
      "rating": "10",
      "text": "I loved Kurasawa's Throne of Blood, and heard this was even better. And indeed it was, for me second only to Seven Samurai as his best film and one of the finest movies ever made. As with any Kurasawa film, it is superbly made with the camera work in look and technique masterly and the colour and period detail really sumptuous. The battle sequences are even more epic in scope and emotional impact than Seven Samurai, aided by the spectacle and camera work. The music is rousing and haunting, almost sometimes paying homage to Mahler, the script is literate and thoughtful and the story intensely moving. Add to that Kurasawa's ever immaculate direction and the truly remarkable lead performance Tatsuya Nakadai and you have an even more brilliant film. Rounding off is the truly Machiavellian performance of Mieko Harada as the daughter-in-law figure. The over-two-and-a-half-hour length and slow pacing didn't hinder Ran in the slightest, at least to me anyway, though some not used to Kurasawa's style may be deterred. In conclusion, there wasn't much I really could add to the wonderful reviews already, but I do think Ran is a superb film with much to admire. 10/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "What makes Ran any different? Is it from how you see it? If it is, you probably have to step up your game (or movie as I say) because Ran is an amazing movie worth seeing twice."
    },
    {
      "rating": "9",
      "text": "Easily in the top dozen most visually beautiful films ever made. Nearly every frame of this 2 hour 42 minute epic is art museum/film school material. Pacing was excellent; never feet long or boring. Stellar cast is the icing on the visual cake."
    },
    {
      "rating": "10",
      "text": "One of my favourite Kurosawa`s films.There is everything deserves to be praised."
    },
    {
      "rating": "10",
      "text": "nice movie with great atmosphere, that gives you nice emotions, certainly recommend to add the film to your watching list"
    },
    {
      "rating": "10",
      "text": "Akira Kurosawa was a visionary his work was the best a japanese director has ever put out. Yes this is based on King Lear and is a genius copy as well. The sequences of violence show the different customs that japan had and also the conflict between the sons and the father was shown amazingly. The fact is you will never find a better japanese film besides Ran and Seven Samurai in your life and if you do you better post a review because I would like to know."
    },
    {
      "rating": "0",
      "text": "Une espèce de guerre de succession au sein de la famille du vieux Seigneur qui aimerait prendre une retraite bien méritée… mais comme ses fils sont soit des crétins, soit des assoiffés de pouvoir, tout cela ne va certainement pas bien se passer…Et il est vrai que ça ne se passe pas bien… je fais surtout référence au visionnage de ce film long comme un jour sans pain... C’est toujours l’impression de voir une pièce de théâtre en plein air qui prédomine et de fait, la somnolence qui l’accompagne… et l’ennui à couper au couteau. Ou au sabre plutôt !La réalisation est endormie et monlithique, lente et pataude, engoncée et psycho-rigide ; une mise en scène comme on n’en fait plus, sauf dans les années 40 et 50 du XXème siècle. Et encore. Ce qui pour un film de 1985 (quand même) s’avère dommageable et aggrave la pénibilité du visionnage.Les comédiens sont également monolithiques, psycho-rigides et grotesques à la fois, caricaturaux et excessifs comme dans une pièce de théâtre surjouée, caricaturale, grotesque et ridicule.Mais d’ailleurs… il semble que ce gros film de merde soit lui-même inspiré d’une vieille saloperie de pièce de William Jexpire (mort d’ennui à ses propres conneries lymphatiques), ceci expliquant cela, notamment l’emmerdement maximal prodigué ici ! Mais il suffit de s’étendre inutilement sur cettte grosse daube : il faut l’effacer, l’évacuer, la faire disparâitre promptement et efficacement ; pour ce faire, il suffit de tirer la chasse bien à fond !"
    },
    {
      "rating": "10",
      "text": "An absolute cinematic masterpiece and by far my favorite movie by great visionary Kurosawa."
    },
    {
      "rating": "10",
      "text": "A masterpiece for the ages, Akira Kurosawa's visionary feat inspired by William Shakespeare's play \"King Lear,\" is an exercise in cinematic achievement. Ran's provocative use of color, to its deft handling of its often shrewd, manipulative characters, is virtually unparalleled in cinema. As film critic Roger Ebert pointed out, one feels as if they are \"gods\" observing the action unfold as they view Ran. Kurosawa's lack of closeups, gives the viewer a distance to these characters, who very rarely deserve the audiences' sympathy. Having passed away in 1998, Kurosawa has left behind a legendary filmography, Ran being just one of his many films of supreme artistic quality."
    },
    {
      "rating": "10",
      "text": "This film takes the shakespeare play and adapts it to make a big epic film while still being trajic and emotional too. Everything in this film (production-wise) looks amazing, from the buildings to the costumes to the furntiture, you can tell that the people behind this spent there money wisely and with intent. The acting is also incredible showing the emotions each character in feeling with full intense detail, especially Lord Ichimonji. This film is a truly wonderful watch showing an amazing blend of beautiful imagery, intense emotion, story, and writing. I definitely suggest watching it."
    },
    {
      "rating": "10",
      "text": "My Akira's Kurosawa's favourite film, in my opinion the most epic film of the director. Its a perfect masterpiece. The plot, the caracthers, the photography, costume, the soundtrack everything of this film its incredible. Korusawa has been the greatest japanese film director ever been and one of the greatest over old the wolrd and the history of cinema."
    },
    {
      "rating": "10",
      "text": "Reaping the WhirlwindAkira Kurosawa’s “Ran”“Vanity of vanities, says the Preacher, vanity of vanities! All is vanity.”“For they sow the wind, and they shall reap the whirlwind.”“But if you will not do so, behold, you have sinned against the Lord, and be sure your sin will find you out.”What a difference 33 years makes(Duh!) When I first saw this movie in 1985 I just knew if was a great movie. I was totally captivated by the Attack on the Third Castle(which I still am) but it has now become obvious to me how all truly great works of art are hopelessly(hopefully?) entangled with the Biblical worldview(even if the director doesn’t embrace that view.) Although you would expect Kurosawa to be a Buddhist he seems to acknowledge that the Eightfold Path does not succeed in conquering suffering. Indeed, the son who returns at the end does “not” cure the chaos(oh how Kurosawa could have used the conquering Messiah of the Christian faith here!) Tsurumaru’s drop of the Amira Buddha image near the end also seems to indicate a lack of faith in the Buddhist way.But the other Christian themes reflected in the quotes above are beautifully explored here.Mise en scène Score(20/20) Kurosawa is a master here. The scene in which Hidetora exits the Second Castle is gorgeous. As is the overhead shot in the ruins with Hidetora and Kyoami. Although the Attack on the Third Castle is not static there are many powerful images here as well. The final shot of Tsurumaru matches the bleakness of the final shot in Vertigo, and repeats the theme of a fall from great height(The Garden of Eden?)The Attack on the Third Castle(30/30) If this isn’t the greatest sequence in movie history it is surely the greatest sequence without dialogue. How can such carnage be so captivatingly presented? This type of “operatic” violence is what Peckinpah presents at the end of “Wild Bunch” but raised to a higher degree.Proverbs 22:6 Score(30/30) The inverse holds true as well. Even though Saburo escapes this tendency(by the grace of God?) he can’t save the day in the end.Revenge vs. Forgiveness/Loyalty Score(10/10) The sins of Hidetora, Taro and Jiro come full circle as Lady Kaede takes her revenge. But Lady Sué’s way of forgiveness, and the loyalty of Tango and Kyoami, stand out as the way forward.Acting Score(4/5) Hidetora’s death seemed overacted to me.Worldview Score(4/5) Perfect presentation of our hopeless state without God. What Kurosawa needs is the nun from Vertigo to offer hope.98/100"
    },
    {
      "rating": "9",
      "text": "This the most mature, most beautiful and heartfelt war movie I have ever seen.Ran is a masterful adaption of King Lear by Akira Kurosawa."
    },
    {
      "rating": "9",
      "text": "This film noir portrait of corruption and morally-compromised obsessions stars Welles as Hank Quinlan, a crooked police chief who frames a Mexican youth as part of an intricate criminal plot. Charlton Heston plays an honorable Mexican narcotics investigator who clashes with the bigoted Quinlan after probing into his dark past. A memorable"
    },
    {
      "rating": "9",
      "text": "Il maestro Kurosawa racconta Re Lear in stile Giappone feudale.Questo film rappresenta una tragica metafora dell'avidità umana e di come questo porta ad una tragica guerra che condanna tutto ciò che si è costruito negli anni.L'impatto visivo è spettacolare e non fa che catturarti in quello schermo e ammirarne la bellezza."
    }
  ]
}