{
  "id": 16,
  "title": "The Silence of the Lambs",
  "starring": [
    "Jodie Foster",
    "Anthony Hopkins"
  ],
  "runtime": 119,
  "genre": [
    "Crime",
    "Drama",
    "Thriller"
  ],
  "description": "Clarice Starling is a top student at the FBI's training academy.  Jack Crawford wants Clarice to interview Dr. Hannibal Lecter, a brilliant psychiatrist who is also a violent psychopath, serving life behind bars for various acts of murder and cannibalism.  Crawford believes that Lecter may have insight into a case and that Starling, as an attractive young woman, may be just the bait to draw him out.",
  "releaseYear": "1991",
  "mpaaRating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rplLJ2hPcOQmkFhTqUte0MkEaO2.jpg",
  "categories": {
    "plot": 9.433333333333334,
    "acting": 9.452380952380953,
    "ending": 9.25,
    "soundtrack": 9.0,
    "cinematography": 9.0,
    "familyFriendly": 9.0,
    "funny": 10.0,
    "action": 8.333333333333334
  },
  "reviews": [
    {
      "rating": "9",
      "text": "Horror movies are either going to be your best friend, or your worst nightmare. They either scare you to death, or you love them. Now most people would say the scarier, the better. But if something is scary to you, I don't see how you could like it. And yet, this film had scared me like never before and yet I can never let go of the feeling of how amazing it was. The Silence of the Lambs is a crime-suspense thriller, starring Jodie Foster and Anthony Hopkins. It's about a FBI trainee Clarice Starling, who is assigned to help capture a serial killer by the name of Buffalo Bill.  She simply has to question a former murderer, Hannibal Lector, better known as \"Hannibal the Cannibal\". The FBI believes there might be some sort of connections between the two killers, and asks Clarice to figure out what. And what begins as a small questioning process begins to evolve into one of the greatest crime story ever told. The Silence of the Lambs won 5 Academy Awards, including Best Lead Actor, Best Lead Actress, and Best Picture. It truly deserved all these wins, especially the acting. Jodie Foster's acting as Clarice Starling was great, but what really made this film worthwhile was Anthony Hopkins as Hannibal Lector. Never have I seen a villain so kind, yet so sinister and evil. Every word and breath he takes is haunting. You know that even when he talks so kindly to Clarice, he has some evil thoughts or something processing in his mind that the viewer can't just understand. That's what makes Anthony Hopkins the best thing about the whole film. Then I believe the second best thing is the cinematography. This film's cinematography is excellent, and done like no other movie before. You see that whenever there's a new character introduced, it's shown in the perspective of the main characterâ"
    },
    {
      "rating": "9",
      "text": "Foster and Hopkins really shine on their roles. Hannibal Lecter and Clarice Starling could not ask for best performers. Add an impeccable screenplay and an involving, organic directon from Demme, and then you have the best thriller for years to come."
    },
    {
      "rating": "10",
      "text": "A surprisingly great film. Great performances by the lead actors, which contribute all the more to the sense of tension throughout the film, and a stunning finale. One of the most breathtaking movies I have ever seen (and I say this as a person who generally dislikes the horror/thriller genre)."
    },
    {
      "rating": "10",
      "text": "This is the greatest thriller ever created. The Silence of the Lambs isn't scary as it is thrilling. You'll be on the edge of your seat and you'll be awe struck by Jodie Foster's and Anthony Hopkins' captivating performances."
    },
    {
      "rating": "9",
      "text": "Wow. I don't know why I haven't seen this sooner!\r I really loved this. The film was complex, but never to the point that you got completely lost. I found myself getting confused about where we were, and then it would all click a few seconds later. It was very clever at making sure you were aware of which character was who.\r The direction is very interesting in this film, with the contrast of the dark and gritty world of the FBI, and what happens when a character is put in prison, but when this then goes against the killer's room, I loved the designs, with all the colours etc.\r But lets face it. We all know why this film works so well.\r Anthony Hopkins. I bow down to you.\r I heard he was only in the film for about 15 minutes. That was a lie. He was just brilliant. The perfect mix of charm and menace to create a truly unforgettable villain. Hannibal Lecter really is the standout of the film, and will have you on the edge of your seat, whenever he is on the screen.\r I think the thing that kept me interested the most here was that it was simply a great story. An involving and original story that had me in it's bloody palms from start to finish."
    },
    {
      "rating": "10",
      "text": "One of the best and most effective thrillers of al time. Anthony Hopkins gives a career 2.0 performance, and Jodie Foster is remembered by this role. One of the last scenes in this movie is where you will see the movie's genius. (No spoilers)"
    },
    {
      "rating": "10",
      "text": "The Silence of the Lambs is most definitely at times, a horrifyingly tense film, and when it isn't it's an uncomfortably tense film, and when it isn't even that, its still pretty tense. But on the whole, The Silence of the Lambs is genius."
    },
    {
      "rating": "10",
      "text": "A great thriller that easily gets your attention from the beginning to the end. And the actors did an amazing job, especially Anthony Hopkins. But, this movie isn't particularly scary, and I wouldn't complain if there were more scares."
    },
    {
      "rating": "10",
      "text": "Absolute cracker of a film. 30 years later and people still talk about this movie. It has never left popular culture still heavily influencing films today and is instantly recognizable from its many references to famous movie quotes. Apart from the really impressive performances by the entire cast (who literally all bring their A-Game), The Silence of the Lambs greatest strength is that it doesn't wallow in depravity, given the nature of the book and the screenplay, wisely choosing to keep a lot of the grisly violence off the screen which makes it even more terrifying. The film is a character study into the minds of two psychopaths and the young rookie cadet trying to match wits with them.The dialog is snappy and sharp and the first part of the film is very procedural and slow moving (although no less absorbing) but once the second half kicks in, with a fantastic bait and switch twist it becomes a rollercoaster ride of pure unnerving tension as the young cadet finds herself alone in a mad man's dungeon trying to save his next victim.I saw the film in theaters and vividly remember people hiding underneath their chairs the films tension was so unbearable in its climax. Of course we have been desensitized in the intervening years since this film released so some may look upon the film today and not understand why it frightened so many people upon release but you have to remember no film from this genre had played cat and mouse with its audience the way this film did back upon release, so it caught everybody off guard.Absolutely brilliant stuff, highly deserving to be in a class of only three films to ever win all five major Academy Awards and easily in my top 5 films of all time."
    },
    {
      "rating": "9",
      "text": "The Silence of the Lambs is an outstanding film. Great acting especially by Hopkins and Foster. This film as amazing atmospherically because it is able to achieve a great level of tension. The best part for this aspect is the ending scenes in which you can't help but be on the edge of your seat the entire time. A much watch film and certainly deserving of all the academy awards that it won."
    },
    {
      "rating": "7",
      "text": "I thought I would watch this movie throughout the day as the trailer made it looked like it would scare the hell out of me however this movie was much more creepy than scary. Obviously Anthony Hopkins stole the show as Hannibal, it was strange as the movie went on I wanted him to escape. For me I preferred the scenes with Hannibal in to \"Buffalo Bill\" but Jodie Foster played a good Clarice Starling with excellent chemistry with Lecter. Overall I would give the movie 7/10 but as it was realised in 1991 I can understand why it"
    },
    {
      "rating": "10",
      "text": "How anybody could not like this moving is beyond me. Director Jonathan Demme did a fantastic job and all of the actors were marvelous, especially Hopkins and Foster.  The film is an 11/10. A 10/10 doesn't do it justice."
    },
    {
      "rating": "10",
      "text": "One of the best movies in history , What if Brian De Palma directed Silence of the Lambs?  It's funny because Lithgow was a choice to play Lecter when Manhunter was in production."
    },
    {
      "rating": "9",
      "text": "An expertly crafted piece of cinema with every instance of tension/release, thread of thematic intrigue, and frame of an image designed to a near flawless measure. A spectacularly acted, written, and staged work of art."
    },
    {
      "rating": "10",
      "text": "Two hours is long for movie time, but watching this might make you think it is like watching only 30 minutes. This movie is epic and contains all the things needed for a horror flick. I agree if IMDb who gave it an high rating of 8.8/ 10. Seriously, you can't watch any horror as good as this."
    },
    {
      "rating": "9",
      "text": "One of the most consistently tense movies I have ever seen in my life. It would be the number one most tense, but the 2013 movie Prisoners had me on edge for the whole runtime. Anthony Hopkins is the main reason this movie is so popular, he has just under 30 minutes screen time and won Best Actor at the 1991 Oscars. Jodie Foster is kind of overshadowed by him, but is also amazing. It is a performance movie, but has a brilliant plot and does not just rely on it's cast to carry the whole thing. Incredibly tense and impeccably performed The Silence of The Lambs is one of my favorite movies ever."
    },
    {
      "rating": "9",
      "text": "A creepy, at times horrific movie with incredible performances.  Meticulously directed, and written with searing intelligence, this is very likely the best horror film ever devised.  Of course, Hopkins as Hannibal Lector is simply amazing.  He's still the gold standard for the movie villain (even though he's kind of the hero), and I doubt he'll ever be surpassed.  There are so many fascinating, creepy, and even disturbing aspects about the relationship between Starling and Lector, but I'll let you find this out for yourself.  The characters here are as nuanced as I've ever seen.  Foster's performance is also excellent.  I must warn you, it's a graphic, disturbing, and at times even disgusting film, and on a different note some of the technical aspects of the movie haven't aged so well, but all in all, it's so memorable and haunting that I have to call it an absolute horror/crime classic.  I'll admit, I've had nightmares where I was in a building with Hannibal on the loose.  Those were some scary dreams."
    },
    {
      "rating": "8",
      "text": "I think what I love most about Silence of the Lambs is it's filming craft. This movie truly heightens your sense to the maximum degree, you are completely and utterly aware of intentions and brooding desires from both Buffalo Bill and Hannibal, but does it completely succeed in feeding these desires? Not entirely, but in many respects it does. The film clearly has a certain essence of expression to it for it's first pointed to be generic yet surprisingly deep hill-billy antagonist. We can see an almost angering cycle of predator transforming into scavenger and a brief victory of innocence immediately terminated by the film's excellent conclusion which indicates a slightly ambiguous, although intentionally intriguing, return to norm. However, I believe Silence of the Lambs may be a little too intrigued with it's fascinating characters to give them any lore or necessary origin, something I was craving to see from Hannibal but oh my mouth was completely watering to see it from Buffalo Bill. This confused moth man, I was likewise confused whether to feel sympathy or not due to the fantastic Goodbye Horses sequence. Nonetheless, Silence of the lambs is a structural master-class and daringly explores decay in it's natural form although it's complete cocooning whittles away at some earth shattering, pivotal messages the film was aiming for."
    },
    {
      "rating": "10",
      "text": "hannibal anthony terrorises one n all wid his ever engaging killer stare..foster deservs a standing ovation for hr potrayl of a lady cop,who finds a way 2 ovrcum hr fears n solve d most notorious of cases.grt background score,intense screen presence of d cast,all n all a director's mastrpc"
    },
    {
      "rating": "7",
      "text": "Um pouco SuperEstimado,claro a história é interessante Serial-Killer esse tema me fascina,mas como filme de Serial-Killer é muito fraco,contém excelentes cenas como a de Hannibal fugindo da cela e prisão devorando todos ao redor,mas também tem cenas no máximo bestas quase todas em que Bufallo Bill aparece.\rMas é cheio de atuações classe A,da gostosa branquinha Jodie Foster,Anthony Hopkins e Ted Levine.Mas continua sendo um filme ultra SuperEstimado."
    },
    {
      "rating": "9",
      "text": "Surely everyone knows this movie. The acting and scenes with Hopkins and Foster are classic. The story is interesting and reveals slowly everything. There is only one thing I didnt like: the super self confident Jodie Foster was annoying for me."
    },
    {
      "rating": "10",
      "text": "I have no words to describe how good is that movie. I really enjoy it and it's without any doubt the best of the trilogy and one of the best movies ever made. Hopkins is always excellent!!! Bravo!"
    },
    {
      "rating": "10",
      "text": "Awesome   !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "10",
      "text": "The Silence of the Lambs is very much worth seeing. Anthony Hopkins plays Hannibal the Cannibal very well, and Jodie Foster plays Clarice excellently."
    },
    {
      "rating": "9",
      "text": "The film is simply brilliant. The actors do their job well and manages to be one of the best films you've ever seen    ."
    },
    {
      "rating": "9",
      "text": "Oh my God, how did my parents ever let me watch this film? I know I blocked most of it from my memory but watching it again revived the sheer fear I felt when I was younger. Anthony Hopkins is so creepy that just the look of him and his speech make me shiver. I can't believe what goes on in that film, no wonder that I blocked out most of it.\r Anthony Hopkins has such a presence in this film that he stays with you even when he’s not in the scene. He’s in your head the whole time but when you think of it he’s barely in the movie, he just has a few scenes that’s how powerful his performance is.\r The film is so smartly shot, they chose a petite actress, that can easily look frail, and they used some wide shots from above to show how small she is around the Men, and shows how small and inexperience she must feel around them. Jodie Foster played her character with sensitivity and a quiet strength that also elevated the film.\r The Silence of the Lambs is over 20 years old but it holds up, you’re drawn to this suspenseful thriller from the beginning to the end, and then it stays with you. @wornoutspines"
    },
    {
      "rating": "9",
      "text": "When The Silence of the Lambs took the Academy Awards ceremony by storm in 1992, winning in five major categories (Best Picture, Best Director - Jonathan Demme, Best Actor - Anthony Hopkins, Best Actress - Jodie Foster, and Best Adapted Screenplay - Ted Tally), it beat the odds in more ways than one. Granted, 1991 was a slow year for movies, and many pundits have remarked that the Oscar field was among the weakest ever (the other contenders were Disney's Beauty and the Beast, Bugsy, JFK, and the overrated The Prince of Tides), but the strong showing of The Silence of the Lambs was a surprise to almost everyone. In the first place, it was released in February 1991, a date thought to be beyond the short memories of the Academy members. Secondly, it is a dark psychological thriller - the kind of movie that occasionally receives a Best Picture nomination, but almost never takes home the statuette.\r Although The Silence of the Lambs is brilliantly constructed and powerfully acted, and became one of the most recognizable thrillers of the '90s, it was neither the best movie of the year (a citation I would award to Beauty and the Beast) nor even the best thriller (overall, Dead Again impressed me more). The Silence of the Lambs contains a number of inarguably great scenes, but the screenplay, adapted from Thomas Harris' novel, suffers from a split personality. The scenes featuring Hannibal Lecter (Anthony Hopkins) are the stuff of legends. However, the rest of the movie, which concentrates on the pursuit of serial killer Buffalo Bill (Ted Levine), has a familiar, derivative feel. In truth, the climax couldn't be more mundane.\r There is little doubt that the most memorable aspect of The Silence of the Lambs is Anthony Hopkins' incomparable performance as Lecter. Taking over for Brian Cox, who was effective, but not especially memorable, as the good doctor in 1986's Manhunter, Hopkins instantly makes the role his own, capturing and conveying the charismatic essence of pure evil. To his dying day, no matter how many roles he plays in the interim, Hopkins will forever be known for this part. (It is a credit to Hopkins' ability as an actor that this part did not result in stereotyping. His post-Silence career has been greatly varied, with roles as widely diverse as a stodgy butler in Merchant-Ivory's The Remains of the Day and an action hero in The Edge.) I can throw out any number of superlatives, but none of them do justice to this chilling performance, which I labeled as the best acting work of the '90s. Want to feel the icy fingers of terror stroke your heart? Watch this mixture of brilliant eloquence and inhuman cruelty. As portrayed by Hopkins, Hannibal is both a suave, cultured gentleman and an unspeakable fiend. He is gracious and monstrous at the same time. (Hopkins also provided one of the most quotable lines in recent film history with \"I ate his liver with some fava beans and a nice Chianti\", which was followed by an inimitable slithering slurp.)\r It's impossible to mention Clarice without noting that she is one of the rarest commodities in thrillers: a female hero. In interviews, Foster has indicated that, of all the roles she has played in a career that began in childhood, Clarice is her favorite (which makes it odd that she didn't try harder to re-arrange her schedule so she could reprise the part in The Silence of the Lambs' sequel, Hannibal). In addition to having to face Lecter's mind-games and the dangers associated with Buffalo Bill, she must deal with the sexual politics of being a woman in a man's world. The most telling scene occurs early in the movie, when Crawford takes her on a \"field trip\" to view the latest victim. There, in a hick town, she finds herself stripped of authority as a result of a casual comment by Crawford, and surrounded by a group of macho, male cops. After momentarily escaping by taking flight into a memory of her father's funeral, she regroups and takes charge of the situation, ordering the men to clear the room where the body is housed. Thus does Clarice become a woman championing victimized women - a real heroine, not a woman imitating a testosterone-driven stereotype.\r The Silence of the Lambs may not have been the best thriller of the year, but it was the most chilling and creepy, and there's no denying that the most celebrated aspect of the film - the Clarice/Hannibal connection - could not have been accomplished with greater skill."
    },
    {
      "rating": "10",
      "text": "I have seen some great movies, old or new. The Silence of the Lambs is an amazing one, while not my personal favourite of the year of 1991 it was a well deserved Best Picture win in my opinion.Jonathan Demme's direction is superb, the film is shot in a ceaselessly atmospheric manner and Demme never lets the suspense drop. The story from start to finish is enthralling, and the script is tense and thought-provoking.The Silence of the Lambs is wonderfully acted as well. Jodie Foster is the one who holds the film together and her performance here is one of her most excellent, and I mustn't forget Ted Levine who is very chillingly effective as Buffolo Bill. Anthony Hopkins however steals the film, it is his perhaps most iconic character and he proves that although he is in only a portion of the film his performance lives long in the memory.All in all, amazing. 10/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "The Silence of the Lambs feels more like the Silence of the Audience during its time. Anything other than that, I'm sure this movie could start entertaining you just as these users and critics did."
    },
    {
      "rating": "10",
      "text": "The Silence of the Lambs won the “big five” Academy Awards (Picture, Actor, Actress, Director, and Adapted Screenplay) when it came out, and it isn't hard to see why. At its center is the mission of FBI trainee Clarice Starling, who solicits the help of cannibalistic psychiatrist Hannibal Lecter in order to take down another serial killer. This unique thriller will keep you hooked from beginning to end. While the film's storyline is near flawless, it's best aspect was the two leads. Jodie Foster shines as the determined trainee. Despite the relatively minimal screen time that he receives, Anthony Hopkins leaves a lasting impression with his performance as the brilliant but maniacal Lecter. Nobody could've nailed those roles better than Foster and Hopkins did; the dynamic between their characters is ultimately what makes this movie as great as it is. The Silence of the Lambs is undoubtedly one of the greatest movies that I've ever seen."
    },
    {
      "rating": "10",
      "text": "A first unmissable, then enduring, but always an unmissable classic. Hannibal the Cannibal. Fast, witty, and jolting"
    },
    {
      "rating": "9",
      "text": "Silence of the Lambs is a very good movie. It's one of the best horror movie of all time."
    },
    {
      "rating": "10",
      "text": "джоди фостер джоди фостер джоди фостер джоди выходи за меня выходи за меня будь моей женой"
    },
    {
      "rating": "10",
      "text": "Шикарный фильм, сейчас такие уже не делают, а даль"
    },
    {
      "rating": "10",
      "text": "As a genre fan, there's a certain amount of satisfaction when a film is recognized by mainstream audiences. That's what it was like for me in 1992 when Silence of the Lambs swept the Oscar's (Best Picture, Director, Actor and Actress). And boy did the movie deserve it. Jonathan Demme's fantastic retelling of the classic book by Thomas Harris. Anthony Hopkins' scene-chewing Hannibal Lecter turned him into a pop culture icon (and unfortunately a slew of middling sequels). And Jodie Foster's grim and naive portrayal of Clarice. The final touch is that haunting score. Some of the best movies out there are elevated by a musical score that puts it another league. A phenomenal classic."
    },
    {
      "rating": "10",
      "text": "Can't be imagined a better cast in this movie (Isn't Foster? Isn't Hopkins?). Excellent working of acting was got at maximum in a thrilling and genial plot that makes you want to know what will gonna happen in epilogue."
    },
    {
      "rating": "10",
      "text": "PARA MI esta es la mejor pelicula en toda la historia de la humanidad, las actuaciones y el guión son absolutamente brutales, los diálogos entre Jodie Foster y Anthony Hopckins son magistralmente perfectos y fuera de este mundo."
    },
    {
      "rating": "9",
      "text": "Ya he podido disfrutar de esta GRAN película del género de terror. Me parece una de las grandes obras del género y, en cuanto a gusto, la pondría a la altura de otros films míticos como \"Halloween\" o \"El Resplandor\", siendo esta última mejor como película. Enorme los personajes tanto de Hopkins como de Foster (durante la proyección de la misma muchas veces veía incluso más interesante a Foster que a Hopkings) y la película son ellos dos. Este largometraje es un envoltorio de terror que esconde el verdadero género de la película: puro cine negro, viéndose claramente en el pasado de los personajes o el tono oscuro y la investigación policial que son características propias de este género. Temas como la transexualidad o el machismo de telón de fondo. Aquí los guionistas no te lo dan todo mascado y la mayoría de las veces el espectador tiene que unir el las piezas, cosa que denota que la película posee un gran guión. En definitiva, la película me gustó mucho, se me pasó muy muy rápido porque es muy llevadera y te mantiene en tensión e intriga todo el metraje. Imprescindible para los que les guste el género y el buen cine, esta es de las muy buenas."
    },
    {
      "rating": "9",
      "text": "FBI agent in-training interviews a killer in a psychiatric unit to get a profile of another serial killer but despite catching that guy, she allows the other one to escape."
    },
    {
      "rating": "9",
      "text": "----------------------------------9.4/10-----------------------------------"
    },
    {
      "rating": "10",
      "text": "A classic. Everyone in this film brings their A-game. Whenever Ted Levine or Anthony Hopkins were n the screen, the tension went up. Although the film is quite slow, the tension is kept up with a great musical score and great dialogue. It kept my eyes glued to the screen."
    },
    {
      "rating": "10",
      "text": "if u looking for a amazing acting and amazing story then this movie is the right choice and its one of the best i have ever seen ,this movie will make speechless at some moments at i was"
    },
    {
      "rating": "9",
      "text": "One of the classic horror films. Anthony Hopkins' performance is brilliant and definitely creepy. Jodie Foster also did a brilliant job in the film. Everything is just fantastic. There is nothing I can say...just excellence from this classic film............"
    },
    {
      "rating": "10",
      "text": "Perhaps film's greatest villain and greatest heroine in one film. Can this be? You betcha. Anthony Hopkins embodies evil in his haunting portrayal of Dr. Hannibal Lector. As for Jodie Foster, we'll remember Clarice for her strength and willpower."
    },
    {
      "rating": "9",
      "text": "With The Silence of the Lambs, Jonathan Demme laid the foundation of all psychological thrillers to come after it and also accomplished a contestant for one of the best book adaptions in film history, as he transformed Thomas Harris’s entertaining and thrilling novel of the same name into a visionary, absorbing, and stereotype-defying motion picture that deservedly ranks among the prestigious trio of films to have won the Big Five categories at the Academy Awards. It’s one of the very few thrillers (not horror films, as asinine Hollywood likes to classify it) that improves with time, similarly to the Chianti Hannibal Lecter mentions in the essential The Silence of the Lambs quote, as it’s neither a whodunit nor a howcatchem, but rather a study of psychopaths’ and serial killers’ twisted states of mind."
    },
    {
      "rating": "9",
      "text": "My friend always said a thriller should have a psychological facet in a movie. Well, me and him watched this together and I could not be more pleased with what this movie had to offer.. Believe me, alot of thriller movies have done a good job emulating this film without trying to exactly copy it. I love the acting, the plot, and the literal thrill of suspense. Im a music guy so I do pay attention to the musical score and lets just say the Munich Symphony Orchestra made me check the curtains and grab an extra layer of sheets.\r Jonathan Demme deserves credit for directing this and so does Ted Tally for writing the screenplay.\rIt's weird but I get the sense that this movie could really happen in real life. I got annoyed at some of the acting but it won best actor and actress so don't take my word for it. Last thing I want to mention is that this movie tackled on some really tough issues like homophobia and sexual orientation. That is BIG considering the 80s was a really rough period for the LGBT community.\r Treat yo self and watch this movie. If the US Library of Congress approves and you don't, you're not appreciating American work. Just kidding but I love a smart, bad-ass villain"
    },
    {
      "rating": "10",
      "text": "In this film, the young and inexperienced FBI Agent Starling will need the help of Hannibal Lecter, a dangerous and manipulative cannibal, to capture a serial killer. Directed by Jonathan Demme, it has screenplay by Ted Tally, and has the participation of Jodie Foster and Anthony Hopkins. Won five Oscars (Best Picture, Best Actor, Best Actress, Best Director and Best Adapted Screenplay; was also nominated for Best Sound and Best Editing).This film needs no introduction and has already become a classic. The Hanibal character is a horror icon and consecrated Hopkins as one of the greatest masters of representation of the late twentieth century. Decidedly, watching this film, we have the notion that all factors combined, in the ideal measure, to make a piece of art that, even so, due to the topic and some more shocking scenes, is not suitable for sensitive people.The script is excellent and works in a masterly manner, without errors or holes. The work of director was essential for the success of the film, along with the performance of the actors themselves. In fact, even the supporting actors in the film were very good in their roles, although the spotlight have been under the heads of Hopkins and Foster. The two actors were brilliant, the way they interact is a drama lesson. The penetrating gaze of Hopkins, and his viperous cynicism, are one of the registered marks of the film. The rest (sets, costumes, photography and soundtrack) is impeccable. It's a great movie, recommended to those who like a suspense story."
    },
    {
      "rating": "10",
      "text": "This is such a brilliant movie i have ever seen that comes under the Psychological Horror genre. Absolutely masterpiece that will keep you high till the end. The casts, the story, the screenplay were perfect and for a single moment I couldn't even think of something better or something would have been some other way. This is just f**cking mind blowing piece of art directed by Jonathan Demme"
    },
    {
      "rating": "3",
      "text": "Jodi Foster's detective work that enabled her to find The Bad Guy is threadbare and not very exciting"
    },
    {
      "rating": "9",
      "text": "All creative hands are at the top of their form in “The Silence of the Lambs,” a mesmerizing thriller that will grip audiences from first scene to last and generate solid B.O.\r Skillful adaptation of Thomas Harris’ bestseller intelligently wallows in the fascination for aberrant psychology and perverse evil, delivering the goods in a way that should electrify critics and mainstream audiences.\r The specifics of the murder case in question here a serial killer who partially skins his female vlctims  are certainly gruesome, but are handled to generate maximum suspense without descending into the exploitative.\r Thoughtful and not debasing, pic takes a compelling, upfront look at sociopathic behavior and government attempts, with varying success, to keep it in check.\r Faithfully following the essentials of Harris’ book, playwright Ted Tally’s sharp script charts tenacious efforts of young FBI recruit Clarice Starling (Jodie Foster) to cope with the appalling challenges of her first case.\r Confounded by a series of grotesque murders committed by someone known only as “Buffalo Bill,” bureau special agent Jack Crawford (Scott Glenn) asks his female protege to seek the help of the American prison system’s No.1 resident monster in fashioning a psychological profile of the killer.\r Dr. Hannibal Lecter (Anthony Hopkins) is commonly known as “Hannibal the Cannibal” for the antisocial dining habits he took up upon abandoning his career as a brilliant psychiatrist to pursue his calling as a homicidal maniac.\r Astonishingly insightful and brutally frank, Lecter has been kept in a dungeon-like cell for eight years, and while officious doctors and investigators can get nothing out of him, he is willing to play ball with his attractive new inquisitor.\r On a quid pro quo basis, Lecter gives Starling clues as to the killer’s identity in exchange for details about her past. Even though Lecter is known as an ingenious manipulator and Starling has been warned against getting personal with him, she must proceed, especially after the daughter of a U.S. senator becomes Buffalo Bill’s latest captive.\r Just as it seems the noose is tightening around the killer, Lecter, in an remarkably fine suspense Sequence, manages an unthinkable escape. The FBI and, on her own, Starling must use all the info and guts they have to finally corner Buffalo Bill. But then, there is Lecter.\r Harris’ plot is as tight as a coiled rattler, and it has motivated Jonathan Demme to turn out his leanest, meanest work. Abandoning the colorful frills and offbeat mixed moods of “Something Wild” and “Married to the Mob,” this always interesting director has devoted himself to relentless storytelling.\r There is not a false note nor an extraneous moment as he establishes a vise-like hold almost immediately and doesn’t let up even through the chilling final shot. In the second half of “Something Wild,” Demme demonstrated a marked talent for rough suspense, something he sustains for two hours here.\r At the outset, Demme and his longtime ace lenser, Tak Fujimoto, plunge the viewer directly into the p.o.v. of the novice investigator Stariing, as she goes face to face with the diabolical Lecter and, as suggested by the title, is forced to confront her own childhood demons relating to the slaughter of animals. Film is omniscient, however, showing the activities of Buffalo Bill as well as those of Lecter later on.\r In a strong performance, Foster fully registers the inner strength her character must summon up to meet the chaUenges and occasional humiliations her tough assignment entails.\r Cast against type as a reserved man in glasses and a suit, Scott Glenn is a very agreeable surprise as the FBI agent who takes a chance by putting his young charge on the case.\r The juiciest part is Hopkins,’ and he makes the most of it. Helped by some highly dramatic lighting, actor makes the role the personification of brilliant, hypnotic evil, and the screen jolts with electricity whenever he is on. This is, without doubt, his most effective film appearance to date.\r From the huge hall in which Lecter is eerily caged at one point to the dingy rooms of Buffalo Bill’s house, Kristi Zea’s production design is critical to the picture’s mood. Editor Craig McKay keeps doesn’t let a frame stay on too long, and Howard Shore’s rather traditional score outstandingly amplifies the tension and psychological mystery."
    }
  ]
}