{
  "id": 140,
  "title": "My Neighbor Totoro",
  "starring": [
    "Noriko Hidaka",
    "Chika Sakamoto"
  ],
  "runtime": 86,
  "genre": [
    "Fantasy",
    "Animation",
    "Family"
  ],
  "description": "Two sisters move to the country with their father in order to be closer to their hospitalized mother, and discover the surrounding trees are inhabited by Totoros, magical spirits of the forest. When the youngest runs away from home, the older sister seeks help from the spirits to find her.",
  "year": "1988",
  "rating": "G",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rtGDOeG9LzoerkDGZF9dnVeLppL.jpg",
  "reviews": [
    {
      "rating": "7",
      "text": "First Act - 6/10Second Act - 6/10Third Act - 10/10Seriouslly, that was probably one of the best endings I've seen to any movie ever. This film is a very cute, and initially doesn't strive to be anything better than above average. However, it grows into quite a fantastic little film. If I have any issue the soundtrack sounded a little to similar to Hausu at points, but overall, this was just sweet. I want to watch this one again."
    },
    {
      "rating": "4",
      "text": "Hardly any plot, just exceptional animation and that's about it. Some enjoy just watching the kids be kids and the mood, but I have slightly better things to do."
    },
    {
      "rating": "10",
      "text": "My Neighbor Totoro is an enchanting childhood struggle that emphasizes the mysterious charm of every Ghibli film that would follow."
    },
    {
      "rating": "8",
      "text": "Although it brings a story that appears to be nothing deep, compared to the other titles, it fulfills its role somewhat. It is not necessary to charge much, given the whole concept and how everything works from the discovery of this new world through the girl."
    },
    {
      "rating": "10",
      "text": "This is my favorite movie ever. I love the atmosphere and the emotions and childish behavior they're able to portray so well."
    },
    {
      "rating": "8",
      "text": "Its a simple film that is made to give its viewers a big warm hug. Crazy that Totoro and his catbus got creepy smiles but I still find them adorable. As I said, simply heartwarming."
    },
    {
      "rating": "10",
      "text": "I am a huge Studio Ghibli/Miyazaki fan, and My Neighbour Totoro is no exception. In fact it is one of my favourites from them. There are so many wonderful things about My Neighbour Totoro. It is very simple in story and character but it is all very beautiful, charming and touching. The animation is typical Ghibli, ethereal-looking and just ravishing to watch, while the music is one of my favourite scores in a Ghibli film. The story is simple, but I loved the simplicity, it had such a pleasant atmosphere to it, and the characters are engaging with great chemistry together. I have very little to complain about the voice acting either, everybody did a fine job. In conclusion, in my opinion this is an animated classic. 10/10 Bethany Cox"
    },
    {
      "rating": "10",
      "text": "From same school that graduated Tom & Jerry and The pink panther comes the cuddliest, charming and iconic character of Studio Ghibli, always coming for rescue and giving a hand (or paw) to children in distress. Every anime collector shall have it."
    },
    {
      "rating": "8",
      "text": "Um filme infantil que trata de forma adultas coisas da vida ponto positivo:envelheceu bem para um filme de animação de 1988, personagens carismáticos(chorei em determinada parte do filme)ponto negativo:historia um pouco fraca para os estúdios ghibli,simples seria o mais certo, mas ainda sim deixa a deseja, apesar de que acredito que este ponto fraco para alguns se torne um ponto forte(ser simples mas ainda sim conseguir ensinar alguma coisa com isto)"
    },
    {
      "rating": "8",
      "text": "My neighbor Totoro is a perfect movie to enjoy as a family, with great audiovisual quality, an incredible world and a very simple story but very well told. While I expected more from this for the opinion of my friends, it's still a great movie."
    },
    {
      "rating": "8",
      "text": "I can't describe how delighted am I after I've just finished watching this movie. This is the best movie that captured the childhood very accurately. The children characters behave so realistically that I couldn't believe my eyes while watching them play, cry, laugh, or doing anything. I didn't felt like I was watching a child in front of me, but I felt like I was watching my younger self. I felt like I was watching myself as a child. As if my childhood memories were being displayed before me. Even if I haven't done that thing the characters did, I feel that my younger self would do the exact thing. That doesn't mean anything but that Hayao Miyazaki is a real genius! But the greatest thing about My Neighbor Totoro isn't how realistic it feels, but it's the fabulous message it delivers, and the thing that is more fascinating is the way it delivers this message. I really shouldn't spoil anything about this gorgeous film, but it delivers a message about facing the fear; the fear of everything, and the fear in all its kinds and levels. Miyazaki merged this message with this story that almost has no plot! I shouldn't call it delivering the message, instead, I should call it merging or combining the message with the story, or rather I should say that Miyazaki created an entire story from a message! Hayao Miyazaki proved that it's not even necessary for a movie to have an antagonist, or at least not a common one, as I mentioned above, the story itself is about a message about facing the fear. And I didn't feel at any time throughout the movie that I need a common antagonist or a usual problem to be invested in the movie. I was engaged and hooked from the very beginning of the movie till the end credits scene, which is very cool, by the way. The thing is that at the third act the movie changed completely in terms of the plot; it turned from a plot-free movie to a movie that has a real plot and a very serious problem. The plot and its problem didn't come from nowhere; they are attached very well to the story from its beginning, and it's been appeared later that the plot is kinda share the same message of the story, but the problem is that the movie changed a great deal when it moved from its second to the third act. It was like the movie betrayed itself after promising that it well keep the audience on the edge of their seat without using any problem or obstacle. Yes I've been engaged again and invested in the story with its plot because I cared about every single character, but it took me a little time, and I really felt disturbed and annoyed with this inconsistency. Overall, I can say that My Neighbor Totoro is an imaginative tale that every parent should take his child and watch it with him or her. Because it's message is actually more important to the adults.I prefer My Neighbor Totoro to Spirited Away, but let's face it, Spirited Away is the best Miyazaki movie!(8.5/10)"
    },
    {
      "rating": "4",
      "text": "The film certainly has a lot of positives within it. It does a good job of establishing the characters as relatable, in a way that a lot of animated films never do. The imagination and the joy of youth really does come through in the presence of the two girls. However, the movie probably spends too much time with them in its lackadaisical state and not enough time on story. Half an hour into the film, the novelty of the movies encapsulation of youthfulness and subtly implied magical world-building, start to wear thin. You may find yourself questioning where the film is going. Be prepared to wait nearly another hour wondering, as this film is very light on plot. At the end of the film it does pull out everything it can to provide an emotional and satisfying conclusion, and succeeds quite well at doing so in fact. But I'm not sure the meandering journey was quite worth the destination. The movie could have probably been helped by a harsher edit; a good twenty minutes or so cut from the movie might have helped the pacing. Also, worth mentioning is that the music is quite good, if not sometimes a little elevator music-y. The Totoro theme that plays over the credits is quite catchy."
    },
    {
      "rating": "10",
      "text": "A rare movie so benign and wise that merely thinking about it makes me cry. A perfect movie."
    },
    {
      "rating": "10",
      "text": "A cute and relatively short film which is beautiful, pleasant, positive, and relaxing. Studio Ghibli was able to perfectly craft a wonderful experience. The movie never strays into any unnecessarily dark or uncomfortable territory, and is able to capture a very positive, dreamlike set of emotions which are so often missing from our daily lives."
    },
    {
      "rating": "10",
      "text": "A beautifully innocent fantasy. I love this film.Relive the innocence of childhood and escape to the satoyama!"
    },
    {
      "rating": "8",
      "text": "This is in my opinion one of the must-watch movies when it comes to the works of Miyazaki and Studio Ghibli. The story is lovely and heartwarming, but not too overboard at the same time. It's all just focused on the few main characters and what they experience- Also the music is very well-done and iconic, in my opinion."
    },
    {
      "rating": "9",
      "text": "Few movies can make me feel like a kid again quite like My Neighbor Totoro."
    },
    {
      "rating": "9",
      "text": "Probably most pleasing and entertaining to watch out of all Studio Ghibli's work so far. Classic you cannot miss"
    },
    {
      "rating": "8",
      "text": "My Neighbor Totoro is charming, adorable, gorgeously animated, and above all else, heartwarming. The movie follows two young girls who's mother is hospitalized. Both of the main characters get plentiful screen time and are a joy to watch run around in this beautiful and imaginative world. The movie os overall very delightful, but lacks serious character development and plot."
    },
    {
      "rating": "10",
      "text": "Tiene una trama muy simple, pero la animación es muy buena y la música es agradable; un clásico del Studio Ghibli."
    },
    {
      "rating": "9",
      "text": "This movie truly shows the beauty of Japanese animation. The music,the animation it is like a painting or an orchestra combined together with great voice acting on both the English and Japanese translations. Similar to how Song of the Sea shows off the culture of Ireland, My Neighbor Totoro shows off the culture of Japan in a way we wouldn't have seen before."
    },
    {
      "rating": "9",
      "text": "As I am writing this review, I feel like there is a certain difficulty in even knowing where to start. But if I am going to start somewhere, Studio Ghibli has definitely proven themselves to be an important studio, where their older works feels a breeze of fresh air. \"My Neighbor Totoro\" can definitely be considered a classic, as it feels like the first time every time you come back. All of those clean elements and lively attributes are shown through every scene. Similarly how I've felt after a lot of other Ghibli movies, there is a sense of speechlessness and a need to delve deeper into every shot. Details lead as a main point to why this movie feels so alive; they are never unnecessary, because they never distract you from the main plot.The leitmotif that reoccurs through the movie has a very eerie but also calming feeling to it. The forest where the \"Totoros\" live becomes very so magical and mysterious, where you understand better why Tatsuo (the professor and father) teaches his children how important it is to show respect and gratefulness. Going back to one of my previous points: you feel like you want to dive deeper and discover the entire world outside of the screen's limits. There is a lot more that could be said about this movie, but there are too many thoughts and feelings mixed together that it would be difficult to find a way to summarize it all. But if I have to, consider this one of the greatest Japanese media of all time, because it has an impact like nothing else could."
    },
    {
      "rating": "9",
      "text": "When two girls move to the country to be near their ailing mother, they have adventures with the wondrous forest spirits who live nearby. (9)"
    },
    {
      "rating": "10",
      "text": "This is a nearly perfect movie and a must-show to your kids. It’s beautiful and magical and peaceful."
    }
  ]
}