{
  "id": 198,
  "title": "Gandhi",
  "starring": [
    "Ben Kingsley",
    "Candice Bergen"
  ],
  "runtime": 191,
  "genre": [
    "Drama",
    "History"
  ],
  "description": "In the early years of the 20th century, Mohandas K. Gandhi, a British-trained lawyer, forsakes all worldly possessions to take up the cause of Indian independence. Faced with armed resistance from the British government, Gandhi adopts a policy of 'passive resistance', endeavouring to win freedom for his people without resorting to bloodshed.",
  "year": "1982",
  "rating": "PG",
  "imageUrl": "https://image.tmdb.org/t/p/w500/rOXftt7SluxskrFrvU7qFJa5zeN.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "I am all for ambitious and stately films, which is why I watched Gandhi. And I like Richard Attenborough, I think not only was he a talented actor and director but his films are very interesting. Gandhi is certainly one of his more interesting films, along with the underrated Cry Freedom.Gandhi is just a wonderful film, and do I think it's one of Attenborough's best? Along with Cry Freedom and Shadowlands, yes it is. This film is for me his most ambitious and his most stately, and it is very compelling. True, it is long and perhaps leisurely in pace, but it is well worth the watch for several reasons.Visually it is superb to look at. It was almost like watching a David Lean film, it has the beautiful scenery, the stunning cinematography and the sweeping colours that a Lean film does. I also loved George Fenton's score, it was very epic and moving. Is it his best? Perhaps not, but it is one of his better scores. Attenborough's direction is superb, and the script is thought-provoking. The story, starting with Gandhi's assassination and told mostly in flashback, is interesting and compelling, while the acting also helps drives the film. Words cannot describe how good Ben Kingsley's performance was, composed yet inspirational, sometimes I felt as thought I was actually seeing Gandhi rather than Kingsley. In fact, this is probably the Richard Attenborough-directed film that feels the most authentic in terms of characters and story. Kingsley also gets superb support from Candice Bergen, Edward Fox, John Gielgud and Roshan Seth. Best scene? Lots to pick, but Gandhi's funeral was brilliantly done and one of the most emotional scenes in film and had massive scope to it.Overall, brilliant and one of Attenborough's best. 10/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "This film tells the life of Gandhi, a highly intelligent lawyer of British origin, which joins the Indian independence cause and plays a key role in the independence of India, after decades under British rule. Directed by Richard Attenborough, it has a screenplay by John Briley and stars Ben Kingsley in the lead role.The film is quite honest in the picture that makes of the life and struggle of Mahatma Gandhi, father of modern India. He is portrayed as an idealistic, utopian, combative and determined to achieving his objectives in a way that he considers appropriate, without resorting to expedients that he knows are not right. An icon of passive resistance and nonviolence, Gandhi is played brilliantly by Ben Kingsley, who managed to live up to the role, giving the character a great moral force. The film catapulted him to stardom in all fairness, after a great character reconstruction work (physical, mental and psychological) along several stages of his life.The film is a classic with classical techniques. No complex special effects or anything like that. The crowds that come in some scenes, such as Gandhi's funeral, are made from real people. An effort partially forced by the absence of cheaper techniques, but compensated by giving a striking realism to the film. This realism efforts found following in costumes, filming locations and sceneries, creating an environment that transports us easily to the time and place of action. In fact, this film could almost be a documentary about Gandhi and the life and society of the British Raj era. The soundtrack is signed by Ravi Shankar, but its far from the impact and relevance of other soundtracks. Anyway, the film reached a deserved consecration, raising eight Oscars (Best Picture, Best Director, Best Actor, Best Original Screenplay, Best Cinematography, Best Art Direction, Best Editing and Best Costume Design)."
    },
    {
      "rating": "7",
      "text": "It's easy to see how this film turned to be a classic, with Kingsley's mesmerizing performance being just one of its laudable aspects. But what really strikes in retrospect, is how eager its makers were to elevate Gandhi's mythical status, leaving his personal journey and intimate relationships clouded in mystery, if not ignored. This is telling for how fresh the wounds of the world's departure from colonialism still were around that time. The debates were ongoing, the controversy so vivid that this film could not afford to portray Gandhi as anything short of a semi-god hero. It succeeds, but there lies also its weakness."
    },
    {
      "rating": "10",
      "text": "Classic movie with top actors, especially Ben Kingsley. The story is beautiful, because the results of Gandhi are legendary."
    },
    {
      "rating": "10",
      "text": "ótimo filme, recomendo, a atuação do cara é muito top, e ambientação do filme é massa."
    },
    {
      "rating": "10",
      "text": "One of the best biography epics ever made, and it is about truly one of the greatest people to have ever walked the earth in all of human history in Mahatma Gandhi. A perfectly casted and executed movie that tries in passionate earnest to respect the source material and facts about Gandhi rising from a humble lawyer, to a leader that freed India from its colonial stranglehold."
    }
  ]
}