{
  "id": 64,
  "title": "Once Upon a Time in America",
  "starring": [
    "Robert De Niro",
    "James Woods"
  ],
  "runtime": 229,
  "genre": [
    "Drama",
    "Crime"
  ],
  "description": "A former Prohibition-era Jewish gangster returns to the Lower East Side of Manhattan over thirty years later, where he once again must confront the ghosts and regrets of his old life.",
  "year": "1984",
  "rating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/i0enkzsL5dPeneWnjl1fCWm6L7k.jpg",
  "reviews": [
    {
      "rating": "4",
      "text": "Going for nearly 4 hours, this crime epic had its good parts. However it has dated pretty poorly. Set during the 20s, 30s and 60s, it looks far too much like a 1980s film, which it is.The score (composed by Ennio Morricone, who is a genius) belongs in a romance film, not a misogynistic gangster film where the men routinely assault and objectify women. It also has a very 1980s sounding version of \"Yesterday\", which is laughable.The characters are unsympathetic and unremarkable, giving you no reason to root for Robert De Niro's character as he returns to his old neighbourhood for revenge.Easily the worst film of Sergio Leone's catalogue."
    },
    {
      "rating": "9",
      "text": "\"I come from a background of experimental music which mingled real sounds together with musical sounds.\"Ennio Morricone, one of greatest composers to have ever blessed cinema has sadly left us. Me talking about this legend will not do justice to his legacy. With over 520 credited scores, it is a life worth lived. Every single one of his scores are so uniquely distinct, and yet fits so perfectly with the genre it's based on.Some of the best written music ever, such as: 'The Good, the Bad and the Ugly', 'The Untouchables', 'Once Upon a Time in America', 'The Mission', 'The Hateful Eight', and 'Days of Heaven'. Of course, not forgetting 'The Thing', with its two beats sounding like a heartbeat, but like an alien trying to imitate a human heart in order to blend in. Super eerie.Also, the Razzie Awards don't know **** when it comes to movies. For those who do not know what I am talking about, let me briefly explain. The score for 'The Thing' was nominated for Worst Score at the ceremony. Like...what!?Even if you haven't seen the movie, you would most certainly heard one of his scores. You just cannot escape it; it is that timeless and instantly recognizable. A titian has left the building.Rest in power, Ennio Morricone."
    },
    {
      "rating": "10",
      "text": "One of the best film ever made with an incredible story, an extraordinary soundtrack and an amazing acting and art direction."
    },
    {
      "rating": "10",
      "text": "Perfect One of best movie i ever see...Story:amazingActors: amazing Everting: amazing"
    },
    {
      "rating": "10",
      "text": "A haunting and engulfing masterpiece of cinema, with enough beauty and craftwork to become an enduring classic for years to come. Incredible direction, incredible performances, and an incredible score."
    },
    {
      "rating": "10",
      "text": "Sergio Leone's last and most ambitious project is simply one of the greatest gangster films ever made."
    },
    {
      "rating": "10",
      "text": "The last masterpiece of Sergio Leone with Robert De Niro, James Woods and Elizabeth McGovern. It’s powerful and brilliant. A very masterpiece."
    },
    {
      "rating": "10",
      "text": "This is a review of the \"European Cut\" a nearly 4-hour long movie. Once Upon a Time in America is simply one of my favorite films, and one of the best gangster films. Telling the story of a gang from childhood to adulthood, wonderfully filmed, paced brilliantly, it's tragic, it's messed up, it's just a wonderful cinematic masterpiece. I don't think it's very everyone but I think it's worth all the attention in the world."
    },
    {
      "rating": "10",
      "text": "This may appear to be a gangster film such as The Godfather, but a closer look and there’s so much more to it. This isn’t a film. It’s art."
    },
    {
      "rating": "6",
      "text": "Reasonably similar to the Godfather films but not quite as engrossing. De Niro is as good as ever."
    },
    {
      "rating": "10",
      "text": "I have seen many movies, good and bad. One thing for certain, Once Upon a Time in America is more than good. It is amazing, a true milestone in the crime drama genre. The cinematography, images, scenery and locations are all superb and quite sweeping, while Ennio Morricone's score ranks up there with his very best. While the film clocks in at nearly four hours long, it never feels boring to me while the pace is quite elegiac everything else just compels you. I will admit, this is another film you need to see more than once to understand/appreciate it.Sergio Leone's direction is also superb, the story is always compelling and rich and the dialogue is very thought-provoking. The characters are wonderful if different. Unlike The Godfather(not a bad thing by the way), Once Upon a Time in America doesn't make you feel sympathy for its characters, these characters are actually quite nasty people but the way they are written and acted makes them compelling too. The two rape scenes are very shocking and perhaps brutal, but again that's no flaw in any way, because this slant on crime and the like is quite realistic if you put it in perspective.The acting is another strong asset. Robert DeNiro and James Woods, both are great actors, and both give brilliant performances. So overall, extraordinary, not only of its genre but of film full-stop. 10/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "There's no other film that has the same emotional heft of The Godfather and the same narrative heft of Citizen Kane as this masterpiece of pure cinema. Additionally, this is Leone at his most ambitious, poetic, mature, stylistically audacious and at his, at least for me, best. I'm just floored, and I feel as if I was missing out on half of cinema!"
    },
    {
      "rating": "10",
      "text": "Sergio Leone artistically combine crime, gangster, Love, friendship, politic... in this film. The Ennio Moricone music have an important job in this film like as previous films. You should be patience if you want watch this long time film."
    },
    {
      "rating": "8",
      "text": "Burt Young, Danny Aiello, Elizabeth McGovern, James Hayden, James Woods, Joe Pesci, Robert De Niro, Treat Williams, Tuesday Weld, William Forsythe"
    },
    {
      "rating": "10",
      "text": "I have not been able to see such an atmosphere of the early 20s of the twentieth century in any film. You can moralize for hours about how you can admire a film where they kill, betray, and engage in frankly bad deeds. It is possible - precisely with the picture, the skill, the subtle acting of the actors ... in a word, the talent of the director Sergio Leone, who nurtured the idea of the film for about 14 years."
    }
  ]
}