{
  "id": 75,
  "title": "Come and See",
  "starring": [
    "Aleksei Kravchenko",
    "Olga Mironova"
  ],
  "runtime": 142,
  "genre": [
    "Drama",
    "War"
  ],
  "description": "The invasion of a village in Byelorussia by German forces sends young Florya into the forest to join the weary Resistance fighters, against his family's wishes. There he meets a girl, Glasha, who accompanies him back to his village. On returning home, Florya finds his family and fellow peasants massacred. His continued survival amidst the brutal debris of war becomes increasingly nightmarish, a battle between despair and hope.",
  "year": "1985",
  "rating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qNbMsKVzigERgJUbwf8pKyZogpb.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "One of the best, most disturbing, harrowing, unnerving and impactful movies I have ever seen.This is a movie that drags you through hell. It's painful.It's hard to watch.In the best way possible.This is a movie you don't recover from. It leaves you speechless. It leaves you shaking.This is a masterpiece,and it's not for the faint of heart."
    },
    {
      "rating": "10",
      "text": "This is just one of the best WWII movies. A short episode of the life of a teenager who learned the horrors of war and the death of all his loved ones. A must-see, like Schindler's List."
    },
    {
      "rating": "8",
      "text": "Very good film and shows you the horrors of world war 2 and how crazy it was."
    },
    {
      "rating": "10",
      "text": "Probably one of the best if not the best films about WW2, and one of the most unnerving and scary films ever made. It depicts war and the life of ordinary people during it the most cruel and realistic way possible, and it certainly does leave a mark on one's perception of the topic."
    },
    {
      "rating": "9",
      "text": "Have people who think that war is a mathematical thing watch this movie and slam the harsh realities in their faces. As I watched, I thought I was there and I was very nervous. It contains awesome acting and scenes. I would say it's the most realistic war movie I've ever seen. I loved the last sequence!"
    },
    {
      "rating": "10",
      "text": "Francois Truffaut once said \"There is no such thing as an anti-war film\". But then, he never saw this film, did he? If I had to summarize my experience during this in one word, it would be \"destruction\"."
    }
  ]
}