{
  "id": 29,
  "title": "Gladiator",
  "starring": [
    "Russell Crowe",
    "Joaquin Phoenix"
  ],
  "runtime": 155,
  "genre": [
    "Action",
    "Drama",
    "Adventure"
  ],
  "description": "In the year 180, the death of emperor Marcus Aurelius throws the Roman Empire into chaos.  Maximus is one of the Roman army's most capable and trusted generals and a key advisor to the emperor.  As Marcus' devious son Commodus ascends to the throne, Maximus is set to be executed.  He escapes, but is captured by slave traders.  Renamed Spaniard and forced to become a gladiator, Maximus must battle to the death with other men for the amusement of paying audiences.",
  "year": "2000",
  "rating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/ty8TGRuvJLPUmAR1H1nRIsgwvim.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "Wow. Washington Post, get some taste in film."
    },
    {
      "rating": "10",
      "text": "Gladiator is one of the best movies of all time. It's flawlessly directed and features some of the most memorable performances ever committed to film. The action is grisly but not gratuitous in any way. The fights on offer here are integral to the story. There is so much emotional gravitas in the final battle that it might well be the greatest end fight in movie history. Basically speaking, Gladiator is perfect."
    },
    {
      "rating": "10",
      "text": "One of my dearest movies ever. Awesome, with great characters and an intriguing story, Gladiator is just perfect art by actor and director. Russel Crowe and Joaquin Phoenix both are terrific."
    },
    {
      "rating": "8",
      "text": "This is a classic and an amazing movie that could have nearly managed a 9. The score/ soundtrack is one of the best I've heard in any movie, and the fast paced action scenes are intense and violent. The set and the storyline is brilliant and really well done. The movie is a bit overrated in some ways but never the less, this movie is one that you have to say you've seen."
    },
    {
      "rating": "10",
      "text": "You will be hard pressed to find a better cast within such an epic summer film. Both Russell Crowe and Joaquin Phoenix are incredibly brilliant in their respective roles, however Phoenix deserves tons of props for pulling off a convincing evil emporer. Connie Nielsen almost steals the show at times while playing Lucille (Commodus' sister). When all the dust settles from brutal voilence (in the name of good sport), Gladiator stands as one of the most excellently crafted films and will likely hold its place in time as one of the greatest war/action films ever. Ridley Scott got this one right"
    },
    {
      "rating": "10",
      "text": "\"Gladiator\" definitely is a classic-modern epic film as it combines a simple, but moving, story with beautiful scenery, filming, direction and score â"
    },
    {
      "rating": "10",
      "text": "It is best movie i ever watch. aswm dialogues,screen play is good. One of the rarest movies.\rIt is an inspiring, mesmerizing, beautiful, action packed flick. It is about strength, honor, courage betratal, ruthlessness, survival, and even incest! This is the type of movie thatll motivate you to fight for what you live for because as gladiator said it best \"what we do in life, echoes in eternity\"."
    },
    {
      "rating": "9",
      "text": "The Oscar-winning motion picture is full of style, the intense-graphic combat sequences are surprisingly epic and well-performed, full of ambition, and well designed from the beginning to the end."
    },
    {
      "rating": "10",
      "text": "Stop just Stop... this is masterpiece... this is one of few movies that impressed me, it even put some tears in my eyes. I will risk and say THIS IS ONE OF THE BEST MOVIES.Stop complaining, this the best movie from 2000-2011..."
    },
    {
      "rating": "10",
      "text": "i dont get the critic reviews this is the best movie ever a stunding story nice places and a extreme ending where you can cry if you like good music extreme good acting its just awsome if you dident so the movie yet go watch it now"
    },
    {
      "rating": "10",
      "text": "Best movie of all time enough said. Acting was brilliant. It shows chivalry and the heart of a champion in every scene. It's intense emotional triumph. Should have won more oscars."
    },
    {
      "rating": "10",
      "text": "to this day I still think this is the best movie that has ever been made, I love this film and I don't see that changing with all these terrible films that are coming out, if you have not seen this film you need to"
    },
    {
      "rating": "10",
      "text": "I loved this movie!!!! I just can't believe Roger F-ing Ebert didn't."
    },
    {
      "rating": "10",
      "text": "This movie captured the brutal life of Romans and how honor and fame could be accomplished by being the best gladiator. Russel Crowe did a brillant job."
    },
    {
      "rating": "8",
      "text": "It's worthwhile to start saying that the movie is not. Ie: \"Gladiator\" is not merely a collection of fighting at the Coliseum in Rome, more or less of spectacular via special effects. And what is it? A real tragedy of inner power, underpinned by a subtle and intelligent argument that favors relations backstage and shades of political discourse. Gladiator is a true intimate epic, served by some remarkable compositions of his cast, especially almost inevitable for Joaquin Phoenix, impeccable characterization of a tissue power of ambition, blindness and fear. Ultimately, we are faced with a symphonic work whose themes and variations are wonderfully scored music by Hans Zimmer and Lisa Gerrard. Moreover, it is always interesting to watch the rising of a star - Russell Crowe."
    },
    {
      "rating": "10",
      "text": "Gladiator never ceases to amaze, even after repeated viewing - there's always something new to savour in this sumptuous historical epic. You're yanked by the toga into Ridley Scott's vision of Ancient Rome right from the off, and first-rate performances from the whole cast (particularly Crowe, Phoenix and Reed), a tight screenplay, a wonderfully emotive score, in addition to  brilliantly choreographed and terrifically brutal fight scenes makes Gladiator a truly spectacular masterclass in film entertainment."
    },
    {
      "rating": "10",
      "text": "This could have been my most favorite movie of all time!!!!!!!!! You people who gave this a 2 or a 1 must have been drunk or something when you watched it."
    },
    {
      "rating": "9",
      "text": "An amazing movie on all fronts - the action is thrilling, and the film gets to you in such a way, that I was shouting at my TV when the guy cheats at the end. Powerful and gripping. Watch it if you like Roman history, or you like action, or you're just looking for an awesome movie."
    },
    {
      "rating": "10",
      "text": "This movie is incredibly good, I dont know what peoples problems are... a 64/100? pathetic. this movie owns... and if you think it was a horrible plot you don't know what a good story is. I don't get into my movies, but even this one made me sad at the end.... and excellent movie overall.... the academy awards say it all, and unlike critics, I trust in the Academy Awards."
    },
    {
      "rating": "8",
      "text": "What a remarkable cinematic journey. A mediocre plot can only get you so far. But with endless battle scenes featuring chariots; the possibilities are endless."
    },
    {
      "rating": "9",
      "text": "Darn good movie. I especially liked the emotionality of Maximus (Russel Crowe). Russel Crowe acts fascinating and in mine opinion ONE of the best (nothing can top Robert de Niro! although he is slowly going down). His dialogue with his rusty voice is impressive. The dialogue between Maxmus and his new black-skinned friend is entertaining. Talking about their family, heaven, god etc. It is a shame that Gladiator 2 will leave Russel Crowe out (he died in the end of the first part), he was the hightlight of the movie. Oh well......"
    },
    {
      "rating": "10",
      "text": "Wow. This movie is terrific. Everything, from the writing to the acting, is sheer perfection. The battle scenes are extremely graphic, but awesome nonetheless. If you have never seen this movie, I strongly suggest checking it out as soon as possible. Trust me, you'll love it."
    },
    {
      "rating": "10",
      "text": "This is truly the best movie I have ever seen. It was so good, I watced it another time after I saw it the first time. And also, this is the first movie in which I got the whole theme, I usually have to be told. The ending was quite a surprise to me, I was expecting it to end in a completely different way (I think this would happen to you, only if you know your Roman history. The ending is very emotional, and dramatic. I really reccomend this movie to anyone. Don't pay any attention to those who give this movie below and 8.5/10. They don't know what they are talking about."
    },
    {
      "rating": "8",
      "text": "I cant believe this movie is a 64 from the critics. I wouldn't go as far some people to say this is the best film ever, but one of the top ones of this decade. A great cast and clever filming by Ridley Scott really put this screenplay together into an engaging film."
    },
    {
      "rating": "10",
      "text": "This is, in my honest opinion, this is the best move of all time. I watched it again today, and this was the first movie that really hit me. It is amazingly beautiful, in my opinion maybe even better than some movies that are being recently made. The fighting scenes are spectacular, and left me utterly speechless. The critics are 100% wrong, this movie does not deserve a 64, it deserves a 94. A great story line, I cried at the end."
    },
    {
      "rating": "10",
      "text": "Cant believe that this film is rated with a 64 review know. One of my favorites."
    },
    {
      "rating": "10",
      "text": "Absolutely outstanding. The screenplay, special effects and actors. What more can a movie need to be successful. Th only problem with some critics, is that they do not know when a good movie hits them. A top 10/10. So watchable over and over again."
    },
    {
      "rating": "10",
      "text": "Its so nice to the point , no words can describe it."
    },
    {
      "rating": "10",
      "text": "I've rated an astronomical amount of movies in my life time. However, this movie I can say is easily the best movie I've ever seen, a classic, and a memorizing movie that will live with me forever. Russel Crow is amazing and the directing is fantastic! If you haven't seen this movie you haven't lived."
    },
    {
      "rating": "10",
      "text": "This is the best movie ever made. Not to mention it's the only succesfull epic roman film since the golden age of Holltwood and the 60's. It strikes you from many different angles and what to say about Russell,there is some power in his performance,simply unbelievable STRENGTH AND HONOR"
    },
    {
      "rating": "10",
      "text": "This is the best movie i have ever seen!"
    },
    {
      "rating": "10",
      "text": "One of my favorite movies, the dialog is superb. Outstanding performances acting."
    },
    {
      "rating": "9",
      "text": "Heart breaking, sad, violent, and realistic...my type of movie. The story of a Roman general being sold into being a Gladiator after being betrayed. What a great story line, loved the sword swinging action, the romantic and saddening ending. The amazing visual effects. This is a movie you won't get tired of."
    },
    {
      "rating": "10",
      "text": "How the critic get this wrong. One of the best films ever! It was emotionally moving and quite a drama - despite its stunts and action scenes. From a pure moviegoer standpoint, what stands out most is the powerful connection the film makes to its audience - Roman heroism and epic dramatization was well done...not overdone."
    },
    {
      "rating": "9",
      "text": "One of the best movies I've seen. It has well executed action sequences, an interesting, yet simple plot, great characters, superb acting. My only problem is that they made Commodus' personality detestable to such an extent. I don't expect to like the villain, their actions, or their beliefs, but I usually like to see some sort of redeeming quality. But even in that case there was a rational explanation for his behavior, and his character was well written none the less. I don't know what movie that guy at the Washington Post was watching, because there is no way he could have rated such an epic movie so poorly. I guess the user scores ratings and the sheer amount of awards the movie has won(wiki says its won 48 different awards) are more accurate depictions of the movie that the reviews that were published. I wouldn't say the movie is perfect, but."
    },
    {
      "rating": "10",
      "text": "You people who voted low for this film make me physically sick. what kind of twisted view must you have to not enjoy gladiator when about half of these user reviews are solid tens, and the rest mostly eights and nines. if someone chose not to watch this film due to a poor metacritic score, they would clearly be sorely losing out. the best film of all time, except the truman show."
    },
    {
      "rating": "10",
      "text": "One of my favorite movies. Almost makes me cry every time at the end, and I honestly don't cry easily to movies. Also, the washington post is apparently run by idiots. there are 2 reviews here by the washington post, one for 80 and one for 30. Moreover, the fool who rated it 30 points is for some reason completely biased against it. /rant ."
    },
    {
      "rating": "9",
      "text": "I think this movie is amazing it is packed with action and it is just an awsome story. Th only problem is that the beginning is kind of boring."
    },
    {
      "rating": "9",
      "text": "Late in the second century Maximus Meridius leads the Roman armies fight in Germania with the knowledge that ailing Emperor Marcus Aurelius has earmarked him to run the empire alongside the senate when he passes away. His son however has other ideas. Angered by what he feels is a betrayal he sets about exerting his murderous authority and Maximus, having refused to swear his loyalty, only narrowly escapes with his life. Bent on vengeance Maximus later returns to Rome as a gladiator hoping to take down the new emperor.\r Aside from a few plot holes Gladiator is peerless in its quality. Russell Crowe, always an excellent actor, plays his defining role, his presence commanding attention throughout the film and the supporting cast do well not to be completely overshadowed by his performance. The action sequences are brilliantly shot and staggering in their realism as all the gory details are shown. As the film reaches its climax this all combines to make it impossible to not root for Maximus in what is arguably the movie of the decade."
    },
    {
      "rating": "9",
      "text": "Rightly bestowed with the title of modern classic, this film is the best of the swords and sandals genre. Few films have battle scenes quite as epic as this, and few films have a central storyline quite as compelling as this does. Every performance in this is spot on, from Joaquin Pheonix's ridiculously evil sneering Ceaser, to Russel Crowe's honest rugged main performance. A true modern classic."
    },
    {
      "rating": "7",
      "text": "I didn't watch this in the cinema when it came out. I thought it sounded silly. On my first watch, I ejected the DVD after ten minutes because of the historical inaccuracies. However, a lot of people *love* this movie so I thought I should give it a second go. It's... OK. I think a lot of fans give it high ratings because of the fight scenes but I found them underwhelming because of the overuse of CGI and fast cuts. On the plus side, the acting is top-notch. It was good to see Richard Harris and Oliver Reed in another historical drama."
    },
    {
      "rating": "10",
      "text": "One of the best movies ever made, no one will forget this one. Gladiator is an accurate display of the struggle of gladiators and the extent of power of the Roman empire. It also shows the amount of power the emperor had and the amazing story of Maximus and his final struggle for justice."
    },
    {
      "rating": "6",
      "text": "Adorei o filme cheio de aventura romance ação, em relação ao original e melhor\r mas ainda gosto de filmes de Época onde mostra algo mais real ok valeu"
    },
    {
      "rating": "9",
      "text": "The virtue and the rye, the leitmotivs of this beautiful piece of art. A man fighting for an idea, not for revenge, but for honor, for the glory of the empire. A man that throughout his veins flows the genuine royal blood, despite the fact he is from a provence conquered by Romans. Betrayed by the state he fought for, the true gladiator reborn from it's own ashes unleashes the warrior led by courage, wisdom, justice and temperance. A story of everyday life, in which every noble goal must succeed."
    },
    {
      "rating": "10",
      "text": "I really don't understand why people would rate this movie a 0 or 1 out of 10. I love the performance of Russel Crowe and the storytelling and memorable action sequences make this movie one of my alltime favorites."
    },
    {
      "rating": "10",
      "text": "My favorite movie at the time it came out.  Great action, great story, great effects at the time, good acting for the most part.  Everything came together in a perfect storm to make this movie great."
    },
    {
      "rating": "8",
      "text": "Gladiator was a very dramatic and very nice movie where Russell Crowe has excelled , and where the history of the gladiators of ancient Rome were the main course for the Oscar win in 2001."
    },
    {
      "rating": "9",
      "text": "Ridley Scott rarely disappoints with his films. All of them, including the unjustly-maligned Legend, are visually stunning and just show the director's artistic genius. Gladiator should be up there as one of the best films he's done, if not the best. Almost everything on screen is very graphic, making some scenes upsetting to watch, but the visuals are just outstanding. The music score by Hans Zimmer just adds to the drama that is already there in the script. which is well written and rather Shakespearean. The performances were brilliant, especially Joaquin Pheonix and Oliver Reed. Russell Crowe is wholly convincing in the title role, and Richard Harris and Connie Nielson are also excellent. The costumes are brilliant, as well as the sets. In conclusion, Gladiator is a near masterpiece, only marred by some upsetting scenes. 9/10 Bethany Cox."
    },
    {
      "rating": "8",
      "text": "A muscular and bloody combat picture, a compelling revenge drama and a truly transporting trip back nearly 2,000 years, Ridley Scott’s bold epic of imperial intrigue and heroism brings new luster and excitement to a tarnished and often derided genre that nonetheless provided at least one generation of moviegoers with some of its most cherished youthful memories.\r Jagged and impressionistic in a way clearly influenced by “Saving Private Ryan,” 10-minute opening battle is a savage spectacle, as General Maximus (Crowe) commands his troops to “unleash hell” on their overmatched adversaries with a deluge of arrows and flaming canisters that set the barbarians’ protective woods on fire.But as external conflicts are put to rest, internal trouble is only beginning. The arrogant and unbalanced Commodus (Joaquin Phoenix) arrives at the front, along with his beautiful older sister, Lucilla (Connie Nielsen), just in time to learn that his ailing father (Richard Harris) has named the triumphant Maximus his successor as emperor. For his part, Maximus, a Spaniard who has never seen Rome and, far more important, has been separated from his wife and son for nearly three years, wants no part of this plan.But Maximus makes the mistake of spurning Commodus. After killing his father in a fit of jealous spite, the insecure new emperor orders the execution of the popular general. The resourceful Maximus escapes this fate but reaches home too late; when he arrives, he finds his wife and son dead, his farm torched. In the poetic manner of Sergio Leone, Scott uses a man of action’s bitter and idealized memory of his lost family as a motif and a motive for the single-minded pursuit to which he devotes the remainder of his life.\r At the 45-minute mark, action shifts to a distant North African outpost of the empire, where the captive Maximus is taken as slave. Purchased by gladiatorial entrepreneur Proximo (Oliver Reed), Maximus conceals his true identity but, when thrown into the arena for the first time, he fights well as a team with the African Juba (Djimon Hounsou), who will become his closest confidant.\r In the meantime, of course, Maximus must survive arena combat that is heavily rigged against him. The gladiatorial contests are tense, dynamic and brutal, to be sure, and probably no less or more violent than most viewers would want them to be. Less fetishistic about the weaponry and modes of fighting than “Spartacus” and some other Roman combat pictures of yore, “Gladiator,” with its fast flurries of action and jump cuts, emphasizes the ferocious speed and urgency of every move in the arena, to the slight detriment of spatial unity and action continuity; in terms of the classical building of tension in a one-on-one fight, the standard is still the Anthony Quinn-Jack Palance battle in Richard Fleischer’s “Barabbas.”\r But “Gladiator” enjoys a solid foundation in the strength of Maximus, the vividness of its evocation of the Roman world and the integrity of the story arc. Script by David Franzoni, John Logan and William Nicholson shrewdly appropriates touchstone moments from previous epics, just as it also cuts down the talk to a minimum when possible; there is none of the windy speechifying that ground many an epic to a halt in decades past. The action is presented in strictly Roman terms, with none of the Judeo-Christian angle so common to the genre in the ’50s.\r The film revels in both the glory and the horror that were Rome. Proximo’s luminous description of the Colosseum to Maximus beautifully conjures an image of what was then the center of the universe, and the games themselves are presented in context as gaudy, lowbrow entertainment. Countless details in Arthur Max’s brilliant production design and Janty Yates’ highly diversified costume design are offered up in wonderfully offhand fashion.\r But the scene stealer, in his last role before his death on location, is Reed, who hadn’t brought such relish to a performance in years, and to whom the film is dedicated. Proximo’s excitement over being able to return to Rome brings out the old man’s boyish delight in his profession, which he insists is just “entertainment,” and Reed clearly reveled in both the physicality and the modestly hammy opportunities the part presented. Pic reps a great sendoff for him and a fine way to be remembered.\r Production represented a gargantuan undertaking in four countries; even if the film is a big hit, it’s unlikely that the genre will come back in any significant way due to the costs involved. CGI effects have allowed numerous sets, notably the Colosseum, to be enhanced in size and spectacle value; the stunts, fights and battles are as forceful and realistic as anyone could want, John Mathieson’s widescreen cinematography is magnificent, and the pacing across 2½ hours is well modulated."
    },
    {
      "rating": "9",
      "text": "To defend family and revenge for it - the most attractive feature of a person. A man is a symbol of power, but it is beautiful if used properly. In the name of values, you fight, defend, live for them and because of them. Gladiator shows the strong, beautiful face of the person."
    }
  ]
}