{
  "id": 196,
  "title": "The Help",
  "starring": [
    "Emma Stone",
    "Viola Davis"
  ],
  "runtime": 146,
  "genre": [
    "Drama"
  ],
  "description": "Aibileen Clark is a middle-aged African-American maid who has spent her life raising white children and has recently lost her only son; Minny Jackson is an African-American maid who has often offended her employers despite her family's struggles with money and her desperate need for jobs; and Eugenia \"Skeeter\" Phelan is a young white woman who has recently moved back home after graduating college to find out her childhood maid has mysteriously disappeared. These three stories intertwine to explain how life in Jackson, Mississippi revolves around \"the help\"; yet they are always kept at a certain distance because of racial lines.",
  "year": "2011",
  "rating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/3kmfoWWEc9Vtyuaf9v5VipRgdjx.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "Sweet Black AngelsTelling the story of the end of segregation in the American South through black maids in Jackson Miss. makes this film moving, personal and a tad superficial. Much has been made of the patronizing structure-a young white woman, Skeeter, leads the women to contribute to her book -showing the strong, stoic black women as incapable or unwilling to stand up for themselves. Viola Davis and Octavia Spencer give stand out performances as the maids, and wring all the audience sympathy you could imagine. Of course, given that this is a feminist tale, all the men are bastards or invisible, most of the women on the right side of the argument are brave and wonderful, and the women on the wrong side, poor deluded fools. Allison Janey -of West Wing fame- plays Skeeter's mother - the only 3D character in the piece, a genuinely confused character, and is a core part of the story of redemption.This book and film is really about current US politics. The fight between right (Obama, the first Black President) and wrong (the same Southern fundamentalist racists we see today) is plain to the viewer, and like the historic 1960's battle, the audience is invited to support the right cause.I liked the film despite its flaws, as I was on the right side of the argument then, and I still am. By the way, though I lived in NY in the sixties, I had a black maid when my mother went back to work in 1961. My own saint, Annabelle (who looked just like Minny) was fired in 1964 for stealing money after drinking a bottle of whiskey she pilfered from our house. I loved her anyway."
    },
    {
      "rating": "8",
      "text": "In my opinion, this is a movie well made. The acting is pretty good, especially from the actresses who played the maids. The movie also gives us a glance at how african americans were treated back in the 1960's, a time where african americans still did not have the rights they deserved. The Help is a movie worth seeing."
    },
    {
      "rating": "10",
      "text": "One of the most inspiring movies I have ever seen. The only flaw is at times bad dialogue, but otherwise, this movie is a must-see and is a true Oscar winner."
    },
    {
      "rating": "10",
      "text": "what a good movie about  someone who helps this maid through segregation  in the 50\"s . Good Movie . grade A+ .................................................................."
    },
    {
      "rating": "9",
      "text": "I can honestly say I thought this movie was going to be incredibly sappy and cheesy, and was not much looking forward to seeing it.  While it did tidy-up the plot a bit too neatly towards the end, for the most part it felt surprisingly real, at least within the trappings of the film. You should go into the movie thinking that it is a work of fiction based on a real time period in U.S. history, and not look for everything to seem absolutely realistic within the context of that actual time period in U.S. history. The acting was superb across the board. This should be the film that makes Octavia Spencer and Jessica Chastain stars; their characters felt like breakout roles for them. This should be the film that makes hearthrobs out  Chris Lowell and Mike Vogel, two stunningly gorgeous men who seem to have real acting chops to match. This film should remind us what cinematic treasures Cissy Spacek and Cicely Tyson are. This film shows that Emma Stone and Bryce Dallas Howard have more impressive acting ranges than one might think based on their past work alone. However, the star of this film is Viola Davis, who is deserving of serious Oscar-buzz. Emma Stone may have top-billing for the film, but Ms. Davis's Aibileen Clark is the heart and soul of the film. You laugh with her, you cry with her, you get angry with her. Its one of those rare performances that breaks your heart and at the same time gives your heart hope. It is one of the best performances I have seen in a film in awhile, and should vault Ms. Davis on to the A-List of actresses working today. Besides the performances, the sets, costumes and all other technical aspects of the film seemed stunningly authentic. As I said before, if there is anything to fault this film for, its that the storylines wrap-up a little too neatly at the end. It also may bother some that the Emma Stone character Skeeter leaves for NYC while Minny and Aibileen stay behind in Mississippi, but at least the filmmakers take the time to address that situation in the film, with Minny and Aibileen urging Skeeter to go against her feelings that she is betraying them by leaving them there. In the end, she leaves and Minny and Aibileen are still in Mississippi, still dealing with the harshness of discrimination. Yes, that frankly sucks, but it is probably fairly realistic to that time period, and there is some hope given to Aibileen and Minny at the film's end, hope for a better life with greater dignity. This film was made to be inspiring and uplifting, and it left me with those feelings in spades."
    },
    {
      "rating": "7",
      "text": "t's an entertaining movie for white folk who need to convince themselves that they rise above the trashy white southern women depicted in the film. The black women are noble, and all, but one, white woman is a caricature of southern segregation and divided class. It's another chick flick of the south along the lines of \"Steel Magnolias\" and \"Fried Green Tomatoes.\" The subject matter: the economic enslavement and debasement of poor minority women to a racist elite is a far too serious and shameful part of our history to be taken this frothily. But I guess that like \"All In the Family\" if it takes comedy to get our history of racism, however briefly, into the consciousness of those too busy to notice then that's what it will take."
    },
    {
      "rating": "9",
      "text": "As usual with book-to-silver-screen adaptations, THE HELP was not quite as good as Kathryn Stockett's novel off which it is based.  However, it was very faithful, at times funny, and, like the book, extremely poignant."
    },
    {
      "rating": "9",
      "text": "Every minute while watching The Help, I was constantly surprised. At first, the movie seemed to me a simple story a young woman trying to become a well known writer collecting testimonies of black maids; but is so much under it. There is a society that lives in a perfect but paradoxical situation. This is formed by small families, in which neither of the parents have time to raise their children, so that job is done by a black maid, which in some cases are treat like a slave. The relation between the housewife and the maid is ruled by an unbreakable protocol; the black employees must use another bathroom than the family, different dishes to eat, not share food or drink with a white person and not touch a white adult because they can spread disease; but, and here is the paradox, they can take care of the children. Another paradox is that the white people treat the blacks as if they were animals, when twenty years ago, they criticized the Germans for their treatment of the Jews. I know that those things are on different levels, but both violet human rights.There are two things in the movie that are remarkable: the influence of the society in a single person and how that can make the difference between someone who discriminate black people (in contact with the society) and someone who treats them as equals (isolated from the society). The other thing is a concept, the idea that a small action (gathering stories or telling your own) can mean a big change in human mentality.This film deals with issues from different perspectives, but that is only complete with dazzling performances and a strong screenplay."
    },
    {
      "rating": "10",
      "text": "I like it cause Emma is in it. Haha :D But I think its a great movie. Aight? So.. Yeah.\r A great movie. A must watch. I really need to watch this. ugh ^^"
    },
    {
      "rating": "9",
      "text": "57 yr old white guy.  Thought it couldn't be that good.  Boy was I wrong.  Stayed up late to watch it all.  Give the Best Actress award to any of the women.  Loved it.  Thanks for making it."
    },
    {
      "rating": "9",
      "text": "It was a very good movie that depicted the lives of black maids back during the time of Martin Luther king jr. It shows their rough lives and how a woman plans on publishing a book about their lives and experiences. The black people were treated very inhumanly in those days, sometimes seen as property. This movie did a great job at showing all of this happening. The acting was great, the history was accurate, and you felt part of their story. The ending was happy and sad, but you enjoyed it the whole time. It had many very funny scenes too!!! Many that you will be repeating for days!!!!"
    },
    {
      "rating": "10",
      "text": "My wife grew up in the south and wanted to see this movie.  Not excited to be there, I expected it to be melodramatic and unmoving.  The story is all too real even if the characters are fictional.  The acting is excellent.  It is the story of real courage in difficult times.  Even if as predictable as Titanic, it is well done and worth seeing."
    },
    {
      "rating": "10",
      "text": "I love this film is very interesting, I suppouse that the rhytm can be slow, but this film have a drama part, comedy, is a big film, with an incredible cast. I love The Help."
    },
    {
      "rating": "9",
      "text": "A movie packed with powerful performances by all the actresses. The movie brings out the overly denied message of discrimination; the movie is set in the state of Mississippi, known for its unfair treatment toward the colored people. Skeeter's an aspiring writer who needs one big break to enter the world of writing and decides to write about the unfair treatment of the women in her town, with the help of a domestic maid and as the bigotry exacerbates, more women come forth to narrate their tale of prejudice and wish anonymity. It's an equal mixture of sombre and humor. Octavia Spencer was rightly awarded the Oscar."
    },
    {
      "rating": "5",
      "text": "The Help is well intentioned. That doesn't make it any less racist in its (fictional) storyline based on the south in 1950's America, with the idea that only a white woman can help black women find their voice. The only reason to see this film is the talent put forward by the electrifying Viola Davis and the gutsy performance from Octavia Spencer. Other than that, there's not much here with substance, and the more horrific events of the 1950's seem to be glossed over."
    },
    {
      "rating": "6",
      "text": "It is incredibly hard to sit through because you get so angry, but its incredible performances and comedy make up for it. I almost gave this movie a bad rating,but I give this movie 60% of a good movie."
    },
    {
      "rating": "2",
      "text": "\"The Help\" tells us nothing new. Anybody who didn't know what it had to say has been in a coma for over half a century. But that isn't my problem with it.Rather, it is a mawkish, sophomoric, soporifically paced, predictable, grotesquely populated, \"young adult\" CHIC FLIC. Think of sitting through \"Steel Magnolias\" with a mixed race cast and \"We Shall Overcome\" as its incidental music. Twice. Non-stop.We need a new rating system, one that advises single adult males that attending particular movies can be injurious to their sanity. Since I was stuck in the middle of a full row, I refrained from disturbing my neighbors and so sat through the entire four and a half hours of it. (It wasn't that long? It sure seemed like it.) My desire, after the first fifteen minutes, was to leave, running to find the nearest sports bar as an antidote. And I hate sports bars."
    },
    {
      "rating": "1",
      "text": "The director, Tate Taylor, knows exactly how he wants the audience to feel about every character and every scene.  He leaves almost no room for you to make up your own mind and so the deck continually feels stacked.  You're not watching reality unfold, you're watching propaganda.  Bryce Dallas Howard's character is set up to represent the racist white south.  But her character is so devoid of any redeeming qualities that she feels like a straw-woman, and the effect is that the movie says very little other than \"bad people are bad\".  Most insulting to the audience's intelligence, the last 45 minutes of the film consist of 6 or 7 manipulative tear-jerk-er scenes in a row.  Complete with swelling \"please cry\" music, a forced break up scene, a \"group standing up and applauding\" scene, and a \"crying child saying goodbye\" scene.  No movie cliche' is spared.  I think this would be less objectionable in a film about young lovers, or a boy and his dog.  But when you are making a movie about \"the help\" in the south, a minority group whose story has (according to the premise of the movie) not been told, then you owe it to them, I think, to just tell the story and leave out the \"tear-jerk-er\" play book.  So I'd go beyond saying this is a bad movie.  It is a socially irresponsible movie that sets itself up to be something it isn't: the story of \"the help\".  Peeking through all the stupid Hollywood tricks is Viola Davis, whose performance suggests to us that underneath this trite movie was a real complicated story to be told, about real people.  It is rare that an actor can transcend material like this, and the movie is worth seeing just for that amazing feat.But besides all this, you know a movie has no interest in reality when the strikingly beautiful Emma Stone, in full makeup and fashionable clothing, is sold as the 23 year old girl who has never been on a date.  Change that plot point or change the actress."
    },
    {
      "rating": "0",
      "text": "This movie is **** racist. It pisses me off that it has the audacity to abuse actual clips from the civil rights movement. **** this movie, it is condescending, patronizing, artificial, superficial, and pandering. The worst kind of movie, one that tries to be about big ideas when it couldn't even manage small ones. Stupid, stupid movie. It reminds me of Uncle Tom's Cabin all over again. WTF is all I have to say."
    },
    {
      "rating": "9",
      "text": "The trailer really undersells this film. Underneath a seemingly light-hearted shell, the writer and director do an excellent job in infusing a sense of impending doom, danger, and sickness in this little Southern community. It would have been an excellent companion piece to Mississippi Burning.  I don't mean to suggest that the film overly intense - it's not.  But amidst the humor and heart-warming moments is a very \"real\" sense of the ugliness and inequality of the times which I didn't expect.  Octavia Spencer and Viola Davis are incredibly good in this movie, and I'd be shocked if both are not nominated for a bunch of year-end awards. Who would have thought that a movie this rich would have been released in August??"
    },
    {
      "rating": "10",
      "text": "â"
    },
    {
      "rating": "7",
      "text": "What happens in Mississippi, stays in Mississippi. For the next few weeks, as part of their missing persons investigation involving three civil rights workers, last seen registering black people to vote, Agent Rupert Anderson knows that some tough sledding is in store for he and his younger, somewhat green partner, so to lighten the mood, he sings a KKK rally song, which inspires Agent Alan Ward to complain that he \"can do without the cabaret,\" because the Kennedy boy just doesn't \"share [his] sense of humor.\" In kind, the former redneck sheriff responds, \"Sometimes that's all you have left.\" Later in Alan Parker's \"Mississippi Burning\", after the church bombings and lynching, you know, your garden variety Klan mischief, Ward asks, \"What's wrong with these people?\" clearly aghast at the unrelenting and pervasive ugliness of your typical segregated town. Now he understands that the old man never meant to be ha-ha funny. In record time, he reaches the same point of resignation which inspired Rupert to drive past the state limits, so many years ago. \"These people crawled out of the sewer Mr. Ward, maybe the gutter is where we should be,\" yells Anderson, when he tries to convince the principled straight arrow FBI man that the time for diplomacy is over. Being black, Minnie knows the feeling first-hand, so the maid gets down and dirty, just like her enemies, when she decides to fight the power. \"The Help\", in addition to being lambasted by critics for telling a black story from a white perspective(the same kneejerk reaction that greeted \"Mississippi Burning\", even though the 1988 film largely transcended its racially-condescending narrative trappings, unlike other movies of its ilk, such as \"Ghosts of Mississippi\" and \"The Long Walk Home\"), the detractors also balk at its comedic moments. True enough, Jim Crow is nothing to laugh about, but, to reiterate Anderson's sentiment, \"sometimes that's all you have left,\" therefore the maids laugh so as not to cry, the same defense mechanism which the filmmaker, and also, the audience uses to combat the horrors of institutionalized racism. So while the maids conspire in the kitchen against their white employers by laughing at Hilly's practice of \"puttin' pencil marks on the toilet paper,\" it's only because Minnie chooses to put on a brave face for her best friend Aibileen. Like Agent Anderson, they laugh out of resignation. In the face of such abject humiliation, what other choice does the maid have? If she cries about it, then Hilly Holbrook, the housewife-turned-reactionary social activist who drums up neighborhood support for separate toilets, comes out the victor in the whole \"coloreds only\" bathroom dialogue. Worse still, were Minnie to get mad about the employer-enforced ban on having access to the indoor facilities, she'd probably end up in prison, just like Sofia in \"The Color Purple\", when the outspoken \"Negro\" insults the mayor's wife, and then for good measure, knocks out her husband. A person of color simply can't attack racism in that fashion. Agent Anderson can. because he's white, and in the barber shop scene from the Parker film, he does, purposely nicking Clinton with a straight-edge razor, before shoving the deputy's face against the mirror, and through gritted teeth, says, \"You got a stupid smile, you know that, pal?\" which is to say that the sheriff's right-hand man has a s*it-eating grin. Since Minnie's arsenal for revenge precludes any sort of physical contact with her employer(conversely, the FBI agent was just getting warmed up; he ends up tossing Clinton around the shop like a ragdoll), not without some serious repercussions, so \"The Help\" employs the maid with the next-best available weapon: comedy, in order to settle an old score, while at the same time, maintaining her status as a free woman. Given that the social context is segregated Mississippi, and  not swinging London(the setting for \"Austin Powers: The Spy Who Shagged Me\"), where eating s*it has a chance of being funny, the chocolate pie which Minnie laces with her own feces, in a sense, acts as a performative violence, and not the puerile hijinks that the film's critics purport it to be. This is not a gross-out comedy, after all; it's a gross-out drama, in which the grotesquerie masterminded by the subjugated black female can't begin to match the grotesquerie of the racist milieu that she is powerless to overcome. To be fair, the critics have a legitimate gripe, in regard to the writer as being another example of the trope familiar to this genre: the white savior who is going to save black mankind, but unlike \"To Kill a Mockingbird\", where the film is told through Scout's eyes, the narrative belongs, not to Skeeter, but to Aibileen. \"The Help\" ends with the suggestion that the maid will write a book of her own. \"The Invisible Woman\", perhaps, an answer to the 1952 National Book Award-winning novel by Ralph Ellison."
    },
    {
      "rating": "5",
      "text": "This movie boils down to a feel good movie with some good acting. the acting and set locations and film methods save an otherwise LifeTime channel  movie."
    },
    {
      "rating": "5",
      "text": "The Bottom Line:  Viola Davis and Octavia Spencer save this film from being a two-dimensional pat-on-the-back for non-racist white people in the 1960s.  Every time the story gets a little too sappy and cut-and-dry, Davis' Aibilene returns to the screen to bring a complexity to the film that I don't think actually exists in the original book.  The film is wildly uneven, I think precisely because of the skilled, seasoned Black actresses' ability to create accurate complexity out of cardboard characters contrasting with much younger, less experienced white actresses unable to the same. In the end, it succumbs to its movie-long desire to tie a nice bow around a situation that, in 1964 in Jackson, Mississippi, was everything but harmonious."
    },
    {
      "rating": "8",
      "text": "The good performances outweigh the flaws in this film.  All the main character performances are excellent.  The rest of the cast are interchangeable bigoted caricatures, which gives the film a feeling of unrealism at times.  My mother was born and raised in Mississippi and I can tell you not all southerners felt the way the bigots in this film do, although watching this film you wouldn't know that.  It would have been nice to have one or two more women, other than Skeeter (the main character), rebel against these atrocities.  I thought they were going to do that with the Celia character but she never really develops enough.  Still, the acting is great and you really feel for these people and root for them.  This is the kind of movie that Oscars love.  I just hope they don't forget Bryce Dallas Howard's fantastic performance as the hateful bigot, she was fantastic.  Many times the hateful people in films get ignored at Oscar time.  Lastly, if you are into interior design you will enjoy looking at the 1960s designs of the home's interiors.  They did a great job of set design.  It's kind of funny looking at the cars because they are all pristine!  Since they had to use restored cars from that time period there isn't a speck of dust on them!"
    },
    {
      "rating": "4",
      "text": "\"To Kill a Mockingbird\" came out 50 years ago and the film (and most likely the novel) are far superior to this film in every way.  It wouldn't be fair to compare this to such an obvious classic except for the fact that I keep hearing rumors of it being Oscar worthy.  The classic film, of course, has the iconic 'white savior' played by Gregory Peck, but the character is portrayed as a complex man of pure ethics grappling with the issues of his time in a way that isn't clueless about his actions and understands full well the danger he's placing himself and his family in when he decides to cross the hard coded color lines.  This Skeeter character is more concerned with advancing her career by being controversial than making real change.  In short this film is a Disnified version of 1960's race relations, pretty to look at and light on meaning.And if you haven't seen \"To Kill a Mockingbird\", do it ASAP.  You'll be shocked at how it doesn't hesitate to challenge the audience.  After all this time it still has the power to really make you think about Race and Class."
    },
    {
      "rating": "0",
      "text": "The movie, had one big problem. It was boring! As I started watching the movie, I knew how it was going to end. There were no suprises, or twists. Just a boring story, with some characters who you should feel sorry for and some characters who you should feel angry against."
    },
    {
      "rating": "5",
      "text": "The actresses all had their own part to play in this sugar-coated brightly coloured drama, and I can certainly say for a fact that, for the time these people are living in, I thought it looked quite mawkish in terms of the good intentions of the few whites that helped the black servants. These actresses are incredibly talented, I'm not denying that, but that certainly does not dispute the fact that many of them had to act like they were probably living in a gingerbread house and wearing sweets, instead of living in normal houses surrounded by poverty and racism. Westernised? Yes. But fascinating? Of course. It's the interpretation that matters, but the people who made this film just didn't seem to get it quite right."
    },
    {
      "rating": "0",
      "text": "this movie's too hard to understand..... i think that a movie shoud have  Understandable Plot,Clear Motive, and  a movie should also be entertaining.i think this movie looked more likely a documentary than a movie."
    },
    {
      "rating": "8",
      "text": "Really good movie, great acting, really recommend it. In other news, I am pretty sure that in 40 years or less there will be a movie similar to this, maybe titled The Friends, but centred on gays. Humans never learn."
    },
    {
      "rating": "10",
      "text": "Surely, this will be among the bests for this year and of the decade. Great acting from the cast--perfect ensemble. Great story, great screenplay. Looks like this will be one of the front-runners in the 2012 Oscars.movienotesbook.blogspot.com"
    },
    {
      "rating": "5",
      "text": "Amid much fanfare I reluctantly watched The Help. Unless it was a true story or based on such, the subject was uninteresting. Yet I gave this long film a shot. The idea of black women raising rich white children in the south, is not foreign even to those of us in the north. At one time we had such a person but more a helper not a parent substitute. The characters seemed stock and what happens is rote. Some performances were very good especially by Ms Davis, Ms Spencer, and Ms Chastain. There are no surprises here. It seems to have struck a chord with women but it could not sustain my interest for 2.5 hours. In summary, some strong performances, mildly interesting subject, but mundane and too long."
    },
    {
      "rating": "3",
      "text": "The Help is just another racial movie about the past. when are we going to make movies that are different. yes there was some strong acting but i can't get over the fact it seems there are many of the chessy kinds of movies. time to grow up"
    },
    {
      "rating": "5",
      "text": "A sappy melodrama, that emphasizes far too much than the light tone of the dialogue and characters can handle. For one thing, it was too cute, too much of the emotional side of race, so much that it made me almost queasy. The acting is either at par or above par, depending on the character. Octavia Spencer is the light at the end of the tunnel; her vulgar,obstinate, and disdainful Minny has both comedy and drama thread into the character. Jessica Chastain is the lantern, with a cutesy and light-hearted role. That being said, Viola Davis, Emma Stone, and Bryce Dallas Howard are just a few matches. The film itself, is quite hard to see through sometimes."
    },
    {
      "rating": "6",
      "text": "\"The Help\" has all the right ingredients: a moving story, excellent acting, serious drama, but also charming humour. Indeed, it manages to succeed on many fronts. While it surely does not bring anything new or revolutionary to the film world, it is a definite feel-good film, despite its thematic. This, however, is one of its main problems too. It manages to diminish the civil rights movement to the easy-breasy work of good-willed white people, while taking away all agency from the African Americans. Yes, it is their story that is told, but it is only told due to the willingness and enlightenment of the white saviour woman, played by Stone. Yes, I agree with what many people have already pointed out, which is the emotional reality and believability that the actresses got to portray. This is hard to take away from the performers, despite of the problems of the film. The excellent performances by Davis, Spencer, and Chastain were spellbinding. It was very nice to see so many good African American actresses do truly beautiful work and be recognised for it. Technically, the film is very good, but the issues are in the actual story, but that is also the problem of the book. As I said before, the film does not offer anything new, anything daring, challenging, nothing we haven't seen before. While potentially being the most charming film of the year (if one ignores the racial implications), it is definitely not the best one. Nonetheless, it is certainly a good film, with amazing performances that are worth watching, and a story that will warm one's heart or make one very critical of America's view on race and its racialised past (and present)!"
    },
    {
      "rating": "7",
      "text": "The Help is a crowd pleasing bit of fluff that doesn't really dig dip into the true ugliness, pain and complexity of the race issue.  However, it still works thanks to the excellent performances by the entire cast.  Viola Davis, Bryce Dallas Howard and Jessica Chastain are especially good.  But say what you will about whether or not the film portrays the issue of race accurately and honestly, it still wins you over with its enormous heart."
    },
    {
      "rating": "10",
      "text": "I'm only contributing because of the inane responses by some \"viewers.\" Too many people have already lauded this excellent movie for me to add much of substance. I was deeply disturbed by the movie and the inhumane manner in which so many whites treated their black employees. For the Nashville dude who wonders - \"this movie's too hard to understand,\" it's about racism buddy, u know the South. And for the other dude who says we know all this already, it needs to be repeated over and over - this is how Americans treated other Americans because of their skin color! A great movie."
    },
    {
      "rating": "7",
      "text": "Admirable effort but I'm not sure it lived up to all the hype. I'm a pushover for a tear jerker but was never moved to that point. The characters (both white and black) may have been authentic to the early sixties but having not lived through those time they felt sort of cartoonish and unbelievable to me. I hope for a day when stories of racial prejudice aren't entertaining because we can no longer relate to them."
    },
    {
      "rating": "7",
      "text": "While I have not read the book and was frankly a little scared I was walking into another Steel Magnolias (one of the worst movies ever made), I walked out surprisingly pleased and entertained with an enjoyable story, talented acting and characters worth caring about. Follow up discussion with those who have read the book, I learned it was pretty true to the book, but the parts that bothered me as a viewer, such as the lack of depth around Celia's past, a deeper understanding of Minnie's abusive marriage, etc. are all told in a more detailed way in the book.  However, those who have not read the book will still find this movie rich enough in story and an emotional connection to the characters to enjoy this film beginning-to-end."
    },
    {
      "rating": "7",
      "text": "A heartfelt and moving story with terrific performances which deservedly won the best ensemble award in the Screen Actors Guild awards.  The subject matter might be tough but the script is intelligently written and with good use of humour, so it does not feel heavy."
    },
    {
      "rating": "9",
      "text": "A journalism graduate (Emma Stone) decides to write a book from the POV of black maids in her 60s Mississippi town. The story alternates between her upscale friends (who practice an embedded type of genteel racism) and the maids (who quietly suffer the indignities). The performances are all-around exceptional, but Viola Davis' subtle torment is a surefire award winner. The gorgeous period styling and assured direction also contribute to this Oscar magnet: a funny, warm and powerful cinematic classic."
    },
    {
      "rating": "9",
      "text": "Having been a young man during the period the movie is set in, and having an ancestor who served as a major in Union Army during the Civil War; I was pleased to see this wonderfully acted movie dealing with the day to day struggles of good and honest people caught up in a racist discriminatory system that was an affront to all Americans, black and white. The movie paints a poignant and powerful picture of the evils that bigotry and racism create in even otherwise good people. The Help is deserving of a wide audience, and hopefully will receive Academy Award recognition. Certainly Ms. Octavia Spencer deserves to be recognized twice... once for her exceptional acting, and once for her culinary skills."
    },
    {
      "rating": "9",
      "text": "Emma Stone plays Skeeter, a young women who writes a book about the lives of the black maids, who had been treated awfully, in order to help them by expressing their point of view threw the book. I haven't heard of '' The Help '', until a day before it was released, so I didn't had any intention to see it at first. I gave it a chance, and it was a wonderful movie. This might be nominated for best motion picture of the year. The story really captivated me, and you could feel anger for the white people who mistreated black people. That's just not right. Also, in some scenes, the humor was at the right time, which was hilarious. The movie is 145 minutes long (2 hours and 25 minutes), but the plot is so interesting, that you don't feel like it's never going to end. There was this funny scene when Minny Jackson (played by Octavia Spencer) totally owned Hilly Holbrook (played by Bryce Dallas Howard). You will find out when you will see it. Everybody did a great job in their performance. It's a surprisingly good movie, one of the best this year."
    },
    {
      "rating": "8",
      "text": "Moving, realistic, funny, very well crafted, great story I loved, Viola, Spencer and Chestain spectacular, also the cast that made this movie was a charm."
    },
    {
      "rating": "9",
      "text": "This was the most amazingly wonderful movie. I had been avoiding it because I thought it was going to be a depressing downer but I am now so glad that I went to see it.  We need to be reminded that there are everyday incredible heroes that are the reason that we slowly make this world a better place.  The acting was awesome, Octavia Spencer and Viola Davis were great as were Emma Stone and Bryce Dallas Howard. Direction was splendid.  This movie drew me in and kept me there.  Wonderful."
    },
    {
      "rating": "10",
      "text": "I wasn't sure what to expect going into this movie, I really didn't know anything about it other than it was called The Help, that Emma Stone was in it, and it had something to do with maids, and for some inexplicable reason I though it was going to be a comedy, don't ask me why I just thought it was going to be one, don't get me wrong it has it's funny moments but it's a drama first, and a really good one, honestly the movie is done in such good taste, it doesn't favor one side over another as it shows the good and bad things that both did (seriously the pie thing was pretty bad, funny but bad), it's sweet, funny, and emotional, with fantastic acting and writing you'll find yourself loving the characters with all of your heart, and I 100% believe that this movie should get a perfect 10/10 from me, it truly stands out among other movies as an exceptional experience, movies like this are rare, it shows you that something beautiful can come from an ugly experience, that love can come from hate, that we are all equal and deserved to be treated as such, and that if we are willing to open our hearts to one another and drop our hatred the world can be a much better place, and for that, for doing what few other movies want to do, I give it a 10, and recommend it to all, a must watch."
    },
    {
      "rating": "6",
      "text": "The director Tate Taylor bet in simple stories in the design of the Crusades and that was his biggest hit, the film ended up making a decoy of both public as prizes, should appeal to all audiences, despite being a drama.It exposed the relationship of black women working as maids in the 60's, in Mississippi, in a clear time of racial segregation, to white households, some other stories of humiliation and misery, are reported by these women who had to be strong to endure so much suffering, to see it all on the perspective of our current reality, then becomes a bit shocking, and this is not even a movie or the most violent and crude about it, some passages will even invest in a tone comic, which becomes a relief, before so many sad looks.The female cast of the film is marvelous, Viola Davis is a wonder, and it's my favorite for the Oscars, her work moves a lot and is very realistic, Octavia Spencer is another that seems lit, fully immersed in character, for sure will be remembered for this movie. Emma Stone, here, only confirms her \"Star Quality\", which had already shown long ago, showed that not only holds the cast of a movie studio, as she is still a great actress, who also gives a show in the drama, since we are more accustomed to see her doing comedy. Bryce Dallas Howard is ridiculous and overwrought, like a villain from a novel by Walcyr Carrasco. In this cast, the men characters are quite rifeless and do not make much difference onto, here the strength is the in women.By all means most people will love the movie, and absolutely most critics will find several defects. Here's what I think: The film is pure clichÃ©, especially in the final forty minutes and applies for a retrial very cheap sentiment to please the general public. There are quite a few points made in the film just to make the viewer feel good. But you know what? It worked very well. It has stirred and felt good. It was a very pleasant experience and I cheer up for the nomination for Best Supporting Actress, which I believe will eventually happen."
    },
    {
      "rating": "10",
      "text": "I just walked away from this movie this afternoon thinking, \"wow.\" It's probably not historically accurate, but the story and the acting were powerful. What a wonderful cast. It was laugh out funny at times, made me cry once, and was a honest and heartbreaking view into the lives of people in the year and location (1960's in Mississippi) from their perspective. There are at least two actresses who deserve Oscar nominations from this movie, maybe more. I highly recommend this movie."
    },
    {
      "rating": "10",
      "text": "A contender for an Oscar as the best picture of the year.  Drama, comedy, heart-break, the ugliness of segregation, this film has it all.  Viola Davis gives an award winning performance.  A not to be missed film that will leave you with a lasting impression."
    },
    {
      "rating": "8",
      "text": "The Help is at once a joy to watch for its absorbing yet haunting story and for the superior acting by Viola Davis and Octavia Spencer.  On the other hand, it is nauseating at times to suffer through the scenes of outright cruelty perpetrated by the white women of the south in the early 1960s.  It is one thing to read about Jim Crow in a book or listen to an old person nowadays discussing what it was like, but to see reenactments of just how dehumanizing and vindictive the times were is just unsettling.  This is an important story, fictional yes, but representative of a time and a place which reminds the audience just how ashamed we should be at aspects of our past.\r A few decades ago in the south, it was commonplace for a white family to employ a black maid.  Maid is an all encompassing term for house cleaner, cook, nanny, grocery shopper, butler, and every other menial task you could think of.  They potty trained the toddlers, read them stories, and pretty much raised the children instead of their mothers who were enjoying that afternoonâ"
    }
  ]
}