{
  "id": 4,
  "title": "The Godfather Part II",
  "starring": [
    "Al Pacino",
    "Robert Duvall"
  ],
  "runtime": 202,
  "genre": [
    "Drama",
    "Crime"
  ],
  "description": "In the continuing saga of the Corleone crime family, a young Vito Corleone grows up in Sicily and in 1910s New York. In the 1950s, Michael Corleone attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
  "year": "1974",
  "rating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/hek3koDUyRQk7FIhPXsa6mT2Zc3.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "O.K., my first response to this is that it is immensely underrated. As The Godfather's Metascore was a perfect 100, The Godfather Part II deserved at least an 85. It's the Godfather Part III that's the bad one, not II! The acting was about 2/3 as good as the original. Al Pacino took the leading role and made it shine, though not nearly like Marlon Brando did. The supporting cast was very good, although it was Robert DeNiro who swept the movie, winning him his first Academy Award for Best Supporting Actor."
    },
    {
      "rating": "10",
      "text": "This movie is SPECTACULAR!  I can't decide if it's better than the first one.  Everyone gives exceptional performances and the dialogue is so well written it almost seems real.  The plot is so interesting and totally sucks you in, you can't even tell it's over 3 hours.  Robert De Niro's, Vito Corleone, I almost (not quite though) is as good as Marlon Brando's.  Which I think was an amazing achievement.  It is possibly the greatest movie ever made."
    },
    {
      "rating": "9",
      "text": "Without Marlon Brando in the original I would have probably given it a 10 but he's just lacking in this movie. Al Pacino acts good but isn't as convincing as \"his father\". Robert De Niro however was a great choice for the young Don Vito. Not quite as good as the original for the reasons mentioned above but still an outstanding movie."
    },
    {
      "rating": "10",
      "text": "To put it simply: The Godfather Part II is one of the finest pieces of cinema to ever be crafted. How anyone can rate this film below an 8 is just totally beyond me. The cinematography is brilliant. The characters are highly textured. The dual story lines being parallel throughout the film is an excellent device in which to tell the stories of Vito and Michael Corleone. Mario Puzo and Francis Ford Coppola have created a masterpiece."
    },
    {
      "rating": "10",
      "text": "A great film that captures much of the phenomena of the first film.   A masterpiece in it's own right."
    },
    {
      "rating": "9",
      "text": "Its easily the greatest sequel of all time, The Godfather 2 does a good job at living up to the previous film. Despite its greatness, It doesnt have as much originality that the first film had but its still great."
    },
    {
      "rating": "10",
      "text": "The Godfather is one of my favourite ever films, and i'm glad to say that The Godfather Part II manages to match the first chapter in the story of Corleone family. The best thing about this movie, for me, was the flashback sequences to Vito's early years, how he ended up living in America, how he got started in the mafia, how he made his first (I presume it was his first) kill, how he set up his most important element: Family. The absence of Marlon Brando is evident here, but its made up for as we have Robert De Niro playing the young Don Corleone. There is a vast difference between Michael and his deceased father, Vito. Vito immensly loved his family and it was evident that family was the most important thing to him. To Michael, that is not true. Note how he smacks Kay across the face, how he refuses to let her see his children, how he orders the execution of his brother Fredo. The final scene, where we got a flashback to the family at the table for Vitos surprise party, is quite a well executed scene, and it was interesting to see the familys reaction to Michael joining the Marines and that it was Sonny who introduced the despicable wife beater Carlo to Connie. Honestly, this film was pretty brilliant, but I, myself prefer the first film. This is definately one of the best sequels though"
    },
    {
      "rating": "9",
      "text": "A true masterpiece. Unlike the original, there are no dull moments. The present story is wonderful, but it's the flashbacks that I found to be brilliant. Excellent movie."
    },
    {
      "rating": "9",
      "text": "One of those movies you are supposed to see but never get around to. I got around to it. Do beleive the hype - It's great. Great story, great cast, great film"
    },
    {
      "rating": "10",
      "text": "Arguably better than its predecessor, Part II brilliantly juxtaposes the rise of the father with the fall of the son and is one of the finest showcases of cinema's great character studies, not to mention Carmine Coppola's haunting score."
    },
    {
      "rating": "6",
      "text": "I have mixed thoughts of Part 2. It plays both prequel and the sequel and I don't think it works. I like part 3 better because it much more of a sequel. Part 2 is good but not great."
    },
    {
      "rating": "10",
      "text": "By continuing Michael Corleone's story AND traveling back to Vito's timeline, this film is one of the only sequels that can match its predecessor. This and The Dark Knight alone."
    },
    {
      "rating": "10",
      "text": "A companion piece in the truest sense of the term, The Godfather Part II garnered as much adulation as its predecessor, if not more. Receiving twelve Academy Award nominations, and again winning Best Picture (and this time Best Director for Coppola as well), the second installment has been rightfully hailed as the best sequel of all time.\r The Godfather Part II is a more ambitious production than the original since it attempts not only to tell a pair of completely disconnected stories, but to do so in parallel. The less time consuming of the two presents the early life of Vito Corleone (played by Robert DeNiro) in Sicily and New York, and shows how he came into power. The other tale picks up approximately a decade after the conclusion of The Godfather, and shows the means by which Michael Corleone (Al Pacino), now secure in his position, attempts to expand the family empire into Las Vegas and Cuba.\r Plot and counterplot develop, and Michael becomes the focal point of a web of betrayal and deceit, turned against by those he had sought to protect. Assassination attempts and government probes target Michael, but he fights back using every scintilla of ingenuity he possesses and sacrificing much of his humanity in the process.\r The traditional elements of the Tragedy introduced in The Godfather reach their maturity in Part II. Much of the humanity remaining to Michael at the outset is leeched from him with each deception and setback. Late scenes with a resentful Fredo (John Cazale) and a bitter Kay (Diane Keaton) emphasize the price for Michael of continuing his father's dominion. His flaw is his imperceptiveness and, as is the case for any hero in a story of this nature, its effects are crippling.\r Primarily due to the scope of events, Part II is not as tightly-scripted as Part I. While most of the first film takes place in New York (with a few excursions elsewhere), here the settings vary: Sicily, Ellis Island, New York, Nevada, Cuba, Miami, Washington DC. In letting their characters escape the confines of the \"old neighborhood\", Coppola and Puzo lessen the intimacy of certain interpersonal conflicts.\r Visually, many of Michael's scenes have a more gloomy appearance this time around. Especially during the latter portions of the film, the don is shown in severely underexposed settings, appearing as a silhouette. His is a voice from the darkness - a photographic mirror of what's happening beneath the surface.\r As the beginning of Part II echoes the opening of The Godfather, so too does the end. Because of the manner in which circumstances are handled and considering the people involved, the impact here is more forceful. The tragic flaw has accomplished its poisonous, inevitable designs. Coppola punctuates both movies with a gut-twisting exclamation point.\r Combined, The Godfather and The Godfather Part II represent the apex of American movie-making and the ultimate gangster story. Few sequels have expanded upon the original with the faithfulness and detail of this one. Beneath the surface veneer of an ethnic period piece, The Godfather is not so much about crime lords as it is about prices paid in the currency of the soul for decisions made and avoided. It is that quality which establishes this saga as timeless."
    },
    {
      "rating": "6",
      "text": "The Godfather part II is hailed as the greatest sequel of all time..... But it isn't. It is a remarkable movie, but has some big problems... Problems which you can't simply overlook, and which manifest themselves more and more with repeated viewings.\r The film struggles to maintain the narrative and characters as defined in the first film. It's understandable that Michael has become embittered and has difficulty balancing the life as the 'Don', and that of a loving husband and father. But that element only exists because the movie insists on keeping Kay away from the actual truth about who Michael really is. When, towards the end of the movie, she discovers his duplicity and hard-edge, she is actually shocked..... Even though throughout the movie she clearly doesn't believe Michael's assurances about what he does for a 'living'. It's not enough to wonder where their family's wealth comes from, and it just makes no sense.\r The other major problem is from a Direction point of view. De Palma won an Oscar for this movie (he didn't win for The Godfather, which is a far, far better film!) but the narrative structure is pretty awful. Jumping between Vito (in 1920's New York) to Michael (in the late 50's/early 60's) isn't handled well. The popping back and forth, and the parallels in the two storylines is well crafted, but there are massive pockets in the movie where the pace just falls off. There is a need in the 'Vito' era to introduce the characters who appeared in The Godfather, just as there is a need in the 'Michael' era to tie it into contemporary 'big' events..... (in this case the build up to, and subsequent take-over, of Cuba by the Communist rebels).\r The bottom line is that the film falls well short of the brilliance of the original. Even so it's still a masterpiece compared to the truly awful Part III!!!\rYou don't need to see part II, if you've seen part I.... In fact I'd recommend reading the book, it's far more compelling!"
    },
    {
      "rating": "10",
      "text": "A companion piece in the truest sense of the term, The Godfather Part II garnered as much adulation as its predecessor, if not more. Receiving twelve Academy Award nominations, and again winning Best Picture (and this time Best Director for Coppola as well), the second installment has been rightfully hailed as the best sequel of all time.\r The Godfather Part II is a more ambitious production than the original since it attempts not only to tell a pair of completely disconnected stories, but to do so in parallel. The less time consuming of the two presents the early life of Vito Corleone (played by Robert DeNiro) in Sicily and New York, and shows how he came into power. The other tale picks up approximately a decade after the conclusion of The Godfather, and shows the means by which Michael Corleone (Al Pacino), now secure in his position, attempts to expand the family empire into Las Vegas and Cuba.\r Michael lives his life and runs his business by two of his father's creeds: \"A man who doesn't spend time with his family can never be a real man\" and \"Keep your friends close, but your enemies closer.\" There are times, however, when those precepts fail as guiding principles, such as when a betrayal occurs from within the family. Broken trust arising from so intimate a source can be devastating.\r In The Godfather, family was more important than anything to Don Vito Corleone. Michael has inherited his father's values and as Part II opens, he is surrounded by the Corleone clan as they gather for his son's first communion. A symmetry between the first and second films is established here - both open with a family assemblage, and each quickly establishes where the power lies as the don \"holds court.\"\r The traditional elements of the Tragedy introduced in The Godfather reach their maturity in Part II. Much of the humanity remaining to Michael at the outset is leeched from him with each deception and setback. Late scenes with a resentful Fredo (John Cazale) and a bitter Kay (Diane Keaton) emphasize the price for Michael of continuing his father's dominion. His flaw is his imperceptiveness and, as is the case for any hero in a story of this nature, its effects are crippling.\r Primarily due to the scope of events, Part II is not as tightly-scripted as Part I. While most of the first film takes place in New York (with a few excursions elsewhere), here the settings vary: Sicily, Ellis Island, New York, Nevada, Cuba, Miami, Washington DC. In letting their characters escape the confines of the \"old neighborhood\", Coppola and Puzo lessen the intimacy of certain interpersonal conflicts.\r Visually, many of Michael's scenes have a more gloomy appearance this time around. Especially during the latter portions of the film, the don is shown in severely underexposed settings, appearing as a silhouette. His is a voice from the darkness - a photographic mirror of what's happening beneath the surface.\r As the beginning of Part II echoes the opening of The Godfather, so too does the end. Because of the manner in which circumstances are handled and considering the people involved, the impact here is more forceful. The tragic flaw has accomplished its poisonous, inevitable designs. Coppola punctuates both movies with a gut-twisting exclamation point.\r Combined, The Godfather and The Godfather Part II represent the apex of American movie-making and the ultimate gangster story. Few sequels have expanded upon the original with the faithfulness and detail of this one. Beneath the surface veneer of an ethnic period piece, The Godfather is not so much about crime lords as it is about prices paid in the currency of the soul for decisions made and avoided. It is that quality which establishes this saga as timeless."
    },
    {
      "rating": "10",
      "text": "Seriously? Only a \"Generally favorable reviews\" from critics? Really? The Godfather Part II is an absolute masterpiece. It keeps all of the great elements from the first movie (the drama, fantastic cast, great script, and unforgettable quotes), and also adds new elements that are great (a new story with Michael that is fantastic, tragic moments, and plenty of twists). I really am not doing this movie justice, just go see it!"
    },
    {
      "rating": "10",
      "text": "I loved this movie i liked the orginal better but this was just amazing its the only movie i have seen that serves as a sequil and a prequil the only thing i did not like about this movie is micheal corleano being the godfather he is great as a godfather dont get me wrong but i just liked him when he was entering the family"
    },
    {
      "rating": "5",
      "text": "After hearing all the hype surrounding this film, many labelling it as a classic, I was disappointed when I finally watched it. The acting was very good and the rise of Vito Corleone was very interesting to watch. However, the plot regarding Michael is fairly dull and overall far too little happens to spread the film over three hours. I am a fan of longer films in general, however I think the same story could have been told in 2 hours. The important parts of the plot are given far too little attention, while the film dedicates far longer periods of time to dull scenes. Worst of all was the ending, which was a non-event. Although it is far from the worst film I have seen, it is definitely overrated."
    },
    {
      "rating": "6",
      "text": "The Godfather Part II is another film that I consider to be a bit overrated, but people like it, so um, cool.I like this more than the first film because the plot is more than just: the Mafia does things. It's about Michael becoming mentally unstable during a period of time, and the Mafia doing things. However, that doesn't stop this film from having some filler padding like the original.This film is 3 and a half hours long! Why?! The whole Cuba segment could be taken out, some scenes here and there can be removed, I'm just baffled by these decisions. I understand wanting to show your entire vision, but it doesn't work as well when it's so long!The prequel part is great, but even that could be trimmed a bit. The sequel part drags on in my opinion.So I will say it's better than the original based on plot and characters (less characters to deal with and the characters have more development in this film). However, the first film was at least under 3 hours and had more of a unique vision (it felt more artistic)."
    },
    {
      "rating": "5",
      "text": "This film isn't terrible, but it doesn't compare to the first film. We go back and forth in this film between Michael being the Godfather and his father being younger and when he was alive. I wanted to see more of Michael and less of his father. I hope the Godfather Part: III is all about Michael. I'm just glade I didn't pay for this movie. I can't believe people liked the Godfather Part: II, the first one is terrific is easily in my top 5 best movies ever made. But for me the acting was okay in this one, the special effects were good and the storyline is decent, but there's really no special moments or anything that would make me say that this is the best movie ever made. This film disappointed me and I just hope that when I watch the rest of The Godfather films that they'll bounce back and surprise me."
    },
    {
      "rating": "10",
      "text": "A companion piece in the truest sense of the term, The Godfather Part II garnered as much adulation as its predecessor, if not more. Receiving twelve Academy Award nominations, and again winning Best Picture (and this time Best Director for Coppola as well), the second installment has been rightfully hailed as the best sequel of all time.\r The Godfather Part II is a more ambitious production than the original since it attempts not only to tell a pair of completely disconnected stories, but to do so in parallel. The less time consuming of the two presents the early life of Vito Corleone (played by Robert DeNiro) in Sicily and New York, and shows how he came into power. The other tale picks up approximately a decade after the conclusion of The Godfather, and shows the means by which Michael Corleone (Al Pacino), now secure in his position, attempts to expand the family empire into Las Vegas and Cuba.\r Plot and counterplot develop, and Michael becomes the focal point of a web of betrayal and deceit, turned against by those he had sought to protect. Assassination attempts and government probes target Michael, but he fights back using every scintilla of ingenuity he possesses and sacrificing much of his humanity in the process.\r For a man constantly battling to keep his family together, a mournful irony of The Godfather Part II is that Michael's efforts succeed only in fragmenting it. If the end of the first film was numbing, this one is shattering. The flashback preceding the final scene presents a stark differentiation of how things once were from what they have become.\r The traditional elements of the Tragedy introduced in The Godfather reach their maturity in Part II. Much of the humanity remaining to Michael at the outset is leeched from him with each deception and setback. Late scenes with a resentful Fredo (John Cazale) and a bitter Kay (Diane Keaton) emphasize the price for Michael of continuing his father's dominion. His flaw is his imperceptiveness and, as is the case for any hero in a story of this nature, its effects are crippling.\r Primarily due to the scope of events, Part II is not as tightly-scripted as Part I. While most of the first film takes place in New York (with a few excursions elsewhere), here the settings vary: Sicily, Ellis Island, New York, Nevada, Cuba, Miami, Washington DC. In letting their characters escape the confines of the \"old neighborhood\", Coppola and Puzo lessen the intimacy of certain interpersonal conflicts.\r Visually, many of Michael's scenes have a more gloomy appearance this time around. Especially during the latter portions of the film, the don is shown in severely underexposed settings, appearing as a silhouette. His is a voice from the darkness - a photographic mirror of what's happening beneath the surface.\r As the beginning of Part II echoes the opening of The Godfather, so too does the end. Because of the manner in which circumstances are handled and considering the people involved, the impact here is more forceful. The tragic flaw has accomplished its poisonous, inevitable designs. Coppola punctuates both movies with a gut-twisting exclamation point.\r Combined, The Godfather and The Godfather Part II represent the apex of American movie-making and the ultimate gangster story. Few sequels have expanded upon the original with the faithfulness and detail of this one. Beneath the surface veneer of an ethnic period piece, The Godfather is not so much about crime lords as it is about prices paid in the currency of the soul for decisions made and avoided. It is that quality which establishes this saga as timeless."
    },
    {
      "rating": "5",
      "text": "Une grande partie du charme du premier film a disparu dans ce second volet, sans doute parce que Vito Corleone n'est plus et partant, l'incroyable prestation de Marlon Brando... Revenir sur les origines et le début de parcours du Don aux Etats-Unis est une idée assez dispensable en définitive, bien que ce soit l'occasion pour un jeunot plein de talent de s'illustrer, à savoir Robert De Niro dont les rôles à venir de mauvais garçon et/ou de gangster feront la gloire... parce qu'il le vaut bien !Bien sûr, Al Pacino reprend les rênes de la Famille avec aplomb et talent, se fait des ennemis, puis éventuellement finit par liquider tout le monde, ainsi va Cosa Nostra. La vie familiale et sentimentale de notre mafieux va de pair ou parfois à contre-courant des aléas des \"affaires\" mais tourne un peu trop souvent au psychodrame, tandis que le rythme faiblit considérablement au fil des trois plombes qui sont allègrement dépassées...Cela reste loin d'être inintéressant ou même ennuyeux et cette saga sait encore captiver l'attention malgré une intrigue principale plus fouillis que jamais, pour ne pas dire confuse sur bien des aspects... malgré (encore !) son pourtant très long métrage qui aurait dû et pu fournir davantage de lumière aux évènements.L'ambiance demeure inimitable, toujours accompagnée de la belle musique de Nino Rota mais décidément, il y a quelque chose de pourri au royaume de Mafialand qui ne parvient plus à nous électriser et nous émouvoir comme jadis."
    },
    {
      "rating": "0",
      "text": "What is the point of killing everyone.Mike hates his own family too. He killed his own Brother.I do miss Vito Carleone. If he is still there, their family would live together in harmony.Mike sucks as a Don. He don't know how to deal with things.Living alone wont make you a Don. It will always be Vito Carleone."
    },
    {
      "rating": "0",
      "text": "Holy crap this movie sucked. I made a totally different impression of the reviews here, I had watched it in the theatres all those years ago and I did not like it, the most very very disappointing movie ever. It is boring and really hard to follow. I never new what the reviews would say till now. i am astonished: 0 is its match."
    },
    {
      "rating": "4",
      "text": "I saw it on TV so it was not as violent.  They should have never made II and III but they didn't know when to leave well enough alone and I am sure Al Pacino thought he was that good that the story didn't matter.  And he wasn't very good in this one.  I never bothered to watch III."
    },
    {
      "rating": "10",
      "text": "It"
    },
    {
      "rating": "0",
      "text": "Confudling, a dull masterpiece with nothing."
    },
    {
      "rating": "0",
      "text": "Rated R!!!!!! This movie isn't even bad, it is hard to follow crap!"
    },
    {
      "rating": "7",
      "text": "More brazenly violent, even in its opening, and more sensational in the nature of the mafia's corruption, but hardly a superior film to the original. Where the original had horrible and bloody events, they were earned - here, they just happen. This one really is slow, and many times things just happen, rather than build on each other. Like any good sequel, it takes advantage of the existing plot, and most of the references and allusions are good. The cast isn't quite up to the par set by the original, for while it has all of the menace, it possesses little of the charm, and no one provides a \"Brando quality\" performance. Even Hagen isn't quite what he used to be. There's also no experience comparable to Pacino's character development in the first picture. It packs several very memorable moments, but it's not up to the task, and is too long to justify what it accomplishes."
    },
    {
      "rating": "6",
      "text": "Good movie, a bit too choppy to be considered great. not even close to the original but very good."
    },
    {
      "rating": "4",
      "text": "Vastly overrated. The plot is identical to both other movies in the series (there's a party, someone tries to kill the Don, the Don tricks the real culprit into revealing himself, a short interlude for some random marital melodrama, and then the Don has all the bad guys simultaneously murdered. Fin.), the themes are shallow and largely inapplicable to anybody not involved in organized crime (violence begets violence, huh? YOU DON'T SAY.), the characters are flat (Michael is the grim Zen hardass, Fredo is the blubbering idiot, Kay is the shrill square, etc.), the two \"halves\" of the movie don't inform each other at all, so that the entire production is ultimately just remaindered bits of the book that they couldn't fit into the first film, and ultimately none of the characters do anything worthy of praise or emulation, and none of the conflicts are worth caring about. The plot meanders wildly over the punishing 200-minute running time, and when it comes time to wrap up they just have Michael give a little speech where he says \"oh, by the way, we can just kill all those people who've been bothering us,\" and then they go do that. I will never understand why they had to make 10 hours worth of movies just to point out that organized crime is not a suitable environment in which to raise and preserve a well-adjusted family, let alone why that's considered a rare and notable achievement."
    },
    {
      "rating": "10",
      "text": "Well I gotta say I always liked Godfather II better than part I.It's amazing how characters are portrayed in this part really perfect.I loved I'st part too it was 3'rd that was dissapointing."
    },
    {
      "rating": "8",
      "text": "Did I enjoy it? Yes I did...but for some reason it didn't fulfill my expectations. It doesn't have anything to do with Marlon Brando's absence (for that was logical...) but with the way the plot develops. I would have love to seen more of Robert Duval's character. T here are parts that are unclear, and towards the end it becomes evident that Michael doesn't trust the famous consigliere but that  is not totally justified, so there is a need for clarification. I am not sure if the length of the movie justifies its quality...it was at times slow...so I believe with that length it could have been better. I did still enjoy it...but no more than what I enjoy The Godfather I and definitely less than The Godfather III (which greatly surprised me!)"
    },
    {
      "rating": "10",
      "text": "This movie is three hours and twenty two minutes long but an hour passes like 15 minutes.It is incredibly entertaining and one of the best gangster movie ever made.\rThe plot is tricky featuring two parallel storylines,one of young Vito Corleone fighting with life's dark events,providing for his family,building a Don status and seeking revenge for the killing of his family while other depicts the Michael Corleone and his falling empire,family and life.\rAl Pacino is stand out in the movie cast.You just see the expressions and his eyes it can tell you the whole story.\rHe has completely transformed to a ruthless,heartless and cold gangster but never stopped loving his family.\rThe scene where Kay(Diane Keaton) tells him about that she aborted their child,Al is flawless and most realistic how his eyes pops out and how he knocks her down.He deserved the oscar for best actor.\rRobert De Niro is impeccable.What do you expect when two of the greatest actors play two of the greatest characters.\rDe Niro portrays the character with similar talent as Marlon Brando did.\rThe way he speaks with same husky voice also his sicilian.\rHis principles,taking care of things,returning the favor and rise to mafia is just marvellous.\rThe best scenes are where he follows Fannuci at Festa to his house and kills him other one ,obviously where he stabs Don Ciccio and says \"My father's name was Antonio Andolini... and this is for you\" is just brilliant.\rDiane Keaton portays her character with utter excellence.\rRobert Duvall is as great as he was in the previous movie,the sophisticated lawyer ,caring brother and a good man.\rJohn Cazale character is bigger in this one and he is first class in the scene where he yells his heart out and in the whole movie.\rMichael Vincente Gazzo's performance is most realistic.\rThe screenplay,style and violence is top notch.\rAgain.Coppola's direction is mesmerizing.\rOverall,this is one of the best movie and not to be missed."
    },
    {
      "rating": "10",
      "text": "Just absolutely masterful. I have no idea how the metascore here is so low, especially considering the film is critically acclaimed. The acting, once again, is superb and Coppola is fantastic as the director. There isn't much to say beyond the fact that this film is one of the best ever."
    },
    {
      "rating": "8",
      "text": "While I do consider it an outstanding movie, I don't love the original\rThe Godfather and its prequel/sequel is actually a bit of a step back,\rin my opinion. The 200 minutes are a lot too long and get boring, even\ras I anticipatorily watched the movie on two consecutive evenings, and\rneither of the cross-cut story parts was as interesting and thrilling\ras the one the original movie had to offer. That isn't to say that The\rGodfather Part II skimps on entertaining and rememberable scenes; in\rfact, the movie's best moments may even be more rememberable than The\rGodfather's. However, a lot of the scenes in between are just too long\rand not really necessary  what would have been needed a lot more were\radditional explanation scenes as the panoply of characters grows even\rbigger through the story being set in two different times and the\rdialogues give more focus to being pointed and quotable instead of\rmaking what happens fully clear. This is indubitably important, don't\rlet me be misunderstood, but the huge plot that Mario Puzo has devised\rfor The Godfather is simply too complex and convoluted to be easily\rgrasped without having read the source material. Nevertheless, The\rGodfather Part II is a cinematic masterpiece that is sovereign and\rseminal on so many different layers, such as the beautifully\rpicturesque cinematography, the smooth editing, the meticulously\rconceived set design, the innovative and unforgettable score by Nino\rRota, and the tremendous acting cast that is reflected in the five\rOscar nominations for acting (a tied record). Thus, The Godfather Part\rII is an undeniably excellent motion picture that merely suffers from\rthe director's attempt to put too much in just one movie."
    },
    {
      "rating": "8",
      "text": "Just as its predecessor, this is a masterpiece movie. Simply perfect. Amazing plot and almost perfect technical realization. 100% recommended, especially if you like its genre.\r Plot: 8.5\rTechnical realization: 7.9"
    },
    {
      "rating": "9",
      "text": "A distinctively well-paced and sumptuously plotted drama with unforgettable performances from Pacino and De Niro, \"The Godfather Part II\" is an objectively perfect sequel to the 1972 classic."
    },
    {
      "rating": "9",
      "text": "Its still strong on all levels, but part II doesn't have the same effect that The Godfather did."
    },
    {
      "rating": "8",
      "text": "The second chapter in the life of Vito Corleone best known as The Godfather.\rAt just over 200 minutes I think it's safe to say that The Godfather Part Two isn't a movie for a rainy Friday afternoon, it's definitely less gripping than the first but that doesn't mean to say that it isn't interesting. Actually it's the opposite. Francis Ford Coppola keeps everything slick and cool but still intelligent, some scenes are more compelling than others. Particularly the tense confrontation between two brothers. With no Marlon Brando to give the film at least one guaranteed brilliant performance, you might worry that the actors are not strong enough to portray the legendary characters well. Luckily Pacino and De Niro are both excellent and provide the movie two Oscar worthy performances, which don't even rival Brando from the first film but are still very good.\rOverall I don't think that The Godfather Part Two was as enjoyable or as gut wrenching as the first, but due to many excellent performances and another chilling yet satisfying ending I still find it to be a timeless piece of cinema."
    },
    {
      "rating": "10",
      "text": "Francis Ford Coppola's Godfather Part II, a golden cinema from the era of 1970s. Exaggerating? Over-Praised? Nope. If one looks back at that wonderful decade of cinema, he or she would see 'Colossal' films like Taxi Driver, Apocalypse Now, Annie Hall, Means Streets, Jaws, Chinatown, The Godfather (Its Predecessor) and many more. But, I think, the film which captures 6 Academy Awards (Best Picture, Best Director, Best Adapted Screenplay, Best Original Score, Best Art-Direction and Best Actor in a Supporting Role) surpasses them all, and that film is The Godfather Part II.\r To begin with it's acting would be a pleasure to me. \"Sun rising to shine the world\" That would be the expression to depict it's masterful acting. Well supported by it's supporting players and that include Robert Duvall (extremely impressive), John Cazale, Lee Strasberg and Michael V. Gazzo. Al Pacino plays the cold Michael Corleone, who's delivery entertained me with some kind of realism. Just rightfully perfect, I could conclude that he's transformed or easily put, Al gives a perfect performance which deserved an Oscar for best performance of the year. Just somewhere in that corner of brilliance, one could see a composed acting of Robert Deniro as young Vito Corleone. It is like pure cloud gathering all around him, truly an unforgettable contribution. In summary, it could be commented that this piece is a well acted motion picture.\r The element which grasped my attention is Coppola's method of slow or methodical filmmaking which captures the beauty of this cinema. Beautifully shot from start to finish, it is a breathtaking sight of grandeur.\r This film is a cleverly written piece too. Completed with inspiring dialogue, attractive epic storytelling and it could be easily 'snatched'that it is masterful.\r Many would disagree with me because I'm going to, or will always name this picture as 'The Greatest Film Ever Made'. The Godfather is an offer you can't refuse but The Godfather Part II is an offer you MUST NOT refuse.\r Facebook (http://facebook.com/alex.desmall) Twitter (@Alex_DeSmall) (http://www.rottentomatoes.com/member/AlexDesmall)"
    },
    {
      "rating": "10",
      "text": "The biggest surprise of this movie is not, that it is one of the best movies of all time, but that the first part was it also. Usually you expect the first part is great, the second just good, but not here. Again the story has many details about the mafia life. Great actors"
    },
    {
      "rating": "10",
      "text": "The best film of the trilogy. It's boring in some parts, but it's without doubt one of the best films ever made. A HUGE well done to Francis Ford Coppola!!!!"
    },
    {
      "rating": "10",
      "text": "Como su predecesor, una genialidad de Coppola. Creo que supera a la primera. Impresionantes actuaciones de dos grandes estrellas del cine como Al Pacino y Robert de Niro. Intensa historia y buenos giros. Perfecta."
    },
    {
      "rating": "10",
      "text": "Muy injusta la nota que le han puesto a esta maravillosa segunda parte. Es mi favorita de la trilogía de The Godfather, interesante y a la vez grandilocuente de como la historia que se divide en dos, una es la vida de cuando Vito aun no era el patriarca de los Corleone y por otra la trama donde ocurre los hechos del presente es decir en los 50, un Michael mas frió y calculador que en la primera parte, traiciones y  conspiraciones en contra su vida, la presión del senado y del fbi es lo que debe enfrentar en esta segunda parte, incluso si la traición es... mejor vean la película. Agrego algo mas aparte de su impecable guion, es su banda sonora con el tema The Immigrant que se convierte en el broche que lo caracteriza."
    },
    {
      "rating": "9",
      "text": "It has less character development than its predecessor, other than Vito Corleone, beautifully acted by Robert De Niro, whose learning of a new language truly deserves an Oscar. Al Pacino has a more sufficient role, and more dynamic, as the crime boss struggling with his crime life and family life, whose every choice is both hard and difficult to make. The rest of the ensemble makes all the violence sophisticated and interesting, mostly due to the complexity of it. And lets not forget John Cazale, although his career was short, he was an amazing actor, who actually gave me sympathy rather than scorn and a desire to see him killed. A formidable sequel, though it doesn't surpass the original."
    },
    {
      "rating": "10",
      "text": "A certain sequel to a amazing movie. It's amazing and perfect as the first movie. The best sequel of a movie of all time. The action, the characters, the story... just incredible as ****"
    },
    {
      "rating": "10",
      "text": "Yes, it may be the second movie in the Godfather trilogy, but to call The Godfather Part II a sequel is an insult to the movie, to Francis Ford Coppola, Mario Puzo, and Marlon Brando. Think of it as a \"continuation\" of the first. Although it has a 200 minute runtime, the well-made story, multi-layered characters, and Oscar-winning performances make the film breeze by. Modern directors can learn from films like this; instead of changing the shot every 5 seconds to a new angle, sometimes it is much better to just leave the camera in one spot and let the actors act. While there are more prologues and footnotes and flashbacks and flash-forwards, the movie still maintains a consistent pace and tone, the mark of a truly great picture."
    },
    {
      "rating": "10",
      "text": "the godfather part 2 is not as good as the first godfather,but it didin't mean that isn't an universal acclaim,simply it is the best continuation ever made."
    },
    {
      "rating": "10",
      "text": "Godfather part 2 just takes us on a tour of want the greatest movie of all time's sequel brings which is phenomenon do not miss it man I wish I was a gangster after watching this movie"
    }
  ]
}