{
  "id": 27,
  "title": "Parasite",
  "starring": [
    "Robert Glaudini",
    "Demi Moore"
  ],
  "runtime": 85,
  "genre": [
    "Horror",
    "Science Fiction"
  ],
  "description": "Paul Dean has created a deadly parasite that is now attached to his stomach. He and his female companion, Patricia Welles, must find a way to destroy it while also trying to avoid Ricus, his rednecks, and an evil government agent named Merchant.",
  "year": "1982",
  "rating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/6EM7Jm3veKSW9ELMajSSxslYWDa.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "To sum this movie it up, it is a black comedy, a thriller, a horror and a social satire in 2 hours. Seems like a lot in 2 hours, but not only is the message of class division clear, Bong presents it in the most accessible and humorous way while being able to shock his viewer; and everything from the performance of the cast, to the script, to the cinematography and to the production is flawless and jaw dropping.Calling it a great movie is an understatement. Bong has created a masterpiece and what could possibly his best film so far. Go watch the movie as soon as possible. If you love cinema, this is one movie you have to watch. It will leave you speechless at the end."
    },
    {
      "rating": "9",
      "text": "Absolutely magnificent movie from a great great filmmaker that always send the audience to a place that could just say: \"WoW, whatafuq...!\""
    },
    {
      "rating": "10",
      "text": "Parasite is a modern day masterpiece even though it’s not one of my favorite films nor is it my favorite film of the year. I have one tiny issue with the film but it is more of a nitpick. The film’s message is a little on the nose but I don’t have a huge issue with it but it is noticeable. Other than that, this film is perfect. There is not one bad performance in the movie. Cho Yeo-jeong, Park So-dam, and Kang-Ho Song are standouts from the film. All 3 of them have some of the best acting of the year. Their work with a fantastic script that is incredibly well written and clever makes their performance so much more enjoyable. Another aspect I loved was the cinematography. The film’s slow camera movements and slow tracking shots look absolutely beautiful which go along great with the fantastic production design. The film’s story and themes make this film incredible. The story of this poor family slowly infiltrating a rich family only to find out that their house is not what it seems. It’s so incredibly tense. You never know what is going to happen next and it’s always surprising to see what eventually happens. The film has themes of class divide and class warfare throughout which are very profound. The rich family says these lines about how great their life is while the opposite is happening to the poor family. Every time this occurs, you see how the poor family reacts and makes the scene and film itself dramatically more tense. Another thing I liked about the film was the score by Jung Jaeil. His score adds so much more to the tension. I know I’m using the word tension a lot but that’s what this film is. A constant build up of tension scene by scene until it all culminates in the finale. For me, each passing scene left me more and more on the edge of my seat. One final aspect I want to touch on is the humor. Most of the jokes are cleverly written and while some of the jokes may not be that funny, I do appreciate how they were cleverly inserted instead of incredibly forced. Except this film to be on a bunch of Top 10 lists at the end of the year. Overall, Parasite is a fantastic film with great acting, great cinematography, and a powerful story about class divide even if its message may be a little too on the nose."
    },
    {
      "rating": "8",
      "text": "Here it is.My favorite movie from Asian cinema this year.Good Acting,good script and a good directing... Thank you Bong Joon-ho"
    },
    {
      "rating": "8",
      "text": "Definitely worth watching and for my opinion the best foreign film of the year,"
    },
    {
      "rating": "10",
      "text": "Such a good movie. Probably one of the best films ever created. Takes you on a roller coaster of emotions"
    },
    {
      "rating": "10",
      "text": "Um dos melhores filmes desse século até o momento, sem dúvidas! Apenas assistam e procurem saber o menos possível para terem uma experiência surreal de vida."
    },
    {
      "rating": "10",
      "text": "This is a Korean film that I can't quite categorize! I don't know whether to consider it a comedy, drama, thriller, dark comedy, etc., as it contains so many elements of all these genres. One thing I do know is certain though, this is such an interesting and unbelievable film in virtually every way possible! Winner of the Palme d'Or (the French equivalent of an Academy Award) earlier this year at the Cannes Film Festival, this film follows a poor Korean family that attempts to insert themselves into the lives of a rich, upper-class suburban family by getting themselves hired for various jobs for the family, such as a math tudor, chauffeur, cook, etc. They seem intent on even replacing the family and claiming the house for themselves if possible, until they stumble upon something shocking and unexpected within the house. And to say too much else beyond that would ruin the amazing experience of viewing this film for the first time! Really, all I can say is this: No other film this year had me laughing so much during one moment, and then completely on the edge of my seat during another, with certain scenes even leaving me absolutely breathless and speechless! The acting, writing, and dialogue were all so brilliant and razor-sharp as well! The film is layered with so many unexpected twists and turns! I never knew where this film was going or what it'd morph or evolve into next, as each scene and moment always felt so radically different and unpredictable than the last! On top of all that, the film undeniably provides a unique subtext on class, social status, the lengths some will go to for prosperity, and how people within certain classes are often perceived. Overall, I can't even begin to heap enough praise towards this masterpiece of a film! It had just about everything to offer, combined so many favorite elements and genres of mine, and left me flabbergasted by the end to the point where I sat through the entire credits and then some in order to properly process and sit with what I'd just watched! This is far and out one of the best films of the year, maybe even the decade!"
    },
    {
      "rating": "8",
      "text": "The biggest surprise of the year. I went to watch the movie without knowing very well what I was going to find, and I left delighted. The artistic direction is 10/10, and the mix of drama, comedy and thriller make the two hours and peak that the movie lasts by flying. Totally recommended."
    },
    {
      "rating": "9",
      "text": "I wasn't sure what I would find with Parasite beyond the expectations I had for the excellent reviews it has received so far.But if I should emphasize something about it is its unpredictability in a story that thematically emanates an amazing dramatic darkness and at the same time manages to balance it with a touch of black comedy and certain elements of a mystery thriller.Parasite is a film completely controlled and designed to be unraveled delicately while you consume its social commentary and understand both sides of the social spectrums of both families and the ending leaves a bitter lesson and yet nothing lacking reality.You will talk about it quite a bit after finishing itParasite is the kind of cinema that is always welcome and always necessary.Disturbing, dramatic, funny and unpredictable: A triumph."
    },
    {
      "rating": "10",
      "text": "This movie was really good.The cinematography was incredible and every shot that was filmed was done so masterfully.The film also does great with mixing comedy,tragedy and suspenfullness.I  have barely watched any Korean movies(except train to busan) but i can  see that Koreans are making really good movies so i will have to keep an eye on their movies since they really do emotional movies great."
    },
    {
      "rating": "9",
      "text": "In “Parasite,” Writer/Director Bong Joon Ho continues his critique of capitalist economies that, in his judgment, inevitably create economic divides resulting in class warfare.  In his earlier films “Okja” (2017) and “Snowpiercer” (2013), Bong used a platform of science fiction to soften the message.  With “Parasite,” he employs slapstick and dark humor to leaven a story that, in lesser hands, might have become painfully didactic.Setting his story in Seoul, Bong has the benefit of dealing with class warfare and economic inequality without the complication of race.  South Korea is one of the most ethnically homogeneous countries in the world – 96% of the population is Korean.Bong’s pacing of his story is impeccable.  In Act One, we are introduced to the Kim family, literally and figuratively living in the lower reaches of the city, the parents unemployed and struggling, the kids getting by on street smarts.  When workers come by spraying white clouds of pesticide in their rodent-infested section of the city, the father advises to leave the windows open:  “It’s free extermination.”  At the other end of the economic spectrum is the Park family, wealthy beyond reason and totally reliant on others to do anything requiring physical or mental heavy lifting.  Bong underlines his premise by conveying clearly that, while they have great wealth, the Parks are not endowed with a particularly high level of intelligence, common sense or self-awareness.When a wealthy friend of the Kim son creates an opportunity for him to tutor the Park daughter, the Kims use this entry point as leverage, creating jobs for every member of the family within the Park household.  So far, the story, is light, bright and slapstick, with only a small vein of dark humor.  This tone offers opportunities for non-threatening exposition.  Remarking on the Parks’ unlined faces, Mr. Kim intones: “Money is like an iron.  It smooths the creases out.”In Act Two, the story takes a darker turn, initially by exploring the consequences of the Kims’ actions on one of the displaced workers.  By the end of the film, class warfare has escalated from bland observations (Mr. Park observes that those who ride on the subway have a “special smell”) to full-on emotional and physical violence.  For me, Bong’s thoughtful, subtly-crafted story invoked a fair amount of thought and introspection.“Parasite” won the top prize at this year’s Cannes Film Festival and is South Korea’s entry for Best International Feature Film at the Oscars.  It’s one of the finest films of the year."
    },
    {
      "rating": "10",
      "text": "I think my life is like that, it was a very deep and content film, thank you."
    },
    {
      "rating": "10",
      "text": "A totally unexpected movie, left me disturbed. It's so good that it feels kind of unreal to be created in 2019. Masterpiece & best one of the year."
    },
    {
      "rating": "8",
      "text": "You know a movie's good when you wind up having a dream about it. The last movie that affected me that way was Akira Kurosawa's Ran. The latest to affect me that way is Bong Joon Ho's Parasite. The only other movie I've seen from Bong is Snowpiercer, a film that dealt with the issues of class inequality, in Parasite he returns to this theme, but this time he plays it from a very realistic angle. Bong captures the tension of class disparity superbly, blending grittiness, humour and horror, and striking imagery that completely immerses you in the world he created. The actors all do a superb job, especially Kang Ho-Song, who best exemplifies through his performance, what it feels like to be on the less-fortunate end of the class spectrum. The writing is superb too, in particular how it portrays the struggle to move up the class ladder, using both the optimistic practicality of \"planning\" and pessimistic impracticality of \"dreaming\", in a hard-hitting way. This movie forces you to ride the wave with our main characters, all the way up, and down.The cinematography is beautiful, and the images composed superbly. The way the cinematography captures the architecture of our more-fortunate characters home is breathtaking, so is their lifestyle. No wonder our main characters plot and dream of being in that position, who wouldn't want to be?. The score stands out too. At times it gets super eerie and spacy and combined with the imagery, it helps produce the feeling that you are in a fever dream, and trust me, when the sh*t hits the fan in this, it's a fever dream and then some. I highly recommend this hard-hitting bit of cinema."
    },
    {
      "rating": "10",
      "text": "I rarely log in to write a review.This move made me instantly log in to post one."
    },
    {
      "rating": "9",
      "text": "Parasite is satirical, but it's not meant to make you laugh hysterically. It's more sophisticated than that. It takes some unexpected turns that kept it interesting throughout. There is a turning point in the film when everything clearly starts heading towards a chaotic finish, and it delivered well."
    },
    {
      "rating": "9",
      "text": "Well...This film is almost a masterpiece, for its genre. Visually stunning, brilliant acting, amazing direction by Bong Joon Ho, and a captivating story drive this film to incredible heights. I’m never too keen on foreign-language films as I can’t really understand them even with the captions, but this just glorified them. The only thing I’d say about this film that doesn’t really drive the movie down for me is the pacing was a tad slow, but that would be me nitpicking for any mistakes. Overall, one of 2019’s best for sure."
    },
    {
      "rating": "10",
      "text": "I usually don't watch movies, my attention span is simply just too short for so many of them. Its for that sole reason I stick mainly to just thrillers and suspense, productions that will keep me at the edge of my seat. And oh boy Parasite does not disappoint in that aspect in any way whatsoever. Its a movie full of twists, one wont know what hit 'em.."
    },
    {
      "rating": "9",
      "text": "This movie was amazing!!! This is the latest movie from South Korean director Bong Joon-ho, director of The Host, Okja, Snowpiercer and more. This is only the second movie of his that I have seen and it really makes me want to watch more! This movie is about a poor family who all get jobs working for a rich family as part of a scheme, and it just gets crazier from there. The performances are excellent, the story is interesting, it looks beautiful, it has comedy, it has suspense, it has horror, it has romance, it has everything! My only complaints are that the movie is a little slow in the first act and that sometimes the dialogue went by too fast for me to read the subtitles. This is good writing, and I feel like I missed some of it. I’m a pretty slow reader though, so your experience may differ. And yeah, the movie is presented in its original language and subtitled. If that’s an issue for you, don’t see it. You won’t enjoy it. Otherwise, if you want an exciting and well-made movie that is completely original, go see this movie! It’s one of the best of the year!"
    },
    {
      "rating": "10",
      "text": "Incrível, fenomenal, sucesso total. Uma verdediera obra de 2019, filme traz toda uma relevância para o debate atual sobre qualidade de vida, desigualdade social, luta de classes, violência."
    },
    {
      "rating": "10",
      "text": "This movie has a little something for everyone; comedy, drama, thriller. A full palette of emotions, masterful cinematography and an immersive and believable story. I'd recommend this to anyone who is willing to anyone who is willing to watch a movie with subtitles. One of the best films I've seen all year."
    },
    {
      "rating": "10",
      "text": "A great film that deserved to win the Palme D’Or at Cannes. In a strange way, it’s a Korean version of Upstairs, Downstairs, but much more cutthroat and much more fun. You never quite know what will happen next with such wily servants and such clueless and pampered rich people."
    },
    {
      "rating": "9",
      "text": "Parasite is funny and clever at the same time. Through trickster reality, plot is developed under a lot of intelligence and it's almost impossible doesn't hold yourself until movie's end. Probably this year's best movie."
    },
    {
      "rating": "10",
      "text": "Dissecting the struggle between the classes through the lens of innate human nature -- regardless of class status -- provides the foundation for this rip-roaring black comedy/social satire, one of those rare films that grabs your attention and holds it from start to finish without letting go. Building on themes explored in such previous works as \"Snowpiercer,\" writer-director Bong Joon Ho serves up a riveting, ruthless offering that makes its point clearly but without being heavy-handed or cartoonishly over the top. In doing so, the filmmaker dishes out a wealth of utterly hilarious humor about subjects that ultimately prove to be no laughing matter. Easily one of the year's best, sufficiently award-worthy in many respects, especially in its superb writing, the fine performances of its excellent ensemble cast and a thought-provoking message that should give us all a lot to think about."
    },
    {
      "rating": "10",
      "text": "Easily the best movie of 2019. A great movie, it entertains, it thrills and it shocks, thanks to a perfect direction by Bong and some incredible performances from the cast."
    },
    {
      "rating": "10",
      "text": "From South Korea, the movie that will be the worst nightmare of Almodovar and Scorsese. Dark comedy, drama and suspense in the vein of Hitchcock are mixed masterly in the story for a family of phonies and his dastardly art of getting away with it, or almost. Unexpected twists and an unpredictable end will make this one be tattoed in the memory of viewer. Rush!"
    },
    {
      "rating": "8",
      "text": "MIND-PARASITIZING!One of the most exquisitely directed, and well-crafted, films of the decade. Give Joon-ho Bong an Oscar from now! (8.5/10)"
    },
    {
      "rating": "10",
      "text": "Parasite stands atop the rest of the competition as the best film of 2019. Director Bong Joon-ho delivers his masterpiece, a film that has you hooked from the very beginning. Over the course of Parasite's runtime, it draws you deeper and deeper into its world, demanding more and more of your attention. Just when your investment in the characters peaks, Bong Joon-ho takes Parasite off the rails and delivers a striking message on the innate struggles between classes. Add in fantastic performances and cinematography, and you have the must-see film of 2019."
    },
    {
      "rating": "10",
      "text": "Parasite is one the best movies I have watched hands down! Highly recommended"
    },
    {
      "rating": "10",
      "text": "Amazing film.  Authentic, real, and a story I have never seen put to film before.  Highly recommend.  10/10"
    },
    {
      "rating": "10",
      "text": "The movie is the best of the year.There will always be movies like this Befitting oscar"
    },
    {
      "rating": "10",
      "text": "I think a ten film is one that you enjoy in the moment, but it stays with you after. I’ll be thinking about this movie for days and will continue to get more out of it as I do so. I thought I would be let down after all they hype and this is not the case. My only complaint is that it does feel a little long at points, although I don’t know what they could have cut."
    },
    {
      "rating": "9",
      "text": "Film bluffant à voir quelque soit vos goûts cinématographiques Évolution scénaristique très intéressante je trouve"
    },
    {
      "rating": "10",
      "text": "It’s so f**king good. Might actually be this best film of the last 25 years."
    },
    {
      "rating": "8",
      "text": "Bong Jon-ho and the rest of Korean cinema is giving Hollywood a run for its money, and this film is a proof of that. The fact that Western audiences praises this flick like its the second coming is a little too much. Yes, it is highly original, and yes, it shifts its tone from broad comedy to thriller with incredible ease, but Korean cinema has been doing that for the last 2 decades or so. If it takes this flick for film fans to be aware of this incredible film industry, then so be it."
    },
    {
      "rating": "10",
      "text": "I saw this movie for the third time now. I'm still trying to think of a movie that's better than this one and coming up short. The first ever non-English spoken movie that won the best movie oscar, simply because it was the best movie. It's an amazing story with a twist and an ending that I really didn't see coming. A drama/comedy balance with social commentary that works surprisingly well. The acting is simply great and I think it'll be a while before something better comes to the big screen. It's just really, really good, even after seeing it three times I still love every second of it."
    },
    {
      "rating": "10",
      "text": "An incredible story of a poor family who scams their way into working for a rich family, each taking on a separate role. The movie moves forward and becomes more intense as each moment occurs, culminating in a finish that is thrilling. A fantastic movie that feels fresh and full of new thoughts and ideas even 2 hours in."
    },
    {
      "rating": "8",
      "text": "I think the best thing I can say about this movie is how well everything blends together. Bong has truly crafted a film that fires on all cylinders and that alone makes me highly recommend watching it."
    },
    {
      "rating": "10",
      "text": "\"Parasite\" is fantastic. It's clever. It's funny. It's disturbing. And yes, there is a powerful underlying theme of the divide between rich and poor. But the latter is so deftly weaved into the fabric of the story, you really don't think about it much until a fateful scene before the last act. It fully deserved the Oscar for Best Picture and Director. If only for the peach fuzz fight scene."
    },
    {
      "rating": "7",
      "text": "I saw bong joon-ho's the host and I can see he brings many of the same themes (poverty, classism, codependent family relationships) in his latest movie parasite. What starts as an endearing tale of a crooked family drama (which gets a bit long in the tooth) takes a hard right into 'lets see how long they can play hide and seek in the house' all the way to 'metaphorical homeless guy lives in the basement and worships the upperclass homeowner'.... So not very subtle writing here! Still the cast are superb here and the cinematography was slightly above average. My only wish is that the screenplay held back from it's flights of fancy long enough for us to enjoy the wonderful texture of that first 30 mins. A decent watch overall."
    },
    {
      "rating": "10",
      "text": "gong Joon-Ho’s ultimate genre-defying chef d'œuvre embodies class warfare and capitalist hysteria.In Bong Joon-Ho’s game-changing social critique, the rich and the wretched descends into capitalist hell in sardonic, comical, and horribly grounded fashion. In times of cholera and uncertainty, Bong Joon-Ho’s latest and buzziest masterpiece comes like a head-turning accomplishment, a surgically accurate class fable, a truly gripping multi-genre piece of entertainment, and a reinvigorating storytelling-rich decade-new awake. Ever since its Palme d’Or win, “Parasite” has been ground-breaking new history, not only by becoming the very first non-English language, non-epic-length period drama nabbing the Best Picture award at the 2020 Oscars ceremony, but by giving new life into movie-going experience in an aging era of convoluted streaming-service battles and rowdy franchise-building tentpoles.In a way, “Parasite” feels like the “Inception” of this new century. Back in 2010, Christopher Nolan’s towering 160-million Russian doll odyssey opened several doors industry-wise, putting the absolute, always-coveted formula into one single movie: crushing box office incomes, cerebral, wholly original storytelling, and, above else, priceless craftsmanship power. However, Nolan did not treasure any social-resounding message as sharply as Bong Joon-Ho did overseas. “Parasite”, on the other hand, is a small-budgeted, South-Korean thinking piece that, even while managing different procedures— it turned out to be more profitable than Nolan’s pic —comes to the very same conclusion: great filmmaking is the key. Social-headed slices of art would never be about big budgets and small films like “Get Out” and “The Invisible Man” are proving that studios, either big or small, may still conquer audiences with entertaining, on-point storytelling.  Script-wise, “Parasite” is an utter knockout. At first glance, the most outstanding, praised features the film exposes now and again are its turns and twists, the comings and goings of a story where everything mutes into something unexpected. These “think-again” premium plot devices are the main pulling force for mainstream audiences, even though they are not the most powerful assets Joon-Ho has to offer. The truly one-of-a-kind centerpieces are: proceedings and composition. Take for instance the 5-minute towering montage at the end of the first act, where black humor, cadence and rhythm are the beating heart of the sequence. It builds and places anticipation at the highest level by using endless narrative tricks to convey the emotions and reactions the film intends to spring up, blurring the line between good and bad, between wealth and the poverty, between sarcasm and irony. Every one of the characters succeeds at becoming storytelling backbones because of the amazing ensemble cast, which— by the way —became the very first foreign Ensemble Winner at SAG Awards, making, one more time, movie history. Park So-dam, Lee Sun-kyun, Choi Woo-shik, Cho Yeo-jeong, and Song Kang-ho deliver award-worthy performances, endowing to the story tangible, three-dimensional characters that, in incompetent hands, would come out as hollow caricatures.    Bong Joon-Ho’s pictures are described as many things at once: black comedies, social commentaries, genre-crossing post-apocalyptic adventures. Owning every inch of them, “Parasite” spices the mix up with deeper, timely metaphors— make no mistake, peaches and basements are not going to be the same; — however, the film owes it to two crucial aspects: visual language and edition. Camera movements, blocking and visual composition are masterfully managed by the director and his crew. It could have been a silent film, and still it would speak volumes. Cinematographer Hong Kyung-pyo executes his vision with perverse precision and voyeuristic delight, grabbing class divide by the throat. What could have ended up as a mere style exercise between the shady lighting from the semi-basement and the luxury LED lighting of the main mansion, it is now the perfect visual cocktail:  sophistication and softness, luxury and poverty, ups and downs, dark and light, hungry beasts in empty spaces. “Gisaengchung” by Bong Joon-Ho is the crowning achievement of the decade. Many critics have healed it as “the picture of the year” and, even if it is tout à fait true, “Parasite” transcends the boundaries of society-headed, industry-transforming films; say Jordan Peele’s ambitious allegory “Us” reimagined through the lens and voices of Shakespeare, Hitchcock and Kim Ki-young, and still you are nowhere near to it. Many talented, socially-aware filmmakers and their equally committed crews have paved the way through the years; now Bong Joon-Ho, in total command of his craft, has made it: “Parasite” is a groundbreaking work of art."
    },
    {
      "rating": "10",
      "text": "Quite literally one of the greatest movies of all time. Likely to stand with Citizen Kane, Casablanca, and Shawshank Redemption in terms of quality and importance, however to read a review before watching the movie is a disservice to both yourself and the movie, and I implore you to see the movie first, before reading any other potential spoiler filled review."
    },
    {
      "rating": "10",
      "text": "An instant classic that keeps you hooked from beginning to end. It is easy to watch, but deep and ambiguous at the same time, with outstanding performances and excelent direction by Bong Joon Ho."
    },
    {
      "rating": "10",
      "text": "El guión es impresionante, como puede generar entramados de historias, tantos círculos conectados. desde la familia por un lado, desde la ciudad por otro. desde el hogar, desde la calle. desde el suelo, desde la tierra. desde los parásitos y los parasitados. hay muchos binomios"
    },
    {
      "rating": "10",
      "text": "Perfeito, o melhor filme do ano e não tem discussão. Direção, roteiro e montagem no máximo. Bong Joon-ho está em outro nível."
    },
    {
      "rating": "10",
      "text": "Parasite is one of the most perfect movies released in recent years. With its impecable directing and great performances, it delivers a darkly funny, often awkwardly haunting tale that touches on themes of class devide while never forgetting to be first and foremost a very enjoyable thriller."
    },
    {
      "rating": "8",
      "text": "I have never cared about acollades. I never watch a film because it has won a Golden Globe or listen to a specific album because it has won 3 Grammys. But this time it has been different. When I saw the huge amount of Academy Awards \"Parasite\" was recieving, I felt the immediate need to see it. And I won't ever regret it.\"Parasite\", directed by Bong Joon-ho, is a perfect mix of black comedy, thriller, drama and social critic. It just has everything. The title is also magnificent. It makes you think that you'll see South Korea battling against \"coronavirus\" but no; you'll watch a capturing movie where the word \"parasite\" will recieve another deep meaning: the way poor people are seen by the rich class and how someone opposed to you is a kind of virus inside your house; something that doesn't fit in, that does not belong here nor isn't welcomed.This film is, by far, a must-see for cinema lovers since it has all factors that make a movie perfect. My congartulations to the actors and director who made me cry of joy and of sadness and have made me see how this world is a beautiful mess."
    },
    {
      "rating": "9",
      "text": "Parasite, Bong Joon-Ho's recent Satire of the social class division in South Korea is nothing short of incredible. The film is more or less divided into two major sections:the first half of the film follows a Family living in the poor areas of Seoul (im assuming). After the son Ki-Woo (Choi Woo-shik)is given the opportunity to work as an English tutor in an extremely rich household, he begins to realize that despite having a great income, the adults of the family are not exactly the brightest of induviduals, and so slowly Ki-Woo and his family devise a plan to all come into the employment of their new wealthy acquaintances. Although the film may give a lighthearted impression, once the movie transitions into the second half it becomes extraordinarily twisted, slightly resembling the ending of Robert Eggers's 'The Lighthouse'.After contemplating the events that took place witin the film, It seems obvious to me that Like JB Priestley's 'An Inspector Calls', Bong Joon-ho intends for this movie to display a clear contast between the lives of the rich and the struggles of the poor within this obviously unjust society. Of course it doesn't just rub your face with morals, and there is a very substantial and entertaining plot, but this is one of the main focuses of the movie.As for the other, i'd say that would be the excellent dynamic between characters which is further developed by the brilliant performances from every cast member, particularly Park So-dam who in my opinion was robbed of a Best supporting actress nomination. Other notable features include some top of the line cinematography and a outstanding writing, but other than that I feel there isn't much to talk about.Parasite is an absolute masterpiece, and like so many other films that have come out recently I absolutely recommend it.Fun fact: Elon Musk officially stated that Parasite was his favorite movie of 2019, and whie that's all well and good, the film practically exists to ridicule people like him."
    },
    {
      "rating": "10",
      "text": "It is an art and full of mysteries that will always keep you busy wondering what will happen next. No cliches or any nonsense. Straight story telling and great acting. The Director is really good."
    }
  ]
}