{
  "id": 154,
  "title": "The Third Man",
  "starring": [
    "Joseph Cotten",
    "Alida Valli"
  ],
  "runtime": 104,
  "genre": [
    "Thriller",
    "Mystery"
  ],
  "description": "In postwar Vienna, Austria, Holly Martins, a writer of pulp Westerns, arrives penniless as a guest of his childhood chum Harry Lime, only to learn he has died. Martins develops a conspiracy theory after learning of a \"third man\" present at the time of Harry's death, running into interference from British officer Major Calloway, and falling head-over-heels for Harry's grief-stricken lover, Anna.",
  "year": "1949",
  "rating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/oIF3l7Dxp7Eyye10BNyM611wtKa.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "Easily one of my all-time favorites.  I mean, Orson Welles isn't in a ton of this movie, yet his moments pierce into you like nothing else!"
    },
    {
      "rating": "8",
      "text": "Another legendary picture that I'm — mostly — regretting not seeing sooner, Carol Reed's \"The Third Man\" might be the benchmark film noir in terms of pacing and structure, with a first and second act that unfolds in a deliberate, yet engrossing manner and a relentless finale that leaves you absolutely speechless. These narrative attributes are thanks in no small part to master storyteller and novelist Graham Greene, who penned the film's screenplay. This is a project that takes great pride in its slow burn approach, offering up a veneer of normalcy to the viewer, but with little nuances in the dialogue, tonality and camerawork to let you know something's not quite right here. Once the reveals come, though, I'll say I had a consistently pervasive smile on my face. Any and every scene with Orson Welles is nothing short of iconic. That's not to take away from Joseph Cotten's commendable lead turn. It's just that, with the way the movie sets everything up involving Welles character, you really can't help but leave the screening remembering every scene involving him. And, while I will admit that I personally didn't care for the score (it is admittedly good music, but I also felt it didn't really fit the tone and mood of the film overall), this is still a fantastic watch."
    },
    {
      "rating": "7",
      "text": "Stylish classic noir features Orson Welles' most appealing performance.  Post War Vienna,  doesn't look pretty. A city filled with schemers and criminals, who populate its' dark alleys and sewers.  Morals go out the window in this sordid environment, which is part of the movies attraction.  Only drawback is the movie's deliberate pace.  But once it achieves take off speed, there is so much fun to be had."
    },
    {
      "rating": "7",
      "text": "Trust Or Mistrust.The Third ManReed's impressive tricks on hiding the trump card right under your nose has old magic and familiar structure hidden in there. And even though this uncertain shady streets follows a typical cat and mouse chase, unfortunately there seems to be very little skin in the game on terms of narration. And despite of the fact that the storyline suggests the inseparable chemistry between the lead characters, there is very little romance among the antics. Plummeting downwards by an immense pressure of almost overstuffed material, Reed seems to be in some sort of hurry to catch up the next act. In order to do so, it achieves a ferocious pace but doesn't quite glorifies the thrills and stakes of the circumstances.The makers could have easily milked out more cinema by savoring the concept and slowing down the procedure for a better effect. Nevertheless these minor complications can easily be leapt over by a gripping thriller that it maps out on screen. Welles as the ultimate flip of the act, has unfortunately a one dimension side of his to portray, and yet with spooky expressive performance, he sticks the landing. Cotten as the leader that we all follow, the victim, the protagonist, has fairly much wider room to factor in along with Valli's love angle.No matter how thought provoking and absorbing Reed's world is, it certainly is too mechanical to bubble up as a free spirit. There are too many strings tied for it to be independent of the traffic which at times holds it back; the semantics is the double edged sword, both productive and consuming. The donated blood and sweat of Reed pays off for his meticulous execution that still holds up after decades. The Third Man is the pre-war inquisitive concept that is held by an equally opposite competitive action."
    },
    {
      "rating": "10",
      "text": "Some of the greatest individual scenes in the history of film, for example, the journey of the cat across the street, the view from the ferris wheel, Harry Lime's fingers sticking through the rain gutter. A real masterpiece of acting, screenwriting, and cinematography."
    },
    {
      "rating": "9",
      "text": "Orson Welles gives a scene-stealing performance in this gorgeous looking noir mystery."
    },
    {
      "rating": "9",
      "text": "I like it very much.Especially this soundtrack.Film for all times! There also were great actors` perfomances and great direction"
    },
    {
      "rating": "10",
      "text": "All-time classic great mystery with fantastic post-war Vennia. It uses of lighting was groundbreaking at the time and is still amazing today. You can't call yourself a film-buff if you haven't seen this masterpiece"
    },
    {
      "rating": "9",
      "text": "This movie is film-noir at it's finest.While it is mysterious, moody and clever, this thriller uses atmosphere to great effect and it really elevates this movie."
    },
    {
      "rating": "6",
      "text": "I wasn't hooked by The Third Man until Orson Welles' first appearance (in a brilliant scene by the way). Performances and screenplay were OK and the score was cute but absolutely anticlimatic for me.Its most remarkable achievements are the persecution's staging, the stunning cinematography and uso of light/shadows, and a great ending."
    }
  ]
}