{
  "id": 152,
  "title": "Gone Girl",
  "starring": [
    "Ben Affleck",
    "Rosamund Pike"
  ],
  "runtime": 149,
  "genre": [
    "Mystery",
    "Thriller",
    "Drama"
  ],
  "description": "With his wife's disappearance having become the focus of an intense media circus, a man sees the spotlight turned on him when it's suspected that he may not be innocent.",
  "year": "2014",
  "rating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/qymaJhucquUwjpb8oiqynMeXnID.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "A masterpiece of genre film-making.  I felt like I was watching a long-lost Hitchcock classic (but one with all the sex and violence Hitch was only allowed to hint at).  No spoilers. The less you know about the story going in, the more you'll enjoy it. Fans of the novel are in for an impeccable and precise adaptation of the source material.  Fincher nails the tone and sustains it effortlessly for the entire running time."
    },
    {
      "rating": "3",
      "text": "I believe today is a jewish holiday, so this word may best sum up Gone Girl -- OY! What started off as a reasonably interesting mystery, turns very ridiculous very quickly, and then descend into absurdity. Once the movie takes \"that\" dreaded turn, everything from the acting and dialogue turns into a cheap made-for-tv melodrama you'd find on Lifetime. This is a rental folks."
    },
    {
      "rating": "10",
      "text": "I see Gone Girl as a horror movie, it shows us how a relationship can take a dark turn and urn our life upside down. Firs of all, Ben Affleck: man that guy has come a long way. He did an amazing job and you could really see that Fincher has helped Ben become a better actor. Rosamund Pike was amazing and I seriously think she was robbed at the Oscars. Great performance from everyone and we got exactly what we expected from David Fincher, a masterfully cratered movie from start to finish."
    },
    {
      "rating": "9",
      "text": "Oscura, siniestra, intrigante, toda la marca de David Fincher sin duda, y lo mejor es que con los giros inesperados de la trama saca lo mejor de Rosamund Pike y Ben Affleck por igual."
    },
    {
      "rating": "8",
      "text": "It's mercilessly dark, but that's David Fincher for you. He's also one of those who likes to keep twisting your perspective of each character around and around until you don't even know how to feel. The ending really was tormenting in both the good and bad way. While it tied the story up nicely, it left a bad taste in my mouth. Rosamund Pike does well with the psycho crazy and Ben Affleck is pretty good at playing Ben Affleck."
    },
    {
      "rating": "7",
      "text": "I was riveted by the first 2 hours of this movie; it was intense, well-acted, and expertly filmed, and I was already planning on writing a glowing review. Then, the movie heads downhill at such speed as to suggest that the people involved really wanted to give a good story over one that was plausible, and it shows with the insanely horrendous ending."
    },
    {
      "rating": "10",
      "text": "A tension filled, cerebral ride of a film with subtle yet effective social commentary, Gone Girl is a fine example of David Fincher at his directorial best."
    },
    {
      "rating": "10",
      "text": "Gone Girl is such a masterpiece, this is the kind of movie that Hollywood should have more of, Gone Girl is such an impact-ful movie, it's literally the kind of movie that makes your jaw drop, that makes you feel all sorts of feelings during it's amazing two and a half hours.\rAs you can probably see I enjoyed it, a lot, I enjoyed it because it is such a complex and interesting movie, during its longevity you never feel bored, you never feel like you're watching useless entertainment, this movie is able to be brutal, thrilling, dramatic, and able to provoke all sorts of other feelings on you.\rNow let's talk about the elements of the film, the acting was top-notch, amazing performances from Ben Affleck and Rosamund Pike and of course all the other actors did an amazing job, like for instance Neil Patrick Harris did a great job and even Tyler Perry feels authentic and great. The way this film is shot is amazing, every frame is filled with information and detail, the soundtrack while not the most extravagant manages to be captivating and unique, David Fincher did an amazing job, his films feel like distinct universes and different realities than ours because of the uniqueness and complexity of the situations we see in his movies, kudos for all of this.\rThe plot is amazing, it's awesomely complex and so interesting, it manages to gather so many different themes in one storyline while making it feel very natural and realistic, the brutality in this film, the violence, the pressure, these are all elements that come in to make the film feel darker and darker as we go along, and damn, it's a hell of a ride.\rThe only downside that I find in this movie is the ending, I am not saying I dislike open endings but I feel like if we got a solid ending we would be more satisfied, as the movie takes most of it's time during the second act, it leaves the third act with less time than it should have had, this time could be used to develop the ending in a more solid ways, as it feels like some parts of it were chopped of for time's sake.\rUltimately I absolutely recommend everyone to go and watch this movie, it's a true masterpiece of today's cinema and the reason why I like movies so much, because this ain't just movie, this is an experience."
    },
    {
      "rating": "10",
      "text": "A lot of people would described this movie as 'too brutal'. I don't think so. I guess people just can't expect such action from other normal-looking people. If you like movies, whose development you can't guess, this one is for you. An intricate story, almost insane.. not almost, but you know. This movie shows how some people pain can become a madness, that is rooted in complete revenge. The protagonist Amy is hiding is hiding behind a mask of a successful, intelligent and independent woman, who has many hobbies, can handle with everything and is also happy. In fact, that's what her parents want her to be and how they actually see her. She found a guy, that change her life and make her really happy, but then he turn out to be a **** selfish person, who start ignoring her  and act like she is nothing. Sooo the revenge comes and it's so satisfying.    .Outstanding acting, fascinating story with unbelievable plot twist. Must watch for thriller fans out there!"
    },
    {
      "rating": "4",
      "text": "Very disappointing after all the hype. Actually quite disappointing w/o any hype. This is an '80s cable movie with high production values. To walk through it... terrible dialogue ... both main characters are unsympathetic.. plot is the best thing, and it's rediculous... bored / revolted first third... chortles second third..more chortles and, when will this wrap up please?\rReally not good"
    },
    {
      "rating": "5",
      "text": "I loved it up until the twist reveal in the middle of the film and then it all went down hill from there. It just became another boring, over talkative drama that you couldn't wait to end. Definitely should have cut back on the run time and made it more bare-able to sit through. And the ending was pretty eh and not worth sitting through 2 and a half hours for."
    },
    {
      "rating": "8",
      "text": "After a second watch i decided to give it a review. I was really close for a 9/10, but the ending was a bit unfinished (in my opinion). Overall i recommend it to pretty much everyone!"
    },
    {
      "rating": "3",
      "text": "The moral of this movie: Don't get married. No wonder Neil Patrick Harris turned gay! Should have known it would wind up reeking of family values when I eventually found out Tyler Perry was in it."
    },
    {
      "rating": "10",
      "text": "I absolutely LOVED this movie! Amazing cast (Ben Affleck is the only one that didn't convince me like the others did - I usually prefer him as a director more than I do as an actor). Amy Dunne is my hero, for real! The story got me on the edge of my seat the whole time! Amazing, truly."
    },
    {
      "rating": "10",
      "text": "Gone Girl is a modern day classic in the thriller genre. It's honestly a movie that will somehow keep you on the edge of your seat for it's impressive three hour runtime. In my opinion, this is David Fincher's best work as a director. Every shot is immaculate. The soundtrack is tense. Every performance is too real. The story, written by Gillian Flynn (the author of the novel this movie is based on) is filled with twists and turns, and will have you guessing and leave you shocked with every development until the very end. The ending of this movie is so satisfying and shocking, and I won't spoil anything about it!Gone Girl is a very cleverly done meta of a film. At it's core, this is a movie about secrets, manipulation, lies, and ultimately a conflict between men, women, and how relationships are perceived by society vs. how relationships actually are. The performances by Ben Affleck and Rosamund Pike are jaw dropping. Easily their best work. Carrie Coon is incredible as always, and even Tyler Perry busts out some great acting chops.This is a must-see movie. If you like mysteries or thrillers or good acting or a good script, you need to see this movie!"
    },
    {
      "rating": "3",
      "text": "One of the most overrated movies of all time. David Fincher's direction almost saves the film, but an average script, and a terrible, slap in the face ending ruined it for me. It's a slow start but I would give the first 1 45 to 2 an 8. The end destroyed the whole movie however and made me actually quite angry."
    },
    {
      "rating": "3",
      "text": "Metacritic has been so consistently spot on with their cumulative review scores that it has become my go to stop before putting on a movie or heading to the theater.  I didn't actually check the Gone Girl score before watching it but decided to come back and check here after the fact.  The shock of finding it had received universal acclaim is far more surprising than any twists found in this awful movie.  Even suspending disbelief to enjoy some of the wildly implausible aspects of the plot (and there are MANY to choose from), there are ridiculous 180-degree character shifts that occur with nearly no explanation, development or understanding in order to propel this train wreck into the station.  Ben Affleck is cast perfectly as the unfaithful husband as it usually doesn't take more than a single frame to make Ben Affleck unlikable (I kid!) but he's hardly to blame here.  The screenplay is loaded with cringe worthy clunkers that do nothing to help this long winded story get anywhere fast.  It will be interesting to see how time remembers this one and if it will age well.  Girl, next time just stay gone."
    },
    {
      "rating": "10",
      "text": "One of my friends shows this movie to all of the girls he is dating on the first date. He says if they cannot handle the intensity of this film, then he will not bother pursuing a relationship further. While my love for Gone Girl may not be that intense, I can easily say that this is one of the best movies that has come out in the last 10 years."
    },
    {
      "rating": "8",
      "text": "Es una buena película de misterio con Ben Affleck y Rosamund Pike; la trama es buena y tensa y las actuaciones son excelentes; tiene una duración un poco larga, pero no es aburrida; es recomendable."
    },
    {
      "rating": "6",
      "text": "I went into this movie with high expectations. That was a bad idea. Don't get me wrong, the performances and technical aspects are incredible. Gone Girl suffers from a terrible screenplay, but a lot of it is blurred by the phenomenal direction. Even with a master at the wheel, though, Gone Girl just doesn't stand for anything relevant, important, or even worth watching."
    },
    {
      "rating": "7",
      "text": "This is a crime mystery drama.\r But it is more than that. It is an attempt to look at problems that many married couples have: financial problems, loss of work, infidelity, unhappiness.\r As a drama it does not really cut it but as a mystery the movie gets more interesting as it goes on. First, we see a line of events though HIS eyes. Then we see HER version of the same events. They are so dramatically different as two sides of the same coin.\r I was not very happy with the lead performances.\rOn the other hand, supporting cast was excellent, and so was cinematography. A healthy doze of satire definitely makes watching the movie more enjoyable.\r Overall for the entertaining value and the style I give it 7 out of 10."
    },
    {
      "rating": "6",
      "text": "A mostly meandering movie that never reaches a satisfying moment to take the film to another level. Moments of intensity are neutralized by long drawn out scenes. Acting and writing were solid but as a film, just above average."
    },
    {
      "rating": "1",
      "text": "Don't get the adulation and acclaim - what am I missing? The plot is dumb, the attempted dark humour doesn't work, and Ben Affleck acts like a dope throughout. This film has two part - the first 15 minutes - 7/10, the rest 0/10, and an insult.\r The film loses ALL credibility shortly after the start, and ends in the most stupid way imaginable. For those who gleefully say, 'It's a dark comedy. Didn't you get that?' Eh, well I laughed alright..."
    },
    {
      "rating": "6",
      "text": "The movie started out well and was entertaining and a solid 80, but the 2nd half was a disappointment and the story line started to lose credibility and dropped to a 50.  A shorter movie with one story line would have been better.  Overall I would give the movie a 65.  I enjoyed it but was somewhat disappointed."
    },
    {
      "rating": "5",
      "text": "This movie is about as average as I would have thought it would be, but with all the hype around it my expectations were high.  Some of it was pulled off well, most of it wasn't.  This is typical mass-audience garbage, and certainly not a must-see movie (but would make an okay rental).  Cool idea for a plot, but mediocre execution at best."
    },
    {
      "rating": "1",
      "text": "One of the stupidist movies I have ever seen besides \"Dumb and Dumber\"! I should have known as the book was ridiculous as well {thought I would give the movie the benefit of the doubt}, and if that is what people consider good literature, no wonder the nation is going down the tubes! People were actually laughing at the absurdity of it!!"
    },
    {
      "rating": "7",
      "text": "Entertaining enough, fun to see NPH in this role...I'm not a fan of Affleck so can't get excited about his performance and he's one of the main characters. The movie went on a little long for my tastes, could have wrapped at least 15-20 mins. earlier. Good, not a masterpiece and if you miss at the cinema its a good get for Netflix this winter."
    },
    {
      "rating": "7",
      "text": "Good for awhile, though the answer to the 'mystery' disappearance is pretty obvious, but about 3/4 of the way through, the story takes a very very unrealistic turn.  Worth watching, but expect to say \"What the ...?\" a few times throughout."
    },
    {
      "rating": "7",
      "text": "Well that was awkward. This thing just keeps getting weirder and weirder until the ending when you feel this strange feeling of ludicrousness flowing through your veins."
    },
    {
      "rating": "1",
      "text": "Worst movie I've seen all year. Waiting, waiting, waiting for the twist and then BOOM! ...nothing but a predictable plot. There was an attempt to wake me from my daze of boredom with an unnecessary gore scene towards the end. Movie could have easily been 45 mins shorter in length. The one star is for Afflecks lawyer in the movie, great character."
    },
    {
      "rating": "4",
      "text": "On the plus side this movie reveals how easily public opinion is manipulated. There is much that is clever. However, there is sexual dialogue (Ben talking about her incredible amazing vagina to friends) and some brief scenes that are not necessary to the plot (for example, oral sex)... Yes my husband tells our friends about my vagina all the time -haha. This is the kind of stuff Hollywood thinks it has to have to be cutting edge and \"intelligent\". Anyway, the movie feeds you information that keeps altering your perception of the truth-sand something somewhat interesting. Tyler Perry did a great job and so did the other actors. But I just couldn't get past Doogie Houser as the wacko who gets wacked. He is talented but they should have cast a new face. It might as well have been Nicholas Cage.  Something like this for me is not entertainment. Poor Jennifer Garner in Alexander's Horrible Day--I cant help but wonder what Ben and Jen talk about at dinner! Genre shenre, who cares. The people leaving the theatre I was in looked disappointed and deflated."
    },
    {
      "rating": "1",
      "text": "I cannot believe the number of positive user reviews here. were people not watching? do they have no standards? the critics gave the movie a  a high score, however, if you look at the credible reviewers, like the  other reviews\ryou'll see a rating of 60 - which is mediocre at best. This movie, should be  tmc movie on Tv\r- the twists and turns - like a tv movie\r …  149 Mins total Wasted by the ending do not watch this film you will be very dissapointed"
    },
    {
      "rating": "6",
      "text": "There are movies that make you ponder marriage/relationships -- yours and other people's. This isn't one of them. Nick and Amy are (one hopes!) nothing like you and your significant other. Their twisty story is darkly funny and provocative, although I think I might have enjoyed it more had I not read the novel. (Same plot problems, in my opinion.) Ben Affleck -- whose acting was the worst thing in \"Argo\" -- is the best thing here, perfectly cast. Rosemund Pike is a weak link, seeming like an American Doll whose descriptive theme is \"sociopath.\" Trent Reznor's score is not so much a soundtrack as just sound effects."
    },
    {
      "rating": "3",
      "text": "the last 45 minutes are so preposterous that it wipes out the memory of the great performances and stylish production that come before. It becomes laughably silly, so that the film morphs from a semi-gripping  who dunnit drama into a bit of a joke."
    },
    {
      "rating": "5",
      "text": "I refuse to join the chorus of applause for this film. Gone Girl is predictably Fincher-ish--visually stylish and slick but cold and soulless. I find both lead performances entirely vacant and robotic, with Rosamund Pike's Amy Dunne bordering on having been inspired by Haley Joel Osment in A.I. While the supporting cast steals the show (Lisa Banes, Lola Kirke and Neil Patrick Harris are highlights for me), Carrie Coon's Margo seems to have come from an entirely different film where all the actors weren't told they were making a film noir parody.\r On a positive note, there are three moments emblazoned in my memory where Cronenweth's photography is quite remarkable."
    },
    {
      "rating": "4",
      "text": "Noir has to be believable at some level, and darkness should not extend to near invisibility.  The film wears its trashiness like a caste mark--let's show the middle classes what  gore and sex is all about.  And then the film suddenly thinks it's saying something about marriage, society, human nature.   Hitchcock--are you kidding?!  The master had finesse--this just has pretension and gall."
    },
    {
      "rating": "3",
      "text": "I was very disappointed with this movie. It built the suspense quite well but then all of a sudden the characters began acting wildly out of character. One character who was portrayed as extremely intelligent in the beginning of the film began acting as if they had suddenly had a frontal lobotomy. The other character who was portrayed as an ethical person suddenly lost all their moral sense. Perhaps something was missing in the film that was in the book, but I cannot see how the last third of the film realistically would have followed from the first, well-done (except for the very annoying music) 2/3 of the film. I was so disgusted by this turn of events that I made an account on meta critic so I could express just how disgusted I was! Don't waste your money!!!!"
    },
    {
      "rating": "5",
      "text": "This film started off interesting and developed well and would have got a much higher score if it wasn't for the completely illogical ending that completely unraveled a taught, well devised thriller. It seems the author got a good story started but there are so many absurdities, plot holes and nonsensical actions in the last 30 minutes that it just ruins the plot and everything that came before it.\r All the legitimate questions as to the implausibility of Amys story asked by Detective Boney were all just brushed aside, probably so they could cash in with a sequel. With a less daft ending it would have been a much better film in my opinion."
    },
    {
      "rating": "9",
      "text": "An amazing crime-drama thriller. The film's strength is in it's ability to play with your perception of what's happening and what has happened. Particularly with it's main character. A brilliant and huge twist that changes everything makes this a very different movie when it happens.\r The longer it progresses the more tense and involving it becomes. It's not afraid to get dark. The way it presents every aspect is amazing. The way the general public reacts to new information shows how easily people's perceptions are twisted when they really have no idea what's going on, but truly want to. Dialog flows meticulously and is believable. The cast is fantastic and they play characters who feel like real people. Real, twisted people.\r It's a masterfully written thriller. One that perhaps does go excessive with it's mature content at times, but this is a mature story so it's to be expected. This is one for an adult audience who enjoys slower, more detailed focused movies. If you're looking for a thriller with a lot of action the look elsewhere. This one is grounded in realism and manipulation as opposed to bullets and punches.\r I give \"Gone Girl\" a 9.8/10."
    },
    {
      "rating": "6",
      "text": "Lifeetime movie of the week material brought up slighty by fincher's steady direction.  One scene of course stands out but the movie has whole didnt feel that thrilling or that engaging.  It has some good moments but I wont be revisiting this one."
    },
    {
      "rating": "8",
      "text": "This was a very, very good movie.  Fincher is a master of style, and he knows how to make almost any material absorbing, and sometimes even electrifying.  The cinematography, acting, music, and plot are all first rate.  I felt like I was viewing something destined to become some sort of classic.  That being said, I didn't find it flawless.  Something about it felt somewhat artificial, there were some pretty dirty scenes, and the ending greatly disappointed me.  It's still probably one of the best thrillers of the past couple of years though, and that definitely counts as high recommendation coming from me.  Oscar season has officially begun."
    },
    {
      "rating": "4",
      "text": "Predictable to say the least. I have to admit, I never thought Afflack's character killed his wife. I asked my wife (who read the book) and she said that in the book they did a lot better at making you believe it was him. That may be part of the reason for my dislike.\rOverall the movie was mediocre. The acting was ok, and for the most part the story was good. Not great, but good, could have been a lot better.\rThe big beef I had with this movie, was the terrible ending... I mean commmme on! Like anyone would actually just stay with her, give me a f'in break! Made this psychological thriller turn lame in my eyes.\r Wish I would have waited until DVD, not worth the money at the theatre."
    },
    {
      "rating": "5",
      "text": "Movie started as a decent mystery expanded to good thriller and ended as a horrible American mind numbing garbage. Main cast was good but why in the world would you cast Barney Stinson for a serious role? He must have VERY good agent, give that man a raise.\r At the end movie is trying to convince you how Nicks situation is inescapable when in truth there are so god damn many inconsistencies in her story and so many evidences that are contradicting her. I mean what are the odds that two ex boyfriends raped you in exactly the same way."
    },
    {
      "rating": "9",
      "text": "With David Fincher's assured direction complementing magnificent performances (especially Rosamund Pike's star turning performance as complex Amy), Gone Girl is a fascinating portrayal of a relationship gone wrong through a suspenseful mystery thriller and a perfect companion piece to its Gillian Flynn penned novel of the same name."
    },
    {
      "rating": "5",
      "text": "What is the heck was that ending? The movie goes on so long, it could have had 2 separate movies but add a little more details in different situations and they could have been good. Half way through would have been good given the set up of the movie, but then it kept going.......and going.....with no real pay off for why it kept going. And they completely wasted the Barney Stinson/Controlling Boyfriend character. Like, gimme a break. It starts off really good but the last half ruins it"
    },
    {
      "rating": "4",
      "text": "I hereby support a constitutional amendment prohibiting ANYONE from comparing any film to \"Hitchcock\" unless Hitchcock directed it.  The dialogue is so pretentious, the line deliveries so forced, the plot elements so preposterous that it's like watching a bad acting class.  There's no one in the film remotely interesting.  I picked up the novel just to see if they had done the author an injustice, and was astonished that people rave about the book.  Ugh:  this is  what movies have become?  And this is great fiction?  Pretentious, preposterous, and with a Lifetime Achievement Award for Bad Endings in a thriller, both book and film division.  Gillian Flynn is not Dashiell Hammett, she's Patricia Cornwell light, and the film is a lot more Brian DiPalma than it ever will be Hitchcock.  At least it reinforces the notion that Ben Affleck is a far better director than actor."
    },
    {
      "rating": "3",
      "text": "The misanthropic ingredients in the \"Gone Girl\" blender result in an unappetizing drink smacking bitter.\r \"Gone Girl\" is what stoners call a 'Goof,' i.e. a stupid joke played on those high to have a laugh at their expense. A step further; \"Gone Girl\" is self-reflexive and abets itself. The script for the film is part of the story of the film which is a soapy, broad slice of rancid Americana.\r Simply, if Affleck/Pike were to snuggle and watch a film within \"Gone Girl\" it would be \"Gone Girl.\"\r \"Gone Girl\" is a social/media satire, and could have been one of the best ever except it both takes itself too seriously and relentlessly rubs the audience's nose in ugliness and extreme cynicism.\r The filmmaker's tongues are also too far in the cheek. There are dumb as posts Ozark Dwellers/Thieves. A caricature 'Bad Girl' who gets away with murder. The insensitive, cheating dumbbell hubby. The beyond-catty Nancy Grace stand-in Missi Pyle. Even the choice of openly gay in non-cinema life Neil Patrick Harris as an obsessed former suitor underscores the satire. Like what you see? According to the filmmakers they're you.\r Those who rant and rail about the lapses in logic, nuances of plot, and motivation miss the point. There is no point except to allow junk-media-obsessed America a cold hard look in a mirror. Stand back and inspect the story. Scene after scene, this film is so over-the-top as to be laughable. Except the joke, told by elitists, is on you.\r Though meant to be acerbic, this satire bites too deep into the hand that feeds it. \"Gone Girl\" is terribly misguided. It misses greatness through lack of restraint and balance."
    },
    {
      "rating": "6",
      "text": "Felt like it was two movies forcibly merged together to form one.  First 2/3 of the movie was deliberate, and highlighted by great acting.  The final 1/3 was a painfully meandering."
    },
    {
      "rating": "5",
      "text": "I am a big Fincher fan but this film fell apart at the pivotal plot point. The problem was that there was never any viable alternatives to the two outcomes and once one outcome was eliminated, the remaining outcome became coical and implausible. Nobody was buying that ending. There was simply no payoff to the viewer in this film."
    },
    {
      "rating": "6",
      "text": "This is a difficult movie to rate because its strengths and weaknesses are tangled together. I have not read the book, and I'm reviewing the film as its own entity.\r The movie’s worth seeing, if only because of the twists, the character of Amy, and the post-movie talking points that are meant to provoke a battle of the sexes debate.\r I did enjoy Fincher branching out in a new direction, and I wouldn't say that it's the wrong direction for him as much as it was a difficult tone to hit for anyone.  The movie sets out to mix melodrama, realistic satire and absurdism. Though I love weird tones and shifting tones, to me the tones in Gone Girl don't always land well or mix well.\r Worse still, there’s inconsistent acting, and wobbly story logic.  The movie isn’t deliberately unreal enough (whether absurd or dreamlike or mythic or farcical etc) to get away with the wobbly story logic.\r I'm not sure the actors are always successful at staying in the same movie together, as mentioned by user-reviewer benutty.  And Affleck (as A-lister personality actors often do) seems to be so intent on 'playing a character with a backbone' that it's basically frigid, unflinching acting where his 'character' doesn't really change or have an interior. We're left watching Affleck bring the role to himself so entirely that he's not really doing anything. It's just flat acting that has about the same tone all the way through. (And it's not unlike the frigidity that Casey Affleck has in Gone Baby Gone, directed by Ben Affleck) I think this is partly dismissible by the character's degree of narcissism and shallowness, but not entirely.\r But… I have toyed around with the idea that Fincher and Flynn are jazzing around metafictionally here.  I’m not convinced that they are, or that they did it well if intended.  But at some point, two intelligent artists may have discussed how a man is to direct a woman’s novel/screenplay of this sort.\r IF they baked a metafiction joke into it, the setup clearly runs through Affleck’s under-emoting, under-engaged acting that undermines the story, and through the way that nearly every story logic problem serves to make Amy more amazing.  And the meta-joke, if there is one, only plays if you see the characters as puppets, more or less:  The psychopathically overengaged, self-justified modern wife who gets to always be right, and the self-centered, resentful boy-husband who takes her just barely seriously enough to subtly manipulate back and stay alive.\r Yet... I'm not sure I want to give Affleck the benefit of the doubt that his practically unchanging tone and lack of interior were all just a brilliant meta-joke."
    }
  ]
}