{
  "id": 181,
  "title": "Into the Wild",
  "starring": [
    "Emile Hirsch",
    "Marcia Gay Harden"
  ],
  "runtime": 148,
  "genre": [
    "Adventure",
    "Drama"
  ],
  "description": "After graduating from Emory University in 1992, top student and athlete Christopher McCandless abandons his possessions, gives his entire $24,000 savings account to charity, and hitchhikes to Alaska to live in the wilderness.",
  "year": "2007",
  "rating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2MSGZEE6XZd2r4ODNziwAw7Hpw0.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "Fantastic. a story that grabs your heart and makes you think."
    },
    {
      "rating": "10",
      "text": "This is one of those rare films which leaves a profound impact on you. The beauty of the landscape, the compelling acting from all, the terrific music and Penns great work in the director/writers chair make the film as engaging as can be. It really makes you want to enjoy the simple things in life and get out there.spellbinding stuff indeed Mr. Ebert."
    },
    {
      "rating": "9",
      "text": "A very well acted and directed film. Emile Hirsch plays a character who is likable yet strange. He is a consummate conundrum -a loner, yet at times the life of the party. The movie evoked a wide range of emotions from me, part of me wanted to be like him and part of me thought he was crazy. His interaction with Hal Holbrook was especially touching."
    },
    {
      "rating": "9",
      "text": "It's an amazing story about an usual character who finds himself over his head in the wilderness. Poetic direction and excellent acting by the brilliant Emile Hirsch make it one of the best films of this year."
    },
    {
      "rating": "8",
      "text": "A bit slow at first, too long as well. The acting was good. I found it hard to be sympathetic to Chris. I was more sad for the people he encountered."
    },
    {
      "rating": "2",
      "text": "I did not sympathize with the main character at all. He was unusually cruel in his view towards the ones closest to him, his family, yet all the time created these holier than thou ideals about what man and society should be like. Probably the smartest \"character\" in the movie was nature, which in the end coldly dispatched of this boy and his silly, overstuffed ideals."
    },
    {
      "rating": "10",
      "text": "This film is so much more than something meant to entertain the audience. The film is filled with conflicts that everyone deals with. Philosophical ideas and views are filled throughout. Why are people so cold to each other? Human adventure is through travel and meeting new people not simply standing still living in society. You see how cold the world can be. But at the same time you see how good people can be without living in the \"American Dream\" with a house and job. The main character has parents that were not happy even though they were very wealthy. This impacted his life heavily and help cause his adventure. With an outstanding lead performance by Emile Hirsch along with an amazing supporting cast. Beautiful direction by Sean Penn and the enviroment is breathtaking while it takes an older style of film. The film will leave you inspired and heartfilled while part of you may feel some depression. If you don't enjoy the film maybe you should watch it again because you probably missed it."
    },
    {
      "rating": "0",
      "text": "It's a bad movie about a stupid person who died about an hour's walk from Healy. Look, I live in Alaska. It's not this mystical land unspoiled by civilization. We've got cities, roads, all sorts of modern conveniences. If the guy wanted to go \"find himself\" why not go to Siberia? Less people there than in Alaska. Or maybe he could've just enjoyed the life that most of us wish we had and quit complaining about how rich he is. Anyone who thinks that this guy is a hero is an idiot."
    },
    {
      "rating": "9",
      "text": "This film is painful to watch and, once seen, hard to forget. Both of the perspectives visible in the user reviews--McCandless as fool AND McCandless as visionary--inform Penn's directorial choices, from the retrospective structure of the film to its dense, emotionally complex episodes, each a gem of casting and ensemble acting. Emile Hirsch so inhabits McCandless that it's almost spooky, and, though the entire cast is strong, Holbrook and Keener give performances of exceptional sweetness and dignity. \"Into the Wild\" is, on one level, about a young man who starves to death amid abundance, and so is the story of an idiot. At the same time, it is the story of a man beginning to see the psychic and social costs of abundance and to yearn for a time when enough was enough, a true idealist who walks his talk. His tragic flaw is not his longing for vanished frontiers but his attempt to recreate them in his own mind, believing individual ignorance a fair approximation of their mysteries. Those who have lived in Alaska (or any extreme environment) may ridicule or condemn him, but McCandless grew up in Virginia, where nature is more pastoral theme park than \"red in tooth and claw.\" Moreover, he is exactly the age at which many of us indulge in foolish, life-threatening behavior, as the cost of auto insurance for 20-somethings attests. What's sad is the waste: though his folly is more principled than the average youth's bender or car crash or fall from a Daytona Beach balcony, he doesn't get the second chance that most of us enjoy, the chance to learn, say, the difference between independence and isolation.  Or--and this is for the users who profess simple amusement at the film--the difference between ignorance accepted as a cognitive stage and ignorance celebrated as a cognitive goal."
    },
    {
      "rating": "10",
      "text": "Into the wild is a story of an inspired, adventurous young man who grows tired of societal customs and relationships around him as he sees them to be insincere and unnecessarily comfortable. He leaves behind the comforts society has offered him and begins an unpredictable, yet passionate journey into the wild. After many lessons learned from being so intimate with nature and it's habitants he learns that \"happiness is only real when shared\" making this expectedly cynical story a heartwarming perspective of the importance of intimacy with everything and everyone around us."
    },
    {
      "rating": "10",
      "text": "I've seen this movie 5 times and it always gets me crying. The plot surely isn't original but the performance of Emile is deeply moving and makes every person who might have thought about breaking away lose some sleep over the affair. One of the best movies ever. Oh, and beautiful scenery, unforgettable."
    },
    {
      "rating": "10",
      "text": "I love the movie from the beginning with Eddie vedders music. the landscapes and the whole story of  this young boy and his journey.I think many of us who like going into the wild and run from the cities are going to love this movie.Full of catharsis and wise advises"
    },
    {
      "rating": "10",
      "text": "The other day I took a chance on the film Into The Wild and I was absolutely blown away by how powerful it was. It depicts the real-life events of Christoper McCandless, who disposed of his cash, assets and personal belongings and spent two years hiking around the American Southwest before heading to Alaska in search of a great adventure. This journey of self-discovery is both moving and inspiring on so many levels. Such an endeavour is often of no interest to anyone but the individual themself; however, this is a story that had to be told. In this day and age of motion pictures that overkill with CGI, have mundane plots, and no real heart, this film was a welcome breath of fresh air.\r Director and adapter, Sean Penn, did a great job of transforming Jon Krakauer's words and depicting them onscreen. Yes, that's right, Sean Penn. I would have never thought I'd see him creating a screenplay so moving and heart-wrenching. This work is so far removed from anything I've personally seen him do in the past, but he did an exceptional job. He really focuses hard on the main character, Christoper McCandless, and the people he touches and inspires along his journey.\r The movie can be a little slow-paced at times  that's really the only negative aspect I took away from it  but there's always something around the corner that lifts your spirits.\r Anyway, I truly believe this is a film everyone should see at least once in their lifetime. I implore you to give it a shot."
    },
    {
      "rating": "9",
      "text": "What an incredible story. I never would of thought this was a true story untill I actually did research in to it and realised that all of it is infact true. It's one of those rare films that ALL people should see because no matter who you are, it'll have some form of positive impact on you. Brilliant summerization of things like happiness, freedom and materialism. Watch this film."
    },
    {
      "rating": "4",
      "text": "Brief Review (I haven’t read the book, so this I based solely on the film)\r+Brilliant Photography\r+Decent acting at points that make the film interesting at points\r+Great ending (wouldn’t spoiler for you)\r-I found the story to be boring, predictable and pointless.\r-Way to long I wanted to end\r-The dialogue was simplistic at best and dull at worst\r-The film fails to pull at your heart strings even at points when you are clearly meant to care\r The film can be summed up with one word, boring. It is not an awful film, but it never goes beyond 2nd gear. Ultimately I would I have preferred it if it was filmed like a documentary, which would have made greater impact. As a result I wanted it to end, so I wouldn’t recommend it.\r Full Review\rThe first thing you notice about the film is that is positive, is that the photography and setting as very interesting, and well filmed. Having said that once you begin to appreciate the plot, you realise this isn’t surprise, given the fact that the story is basically a journey across America, so great landmarks, like the Hoover Dam, are not too surprising after the first 30 minutes of the films.\r Surprisingly at points there are decent pieces of acting, in particularly the ending, and sign of suffering of Christopher (main character). Likewise Chris’ parents do predict a decent level of emotion, without being seen as over-acting. However, for me, the best piece of acting was performed by Kristen Stewart. This is not because Kristen is by any means a decent actress, or depicts any sense of believable emotions, but it is simply because she is so bad playing the emotional under-age teenage girl, who wants sex. Such appealing acting by Kristen Stewart for me was one of the only bits of the film I can remember, simply because of how bad her performance is. (I watched the film literally an hour ago from writing this review). As a result for me the acting was substantial, but you know it is bad when the highlight of a film is Kristen Stewart.\r For me the best bit of the film is the ending. I won’t spoil it, but basically it is unexpected, and one that is very well depicted, displaying the innocence of Christopher as a character, just wanting to live life free from the restraints of conventionality.\r However for me this is by no means a good film. The main problem for me was the story. It depicts the story of Christopher, who wants to live life free of society, and ends up in his dream land of Alaska, with flash backs depicting the journey Christopher takes. For me it was such a boring story simply because the fact that you see him make it too Alaska which therefore makes the flashbacks for me pointless, because you know any situation Christopher ends up in, he will be fine. As a result for me the flashbacks, feel more like padding than anything else. In particularly his journey to Mexico, when he wants to go to Alaska seems like a waste of time. While they try and make it more interesting and possibly spiritual by having Christopher justify his life through quotations from books, it ultimately becomes pointless.  As a result I wanted this 2 and a half hour film to end. The point here is that you could reduce the film time till about 1 hour and it wouldn’t make any difference.\rThe second thing you will notice about the characters within the film is that the dialogue is too simplistic. This can be seen by how the characters that Christopher encounters, seem to have really restrictive dialogue meaning no matter how good their performances are, their depictions feel limited at best. Such limited dialogue is made worse by how Christopher seems like someone you admire, but not too likeable, yet nearly every character he meets seem to view him as some kind of god like figure, with one character wanting to adopt him, even though he only knew him for a very limited period of time. The combination of forgettable and unconvincing dialogue, in combination with a dull story that was badly portrayed, for me killed any attempt the film tried to make to make you care about the characters etc.\r Henceforth while I can see the appeal of the film, I certainly don’t think it is worth all the praise it gets. It is not that the film is awful, but the high levels of potential with the film’s story, in combination with the film’s constant mediocrity, make this film ultimately forgettable and a film with almost no charm. Whereas bad films can be interestingly bad, this film, for me, is just boring. As a result I wouldn’t recommend it to anyone."
    },
    {
      "rating": "10",
      "text": "This is the best movie of 2007. Who cares whether or not it is faithful to the book. Judged on the merits of the movie only it deserves the highest rating"
    },
    {
      "rating": "10",
      "text": "The film repects the true story as expressed in Jon Krakauer's book. I can't overstate how good Emile Hirsch is as the lead. Every supporting actor plays their part to near perfection. Sean Penn is as good a director as he is an actor. The music goes really well with the film."
    },
    {
      "rating": "0",
      "text": "Like a godawful cross between Forrest Gump, Catch me if you can, rambo and, I don't know, Psycho? A truly appalling filum."
    },
    {
      "rating": "5",
      "text": "I rated this a 5. 5 out of 5 for the scenery and all I can say is youth is wasted on the young so 0 out of 5 for a story about someone pissed off and running away from home. Doing his research while running to the wild, ie. how to gut a Moose, good plan. Also shooting the animal with what seemed to be a rimfire 22, another good plan. I wonder how short his stay in the bush would have been if he had not come across the bus. Woodstock and Haight Ashbury come to mind. \" Yeah man gonna disconnect from society and live free\", until the money runs out or the bullets run out. No man is an island."
    },
    {
      "rating": "0",
      "text": "All Sean Penn's unforgivable portrayal of this story lack's is twelve disciples and a cross. The lead character is entirely undeserving of the sympathy, respect and philosophical status he is granted. The Alaskan climax aims to serve as an indication of the freedom he has achieved but in actuality just demonstrates his lack of respect for the wild. Meanwhile the justification for this pilgrimage remains as the void between himself and his parents, a problem he has run away from, a problem his sister has equally endured and yet he, not she, is portrayed as the hero. Accompanied by uninspiring and tedious cinematography and a narrative so forcefully littered with imagery that it constitutes nothing more that a painfully transparent attempt to promote the poetic nature of the lead character, this has to be the worst film I've seen this year."
    },
    {
      "rating": "4",
      "text": "It was critically acclaimed, full of stars, and Academy nominated, but Into The Wild wasn't for me. The film is based on the true story of Christopher McCandless, a young man in search of true freedom. A recent college graduate, inspired by naturalist literature, McCandless decided to travel to Alaska and live off the land. The film follows his journey, from college graduation and is an amazing story. Emile Hirsch gives an unbelievable performance as McCandless but was snubbed by the Academy. I suspect it was for the same reason I didn't like the film, it is unbelievably slow. The story and cast are amazing, but everything is so sedentary and precise, that you can barely sit through the thing! Some three hour plus films, don't feel anywhere near that long, that's how you know they're great. On the other hand, Into The Wild easily feels much longer than three hours and unfortunately doesn't do the story justice."
    },
    {
      "rating": "5",
      "text": "The trailer suggests this is an inspirational and uplifting film. It struck me as more melancholy and kind of a depressing. Overall it was a bit too long, in my opinion. But it didn't completely suck. Worth a rent at least. If you've got 2 hours to kill and feel like watching a quasi-hippy, skinny kid do some deep and introspective soul searching, then this film is for you. Hal Holbrook's character is worth the wait, by the way."
    },
    {
      "rating": "3",
      "text": "Mr Penn has given us an even handed view of a self centered upper middle class kid. He is attractive with a charming smile and an amorphous personality. What's not to like? So he's left his family and lives off charity. He is a nondescript catalyst   allows people to solve their problems by just being there and smiling.   Fortunately he carked it. Otherwise he would have turned into another Messiah   the same old same old  leave your family, go to wilderness, meet nobodies and impress them, talk to invisible friends, start telling everyone they are wrong  he jumped the gun there and was already doing this)....I wonder how many potential Messiahs have been dispatched through their own stupidity. Not enough."
    },
    {
      "rating": "3",
      "text": "A privileged middle-class white kid with a college degree decides his life sucks, so he does the only logical thing: burns his money, turns his back on his family, and heads to Alaska for self-enlightenment. Meanwhile, the rest of the world struggles with real problems like hunger which isn't self-inflicted. A tedious, self-absorbed, adolescent fable."
    },
    {
      "rating": "1",
      "text": "Terrible, terrible movie, about a very dumb kid.  They really attempt to romanticize this as some sort of existential journey, blah blah blah...  Basically a rich kid gets bored when mommy and daddy don't pay him enough attention, and decides that in order to get more attention he will wander around aimlessly and squander the things he was given.  Then even though everyone warns him not to, he goes out into the woods and dies of starvation.  They really should have let this story whimper away and just use it as a cautionary tale.  Nothing extraordinary here."
    },
    {
      "rating": "1",
      "text": "I couldn't wait for this movie to end. The dialog was awful, the acting was uninspiring. I can't believe this movie is getting such good reviews. I haven't disliked a movie this much in a long time."
    },
    {
      "rating": "0",
      "text": "This movie is very simple. It's a 2 hour and 20 minute glorification and romanticization of a guy who wasn't playing with a full deck, mentally speaking, who (perhaps somewhat inadvertently) committed suicide in the wild. He died ONLY because he didn't bother to take basic provisions like a map. Sean Penn admitted on Charlie Rose that if he simply had a map, he easily could have walked out of the area where he died instead of dying. But he was too crazy to take a map or basic survival provisions, or learn basic survival training, and thus wasted his life for no reason. His death was completely senseless, stupid and unnecessary. He was not a hero. He was not an inspiration. Therefore this movie has no reason to exist, because glorifying and romanticizing a guy who committed suicide is bad for society and mankind as a species. If you really are desperate to see a glorification of suicide then it's much cheaper to watch the old clip of Dr. Jack Kevorkian from the news show \"60 Minutes\" instead of buying a ticket to \"Into the Wild\"."
    },
    {
      "rating": "3",
      "text": "This is one of those movies that most critics love and many customers dislike. Main objection: the movie treats McCandless as a sort of heroic pilgrim, when he really is a selfish, irresponsible, world-class naif, who runs out on anyone who shows him caring, love and affection. Who but a jerk would subject his sister and parents to such pain because the old folks aren't perfect. I hated this guy, hoped the bear would eat him."
    },
    {
      "rating": "0",
      "text": "This movie was worse than Gus Van Sants' Gerry. Anyone who considers this kind of crap art needs to put down their macbook and starbucks and step into a museum."
    },
    {
      "rating": "3",
      "text": "This movie is much too long. The lead character's exuberance was intermittently engaging, but none of the other characters came to life. There was no plot; the story of the rambling adventures of Alexander Supertramp went repeatedly to Alaska but didn't arrive anywhere else. The movie sorely needed a script-writer and an editor. I wish the bear had killed Chris/Alex and brought an end to this tedium sooner."
    },
    {
      "rating": "5",
      "text": "Slow and boring."
    },
    {
      "rating": "3",
      "text": "Beautifully shot and well-directed. The character, however, confuses self-actualization with simple selfishness. At his core, McCandless was weak-minded and sought to flee rather than face his problems; everyone has a childhhod with difficulties, many far, far worse than poor Supertramp's. Forgiveness is a truly arduous challenge that he never bothered to face. What a shame."
    },
    {
      "rating": "4",
      "text": "Movie seemed to drag on forever.  I couldn't feel sorry for someone that just seemed to use people to get to his end goal and not care about them.   At many points I thought the story was going to wrap up but it just kept going and going, not in a good way."
    },
    {
      "rating": "1",
      "text": "Movies are suppose to a form of entertainment through comedy, drama, romance, action and suspense and Into the Wild is only but a massive bore. I found more interest in watching a nature show on the Discovery Channel. Into the Wild is nothing but a monotonous, self-centered, adolescent fable."
    },
    {
      "rating": "6",
      "text": "A great story with some very beautiful shots and emotional scenes, but it is ultimately a bore that never seems to end. The movie could have played out much better if it wasn't for the endless screenplay."
    },
    {
      "rating": "10",
      "text": "Everyone should watching this film. Have a rich acting, direction, photography and a poetic tom, make you think about the little things, the simple life. Although he died, he said a phrase that make all sense: \"happiness is full when is shared\"."
    },
    {
      "rating": "0",
      "text": "Forget the map, the trail was a couple hundred feet away. He was camped in a bus (some \"wilderness\" if somebody drove a bus to it?) 250 feet away from the trail between 2 towns (that the bus driver had used). Oh...and don't forget the highway nearby. I call it \"Wilderness story in a can\"...(or a bus). Might as well  have been living beneath an underpass.\r Or maybe it could have been written about Micky Mouse and Pluto \"In the Wild\". There was obviously no way to interview the dead man, so the stories of the trip that the author used were just a few scraps of information, mixed in a big bowl of his personal imagination.\r Trust me Jon, there are plenty of places to go in Alaska where none have been before. I have been to some of them in the real Alaskan wilderness. Save your stories for those real people that had no choices, not those that chose to kill themselves on purpose.\r The sad part is the book is just a contrived story to sell books and the movie is just a contrived story to sell movie tickets. Great story if you like people to make up stories for you."
    },
    {
      "rating": "3",
      "text": "Muy cansada, la historia de hueva pq no te interesa para nada le personaje, saber que existio si dices que interesante, pero de ahí que me heche 2.5 hrs de su vida, NO"
    },
    {
      "rating": "9",
      "text": "Loved it. Very thoughtful, inspiring and scenic. You will like the movie depending on whether you sympathize with or criticize the main character? There's something to be said for both sides. But remember this is just one person dealing with his struggles. Great soundtrack too"
    },
    {
      "rating": "9",
      "text": "Great movie and great insight into the different characters."
    },
    {
      "rating": "4",
      "text": "I understand Sean Penn was not on a fact-finding mission, but the numerous discrepancies with the book (okay, maybe the book was wrong) make me question his motives. To wit: Chris abandoned his car because it would not start after a flash flood. When park rangers (not people out searching for wild flowers) found it, it started after being jumped and ran for years. Chris traveled the lower Colorado River, not the rapids, in a canoe, not a kayak. The couple he later met in the Grand Canyon were German, not Dutch (or Danish; I forget what the movie said), and I doubt they were such giggling twits. He got lost in a maze of irrigation ditches and would never have reached the ocean had not Mexican hunting guides carried him and his canoe in their truck. He abandoned the canoe; it did not blow away. He was never beaten up by a railroad guard. When the manager at McDonald's asked him to wear socks, he wore socks. \"Ron Franz\" (pseudonym) did not hit the bottle after his family was killed; he mentored young Asian people and sent two through medical school. Chris almost certainly knew the difference between wild potato and the poisonous sweet pea; his notes say his decline is the \"fault of pot. seed.\" Moldy potato seeds can be poisonous. Why overly romanticize that which is already dramatic?"
    },
    {
      "rating": "8",
      "text": "The movie is well-done. The life it's about is not as well-done, but lets not confuse the two. You can't take a measure of someone else's emotional pain: they feel it so its real enough to them. Not the first and not the last to kill themselves trying to heal."
    },
    {
      "rating": "10",
      "text": "Never before has a film touched on so many levels; in particular man's journey through young adulthood. Sean Penn's ability to capture raw emotion and transcend it through seemingly \"real-life\" experiene has left me breathless. For anyone who wants to take a journey which may help re-define your own life, you must see this film:) Thank you to all who played a part in the making of this masterpiece."
    },
    {
      "rating": "9",
      "text": "Into The Wild is not just a movie, it marks the arrival of Sean Penn into the league of Eastwood, Beatty and Redford as actors who have found their niche as writer/directors. Into The Wild is cinematic poetry with enough heart and soul to inspire everyone who sees it. You can go ahead and put Sean Penn on your Oscar Ballot for Best Director and Adapted Screenplay, he's moved up to the Big League now!"
    },
    {
      "rating": "10",
      "text": "I thought the movie was excellent. And how about giving some of the credit to Emile, I couldn't have asked for a better leading character than him. Emile plays Christopher in such a way that I felt as if I knew him. It was spectacular, and incredibly moving because I could feel Emile's emotion while in character."
    },
    {
      "rating": "10",
      "text": "While I may not have agreed with the way this movie says is the best way to find happiness, it makes you think, which is what humanity is all about. Other than that it was funny at times, daring, and a fun journey to watch."
    },
    {
      "rating": "8",
      "text": "Lovely film, given most people know how it ends. I was thinking it was going to be sappy from the get-go--but it wasn't---only towards the end, when the inevitable starts to creep in. Emile Hersh was excellent--as was Hal Holbrook. Their scenes together were some of the most heart wrenching moments in film I've seen in awhile. \r\rI admire how Penn directed this film--both in landscape and feeling regarding the main character. Bittersweet is possibly the best adjective for it. You both want to knock some sense into him and cheer him on--and you're left feeling the loss of his life at the end. Very good movie."
    },
    {
      "rating": "10",
      "text": "This is the best movie I have ever seen. I could not go ten minutes without crying. Thank you so much."
    },
    {
      "rating": "10",
      "text": "Money means nothing, find yourself is the only way."
    },
    {
      "rating": "7",
      "text": "An interesting story of a young guy disgusted and repulsed by our modern world and our selfish ways who wanders out to Alaska to find solace and insight. Although I never lost interest in the storyline, it plodded along with the speed of a sleepy elephant. And with a running time close to 2.5 hours, I felt some additional editing would have helped make this movie feel less aloof and more focused."
    }
  ]
}