{
  "id": 139,
  "title": "Gran Torino",
  "starring": [
    "Clint Eastwood",
    "Christopher Carley"
  ],
  "runtime": 116,
  "genre": [
    "Drama"
  ],
  "description": "Disgruntled Korean War veteran Walt Kowalski sets out to reform his neighbor, Thao Lor, a Hmong teenager who tried to steal Kowalski's prized possession: a 1972 Gran Torino.",
  "year": "2008",
  "rating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/zUybYvxWdAJy5hhYovsXtHSWI1l.jpg",
  "reviews": [
    {
      "rating": "9",
      "text": "This movie has one of the most interesting main characters I have seen in a very long time, and if it didn't have that it would have gotten a much lower score from me. Eastwood's performance is amazing."
    },
    {
      "rating": "9",
      "text": "One of his best movies yet.We need more movies like this its action and a few funny parts.As of always eastwood is a perfect actor he always gets the job done."
    },
    {
      "rating": "8",
      "text": "A film that speaks to the perceptual tensions humans face in the most significant of facets, and does so with such poise and audacity that the viewer can't help but adore. What compels \"Gran Torino\" to its bold of state is the lingering emotive responses we feel from Eastwood, who merely from a glance, tells the story of life through the aged, piercing eyes that burrows inside of you, and demands of your notice. Visually, \"Gran Torino\" may appear to be an \"out-of-it's-prime,\" vintage piece of work, but the engine thrives and subdues its supposed insipidity to its previously prime state where its gritty demeanor flourishes."
    },
    {
      "rating": "9",
      "text": "I loved Gran Torino...Clint Eastwood was superb in his \"last\" role...I cried at the end and found it very moving. I agree that the Priest did not do a good acting job. He was very mis-cast."
    },
    {
      "rating": "9",
      "text": "It's a shame that most of the people can't realize this is not about \"gangster / redemption / retribution \", but well, like Lisa Schwarzbaum said: This is subtle, perceptive stuff."
    },
    {
      "rating": "9",
      "text": "Unforgiven was a fabulous Eastwood film. Gran Torino is different but another of Clint's masterpieces. Poignant, funny, raw, emotional.. it has it all and so well."
    },
    {
      "rating": "8",
      "text": "It seems age has been a blessing for Clint Eastwood, giving him a marked perspective on life, which somehow seems to resonate with everyone (There is virtually no one I've talked to who hasn't liked the story in this movie). Combining that with his talent as both a director and lifelong actor, he gives us one of his most powerful works - what he capitulates in poignant subtlety (Mystic River, Million Dollar Baby), he makes up for with dramatic bravado."
    },
    {
      "rating": "9",
      "text": "Gran Torino may not be Eastwood's best but it sure ranks in the top 5. While watching the movie you may think the script is all contrived -- until the very ending."
    },
    {
      "rating": "10",
      "text": "This movie was the Bomb! Clint Eastwood knows how to act... no doubt. Don't miss this movie, it will most likely be the last you see staring the great. A+"
    },
    {
      "rating": "6",
      "text": "A lot of potential, spoiled by reprehensible acting from everyone except Clint. I was laughing in parts where I really shouldn't have been laughing. But still enjoyable enough to earn a slightly passing grade."
    },
    {
      "rating": "7",
      "text": "A fantastic and surprisingly emotional tale of a bitter old war-veteran and his Korean neighbors. Very well acted and surprisingly down-to-earth. It's got too much language in it for my preference, but it doesn't effect any of the emotional merits of the film."
    },
    {
      "rating": "9",
      "text": "I thought it was a really good film. Eastwood has shown us all once again why he is still relivent in acting by giving a great performance that is a typical style that Eastwood has given us in the past."
    },
    {
      "rating": "10",
      "text": "dude. whoever the hell gave this movie a bad review must be the dumbest **** i have may ever know.  this movie was perfect in every way.  and pete, **** u!! u have no idea wut ur talking about. u should walk right up to clint eastwood and tell him what u just said,. and he will be sure to **** u up, u ****"
    },
    {
      "rating": "7",
      "text": "Gran Torino is gritty and gratuitous.\rA great script with a well paced plot. The believability is essential and it elevates the movie. A really good picture all around."
    },
    {
      "rating": "9",
      "text": "Gran Torino is honestly one of the most touching movies I have ever seen. The best characters in any movie are those who lived long before the movie's setting, those are deep and fully experienced life. Clint Eastwood is great in this movie, he is honestly my favorite part of the movie and my favorite actor of all time. Despite, I can't give the movie a full rating because some of the acting is off, especially Walt's friend and the some of the gang, they pulled me out of the moment which was unfortunate."
    },
    {
      "rating": "7",
      "text": "In my opinion, Gran Torino is a very respectable film by the legendary Clint Eastwood. A solid redemption story with good performances and a nice script filmed on location in Michigan, Gran Torino will definitely appeal to Eastwood fans, Michigan natives, and the Hmong people. Heck, I'd recommend anyone check this one out!"
    },
    {
      "rating": "8",
      "text": "Great movie directed and interpreted by Clint Eastwood. Gran Torino is absolutely a must see."
    },
    {
      "rating": "8",
      "text": "It's a while back since I saw this movie, but I know I loved it!The old grumpy grandpa (Clint Eastwood btw) who hates his greedy family and just wants to live out the rest of his days in his neighbourhood is part of a heartwarming and heartwrenching story, which ultimately rewards merit and diligence and leads to a happy end (sort of). Sure, it's cheap in its narrative ways sometimes, but I can neglect that, for the story itself is actually pretty good."
    },
    {
      "rating": "7",
      "text": "Solid comedy/drama, if a bit corny and stilted at times."
    },
    {
      "rating": "10",
      "text": "Gran Torino is maybe the best movie I have ever seen.  It is full of everything to pleasure both genders. I watched at my father's apartment with my sister. We all had a great time with this awesome movie. 10 out of 10 is not enough, so I will cheat and say 12 out of 10 :P"
    },
    {
      "rating": "6",
      "text": "Decent performance from Eastwood but really nothing new at all in the gangster / redemption / retribution themes the movie throws up."
    },
    {
      "rating": "10",
      "text": "This movie painted a perfect picture of how people are nowadays.It was a masterpiece, the slamming on foreign cars especially was great. Anyone giving this movie a low score probably did so because the movie made them realize they fit into one of the groups being heckled the whole time."
    },
    {
      "rating": "10",
      "text": "A really good and heartfelt movie. Even though the acting may seem stiff, it felt real. Not that over dramatic type deal. If the movie was enough to make me tear up then yes what a great movie it is. People who've given bad reviews don't deserve to be critics. They don't even know what a good movie is, even if it smacks em right in the face."
    },
    {
      "rating": "4",
      "text": "Just echoing the sentiments of some other voters: poor acting by the young cast members; unbelievably fast bonding between ardent racist Walt and his Hmong neighbors; cliched situations used to create conflict; blatant exposition at times (such as when Walt talks to himself in the mirror about how much he has in common with the Hmong--he may as well just turned to the camera and spoke the line to the audience). And his singing at the end seals this raw deal. Don't believe the hype, as they say. It's just average at best."
    },
    {
      "rating": "3",
      "text": "Eastwood playing Eastwood......and not very well. His facial expressions limited to a scowl and and grrr. The supporting cast, ostensibly Hmong natives, would have made most high school theatricals look good. All the Hollywood tropes are dragged out: an embittered veteran lovable enough for neighbors and priests to seek his redemption, despite being constantly insulted by his racial and religious slurs. The ending everyone expects in an Eastwood movie has a twist, which some may find moving but I thought was contrived and implausible. The best laughs came out of the racial slurs....the audience howled....which makes me wonder about us in this age of Obama."
    },
    {
      "rating": "4",
      "text": "It's Eastwood direction, but it's no Eastwood film that I want to own, or even recommend. The Hmong theme is utterly replaceable with any struggling race in terms of gang violence and identity, and does very little to highlight Hmong cultural value -- in fact, one of the film's unintentional jokes is that it summarily dismisses the Hmong as \"just more Asians\", and even fails during its expositional scenes to convince anyone of more than what's already commonly known: the Hmong fought with us more than 30 years ago, and were supplanted to places like Wisconsin in following decades as refugees. So, anyone under 30 might walk away with some new superficial knowledge, but don't expect them to swallow the tired race theme -- political correctness and inverseness have BOTH been declared dead by succeeding generations. Audiences over 30 might laugh longer and harder at the endless racism, but what's the value there? And why has nobody attacked the appallingly poor acting in the younger actors? This would be summarily thrown out if it had been directed by anyone else -- even anyone known."
    },
    {
      "rating": "4",
      "text": "All I can say is Clint Eastwood is a legend but legends can make make mediocre movies too. Case in point, Gan Torino, only wish the reviewers had the guts to admit this, instead of acting like fanboys and praising everything Clint Eastwood does."
    },
    {
      "rating": "2",
      "text": "I simply cannot understand why this movie has garnered such favorable reviews from both critics and fans. It is one of the most ham-fisted pieces of dreck I've ever seen. Do you find it insulting to have the plot spoonfed to you? Would you rather watch actors act, rather than have the character development firehosed down your throat in the first 5 minutes? Did you feel manipulated after you watched 'Million Dollar Baby'? You'll hate this one too. Someone needs to revoke Eastwood's lifetime pass."
    },
    {
      "rating": "1",
      "text": "Giving this movie a 1 was generous, but I thought they deserved a point for working out how to turn the camera on! The first movie I have ever walked out on; the lack of strength in plot, sceenplay, or acting was cringe-worthy at best."
    },
    {
      "rating": "2",
      "text": "Contrived writing, poor acting and terribly paced. An overall disappointment. Eastwood has consistently been one of the most generous and rewarding directors in Hollywood for some time, but this trite is the sort of stuff that unfortunately stains a career. The only clever, endearing, and ultimately redeeming part of this film is its ending, but it can only pack so much punch. And any force it had was totally suffocated by the embarrassing exitlude sung by Eastwood himself."
    },
    {
      "rating": "2",
      "text": "Give me a break, this movie stinks. Probably the most overrated movie I remember seeing in the theaters. What's the worst part about Gran Torino? The acting, story line, script, director, characters...take your pick."
    },
    {
      "rating": "0",
      "text": "I just don't understand movies nowadays. The movie was terrible. The story line was horrible. The acting was a joke. This movie was horrendous."
    },
    {
      "rating": "5",
      "text": "Wow, all these 10's?!? This movie was average at best. It was better than Eastwood's \"Blood Work\" movie but besides that i was not that good. The acting was terrible (yes, I know all the Hmong's were first-timers) and the story was boring. And I've heard from everyone that it had a bunch of laugh's in the film...The only time everyone laughed in the theatre was when he dropped one of his 568 racial slurs in the film. Its just a movie full of the slurs; gooks, fish-heads, swamp-rats, japs, zipperheads...I can't even remember them all. I shook my head coming out of the theatre after seeing caucasians already laughing and repeating those degrading slurs against Asians. ...I was going to give it a 0, to try and even it up but a 5 is what it deserves. Erase all the slurs and it still is only a 5. Overhyped!!"
    },
    {
      "rating": "5",
      "text": "Not nearly as good as all the hype. Forced dialogue, bad acting, contrived writing"
    },
    {
      "rating": "3",
      "text": "All the previous comments by \"3 or less\" pretty much sum it up. I told my wife I wish I could have those 2 hours back. What a waste of time."
    },
    {
      "rating": "1",
      "text": "Horrible!!! The acting was terrible, Eastwood was over the top, several times growling as if he was going to \"hulk\" out, the racial slurs really got old by the second half. The story felt like a hallmark tv movie."
    },
    {
      "rating": "3",
      "text": "We all love Clint, but he should have made a better choice to showcase his acting skills. This movie is the work of a first-time screenwriter, and it shows. It is often amateurish, cliched, and sentimental. I've seen better made-for-TV movies. Some good moments, yes, but overall it is a big disappointment. Clint--you can do better!!!"
    },
    {
      "rating": "2",
      "text": "The acting was forced. The only natural sounding actor in the movie was Clint Eastwood. The message was ham-fisted and flat out handed to audiences at the end. The script was incredibly contrived.Overall, I felt that movie suffered from an unfortunates messiah complex and was unintentionally racist. An white, angry, growling old man has to save everyone else because they can't take care of themselves."
    },
    {
      "rating": "5",
      "text": "The two Asian siblings' acting is a joke. Paris Hilton could probably out-act them. They make the movie very hard to watch."
    },
    {
      "rating": "0",
      "text": "The grand lesson of this movie is that the way to really defeat evil people is to allow them to kill you. Because maybe, just maybe, they might have to spend a few years in prison--boy that will teach 'em! This movie is the ultimate result of a culture that has become completely pacified and sissy-fied. It was a good movie up to the end. It made some valid commentary on our over-offended society (friends throw ethnic insults at each other without getting offended--unthinkable!). I love Clint Eastwood as an actor, but he has completely sold out to this pacifist mentality--the best way to teach bad people a lesson is to let them hurt you."
    },
    {
      "rating": "5",
      "text": "Clint is playing the John Wayne card by doing his Dirty Harry routine. It's tedious to a degree yet nonetheless entertaining if you let go of any expectation of artistry he shows in his non-starring vehicles. He's a great director but his acting is really stiff."
    },
    {
      "rating": "10",
      "text": "One of the best movies I have ever seen"
    },
    {
      "rating": "10",
      "text": "For all the people trashing this film, you obviously can't see any of the moral of greater idea of this movie. It wasn't poorly written of directed, if you go looking for things to hate you'll find them. This was a great movie."
    },
    {
      "rating": "10",
      "text": "Can just say wow? I would;ve given this an 8 or nine, but it ticks me off that people give these movies 3's and 0's when they really don't deserve a score that low"
    },
    {
      "rating": "10",
      "text": "Now that was just awesome."
    },
    {
      "rating": "10",
      "text": "Greatest movie ever made."
    },
    {
      "rating": "3",
      "text": "Highly disappointing. Slow and poorly written. Basically a sermon on \"kids these days\"."
    },
    {
      "rating": "3",
      "text": "Seriously? A Best Picture contender. You're kidding, right? Really. A Best Actor nomination for Clint. Come on, for Gran Torino? Where he plays that Archie Bunker guy who growls more than Learch and puts the fear of God in every ethnic gang in Detroit by his mere old white man presence, that Gran Torino? Seriously Clint, it's time to put Dirty Harry to bed. Oscar? Only if they award one for Best Achievement In Cliche!"
    },
    {
      "rating": "9",
      "text": "Very interesting movie, and the end was a real shock to me. The only thing that keeps me from giving in a ten is Clint's portrayal of that mean old man: nobody is that mean and full of dieased, racist blather. He carries on that bit for way too long, and should have dropped it the minute the Hmong girl (the best character in the film, for me) got in his truck. And it's unlikely that anyone would carry war atrocity guilt for so long. Otherwise, it was a fine film, and it was fun to see the Hmong families together. We really did mess up the lives of so many people over in SE Asia; the least we can do is show them some respect. Hey, I know, I know, this is just a movie, but you know what I mean."
    },
    {
      "rating": "10",
      "text": "This is one of the best movies I have seen in a long time."
    }
  ]
}