{
  "id": 151,
  "title": "The Grand Budapest Hotel",
  "starring": [
    "Ralph Fiennes",
    "Tony Revolori"
  ],
  "runtime": 100,
  "genre": [
    "Comedy",
    "Drama"
  ],
  "description": "The Grand Budapest Hotel tells of a legendary concierge at a famous European hotel between the wars and his friendship with a young employee who becomes his trusted protégé. The story involves the theft and recovery of a priceless Renaissance painting, the battle for an enormous family fortune and the slow and then sudden upheavals that transformed Europe during the first half of the 20th century.",
  "year": "2014",
  "rating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/eWdyYQreja6JGCzqHWXpWHDrrPo.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "All of which combines to make what feels like Wes Anderson’s most heartfelt film thus far. One that effortlessly straddles genres and works as both a nostalgic paean to a more innocent time and an examination of the very nature of storytelling itself. But most of all, it’s a beautifully realised account of the friendship that once formed between a lowly lobby boy and the legendary concierge who took him under his wing. Grand Budapest Hotel finds director Wes Anderson at the top of his game, delivering what may be his best film yet."
    },
    {
      "rating": "9",
      "text": "A really enjoyable family ,good value film for all ages.excellent screenplay make us engaged from the beginning to end,beautiful stylish narration is very much interesting,a lot of characters , each and every actors n actress done fine job especially zero character. Above all wes anderson's superb direction make this film to a grand level of entertainment."
    },
    {
      "rating": "8",
      "text": "Bolstered by a fantastic cast, great premise, first class acting, and a funny script, The Grand Budapest Hotel ranks as Wes Anderson's best work to date."
    },
    {
      "rating": "9",
      "text": "Wes Anderson is at it again with his style and antics that we've all come to know and love. With this being his biggest film yet, a huge all-star cast guides the film along rather smoothly. Ralph Fiennes is delightfully funny in the lead role of the film. Obviously there's way too many other cast members for me to go over so I'll just keep it short by saying that everyone does a marvelous job in the film. There are no wasted actors or appearances in the film. Everyone served a purpose in one way or another. Despite a somewhat anticlimactic final act, it's still yet another solid addition to Wes Anderson's great line of films. Fans of His previous work will almost certainly love it. Non-fans might still appreciate it for its zaniness and the great cast. Overall, definitely worth a view."
    },
    {
      "rating": "7",
      "text": "It's alright but I was expecting a lot more from the plot. The first half was good, and then it almost fell apart"
    },
    {
      "rating": "7",
      "text": "This is the best 'Wes Anderson film' to date, but not Wes Anderson's best film to date. It's large cast ensemble, sporadic punchlines and use of enframing lend itself to be very entertaining and tightly crafted from beginning to end, but also lend itself to be much of the same. Nevertheless, if you're a fan of Wes Anderson's catalog - or a casual moviegoer - this is certainly another work that should be enjoyed by all."
    },
    {
      "rating": "10",
      "text": "An excellent movie with an excellent cast and director. This movie is great from beginning to end and delights the whole way through. I strongly recommend this movie both to fans of Wes Anderson and those unfamiliar or wary of his work because of the brilliant execution. Funny, smart, and well-paced."
    },
    {
      "rating": "8",
      "text": "Wes Anderson movies are like a lovingly-stocked curio cabinet: engaging to look at and fascinating to marvel about. Ralph Fiennes heads up the cast of zany eccentrics as the concierge of the titular establishment. He includes the new Lobby Boy on his escapades, which include stealing a painting, escaping from prison and eluding the invading forces. Visually, this is a symmetrical delight: the locations are gorgeous and the detail is exquisite. The deadpan dialogue and comical staging keeps the pacing on its toes. If you enjoy cinema that's more about form than content, you'll find this hotel a lovely place to visit. Stay thru the credits to enjoy an animated man dancing to a delightful song."
    },
    {
      "rating": "6",
      "text": "OK, bottom line--would I recommend people go see this? Sure, with some reservations. It was silly and fun with great pacing, lots of enjoyable cameos and fascinating production values, location and interior shots (real or CGI). And the relationship between the lobby boy and his girlfriend (and to a lesser extent between the lobby boy and the Ralph Fiennes character) demonstrated some depth of feeling, but that said, and since two of those three characters were dead at the telling, I found the movie essentially \"soul-less\"--very clever and sophisticated but fairly empty and dark at its core."
    },
    {
      "rating": "6",
      "text": "Wes Anderson's film is decently paced, written moderately well, and contains a bevy of talented actors who all conspire to do their part, but falls just short of consistently capturing attention and drawing laughs with its comedic intention. It's just too eccentric for its own good. Far too many times were the laughs forced, as if the few members of the audience were laughing out of a desire to show themselves they \"got the joke\".\r By no means was it a bad film, however. The filming style was fairly straightforward but well done. Shots were pleasingly spaced and different ratios chosen for different time periods, effectively separating the periods without any intrusion or confusion for the audience. The set design and chosen locations fit the tone and general \"feel\" of the plot. The actors played each character off of one another to create some creatively comedic moments as well as others filled with tension. With a few exceptions - Edward Norton's peculiar character - the dialogue was performed well; Ralph Fiennes in particular did a wonderful job.\r Despite these positives, the  unneccsariy eccentricity of the film combined with its wholly uninteresting plot made the film rather tedious to sit through. Although it was, perhaps, not technically a comedy, The Grand Budapest Hotel certainly tried to appear like one but did little to capitalize on the actors it was given. The comedy fell short of being funny in nearly all cases, save for a few here and there. The moments were obvious and some juvenile in their humor.\r The film did have a novel or bookish feel to it - its plot seemed better suited to a written medium, but it was effectively conveyed on film.\r Though it did succeed in some areas, The Grand Budapest Hotel failed to consistently produce an interesting narrative and tried to hard to be a comedy combined with an odd plot. It was an above average film, but only just so, and with a veteran director in Wes Anderson with a talented cast in did not rise to the occasion and meet expectations."
    },
    {
      "rating": "3",
      "text": "I went in expecting to love the movie based on the high Metacritic score and boy was I disappointed. There weren't specific things to hate but there was very little to love. I found two things positive: 1) the acting was solid, 2) the directing and cinematography seemed well done to me, although not my style. However, the script was so uninteresting I would have walked out had I not been with friends. The few laughs I had were small chuckles, and the humor was little more than a character getting frustrated and screaming curse-words. I had absolutely zero attachment to any of the characters or the plot. The movie wasn't much more than an adult cartoon. They may as well have been dropping anvils on each other."
    },
    {
      "rating": "8",
      "text": "After watching the G.B.H. again, I enjoyed it more than the first time around.  It's a Wes Anderson movie, and it comes with all of his quirks, good and bad.  This time though, I felt like his characters were given some room to breath.  Ralph Fiennes, in the lead role, gives a great performance.  Anderson has created a really memorable character for him to inhabit.  In Moonrise Kingdom, I felt like the characters and performances were secondary to the production and set pieces, but here Anderson has corrected that mistake. The movie also doesn't put young children into shocking situations like Kingdom did, which is a plus for me since I found those situations to be morally lacking.  The production design here is still top notch, especially the hotel itself.  The ending is unexpectedly poignant, and it highlights just how much you've come to care for the characters over the relatively brief running time.  Overall, it's a memorable and funny movie.  It's still somewhat of an acquired taste, but I can't deny its quality, uniqueness, or the fact that I enjoyed it quite a bit."
    },
    {
      "rating": "9",
      "text": "I gave up on Wes Anderson a few years ago since I thought he had become too self-absorbed and not funny, so this film was a complete surprise. I thoroughly enjoyed it. It was constantly inventive, delightful visually, and often laugh-out-loud funny. And the parade of excellent acting was amazing -- everyone had a fun character to play and everyone played his part to the hilt, yet knew just how far to go. Actually I wished some of the actors who made such a great impression in a few seconds had more to do. My only criticism is that I thought the final chase went on too long and the film lagged a bit, and I think it was because Anderson did not quite catch the tone he was looking for, but after such a fun film (for a change), I was willing to forgive him a slight misstep. Ralph Fiennes was wonderful -- could anyone else today play this role with just the right mix of gravity and lightness? The actor who played Zero was wonderful too. Will anyone remember this terrific film next year when the Academy Awards come around? Best comedy I've seen since Mel Brooks' The Producers -- that's how long it's been since I have seen a really good comedy."
    },
    {
      "rating": "9",
      "text": "This movie was near perfect for what it was. It was funny when it needed to be and serious when it needed to be. The set design was a work of art in itself. On top of that, the characters, plot, and presentation were more than enough to keep any viewer interested throughout the entire film. The only flaw I found was that they didn't develop some of the minor characters quite enough, making the story hard to follow at on instance. This is such a minor flaw, as that line of the film contributed nothing to the overall story. In the end, definitely worth you going to see."
    },
    {
      "rating": "7",
      "text": "The Grand Budapest Hotel is a classic among other films in the comedy genre this year.\r The old fashioned theme of The Grand Budapest Hotel is one of the aspects I totally love. It’s also smooth, excellent and the cinematography might be one of the best and most unique I have seen. The soundtrack is no exception; it gives the film feeling and pace. 2014 have been a great year, and that totally includes this movie. This film surpassed my expectations; it’s almost a flawless film. The directing is spectacular, just as the structure. It’s a real adventure, which is both entertaining and cheerful. The characters are great, and I really felt close to them all. There are many well-known actors in The Grand Budapest Hotel, and I really enjoyed that. But Tony Revolori as zero isn’t the best actor; he’s a bit too stiff for the role.\r Great cinematography and superb comedy, that’s the strengths of this film. Unfortunately are the first 20-30 minutes not as entertaining as the rest of the film and the film could have gotten a higher rating if there had been even more funny stuff.\r The Grand Budapest Hotel gets a 7.5/10."
    },
    {
      "rating": "7",
      "text": "Another quirky diorama is added to the impressive collection of Wes Anderson who could be considered America's foremost auteur. And yet...\r The film is beautiful in its color and set designs. A ravishing impression of continental empirical splendor in a Slavic country prior to something like World War II. The question is, as for several of Anderson's last few films: how does it make you feel? The sight and offbeat gags are there and aplenty but can they support something that is not quite drama or comedy, and certainly not conventional storytelling.\rThe last few scenes of the film redeem the previous segments as the relationship between M. Gustav H. and the Lobby Boy is cemented as a bond that finally feels genuine. And when the telescopic looking glass of the story's three time periods are finally pressed together, I did feel something close to profound melancholy for the memory of all the central characters in each age, no matter how ridiculous they were depicted.\r Rushmore, The Royal Tenenbaums, and The Life Aquatic combined to showcase a new and unique voice in American cinema. In Rushmore, Max Fischer ambitiously pulls together a school stage play adaptation of the film Serpico. I loved that conceit then, but feel like that now IS the conceit for many of Anderson's latest films, including GBH and Moonrise Kingdom. Terrific actors reciting very serious-sounding, direct dialogue with middle school earnestness."
    },
    {
      "rating": "10",
      "text": "A few years back, I considered watching Wes Anderson's Moonrise Kingdom, but unfortunately, I stocked this movie in my watch list and until this day I didn't watch it. We have a familiar stocking case of The Grand Budapest Hotel, but I was more intrigued by the colorful cast of Ralph Fiennes, Adrien Brody and especially the lovely most talented Tilda Swinton (Only Lovers Left Alive, Snowpiercer) and a bunch of huge talented people in this film. The Grand Budapest Hotel carries the misadventures of M. Gustave H., his Lobby Boy and the accusation of murder. Wes Anderson has a unique style of filmmaking, starting of the the top notch performances, especially the cinematography and the very weird visual effects the deprives the movie from the real world into a fantastic sort of magical world. Every single frame in this film is collected and masterfully crafted into the picture, keeping the film from A to Z neat, mesmerizing and very intriguing. The Grand Budapest Hotel is surprisingly violent, crude and most wonderfully entertaining and heartwarming. This kind of filmmaking does not suit all kinds of people, however the movie overall is unique, original one of a kind masterpiece with outstanding performances, mesmerizing cinematography and a very intelligent, fun screenplay. The Grand Budapest Hotel is magical!"
    },
    {
      "rating": "7",
      "text": "The first thing I knew about Grand Budapest Hotel after leaving the theater was that some moments shined over others. 60% of the film is interesting enough, but lacks a great driving mechanism or significant motive. However, chunks of it really stand out, being as funny and charming as any Wes Anderson movie I've seen. A similar trend exists with the film's actors and characters. The new and upcoming Tony Revolori, and the A-List veteran Ralph Fiennes are excellent as the film's head protagonists. Adrien Brody as Dmitri is hilarious, and Wes Anderson's other signature actors (Bill Murray, Ed Norton, Jason Schwartzman) all make small cameos. The only problem with this film is, some of the characters and situations are severely underutilized. As you can see above, plenty of major stars have a role, but many of them are either too short or too simple. Situations are sometimes built up and then let off easy. I think Anderson has tried a bit too hard to pack stars and visuals in, that the film's direction has resulted in some shortcomings. Regardless, they certainly don't detract from the film in any way, and Grand Budapest Hotel still makes for a funny adventure film that bleeds charm and whimsy, in typical Anderson style."
    },
    {
      "rating": "9",
      "text": "Una película con toques sutiles de comedia, artística y técnicamente una obra maestra, con muy buena dirección y un magnifico  guión,  que dice presente en las listas de premios de las siguiente temporada."
    },
    {
      "rating": "9",
      "text": "I have never seen a Wes Anderson movie before and I was quite pleased with this one. It Is defiantly a different movie with many weird scenes/ dialogue but that is what makes this movie really funny and memorable. The actors were all casted really well. With some well known actors having small but very well done roles. A surprisingly well done movie."
    },
    {
      "rating": "1",
      "text": "I missed this movie when it was in theaters and really looked forward to watching it when it was released to On Demand, boy was I disappointed. Every good scene was shown in the commercials, it was so long and drawn out, I could not wait for it to end.  I kept waiting to be pulled into a magical story and it never happened. I do not understand how anyone could rate this a 6 let alone a 10, it was horrible!"
    },
    {
      "rating": "9",
      "text": "Exquisite. Fiennes gives a dazzling performance in this 'comedy; with serious undertones from the war. Stating the obvious: the hotel and surrounding mountains are quite simply breathtaking, gorgeous setting. The interactions between Fiennes, the hotel staff as well as his romantic dalliances all make for a very enjoyable few hours. Comparable to the Cider House Rules and Kiss Kiss Bang Bang, Anderson takes a complex plot and thrusts out delightful entertainment. Ending was pleasant if slightly clichéd."
    },
    {
      "rating": "1",
      "text": "I think that Moonrise Kingdom was a masterpiece for the way in which it secured individual and quirky fantasy to our own world.\r This film achieved no such thing, lacks any self reflexivity and is a self indulgent and wooden oddity which has drowned in its own treakly style.\r I agree with a critic here that visually each frame, each mise en scene is superb and worthy of hanging on a wall but everything else which would make good cinema is missing.\r The over stylized non-acting had me bored to death after 20 minutes. Having said this Fiennes was masterly in managing to create a human being however fantastical from this dull and format script."
    },
    {
      "rating": "3",
      "text": "Best for the smug. The \"too-loud laughter of the art-house patron\" is a review that would work on this film. There's an audience for this that wants to think they're in on the joke and the rest of us rabble don't have the emotional intelligence to see the forest. But the joke's on them.\r This is a beautiful-looking, highly-styled, clever but EMPTY film. These are Wes Anderson characters in Wes Anderson settings. The dialogue is cute, but gets old by the end ... there's no arc, no development ... just odd, quirky characters who are odd and quirky for the sake of it.\r Rushmore and Moonlight Kingdom worked because the characters were great, lonely people. There are no great characters in GBH ... and the story is thin ... but it does look nice."
    },
    {
      "rating": "6",
      "text": "“You see, there are still faint glimmers of civilization left in this barbaric slaughter house that was once known as humanity”.  If there was ever a quote to sum up the films of Wes Anderson, this would be high on the list. Highly inventive, absurd, and at times, narratively incoherent, Anderson’s eighth feature film is a grand, accommodating feature whose self is probably not as grand as the cast it has rounded out.\r From Ralph Fiennes, Harvey Kietel, Bob Balaban, Saoirse Ronan, Lea Seydoux, to regulars Tilda Swinton, Adrien Brody, Jason Schwartzman and of course Bill Muarry, The Grand Budapest Hotel is a formidably full house of A-list actors who happily lend their skills to the highly inventive and immensely visual Anderson. Aside from the wholly impressive cast, is the quirky and unmistakably unique vision of Anderson himself.\r If you haven’t been fortunate enough to experience a Wes Anderson film yet, you are surely missing out on one of the most elaborate, detailed, and symmetrical styles of film-making ever known.  Anderson’s style, renown and admired by many, may very well be the American indie art-house King and The Grand Budapest Hotel may very well be his grandest and most admirable spectacle yet–although it may not be his most engaging or beloved.\r The Grand Budapest Hotel is an empirical picture, in every sense of the word. Throughout his career as a writer/director, Anderson has defined and refined his vision to the point that every heist; every adventure; or every group of individuals, can easily be distinguishable, as if their existence could only be understood within an Anderson film. The essence of the characters within The Grand Budapest, as well as his overall vision, is creatively maintained thanks to the purity of the scenarios and wackiness of the characters Anderson houses, in whatever setting it may be. For decades now, Anderson has bequeathed to film-lovers everywhere and audiences’ alike, a signature style unlike any other.\r There are countless films where the characters have come secondary only to the immense and elaborate setting they are placed in. For example, in many films urban settings; New York City has played a pivotal role (see: Shame and Annie Hall), The Wild West (see: The Three Burials of Melquiades Estrada, Unforgiven), and exotic locales within Europe set the landscape for timeless stories of intrigue, lust, love and tragedy (see: Vicky Cristina Barcelona and The Bicycle Thief.). In Anderson’s world, although many of his settings are within the very real world we live in today, sublets of his world are envisioned within our world, and in essence, these locales become the greatest character of them all, housing very small, intricate tales of the people whose stories are shared in its presence. The setting this time, is none other than the Grand Budapest. A hotel, that houses the highly empathetic new lobby boy Zero (Tony Revolori) and his journey to becoming the irreplaceable sidekick to the one and only infamous concierge M. Gustave H (Ralph Fiennes). Among the many other patrons of the hotel and each of their individual secrets, tall tales, and life memories, Anderson centres the film around a priceless painting, now put in the hands of Gustave thanks to death of M. Gustave’s latest deceased romance, the mysteriously elder Madame D (an unrecognizable Tilda Swinton). What transpires, is an array of fantastical plot schemes and recanted storytelling that may only make sense when mentioning the name of Wes Anderson.\r Like any other Anderson film, the stories are only secondary to their execution. Anderson’s films are the closet things to mathematical proofs, where the process of plot-making comes first before the final, usually predictable and happy outcome. Anderson may have come off one of his most cherished screenplays with his last film Moonrise Kingdom, and The Grand Budapest Hotel may in no way trump it, but thankfully, it never tries. Instead, after exploring the unfathomable bond between young lovers, Anderson penetrates deep and long the affections of friendship and the importance of patronage within the industry of service and hospitality. Surprisingly this is a theme that he has yet to encounter, especially after his beloved muse and frequent collaborator Kumar Pallana passed and served as nothing less than a staple to the Anderson cannon. Think of The Grand Budapest Hotel as a large and completely dysfunctional family taking care of you, much like Anderson’s earlier work The Royal Tenenbaums, only this time, imagine them slotted at the other end of a hotel reception desk."
    },
    {
      "rating": "2",
      "text": "Seems to appeal to the Wes Anderson Die hards.  I haven't seen all his movies.  Rushmore was decent, but not as great as people make it out to be.  Some fans calling this his best...well if that's not an endorsement for seeing more of his work.\r I found it dull and boring (and it really takes a lot to bore me at a movie..though Gravity was boring too).  There were no laughs whatsoever.  Too much \"style\", no substance.  Didn't care about the characters at all and the ones I might have, were hardly on screen.  Dull, repetitive, silly, stuipid, over the top, over hyped, tired.  I couldn't wait for it to end.  Tries to be serious, political, funny, silly, artful, homage and fails on all accounts.  Ok it looked ok, the makeup and wardrobe was very good, but that's about it.  Ralph Fines was good, but not his best work.  People giving this 10's are hipsters or out of their minds."
    },
    {
      "rating": "1",
      "text": "The trailers presented this movie as a comedy.  It is not a comedy.  There are a few amusing spots but that includes Fiennes exclaiming **** .  So if its not a comedy, what is it? A sort of farce with a lot of well-known actors.  But a not very interesting or original farce.  The basic plot has been used many  times before."
    },
    {
      "rating": "3",
      "text": "well, that was an hour and a half i could've spent watching something else. i love only two anderson films (the royal tanenbaums and darjeeling limited). they were stylized, but not to the point where the actors were props. the stories of both were touching. this film should've been much better. it could've revolved around the society of concierges and been delightful. too many A list actors with very little to do. the centering of virtually every shot drove me a little crazy. it was watching a series of still life tableaus. i kept thinking, \"this is so hipsterish, why am i watching this?\""
    },
    {
      "rating": "9",
      "text": "Anderson's found his rhythm in film making, his previous faults - weak pacing, mirky story telling, cold characters - have faded with each film and TGDH signals his finest, tightest and strongest  feature yet. Strong, funny and charming - a brilliant film."
    },
    {
      "rating": "3",
      "text": "I'm sorry this movie was grossly over-hyped. I found it to be mildly entertaining and not nearly as good as\r'The royal Tananbaums.'  Ididn't find it funny at all  - it was trying to be slapstick at times\rand screwball at others - but failed miserably.  Again, it's a tepid adventure, not worth the hype or the positive reviews."
    },
    {
      "rating": "5",
      "text": "Meh, the film is interesting, and it's fun to see so many stars in one film.  But it falls short in the laughs department.  It's silly, and cute, and oh so clever, but left me a bit bored.  I have a feeling some of the high reviews are from folks who are pleased with hollywood taking them a little more seriously.  However, for me it was a bit dull."
    },
    {
      "rating": "3",
      "text": "Wes Anderson has great style and wit but THE GRAND BUDAPEST HOTEL is one more  effort from Anderson that is totally satisfied with being nothing more than cute. The film looks great, quite amazing in fact, but really is this trite exercise all that this talented filmmaker and cast can really accomplish? A little soul, na inkling of depth or insight would be nice. Ralph Fiennes totally scores though in a wonderful central role. But once he leaves the screen, I just got bored."
    },
    {
      "rating": "1",
      "text": "Wes Anderson again reduces skilled actors to lifeless puppets.  This is not a comedy; it is an interminable mood piece, the mood being arch, artificial, contrived and soulless.  Imagine a failed SNL skit extended to 1:40, in particular, where the \"humor\" is based on being extremely stupid, or crude or inept.  Yes, it is distinctive and engrossed in its own style.  You might instead consider staring at an Andy Warhol self-portrait for 1:40."
    },
    {
      "rating": "4",
      "text": "Wow. What a waste of money and time. This is a very highly stylized movie. I really didn't like it because: (a) it is not believable on any level, (b) I couldn't empathize with the characters at all, and (c) it lacks drama... half-way through the movie I was still waiting for something significant to happen. Throw in significant over-acting and you have a movie that I don't think I would even watch on my TV at home. Yes, it is visually stunning. That's about the only positive aspect it has."
    },
    {
      "rating": "10",
      "text": "If at any point you ever doubted director/writer Wes Anderson’s visual poetic skill, The Grand Budapest Hotel should slap some sense right back into you. Anderson’s newest film is as absurdist as it is serious, as artistic as it is comical, and as real as it is unreal. Instead of using the illusion of film to emulate realistic circumstances, Anderson uses reality to write poetry and turn it into something of a fantasy, a stylish nursery rhyme for adults. His efforts are beyond respectable – even beyond laudable – and although it’s early to say, I doubt any comedy this year will usurp Anderson’s throne.\rSome may argue that Anderson’s cinematographic style – ridiculously symmetric frames, angular pans, and a severely limited color palate, for starters – has become more of a shtick by now, a self-mockery of sorts. However, The Grand Budapest retorts that Anderson is not banking on these techniques to carry his film. Rather, they have become the backdrop to his stage, his hour-and-thirty-minute signature all over the film. Looking beyond that, the viewer discovers how much Anderson has truly matured in his narrative, writing, and directing skills. Behind the Anderson façade is a truly significant and beautifully crafted film, rife with guiltless humor, dramatic progression, and plenty of gasp-inducing moments (some from sheer admiration, and some from severed fingers).\rWith The Grand Budapest, Anderson is not looking to write a film; he wants to tell a story. Principally evident in the multilayered frame narrative, he wants the audience to feel like they’re being told a story passed down among generations, re-imagined in fanciful colors and whimsical set pieces. The structure and timing of the storyline is absolutely flawless – the film never skips a beat. Neither over-edited nor under-edited, the story expresses capricious originality while maintaining gravity and poise. Like many of Anderson’s films, the writing is laced with subtle sociopolitical themes – however, with the turmoil of war and aristocratic corruption running concurrently with the plot, these themes tend to remain in the foreground of the narrative. Which isn’t a problem, because instead of detracting from the film’s hilarity, they instead add to its reputation.\rThe Grand Budapest is gifted with a strong cast, lead by an impeccable performance from Ralph Fiennes. You would not have instantly pictured Fiennes as the ideal actor to play M. Gustave, the charming, fruity, and unashamedly frank concierge of the legendary Grand Budapest Hotel. However, once you see him in his prime, you can’t imagine anyone else better suited for the role. Just about everyone in the Anderson ensemble makes an appearance, Tony Revolori makes a stellar big-screen debut as the wide-eyed lobby boy/companion to M. Gustave, and Willem Dafoe plays an uproariously threatening and stylishly scary assassin, just to name some standouts. Anderson proves, for the umpteenth time, he is just as great a director as he is a writer, orchestrating many of the action/chase scenes with skillful awareness and a definite vision. Barney Pilling and Anderson work together to produce arguably the most appropriate editing I’ve ever seen in an Anderson film. The quick, sharp, and angular cuts sustain the storytelling vibe while preventing the boisterous colors and set pieces from becoming a strain on the eyes. In summary, The Grand Budapest Hotel is a powerfully designed, painstakingly acute, drop-dead fashionable, and laudably jocular comedy-drama that represents Wes Anderson’s skill set in his prime. We can only hope that he continues to create films that shine with such ingenuity and technical finesse.\r FINAL SCORE: 95 (almost perfect ----------o---------- perfect)"
    },
    {
      "rating": "1",
      "text": "HORRIBLE!! Very disappointing show....!!  Would not recommend it to anyone. Would have suggested we leave the theatre except that it would have been disruptive to others... do not waste your money!!"
    },
    {
      "rating": "9",
      "text": "Other than Schindler's List, this is probably Ralph Fiennes' best work. He's hysterically funny, and his supporting cast is also incredibly solid. Wes Anderson has such an amazing sense of style - his shots/locations are just beautiful.  From Anderson's catalog, I would give Moonrise Kingdom a slight edge, but only slight.  Definitely stay throughout the credits - the music is infectious."
    },
    {
      "rating": "5",
      "text": "There is a difference between having a style, and copying the style of The Royal Tenenbaums. Unfortunately this film is more of a copy, filled with cameos and fake characters. I almost wouldn't have been surprised to see a muppet to pop up at one point. The best Anderson films are the creative, inspired ones with characters you care about, which is basically all of them up until The Grand Budapest Hotel."
    },
    {
      "rating": "1",
      "text": "I promised I'd never see one of his dreadfully made things again. But again the reviews convinced me it would be a watchable thing for a broad viewership that I needed. Again: never again. Puerile and pretty much pathetic in that every decision Anderson makes is terrible and the film ends up as a series of little fun but cheap turns. Exudes mediocrity at every gesture."
    },
    {
      "rating": "5",
      "text": "You can either love or hate Wes Anderson, or you can love and hate him at the same time. Unfortunately, The Grand Budapest Hotel has torn me apart. It is undeniably perfect Anderson: obsessive and strict design, colour palettes, composition, framing and blocking. However, it is essentially missing something; my emotions traversed from sheer boredom to stifled laughter to disorderly admiration. My conclusion is that Anderson has become too overworked; I dislike him for this, yet at the same time a part of me admires the man for his precise ingenious.\r The film starts and immediately you taste Anderson’s stop-motion style with precise camera panning and boxed framing. The film then jumps through three prologues of time, with the familiar Anderson narration and expose of shots, until we land ourselves at The Grand Budapest Hotel between the wars in a fictional state of Europe. What follows is a story of chapters with crimes, chases, mischief, rivalry, envy and even slapstick comedy. It is all tightly wound and then released like a chasm, the chapters seem somewhat disjointed, the acts become emotionally sterile and ultimately there isn’t a chance for the story to coerce.\r We are presented with the same Anderson, but also a new Anderson. He presses on his comedic roots and concentrates on the physicality of funny. M. Gustave (Ralph Fiennes) is the prime consent for this, and Fiennes is brilliantly on key creating a few treasurable notes of laughter. On occasion, this isn’t just through material act, but also sharp, witty and almost obscene dialogue. In one scene, he utters to the new lobby boy (whose elder self is predominantly narrating the story – F. Murray Abraham). “When you’re young it’s all fillet steak, but as you get older, you have to move onto the cheaper cuts.” If you like Anderson for his melancholic charm and grounded representations of struggling individuals in a fantastical yet realistic world (think Moonrise Kingdom and The Royal Tenenbaums), then don’t have high expectations for this, you won’t get what you came for.\r This film is being highly applauded (a reason for my great expectations), yet for all the same reasons, the obvious stylistic reasons. I haven’t seen a single review commenting on how they related to the story on a personal or cultivating note. Are we focusing on a cinematic story here, or what appears to be a theatrical and all-too whimsically clever telling of one?\r Lastly, I will mention what is palpable and largely unsettling: the ensemble cast of great name actors all battling for a screen spot. A great cast list can give a film much admirable credit, however Anderson has gone a bit overboard here, with Harvey Keitel, Bill Murray and Owen Wilson popping up for five or so minutes, the story becomes even more fictitious and preposterous. I won’t list the rest of the cast, simply search it on IMDB or watch the film, but it is certainly remarkable yet somewhat heedless.\r It was a muddled evening, and to be honest I am still rather mystified amidst my contemplations on the film. Frankly, I was disappointed and the film is no more than what Anderson’s lavish style makes it. One might say you are better off trying to watch it inside out."
    },
    {
      "rating": "3",
      "text": "This movie and its 8+ rating perfectly shows, how holiwood has gone down. The drama never reaches climax in a weak story. Not many touching movie. The story starts at around 30 minutes and Ralph Fienes delivers too many unbelievable dialogue. None of the characters create any emotion and touches the viewer.\rToo many A list artists don't make the cut."
    },
    {
      "rating": "9",
      "text": "Wonderful and delightful and funny and inspired. Made with Wes Anderson's normal fastidious attention to detail, with careful compositions and eccentrically droll characters (with the exception of the inspired M. Gustave played by Ralph Fiennes, a mannered sophisticate with just the right amount of rapscallion that instead of quirky tics, he's a man of desires and decency, an almost real human being).\r The Grand Budapest Hotel operates on a more plot-centric level than any of Anderson's previous films, and yet retains all his charms and idiosyncrasies, yet by not flaunting his mannerisms as character development or deepness of thought, he actually winds up saying more about everyone and everything by letting them speak for themselves. The melancholy passing of the old world is captured in the sheer joy and exuberance of the scenes taking place there, so that when we are lurched back to the present and the film slows down and hits the notes of normal Anderson faire, it carries with it a sense of loss and sorrow.\r The juxtaposition of the looming war, with its brutality and chaos, also inspires the scenes in the past as they are full of atypical for Anderson indecency. From the dropping of F-bombs to the explicit, yet not grotesque, gore. These seeming anachronisms, that work on two different levels, are both funny and deep and since they don't just have to be deep they actually work perfectly.\r The movie plays out in three different aspect ratios, a fun little treat for cinema fans who notice. Although it should be said that the majority of the film takes place in the past and as such uses a near full screen ratio (a relic of old European films), which is a little disappointing considering how gorgeous the filmmaking is. It could have been bigger and better."
    },
    {
      "rating": "9",
      "text": "We are not even halfway through the year yet and I have may have just seen the best movie of 2014. Wes Anderson has once again delivered another excellent film that is a must watch. Film buffs and Wes Anderson fans will adore it immediately like I did and if you have never seen a Wes Anderson film before take it from me that you are in for a treat. However, far away the nearest theater showing this film is from your house it is worth it as this is an excellent film and I rarely say that when reviewing a film. Watching this film makes me want to watch the rest of Wes Andersons movies because I really hope that they are all as outstanding as the two I’ve already seen. This film also has me excited about whatever Wes Anderson is doing next. IF it isn’t clear already this is an amazing movie that needs to be seen by everyone (although maybe not the kiddies). Oh and one more thing make sure you stick around during the credits. Trust me."
    },
    {
      "rating": "10",
      "text": "First, and foremost I can't even begin to delve into this miraculous piece of filmmaking without first, thinking it's director. While my sheer words, simply can't due the film any justice whatsoever. Wes Anderson, the creative mind behind the classics such as; \"The Royal Tenenbaums\", \"Rushmore\", \"The Life Aquatic: With Steve Zissou\" and last years amazing \"Moonrise Kingdom. Anderson also directed the great kid flick \"The Fantastic Mr. Fox\". All of Wes Anderson films feature a zany, wacky, and fun energetic appeal, that not only make them insanely hilarious; but, unforgettable. His latest, \"The Grand Budapest Hotel\" is quite possibly his greatest achievement. The writing is simply put, terrific. There is of course the grand ole Anderson appeal, however, this film is more sharp and on target every step of the way. The success can also be attributed in part to the incredible cast of characters. Ralph Fiennes undoubtedly steals the show portraying Monsieur Gustave H, a loyal concierge of the \"Grand Budapest\". But I also have a feeling that audiences will be shocked by the real and authentic performance, that is turned in by newcomer Tony Revolori. This day and age in cinema were not usually graced with the pleasure of originality, in fact it's rather come and gone. Thanks to Anderson, and his creative ingenuity, chances are you're not just going to be laughing hysterically (and trust me, when I say, YOU will) but feel a sympathetic story of love, jealousy, rage, and betrayal. \"The Grand Budapest Hotel\" basically has something, for everyone.\r The story (written by sir, Wes Anderson himself) takes place across the span of a few different time periods, split up into several parts. In the present the audience meets Zero Moustfa (F. Murray Abraham) the new owner of the Grand Budapest, who recalls his life as an infamous lobby boy, under the strict direction of notorious concierge, Monsieur Gustave H. Rewinding back to 1932, Gustave (Ralph Fiennes) is a gigalo, known for his endeavours with older women. After his most personal client, Madame D (Tilda Swinton) mysterious dies at the age of 84. Thus, in her will, leaving a priceless painting known only as \"Boy With Apple\" to sir Gustave H himself. Causing a spiral of events, framing the innocent man. However, with the help of his loyal sidekick, Zero. Will prove his innocence, once and for all.\r Speaking on behalf of the film's set design earlier. There is so much little, attention to detail, down to the last wall fixture. Chances are, moviegoers will not see a set like this one. Taking into account Wes Anderson's, corky cinematography, at the same time it has the look, and feel of an old fashion murder mystery caper. However, Anderson still leaves his watermark, in his inclusive character development, and vigorous storytelling capability. In other words, the film is not as spectacular without it's extremely talented band of actors. Ralph Fiennes, idealistically steals almost every scene, of every line. The comedic timing, and his rapid fire of lines, is nothing short of perfection. He is extremely funny when he needs to be, but also, emotional when the story line demands it. Newcomer, Tony Revolori, get's his first shot at Hollywood, starring in his first film. I must say, after this performance, he has a bright career ahead of him. The list itself, goes on and on. All of your regular Anderson favorites make their appearances such as; Owen Wilson, Bill Murray, Jason Schwartzman, Edward Norton, and Willem Dafoe. Who each have their great moments, and will leave a huge smile on your face.\r When it boils down, and the film reaches it's conclusion and climax. The deepest intentions of the film's plot may skew over the head of most mainstream moviegoers. Anderson's whimsical natures is still in tact, for most of the duration. However, he does deteriorate a tad, and makes this film more relatable with his characters. \"The Grand Budapest Hotel\" is like a well oiled machine. An assembly line, making the perfect movie. Everything is exactly in place, as it should be. Not to mention, extremely funny. In a new age, where sequels, reboots and adaptations are being jammed down audience's throats. There is a silver lining, and his name is Wes Anderson. Most people seem to be afraid to venture to their local cineplexes, as they should, paying upwards of $11 a ticket. The Grand Budapest, is one of possibly three movies a year, that is cinematic in all its aspects, and just amazing. Something that is extremely thought-provoking, serious, and has a message. I, myself was deeply moved by the inner connections with our characters. This simply goes without saying, \"Grand Budapest Hotel\" is easily the best film I have so far, seen this year.\r A+\r By: Nate Adams\r Directed By: Wes Anderson\rRated: R\rRun-Time: 100 mins\rRelease Date: March 28th (Wide)\rStudio: Fox Searchlight\rThanks For Stopping Buy."
    },
    {
      "rating": "8",
      "text": "Solidly good movie. Not for kids. Very mature content. It was surprisingly laugh out loud funny for being a very seriously themed movie! The acting was excellent, the writing was decent to good, and it is an interesting movie in terms of the ideas it presents on both modern and Europe past."
    },
    {
      "rating": "10",
      "text": "Wes Anderson is one of my very favorite director / writers and The Grand Budapest Hotel is his masterwork thus far. It's unbelievably beautiful to look at, hysterically funny, unpredictable and incredibly moving. I laughed. I cried. I enjoyed every single second of this fantastic masterpiece."
    },
    {
      "rating": "10",
      "text": "If you're in the mood for something really eccentric? You'll love it. If you were trying to choose between this and, say, Captain America? Wait until you're in the mood for quirky."
    },
    {
      "rating": "10",
      "text": "Wes Anderson does it again. It's one of few films that absolutely deserves all the praise it's gotten. The cast, especially Ralph Fiennes, does a fantastic job. They truly bring all the colorful characters to life. It's a true piece of art and well worth watching if you haven't seen it."
    },
    {
      "rating": "8",
      "text": "Yes, outrageous. Yes, extravagant. And yes, heartfelt and brilliant. The Grand Budapest Hotel is one of Wes Anderson's finest achievements to date. Holstered by a unique performance from Ralph Fiennes and a marvelous ensemble, the film soars high above Europe. Don't forget Tilda Swinton's brilliant cameo."
    },
    {
      "rating": "10",
      "text": "Charming, ironic, funny, sad and nostalgic story. Beautiful art direction, meticulously crafted characters and dialogues.\r One of the best movies of the decade for sure."
    }
  ]
}