{
  "id": 136,
  "title": "Prisoners",
  "starring": [
    "Hugh Jackman",
    "Jake Gyllenhaal"
  ],
  "runtime": 153,
  "genre": [
    "Drama",
    "Thriller",
    "Crime"
  ],
  "description": "Keller Dover faces a parent's worst nightmare when his 6-year-old daughter, Anna, and her friend go missing. The only lead is an old motorhome that had been parked on their street. The head of the investigation, Detective Loki, arrests the driver, but a lack of evidence forces Loki to release his only suspect. Dover, knowing that his daughter's life is at stake, decides that he has no choice but to take matters into his own hands.",
  "year": "2013",
  "rating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/tuZhZ6biFMr5n9YSVuHOJnNL1uU.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "Prisoners is a deep dark film, with a first rate cinematography, breathtaking performances, riveting editing, incredible dialog, and pretty much one of the best movies of all year. What makes this movie distinctive, is the opening silent sequence, the atmosphere its self, it is chilling and a gripping thriller, it is a tense talk film that kept me at the edge of my seat. It is maybe the best performance ever coming from Hugh Jackman, he is magnificent in this movie, the villains and the good ones, everyone in this movie has something wrong with them, and this is one of the things that I loved in this film. Prisoners is one of the best movies all year and highly recommended, I loved Prisoners."
    },
    {
      "rating": "8",
      "text": "It's a long movie but an engrossing one. The first half of the movie seems to be a metaphor for Guantanamo. Impotent rage leads to torture and possibly justice but definitely injustice. And at what cost? Scattered clues lead, if read correctly, to the inevitable truth about the kidnapping of the girls, but leave open to interpretation the moral paths taken and the outcome of a major protagonist. The audience is manipulated hither, thither, and yon, and it's all great fun if you stay objective and quite teeth grinding if you don't. The Director borrows heavily from many sources-these days who doesn't, and who can't-and it's quite a Pot Pourri of memory lane goodies. The last shot seems to be leaving us with an open ended question: \"You decide!\"\rJackman is great as a very loose cannon (Wolverine was a warmup?). Gyllenhall is all ticks and props and gimmicks. Dano is paid well for a mute, and Maria Bello is oh so wasted.\r Of course.................SPOILER................. there is one actor who is in this for an oh so obvious reason."
    },
    {
      "rating": "10",
      "text": "i think hoolywood sometimes makes really good movies, some of them are making you feel nervous, sky, scared, and prisoners is one of the few movies that makes that, the acitng is amazing, the cinematograohy pfffff beautifull, but the most important thing is the script, its the best script i saw.\rBEST MOVIE EVER"
    },
    {
      "rating": "9",
      "text": "O K.... I was impressed with the fact that there was no eye popping special effects or slick or outstanding  on location shooting. This was filmed in an average neighborhood  and a slum type of area and so to get this many excellent reviews only two things can hold up a movie such as this and that is story line and acting... Both of which are excellent"
    },
    {
      "rating": "10",
      "text": "'Prisoners' deals with kidnappings and serial killers. But there's a twist. This time the father of the abducted child loses hope in the law and runs an investigation in parallel with the police.\r Keller Dover (Hugh Jackman) is an ordinary father until his daughter is picked up in the vicinity of his house along with the daughter of his good friend Franklin Birch (Terrence Howard). At first he trusts in the detective assigned to the case, David Loki (Jake Gyllenhaal), to find their daughters. But when the man suspected in the kidnapping, Alex Jones (Paul Dano), is released due to lack of evidence, he takes matters into his own hands and abducts him in turn. Dover devises crueller forms of torture when Alex doesn't budge. The Birches get involved. Dover tries his best to keep his imprisonment of Alex a secret.\r Two cases attract Loki's attention as he looks for the girls. The connection between them and the main case becomes apparent as the plot advances. A man runs from him during a candlelight vigil for the girls. He has a sketch made and hunts for him earnestly.\r There are a few red herrings and then a few Chekhov's guns. There are a few clues for those who keep a watchful eye. By the time the movie ends you feel sorry for some characters you might have been hating until that point. Unfortunately, not much can be revealed about that without risking to spoil the whole experience for the viewer. Prisoners is the sort of film that forces you to think about it for a while after you're done watching. There were a few puzzles I was still mulling over in my head and had to discuss with people to get their take on it. But rest assured that everything that is worth including is included in the theatrical edition.\r The two investigations eventually end up at the same place, and the ending is bittersweet. I think it was well done, contrary to what everyone else has been saying about it.\r Roger Deakins lives up to his name. Every scene was exquisitely shot. The film was well edited. At a running time of two hours and twenty six minutes, Prisoners is a fast paced drama that never relents and constantly surprises and amazes at every turn. The characters were well drawn. Hugh Jackman depicts the anguish of a grieving father with poignant scenes. Jake Gyllenhaal portrays the detective as a distinct, somewhat eccentric, and extremely dedicated man married to his job. I couldn't find any weaknesses in the script. The plot only progressed after making sure that everything that could be done to find the girls had been done. There were no imbecile moves made by anyone that contributed to the advancement of the story, except perhaps for one scene near the end, where Dover turns his back on someone he had reason not to. The tension and the sense of thrill was retained through the majority of the length of the film.\r It was an intelligent film made for an intelligent and vigilant audience, but the way it was shot and edited it also held the attention of those who don't have an attention span to boast of, so the element of urgency is perhaps what may have intrigued them and kept them awake."
    },
    {
      "rating": "9",
      "text": "Absolutely outstanding thriller with breathtaking atmosphere! Magnificent performance from Hugh Jackman and others, interesting scenario with some minor flaws, great characters. Conclusion  one of the best picture of 2013!"
    },
    {
      "rating": "9",
      "text": "You don't have to be a parent to experience the fright that comes from watching the new film Prisoners. On my usual strut out of the theater I am asked how I liked the movie, and I give my usual answer \"eh, pretty good\" until my review gets posted and that person sees what I really thought. With Prisoners, I came out of the theater a little shaken, and as most people probably did, made sure everything was alright every time they heard a noise in their house that night.\rThe film stars Hugh Jackman as Keller Dover, but the true star is Detective Loki, played by Jake Gyllenhaal. Prisoners is the story of Hugh Jackman's family, and Terrence Howard's family, having a fun thanksgiving dinner. The parents stupidly agree and let their children play outside, and that’s where we get the title Prisoners. The trailer is a little deceptive on how this scene plays out but ultimately ends up with the same idea that the kids were kidnapped by someone in an RV.\rThey find that Alex Jones (Paul Dano) was the driver, and that he basically has the IQ of a ten year old who speaks in this really high pitched mutter. As stupid as they think he is, he manages to quietly drop hints to Jackman that he has his child. Loki, a young detective, is assigned to the case and works mainly with Jackman to uncover what happened.\rThe movie takes some serious turns that make you share the emotions of the characters. Some of the minor cast members instantly become huge, and new characters are introduced on screen and join the flow of the movie easily. This single film had the best acting so far in 2013 with a very strong cast. Hugh was the parent that is willing to do anything for their child, which for a lot of parents was very relatable to. It's funny though because if he cared so much about his daughter, than he wouldn't have let her essentially run around unattended, in a creepy neighborhood in the first place.\rDespite the almost two and a half hour duration, I was almost off my seat on the floor the entire time waiting to hear the dialogue from every character. I cringed many times during the disturbing scenes (there were many), and they even managed to add in a couple jump scares. This is definitely not a movie to expect to half watch and whisper with friends in; because you will miss way too many details that you realize tie in later.\rEven after thinking deeply about Prisoners, I was left with too many plot holes, which led to a lot of unanswered questions, especially with the ending. It felt a little bit like Director Denis Villeneuve thought that it wasn't worth adding even more time to the film length to fill in some details, but it might have made the movie worth its longer time.\rThough most of the events in the film will probably not happen when you think about it, you are convinced during the film. There would be an unrealistic scene followed by a disturbing one, and you would be more focused on the suspense and disturbance, then the actual facts.\rDespite the negatives, Prisoners will entertain you whether it's through the edge of your seat thrill, or the relation to your own family. The film has already won two awards and has only been out nine days, and I won't be surprised to see it earn many more in the future."
    },
    {
      "rating": "9",
      "text": "Prisoners is one of those movies that keeps your eyes glued to the screen throughout the whole thing, and when the movie ends, you want more. Hugh Jackman's performance is Oscar-Worthy and Jake Gyllanhaal is amazing, too. With a thought-provoking story in hand, the movie finds ways to use suspense and a great score to back it up. The movie could've been edited a little bit, but other than that, this was a riveting drama that has a complex story at its core, and is extremely hard to forget, and is one of the best movies of 2013. Bravo."
    },
    {
      "rating": "8",
      "text": "Prisoners is a dark emotionally heavy two & half hour movie. The acting performances by Hugh Jackman and Jake Gyllenhall are really well done. Its like Hugh Jackman is really going for an Oscar here. It was a bit on the long side and I thought a few parts of it could have been taken out without affecting the story. You really see a family suffer here and a wild journey to show what lengths a parent will go to, to find their child."
    },
    {
      "rating": "8",
      "text": "The film was riveting for the first 2 hours with a few lapses in basic police work, but  then it got silly!  Here comes a spoiler  A father who was willing to give up everything to get his daughter back would never have caved in so easily at the end.  That annoyed me to no end, but the performances by Jackman and Gyllenhaal were superb and the film is well worth seeing but don't bring anyone squeamish!"
    },
    {
      "rating": "10",
      "text": "I absolutely LOVED this movie! It's full of suspense, and that ending! Wow! 10 of 10 for SURE!!  I'd watch this movie again in a HEARTBEAT! Only thing i didn't like about it were the torture scene."
    },
    {
      "rating": "10",
      "text": "I give this film a '10' score, as I was completely captivated from the first frame to the last.  However, it is not a film I could recommend easily to others.  It is brutal and violent, and certain scenes are very hard to endure.  This is how it was meant to play out, though, and all credit is due to its director, Denis Villeneuve, and its cast, headlined by Hugh Jackman and Jake Gyllenhall.  But to me, the most shuddering aspect of this story must be credited to the great cinematographer Roger Deakins, whose camera absolutely made prisoners of the audience in depicting the cold, the gloom, the rain & snow, and the hopelessness of the Pennsylvania landscape in winter.  (All the more impressive as the movie was actually filmed in Georgia.)"
    },
    {
      "rating": "10",
      "text": "This movie had a crazy plot that ended up unwinding crazily like Training Day. The whole experience was pretty much just like a nuts banana. I saw it with my grandma and she actually  her pants. Awesome movie."
    },
    {
      "rating": "8",
      "text": "Brilliantly acted, written, directed. I think its one of the best thrillers in years. It does drag at times but its still very gripping, and very tense."
    },
    {
      "rating": "10",
      "text": "Prisoners hold your attention and make you feel anxious all the time and even in the end it makes you still thinking about it, the story is also memorable and very hard to forget, Hugh Jackman comes with a amazing performance, it's one of the better movies of the year."
    },
    {
      "rating": "8",
      "text": "risoners is an unforgettable, complex film that is beautifully shot and emotionally resonant even if it suffers from poor pacing and some unnecessary plot points."
    },
    {
      "rating": "9",
      "text": "absolutely massive film the movie gave the emotion of losing a part of life and aside of gave the emotion of founding them there was very violence in the middle.an extra ordinary thinking motion gave in last part of the movie.it was anxious."
    },
    {
      "rating": "10",
      "text": "Prisoners is an Oscar worthy film it could probably win. I 'm not sure if the movie or anyone is nominated but Gyllenhaal gives the best performance in this as Detective Loki a Twitchy,Calm Determined detective. Jackman and Terrence Howard are both friends who lose their youngest daughters from Kidnapper(s). This movie is Amazing, Dark, Gritty, and Perfect my favorite movie of 2013. People thought this movie was too predictable but i didn't especially know who the Kidnapper is I definitely only suspected the correct person minutes before that person was revealed. Anyway this is a Must See"
    },
    {
      "rating": "10",
      "text": "a realistic thriller without police with i.q 150 where just looking at the crime scene already know who the suspect was.brilliant performances and photography near perfection."
    },
    {
      "rating": "10",
      "text": "Who: Hugh Jackman, Nightcrawler, and Young Brian Wilson\rWhat: Arguably the best thriller ever made\rWhere: A dark, terrifying part of Pennsylvania worthy of Shyamalan\rWhen: September 20, 2013\rWhy: Do you like mystery thrillers? Look no further, this is the best one I've ever seen. What about The Usual Suspects? Not a mystery, if Kevin Spacey is in a movie he's the bad guy. What about The Bourne Identity? This is an original plot, not Matt Damon pretending to be Wolverine. What about The Machinist? Really Google? The Machinist? I google best mystery thrillers and you give me Christian Bale starving himself for ninety minutes? Take it from me, this is a solid mystery with a truly evil villain and the last 20 minutes will leave you at the edge of your seat."
    },
    {
      "rating": "8",
      "text": "Despite trailers that made it appear to be a standard revenge film along the lines of Taken or any number of Harrison Ford flicks, Prisoners actually has a lot more in common with Mystic River.  That is to say that it is a dark, morally complex thriller about men whose need to protect their families leads them to dark places.  I'm not sure that all of the plot twists add up, but the film is completely absorbing and delivers an ending that is poetic justice at its finest."
    },
    {
      "rating": "7",
      "text": "Overall I liked Prisoners. I will admit I was not that engaged for a good chunk of the movie. The movie had me at some parts but lost me a good chunk of the time but towards the end the film got going and I finally got the thriller I wanted to see. I just wish I had gotten there sooner. If you want to see this movie keep in mind it takes forever to get going, it has some gore, and that there is no guarantee you will be satisfied with the ending that you had to sit through almost two hours of nothingness to get to. While the film could have been shortened this film had enough engaging scenes, especially at the end, to make glad I saw it. While the film can be slow and dull at times, the third act of the film makes it worth the wait as some really interesting/horrifying/shocking stuff happens making it worth a look."
    },
    {
      "rating": "8",
      "text": "Denis Villeneuve has a keen eye for the dynamics of every day life  he perfectly captures the lives of the families who are hit by this tragedy. In a matter of the first minutes of the film, we quickly realize who these people are. Their grief stricken despair is the more real, since the film never goes for a sensationalistic approach. There's a certain hint of Dennis Lehane's novels in the screenplay, but the characters are deftly presented, and the suspense is built progressively. The atmosphere that is built is certainly oppressive and bleak, but the film is elevated by the fantastic cast: Hugh Jackman, Jake Gyllenhaal, Melissa Leo and Paul Dano, all deliver more than impeccable performances. A great film worth watching."
    },
    {
      "rating": "9",
      "text": "Faced with every parent’s worst nightmare, is it ever justifiable to take matters into one's own hands? This very accomplished thriller definitely asks the question. The whole cast is amazing but the director needs to take a lot of credit for stitching together the parallels of their approach to the same incident through the remarkable dramatic performance of Hugh Jackman as a father in distress which is equaled by the quietly assured one of Jake Gylenhall of the investigator in charge of the case."
    },
    {
      "rating": "7",
      "text": "It happens on a happy Thanksgiving: Two families who have gathered to celebrate discover their daughters have disappeared. While there's a cop on the case (Jake Gyllenhaal), one of the fathers (Hugh Jackman) decides to take matters into his own hands (with some unpleasant results). This isn't really a revenge flick, as much as an often intense crime drama. The cast is uniformly excellent and much of the movie is compelling, but the 2 1/2-hour length could have used some cutting. Much of the middle simply drags on. That being said, it's a complex story that's effectively told."
    },
    {
      "rating": "8",
      "text": "Although I felt somewhat manipulated while watching, Prisoners was admittedly mesmerizing.  When the film ends you might be scratching your head and asking what certain people or events had to do with the plot.  I know I have several unanswered questions.  Still, this film was about 2 1/2 hours and I never looked at my watch.  I thought the acting was superb across the board, and the pacing excellent.  Good film to watch during Halloween time because it is creepy for sure."
    },
    {
      "rating": "10",
      "text": "Maybe this movie is one of the best I've seen in m life, which makes it honor his name in Spanish \"La Intriga\", it was just a roller coaster of a dark feeling, performing hypothesis than ever I was right and that I love and for my eyes makes an excellent movie.\rJackman and Gyllenhaal were fantastic.!"
    },
    {
      "rating": "9",
      "text": "Deep, dark, and disturbing. \"Prisoners\" provides a complex and excellently written plot with characters that feel human. It's also takes a look at how far a parent will go to protect their child. All of this is backed by an excellent cast who all give amazing performances. It's the type of film that gives us a look at the morally gray side of humanity. It's not for those who shy away from violence, but I recommend it to those who are looking for thriller that will keep them on the edge of their seats. Truly an outstanding movie."
    },
    {
      "rating": "9",
      "text": "Maybe a bit long bit thrilling throughout.  Sometimes I forget how good of an actor Hugh Jackman is because of movies like Wolverine that I have no interest in, but he is riveting here.  He drives a powerful screenplay that is tense and foreboding.  Definitely not for those who are squeamish, but there is a moment in this film as powerful as anything in 12 Years a Slave that will break down your defenses that is almost in itself worth the price of admission."
    },
    {
      "rating": "7",
      "text": "A mostly mediocre film with some incredible performances. The plot itself tugs at heart strings a tad too much but its okay since the ending and acting are downright fantastic. Gyllenhall and Jackman are incredible and frankly its surprising to see the lack of love for them in this awards season. Even when the scene seems trite and overwrought with melodrama these two, neigh, the cast seems to ground it with force and believability unlike any other performance this year. The ending too is handled marvelously, making a perfect balancing act between meaningful and happy go lucky."
    },
    {
      "rating": "10",
      "text": "This movie kept me on the edge of my seat.  The characters and acting were amazing.  The twist and turns kept you contemplating who was the real culprit for the disappearance of the two girls.  Everything was perfect.  Hugh Jackman and Jake Gyllenhaal cary the movie.  Well Done!!!"
    },
    {
      "rating": "7",
      "text": "Prisoners is a prime example of why I will never understand Hollywood. You've got a truly great story, an all-star cast, and a world renowned Director, making his American debut. Prisoners was considered to be an Oscar caliber film before it was even released, yet for some reason they had to make it nearly three hours long. If there was enough story for a three hour film, then I'd be all for it, but Prisoners has a good 45 minutes worth of repetitiveness, that does nothing to help the movie, in fact, it takes something away from the film. The story begins on Thanksgiving, when two little girls go outside to play and disappear. Feeling that the police aren't doing enough to find the kids, one father (Hugh Jackman) decides to take matters into his own hands. Hugh Jackman stars in a role I wouldn't have imagined him playing in a million years. Based on his other roles and what I know about the man, this doesn't even seem like the kind of role he'd be interested in, but he gives one of the strongest performances I've seen all year, I really didn't know he had that in him. Jackman is paired by Jake Gyllenhaal, another guy who I couldn't see playing a tough as nails police detective, but he too surprised, giving a very strong performance. The cast isn't the problem and the story isn't the problem, what bothered me about this film was how much of it was unnecessary. Did we really need dozens of scenes with Jackman and Dano or all the talk and sadness amongst the families? This was a great all-around movie, but it was so long, that by the end, I'd stopped caring about what was happening and just wanted it to be over. Don't get me wrong, I highly recommend this film for a unique twist on classic story, great performances from an unlikely cast, and the work of a Director who his known around the world for his signature style, but just a word of caution. Prisoners is a very long film, that at many points seems to go around in circles. When they eventually do get to the point, it's outstanding, but it takes a while to get there."
    },
    {
      "rating": "9",
      "text": "Denis is quickly becoming one of my favorite directors. From the masterpiece Bladerunner 2049, the brilliant Sicario and the ditto Arrival. Prisoners is one of his earlier films, but still a must see. Its dark, gritty and with som excellent performances from the entire cast. Like Blade runner ( and his others filmt) Prisoners takes its time to tell the story, and it never rushes to explain a point."
    },
    {
      "rating": "8",
      "text": "With several incredibly strong performances and beautiful direction, this film reaches every aspect of our emotions. It is not often that a film of this measure can hold our suspense, but this one does."
    },
    {
      "rating": "8",
      "text": "What a ride  exhausting  and just when you think you have it all figured out,  The performances are excellent with Jackman and Gyllenhaal great foils for each other.  The only character that's poorly written is Terence Howard as the young Birch girl's father and the problem is that he's drawn as one-dimensional, the sensitive man who cares.   This is definitely a dark, violent journey and reflects perfectly the horror that enters every parents' head at just the thought of a missing child."
    },
    {
      "rating": "8",
      "text": "Really good film. The acting, especially by Jackman and Gyllenhaal, was really good and believable. In addition, the directing did an outstanding job creating the mood. You felt sad when you were supposed to feel sad and you felt scared when you were supposed to feel scared, etc. Overall, a really tense and dark film that is quite successful all-around."
    },
    {
      "rating": "9",
      "text": "I wasn't really interested in this movie until reviews started coming out, but even then i thought \"it will probably just be a typical kidnapping movie\". No. Jesus, no. It's an incredibly dark movie with a terrifyingly plausible story that keeps you interested all the way through (and the ending...dear god the ending). Some really great direction here and some terrific acting, Hugh Jackman and Jake Gylenhall (sorry if I'm spelling that wrong) both deserve Oscar nominations. Definitely check it out if you're interested."
    },
    {
      "rating": "8",
      "text": "Una piccola e sonnacchiosa comunità in mezzo ai boschi viene messa sottosopra dalla sparizione di due bambine. Il primo sospettato, Alex, ha un’età mentale attorno ai dieci anni e non sarebbe capace di organizzare un rapimento, almeno da solo: il poliziotto incaricato delle indagini, l’ispettore Loki (sì, proprio come il fratello di Thor), lo lascia andare e inizia una paziente indagine partendo quasi dal nulla. Keller Dover, il padre di una delle due bimbe, si autoconvince però che Alex (il cui aspetto, in effetti, inquieta un po’) sia in qualche modo colpevole, lo sequestra e non si ferma davanti a nulla per cercare di farlo parlare. Le traiettorie dei due viaggiano quasi in parallelo fino alla fine, dove, seppure in modo involontario, Dover finisce per aiutare Loki a squarciare l’ultimo velo: nel frattempo, l’ispettore ha ribaltato il classico sasso che nascondeva un verminaio, scoprendo che il paesino, oltre che sonnacchioso,  pure un po’ omertoso e comunque incapace di vedere, o ammettere, le brutture che vivono sotto la superficie. Se Dover rappresenta la violenza che cova all’ombra delle maschere che destano meno sospetti, nelle cantine delle linde casette immerse nel verde sono occultati segreti che pare impossibile che vengano ignorati e il tutto ruota intorno a una religiosità opprimente capace di scatenare demoni incontrollabili: oltre alle patologie psichiatriche, il risultato  un inquietante deserto dei sentimenti  compresi i genitori delle bambine che, in un modo o nell’altro, si chiudono in se stessi senza riuscire ad aiutarsi a vicenda  che mette in seria discussione l’idea di piccola comunità solidale. Insomma, c’è del marcio in Pennsylvania (ovvero, più genericamente, nella provincia americana) e a testimoniarlo ecco allora tutta una serie di simboli, a volte forse troppo evidenti, a partire dal sacrificio di un innocente cervo già nella prima scena per arrivare ai serpenti striscianti qua e là: uno sguardo critico non certo nuovo ma che non intacca l’essenza del film, anzi contribuisce ad aggiungere ulteriore efficacia a una storia ben scritta e ancor meglio filmata capace di appassionare dall’inizio alla fine malgrado le oltre due ore e mezza di durata complessiva. Unendo una tensione di stampo  con sensazioni opprimenti da ‘Il silenzio degli innocenti’ (tanto per citare un titolo), Villeneuve, assieme allo sceneggiatore Aaron Guzikowski, trova il ritmo adatto per costruire le giuste atmosfere per il genere, oltretutto alle prese con un argomento non facile come sempre quando vengono coinvolti i più piccoli: ne esce una solida struttura filmica immersa in una luce fredda e ormai invernale ben fotografata da Roger Deakins tra uno scroscio di pioggia e una spruzzata di neve (l’azione si svolge nella settimana successiva al Ringraziamento). Il regista canadese sceglie uno stile essenziale, con la macchina da presa che si muove solo quando  necessario concentrandosi spesso sui volti dei personaggi, nel segno di una netta preferenza per l’evoluzione psicologica rispetto all’azione (anche se sarà difficile dimenticare l’impatto emotivo della corsa notturna in macchina di Loki per salvare la piccola Anna): Importante  anche il contributo del cast che si distingue per interpretazioni tutte di ottimo livello: le due mamme addolorate Viola Davis e Maria Bello (che forse avrebbero meritato maggiore spazio), l’altra madre Melissa Leo anche al netto di qualche gigionismo di troppo e, soprattutto, i due attori impegnati nei ruoli principali. L’australiano Hugh Jackman presta il volto a un personaggio complesso come Dover sottolineandone le ambiguità, perché, se  vero che non siamo di fronte a un giustiziere della notte,  indiscutibile che dietro alla figura tutta segheria e famiglia già si agitasse qualche fantasma  ‘prega per il meglio, ma preparati al peggio’  che poi esplode portandolo oltre qualsiasi limite dell’accettabile anche considerando la sua dolorosa condizione. Di fronte a lui, ci sono i dubbi e la determinazione di Loki, ennesima figura di poliziotto amareggiato dal mestiere che pure, tra errori e incertezze, giunge a una soluzione che non serve certo a rasserenarne l’animo: nei suoi panni, tra misteriosi tatuaggi e un insistito tic agli occhi, Jake Gyllenhaal dà vita a una prova davvero notevole che finisce per farlo preferire, seppur di un nonnulla, ai suoi compagni di avventura."
    },
    {
      "rating": "9",
      "text": "Heavy, dark, slow, disturbing, thought provoking, but entirely gripping. Contrary to popular opinion, I thought Gyllenhall and Jackman both overacted a bit. But the great performance of this one is Melissa Leo, who should be nominated (again) for an Academy Award. Totally convincing in her role. The plot is convoluted (though it does make sense, if only on reflection) and the pace is glacial, especially at the beginning. But it is a measure of how well directed the movie is that by the end you realise the pace is exactly right for the tone and the nature of the investigation at hand. There are multiple perspectives and revelations, some extremely fleeting, and while the movie is long and quite oppressive, there is also wonderful economy in the direction and script. A triumph. Villeneuve even gets something new out of a car chase scene, which is a miracle in itself."
    },
    {
      "rating": "8",
      "text": "After about 20 minutes Prisoners begins to feel like it is going to be another paint by numbers, seen it all before kidnap drama. However, the longer it goes on (and it is a long watch) the better it gets. Subsequent twists, turns and genuine surprises of the extremely well constructed screenplay enables the movie to finally find its footing. The end result is a superior mystery thriller, even though a few questions do remain unanswered. The performances contribute a great deal. There is no denying that Hugh Jackman is very good here but he is playing a rather dislike able character, even given the circumstances. His frequent rants tend to dissolve into monotone. Jake Gyllenhaal is much better as the cop. With his constant eye tics and suspicious nature he is the true heart of what makes prisoners ultimately as good as it is. One constant irritation though, was the implausible fact that whenever he needed it no back up or help was anywhere to be seen. Perfection, as they say, is in the detail."
    },
    {
      "rating": "9",
      "text": "I witnessed many surprises this year and 'Prisoners' is one of those made me stun. With the big names in it, the movie revolves around a mysterious incident that puts two families into the sorrow. The deeply moving characters and its emotions are the movie's plus point and of course the great performance by the great actors as well. It is refreshing to see Hugh Jackman in a role the father to a missing child.\r A similar kinda movie to 'The Lovely Bones' where two young girls are go missing and their parent's never ending search for them begins. With a single clue they begin to dig every detail to bring back their children along with the help of a young cop. As expected character diversion had an important hand in mystify and confuse the viewers without falling for anything to conclude their prediction before it reveal itself.\r Fine photography. It was pleasant to see cool frames where there's no sun glare but always cloudy, shadow and dark atmosphere something like the movie 'The Awakening'. It brought real close to us the real grief of a family that we can almost feel it. Good or bad ending, the way it ends is all matters. In this story they give us an opportunity to take it either way as you want. One thing I was not convinced is the motivation for the abduction. The reason seemed to me a silly but in reality everything can be possible and sometimes it won't need reasons at all. Finally, it is a must not miss movie from the 2013 film calender."
    },
    {
      "rating": "8",
      "text": "Prisoners is a good, but extremely depressing movie about child abduction. It's a little too long, but Hugh Jackman gives the performance of his career and Jake Gylenhaal was good. Solid movie."
    },
    {
      "rating": "8",
      "text": "I give it a 8.5 out of 10. The film is tense, the cinematography is outstanding, the pace is perfect to the point I can say the two hours and a half fly like it´s nothing, enjoyable from beginning to end, unpredictable when it comes to the fate of the characters, you are invested the whole time, you care about it, the acting is on point and pretty much perfect from absolutely everyone in the film, and I mean it, everybody and many more good things. The only thing I could say against it is that it definitely is not an innovative film, we have seen this type of story many times before. That´s why I´m not giving it my strong 9 out of 10, which is like the biggest score I usually give a film. But so damn good. In my top 10 films of 2013."
    },
    {
      "rating": "9",
      "text": "Prisoners is a masterpiece. The best performances of Hugh Jackman as well as Jake Gyllenhaal.\rThis movie is the first to actually keep me on the edge of my seat. Prisoners has amazing cinematography with a great use of colors. Hands down one of the best movies of the year! Definitely a potential Oscar® Winner.\rThe trailer tells not even an eighth of the story. I went in to the theatree expecting one thing, and got a whole two and a half hours of twists and genius ideas.\rAlthough it's dark and somewhat scary, everyone has to see this at some point."
    },
    {
      "rating": "8",
      "text": "I was rather impressed with this film. It kept me interested all the way to the end with the extra element of mystery, which challenges the viewer to make sense of everything. The acting by all major characters was great particularly Hugh Jackman showing fear and rage at the same time. It's been a while since I seen a film like this.\r The writers of this film definitely succeeded in creating a story that is cryptic and compelling. At the end I thought back over the film to see how objects, people, and other things were connected to what occurred. I didn't even understand why and how things occurred or were connected which created a lot of discussion afterwards. My partner and I shared our thoughts of what we understood; it took both of us to make sense of it all. Good writing and that correct application of it certain shows when it takes two educated people to understand everything.\r This film also made me think about justice and what I would do: is the law always correct? Should we take the law into our own hands? Are laws too black and white? Whether intended or not this opens a dialogue about right and wrong, trusting police, and rational thinking."
    },
    {
      "rating": "10",
      "text": "My eyes were literally GLUED to the screen for 2.5 hours. I thought it would let up after 45 minutes. Nope. Acting is perfect. Shots are gorgeous. The plot suspends your sense of time. Every scene is captivating. And great ending. Best movie in a long time. How is this misunderstood by some? Don't get it. But hey, that's why art is subjective I guess."
    },
    {
      "rating": "8",
      "text": "Prisoners is one of the most thrilling films of 2013. A thrilling,dark film that deals with the subject of child kidnapping. The movie has an incredible atmosphere, and Roger Deakin's gorgeous cinematography helps set a haunting,bleak mood that permeates throughout the entire film. Rain is always falling, snow covers the ground, and darkness covers everything. The characters involved go through hell, and you as the viewer are engaged every step of the way. This is the best performance I've seen from Hugh Jackman,no doubt about that. I haven't seen him give a performance like this since Darren Aronofsky's 2006 film \"The Fountain\". Jackman immerses himself into the role of the father who will do whatever it takes to find his missing daughter. The other performances are great as well, but it's Jackman's that really stands out. Prisoners is one of the best movies of 2013, but it does have a few problems. The biggest one is that the script leaves a lot of plot-holes and the final act is rather unsatisfying.It's not a big gripe of mine, but the movie does fall apart a bit in it's final minutes. Nonetheless Prisoners is still a great film,especially for those who are fans of dark,mystery thrillers like Zodiac and Se7en."
    },
    {
      "rating": "9",
      "text": "This summer was one for the books.    With the exception of \"Despicable Me 2\", most highly anticipated films were duds, \"The Lone Ranger\" the biggest disappointment of all.    Fortunately this fall seems to be starting off much better, thanks to \"Prisoners\".\rIt's a first rate crime thriller with new developments at every turn, making it very difficult to figure out exactly what has happened, as the audience discovers the truth at the same time the characters do.    Hugh Jackman as always is excellent as the grieving and understandably manic father of a kidnapped daughter, along with her friend and the neighbor's girl at the same time.\rJake Gyllenhaal turns in a performance as good as Jackman's as the detective assigned to and determined to find the girls alive.\rOne critic reviewed this movie and slammed it all the way through, and just to show his ignorance managed to re-slam \"Mystic River\", so it's a safe assumption based on the fact that both are riveting stories and excellent movies, this critic either pans the good stuff just to be a jerk or doesn't know a good movie when it bites his ass.\rThe movie will keep you guessing throughout  I had misidentified the kidnapper at least three times. It is a dark and utterly humorless movie, but for those who like a good crime mystery, it's among the best.    While not similar in plot to the superb \"Shutter Island\", it does remind me of that unpredictable ending too.    Whether it's Oscar material is debatable, but it is one of the best movies of the year so far."
    },
    {
      "rating": "10",
      "text": "IS Prisoners 2 in the making?? I'll definitely hate to watch it, if does coz there are no rooms for a sequel..........................................."
    },
    {
      "rating": "10",
      "text": "Went into this movie expecting something good but nothing mind blowing. What I got was something completely unexpected. Prisoners is a gripping story that has a dark tone to it. Personally I like those movies but what made this movie different is the way they approach 2 characters in particular. Nothing is what you expect it to be and the ending was perfect. Possibly the best movie of the year so far. The only other movies I have given a 10 to this year have been Gravity and Captain Phillips. This deserves more attention and recognition than its getting."
    }
  ]
}