{
  "id": 63,
  "title": "Princess Mononoke",
  "starring": [
    "Youji Matsuda",
    "Yuriko Ishida"
  ],
  "runtime": 134,
  "genre": [
    "Adventure",
    "Fantasy",
    "Animation"
  ],
  "description": "Ashitaka, a prince of the disappearing Emishi people, is cursed by a demonized boar god and must journey to the west to find a cure. Along the way, he encounters San, a young human woman fighting to protect the forest, and Lady Eboshi, who is trying to destroy it. Ashitaka must find a way to bring balance to this conflict.",
  "year": "1997",
  "rating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pdtzEreKvKAlqa2YEBaGwiA45V8.jpg",
  "reviews": [
    {
      "rating": "9",
      "text": "An amazing film. The story and the characters just blew me away."
    },
    {
      "rating": "7",
      "text": "OK, its great. But damn its not that easy to follow. Its never truly clear exactly whats going on, but you do get the jist of thing. Great voice acting, and truly one of the finest animations ever - there were several scenes id consider to be classed...(read more) as Art - incredible detail, beautiful landscapes etc. Im a complete newbie to animated movies that are neither Disney nor the incredible South Park movie, so forgive my lack of love for the plot/style, but id certainly recommend others to watch this."
    },
    {
      "rating": "10",
      "text": "Brilliant. I love this movie. Everything from the story, to all the animations and characters were superb."
    },
    {
      "rating": "10",
      "text": "Completely outstanding - it is easily one of the very best films of the 90's."
    },
    {
      "rating": "10",
      "text": "Several years after falling in love with anime, I decided to watch this to see if it lived up to the hype. After watching this, I fell in love with anime again. Although several years old the animation has hardly dated, the plot is excellent, the characters are memorable. I gave this film to a younger cousin, she loved it. Princess Mononoke is one of, if not THE, best movie I have EVER seen. EVER."
    },
    {
      "rating": "9",
      "text": "This charming mythology and visual classic pits an environmentally despoiling mankind against the natural order. The real enemy is not man's greed but the polarization on both sides that leads each to hate the other - a lesson more should heed. A little drawn out, and the inevitable conclusion that nature bats last is reached, but all in all a non-judgemental and lovingly crafted work."
    },
    {
      "rating": "9",
      "text": "This was an excellent animation. why are some newspaper critics too stupid to realize this? I would have puta ten for this one. The only reason i gave it a nine is because I found some of the characters to be a little too odd to my liking (the god of the forest and the boars were strange)"
    },
    {
      "rating": "10",
      "text": "This is one of those films in which it's so good, that at the end you wish for another installment; a sequel, however you know there can't be one, for it would ruin the film's good name. Sheer visual beauty (lush greens of open, gusty fields and vast mountains that surpass imagination) meets an epic soundtrack the brings tears to one's eyes (a melody played throughout the movie which will stick in your psyche for years as you endlessly hum the adventurous tune to yourself and an ending piano number that, after hearing the song I previously described, might just make you burst into tears, as it casts a feeling of overwhelming spirituality that truly remains with you for a long time) In the end, the movie is about love, hatred, death, friendship, rivalry, happiness, anger, glee, sorrow, and being a human being. However, overall, it's about being alive. I never thought an animated film, let alone an anime, could be so purely great. If this isn't Oscar material, I have no clue in hell nor space what is. -Scott L."
    },
    {
      "rating": "10",
      "text": "Amazing film, why the mediocre critic reviews? I'd put this up with and maybe beyond spirited away."
    },
    {
      "rating": "9",
      "text": "\"Princess Mononoke\" is simply a masterpiece. The characters have the capacity to develop itself into any type; romance, action, horror, and so on. The story is simply linear but very symbolistic in diverse ways. It's a definite must-watch."
    },
    {
      "rating": "10",
      "text": "This movie is the best ever"
    },
    {
      "rating": "6",
      "text": "Princess Mononoke is one of Miyazaki's most violent movies. The film's great animation and easy messaging work in it's favor, but dull pacing ultimately makes Princess Mononoke harder to enjoy than some of Gibili's other works."
    },
    {
      "rating": "5",
      "text": "Has the usual problems of Japanese animated films (incoherent) along with the usual pluses (good animation)."
    },
    {
      "rating": "9",
      "text": "I would go as far to say that Princess Mononoke is as perfect a film as one could ever make.  Miyazaki has created an experience that is visually and emotionally arresting.  Each frame of this film could be sold as a painting, it's just that beautiful.  Miyazaki's message of tolerance, self-control, and finding harmony with our surroundings is equally beautiful  the amazing thing about Princess Mononoke's narrative is that there is no concrete antagonist; you could find something relatable and lovable about every character drawn to the screen.  The performances delivered by the voice actors  for the Japanese and English versions- are both top notch.\r This is a film that will survive the test of time due to its visual and thematic majesty, and each of these beautifully realized properties work together to make an experience that is easy to get lost in again and again.  Everyone should give this film a watch, it offers so much more to an audience than just escapism; it serves to delight as much as it does teach."
    },
    {
      "rating": "10",
      "text": "Anyone who says this is overlong, or that they hate it for being overlong, obviously was just paying too much attention to the length of the film and not to the film. This is probably - no, this IS - one of the best films ever made in the history of cinema, animated or live-action, along with his other masterpiece, Spirited Away. Princess Mononoke is so lush, and engaging, and it just captures you and doesn't let you go. It's a wondrous tale of MAN vs. EARTH, told spectacularly. This film hardly deserves a much less rating than Spirited Away. In fact, this film is better! It's only about 10 minutes longer than Spirited Away, so the critics can all go shove it. This deserves at least a 97 on the Metacritic score. All this movie's fans know that it is perfect, and all the critics giving it less than a - sayyyy - 95, are wrong."
    },
    {
      "rating": "10",
      "text": "The only animated epic I can think of that perfects human drama and the evils of industrialisation. An absolutely wonderful film that gives you goosebumps whenever you watch it a second time. It may even some viewers cry. This is not a kids movie, and Princess Mononoke shows that animation can tell stories that are impossible to tell through live action film. In case anybody is interested, this is also the movie (among others) that inspired James Cameron's AVATAR, especially the main story.\r In fact, AVATAR is basically a remake of this. Personally, this is the superior movie and I will remember it longer than that $237 million budgeted movie."
    },
    {
      "rating": "10",
      "text": "Hayao Miyazaki's first japanese animation debut in america to ever make such a grand classic like Princess Mononoke."
    },
    {
      "rating": "8",
      "text": "Great art design with some beautiful pictures. The story is not a good vs. bad klischee plot but offers various characters, all having their own reasonable motivations. Soundtrack is also great work. Still it lacks something to be truly a 10/10 movie."
    },
    {
      "rating": "10",
      "text": "It's a masterpiece, I basically grew up with that movie and so I have listened to it many many times both in English and Japanese. If you like anime you need to watch this."
    },
    {
      "rating": "10",
      "text": "Indisputably (in my opinion) Ghibli's true masterpiece.  Spirited Away is slightly overrated, but this is vastly underrated.  The story keeps going at a decent pace, but never feels forced.  The characters almost all experience some sort of development over the course of the film.  Also, the animation surpasses even Studio Ghibli's awesome standards.  The scenery is beautiful, and the near-apocalyptic climax is one of the most 'epic' scenes I have ever seen in any film.  Unless you truly hate all of anime, Studio Ghibli, nature, wolves and film, this will take your breath away.  I fail to see how it could be improved.  Do not let the length put you off."
    },
    {
      "rating": "10",
      "text": "\"Princess Mononoke\" is simply a masterpiece. I have watched it 3 times and I'm sure I'll watch many times more. why the mediocre critic reviews? I say mediocre because it is the best animation I've ever seen and I have seen lots of them."
    },
    {
      "rating": "10",
      "text": "This is Miyazaki's most intelligent and mature story.\r The characters are incredibly realistic, the nature-depicting art is beautiful as always, and there are multiple themes going on. This is an anti-war film, a environmental film, a film about life and death, a film about love and hatred, and a love story, all in one. This is not a film to miss."
    },
    {
      "rating": "10",
      "text": "This is my most favorite anime movie of all time!!! This movie is amazing and is absolutely gorgeous!"
    },
    {
      "rating": "9",
      "text": "Miyazaki's most gore piece that's actually rather for adults, I would say it's Studio Ghibli's darkest story and without a doubt their top 3 animations of all time"
    },
    {
      "rating": "5",
      "text": "Maybe I was spoiled by the hype around the movie, but I failed to enjoy it and I still think it's not one of Miyazaki's best works. The best thing about the film is the fantastic music by Joe Hisaishi - 10 out of 10 for the score. The animation is beautiful as well, but not outstanding when compared to other works. The violence depicted (cutting of arms and the like) does not seem to serve any purpose but means that it's not suitable for children, which is sad, because they might enjoy it more. The story and the characters are bland. The storytelling is careless at best. Many plot lines are dropped and never readopted. One example of this is the hero's love interest who gives him a pendant as he is forced to leave. She is never mentioned again. Character's motives aren't explored and seldom a character reflects on his deeds. I often read that it's great that the film does not try to answer the question of which characters are good or evil, but this aggravates the problem. It's also the explanation why many of the character's decision seem so indiscriminate. The film's pacing doesn't help here, as it is so slow to leave much time for thinking about all the gaps in the story. In conclusion: A beautiful picture with promising topic and setting which is ruined by sub-par story-telling and characters."
    },
    {
      "rating": "4",
      "text": "Slow, repetitive, longer than needed, and I didn't find any story aspect that could make me forget its awful rhythm. Artistically, meaning draw and music specially, it's great, but for me it's just an empty movie. Beautiful, but without anything to tell. Yeah, ok, it has that ecological and respect between cultures topic on it, but it has been done thousands of times before and after this movie with better results. I may give it a second chance, but I don't think it was just a bad day."
    },
    {
      "rating": "0",
      "text": "What the hell is wrong with the world. This was possibly the worst movie I've ehehever seen. I watched the whole thing on a friends suggestion, and I must say, it was the worst choice my friend had ever made. I hated it immensely, I know some people liked it, and I guess that's fine for all Asians and anime fans, but over all, it's horrible. And I wish I could rate it less then a 0."
    },
    {
      "rating": "1",
      "text": "I hated this movie, it was so hard to get through."
    },
    {
      "rating": "9",
      "text": "I bought this movie because I saw a friend in school with a graphic novel about it. I think this movie introduced me to Japanese animation and I still think it is the best of it's kind and much better than most mainstream movies out these. It is better not to spoil anything but trust me almost anyone with an open mind to anime films will love this movie."
    },
    {
      "rating": "10",
      "text": "this film is the most bestest film ever lolololololololololololololololololololololololololololololololololololololololololololololololololololololololol"
    },
    {
      "rating": "2",
      "text": "Princess Mononoke is just a dull, completely unbelievable and surprisingly disgusting animated picture that simply surplus Ghibli's filmography, which titles are even more breathtaking that this one."
    },
    {
      "rating": "0",
      "text": "Oh putain de bordel de merde, quelle purge, ce truc ! j’ai dû le regarder en deux fois… et encore ai-je dû faire moult accélérations rapides à chaque fois afin d’accélérer la purge de tous les instants que constitue ce dessin animé de merde à la con, mauvaise, très mauvaise fable écolo-geignarde à deux centimes de yen !C’est bourré d’incohérences, des incohérences dans tous les sens qui accentuent le côté grotesque de l’ensemble… de cette caricature de connerie d’histoire écolo-conne d’une naîveté confondante ! en outre, ça n’en finit pas ce machin, presque deux heures et quart de daube ininterrompue !L’animation est comme d’habitude à l’ouest et il faut rajouter à cela le mauvais goût décidément récurrent et commun à la majorité des productions du Studio Ghibli ; un mauvais goût rédhibitoire qui vient encore mettre en évidence -d’ailleurs- l’incongruité et les inepties nombreuses d’un scénar définitivement à la ramasse. En somme, un animé navrant de nullité !"
    },
    {
      "rating": "7",
      "text": "\"Princess Mononoke\" é um filme duro e melancólico, que utiliza varias formas de linguagem, vezes através da sátira, ou da própria cultura japonesa, para passar mensagens importantíssimas. Também conta com um desenho bonito e ótimos personagens - que giram em tono de uma trama que abre portas para a exploração da cultura japonesa.Audio: 日本語、ポルトガル語の字幕付き. Q60T TV SpeakersQuality: 1080p SDR [Netflix]"
    },
    {
      "rating": "3",
      "text": "The movie follows what is essentially an isekai protagonist rather than the actually interesting Mononoke. Not even the brilliant animation can save the uninteresting story."
    },
    {
      "rating": "10",
      "text": "The film was just awesome. It really subverted my expectations a lot. When you hear the word \"princess\", you don't think of a lady or a film as tough as this one. The conflict was one of the best I've ever seen: not black and white, but both sides had colliding interests and refused to settle without violence. It's refreshing to see an anime with two amazing female characters oppose each other like this. Other animes have a different approach towards women. The \"main character\" doesn't matter much, which is also nice to see, because it's not the one heroic dude who saves the day. They did not fall for any clichés here. From the beginning, where the MC walks into a battle with no music and an ordinary setting, to the end, where he does not end up with the pretty girl he flirted with. My only complaint is that the ending is kind of gross and confusing."
    },
    {
      "rating": "8",
      "text": "A great film, but no where near as good as Nausicaa of the Valley of the Wind, upon which Monoke is kid of based."
    },
    {
      "rating": "9",
      "text": "A great miyazaki film, the only problem was the dub kinda sucked, so to fix this, watch it in japanese with english subtitles"
    },
    {
      "rating": "10",
      "text": "The critics who gave this most excellent film low scores show their abysmally low intelligences in doing so. Just read the reviews. It's as if Disney paid them off. This transcends the anime genre. Except for the unusual concepts and cultures, it hardly seems foreign at all. Not that I am saying it is like anything Disney puts out. This story actually has depth, morality, tragedy, things which American animators consitantly flunk with. And as one critic said, it avoids the failings of most nature v. man tales-- that is, there is no black and white in this story, and there is no good and evil. I found only one character that I was capable of completely disliking That brings me to the voice acting. So often when films are dubbed, especially anime, the product becomes painful to listen to. But, thankfully, Miramax went all out. It's not that they put out the money to hire big stars, it's that they took the time to find actors who could understand their respective characters, and voice them appropriately. Disney comparisons are unavoidable, but only because Disney owns the American animation market. If Japan can send us more films like this, Disney may be in trouble."
    },
    {
      "rating": "10",
      "text": "Of all of Miyazaki's amazing works, I'd have to say this is one of my favorites. The music, artwork, story-everything is amazing. And the whole overall feel of the film is amazing."
    },
    {
      "rating": "10",
      "text": "In a time when \"epic\" just means \"long,\" Princess Mononoke reminds us what that word really means. Here is a bold movie with no villains, only flawed people who often do as many vile things as good. For once we have a film with character development, but one that also recognizes something more important than character development: seeing people as more than one dimensional right now, before they change. The magic of the film's world is as foreign to the American mind as its language, and is thoroughly rewarding to experience. There is blood, there is suffering, and even death in this movie, yet I would share it with my children. Like Walt Disney, Hayao Miyazaki does not shelter audiences from horror. He is smart enough to frame it, to educate and to evoke. The animation is gorgeous, and the soundtrack is not only thoroughly moving, but sounds authentic to the fantasy world. This is a long animated feature that earns ever half hour of its time in your DVD player."
    },
    {
      "rating": "10",
      "text": "I though this was an amazing movie. I've literally watched it tens of times and still love it. I've noticed that the people who don't like it/give it low scores are the ones who don't seem to understand Japanese culture and the whole idea of even the forest gods. Simply have an open mind when watching this movie; you'll find that it's quite good, and had lots of detail."
    },
    {
      "rating": "9",
      "text": "Stupid american teens who pretend to be grown ups and reject this movie because it's animated are just idiotic!This is the most mature animation i have ever seen and the stupid youth doesn't have the education to realize this is a powerful film full of meseages not thrown at your face,calling the plot week just because they are used to stupid american teen movies with \"clever\" suspense or just because they are bored to read the subtitles!How can anyone call this incomprehensable?How can anyone reject it because it's an animation or because the animation has gotten old?What's your favorite movie anyway,Butterfly effect?"
    },
    {
      "rating": "10",
      "text": "This is one of the single most amazing animated movies ever created, if not the greatest movie ever created. Why it has a 76 on metacritic is BEYOND ME..some critics need to get over the awful bias that CARTOONS and ANIME are completely different."
    },
    {
      "rating": "10",
      "text": "I don't have to say anything. Go watch it for yourself. You'll see what I mean."
    },
    {
      "rating": "10",
      "text": "Awesome!"
    },
    {
      "rating": "10",
      "text": "I like this movie very much great animation/sound/voice/music but the ending was not very good but other than that i think this movie was the best i seen."
    },
    {
      "rating": "9",
      "text": "visually stunning faboulous story. loved it, loved it, loved it. i look foward to anything from these creators"
    },
    {
      "rating": "10",
      "text": "The biggest wow! ever."
    },
    {
      "rating": "8",
      "text": "Princess Mononoke is an epic piece of animation about greedy human capitalism and its consequent destruction of flora and fauna. The main character is against extremes of opinions and therefore tries to fight for a symbiotic balance between humans and the world of the forest, for all beings ought to work together in a world of peace and respect, rather than to exploit and kill one another. This is not a children's movie because it is quite brutal and scary at times. However, there is also fun, cuteness, feminism, and no boredom throughout the movie. Very recommended."
    },
    {
      "rating": "8",
      "text": "Hayao Miyazaki rocks! With its epic story and breathtaking visuals, Princess Mononoke is a landmark in the world of animation. See it in High Definition."
    }
  ]
}