{
  "id": 194,
  "title": "Persona",
  "starring": [
    "Bibi Andersson",
    "Liv Ullmann"
  ],
  "runtime": 83,
  "genre": [
    "Drama"
  ],
  "description": "A young nurse, Alma, is put in charge of Elisabeth Vogler: an actress who is seemingly healthy in all respects, but will not talk. As they spend time together, Alma speaks to Elisabeth constantly, never receiving any answer. The time they spend together only strengthens the crushing realization that one does not exist.",
  "year": "1966",
  "rating": null,
  "imageUrl": "https://image.tmdb.org/t/p/w500/bdXbfUir63TQHA5NTNcXPICZCW8.jpg",
  "reviews": [
    {
      "rating": "9",
      "text": "A very philosophical film that takes you deep in thought.The direction of the film is excellent and the actors are very good"
    },
    {
      "rating": "8",
      "text": "This movie is the biggest \"wtf have I just seen\" ever. Cinematography and acting are amazing."
    },
    {
      "rating": "10",
      "text": "consider myself to be a film scholar and my favourite film is “Persona” which was released in 1966. “Persona” is a Swedish psychological drama film written and directed by Ingmar Bergman and starring Bibi Andersson and liv Ullman. This film both fascinates and hypnotizes and leaves the viewer with a lot of questions and a lust to watch it again and again. This is not a film, but a real masterpiece.Bergman called “Persona” the most important film of his career. It is a riddle, wrapped in a mystery, inside an enigma which swallows you completely, with its symbolism in the first shot telling a story in pictures, using the language of associations.A boy is abandoned by his mother and his mother suffers from her inability to love him. It is pure theatre, where all the action is set in just two locations - a hospital and a house on the coast.The director examines the personality of the actor in which lies and truth are indistinguishable. Every gesture is false and every smile is a grimace. It is filmed as a monologue with the plot built around two women - one of them is a famous actress patient and other is a nurse taking care of the first: The famous stage actress, Elisabet Volgler who has suddenly stopped speaking and is able to pronounce only two phrases in the entire film and; Alma her nurse, who is in a dialogue with herself.A static camera. Two characters interacting actively through tantrums. Conflicts and physical contact. Andersson and Ullmann´s acting is impeccable, the camera work superb. Everything has meaning and significance. There is no empty dialogue and no special effects. Raw.For me, this is a film about the fear of being oneself and the necessity to comply with social conventions. Everybody plays a role, adopting masks and eventually thereby loses their inner selves. Pain, fear, despair and lies occupy human life and the inability to stop, fall silent, live and realize each simple step taken and to allow oneself to be seen by others, is what make us people.I would highly recommend “Persona”, especially if you are keen on classic cinema."
    },
    {
      "rating": "10",
      "text": "Persona is a riveting psychological drama. At the heart of the film lies the captivating performances from co-leads, Bibi Andersson and Liv Ulman. The cinematic compositions, captured in gorgeous black and white cinematography and direction are absolutely breathtaking. The end result is that after seeing it the first time I instantly knew that it was unquestionably one of greatest films ever made and one that will forever stick with me. This is essential viewing for mature audiences. Highest recommendation!"
    },
    {
      "rating": "2",
      "text": "I only watched this movie, because it is in the 250 Top List on imdb. I watched already another Bergman movie and this one is as boring as The Seventh Seal: extremely serious, weird / artificial behaviours and weird dialogues. Persona is slightly better, because it is easier to understand, what it is about, but I dont care. So an actress is starting to be mute and get a nurse to take care of her. I dont care why she gets mute, what she thinks, what she feels."
    },
    {
      "rating": "3",
      "text": "All modernists are the same: perversely pointless and pointlessly perverse."
    },
    {
      "rating": "10",
      "text": "Brilliant acting. An existential and psychological study on who you are on the outside and inside..."
    }
  ]
}