{
  "id": 62,
  "title": "Avengers: Endgame",
  "starring": [
    "Robert Downey Jr.",
    "Chris Evans"
  ],
  "runtime": 181,
  "genre": [
    "Adventure",
    "Science Fiction",
    "Action"
  ],
  "description": "After the devastating events of Avengers: Infinity War, the universe is in ruins due to the efforts of the Mad Titan, Thanos. With the help of remaining allies, the Avengers must assemble once more in order to undo Thanos' actions and restore order to the universe once and for all, no matter what consequences may be in store.",
  "year": "2019",
  "rating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/or06FN3Dka5tukK1e9sl16pB3iy.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "Gran Película del UCM para mi es la mejor de todas cumple con todo lo que deseabalos y mas lo único que me queda decir es Infinity War es una basura a comparación de Endgame"
    },
    {
      "rating": "10",
      "text": "This movie may not be exactly how you want it, but it does the greatest possible job of making everything make sense."
    },
    {
      "rating": "8",
      "text": "A good concusion to a mind blowing series of movies. I'm happy with how everything turned out even though I'm dissapointed with the character treatment of Thor and Hulk. An epic conclusion."
    },
    {
      "rating": "10",
      "text": "Phenomenal ending to a great 20 year franchise. Thor is still my absolute favorite."
    },
    {
      "rating": "9",
      "text": "L’incroyable succès de infinity war a fait en sorte que endgame était le film le plus attendu de 2019.Robert Downey JR. Chris Evans et Scarlett Johansson ont probablemant donner leur 100% pour ce film.Je trouve le cas de Thanos est très intérèssant,de le faire mourire aujourd’hui et de le faire revenir du passé est probablement la meilleur idée du MCU en 5 ans.L’humour est bon mais il y en a un peu trop chez le MCU.L’incroyable bataille finale est un peu échevelé,mais reste a mes yeux la meilleur bataille de fin de marvel depuis 2008. Mais néanmoins,  mes prières on été exaucé car les frères Russo on réalisés mon 3ième film préféré du MCU."
    },
    {
      "rating": "10",
      "text": "No spoilers!This movie blew me away!Its like an emotional rollercoaster from beginning to end. It also manages to be one of the funniest and quick witted MCU movies. The audience applauded when the movie ended.It is a must watch!"
    },
    {
      "rating": "10",
      "text": "La mejor película de los vengadores, es emotiva, sus escenas de acción son increíbles no le falta nada"
    },
    {
      "rating": "8",
      "text": "A very mixed bag of good ,bad and meh. They actually could have split this episode into 2 parts and it would have been better because they tried to jam way too much exposition,wrapping up of loose ends and results for all characters into 'only' 3 hours.That didn't leave any time for most characters to be anything more than devices to move the plot along.The last hour makes the price of admission worth it though as a lot happens.Anyone worried about Captain Marvel taking over the film as dominant figure rest easy .It's not that way. Still worth an 8."
    },
    {
      "rating": "7",
      "text": "The things that I didn't like about Infinity War are alive and well in Endgame.Too much mindless action, not enough good story.Too many characters and none of them had any presence.I spent the whole movie waiting for the Stan Lee cameo and all I got was a Marc Maron flyby.As an old school comic reader, the power levels of most of the heroes in this movie are really annoying.Middle of the pack as far as Marvel movies are concerned."
    },
    {
      "rating": "10",
      "text": "La mejor película del UCM, épica, llena de emotividad, giros inesperados y por supuesto una conclusión digna y grata de un ciclo que se hace merecedora de un reconocimiento desde el punto de vista argumental y emocional en todas sus categorías"
    },
    {
      "rating": "10",
      "text": "Go ahead and watch the trailers for Avengers: Endgame, they won't give anything major away. It's amazing for a huge movie to be so self-aware of itself, as well as, the movie genres that they're overtly borrowing from. The minor characters or those not even in Avengers: Infinity War, step up and help set up huge sequences that are highly entertaining and actually answer questions. Avengers: Endgame acknowledges every aspect of the characters emotions in their previous MCU film's and succeeds in the most Meta way possible.Ant-Man is a major reason for this. It's no spoiler to say that he's in the film as he produces some of the biggest laughs from the trailer of him ringing the bell at the Avenger's front gate. It's Paul Rudd's wry jokes, quick timing and fish out of water facial expressions that really assist things.The pacing of Avengers: Endgame is amazing and not for the reasons you might think. It's brilliantly paced, but it throws the entire formula and how MCU films are done on their head. Battle, loss, battle, loss, humor and then victory, take those ingredients, shake well and you've got a loose description of some average superhero films.If Avengers: Infinity War left you feeling betrayed and bummed out, I feel you. Avengers: Endgame more than makes up for any ill feelings that it caused. I see why they played it the way they did, and doing so any other way would've cheapened the film, watered down the MCU and made it all disposable. It is also worth noting that the film balance lots of humor with the drama, all the while putting it in a nice bow with stones.What we're left with is a 10 year opus that spans more arcs than Lord of the Rings and encapsulates it all in a perfect manner. Granted, they will still make many MCU films, this is not their swan song. However, there is a victory lap feeling about Avengers: Endgame. It respects the fans, adds to the dramatic elements, answers questions that fans have wondered about and plants a couple new seeds to grow on."
    },
    {
      "rating": "8",
      "text": "About the all female scene: as a straight guy, I like that scene. I have seen so many negative comments about it and state the scene is so \"forced\". Well, if we use this mindset, the whole movie is \"forced\" because so many things had to happen at the right place and right time: Tony Stark meeting his father, Steve Rogers getting back with his love of life. Also, if Hulk, Iron Man, Captain America, Thor, Hawkeye, Star Lord, Black Panther and Dr. Strange are fighting together in one scene, I don't think people would say it's \"forced\" although they are all males. Last but not least, this whole movie is a fan service. Let's just celebrate the diversity of the superhero lineup. Everyone of them is the favorite for some fans. You don't need to bash others to love one. Thank you!"
    },
    {
      "rating": "10",
      "text": "It is one of the best movies I've ever seen! Emotional, unpredictable, amazing... All the theories turned out to be wrong; they made it a complete surprise."
    },
    {
      "rating": "10",
      "text": "A fantastic movie without a malfunction and the peak of all 22 Marvel films"
    },
    {
      "rating": "10",
      "text": "I have to say this movie just blew me away, every aspect of it, the character arc that the entire cast go through especially Thor, Tony and Steve the world post snap and of course a 3rd act that just was a comic book come to life in all of it's glory. For me this is a masterpiece and one that I will treasure forever and I'm great-full for everyone in marvel who help made this piece. Best comic book movie of all time in my humble opinion, just a must watch for every fan."
    },
    {
      "rating": "10",
      "text": "Best Marvel film, so emotional, electrifying, so much heartthrob, and definitely worth the three hours"
    },
    {
      "rating": "10",
      "text": "Amazing end to such a long journey. It completely captured how it was Tony's world all along; with a satisfying ending that tied up the loose ends that we original Marvel fans have been wanting to see for a long time. And while there were moments that could be called \"fan service\" it was exactly what we needed after such a long time getting here, It was bittersweet."
    },
    {
      "rating": "10",
      "text": "It's the best movie i ever seen in my life. Wow!!! Congrats to th Russo's. I hope it's not the last one."
    },
    {
      "rating": "8",
      "text": "Endgame was a frustrating film for me to review, Because on one hand I was mindblown by the sheer force of this film. While, it is a satisfying conclusion to the stories of Iron-Man, Captain America and a few others; you can't help but get confused by the convoluted and overthought time-heist middle of the film. It's not as good as Infinity Wars it still provides a ton of emotionally satisfying moments that should please longtime fans of the series."
    },
    {
      "rating": "7",
      "text": "In order to fully appreciate this heart warming and tear jerking 3 hour epic, I'd recommend rewatching all the other dozen or so Marvel feature films! Truly mind-blowing special effects and excellent acting, in particular from Robert Downey Jr, RIP, however slightly undermined by forced upon Identity Politics and a be-muddled and confused plot, with the excessive use of time travel not helping to ease more casual viewers into a wider experience. All in all, a good movie and a satisfying ending."
    },
    {
      "rating": "7",
      "text": "All right, movie itself.It's not bad, but it's not excellent.Infinity war is better.Pro:Fan service, Great CGI,Iron manCon:Whatever you complained in Batman vs Superman and SJW star wars.this movie has them.And that's why people are giving \"0\"s.I also took one points off because the reference to \"back to future\", it's very disrespectful,Just like what they did in Star Wars.Man, I can't believe ten year has passed. I don't think there will be another iron man in my life time.Thanks Robert Downey Jr. :D"
    },
    {
      "rating": "9",
      "text": "This is one of the best MCU films. On 2nd showing, now I see a couple of plot holes, questionable moments and an awkward moment."
    },
    {
      "rating": "10",
      "text": "You've seen it, you know its perfect. Best Marvel movie to date and an amazing conclusion to the Infinity saga."
    },
    {
      "rating": "8",
      "text": "I would have given it a 9 or a 10 if it were not for the feminist agenda. There were plenty of scenes showing strong capable women throughout the film and I loved them. what I did not love, was the power puff girls scene at the end."
    },
    {
      "rating": "7",
      "text": "slightly disappointing end to the avengers saga. It only kept you on the edge but never got you to jump. personally i felt it lacked action scenes for example, hulk never got to fight thanos and captain marvel came towards the end only. yes i understand there was going to be certain number of dialogue to be made to complete the story but still, as an ending and a 3 hour movie i felt the content should have been more. the movie focused too much on the feels and not so much on the works. in the end its a decent ending but still felt it could have been pushed more.7.5-8/10"
    },
    {
      "rating": "9",
      "text": "Endgame – delivers!  And that is an amazing feat. With more than 50 (!!!) Hollywood stars in one movie and a playing time in the region of 3 hours. This is not your standard superhero flick, no Endgame is more about loss, love, relations, family and just appreciating what you have.I absolutely loved all the funny references to other Marvel movies, and the jokes regarding time travel are hilarious. There are countless references and my favorite is the Coen reference to Thors new appearance.A worthy finale to a journey more than 10 years in the making.Must see if you like Marvel."
    },
    {
      "rating": "7",
      "text": "Endgame kicks off with an invigorating prologue (making you believe you are in for the Avengers ride of your life), but then swiftly drags and trudges its way through time-travel confusion. While it's \"greatest hits\" venture lives up to it's sentimental sendoff, it was just eye-winking filler to get to it's grand, over-the-top finale, that offers more than enough eye-candy to be satisfied. But its the final moments that truly give this series it's hoorah that it deserves. And they make you weep, even if you never cared."
    },
    {
      "rating": "8",
      "text": "It's a little to long in the beginning but great middle and ending. I would like to know what's next. This movie is something that need another Sequel"
    },
    {
      "rating": "9",
      "text": "Una película muy recomendable, divertida, con un guíon muy bueno y con unos efectos especiales muy buenos."
    },
    {
      "rating": "10",
      "text": "This was probably one of, if not the best, marvel movie I have ever seen. It was both exciting and hilarious, but also emotionally invested in its characters. So in other words, a fitting and well-made conclusion."
    },
    {
      "rating": "9",
      "text": "Una saga a la que llegué gracias al afecto por el trabajo de Robert Downey Jr., pero que en esta ocasión , el amor puesto por todos quienes participan en ella deja un resultado espectacular para recordar toda la vida, en su intención es perfecta, sus homenajes cinematográficos , la construcción de las historias y el desenlace ¿Fatídico?, para algunos, dejan una sensación que excede nuestras expectativas , las cuales llegan exorbitantemente altas al encuentro con esta película. Como muchos derrame mis lagrimas pero solo por una ocasión; muy agradecido por este trabajo tan bien cuidado y que apartándose de una gran inversión , se traduce en una verdadera pieza cinematográfica para atesorar siempre..."
    },
    {
      "rating": "10",
      "text": "Epic and emotional conclusion to the Infinity Saga and the first phases of the MCU.Endings are hard and often a letdown. For Marvel to get it so right is an incredible achievment.This movie has so many awesome moments, it would take about three hours to list them all.According to box office, everyone and their mother has already seen it. But if you haven‘t, go see it in the biggest cinema you find."
    },
    {
      "rating": "8",
      "text": "Хорошее завершение. Первая часть фильма была скучна, но с середины уже начинается самое интересное. Графика и экшн просто топовые. Особенно посмешил тор. В общем топовый фильм"
    },
    {
      "rating": "10",
      "text": "After being the 22nd movie in the franchise, it brings the series to new heights. This movie is best benefited by those who have watched most of, if not all of the Marvel films. Throwbacks and characters appear from more than last decade of movies. The acting and comedy is on point with every joke hitting perfectly and every actor showing their passion for the role. The movies set pieces are perfect with sets from past movies. The action, humor and overall story telling shows the passion that not only the Russo brothers had for this film but everyone involved. The story concludes the 22 films perfectly while also leaving character arcs open for future MCU movies. This movie deserves the praise and excites me for future MCU movies in the future. This movie is a roller coaster which can be benefited most by those who have seen many of the other marvel films. Thank you to all those involved in the production of this movie, you have created a great films!"
    },
    {
      "rating": "9",
      "text": "Must watch especially when you are real Marvel fan! Easter Eggs, catchy phrases, some great scenes (Portals!) and absolutely great music, by Alan Silvestri"
    },
    {
      "rating": "10",
      "text": "The Best super-heroic movie EVER! The MOST Sentimental movie MCU has ever revealed. It's about 3 hours but you just get lost in the movie and suddenly find out the movie has finished. It makes you laugh and then brings your tears out and leaves you confused and stunned. EXCELLENT!!!"
    },
    {
      "rating": "10",
      "text": "El perfecto cierre para una gran etapa ... Al momento de ver la película te atrapa tanto que las 3 horas se te pasan volando y si bien tiene sus momentos que para algunos gustos son de mucha charla y poca acción, era lo justo y necesario para tener un buen equilibrio entre acción, historia y dar un buen cierre a la historia de los personajes de esta etapa. Totalmente recomendable la película!!"
    },
    {
      "rating": "10",
      "text": "Movie was great. But difficult to understand for those who've not watched previous parts(MCU)."
    },
    {
      "rating": "7",
      "text": "These are my thought's. They killed off or retired any character that would have overshadowed Brie and the next MCU phase characters. It reminds me of my love affair with the season one of Macross saga aka (Robotech) anime from the 80s When that series ended with earth decimation I held my breath for what was to come after, and what came was a poorly constructed story minus my favourite characters. I don't not like this film, and I couldn't hate it if I tried too. Its a movie packed with fan service and a decent send-off I suppose. \"But I will be retiring with my favourite characters, and not returning for more. Let's hope the DCEU and Joker film will embrace me warmly.\" Salute to the newer viewers Disney is making the films, for now, I hope they enjoy. truly Thanks, Russo bros"
    },
    {
      "rating": "8",
      "text": "Not being a blind fanboy or been effected by hype, I can say that,The end game definitely lives up the hype but, only for last 30-45mins. The first half of the movie was filled up more with funny humour and unexpected condition of heroes after losing to Thanos in infinity war. Inshort, it falls flat in my opinion.I personally feel that Infinity war was better than end game due to \"powerful\" foundation of story and the fear of Thanos was very well projected."
    },
    {
      "rating": "8",
      "text": "It's a necessary movie to continue with the franchise, otherwise Infinity War would be sufficient as an ending, still pretty awesome."
    },
    {
      "rating": "9",
      "text": "It's a good conclusion to a 21 movie saga.  It's not perfect, a little longer than it needs to be, but it's a very enjoyable film.  A trip down memory lane of 10 years of marvel movies."
    },
    {
      "rating": "10",
      "text": "This movie was the best movie that the MCU has made, in fact, i dare to say that it is the best movie ever. It is emotional, epic and it gives you chills because of its greatness. It has incredible action scenes and many easter eggs that marvel fans can find. It is definitely worth watching. The reason it is so incredible is because every movie the MCU made was made thinking in this last movie and you can clearly see it."
    },
    {
      "rating": "8",
      "text": "It is good closure for this saga of 22 films a great homage to Iron Man and Robert Downey Jr. that started this whole thing up, a well managed to a certain point plot about time travel that has its plot holes without which you couldn't justify more than one event in the movie, the most commonly complained aspects I've watched are Professor Hulk, fat Thor and the scene of just superheroines, and they're not bad those have a justification among some other things like several deus ex machinas, the third act is super epic and it's fan service well done not like Batman V Superman where is poorly executed but it is not enough for me to be a better movie in general than Infinity War. More than the plot holes or the ridiculousness of the jokes what I disliked the most was how impertinent they were with the product placement, a commercial for Fortnite, a commercial for Axe and the most brazen of all the Audi one, its clear they gave more priority to other things that make it a coherent film with cinematographic arguments."
    },
    {
      "rating": "10",
      "text": "This movie is a solid 10/10 . I know its not perfect but it is a great movie . The action, drama , emotional content and humor is very good . As a long time MCU fan the emotions this movie gave me was heartwarming and heartbreaking . Most hater will nitpick every lil things but in general they re ruining their movie experience and as far as nitpicking goes most of them dont even  make sense it kinda seems like their personal agenda or something to just hate on the movie (DC fan boi alert) . We have been taking the MCU for granted , sure they make tons of money now but rather than hating on everything just be happy to see a movie of this scale . Tbh i appreciate DCEU s efforts but they have spoiled their iconic characters like superman and batman , im still onboard for the next JL film i hope they dont screw it up."
    },
    {
      "rating": "8",
      "text": "The fight scene in the end was so good it definitely redeemed the past scenes that were a bit slow paced but the overall story is something that will remain remembered forever"
    },
    {
      "rating": "10",
      "text": "This movie is more emotional than Infinity War. 22 movies, all characters, character development, humor, intense moment, coming together in one movie. Some people probably don't understand the movie or not what they excepted, but what you get is what you got."
    },
    {
      "rating": "10",
      "text": "As a fans of Marvel. Endgame gives me a perfect end for the first stage of Marvel universe"
    },
    {
      "rating": "9",
      "text": "Не ожидал от фильма захватывающих сцен, не думал что буду смотреть с удовольствием, но как оказалось фильм Классный."
    },
    {
      "rating": "10",
      "text": "Funny, exciting, and shocking if you weren't already spoiled by someone. Avengers: Endgame does an amazing job of wrapping up 11 years of the Marvel Cinematic Universe. If you've been with the series all along, then you are guaranteed to cry at least 3 times during the movie, and use the bathroom right before you enter the theater!"
    }
  ]
}