{
  "id": 179,
  "title": "Network",
  "starring": [
    "Peter Finch",
    "Faye Dunaway"
  ],
  "runtime": 122,
  "genre": [
    "Drama"
  ],
  "description": "When veteran anchorman Howard Beale is forced to retire his 25-year post because of his age, he announces to viewers that he will kill himself during his farewell broadcast. Network executives rethink their decision when his fanatical tirade results in a spike in ratings.",
  "year": "1976",
  "rating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/gZ8hhuVEQ78CLND09trZJ45Eiy8.jpg",
  "reviews": [
    {
      "rating": "9",
      "text": "One of the most important American films of the Seventies, Network is messy and takes on more than it can properly chew, but the writing, directing and cast are top notch. The reason it's so good may well be its willingness to take risks. They don't always work but the net effect, sustained in this film, is it's got something to say that's worth thinking about. Flashes of humor with characters and situations that are vividly recognizable. Of its time and --40 years later-- timeless?..."
    },
    {
      "rating": "10",
      "text": "One of Sidney Lumet's best movies, Network serves as a messy, biting satire of the television networks of the 1970s. Even so, it is incredibly and sometimes frightfully relevant even today. Faye Dunaway, Robert Duvall, Peter Finch and company are an extremely well put together ensemble that elevate Paddy Chayefsky's script to new heights. One of the best films from the 1970s, and a must watch for serious cinephiles."
    },
    {
      "rating": "7",
      "text": "for god's sake, you are supposed to be the romantic..NetworkPaddy Chayefsky; the writer, is the real protagonist in here, for his keen vision on creating a fiction in a white-collar office and still keeping it real and resembling towards the practicality is what helps the stunning craft sail off to the shore, safely. Sidney Lumet is in his A game and along with a beautiful cinematography and conservative editing, the 'directorial' objective is successfully achieved. Faye Dunaway and William Holden are convincingly good in their parallel role but the real game changer is Peter Finch as a supporting cast. Network is not your typical controversial informative feature, but is more brutal and dark that is depicted nicely with the help of a cunning script, stellar performances and brilliant execution on its side."
    },
    {
      "rating": "8",
      "text": "This is the most effective satire film I've ever watched. It's thoroughly devastating, and that's because it doesn't work on one level. While Network's wry humor is very sharp and truly sore, it's the sympathy I had for Howard Beale, Peter Finch's character, that got me. Actually, the movie's obvious flaw is that the aspect that is focused on, which is the political satirical one, is underdeveloped, or let's say that all small changes that happen don't make the story any better, instead, they made the satire less sharp, and made me less interested in the story.By contrast, the character of Beale is continuously developed, and it's character arc is painful to witness from the very beginning to the end. However, what really made me engaged despite the semi-hollow main plot are two things:the first thing is the intelligent dialogue; it should be listed in top 10 movie dialogues of all-time. It easily can trick us as the plot is very well-developed.The second thing is the characters, not only Howard Beale, but almost every character is a three-dimensional one. Specially when I was totally invested in all the characters, and how couldn't I with, maybe, the greatest cast ensemble performing the roles?Of course, Peter Finch is great, and balances very well between his moments of wrath, and his moments of psychopathic coldness. But, c'mon, his performance is far cry from De Niro's in Taxi Driver, which is arguably the best performance in film. The performances that standout for me are William Holden's as Max Schumacher, he really deserved to win the Oscar, and Faye Dunaway's performance as Diana Christensen, which I think this is her best performance ever even better than her performance in Chinatown , and, fortunately, she took the Oscar for this role as the Best Actress in a Leading Role. Robert Duvall also, and as usual, gave a terrific performance. Needless to say, the entire cast is phenomenal!I want to say that I love Sidney Lumet direction. He always shot the conversations in his movies in a way that make us feel they actually happen in real life, and 12 Angry Men and Dog Day Afternoon are the finest examples. But in the case of Network, there are some scenes that don't need to be shot this fast, they needed a little more focus, a little more dramatic feeling. The result is some scenes that could have been more effective if they were less rushed, also, there are some acting, which is great, that seemed to be over the top. And that's just because the direction, not the acting itself, except one scene in which the acting was really hammy. Also, the ending is rushed, but it's very shocking. With that being said, Lumet established a disturbing atmosphere, that due to it, nothing in this movie would have worked.All in all, I enjoyed watching this movie that left a bitter taste in mouth, because of nothing but its accuracy which made it very relevant nowadays. And despite all its major flaws, Sidney Lumet made a satirical drama that still one of a kind.(8/10)"
    },
    {
      "rating": "8",
      "text": "A tough nut to crack. Great dialogues (and even better monologues!) and acting. Seemingly, it's daringly revealing. Some points it rises hit eerily close to home (esp. during this covid craze). But, it's still programming. And I've a feeling I missed the gist of it (apart from the usual: spreading despair, nihilism, atheism and moral rot). The melodrama arc is not believable and way too meta. The movie's focal point, the Howard Beale character, feels an artificial stooge. Strange one, for sure."
    },
    {
      "rating": "10",
      "text": "A brilliant satire, which sadly is still relevant today, on the lack of morals within the ratings driven world of commercial television.One of the best movies of the 1970's."
    },
    {
      "rating": "10",
      "text": "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx"
    }
  ]
}