{
  "id": 193,
  "title": "It Happened One Night",
  "starring": [
    "Clark Gable",
    "Claudette Colbert"
  ],
  "runtime": 105,
  "genre": [
    "Comedy",
    "Romance"
  ],
  "description": "A renegade reporter and a young heiress meet on a bus heading for New York, and end up stuck with each other when the bus leaves them behind at one of the stops.",
  "year": "1934",
  "rating": "NR",
  "imageUrl": "https://image.tmdb.org/t/p/w500/2PNUGWAflH6UUumas0POMmokHlc.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "From the director of the timeless classic that is It's a Wonderful Life, comes It Happened One Night, a wonderful film that is as charming as it is funny. While some parts are quite idealistic, it is essentially a screwball romantic comedy and a great one at that. The direction from Frank Capra is classy and dignified and cleverly gives us an insight into gender and class status, and the screenplay is sophisticated and funny. The humour still works, I found myself laughing when Clark Gable said \"now don't tell you're in love with the bus driver\" for example. The cinematography is beautiful and dynamic and the music is richly and sensitively scored. The acting is very, very good. Clark Gable looks handsome here, and he gives a close to hysterical performance as Peter, with his impeccable comic timing and witty humour. Claudette Colbert is lovely as Ellie, the spoiled yet somewhat independent heiress who Peter falls for. The two actors show great, charming chemistry together on screen, and they are terrifically supported by especially Walter Connolly as Andrews. The story is relatively simple, but I liked its simplicity, it was effective. Overall, a wonderful, funny and charming film. 10/10 Bethany Cox"
    },
    {
      "rating": "9",
      "text": "Even for the time it was released, I find it surprising and refreshing that it provokes a genuine interest in the lead characters, making their idyll perhaps a bit idealistic, but hey, it was the 30s, and above all the notable lack of cynicism.It was charming for its time, and still works."
    },
    {
      "rating": "7",
      "text": "a soothing and independent night..It Happened One NightThe conversations are practical and sensibly written and addition to that the hilarity that it ensues doesn't seem forcibly installed and makes it look like ridiculous but instead keeps it grounded; which audience resemble with, that is supported by the pragmatic characters and the world that they reside in. The writing is strong and witty especially which is clearly visible when it offers a similar gravitas to the supporting cast to factor in on drama and comedy too. It isn't shot nicely and the camera work could have been a lot better but it surely is edited perfectly. The execution by Frank Capra is apt for the script and bodes well with the tone throughout the course of it as he keeps it light and breezy. Clark Gable is as always convincing on his portrayal and so has been Claudette Colbert on her parallel role with him as a bratty celebrity. The only missing puzzle is the stakes that are projected in here are taken lightly by the characters and the makers which clearly isn't feasible at all. It Happened One Night is a soothing and independent night if not appropriately taken hold of."
    },
    {
      "rating": "4",
      "text": "Like a lot of films of the era, it's more or less entirely dialogue, and the dialogue is hammy and overacted.But, for reasons I can't quite explain, I did quite enjoy it. It's exactly the sort of film you could do the ironing to because it doesn't take much concentration to watch."
    }
  ]
}