{
  "id": 99,
  "title": "Batman Begins",
  "starring": [
    "Christian Bale",
    "Michael Caine"
  ],
  "runtime": 140,
  "genre": [
    "Action",
    "Crime",
    "Drama"
  ],
  "description": "Driven by tragedy, billionaire Bruce Wayne dedicates his life to uncovering and defeating the corruption that plagues his home, Gotham City.  Unable to work within the system, he instead creates a new identity, a symbol of fear for the criminal underworld - The Batman.",
  "year": "2005",
  "rating": "PG-13",
  "imageUrl": "https://image.tmdb.org/t/p/w500/8RW2runSEc34IwKN2D1aPcJd2UL.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "I have not watched all of the Batman movies, so I can't really compare this triumph to the other films. I will say this: I was only able to stomach about 15 minutes of Batman Forever (the Schwarzenegger one) so... I guess it's safe to say that this one kicked the other's hind quarters... pretty hard if I may add. The film is dark, edgy and well acted. The plot is good (not groundbreaking, but it really holds your attention). You will never be bored... or annoyed, like in Batman Forever. The best performances come from the effortless class of Michael Caine as Alfred, Cillian Murphy as the cold Dr. Crane and Liam Neeson as the main villain, Henri Ducard."
    },
    {
      "rating": "10",
      "text": "Simply the picture what the batfans always were dreaming about. Nolan takes the more \"realistic\" superhero, and gives us much more than an action movie: a great movie no matters the genre."
    },
    {
      "rating": "10",
      "text": "One of the most fantastic parts of Batman Begins is how complex the film is. Nolan is not primarily concerned on making a entertaining comic book pic, but rather on making a intriguing art-house character drama. The number of deep, and thought provoking themes brought up in the movie is something to be hold, considering how the campy Adam West version introduced many people to the character"
    },
    {
      "rating": "10",
      "text": "I think this movie deserved more than a 70 but no more than a 90. If you're someone who is used to the Tim Burton style batmans like me, you know it had to take a lot of willpower to accept this Batman movie as one of the Â«greatsÂ». The tumbler was really hard to get used to and Alfred made me yak. Although I did like the Scarecrow."
    },
    {
      "rating": "10",
      "text": "After the disaster known as \"Batman and Robin\", I was worried  this movie would tank. But nope. Batman has made one heck of a comeback. Poor Fantastic Four. This movie is believable and stays true to the comics. Best movie of the year. I don't want a reboot. Nolan's franchise is the best Batman franchise ever."
    },
    {
      "rating": "10",
      "text": "Nolan made another great film in Batman Begins and it completely changed the super hero genre and it also began the best trilogy of all time. So much to analyse so much to entertain and so many performances to savour."
    },
    {
      "rating": "10",
      "text": "This was the start of a great realization of Batman and his world. The performances are sheer gold. It takes a somewhat darker tone compared to older Batman movies, a risk that payed off."
    },
    {
      "rating": "10",
      "text": "After being left for dead following the disastrous \"Batman and Robin\", the \"Batman\" franchise is back better than ever with \"Batman Begins\". The film's creator figured rightly that the only way to revive the franchise was to start all over again by retelling the legend of Batman's origins. Christian Bale is the first convincing Bruce Wayne/Batman for me. In \"Begins\", Bruce spends seven years traveling the world studying criminals and hanging out with criminals in prisons in search of revenge for the death of his wealthy parents at the hands of a homeless mugger. Along the way he meets Henri Ducard (Liam Neeson) and is taken in by a mysterious group of vigilantes known as the League of Shadows. Wayne eventually comes to reject the League's apocalyptic and immoral methods of cleansing the world of corruption and criminality. After rejecting the League's apocalyptic methods, Bruce creates the \"Batman\" crime fighting character. In the end, Bruce must successfully confront the League's plan to destroy Gotham in order for his \"Batman\" character to succeed in his mission to save his home city from corruption and crime. Bruce pretends to be a billionaire playboy in public as a front for not drawing any attention to who he really is after hours. This is incredibly disappointing to Bruce's love interest, idealistic junior DA Rachel Dawes (Who I think is played quite well by the much hated Katie Holmes). Michael Cayne is a suitable Alfred and seems to be popular with fans in the role. The best supporting character is Lucius Fox (Morgan Freeman), the Wayne Enterprises scientific genius who has the knowledge and possession of everything Bruce needs to become Batman. I really love it when Bruce sees \"The Tumbler\", a.k.a. the future Batmobile, an experimental military vehicle, and Fox seriously says to him \"Oh, you wouldn't be interested in that\". The writers of the film obviously did that line for laughs and it works every time for me. Near the end when Alfred says to Bruce that it might be time to do some more work on the foundations of Wayne manner, particularly in the area of the Bat Cave, I'm left wanting to see what happens afterward. I hope we see at least a couple more \"Batman\" films with Bale et al."
    },
    {
      "rating": "10",
      "text": "Solid movie, honestly probably the best superhero movie to date next to spiderman. The darkness of the movie is perfect, it brings back the feeling of tim burtons dark movies of BATMAN!!! Great job Nolan, Christian Bale was a perfect batman."
    },
    {
      "rating": "9",
      "text": "Batman begins is an awesome action movie, it's got exciting action, a great dialogue/script, a very good and interesting story-line and good acting by just about everyone in it. I haven't seen any other batman movies, but batman begins seems like it's probably better, it's just such a great film! If you haven't already seen it, I recommend watching it, it's a really good film, seriously, it's one of the best super hero films, but one thing is even better: The dark knight, check out my thoughts of it on my review!"
    },
    {
      "rating": "9",
      "text": "Batman Begins is a good start to the dark knight trilogy, the acting is superb in it, the stunts are awesome, the pacing is pretty good, and most importantly it makes u believe in a world so believable. the only mistake it made was that the storyline was a little bit too predictable."
    },
    {
      "rating": "10",
      "text": "This is the first 2 hours of my favorite movie of all time, so you know its a ten. Everyone in this movie was excellent(Katie Holmes, I know, but I thought she was good for Katie Holmes). This movie is absolutely perfect in every way."
    },
    {
      "rating": "10",
      "text": "This is the one movie that revitalized superhero movies. Batman Begins made people watch comic book movies, take them seriously and paved the way for others such as The Dark Knight, Iron Man and Winter Soldier. What is so good about Batman Begins is the fact that it doesn't feel like a comic book movie at all but a real crime thriller. Christopher Nolan directs it perfectly and puts his mark on the film. Christian Bale, Liam Neeson, Michael Caine, Cillian Murphy, Gary Oldman, Morgan Freeman and even Katie Holmes is amazing in this movie. It is very watchable and the story is the ultimate origin story with great villains and characters. I love this movie because of its strong acting, directing, action, score, characters and how it truly started a new era in cinema."
    },
    {
      "rating": "9",
      "text": "After seeing the this I have restored hope of Batman films. I also thought, theres no better Batman/Bruce Wayne than Michael Keaton. Clooney and Kilmer SUCKED! Bale does a good job, I can't wait the sequel, where we see Joker."
    },
    {
      "rating": "10",
      "text": "After bearing the burden of a franchise that had spun completely out of creative control, I finally rented the DVD. What an idiot I was... Why did I not see this in the theaters? Caine and Freeman firmly cement their personas, delivering spot-on performances, Gary Oldman proves that he can quite simply out-character act anybody in the industry, and Bale, in a stunning turn -around physically from The Machinst, IS Bruce Wayne (P.S.: watch The Machinist. Bale reportedly ate an apple and a single can of tuna (while working out incessantly) to capture the physicality of the role. He then promptly assured producers that he could play the part in Batman Begins, and then proceeded to bulk out in SIX WEEKS . Neeson turns in an admirable peformance, and Holmes seems out of her element, but overall, this is the definative origin story which renders the previous Burton/Bruckheimer movies quaint, more or (VERY) less watchable, but utterly irrelevant. The 60's T.V. show was the coloring book, the previous franchise was the high school book report, and we now have the fully developed master's thesis of how a billionaire with a grudge and a horrible childhood trauma could resort to, and be facilitated in, swooping about Gotham, scaring the s*** out of criminals and audiences alike. I usually balk at the set-up for the inevitable next movie, but I actually cheered when Oldman's Gordon turned over the playing card... Kudos!!!"
    },
    {
      "rating": "10",
      "text": "One of the best films of the year if you rate this movie a zero you have no life!!!"
    },
    {
      "rating": "9",
      "text": "Christian Bale was far superior to any other Bruce Wayne attempt, although I did like Keaton (comic relief) Katie Holmes was pretty, but out of her league. Needed Charlize. The fight scenes were a bit of a blur, but the story was well done. I enjoyed not seeing any 'over the top' stage whores.(Jim Carey) I actually should give it a 10 because it had Liam Neeson, is he bad in anything?"
    },
    {
      "rating": "10",
      "text": "Without a doubt, the best Batman movie ever made. I'm a huge fan of Keaton and the Burton films, but I simple cannot deny how perfect this film was. Batman Begins trumps The Dark Knight in every way imaginable."
    },
    {
      "rating": "8",
      "text": "Not quite up to The Dark Knight, in my opinion but still a good achievement for Nolan. The days of the dark and adult Batman were fully realised in this first adaptation by Nolan. Despite its darker element this move compared with its sequel is much more comic book orientated. But don't be put off by this, it is full of universal meanings and imagery that we can all relate to."
    },
    {
      "rating": "9",
      "text": "This is the first  true batman movie from the comics; and none of this tim burton/ george clooney zany nonsense that isn't really batman: Criminals are supposed to fear him not laugh at him. Also loved the inclusion of some of the more inconspicuos villans too (scarecrow and raz al ghul)"
    },
    {
      "rating": "9",
      "text": "A bold and stunning achievment from Christopher Nolan and Christian Bale who triumph where many have failed; a Batman film where Batman is the most interesting character on screen. It's a story which is a little slow but never boring and Bruce Wayne's decision to don a costume and become Batman is believable. Outstandingly cast with great performances from Liam Neeson, Michael Caine and Morgan Freeman, however it is Christian Bale who thrives above the rest. Nolan is perhaps a little too shaky with the action but his handling of the characters and drama is perfect. Arguably the best comic book film of all time."
    },
    {
      "rating": "8",
      "text": "Pretty good for the most part. I think Scarecrow was a poor choice of a villian, Although it worked well plot wise - He just wasnt that good. Other then that it was a good film, Probably the best Batman film (yes even better then The Dark Knight)."
    },
    {
      "rating": "9",
      "text": "Batman Begins is the better Batman movie, but The Dark Knight is the better movie. That's my honest condensed opinion, I own both movies on blu ray and recommend them to just about anyone."
    },
    {
      "rating": "9",
      "text": "This movie is one of the best Batman movies out there, it's good because it's surprisingly really realistic but still has it's classic comic book logic, the acting was great, as was the story, it's also darker than previous movies so the people who were upset with Batman and Robins lighter take on Batman, it's a great movie from beginning to end and a must see for Batman fans."
    },
    {
      "rating": "9",
      "text": "Batman Begins is the perfect start for Christopher Nolan's more cerebral take on the DC legend. It balances a more realistic approach, while still maintaining enough of a comic book sensibility to remain true to it's roots. The movie is well written and acted, with tons of memorable scenes. Although the fisticuffs never quite measure up to the dialogue, Batman Begins is actually a bit more exciting in the action department than it's much-lauded sequel The Dark Knight.  Although it doesn't quite match it's aforementioned successor in overall quality, it's still a great reboot and a great film."
    },
    {
      "rating": "9",
      "text": "The second best superhero movie of all time(so far) Because of this film i am a batman fan. Iim batman!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "rating": "7",
      "text": "It's just a Batman movie."
    },
    {
      "rating": "9",
      "text": "Fantastic. Christopher Nolan and David S. Goyer really nailed this one. You couldn't get a better Batman origin story if you asked Frank Miller to write it. (I'm looking at you, Batman: Year One. I love that graphic novel, but this film borrows from it, while incorporating other Batman characters and improving upon it.)"
    },
    {
      "rating": "8",
      "text": "Batman Begins is the first of the Batman trilogy as created by Chris Nolan.  It's the first film in Batman history that investigates the psyche behind the Bat himself. It's a great preview for things to come but at this juncture, the film has a jarring tonal shift right in the middle. Started of as a psychological study, before succumbing to the usual super hero blockbuster template. Of course, all this exposition pays off in its next installment, The Dark Knight, but fans might need to take a look at this one again, as The Dark Knight Rises essentially concludes the story thread stared in this one."
    },
    {
      "rating": "8",
      "text": "Batman Begins has given us a new perception of what a super hero can achieve in the cinema. Has become a comic book superhero in a dark thriller that manages to take advantage of important elements such as a good plot and good writing. Christopher Nolan proves his talent again."
    },
    {
      "rating": "10",
      "text": "\"Batman Begins\" is undoubtedly one of the best films of the decade. The acting is superb, the music is carefully and artfully crafted into the film (at one point in the film an alarm is sounding in sync with the score), and while the whole film can be taken very seriously, it just as entertaining as a superhero film should be. There is enough drama and characterization to make the action worthwhile, and enough suspense and buildup to keep you in your seat for the whole ride. This film's job is to take a flesh-and-blood human being with no superpowers and turn him into a superhero, and it does just that. To sum it up, \"Batman Begins\" earns the respect it deserves."
    },
    {
      "rating": "10",
      "text": "What Nolan did here is something incredible; not only did he resurrect a then-dead franchise name, but he catapulted everybody's opinion of Batman to a more serious level. By using his Memento-style Non-linear storytelling techniques, beautiful cinematography, and insanely witty and provocative dialogue, Nolan created the most captivating superhero yarn to date. Christian Bale is almost objectively the best Batman actor. I've never seen any of the other Batman actors put as much effort into this role as Bale has. He really, and truly lifted this role off the proverbial page and he successfully managed to encapsulate the Batman/Bruce Wayne that Bob Kane and Bill Finger created. Every other actor in this movie is fantastic as well. Morgan Freeman, Liam Neeson, Michael Caine, Gary Oldman all comprise the amazing supporting cast. On a personal note, the film also possesses has one of my favorite scores too. Hans Zimmer and James Newton Howard really did something out of the box for this film, but they also did something quite beautiful and appropriate. Overall, this movie is one of the most influential movies I have ever seen. It managed to portray every aspect of Batman's origin to a tee. Truly, a masterpiece."
    },
    {
      "rating": "10",
      "text": "The best origin story I've seen. Very gritty and raw. Kudos to the Nolan brothers for a fabulous script and direction. The score kept the tempo running. Even given the breakneck pace, the main character developed constantly. The notion of fear is used to perfection. I especially liked the ideas of justice and vengeance, and the line that separates them, clashed against each other. Caine, Morgan and Oldman delivered stellar performances, not to mention Bale. My favourite batman film, including the sequels. I can't think of a single thing I would change about the movie. Sadly, I cannot say the same about the sequels. This one had the background, build-up, character development and action in the right proportions. It felt like a movie that was about Batman. The Dark Knight felt like it was about Joker. Rises concerned itself with uprisings and counter uprisings. Both would have worked better if the character of Batman was explored more instead of just reacting to the whims of the villains."
    },
    {
      "rating": "9",
      "text": "Finally, a Batman film that is actually good. After the miserable fail of Batman and Robin, this is an amazing film showing Batman in a more realistic sense, (even though a guy dressing up as a bat and beating up criminals is not). NOLAN! NOLAN! NOLAN!"
    },
    {
      "rating": "9",
      "text": "Nolan brings a fully realised and compelling Gotham to the big screen without resorting to the camp or ridiculous. Faithful to the finest comics, Batman Begins is the first live action film worthy of the Dark Knight."
    },
    {
      "rating": "9",
      "text": "The first part in the greatest trilogy of all time. Christopher Nolan makes not only a great Batman film but a great crime drama.  Anytime we see our favorite comic book characters in a more realistic and gritty way you have Nolan to thank for that."
    },
    {
      "rating": "10",
      "text": "The best origin story to date. Batman Begins brings the beginning of Batman to a complex and philosophical scale. The \"becoming a symbol\" concept is genius. its one of the most interesting ideas in a movie. They really suck us in to the story the we take with Bruce Wayne as he becomes legend. LIke Wall-e the first half of this movie was utter brilliance. While the second half does drop in quality compared to the first half, the second half still isn't bad. I would completely recommend it to any movie goer."
    },
    {
      "rating": "9",
      "text": "Not quite as fantastic as The Dark Knight but better that Rises, Begins is a fanatastic film. While its not as loud as its sequels, it is also better in many ways. Great beginning to one of the best film series of all time. It does a great job of setting up its characters before a terrific finish. Great acting, escpecially from Bale, Caine, Neeson etc."
    },
    {
      "rating": "9",
      "text": "This movie breathed new life into a movie franchise that was declared dead by many due to the 1997 movie Batman and Robin. Christopher Nolan returns the Batman live action films to the darker/grittier tone that was started by Tim Burton. I can easily recommend this movie to fans of Batman."
    },
    {
      "rating": "8",
      "text": "Ominous and intense, Batman Begins is terrific entertainment that takes a dark twist on the Batman origin story. Christian Bale is perfectly cast as Bruce Wayne, delivering the chilling nature expected from the superhero."
    },
    {
      "rating": "9",
      "text": "This movie revived the whole Batman thing for me. It had really good acting and directing. It was a much darker version of what the original Batman's have ever done. It had a more realistic vision of a superhero. It has its plot holes, as every Nolan movie does, but I like them nonetheless."
    },
    {
      "rating": "9",
      "text": "under the direction and screenwriter Christopher Nolan and David S. Goyer worked better adaptation in the origin of a superhero  A story very well built and full of actors who together seamlessly in their roles (say, passing the great Michael Caine  Gary Oldman   But the Principal was the responsibility of the actor  A  American Psycho  Christian Bale  who brought a new approach to Batman  the best of all   The focus of the film is the origin of the hero and a journey of self discovery. The soundtrack this a show piece, straight home, with scenes of drama  action and she also manages to inspire the viewer  The city of Gotham has been very little explored and the parts that give some prominence was badly photographed and design very unrealistic  the rails of the station  the tower Wayne  and dismissive aa proposal realistic film. It is the simplest of the whole trilogy, but that does not mean he is the weakest negative! Turns out to charm the most in this great work"
    },
    {
      "rating": "10",
      "text": "Until The Dark Knight came along, this was the best superhero movie that I'd ever seen.  Nolan took the genre in a completely new and dark direction and everyone else followed.  This was a landmark film."
    },
    {
      "rating": "9",
      "text": "A great, great origin story for one of the coolest comic book characters of all time. I was really confused when I saw it at first when I was younger but when I watch it today, I have so much more respect for it. Christopher Nolan took so much inspiration from comics like Batman: Year One and he incorporated that in this movie. He didn't straight up adapt one single comic book, he took bits and parts from a ton of batman comic books and combined it into one. And if you really pay attention, they mention Victor Zsasz and Commissioner Loeb who were both minor characters in the Batman universe. It was great to hear them mentioned in this movie and other Dark Knight movies. It really showed how much respect and trust I have for Christopher Nolan. He really does know exactly what he is doing and wants with these movies. In the movie, I really liked how stealthy Batman was when he was out fighting crime. It made sense because Batman is a very dark and stealthy character so it was actually really intense to see him take down all of these henchman at once. It was surprise because it actually reminded me of such movies like Alien because of how suspenseful it was. When one of the henchman looks up and he sees  batman literally pounce on him is a lot like how the Alien in Alien took down the people on the ship. Also, a great choice for a villain. Since the scarecrow was a bit of an unconventional villain for batman, it had a lot of people scratching their heads but it was a great choice. In this movie, Bruce Wayne was dealing with his fear of bats so the scarecrow a huge challenge because he had to overcome his fears in order to defeat the scarecrow. It was a very clever choice for a villain and I really enjoyed it. If you haven't seen Batman Begins then you are missing out. It is a very rare film that can stand alone as a single movie without any sequels. But those other movies are pretty great too but I'm not talking about that."
    },
    {
      "rating": "10",
      "text": "I love this movie. It focuses so much on the story and why Batman is what he is. He's not just some silly persona in a goofy-looking costume; there's so much more to it than that. With the fight scenes, it doesn't just show Batman's brute strength, but rather his brain-power and how he can handle a situation. If you're a Batman fan and haven't seen this movie, I highly recommend it."
    },
    {
      "rating": "8",
      "text": "Christopher Nolan succeeds in this nimble super-hero movie as he brings likable characters back to life and one of the best adapted stories into the cinema."
    },
    {
      "rating": "9",
      "text": "An in depth look into an amazing superhero! brings batman back! this movie is fantastic! i urge it to be seen by all! LOOOOOOOOOOOOOOOOOOOOOOOOVVVVVVVVVVVVEEEEEEEEEEEEEEE IT"
    },
    {
      "rating": "8",
      "text": "Gone are the campy cartoon versions of the superhero defined by Burton and Schumacher, as Christopher Nolan introduces the most intriguing, most intelligent and most moving Batman story to date. Bale is excellent, Cillian Murphy is most underrated, and the film is a dramatic and action-packed thrill-ride from beginning to end."
    },
    {
      "rating": "10",
      "text": "Batman Begins is more than just a superhero movie, it is the superhero movie. Batman is one memorable, deep and emotional character who adapts justice and defends the poor."
    },
    {
      "rating": "10",
      "text": "Con Batman Begins, Nolan se hizo mucho mas grande y el género de los superhéroes tenía una nueva referencia. El reparto esta escogido de forma magistral, la historia es mucho mas humana, ahora Batman ya no es un héroe de cómic para niños, es algo mas. Esta primera parte de la trilogía ya es perfecta, pero lo mejor aun estaba por llegar..."
    }
  ]
}