{
  "id": 160,
  "title": "Wild Tales",
  "starring": [
    "Ricardo Darín",
    "Leonardo Sbaraglia"
  ],
  "runtime": 122,
  "genre": [
    "Drama",
    "Thriller",
    "Comedy"
  ],
  "description": "Six deadly stories that explore the extremities of human behaviour involving distressed people seeking revenge.",
  "year": "2014",
  "rating": "R",
  "imageUrl": "https://image.tmdb.org/t/p/w500/pvSty5MCAxdj8LlAEXCDfM1YNOl.jpg",
  "reviews": [
    {
      "rating": "10",
      "text": "This is a seriously brilliant movie. Several characters throughout become unhinged in the most logical and entertaining ways. Its a movie with highly intelligent people acting in purely emotional ways and everything just feels right. Major kudos to the director for pulling this off. Go see it immediately."
    },
    {
      "rating": "10",
      "text": "It feels very imaginative and almost crazy but at the same time very real and sympathetic. It holds beautiful images, filming, acting and stories and develops easily and effortlessly. By far one of the best Argentinian movies."
    },
    {
      "rating": "10",
      "text": "\"Wild Tales\" is a multi-storied vehicle written and directed by Damian Szifron. One of the nominees for Best Foreign Film, and deservedly so, the film consists of 6 independent stories threaded together by the theme of revenge and retribution. From the tale of an angry lover whose mate has been unfaithful to the story of  a citizen frustrated by government corruption and  four other stories in between, these are tales woven together by a masterful story teller in the person of Senor Szifron. Superbly acted, photographed, written and directed, this film stands out as one of the most enjoyable theatrical experiences this viewer has had the pleasure of being part of in a long long time. It is no easy feat to be able to tie so many individual tales in such a way that the viewer never feels he or she is watching separate films but, instead, one large overview of the human condition and how we each cope with the circumstances that befall us. I give the film a 10 4 s and urge all who can to make it a must-see on their movie list.."
    },
    {
      "rating": "8",
      "text": "With Pedro Almodóvar’s name credited manifestly as one of the producers, viewers will not be too surprised that this portmanteau film from Argentinian director/writer Damián Szifrón is ripe with Almodóvaresque touch - six short, surreal, dark comedies, (most of them are) deeply rooted in the injustice presented in the current Argentinian society (however, it can be feasibly comprehended elsewhere since the situations are all the same), with a recurrent theme of vengeance flows through all of its components, as the pre-credit prologue named “Pasternak” glaringly sets the tone from an all-inclusive reprisal from an unknown man towards every single person who mistreats him in his life, it is absurdly implausible to effectuate such a scheme (too many variations are involved), but as the opening gambit and the shortest one, it effectively kick-starts the film with an offbeat grin beckons an unconventional wild-ride sinisterly awaits the audience, also it tells us revenge has no mercy at all.\r to keep reading my review, check on my blog, google: cinema omnivore, thanks!"
    },
    {
      "rating": "8",
      "text": "I had read a lot about this film, and even with subtitles it was an extremely enjoyable, fast-paced, funny film. I didn’t like all the “tales” equally, but they all held my interest and made me laugh, regardless of the cruelty inflicted in some of them as people went wildly out of control. The subjects satirized were contemporary and apparently are common to everyone all over the world – and these situations were not as trivial and juvenile as in many American comedies, which seem to be mainly about hangovers and acting stupidly. In this film, people made fools of themselves for good reason, even if, of course, their reactions were just a bit exaggerated. The comic acting was great."
    },
    {
      "rating": "7",
      "text": "Szifron's Wild Tales is a colorful collection of six short stories- best when they show the worst of the human condition. Hitchcockian horror and humor with O. Henry's ironic twist endings and a touch of Almodovar - seamlessly collide - with themes of revenge , road rage and romance. The opening and closing are super - the middle sags- especially the \"falling down\" segment. Never ever wanting to hear or even mention last year's oscar winning song - again - Let It Go kept running through my head during this it'a mad mad mad mad world romp."
    },
    {
      "rating": "9",
      "text": "I intentionally went into this movie knowing next-to-nothing about it--I had seen one trailer without English subtitles, and that was in.  I was completely floored by the originality of the movie, both its format and its stories themselves.  It's arranged into a series of short stories centred around a small number of characters, and they're all these gorgeous little morality plays.  The stories tend to start with a perfectly normal scene and set of events--small talk between two strangers on a plane, or a man buying a birthday cake--and some kind of twist happens to take it into the unexpected, to make the tale wild, as the title suggests., as some normal situation gets completely out of hand.  Some stories have several twists to keep you guessing.  There are so many amazing moments of tension and surprise, sometimes funny and sometimes just so shocking that you have to laugh.  A wonderful, hilarious, and incredibly fun and original movie."
    },
    {
      "rating": "10",
      "text": "One of the best movies not only of the year, but one of the best films I have seen in my life. Super funny, but it also touches on serious subjects. Great film."
    },
    {
      "rating": "6",
      "text": "This movie was an Oscar contender in a foreign language category.\rIt is somewhat an unusual tragicomedy, where people die and it's amusing   It is a social satire consisting of several unconnected novellas, some are more serious than others.\rSituations are intentionally surreal to underscore the absurdity that we see too often in our lives.\rI would give it another name: \"Revenge\", because it's all about getting even.\rGood piece of entertainment. In Spanish with English subtitles."
    },
    {
      "rating": "7",
      "text": "This collection of six short stories is generally very entertaining but stops short of being truly great due to a couple of the longer instalments (number 4 and 5) over indulging their content. The first 2 stories are really short. The first set on a plane is frighteningly topical, unintentionally echoing events surrounding the recent tragedy in the French Alps. All the tales are about revenge of some sort or another and whilst the film is not often laugh out loud funny there is definitely a rich vein of black humour coursing through its veins. The best of the episodes involves two drivers who get caught up in violence and death following a road rage encounter. This story is very humorous and yet contains a lot of tension. It is undoubtedly the highlight. The last tale concerns a bride and groom who come to blows at their own wedding reception. This episode is also very successful at combining drama with black comedy and despite the story’s arc, which could have come over as really contrived, the episode works marvellously. There is a great use of music throughout and were it not for the over indulgent ‘Falling Down’ sequence and the least entertaining ‘Hit and Run’ episode, these original tales would be worth an 8 of anyone’s ratings."
    },
    {
      "rating": "1",
      "text": "Vi esta mierda en el cine una vez terminada la película salí insultado, me pareció la peor mierda que vi en toda mi vida, esta basura es muy simple me enojo rompo algo y listo fin del relato, no te desarrolla nada. Es lo mismo que ver el noticiero. Soy Argentino y me parece una vergüenza esta película."
    },
    {
      "rating": "9",
      "text": "A wonderfully madcap, perverse, and riotous movie. We saw it just after the Plane crash in the alps so the opening story didn't work well. Too much like DejaVu. After that though it kept up a brisk pace, and each story was completely different, ending with one that went on a tad too long. It reminded me of a much more gritty version of \"Kind Hearts and Coronets,\" with it's droll look at revenge."
    },
    {
      "rating": "9",
      "text": "This collection of 6 stories from Argentina looks at the dark side of people: revenge gets carried away, the rich try to avoid fate and jealousy ruins a wedding. The characters are interesting and the situations are inventive. Each one of them is creative enough to have been developed into a full-length movie, but the abbreviated length, robust pace and imaginative direction keep make one immensely entertaining. My favorite was the conflict between the Audi driver and the \"redneck\" (wickedly dark with a delightful ending)."
    },
    {
      "rating": "10",
      "text": "This movie is hilarious in a very dark way about extreme human behavior! It's hard to say which story showed the worst in people, but they all had a grain of truth."
    },
    {
      "rating": "10",
      "text": "Unpredictable, hilarious and extremely relevant! This is one of the best movies EVER made in history. Every story is so well acted and directed in a way that it is impossible not to relate to at least one of them, and to truly understand the pains that each character goes through. It is a movie that deals with very delicate and serious issues, but they are presented in such an unpredictable manner that it is impossible not to laugh, making it a perfect tragicomedy."
    },
    {
      "rating": "10",
      "text": "This movie is fantabulous! It's chaotic and consistently funny. The anthology consists of 6 wild tales of vengeance that are thematically similar but have different narratives. All the tales serve a purpose to the overall theme of the film and they never overstay their welcome. I was hooked from the audacious opening scene of people boarding a plane and noticing that something has gone terribly wrong; if you've seen the film you will know what I'm talking about. My favorite tale has to be the road rage bit because it escalates so quickly and it was edge of your seat entertainment. My second favorite is the last tale that takes place at a wedding; it starts off cheerful then takes a left turn and becomes the most memorable wedding. This style of film making should be encouraged because in modern cinema people won't appreciate a movie because it takes too long to build up or most viewers will not have the patience to sit through a thought provoking, slow paced film. This anthology is the answer. Avid film watchers will adore this movie while the casual movie goer will be pleasantly surprised. It's not perfect but it's a wildly entertaining movie."
    },
    {
      "rating": "9",
      "text": "This anthology of six tales of unbridled revenge delivers huge laughs while providing ample food for thought about injustice and inequality. Five of the six tales are raucously funny, while the sixth is far more serious in tone, creating something of a disconnect with its companion pieces, despite its thematic link to the others. This picture is definitely not for the squeamish or overly sensitive. But those who appreciate the sensations that come from getting screwed and getting even and who understand that karma really is a **** will no doubt find this offering a cinematic gem."
    },
    {
      "rating": "8",
      "text": "A home-run. The 122 minutes fly by. The film has amazing energy. Has some violent bits and it's not consistently funny. Interesting how the different stories are put together. You will leave the cinema with some of that energy. Bold and memorable."
    },
    {
      "rating": "8",
      "text": "I would give this a 9 for entertainment except for the fact that it is not a movie but rather a series of vignettes, united, not so much by the theme of revenge as simply the very familiar misbehavior of people out of control.  The tales are frequently over the top, but then so is real life."
    },
    {
      "rating": "9",
      "text": "Чёрная комедия.Каждая последующая история круче прошлой, в фильме даже можно найти смысл, а может это только я его нашёл. Итог: Интересные, забавные и порой эпичные короткометражки, которые все вместе смотрятся на одном дыхании."
    },
    {
      "rating": "7",
      "text": "\"We can all lose control.\"  What a wild ride!  This film of short films definitely lives up to its title.  Ever wonder what would happen if you had just...?  Well, this film follows through in some of those areas that normally never leave the realm of our thoughts."
    },
    {
      "rating": "9",
      "text": "WILD TALES ( 2015 ) : THE FILM IS APTLY TITLED\r Movie Review\rForgive me if you have already seen this movie .This Argentine - Spanish film directed by Argentine director Damian Szifron is a dramedy movie.It is an anthology film consisting of six different short films.The humour worked out here is none other than dark humour.\r The six short films aren't connected as such but the basic themes of all these short films may seem connected and these themes can be depicted as  about \" getting lose control \" or about \" an act of vengeance \" or about  underlining the motto  '' time doesn't heal all ''.This is also a story about injustice , inequality and human emotions like love , jealous and rivalries.It is up to the viewers to analyze each short film .I can assure you that  these satires are not only connected by dark and explosive humour but they are thoughtful too.\r Superb casting and engaging music were the other positive factors which made this film one hell of an experience.Academy award winner Gustavo Santaolalla is the music director.\r For those who are obsessive about ratings and awards , this film has got a rating of 95%  ' fresh ' in Rotten Tomatoes  and a rating of 77 % in Metacritic at present.This film was nominated for \" Best Foreign Film \" category in 87th Academy Awards.\r The film is aptly titled \" Wild Tales \" .The director finds pleasure in telling stories which aren't ordinary and the characters behave exactly like wild animals in some of these stories.I wouldn't mind recommending this movie and branding it as a \" must watch \" one.\r http://anoopjoseph90.blogspot.in/2015/05/wild-tales-2015-film-is-aptly-titled.html"
    },
    {
      "rating": "8",
      "text": "A film made in Argentina , which is six short stories of six people that their lives are linked of madness and anger of the situation presented to them, and ultimately end in death, but it ends up being interesting with each account shown in this hilarious and interesting movie."
    },
    {
      "rating": "9",
      "text": "Sensacional comedia negra, hace rato que no me reía tanto con una película, en especial con el episodio: ''Hasta que la muerte nos separe''. Totalmente recomendable"
    },
    {
      "rating": "9",
      "text": "Muy buena película y un orgullo nacional argentino. Excelentes todos los relatos y los actores lo hicieron de maravilla."
    },
    {
      "rating": "8",
      "text": "Kind of a Twilight Zone package of 6 mini episodes.  Well photographed, very well made.  good acting and editing.  Apparently very popular as well, the director is next making a 6 billion dollar man movie with Mark Wahlberg."
    },
    {
      "rating": "10",
      "text": "Wild Tales is a incredible movie with your six stories reflectives and acid humor.the actors are very good,especially Ricardo Darín and a extremely competent director Damián Szifron."
    },
    {
      "rating": "7",
      "text": "I was late to see this film because at first glance it did not call my attention, now I regret it, however it is worth correcting the mistakes and without a doubt Wild Stories lives through the expectation. Excellent cohesive work despite its idea, but above all fun and entertaining.Recommendable."
    },
    {
      "rating": "10",
      "text": "10/10would watch again...................................................................................................."
    },
    {
      "rating": "8",
      "text": "Really great concept of the movie. Strange, wild, insane and great in the same time. Worth to watch."
    },
    {
      "rating": "10",
      "text": "Embora as histórias de “Contos Selvagens” sejam engenhocas habilidosas, Szifron tem o cuidado de fundamentar as mudanças extremas de cada conto em detalhes específicos do personagem. O filme raramente, ou nunca, parece mecânico. Em vez disso, você pode se surpreender com a fertilidade de uma imaginação que poderia se permitir lançar tantos personagens e histórias vivas - o suficiente para fornecer quatro ou cinco filmes - em um pacote generoso."
    }
  ]
}